[
  {
    "source": "Cointelegraph",
    "date": "2024-02-05T21:51:30.000Z",
    "title": " Bitcoin drives digital asset market gains as Grayscale selloff slows ",
    "url": "https://cointelegraph.com/news/bitcoin-drives-digital-asset-market-gains-grayscale-selloff-slows",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZDEyYWNjYzQtOTljYS00MDZkLWI0N2YtZTI0NTA4MTljZWUwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The market has made a big shift in the last two weeks, from nearly $500 million going out to $708 million coming in, according to CoinShares.</p>\n                    <p><p>The digital assets market grew during the week that began on Jan. 29, with global digital assets under management reaching $53 billion. The gains were largely due to investments in Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), according to alternative asset manager CoinShares. </p><p>Inflow into the digital asset market amounted to $708 million in the week, with $703 million of that amount moving in the United States. This compares with a $499.7 million total outflow during the week of Jan. 22. BTC accounted for 99% of all market inflows during the week of Jan. 29, totaling $703 million, compared to a BTC outflow of $5.3 million.</p><p>Inflows into all exchange-traded products came to $8.2 billion, down from $10.6 billion in the previous week. The United States saw the most action, with $721 million coming in. That figure compared favorably with the previous week’s $408.8 million U.S. outflow.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-drives-digital-asset-market-gains-grayscale-selloff-slows\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-05T22:00:34.000Z",
    "title": "Former Terraform Labs Financial Officer Has Been Extradited to South Korea — Montenegro Police",
    "url": "https://news.bitcoin.com/former-terraform-labs-financial-officer-has-been-extradited-to-south-korea-montenegro-police/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2366798141-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2366798141-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2366798141-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2366798141-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2366798141-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2366798141-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2366798141-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/shutterstock_2366798141.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Montenegro recently extradited the former Terraform Labs financial officer Han Chang-joon to South Korea where he faces fraud-related charges. According to the Montenegro police, the decision to extradite Han was made by the country&#8217;s Justice Ministry. Han Faces Criminal Charges in South Korea Han Chang-joon, the former financial officer of Terraform Labs, has been extradited [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T21:50:32.000Z",
    "title": "Cryptocurrency exchange Binance addresses Ronin listing controversy",
    "url": "https://www.cryptopolitan.com/cryptocurrency-exchange-binance-addresses/",
    "description": "Yi He, co-founder of Binance, the world&#8217;s leading cryptocurrency exchange, has responded to concerns surrounding the recent listing of Ronin on the platform. The listing was marred by a sudden price drop that raised suspicions of information leaks within the company.&#160; In an official statement, Yi acknowledged the occasional controversy surrounding information leaks related to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T21:45:07.000Z",
    "title": "Trillions of dollars potentially flow into the XRP market with real-world asset tokenization",
    "url": "https://www.cryptopolitan.com/dollars-potentially-flow-into-the-xrp/",
    "description": "Prominent XRP community members and industry experts envision a future where the XRP blockchain becomes the leading platform for tokenizing real-world assets (RWA), potentially bringing trillions of dollars into the market. XRPL&#8217;s potential in RWA tokenization In a recent development, David Schwartz, Ripple&#8217;s Chief Technology Officer (CTO), highlighted the potential of the XRP Ledger (XRPL) [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-05T22:00:27.000Z",
    "title": "Chainlink Breakout: LINK Poised For 38% Rally If It Clears This Key Resistance",
    "url": "https://www.newsbtc.com/chainlink-news/chainlink-breakout-link-poised-for-38-rally-if-it-clears-this-key-resistance/",
    "description": "Decentralized oracle network Chainlink (LINK) has been making significant strides in the altcoin market, outperforming its peers with an impressive 44.8% price increase over the past 30 days.  Surging to a 24-month high, the cryptocurrency has inched closer to the $20 mark, attracting the attention of bullish investors. Notably, the uptrend for LINK may be far from over, as it can potentially record a substantial 38% price gain by breaking through a critical resistance level. Chainlink Trading Volume Skyrockets Crypto analyst Ali Martinez indicates that Chainlink faces formidable resistance between its current trading price of $19.40 and $20.03, with 5,330 addresses collectively holding over 8.59 million LINK.  Despite this supply wall, if Chainlink manages to break through, Ali Martinez suggests that the next critical resistance level stands at $26.87, presenting an opportunity for a significant 38% price surge. Related Reading: XRP Price Retreats To $0.50 As Whale Unloads 30 Million Tokens – Details Adding to the positive outlook, Chainlink has witnessed a surge in trading volume and an increase in circulating market cap over the past few days.  Data from Token Terminal reveals that while Chainlink&#8217;s trading volume has steadily risen over the past 30 days, the token experienced exceptional trading volume of over $9.5 billion in the past three days alone. This surge in trading activity suggests a growing interest from investors in the Chainlink protocol. Examining the circulating market cap, Token Terminal data highlights a positive trend. The circulating market cap of Chainlink stands at $10.53 billion, displaying a notable increase of 32.66% over the past 30 days. In terms of fully diluted market cap, Chainlink records $18.16 billion, indicating a substantial rise of 28.89% over the same period. Institutional Interest In LINK? Recent blockchain data suggests that institutional investors are actively accumulating LINK. According to Spot On Chain data, the emergence of eight wallets withdrawing a substantial amount of LINK tokens, coupled with a price surge shortly after, indicates institutional interest in the cryptocurrency.  Over the past twelve hours, eight new wallets, likely representing a single individual or institution, have collectively withdrawn 227,350 LINK tokens, equivalent to approximately $4.12 million at the withdrawal time.  Notably, a significant portion of these tokens was withdrawn from centralized exchanges (CEX) just before the price experienced a sudden increase of approximately 4.1%. This pattern suggests that institutions may strategically accumulate LINK tokens, anticipating future price appreciation. Related Reading: Ethereum Rally: Crypto Analysts Outline 3 Key Drivers For Price Moreover, as indicated by its performance on the algorithmic market scanner Commando, LINK has consistently been a top performer in the cryptocurrency market.  According to the market intelligence platform Decentrader, with a current score of 1.83 and a green signal on low time frames, Chainlink&#8217;s technical analysis suggests a positive outlook for the cryptocurrency. Noteworthy is the recent breakthrough of Chainlink&#8217;s price from a range held up by the 200-week moving average (200WMA).  This breakout indicates a shift in market sentiment and a potential upward trend. The cryptocurrency is now aiming to target the “Sniper resistance” level just above $20 while finding support at the top of the previous range, around $16.8, according to Decentrader.  Overall, institutions&#8217; accumulation of Chainlink tokens and the cryptocurrency&#8217;s technical breakout point to growing confidence in LINK&#8217;s investment potential.  The withdrawals from centralized exchanges suggest a desire to hold LINK tokens outside exchange custody, possibly indicating a longer-term investment strategy.  Currently, LINK is trading at $19.7, up 8% in the last 24 hours. Featured image from Shutterstock, chart from TradingView.com"
  }
]