[
  {
    "source": "CryptoSlate",
    "date": "2023-09-14T21:00:28.000Z",
    "title": "Oil prices have surged 55% during Jerome Powell’s tenure as Fed Chair",
    "url": "https://cryptoslate.com/insights/oil-prices-have-surged-55-during-jerome-powells-tenure-as-fed-chair/",
    "description": "<p>Quick Take WTI Crude oil is currently hovering around the $90 a barrel mark, with Brent crude oil reaching as high as $93 a barrel. This escalation, if sustained, is likely to exert additional inflationary pressure on global central banks. Under the stewardship of Jerome Powell, the Federal Reserve has witnessed a 55% surge in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/oil-prices-have-surged-55-during-jerome-powells-tenure-as-fed-chair/\">Oil prices have surged 55% during Jerome Powell&#8217;s tenure as Fed Chair</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T20:41:38.000Z",
    "title": "Here are the 3 drivers that hold the future of crypto in the United States ",
    "url": "https://www.cryptopolitan.com/3-drivers-holding-crypto-future-in-the-usa/",
    "description": "One of the most pertinent questions around crypto assets is, will these digital assets still be around in the future? Will the assets ever amount to something, or will regulation finally push them offshore? For most crypto enthusiasts, the technology is here to stay. However, there are still more questions than answers, even as investors ... <a title=\"Here are the 3 drivers that hold the future of crypto in the United States \" class=\"read-more\" href=\"https://www.cryptopolitan.com/3-drivers-holding-crypto-future-in-the-usa/\" aria-label=\"More on Here are the 3 drivers that hold the future of crypto in the United States \">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-14T20:42:29.000Z",
    "title": "R3 downsizing, lays off 20% of staff citing economic challenges",
    "url": "https://crypto.news/r3-downsizing-lays-off-20-of-staff-citing-economic-challenges/",
    "description": "R3, a New York-based blockchain enterprise, slashes its workforce by over 20% in a strategic move to conserve resources"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-14T21:00:28.000Z",
    "title": "Binance.US Plagued By Staff Exodus: Legal And Risk Executives Abandon Ship",
    "url": "https://www.newsbtc.com/binance/binance-us-plagued-by-staff-exodus-legal-and-risk-executives-abandon-ship/",
    "description": "In recent developments, Binance.US, the American affiliate of cryptocurrency giant Binance, is engulfed in a storm of legal challenges and a wave of executive departures.  Related Reading: Ethereum Leverage Ratio Is Rising, What Does It Mean? Binance.US Rocked By Legal Woes And Executive Exodus As regulatory scrutiny intensifies, key risk and legal executives have chosen to part ways with the company, adding to the growing list of personnel changes within its ranks. Following this trend, according to a Wall Street Journal report, Krishna Juvvadi, the head of legal, and Sidney Majalya, the chief risk officer, have also decided to leave Binance.US.  These departures come in the wake of CEO Brian Shroder&#8217;s recent exit, further exacerbating the leadership vacuum at the company. Earlier this week, Binance.US announced the departure of CEO Brian Shroder and disclosed plans to reduce its workforce by approximately one-third, amounting to over 100 job cuts.  These moves underscore the operational challenges faced by the company following legal action taken against it by the US Securities and Exchange Commission (SEC) and the Department of Justice (DOJ) Norman Reed, the general counsel who joined Binance.US in December 2021, will serve as the interim CEO, taking over from Shroder. However, Binance.US has not provided any specific reasons for Shroder&#8217;s departure. The legal troubles for Binance and its subsidiaries intensified when the US SEC filed a civil complaint in June. The complaint accuses Binance and its founder, Changpeng Zhao, of creating Binance.US as part of a deceptive scheme to evade US securities laws designed to protect American investors. While Binance and Binance.US maintain that they operate separately, the legal challenges faced by the global exchange have had a ripple effect across its affiliated entities.  The departure of key executives, including Mayur Kamat, the global head of product, and Patrick Hillmann, the chief strategy officer, further underscores the turbulent environment within the company. As the departures of high-ranking executives continue to disrupt Binance.US, the firm&#8217;s spokesperson has emphasized the need to ensure uninterrupted customer service while operating as a crypto-only exchange.  Nevertheless, the ongoing legal battles and the departure of experienced leaders present significant challenges for Binance.US as it seeks to navigate the complex regulatory landscape and regain stability. Related Reading: FTX’s Billion-Dollar Solana Liquidation: Market Crash Or Just Hype? Binance.US will have to address the legal allegations against it and make strategic decisions to rebuild its leadership team, strengthen compliance measures, and restore trust among regulators, investors, and users. The outcome of these efforts will undoubtedly shape the future trajectory of the exchange and its ability to operate within the highly regulated US crypto market. Despite the recent news, Binance Coin (BNB) has remained relatively unaffected and has experienced minimal impact on its price. The token has closely followed the overall market trend, exhibiting a slight uptick of 0.5% over the past 24 hours. Featured image from iStock, chart from TradingView.com"
  }
]