[
  {
    "source": "Bitcoin.com",
    "date": "2023-07-06T06:30:27.000Z",
    "title": "Report: South Africa Regulator Says Unlicensed Crypto Exchanges in 2024 May Be Closed Down",
    "url": "https://news.bitcoin.com/report-south-africa-regulator-says-unlicensed-crypto-exchanges-in-2024-may-be-closed-down/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/sa-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Report: South Africa Regulator Says Unlicensed Crypto Exchanges in 2024 May Be Closed Down\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/sa-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sa-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sa-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sa-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sa-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sa-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sa.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to the regulator of the South African financial services industry, cryptocurrency exchanges based in the country must secure operating licenses before the year ends. Crypto exchanges that fail to abide by the requirement will either be fined or closed down, Unathi Kamlana, the Financial Sector Conduct Authority commissioner, said. The Importance of Regulation The [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-06T06:25:02.000Z",
    "title": "Celsius Starts Swapping Altcoins for Bitcoin, ETH; Chainlink, Aave, Others At Risk",
    "url": "https://www.newsbtc.com/news/celsius-swaps-altcoins-bitcoin-eth-chainlink-aave-at-risk/",
    "description": "Bankrupt crypto lender Celsius Network has begun the process of swapping altcoins for Bitcoin (BTC) and Ethereum (ETH). The recent court approval (June 30) granted the company permission to convert its altcoin holdings into the two leading digital assets, raising concerns about a potential sell-off of popular altcoins. Celsius Network, known for its altcoin lending services, has been undergoing bankruptcy proceedings since July 2022 when it filed for Chapter 11 protection, revealing liabilities of up to $10 billion. The recent court ruling allows Celsius to convert its altcoins into BTC and ETH starting from July 1. LINK, AAVE And SNX Sell-Off Due To Celsius Coming? According to on-chain analysis provider Lookonchain, Celsius has been actively transferring altcoins to different wallets. Most of the altcoins have been moved to wallet address &#8220;0x4131&#8221;. Remarkably, Celsius made its first swap today. Lookonchain tweeted: Note that Celsius seems to be starting to swap altcoins for BTC and ETH. Currently: Most of the altcoins have been transferred to wallet&#8221;0x4131&#8243;. Transferred 1,393 StaFi( $rETH) to Wintermute Trading and received 1,393 $ETH.  The altcoins held by Celsius Network amount to approximately $164.5 million on the EVM chain, including: 3.16 million LINK ($19.9 million) 98,268 AAVE ($7.36 million) 2.9 million SNX ($6.2 million) 7.95 million TGBP ($5.49 million) 1,812 PAXG ($3.45 million) 12.650 BNB ($3.02 million) 3.841 million MATIC ($2.65 million) 419,899 UNI ($2.27 million) 9.25 million ZRX (2.00 million) In addition to the above, Celsius Network&#8217;s wallets also contain around $296 million worth of Bitcoin, $120 million worth of Ethereum, and approximately $100 million (in paper value) of its native token CEL. Yesterday, data from Arkham Intelligence revealed that Celsius moved around $70 million worth of altcoins and stablecoins to different wallets, including those related to crypto market maker Wintermute, crypto custodian Fireblocks, and stablecoin issuer Paxos. Related Reading: Blame The “Supermoon” If Bitcoin Crashes Or Rallies Towards $35,000 In July Today&#8217;s first swap of altcoins to Ethereum by Celsius Network raises concerns that the movements to new addresses was just the preparation for a potential sell-off for the aforementioned altcoins. LINK, AAVE and SNX could face a dump if Celsius sells these altcoins in one go, but the prices of MATIC, UNI, ZRX and BNB could also see a negative impact. It&#8217;s worth noting that while the court approval allows Celsius to convert altcoins into BTC and ETH, the exact details and timeline of the conversion process remain unclear. It is uncertain whether Celsius plans to sell all of its altcoins and in what proportion it intends to acquire BTC and ETH. Traders and investors holding the aforementioned altcoins should closely monitor market developments and prepare for possible market turbulence. Related Reading: Valkyrie Follows In BlackRock’s Footsteps, Refiles For Spot Bitcoin ETF Chainlink Price At Risk? Celsius&#8217; largest altcoin holding, Chainlink, could potentially see the most selling pressure, and the timing is conceivably bad. Just two weeks ago, the LINK price managed to climb back into the 1+ year trading range between $5.31 and $9.62. Earlier in the week, the LINK price was rejected at the 38.2% Fibonacci retracement level. A dump of Celsius could put the price in danger of falling again to the lower end of the trading range. LINK marines should therefore closely monitor the addresses by the bankrupt crypto lender. Featured image from iStock, chart from TradingView.com"
  }
]