[
  {
    "source": "CryptoSlate",
    "date": "2023-10-10T23:58:44.000Z",
    "title": "SBF Trial Day 5 – How Caroline Ellison’s testimony could become the smoking gun needed for a guilty verdict",
    "url": "https://cryptoslate.com/sbf-trial-day-5-how-caroline-ellisons-testimony-could-become-the-smoking-gun-needed-for-a-guilty-verdict/",
    "description": "<p>The fifth day of the SBF trial included testimony from Alameda Research CEO Caroline Ellison, whose testimony became a pivotal point for the case as she confessed to committing fraud under SBF&#8217;s direction. According to Ellison, SBF had instructed her to divert billions of dollars from FTX customer funds, which Alameda used for failed investments, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sbf-trial-day-5-how-caroline-ellisons-testimony-could-become-the-smoking-gun-needed-for-a-guilty-verdict/\">SBF Trial Day 5 – How Caroline Ellison&#8217;s testimony could become the smoking gun needed for a guilty verdict</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-11T00:00:15.000Z",
    "title": "Israel Police Freeze Crypto Accounts at Binance Allegedly Used by Hamas",
    "url": "https://news.bitcoin.com/israel-police-freeze-crypto-accounts-at-binance-allegedly-used-by-hamas/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/israel-police-binance-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Israel Police Freeze Crypto Accounts Held at Binance Allegedly Used by Hamas\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/israel-police-binance-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/israel-police-binance-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/israel-police-binance-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/israel-police-binance-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/israel-police-binance-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/israel-police-binance-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/israel-police-binance.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Israel Police have frozen crypto accounts held at Binance allegedly used by Hamas to collect crypto donations as tensions between Israel and Hamas escalate. In addition, the Israel Police have frozen a Hamas-linked account at Barclays Bank. Hamas-Linked Crypto Accounts at Binance Frozen The Israel Police&#8217;s official account on social media platform X announced [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-11T00:00:00.000Z",
    "title": "Is Ethereum Doomed? Whales Have Sold 12M ETH In Past Year",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-doomed-whales-sold-12m-eth-year/",
    "description": "On-chain data shows Ethereum whales have sold around 12 million in the cryptocurrency within the past year and have shown no signs of slowing down. Ethereum Whale Holdings Have Been In Constant Downtrend Since 2020 In a new post on X, analyst James V. Straten has discussed how the Bitcoin and Ethereum whales have shown some stark contrast in their behavior. Here is the chart that the analyst has shared, which compares the trends in the holdings of these humongous holders for the two assets over their entire history: How the holdings of the whales differ between the two cryptocurrencies &#124; Source: @jimmyvs24 on X For defining what a &#8220;whale&#8221; is, the analyst has chosen the 1,000 tokens cutoff for both assets. The graph shows that the holdings of the Bitcoin whales have been in an overall uptrend throughout the asset&#8217;s history. Some deviations have been from this upward trajectory, like during the 2021 bull run, where these investors participated in some profit-taking. However, such deviations have only been temporary as the whales have eventually resumed their accumulation. Related Reading: Tether Continues To Flow Into Exchanges: Why This Is Bullish For Bitcoin However, a deviation that is yet to be reversed fully is the drawdown observed around the FTX collapse in November 2022. Nonetheless, the whales have participated in some accumulation since the start of the year; more is needed to retrace the aforementioned plunge. The Bitcoin whales have seen their holdings move sideways in the past couple of years. The Ethereum whales, on the other hand, have participated in a steep selloff during the same period. Since 2020, these holders have shed 20 million ETH from their combined holdings, worth about $31.6 billion at the current exchange rate. In the past year alone, they have sold about 12 million ETH ($18.9 billion), an astonishing figure. As highlighted in the graph, the Ethereum whales showed a temporary deviation phase when they bought at the bear market lows. Nevertheless, this accumulation was quickly reversed as the indicator resumed a sharp plunge soon after. Something worth noting here is that the size of the whales isn&#8217;t the same between the two assets. Due to the difference in the prices of the coins, 1,000 tokens of each have vastly different weightages. Based on this cutoff, Bitcoin whales would hold at least $27.4 million worth of the asset, while the ETH whales hold just $1.58 million. A more fair comparison may be made by looking at the holdings of the ETH entities of comparable size to the BTC whales. As displayed in the chart below, the Ethereum whales with between 10,000 to 100,000 ETH ($15.8 million to $158 million) have shown accumulation over the years. Still, this cohort has also sold massive amounts this year. Looks like the value of the metric has sharply declined recently &#124; Source: @jimmyvs24 on X However, the mega whales on the network ($158 million+) have shown behavior more in line with the aggregate 1,000+ ETH group, as they have distributed heavily since 2020. Related Reading: $29,700 Could Be The Next Big Level To Claim For Bitcoin, Here’s Why These whales have been selling for a few years now &#124; Source: @jimmyvs24 on X Ethereum&#8217;s situation looks bleak, at least in terms of the holdings of the whales. The fact that these humongous holders have shown no signs of a turnaround so far may be the most concerning, as they lack interest in accumulating the asset. This differs greatly from the sentiment around the Bitcoin whales, who have been participating in net buying this year. ETH Price Ethereum has registered some decline recently, as the coin&#8217;s price is now retesting the same lows as back in August. ETH has been moving sideways over the past couple of months &#124; Source: ETHUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-11T00:00:47.000Z",
    "title": "Cardano (ADA) Regains Top Spot in Development Activity, According to Crypto Analytics Firm Santiment",
    "url": "https://dailyhodl.com/2023/10/10/cardano-ada-regains-top-spot-in-development-activity-according-to-crypto-analytics-firm-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/cardano-decoupling-from.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/cardano-decoupling-from.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/cardano-decoupling-from.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/cardano-decoupling-from.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/cardano-decoupling-from.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/cardano-decoupling-from.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/cardano-decoupling-from.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Blockchain analytics firm Santiment says that Ethereum (ETH) rival Cardano (ADA) just reclaimed the top spot in a ranking of development activity. According to the market intelligence platform, Cardano recorded 611.47 notable GitHub commits in the past 30 days, leading all other crypto projects. Cardano was previously behind Polkadot (DOT) and its canary test network [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/10/cardano-ada-regains-top-spot-in-development-activity-according-to-crypto-analytics-firm-santiment/\">Cardano (ADA) Regains Top Spot in Development Activity, According to Crypto Analytics Firm Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]