[
  {
    "source": "CoinDesk",
    "date": "2023-10-16T15:20:26.000Z",
    "title": "Binance to Stop Accepting New U.K. Users to Comply With Ad Rules ",
    "url": "https://www.coindesk.com/business/2023/10/16/binance-to-stop-accepting-new-uk-users-to-comply-with-ad-rules/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The firm will stop accepting new users starting Monday after U.K. regulator FCA last week restricted Binance's local partner from approving crypto ads."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-16T15:15:00.000Z",
    "title": "What is Reed’s law, and why does it matter in the crypto space?",
    "url": "https://cointelegraph.com/explained/what-is-reeds-law-and-why-does-it-matter-in-the-crypto-space",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/06efcc9c4572c995a60d8e40e3da73fb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Reed’s Law highlights exponential growth from diverse communities, crucial in crypto for innovation, DeFi and decentralized governance.</p>\n                    <p><div data-ct-widget=\"explained-block\" id=\"explained-block-118279-4\">            <h2 data-ct-widget=\"explained-block-title\">                Understanding Reed’s Law            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>The concept of network effects is extended by Reed’s Law, which was developed by Harvard professor David P. Reed in 1999 and emphasizes the importance of communities and subgroups within a network. </em></p><p>Reed’s Law states that the value of a network increases exponentially with the number of potential subgroups that users can establish within the network, in contrast to Metcalfe’s Law, which states that a network’s value is proportional to the square of its number of users.</p><p>Reed’s Law considers the combinatorial explosion of potential groups in contrast to <a href=\"https://cointelegraph.com/explained/what-is-metcalfes-law-and-why-does-it-matter\">Metcalfe’s Law</a>, which emphasizes the total number of connections among users. While Reed’s Law implies an exponential rise, emphasizing the importance of smaller, more niche groups, Metcalfe’s Law suggests a quadratic growth in value regarding the number of users.</p><p>Using the formula 2^n, where “n” stands for the number of potential subgroups within the network, Reed’s Law determines the value of a network. This formula emphasizes the ability of communities to produce and distribute value by showing that as the number of potential subgroups grows, the value of the network expands at an astounding rate.</p><p><img alt=\"Metcalfe’s Law vs Reeds La\" src=\"https://s3.cointelegraph.com/storage/uploads/view/6d127a58ad0d4ba114f6db6cc605afe8.png\" title=\"Metcalfe’s Law vs Reeds La\"></p><p>A classic example illustrating Reed’s Law is in online social networks. Users can create a variety of specialized groups on websites like Facebook and LinkedIn based on shared interests, occupations or hobbies. Each subgroup creates its own community, and as these communities grow, the network’s overall value grows exponentially because of the different ways these groups can communicate and exchange information, not just linearly with the number of users.</p><p>Reed’s Law has numerous applications in digital networks, including file-sharing networks where users can build and join various file-sharing communities, each specializing in a particular type of material or set of interests. Reed’s Law applies to traditional networks in situations like professional associations or academic societies where members can form specialized committees or groups, increasing the network’s worth exponentially as these subgroups multiply.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-118279-3\">            <h2 data-ct-widget=\"explained-block-title\">                How Reed’s Law impacts the growth and value of cryptocurrencies            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>By highlighting the exponential increase in value as communities and applications within the cryptocurrency networks proliferate, Reed’s Law has a profound impact on the growth and value of cryptocurrencies. </em></p><p>Here’s how Reed’s Law influences cryptocurrencies:</p><h3>Community building and adoption</h3><p>Community participation is key for cryptocurrencies. According to Reed’s Law, the number of potential communities and subgroups inside the crypto ecosystem grows exponentially as more people join the network. For instance, Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), among other <a href=\"https://cointelegraph.com/learn/what-is-a-cryptocurrency-a-beginners-guide-to-digital-money\">cryptocurrencies</a>, have experienced exponential growth in their respective communities, which has facilitated global adoption and value appreciation.</p><h3>Decentralized applications (DApps)</h3><p>Ethereum’s <a href=\"https://cointelegraph.com/learn/what-are-smart-contracts-a-beginners-guide-to-automated-agreements\">smart contracts</a> enable DApps, embodying Reed’s Law. As these applications multiply, the network’s value grows exponentially. Reed’s Law emphasizes the exponential increase in value as diverse communities and applications within <a href=\"https://cointelegraph.com/learn/history-of-ethereum-blockchain\">Ethereum’s network</a> expand, underscoring the power of decentralized ecosystems.</p><h3>Niche and use case-specific cryptocurrencies</h3><p>Some cryptocurrencies are created for particular businesses or use cases. When these cryptocurrencies attract communities relevant to their particular applications, Reed’s Law is evident. For instance, the <a href=\"https://cointelegraph.com/learn/a-beginners-guide-to-the-privacy-focused-next-generation-brave-browser\">Brave browser</a> has Basic Attention Tokens (BAT), a cryptocurrency that aims to transform digital advertising. Users, advertisers and content producers make up the BAT community, forming a variety of subgroups that increase the currency’s usefulness and overall worth.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-118279-2\">            <h2 data-ct-widget=\"explained-block-title\">                Role of Reed’s Law in shaping tokenomics strategies            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Reed’s Law serves as a foundation for tokenomics initiatives by highlighting the exponential growth potential that may be achieved through the emergence of several subgroups and communities.</em></p><p>Reed’s Law plays a pivotal role in the development of <a href=\"https://cointelegraph.com/learn/what-is-tokenomics-a-beginners-guide-on-supply-and-demand-of-cryptocurrencies\">tokenomics</a> strategies as well as the planning and execution of blockchain initiatives. The economic model that underpins cryptocurrencies, known as tokenomics, leverages this principle by promoting the creation of a variety of use cases and stimulating active community interaction.</p><p>As Reed’s Law emphasizes the possibility of an exponential increase in a project’s value as new communities and subgroups emerge, tokenomics techniques can take advantage of this law by motivating users and programmers to develop applications, thereby boosting the ecosystem’s overall usefulness and allure. Demand for the native token increases as specialized subgroups form, favorably affecting the token’s value.</p><p>Additionally, Reed’s Law underlines how crucial it is to promote relationships between these sub-groups. Interconnectedness guarantees a thriving ecosystem where the network’s worth dramatically rises through cooperative efforts. As a result, tokenomics models encourage activities that promote interactions among communities, resulting in a <a href=\"https://cointelegraph.com/news/what-is-the-network-effect\">network effect</a> that increases the project’s overall value.</p><p>Furthermore, Reed’s Law emphasizes the value of community-driven initiatives. Tokenomics strategies frequently set aside a portion of tokens for community development, promoting the emergence of varied communities. These groups participate in governance processes, offer support, and create apps that benefit the ecosystem. The project’s resilience and sustainability are improved by such active participation, ensuring long-term benefits.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-118279-1\">            <h2 data-ct-widget=\"explained-block-title\">                Potential pitfalls in applying Reed’s Law to crypto networks            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>While Reed’s Law provides useful insights into the development of cryptocurrency networks, managing the complexity of various subgroups, foreseeing their success, maintaining engagement, managing expectations, and ensuring security and privacy are crucial challenges that must be addressed when applying this principle to cryptocurrency ecosystems.</em></p><p>One significant drawback is the difficulty of managing numerous subgroups. Coordinating interactions and creating a seamless user experience get more challenging as the number of communities increases. To avoid division and conflicts among subgroups, it is necessary to have robust governance systems, which can be challenging in decentralized networks.</p><p>The complexity of precisely anticipating what subgroups will gain traction creates a further problem. A crypto network’s value will not always be created equally by all of its communities. It can be difficult and involve a lot of trial and error to determine what subgroups are the most beneficial and sustainable, which results in an ineffective use of resources.</p><p>Additionally, Reed’s Law’s exponential growth prediction can be difficult to maintain over the long run. Maintaining the same degree of connection and involvement within each subgroup as the network grows is challenging. Subgroups may experience activity stagnation or decline, which will impact the value proposition of the network as a whole.</p><p>Furthermore, there is a chance of overestimating the network’s potential worth, particularly if the expansion of subgroups differs from early projections. Unrealistic predictions may leave consumers and investors feeling let down, which could contribute to market instability.</p><p>Finally, dealing with numerous subgroups can raise privacy and security issues. It is crucial to ensure the security of user identities, data and transactions within these communities. Concerns regarding user safety can impede the growth potential anticipated by Reed’s Law and lower network value if security measures are not strong.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-118279-0\">            <h2 data-ct-widget=\"explained-block-title\">                How will Reed’s Law shape the future of crypto space?            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Reed’s Law is set to revolutionize the crypto industry by fostering exponential growth through varied, interconnected communities, driving innovation and democratizing finance and governance.</em></p><p>The concept of Reed’s Law, which emphasizes the exponential value created through different, specialized communities, will encourage the growth of creative DApps and networks as blockchain technology develops. This potential for exponential expansion promotes the creation of original, user-centered solutions across a variety of industries, including banking, gaming, healthcare and government.</p><p><a href=\"https://cointelegraph.com/learn/what-is-a-dao\">Decentralized autonomous organizations (DAOs)</a>, <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a>, and decentralized finance (DeFi) highlight the importance of Reed’s Law in driving collaborative ecosystems. Moreover, the law will have an impact on governance models, allowing for less centralization and more inclusive decision-making procedures.</p><p>A synergistic environment will be created by connected networks of communities as blockchain interoperability advances, greatly enhancing the general utility and adoption of cryptocurrencies. The application of Reed’s Law will foster the development of active, diverse crypto communities as well as the democratization of finance, innovation and governance, resulting in a decentralized future for the crypto industry.</p>            </p>        </div>    </p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-16T15:30:20.000Z",
    "title": "Amount of Bitcoin held for a decade or longer nears unprecedented milestone of 3 million coins",
    "url": "https://cryptoslate.com/insights/volume-of-bitcoin-held-for-a-decade-or-longer-nears-unprecedented-milestone-of-3-million-coins/",
    "description": "<p>Quick Take The Bitcoin landscape is witnessing an unprecedented event, as the number of Bitcoins that haven&#8217;t been moved for over a decade is nearing the 3 million mark. This represents approximately 15% of the current circulating supply of about 19.5 million Bitcoin. The trajectory of these unmoved coins has seen steady growth, hitting its [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/volume-of-bitcoin-held-for-a-decade-or-longer-nears-unprecedented-milestone-of-3-million-coins/\">Amount of Bitcoin held for a decade or longer nears unprecedented milestone of 3 million coins</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-16T14:50:51.000Z",
    "title": "Tether freezes $873k in assets linked to financing terrorism",
    "url": "https://cryptoslate.com/tether-freezes-873k-in-assets-linked-to-financing-terrorism/",
    "description": "<p>Stablecoin firm Tether (USDT) seized digital assets worth $873,118.34 from 32 addresses linked to warfare and terrorism in Ukraine and Israel. Critics of the crypto industry have frequently raised concerns about its potential use for funding terrorist and malicious operations. Figures like Senator Elizabeth Warren have underscored how illicit funds can flow through the sector [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/tether-freezes-873k-in-assets-linked-to-financing-terrorism/\">Tether freezes $873k in assets linked to financing terrorism</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-16T15:30:19.000Z",
    "title": "SEC Chair Gary Gensler Issues Urgent Call for AI Regulation to Prevent Financial Crisis",
    "url": "https://www.cryptoglobe.com/latest/2023/10/sec-chair-gary-gensler-issues-urgent-call-for-ai-regulation-to-prevent-financial-crisis/",
    "description": "In a recent interview with The Financial Times (FT), Gary Gensler, the chair of the U.S. Securities and Exchange Commission (SEC), expressed grave concerns about the potential risks artificial intelligence (AI) poses to financial stability. Gensler warned that without immediate regulatory measures, a financial crisis triggered by AI is “nearly unavoidable” within the next ten […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-16T15:37:04.000Z",
    "title": "Crafting Children’s Books with ChatGPT Assistance",
    "url": "https://www.cryptopolitan.com/crafting-childrens-books-with-chatgpt/",
    "description": "In addition to prompts, there are numerous crucial ChatGPT factors to keep in mind and essential steps to follow in order to ensure the success of your children&#8217;s book project.  Developing the Idea Recommended approach: Collaborate with ChatGPT to develop your book idea. Engage in a conversation with ChatGPT to explore and refine your concept. ... <a title=\"Crafting Children&#8217;s Books with ChatGPT Assistance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crafting-childrens-books-with-chatgpt/\" aria-label=\"More on Crafting Children&#8217;s Books with ChatGPT Assistance\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-16T15:37:01.000Z",
    "title": "Deepfake Pornography Crisis: A Growing Threat to Women Worldwide",
    "url": "https://www.cryptopolitan.com/deepfake-pornography-crisis-threat-to-women/",
    "description": "Recent analysis has unveiled a disturbing surge in the creation and distribution of nonconsensual deepfake porn videos. Over the past seven years, 244,625 videos have been uploaded to 35 prominent deepfake porn websites. This year alone, 113,000 videos were uploaded, marking a 54% increase from 2022. Deepfake&#8217;s dark reach The reported figures only touch the ... <a title=\"Deepfake Pornography Crisis: A Growing Threat to Women Worldwide\" class=\"read-more\" href=\"https://www.cryptopolitan.com/deepfake-pornography-crisis-threat-to-women/\" aria-label=\"More on Deepfake Pornography Crisis: A Growing Threat to Women Worldwide\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-16T15:09:55.000Z",
    "title": "Elon Musk’s Ambitious Neuralink: Merging Humans with AI",
    "url": "https://www.cryptopolitan.com/elon-musks-ambitious-neuralink/",
    "description": "Elon Musk&#8217;s foray into neurotechnology through his company Neuralink has been met with both anticipation and apprehension. While the short-term goal of Neuralink is to help individuals with paralysis regain control over their lives, Musk&#8217;s long-term vision is much more ambitious – merging humans with artificial intelligence. Short-term goal: A ray of hope for paralysis ... <a title=\"Elon Musk&#8217;s Ambitious Neuralink: Merging Humans with AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/elon-musks-ambitious-neuralink/\" aria-label=\"More on Elon Musk&#8217;s Ambitious Neuralink: Merging Humans with AI\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-16T15:04:56.000Z",
    "title": "China Proposes Stricter Rules on Generative AI Training Data: Concerns Over Ethical AI Development",
    "url": "https://www.cryptopolitan.com/china-propose-rules-on-ai-training-data/",
    "description": "In a recent announcement, the Cyberspace Administration of China (CAC) has proposed a comprehensive set of regulations aimed at overseeing the training data used in developing generative AI tools, particularly large language models (LLMs). These proposed regulations have been introduced with the intention of fostering the safe and responsible development of AI technologies within the ... <a title=\"China Proposes Stricter Rules on Generative AI Training Data: Concerns Over Ethical AI Development\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-propose-rules-on-ai-training-data/\" aria-label=\"More on China Proposes Stricter Rules on Generative AI Training Data: Concerns Over Ethical AI Development\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-16T15:22:16.000Z",
    "title": "Tether has frozen 32 addresses linked ",
    "url": "https://crypto.news/tether-has-frozen-32-addresses-linked/",
    "description": "Tether confirms it has frozen 32 addresses linked to illicit activity in Israel and Ukraine."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-16T14:55:43.000Z",
    "title": "Inflow into crypto funds continues for third consecutive week",
    "url": "https://crypto.news/inflow-into-crypto-funds-continues-for-third-consecutive-week/",
    "description": "Inflows in cryptocurrency investment products from October 7 to October 13 reached $15.2 million, compared to $78.4 million a week earlier. "
  },
  {
    "source": "BTCManager",
    "date": "2023-10-16T14:42:38.000Z",
    "title": "CryptoProcessing.com: a guide to accepting crypto payments",
    "url": "https://crypto.news/cryptoprocessing-com-a-guide-to-accepting-crypto-payments/",
    "description": "CryptoProcessing offers a gateway for Bitcoin payment processing and provides a robust business crypto wallet "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-16T15:15:13.000Z",
    "title": "History Speaks: Cardano’s Potential 2,300% Uptick – What’s in Store?",
    "url": "https://www.crypto-news-flash.com/history-speaks-cardanos-potential-2300-uptick-whats-in-store/?utm_source=rss&utm_medium=rss&utm_campaign=history-speaks-cardanos-potential-2300-uptick-whats-in-store",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-8-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-8-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-8-1-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Historical trends hint at a potential 2,300% rise in Cardano (ADA) prices. While some analysts remain cautious, data from past cycles suggests a major ADA rally could be forthcoming. Inside the World of ADA Predictions The tumultuous journey of Cardano’s ADA this year has had its share of naysayers. With a concerning 94% drop in [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-16T15:00:44.000Z",
    "title": "3 Cryptos That Could Potentially 30x In 3 Months",
    "url": "https://www.crypto-news-flash.com/3-cryptos-that-could-potentially-30x-in-3-months/?utm_source=rss&utm_medium=rss&utm_campaign=3-cryptos-that-could-potentially-30x-in-3-months",
    "description": "<img width=\"512\" height=\"230\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-70.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-70.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-70-300x135.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Crypto can be a hub of enthusiasm and opportunity for investors seeking to post big profits. However, it&#8217;s crucial to remember that digital assets are still highly speculative and unsuitable for some investors. Despite this, some projects with clear use cases and roadmaps have been capturing investors&#8217; attention due to their growth potential. This article [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-16T14:45:29.000Z",
    "title": "Bitcoin Treads Carefully: What’s Next for SOL, LDO, ICP, and VET?",
    "url": "https://www.crypto-news-flash.com/bitcoin-treads-carefully-whats-next-for-sol-ldo-icp-and-vet/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-treads-carefully-whats-next-for-sol-ldo-icp-and-vet",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Bitcoin-bulle.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Bitcoin-bulle.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Bitcoin-bulle-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Bitcoin-bulle-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Bitcoin-bulle-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Bitcoin-bulle-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Bitcoin-bulle-2048x1152.jpg 2048w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Bitcoin remains stable above $26,500, influencing the direction of altcoins like SOL, LDO, ICP, and VET. Bitcoin&#8217;s market dominance lingers around 50% as regulatory concerns keep some investors at bay. Bitcoin&#8217;s Standoff: Bulls vs. Bears While the S&#38;P 500 Index recorded another positive week and gold surged by more than 5%, Bitcoin ended its week [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-16T15:23:00.000Z",
    "title": "FTX and Alameda Behind BlockFi’s Bankruptcy, SBF Trial Continues",
    "url": "https://coinedition.com/ftx-and-alameda-behind-blockfis-bankruptcy-sbf-trial-continues/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Alameda_Research_Borrowed_FTX_Customer_Funds_Without_Limits_According.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Court Testimony Reveals Alameda Used FTX Funds Without Limitation\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Alameda_Research_Borrowed_FTX_Customer_Funds_Without_Limits_According.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Alameda_Research_Borrowed_FTX_Customer_Funds_Without_Limits_According-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Alameda_Research_Borrowed_FTX_Customer_Funds_Without_Limits_According-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Alameda_Research_Borrowed_FTX_Customer_Funds_Without_Limits_According-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Alameda_Research_Borrowed_FTX_Customer_Funds_Without_Limits_According-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Alameda_Research_Borrowed_FTX_Customer_Funds_Without_Limits_According-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The trial of Sam Bankman-Fried continued with Zac Prince, former chief executive officer of defunct crypto lender BlockFi. BlockFi was one of Alameda Research’s lenders, and the bankruptcy of FTX and Alameda reportedly led to BlockFi losing $1 billion, which resulted in its own bankruptcy. Prince’s testimony highlighted the transparency of his lending business, how [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ftx-and-alameda-behind-blockfis-bankruptcy-sbf-trial-continues/\">FTX and Alameda Behind BlockFi’s Bankruptcy, SBF Trial Continues</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-16T14:52:00.000Z",
    "title": "Terraform Labs Claims Third-Parties Caused USTC Collapse: Filing",
    "url": "https://coinedition.com/terraform-labs-claims-third-parties-caused-ustc-collapse-filing/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/Today_we_charged_Singapore_based_Terraform_Labs_PTE_Ltd_and_Do_Hyeong.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"$415 Million FTX Hacker Moves ETH Exploited From The Exchange\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/Today_we_charged_Singapore_based_Terraform_Labs_PTE_Ltd_and_Do_Hyeong.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/Today_we_charged_Singapore_based_Terraform_Labs_PTE_Ltd_and_Do_Hyeong-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/Today_we_charged_Singapore_based_Terraform_Labs_PTE_Ltd_and_Do_Hyeong-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/Today_we_charged_Singapore_based_Terraform_Labs_PTE_Ltd_and_Do_Hyeong-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/Today_we_charged_Singapore_based_Terraform_Labs_PTE_Ltd_and_Do_Hyeong-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/Today_we_charged_Singapore_based_Terraform_Labs_PTE_Ltd_and_Do_Hyeong-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Terraform Labs filed a motion in the U.S. District Court for the Southern District of Florida on October 10 to seek permission to look into the trading books of Citadel Securities. The company has once again leveled an allegation that Citadel, an American market-making firm, was behind the TerraUSD collapse. In particular, Terraform has approached [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/terraform-labs-claims-third-parties-caused-ustc-collapse-filing/\">Terraform Labs Claims Third-Parties Caused USTC Collapse: Filing</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]