[
  {
    "source": "Cointelegraph",
    "date": "2024-01-05T04:15:26.000Z",
    "title": " Logan Paul to ‘buy back’ CryptoZoo NFTs a year after promising refunds ",
    "url": "https://cointelegraph.com/news/logan-paul-launch-crypto-zoo-nft-refund-lawsuit-co-creator",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOGU5MWM1Y2QtNjZkNC00Y2I4LTg4MTQtYmI5MjNhZGMwMjIwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The program would give NFT holders 0.1 ETH for each eligible NFT, but they would also need to waive any current or future claims against Paul.</p>\n                    <p><p>YouTuber and social media influencer Logan Paul is set to refund certain disgruntled investors of his once ambitious CryptoZoo nonfungible token (NFT) game — a year after he promised NFT buyers recourse. </p><p>Logan said the “buy back” program will be funded by $2.3 million he is personally committing and will involve buying back Base Eggs and Base Animals at the original purchase price “for every person who intended to play CryptoZoo.”</p><p>CryptoZoo was a never-released play-to-earn game allowing players to buy, sell, breed and trade “exotic animals” (represented as NFTs) with crypto. It was first announced by Paul in August, 2021.</p><p><a href=\"https://cointelegraph.com/news/logan-paul-launch-crypto-zoo-nft-refund-lawsuit-co-creator\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-05T04:26:53.000Z",
    "title": "The horrors persist, but so does the dollar … for now",
    "url": "https://www.cryptopolitan.com/the-horrors-persist-but-so-does-the-dollar/",
    "description": "As the clock ticks towards a new era in global finance, the US dollar, that old stalwart of the world&#8217;s monetary system, finds itself dancing on a tightrope of uncertainty. It&#8217;s a peculiar dance, one marked by resilience amidst looming fears of decline. This isn&#8217;t just any currency we&#8217;re talking about; this is the dollar, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-05T04:12:40.000Z",
    "title": "Wall Street’s China dreams hit a roadblock – So now what?",
    "url": "https://www.cryptopolitan.com/wall-streets-china-dreams-hit-a-roadblock/",
    "description": "Wall Street&#8217;s ambitions in China have recently encountered significant headwinds, compelling major financial institutions to recalibrate their strategies. Amidst heightened geopolitical tensions and stringent regulatory landscapes, the dreams of Wall Street powerhouses are being reshaped, signaling a shift in the global financial paradigm. This change is not just about compliance and regulation; it represents a [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-05T04:37:13.000Z",
    "title": "Ethereum Price Tops At 100 SMA, Why ETH Could Struggle In Near Term",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-tops-at-2300/",
    "description": "Ethereum price failed to recover further above the $2,300 resistance. ETH is showing a few bearish signs and might revisit the $2,080 support. Ethereum is struggling to clear the $2,280 and $2,300 resistance levels. The price is trading below $2,300 and the 100-hourly Simple Moving Average. There is a major bearish trend line forming with resistance near $2,280 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh decline if it stays below the $2,300 resistance zone. Ethereum Price Faces Rejection Ethereum price started a recovery wave above the $2,120 level, like Bitcoin. ETH was able to clear the $2,200 and $2,220 resistance levels. However, the bears were active near $2,300 and the 100-hourly Simple Moving Average. The price failed to clear the 76.4% Fib retracement level of the downward move from the $2,430 swing high to the $1,860 low. It is now struggling to clear the $2,280 and $2,300 resistance levels. There is also a major bearish trend line forming with resistance near $2,280 on the hourly chart of ETH/USD. Ethereum is now below $2,300 and the 100-hourly Simple Moving Average, but it is still above the 23.6% Fib retracement level of the upward move from the $1,860 swing low to the $2,289 high. On the upside, the price is facing resistance near the $2,280 level and the trend line. The first major resistance is now near $2,300. A close above the $2,300 resistance could start a decent upward move. The next key resistance is near $2,400. Source: ETHUSD on TradingView.com If there is a clear move above $2,400, there could be a drift toward $2,500. The next resistance sits at $2,500, above which Ethereum might rally and test the $2,620 zone. Fresh Decline in ETH? If Ethereum fails to clear the $2,300 resistance, it could start a fresh decline. Initial support on the downside is near the $2,185 level. The first key support could be the $2,075 zone or the 50% Fib retracement level of the upward move from the $1,860 swing low to the $2,289 high. A downside break and a close below $2,075 might start another steady decline. In the stated case, Ether could test the $2,000 support. Any more losses might send the price toward the $1,860 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $2,185 Major Resistance Level – $2,300"
  }
]