[
  {
    "source": "Cryptopolitan",
    "date": "2023-06-10T13:36:32.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 BREAKING: Twitter to enable #crypto trading in partnership with eToro. Users searching using a $Cashtag symbol currently see live charts for a select few financial assets, like $LTC. Users will soon be able to click through to eToro &#38; have the option to invest in #Litecoin. Is Litecoin silver to Bitcoin&#8217;s ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-10T13:27:22.000Z",
    "title": "SUI Price Plummets By 38% In 7 Days – Will It Recover Anytime Soon?",
    "url": "https://www.newsbtc.com/altcoin/sui-price-plummets-by-38/",
    "description": "The price of SUI has experienced a significant decline in the past week, dropping by 38.13%. In the last 24 hours alone, the price has fallen by 21.51%. However, there is a glimmer of hope as the price slightly increased by 1.53% in the past hour. Currently priced at $0.58 per SUI, the token is 61.12% below its all-time high of $1.50. The question now remains whether SUI can regain its footing and initiate a recovery. SUI Coin Faces Bearish Pressure  The global crypto market cap has dropped below $1.10 trillion again, leading to a negative trading sentiment across most cryptocurrencies. SUI coin, in particular, has experienced a significant decline of over 10% in the past 24 hours, with its price falling below $0.70. The asset&#8217;s technical analysis suggests a bearish trend, characterized by high selling pressure and struggles for buyers to reverse the downward momentum. Related Reading: Cardano (ADA) Faces Obstacles In Reaching Key Level In June – Here’s Why On the 4-hour timeframe chart, the SUI coin has been in a downtrend, seeking stable support. It trades below its short-term and long-term moving averages, with the 50-day MA at approximately $0.837 and the 200-day MA at $1.020. This positioning below the moving averages signifies a consistent decline in the coin&#8217;s price, potentially indicating a lack of buying pressure and weakened market sentiment. The immediate support level for the SUI coin is at $0.50, while the resistance level stands at around $0.76. Recent rejection below the resistance level has fueled the downtrend. Furthermore, the Relative Strength Index (RSI) on the 4-hour timeframe chart confirms the bearish sentiment, with an RSI of 17.9 indicating oversold conditions. Sellers currently outnumber buyers, further adding to the downward pressure on the SUI coin. Partnership With Red Bull Racing: Can This Be A Catalyst For SUI Token’s Revival The recent multiyear partnership between Sui and Formula One&#8217;s Oracle Red Bull Racing team has the potential to rejuvenate the Sui token price. As Sui becomes the blockchain partner of a renowned and globally recognized racing team, it gains exposure and credibility within the crypto and motorsport communities. This association can drive increased demand for Sui tokens, heightening the token&#8217;s value. The collaboration aims to deliver engaging digital experiences for racing fans, creating a loyal user base and bolstering Sui&#8217;s reputation. With Red Bull Racing&#8217;s previous involvement in the crypto industry, its partnership with Sui signifies a shared interest in exploring the potential of cryptocurrencies and blockchain technology. Related Reading: Bleak Dogecoin (DOGE) Social Sentiment Raises Questions About Price Reversal While the partnership&#8217;s success and its impact on the Sui token price depend on several factors, including market conditions and investor sentiment, this collaboration holds promising prospects for the revival of the Sui token. Monitoring future developments and market reactions will provide valuable insights into the effectiveness of the partnership in driving the Sui token&#8217;s resurgence. At press time, SUI was trading at $0.5904 with a 24-hour drop of 19.8% in its price.  Featured image from iStock, charts from Tradingview.com"
  }
]