[
  {
    "source": "CoinDesk",
    "date": "2023-12-28T07:15:34.000Z",
    "title": "Crypto Wallet Linked to Donald Trump Sent $2.4M in Ether to Coinbase",
    "url": "https://www.coindesk.com/markets/2023/12/28/crypto-wallet-linked-to-donald-trump-sent-24m-in-ether-to-coinbase/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A wallet flagged as owned by Trump sent ETH to Coinbase in the past three weeks, where it was presumably sold."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-28T07:23:45.000Z",
    "title": "MicroStrategy Acquires 14,620 BTC Ahead Of Historic ETF Decision",
    "url": "https://cryptodaily.co.uk/2023/12/microstrategy-acquires-14620-btc-ahead-of-historic-etf-decision",
    "description": "The Michael Saylor-led business intelligence firm MicroStrategy has doubled down on Bitcoin, acquiring a further 14,620 BTC for $615.7 million in cash at a price of $42,110."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T07:37:12.000Z",
    "title": "AI and Climate Change to Reshape Global Education Landscape in 2024",
    "url": "https://www.cryptopolitan.com/ai-and-climate-change-global-education-2024/",
    "description": "In a groundbreaking shift set to define the educational agenda of 2024, the convergence of artificial intelligence (AI) and climate change is poised to reshape classrooms globally. Education experts in the UAE and the US anticipate a transformative impact on learning methodologies, assessment techniques, and the overarching approach to preparing the youth for the future [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T07:29:22.000Z",
    "title": "Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Flow Coin Price Prediction 2023-2032 Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-28T07:30:00.000Z",
    "title": "Shiba Inu expanding in defi, InQubeta achieves mainstream recognition",
    "url": "https://crypto.news/shiba-inu-expanding-in-defi-inqubeta-achieves-mainstream-recognition/",
    "description": "Shiba Inu is leaving a mark in defi with Shibarium. Meanwhile, InQubeta is making a mark in crypto crowdfunding for AI startups"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-28T07:20:31.000Z",
    "title": "Coinbase insiders sold over $120m worth of COIN in December alone, data shows",
    "url": "https://crypto.news/coinbase-insiders-sold-over-120m-worth-of-coin-in-december-alone-data-shows/",
    "description": "Coinbase co-founder Ehrsam Frederick Ernest III appears to be the most active seller of COIN shares in December, according to Insider Alerts data. December appears to be the most active month for Coinbase insiders selling shares, with a total USD&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-28T07:09:40.000Z",
    "title": "BNB overtakes Solana, traders betting against the surge",
    "url": "https://crypto.news/bnb-overtakes-solana-traders-betting-against-the-surge/",
    "description": "BNB’s recent surge helped it gain the fourth spot again, flipping Solana (SOL). However, traders are betting against BNB’s rally. BNB is up by 10.4% in the past 24 hours and is trading at $322.75 at the time of writing.&#8230;"
  }
]