[
  {
    "source": "Cointelegraph",
    "date": "2023-07-03T04:16:24.000Z",
    "title": "Poly Network urges users to withdraw after exploit affects 57 crypto assets",
    "url": "https://cointelegraph.com/news/poly-network-users-withdraw-bridge-exploit-affects-57-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/db913bc4-9d5d-42f6-a7ef-87413246ec5b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Poly Network has been exploited again, this time due to compromised private keys according to blockchain security firm Dedaub.</p>\n                    <p><p>Further details are coming to light following a July 2 attack on cross-chain bridge platform Poly Network, which has resulted in a hacker being able to issue billions of tokens out of thin air for profit.</p><p>In a July 2 Twitter post, Poly Network <a href=\"https://twitter.com/PolyNetwork2/status/1675384703149568001\" target=\"_blank\" rel=\"noopener nofollow\">confirmed</a> it became the latest DeFi exploit victim after attackers managed to manipulate a smart contract function on the cross-chain bridge protocol, adding it will be temporarily suspending services. </p><p>In the most recent update, the team <a href=\"https://docs.google.com/spreadsheets/d/1NK1v-hvaPKQviZqowtwwOm3swF0vNNN_vhFivbmRTqs/edit#gid=1942611831\" target=\"_blank\" rel=\"noopener nofollow\">revealed</a> the exploit affected 57 crypto assets on 10 blockchains — including Ethereum, <a href=\"https://cointelegraph.com/news/binance-bnb-chain-introduce-optimism-layer-2-testnet-opbnb\">BNB Chain</a>, Polygon, Avalanche, Heco, OKx, and others such as Metis.</p><p>It did not specify how much was stolen in the attack but Peckshield earlier <a href=\"https://twitter.com/PeckShieldAlert/status/1675443876574937088\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that the exploiter had transferred at least $5 million worth of crypto out. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/975eba29-68e2-4df5-bacd-06eaad9a77be.jpg\"  /><figcaption style=\"text-align: center;\"><em>Tokens transferred out of Poly Network. Source: </em><a href=\"https://twitter.com/PeckShieldAlert/status/1675443876574937088\" target=\"_blank\" rel=\"noopener nofollow\"><em>Twitter/PeckShield</em></a></figcaption></figure><p>“We have already initiated communication with centralized exchanges and law enforcement agencies and sought their assistance,” the team stated in a July 3 update.</p><p>It also advised project teams and token holders to withdraw liquidity and unlock their LP (liquidity provider) tokens.</p><h3>'34 billion' Poly Network hack breakdown</h3><p>DeFi security analyst @0xArhat <a href=\"https://twitter.com/0xArhat/status/1675483634935922688\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the exploit was a result of a smart contract vulnerability that allowed the hacker to “craft a malicious parameter containing a fake validator signature and block header.” </p><p>This was accepted by the smart contract enabling the hacker to bypass the verification process allowing them to issue tokens from Poly Network's Ethereum pool to their own address on other chains, such as Metis, BNB Chain, and Polygon. </p><p>The process was repeated for other chains enabling the token stash to pile up.</p><p>At one point the hacker’s wallet held around $42 billion worth of tokens but was only able to convert and steal a fraction of them, said the analyst. </p><blockquote>“This way, the hacker was able to mint billions of tokens on various blockchains that did not exist before and transfer them to their own wallet addresses.”</blockquote><p>The latest Poly Network exploit has been dubbed by blockchain security solutions provider Dedaub as the “34 billion Poly Network hack.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Getting to the bottom of the &quot;34 billion&quot; Poly network hack with a technical postmortem.<br><br>TL ; DR<br><br>Poly network had a simple 3 of 4 multisig arrangement over 2 years!<br><br>Looking at the final event we found that the private keys to the addresses marked were compromised. <a href=\"https://t.co/Y0eMJXcYso\">pic.twitter.com/Y0eMJXcYso</a></p>&mdash; Dedaub (@dedaub) <a href=\"https://twitter.com/dedaub/status/1675516729349292032?ref_src=twsrc%5Etfw\">July 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Dedaub noted weaknesses in the protocol's multi-sig stating that it had a simple “3 of 4” multi-signature arrangement over two years, adding: </p><blockquote>“Looking at the final event we found that the private keys to the addresses marked were compromised.”</blockquote><p>Dedaub explained that the attack wasn't complex as no logic bugs were exploited. It added that Poly Network was slow to respond taking seven hours which cost the platform $5.5 million in stolen crypto. Luckily, a lack of liquidity in many of the tokens prevented further losses. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/over-204m-lost-to-defi-hacks-and-scams-in-q2-finance-redefined\"><strong><em>Over $204M lost to DeFi hacks and scams in Q2</em></strong></a></p><p>Following the attack, Binance CEO, Changpeng Zhao reassured customers, <a href=\"https://twitter.com/cz_binance/status/1675380954674651137\" target=\"_blank\" rel=\"noopener nofollow\">stating</a> that “This does not affect Binance users. We do not support deposits from this network.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Poly Network got rekt again; allegedly because of compromised hot keys.<br><br>It&#39;s going to keep happening untill our industry changes our approach to security.<br><br>Smart contract audits only scratch the surface.<br><br>ps Poly network has NOTHING to do with Polygon. <a href=\"https://t.co/n1qI48b4Kb\">https://t.co/n1qI48b4Kb</a></p>&mdash; Mudit Gupta (@Mudit__Gupta) <a href=\"https://twitter.com/Mudit__Gupta/status/1675584195798913024?ref_src=twsrc%5Etfw\">July 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Cointelegraph reached out to Poly Network for further details but did not hear back by the time of publication.</p><p>The Poly Network was <a href=\"https://cointelegraph.com/news/hackers-stole-at-least-600m-in-poly-exploit-across-three-chains\">attacked</a> once before in one of the industry’s largest exploits in August 2021 when hackers, later revealed to be linked with North Korean hacking collective the Lazarus Group, made off with over $600 million.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\">Tornado Cash 2.0: The race to build safe and legal coin mixers</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T04:35:10.000Z",
    "title": "US Restricts Sale of AI Chips to China, Effective In Raising the Technology Barrier?",
    "url": "https://www.cryptopolitan.com/us-restricts-sale-of-ai-chips-to-china/",
    "description": "Amid the global enthusiasm surrounding the potential of artificial intelligence (AI), the United States, supported by its allies, is intensifying efforts to restrict China&#8217;s access to cutting-edge technologies. Recent developments, including the Dutch government&#8217;s announcement of new restrictions on semiconductor equipment exports and the anticipated tightening of US export controls on advanced chips, highlight the ... <a title=\"US Restricts Sale of AI Chips to China, Effective In Raising the Technology Barrier?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-restricts-sale-of-ai-chips-to-china/\" aria-label=\"More on US Restricts Sale of AI Chips to China, Effective In Raising the Technology Barrier?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-03T04:11:24.000Z",
    "title": "Is SEC Chair Gary Gensler Resigning, Freeing the Crypto Market, and Driving Bitcoin Price to a New ATH? Report",
    "url": "https://www.crypto-news-flash.com/is-sec-chair-gary-gensler-resigning-freeing-the-crypto-market-and-driving-bitcoin-price-to-a-new-ath-report/?utm_source=rss&utm_medium=rss&utm_campaign=is-sec-chair-gary-gensler-resigning-freeing-the-crypto-market-and-driving-bitcoin-price-to-a-new-ath-report",
    "description": "Rumors circulating about the resignation of US SEC Chair Gary Gensler are unfounded. The crypto community seeks regulatory reform rather than a change in leadership. The crypto market was abuzz on Sunday with rumors suggesting the possible resignation of Gary Gensler, the Chair of the US Securities and Exchange Commission (SEC). Reports cited an anonymous [...]"
  }
]