[
  {
    "source": "Decrypt",
    "date": "2023-07-26T12:24:22.000Z",
    "title": "Ethereum Generative Art Challenger Highlight Takes on Art Blocks",
    "url": "https://decrypt.co/150089/ethereum-generative-art-challenger-highlight-takes-on-art-blocks",
    "description": "The Haun Ventures-backed Highlight, which debuts today, claims to be the first \"open access\" generative art NFT platform on Ethereum."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-26T12:32:44.000Z",
    "title": "Binance launches AI-powered NFT generator for KYC-verified users",
    "url": "https://cointelegraph.com/news/nft-binance-launches-ai-powered-nft-generator-for-kyc-verified-users",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/b8942e0c-6078-481a-afeb-22d7bd6fd400.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Binance said it will provide ten free chances for users to generate artwork every day. </p>\n                    <p><p>Crypto exchange Binance’s <a href=\"https://cointelegraph.com/learn/nonfungible-tokens-how-to-get-started-using-nfts\">nonfungible token (NFT)</a> arm announced the launch of its artificial intelligence (AI) NFT generator that lets users produce custom artworks using AI technology. </p><p>On July 26, Binance NFT said its AI NFT generator dubbed “Bixel” is now permanently available for its users. According to the trading platform, the tool allows users to generate unique digital art and join the world of NFTs. However, those who wish to use the tool are required to complete the platform’s know your customer (KYC) identity verification process. Binance <a href=\"https://www.binance.com/en/blog/nft/binance-bixel-take-the-ai-nft-generator-challenge-and-earn-bnb-832228303844216249\" target=\"_blank\" rel=\"noopener nofollow\">explained</a> that: </p><blockquote>“This critical measure is in place to maintain a trustworthy and secure platform for all users, aligning with best practices and regulatory requirements.”</blockquote><p>In addition, those who wish to mint NFTs using the tool are also required to pay a minting fee of 0.008 BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>), which is around $1.9 at the time of writing. According to Binance, the fee ensures that the NFT creation process is executed properly within the BNB smart chain. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Binance?src=hash&amp;ref_src=twsrc%5Etfw\">#Binance</a>&#39;s AI NFT generator is back!<br><br>Bixel is now publicly available, letting you unleash your creativity to generate your own AI artwork.<br><br>Create your digital art before the 10th of August for the chance to win 1 <a href=\"https://twitter.com/hashtag/BNB?src=hash&amp;ref_src=twsrc%5Etfw\">#BNB</a>!<br><br>Learn more here <a href=\"https://t.co/Mh5VYHmYmp\">https://t.co/Mh5VYHmYmp</a></p>&mdash; Binance (@binance) <a href=\"https://twitter.com/binance/status/1684144929612926976?ref_src=twsrc%5Etfw\">July 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>When it comes to generating artwork using AI, the crypto exchange said they will provide ten chances for users to produce art for free each day. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/google-openai-microsoft-form-frontier-model-forum-to-regulate-ai-development\"><strong><em>Google, OpenAI, Microsoft form ‘Frontier Model Forum’ to regulate AI development</em></strong></a></p><p>A test version of the artwork generator was also launched earlier this year. On March 1, Binance <a href=\"https://cointelegraph.com/news/binance-s-ai-powered-nft-generator-hits-10k-mints-in-2-5-hours\">released a beta version</a> of the AI NFT generator and called it “Bicasso.” The beta version of the AI tool reached its full capacity within 2.5 hours, achieving the allotted minting limit of 10,000 NFTs shortly after it went live. </p><p>However, just days after the beta launch, the exchange was <a href=\"https://cointelegraph.com/news/bnb-chain-hackathon-winner-accuses-binance-of-stealing-ai-powered-nfts-idea\">accused of stealing the AI NFT generator</a> idea from BNB Chain hackathon winners. On March 2, community member “ggoma” alleged that Binance copied their project called \"Chatcasso,\" which won first prize at the BNB Chain hackaton held in Seoul, South Korea back in December 2022. When asked about the issue, a Binance spokesperson denied the allegations and claimed that “Bicasso” was developed independently two weeks before the hackathon. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tokenizing-music-royalties-nfts-taylor-swift-3lau-nas-the-weeknd/\"><strong><em>Tokenizing music royalties as NFTs could help the next Taylor Swift</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-26T12:34:35.000Z",
    "title": "AI companies lobby for open-source support in EU’s upcoming regulations",
    "url": "https://cryptoslate.com/ai-companies-lobby-for-open-source-support-in-eus-upcoming-regulations/",
    "description": "<p>Several tech and AI companies, including GitHub and HuggingFace, have written to European policymakers asking them to offer more support for the open-source development of artificial intelligence (AI) models, The Verge reported on July 26. In the paper, which contains a list of recommendations for the European Parliament, the companies asked for clearer definitions, among [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ai-companies-lobby-for-open-source-support-in-eus-upcoming-regulations/\">AI companies lobby for open-source support in EU&#8217;s upcoming regulations</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-26T12:36:39.000Z",
    "title": "Singapore’s High Court Classifies Cryptocurrency as Personal Property",
    "url": "https://cryptobriefing.com/cryptocurrency-as-personal-property/?utm_source=feed&utm_medium=rss",
    "description": "The High Court of Singapore declared cryptocurrency as a type of property on July 25, marking a significant step in the legal understanding of digital assets in Singapore. The case,..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-26T12:15:00.000Z",
    "title": "KuCoin Denies Mass Layoffs Amidst Allegations",
    "url": "https://cryptodaily.co.uk/2023/07/kucoin-denies-mass-layoffs-amidst-allegations",
    "description": "<p>Cryptocurrency exchange KuCoin has responded to recent rumors about mass layoffs within the company, clarifying that the adjustments to its headcount are part of routine organizational development.</p>\nCEO Claims &ldquo;Organizational Development&rdquo;\n<p>A spokesperson for KuCoin dismissed the layoff claims, stating that the company has not initiated any &ldquo;alleged layoff plan.&rdquo; Instead, they claimed, the company is merely conducting its regular biannual appraisals to stay competitive in the market.&nbsp;</p>\n<p>While the exchange did not deny some staff changes, CEO Johnny Lyu emphasized that these should not be described as layoffs. Instead, Lyu referred to it as a reevaluation of the organizational structure aimed at enhancing the company's dynamism and competitiveness. He addressed the rumors on Twitter, referring to them as rumors and speculations.&nbsp;</p>\n<p>He tweeted,</p>\n\n<p>&ldquo;The crypto world changes fast. To stay on top, we regularly evaluate our org structure based on employee performance and company development. So it is not layoffs, and it is all about making the organization more dynamic and competitive.&rdquo;</p>\n\nLayoffs Across Industry\n<p>The industry has been no stranger to an overwhelming number of layoffs from leading crypto companies. Just in 2023, Binance.US, Crypto.com, and Gemini have had to lay off significant portions of their workforce to counter the unstable macroeconomic conditions in the market.&nbsp;</p>\n<p>The talk of trouble at KuCoin stemmed from a report by Colin Wu of Wu Blockchain on Twitter. He claimed that KuCoin planned to cut 30% of its approximately 1,000 employees, attributing the alleged cuts to a strict know-your-customer (KYC) policy that impacted the firm's profits. The KYC policy was implemented after KuCoin faced a lawsuit from New York Attorney General Letitia James, who accused the exchange of violating securities and commodities laws.</p>\nKuCoin Revises KYC Process\n<p>In response to these accusations, KuCoin cited a recent report highlighting the company's growth. The report mentioned that the exchange had added 300 new employees in the first half of the year and also acknowledged the ongoing changes to the KYC practices. The updated policy, which took effect on July 15, required newly registered users to complete the KYC process to access the exchange's products and services.</p>\n<p>Users who had not completed the process by the deadline faced restrictions on their accounts, limiting certain activities like spot trading, but they could still withdraw funds. Following the announcement of the updated KYC policy, KuCoin experienced a substantial spike in trading volume, reaching $6.8 billion from nearly $500 million the previous day.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T12:26:04.000Z",
    "title": "Netflix Offers 6 Figures for AI Manager Role Ignoring Ongoing AI Use Jitters",
    "url": "https://www.cryptopolitan.com/netflix-offers-6-figures-for-ai-manager-role/",
    "description": "Streaming giant Netflix has sparked interest and controversy by advertising a lucrative position for an AI manager, with a salary range of $300,000 to $900,000. However, the timing of this move, amid ongoing strikes by the Writers Guild of America (WGA) and Screen Actors Guild – American Federation of Television and Radio Artists (SAG-AFTRA), has ... <a title=\"Netflix Offers 6 Figures for AI Manager Role Ignoring Ongoing AI Use Jitters\" class=\"read-more\" href=\"https://www.cryptopolitan.com/netflix-offers-6-figures-for-ai-manager-role/\" aria-label=\"More on Netflix Offers 6 Figures for AI Manager Role Ignoring Ongoing AI Use Jitters\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T12:13:01.000Z",
    "title": "Ripple’s court win could echo in Coinbase and Binance’s legal Fights, says Ripple’s Chief Legal Chief",
    "url": "https://www.cryptopolitan.com/ripples-court-win-could-echo-in-coinbase-and-binances-legal-fights-says-ripples-chief-legal-chief/",
    "description": "In a significant development, Ripple Labs&#8217; chief legal officer, Stuart Alderoty, stated that Ripple&#8217;s recent victory over the U.S. Securities and Exchange Commission (SEC) could set the stage for other pending crypto litigations. This comes after Ripple triumphed in a landmark court case in mid-July, successfully rebuffing the SEC&#8217;s charges of unauthorized securities offerings involving ... <a title=\"Ripple&#8217;s court win could echo in Coinbase and Binance&#8217;s legal Fights, says Ripple&#8217;s Chief Legal Chief\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripples-court-win-could-echo-in-coinbase-and-binances-legal-fights-says-ripples-chief-legal-chief/\" aria-label=\"More on Ripple&#8217;s court win could echo in Coinbase and Binance&#8217;s legal Fights, says Ripple&#8217;s Chief Legal Chief\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T12:12:25.000Z",
    "title": "How To Handle Your Wallet: 7 Tips To Keep Your Wallet Safe",
    "url": "https://www.cryptopolitan.com/how-to-handle-your-wallet-7-tips-to-keep-your-wallet-safe/",
    "description": "Every experienced crypto investor may be familiar with terrible stories of people neglecting their wallets. Accidents such as misplacing the paper where you have your passwords can be catastrophic. Many scenarios can make you lose millions if you are not careful with your wallet or leave it in the wrong hands. You must learn the ... <a title=\"How To Handle Your Wallet: 7 Tips To Keep Your Wallet Safe\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-to-handle-your-wallet-7-tips-to-keep-your-wallet-safe/\" aria-label=\"More on How To Handle Your Wallet: 7 Tips To Keep Your Wallet Safe\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T12:12:13.000Z",
    "title": "Why Existing Legislation Falls Short in Protecting Against AI-Induced Harm",
    "url": "https://www.cryptopolitan.com/legislation-falls-short-ai-induced-harm/",
    "description": "As Artificial Intelligence (AI) continues to advance rapidly, regulators and legislators worldwide face the challenge of anticipating and mitigating potential harms from this technology. Many have argued that existing laws, such as anti-discrimination, equal rights, labor market rules, and data protection regulations, would be sufficient to safeguard individuals against new AI-induced harm. However, the Ada ... <a title=\"Why Existing Legislation Falls Short in Protecting Against AI-Induced Harm\" class=\"read-more\" href=\"https://www.cryptopolitan.com/legislation-falls-short-ai-induced-harm/\" aria-label=\"More on Why Existing Legislation Falls Short in Protecting Against AI-Induced Harm\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T12:10:27.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The U.S. Securities and Exchange Commission (SEC) has begun reviewing applications from six companies, including BlackRock, to establish spot bitcoin exchange-traded funds. This marks the initial phase in the SEC&#8217;s procedure to determine the approval of the most recent set of proposals. The SEC has also officially recognized applications from Bitwise, ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-26T12:30:51.000Z",
    "title": "Ethereum (ETH) and Tether (USDT) holders buy into new presale Pomerdoge (POMD), Here’s why!",
    "url": "https://www.crypto-news-flash.com/ethereum-eth-and-tether-usdt-holders-buy-into-new-presale-pomerdoge-pomd-heres-why/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-eth-and-tether-usdt-holders-buy-into-new-presale-pomerdoge-pomd-heres-why",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T114043.781.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T114043.781.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T114043.781-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T114043.781-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />While Ethereum (ETH) faces challenges and displays negative indicators, Tether (USDT) remains stable despite decreased trading volume. In light of this, investors are actively exploring opportunities in search of new and innovative cryptocurrencies that offer potential gains.  As a result, many investors have decided to shift their focus and invest in Pomerdoge (POMD) during the [...]"
  }
]