[
  {
    "source": "Cointelegraph",
    "date": "2024-01-22T17:32:08.000Z",
    "title": " MIT/IBM study reveals humans are still more ‘economically attractive’ workers than AI  ",
    "url": "https://cointelegraph.com/news/mit-ibm-artificial-intelligence-study-reveals-humans-more-economically-attractive-workers-ai",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZjU0OTE4ZDAtNmFmZC00MTQ3LTg3NjktZTE2ODNlOTE2YTE4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>While the review wasn’t comprehensive, its findings indicate the transition from human employees to AI workers won’t be as swift as many pundits have predicted.</p>\n                    <p><p>A team of researchers from MIT and IBM recently published research that could help to assuage some of the fears surrounding the eventual artificial intelligence (AI) employment takeover. </p><p>Experts have long surmised that AI could (and likely will) replace humans in the workforce. One recent study <a href=\"https://www.brookings.edu/wp-content/uploads/2024/01/JEL-2023-1736_published_version.pdf\" target=\"_blank\" rel=\"noopener nofollow\">estimated</a> that around half of all jobs currently being performed by humans could be automated. </p><p>But the new research out of the MIT-IBM Watson AI lab <a href=\"https://futuretech-site.s3.us-east-2.amazonaws.com/2024-01-18+Beyond_AI_Exposure.pdf\" target=\"_blank\" rel=\"noopener nofollow\">shows</a> that such automation could come at a premium cost, one employers might not be willing to pay. </p><p><a href=\"https://cointelegraph.com/news/mit-ibm-artificial-intelligence-study-reveals-humans-more-economically-attractive-workers-ai\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-22T17:32:00.000Z",
    "title": " Crypto fund outflows reach $24.7M as GBTC selling impacts Bitcoin price  ",
    "url": "https://cointelegraph.com/news/crypto-fund-outflows-reach-24-7m-as-gbtc-selling-impacts-bitcoin-price",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOTNiMmRiNzgtNWVmZC00MTMxLWExZTctYTAyMmFhMTc3ZjJiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>CoinShares’ report noted that Bitcoin outflows rose last week, while trading volume for spot BTC ETFs totaled $11.8 billion.</p>\n                    <p><p>The latest report from European cryptocurrency investment firm CoinShares shows that there were minor outflows from institutional Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) investment products over the past 7 days.</p><p>According to CoinShares’ “Digital Asset Fund Flows Weekly”<em> </em>report <a href=\"https://blog.coinshares.com/volume-166-digital-asset-fund-flows-weekly-report-3c59276b9833\" target=\"_blank\" rel=\"noopener nofollow\">published</a> on Jan. 22, institutional investors are reducing Bitcoin exposure, with BTC investment products seeing total outflows of $24.7 million this past week.</p><p>The data follows heavy selling amid <a href=\"https://cointelegraph.com/news/bitcoin-price-sells-off-after-etf-approval-have-investors-turned-bearish\">spot Bitcoin ETF-driven crypto market meltdown</a>, with institutions having withdrawn nearly $21 million from crypto products between Jan. 11 and May 19 before outflows briefly slowed toward the end of last week.</p><p><a href=\"https://cointelegraph.com/news/crypto-fund-outflows-reach-24-7m-as-gbtc-selling-impacts-bitcoin-price\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-22T17:18:07.000Z",
    "title": "3 Tokens Under $3 That Can Pump Like Solana",
    "url": "https://cryptodaily.co.uk/2024/01/3-tokens-under-3-that-can-pump-like-solana",
    "description": "Explore the next big winners in the crypto market with our insider scoop on 3 tokens under $3 set to soar like Solana! Don't miss the chance to uncover the hidden gems of the altcoin season and ride the wave of exponential growth. Get ready to watch these tokens skyrocket as they follow in the footsteps of Solana's incredible success story!"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-22T17:30:21.000Z",
    "title": "Blackrock and Fidelity ETFs Lead the Charge in Bitcoin Accumulation, Holding Over $2.6 Billion in Combined BTC Assets",
    "url": "https://news.bitcoin.com/blackrock-and-fidelity-etfs-lead-the-charge-in-bitcoin-accumulation-holding-over-2-6-billion-in-combined-btc-assets/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/blackrock-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Blackrock and Fidelity ETFs Lead the Charge in Bitcoin Accumulation, Holding Over $2.6 Billion in Combined BTC Assets\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/blackrock-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/blackrock-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/blackrock-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/blackrock-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/blackrock-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/blackrock-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/blackrock.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Recent data reveals that Blackrock, the globe&#x2019;s leading asset manager boasting over nine trillion in assets under management (AUM), now possesses 33,430.56 bitcoin, valued at approximately $1.34 billion. Similarly, the financial powerhouse Fidelity has increased its bitcoin holdings, with the Fidelity Wise Origin spot bitcoin exchange-traded fund (ETF) now owning 30,169.54 bitcoin, equivalent to around [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T17:38:22.000Z",
    "title": "Bitcoin faces the $40,000 test as GBTC drains reserves",
    "url": "https://www.cryptopolitan.com/bitcoin-40000-test-as-gbtc-drains-reserves/",
    "description": "The cryptocurrency stage is set for a thrilling showdown as Bitcoin, the digital currency pioneer, grapples with the critical $40,000 mark. Amidst this nail-biting scenario, the Grayscale Bitcoin Trust (GBTC), a major asset manager, has been steadily unloading BTC, fueling tensions in an already edgy market. The turn of events has seen Bitcoin&#8217;s value dance [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T17:36:25.000Z",
    "title": "Musk claims audits show less antisemitism on X than other social media apps",
    "url": "https://www.cryptopolitan.com/musk-audit-shows-less-antisemitism-on-x/",
    "description": "Elon Musk, entrepreneur and CEO of various influential tech companies, has recently claimed that comprehensive audits conducted on his latest social media venture, referred to here as &#8220;X,&#8221; formerly known as Twitter, demonstrate a noteworthy reduction in antisemitic content when compared to other prominent social media apps. What is antisemitism? Antisemitism is prejudice against or [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T17:34:39.000Z",
    "title": "Dogecoin Price Prediction 2024-2033: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T17:34:10.000Z",
    "title": "U.S., UK, Australia tighten sanctions on Hamas crypto",
    "url": "https://www.cryptopolitan.com/us-uk-australia-sanctions-hamas-crypto/",
    "description": "The intricate web of international finance is witnessing a significant tightening of its threads as the United States, alongside its allies in the United Kingdom and Australia, intensifies sanctions against Hamas, particularly targeting the militant group&#8217;s use of cryptocurrency. This latest move by the US Department of the Treasury’s Office of Foreign Assets Control (OFAC) [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T17:26:10.000Z",
    "title": "Honda partners with Animoca Brands to develop automotive gameplay in Web3",
    "url": "https://www.cryptopolitan.com/honda-partners-with-animoca-brands/",
    "description": "Honda has partnered with Darewise Entertainment, a subsidiary of Animoca Brands, to co-create a novel Web3 automotive gameplay within the forthcoming AAA science fiction game Life Beyond. This collaboration signifies Honda&#8217;s deepening engagement in the metaverse, following its previous foray with the Hondaverse in Fortnite. By integrating its automotive expertise into Life Beyond, Honda is [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T17:23:28.000Z",
    "title": "Why are experts suddenly so bullish on U.S. economy?",
    "url": "https://www.cryptopolitan.com/experts-suddenly-so-bullish-on-us-economy/",
    "description": "Amidst the cacophony of dire predictions and economic doomsdays, the U.S. economy, much like a seasoned boxer, has ducked and weaved its way past a recession in 2023. Now, with 2024 unfolding, experts are not just optimistic but bullish about its prospects. This shift in sentiment is not based on whimsical hopes but on a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T17:11:33.000Z",
    "title": "Magpie Embarks on New Ventures with EigenLayer and SubDAO Eigenpie",
    "url": "https://www.cryptopolitan.com/magpie-eigenlayer-and-subdao-eigenpie/",
    "description": "In a significant leap forward in the decentralized finance (DeFi) landscape, multi-chain yield protocol Magpie has officially declared its collaboration with the Ethereum re-staking protocol EigenLayer. The strategic alliance is further accentuated by the creation of a SubDAO, named Eigenpie.  The new entity, Eigenpie, is set to redefine re-staking services through the innovative framework provided [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T17:11:19.000Z",
    "title": "Injective Innovates with Gas Compression: A Paradigm Shift in Blockchain Transaction Costs",
    "url": "https://www.cryptopolitan.com/injective-gas-compression-transaction-costs/",
    "description": "Injective is spearheading a transformative development in the blockchain industry with its latest introduction of gas compression technology. The significant advancement marks a monumental shift in reducing transaction costs, firmly establishing Injective as a trailblazer in offering the most competitive rates in the cryptocurrency landscape. Today&#8217;s launch is more than just the unveiling of a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T17:11:03.000Z",
    "title": "DeGate Launches Grid Strategy Event: Win a Share of $21,000 USDC Prize Pool",
    "url": "https://www.cryptopolitan.com/degate-grid-strategy-21000-usdc-prize-pool/",
    "description": "In an exciting development in the decentralized finance sector, DeGate is hosting a special Grid Strategy Event. Scheduled for just one week, from the 22nd to the 29th of January 2024, the event is not merely another trading opportunity; it represents a significant chance to engage in the financial markets innovatively.  With a considerable $21,000 [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T17:10:22.000Z",
    "title": "Concentric Finance Platform Faces Security Crisis: $1.6 Million Vanishes in DeFi Heist",
    "url": "https://www.cryptopolitan.com/concentric-finance-security-1-6-mil-heist/",
    "description": "In an alarming turn of events, Concentric Finance, a prominent player in the Decentralized Finance (DeFi) sector, has been victimized in a security breach. The unsettling incident has led to a staggering loss of $1.6 million, sending shockwaves through the DeFi community. Built on the robust Camelot v3 protocol, Concentric Finance was considered a stronghold [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-22T17:30:46.000Z",
    "title": "SOLANA PRICE ANALYSIS & PREDICTION (January 22) – SOL On The Verge Of Cracking Monthly Low Following 30% Drops In A Month ",
    "url": "https://nulltx.com/solana-price-analysis-prediction-january-22-sol-on-the-verge-of-cracking-monthly-low-following-30-drops-in-a-month/",
    "description": "Sol initiated a fresh drop Last Thursday and lost almost 15% of its valuation in the last five days. It continued bleeding today and is on the verge of breaking into a new monthly low. It is currently down by 6%. Following a series of lower low and lower high [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-22T17:30:00.000Z",
    "title": "3 reasons to watch Bitcoin this week",
    "url": "https://crypto.news/3-reasons-to-watch-bitcoin-this-week/",
    "description": "Though Bitcoin is lower, analysts are closely tracking the coin. Meanwhile, Bitcoin Minetrix presale has raised over $9 million"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-22T17:30:58.000Z",
    "title": "Bitcoin Puell Multiple At Crucial Juncture: Will Retest Save Rally?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-puell-multiple-crucial-retest-save-rally/",
    "description": "On-chain data shows the Bitcoin Puell Multiple indicator is currently retesting a crucial level that may end up deciding the fate of the latest rally. Bitcoin Puell Multiple Is Now Retesting Its 365-Day Moving Average As explained by an analyst in a CryptoQuant Quicktake post, the interaction of the Puell Multiple with its 365-day moving average (MA) can indicate trends in the market. The &#8220;Puell Multiple&#8221; refers to an indicator that keeps track of the ratio between the daily revenue of the Bitcoin miners (in USD) and the 365-day MA of the same. The mining revenue here is simply the total amount of coins issued by the network inside a 24-hour span multiplied by the spot price of the coin. Related Reading: Cardano To $7? Analyst Predicts When ADA Will Resume Uptrend When the value of the Puell Multiple is greater than 1, it means that the miners are currently making a higher income than the average value for the past year. Naturally, when this happens, the motive to sell would rise for these chain validators and thus, the BTC price may be considered overvalued. On the other hand, values under the mark suggest the cryptocurrency&#8217;s price may be becoming undervalued as the miners are now making lower revenues than the 365-day average. Now, here is a chart that shows the trend in the Bitcoin Puell Multiple, as well as its 365-day MA, over the history of the asset: The two lines appear to have come together in recent days &#124; Source: CryptoQuant As displayed in the above graph, the Bitcoin Puell Multiple had naturally spiked to high levels just earlier when the asset&#8217;s price had observed its rally, which had naturally resulted in the block rewards of the miners also shooting up. As the price of the asset has struggled recently, though, the indicator&#8217;s value has come back down and is now retesting its 365-day MA. This line has been relevant historically for the metric, as the quant highlighted in the chart. Generally, a break above the line has proven to be bullish for the cryptocurrency, while a move under can imply a transition towards a bearish trend. As such, Bitcoin might be standing at a crucial juncture right now, at least from the perspective of this indicator. Last year, the Puell Multiple also witnessed a similar retest at its 365-day MA, as is apparent in the graph. Back then, the metric had ended up finding support at this important line, and the resulting bounce was what led towards the latest rally in the asset. Related Reading: Bitcoin NVT Golden Cross Shoots Bullish Signal, Rally To Restart? It now remains to be seen whether the 365-day MA would act as support this time as well or if the indicator would go through a breakdown. In the latter scenario, the Bitcoin price could end up observing a deeper correction. BTC Price Bitcoin&#8217;s struggle has continued recently as its price has come down to just $40,800. Looks like the price of the coin has slipped down recently &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-22T17:31:35.000Z",
    "title": "Bitcoin’s Fate Hangs in the Balance: GBTC Liquidation vs. Novogratz’s Bullish Outlook",
    "url": "https://www.crypto-news-flash.com/bitcoins-fate-hangs-in-the-balance-gbtc-liquidation-vs-novogratzs-bullish-outlook/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoins-fate-hangs-in-the-balance-gbtc-liquidation-vs-novogratzs-bullish-outlook",
    "description": "<img width=\"1812\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background.\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background.jpg 1812w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-1024x678.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-768x509.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-1536x1017.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-150x99.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-450x298.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Bitcoin-BTC-logo-with-red-falling-prices-trading-chart-background-1200x795.jpg 1200w\" sizes=\"(max-width: 1812px) 100vw, 1812px\" />Analyst Chris J Terry attributes the trend to the ongoing liquidation of Grayscale Bitcoin Trust (GBTC), anticipating around $25 billion in selling activity. BitMEX CEO Arthur Hayes adopts a cautious stance, initiating a long position in put options with a $35,000 strike. The world&#8217;s largest cryptocurrency Bitcoin (BTC) is facing significant selling pressure with the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-22T17:25:27.000Z",
    "title": "700,000 Bitcoin Sell-Off Warning: Crypto Expert Predicts Massive 2024 Shake-Up",
    "url": "https://www.crypto-news-flash.com/700000-bitcoin-sell-off-warning-crypto-expert-predicts-massive-2024-shake-up/?utm_source=rss&utm_medium=rss&utm_campaign=700000-bitcoin-sell-off-warning-crypto-expert-predicts-massive-2024-shake-up",
    "description": "<img width=\"1792\" height=\"1024\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-17-13.26.46-Revise-the-illustration-to-ensure-the-correct-spelling-of-ProShares-in-a-visually-striking-and-prominent-manner.-Include-the-phrase-Bitcoin-ETF-Evo.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-17-13.26.46-Revise-the-illustration-to-ensure-the-correct-spelling-of-ProShares-in-a-visually-striking-and-prominent-manner.-Include-the-phrase-Bitcoin-ETF-Evo.png 1792w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-17-13.26.46-Revise-the-illustration-to-ensure-the-correct-spelling-of-ProShares-in-a-visually-striking-and-prominent-manner.-Include-the-phrase-Bitcoin-ETF-Evo-300x171.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-17-13.26.46-Revise-the-illustration-to-ensure-the-correct-spelling-of-ProShares-in-a-visually-striking-and-prominent-manner.-Include-the-phrase-Bitcoin-ETF-Evo-1200x686.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-17-13.26.46-Revise-the-illustration-to-ensure-the-correct-spelling-of-ProShares-in-a-visually-striking-and-prominent-manner.-Include-the-phrase-Bitcoin-ETF-Evo-768x439.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-17-13.26.46-Revise-the-illustration-to-ensure-the-correct-spelling-of-ProShares-in-a-visually-striking-and-prominent-manner.-Include-the-phrase-Bitcoin-ETF-Evo-1536x878.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-17-13.26.46-Revise-the-illustration-to-ensure-the-correct-spelling-of-ProShares-in-a-visually-striking-and-prominent-manner.-Include-the-phrase-Bitcoin-ETF-Evo-150x86.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-17-13.26.46-Revise-the-illustration-to-ensure-the-correct-spelling-of-ProShares-in-a-visually-striking-and-prominent-manner.-Include-the-phrase-Bitcoin-ETF-Evo-450x257.png 450w\" sizes=\"(max-width: 1792px) 100vw, 1792px\" />A recent analysis by Kiarash Hossainpour, founder of Colorways Ventures and The Consensus, shows that a massive sell-off might be on the horizon. The experts reveal that 281,045 BTC ($12 billion) is still under selling pressure and could bring a huge shake-up in 2024. A recent analysis shows that billions worth of Bitcoin (BTC) could [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-22T17:16:00.000Z",
    "title": "Analyst Predicts Solana May Hit $70 Low As Bearish Pressure Sustains",
    "url": "https://coinedition.com/crypto-analyst-predicts-solana-could-hit-a-low-of-70/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Price-of-Solana-SOL-Could-Rise-to-19.933-in-the-Next-Few-Days.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Crypto Analyst Predicts Solana Could Hit a Low of $70\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Price-of-Solana-SOL-Could-Rise-to-19.933-in-the-Next-Few-Days.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Price-of-Solana-SOL-Could-Rise-to-19.933-in-the-Next-Few-Days-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Price-of-Solana-SOL-Could-Rise-to-19.933-in-the-Next-Few-Days-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Price-of-Solana-SOL-Could-Rise-to-19.933-in-the-Next-Few-Days-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Price-of-Solana-SOL-Could-Rise-to-19.933-in-the-Next-Few-Days-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Price-of-Solana-SOL-Could-Rise-to-19.933-in-the-Next-Few-Days-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Cryptocurrency analyst “Bluntz Capital” has suggested that Solana’s recent price movement may be indicating a steeper fall in the digital asset’s value amidst the prevailing bearish market conditions.&#160; The analyst noted this possibility in a tweet on the social media platform (formerly Twitter), hinting that the altcoin may be gearing up to test a new [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/crypto-analyst-predicts-solana-could-hit-a-low-of-70/\">Analyst Predicts Solana May Hit $70 Low As Bearish Pressure Sustains</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]