[
  {
    "source": "CryptoSlate",
    "date": "2023-11-20T10:55:06.000Z",
    "title": "Bitcoin network hits record-breaking 551 EH/s hash rate as sixth straight difficulty increase looms",
    "url": "https://cryptoslate.com/insights/bitcoin-network-hits-record-breaking-551-eh-s-hash-rate-as-sixth-straight-difficulty-increase-looms/",
    "description": "<p>Quick Take The midway point in the current difficulty epoch, set to adjust on Nov. 26, paints a picture of robust growth and resilience for the network. Current projections suggest a positive upward adjustment of the difficulty level by 3.77%, continuing the positive adjustments seen over the last five adjustments. The network recorded a record-breaking [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoin-network-hits-record-breaking-551-eh-s-hash-rate-as-sixth-straight-difficulty-increase-looms/\">Bitcoin network hits record-breaking 551 EH/s hash rate as sixth straight difficulty increase looms</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-20T10:50:27.000Z",
    "title": "Is this the next crypto AI surge?",
    "url": "https://cryptodaily.co.uk/2023/11/is-this-the-next-crypto-ai-surge",
    "description": "At the beginning of this year AI crypto projects had a strong move to the upside. As the crypto bull market starts to move into gear, the AI niche is beginning a run."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-20T11:01:43.000Z",
    "title": "Crypto security boosted with Mastercard-Feedzai partnership",
    "url": "https://www.cryptopolitan.com/crypto-boosted-with-mastercard-feedzai/",
    "description": "Mastercard has announced a partnership with Feedzai, a leading regulatory technology platform known for its advanced artificial intelligence capabilities in combating online financial crime. This collaboration aims to proactively address the escalating issue of fraud associated with cryptocurrencies. Feedzai&#8217;s expertise in detecting online financial frauds is expected to be a game-changer in this partnership. Combining ... <a title=\"Crypto security boosted with Mastercard-Feedzai partnership\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-boosted-with-mastercard-feedzai/\" aria-label=\"More on Crypto security boosted with Mastercard-Feedzai partnership\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-20T10:45:15.000Z",
    "title": "North Korean ties suspected in Indexed Finance treasury attack",
    "url": "https://crypto.news/north-korean-ties-suspected-in-indexed-finance-treasury-attack/",
    "description": "On-chain sleuth ZachXBT says an alleged North Korean cybercriminal might be behind the attack against Indexed&#8217;s treasury. A cybercriminal allegedly associated with DPRK initiated a hostile proposal on Nov. 18, targeting the remnants of Indexed Finance. This defunct decentralized protocol&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-20T10:45:26.000Z",
    "title": "Argentina Welcomes First Pro-Bitcoin President, BTC Price Surges Above $37,000",
    "url": "https://www.newsbtc.com/news/bitcoin/argentina-pro-bitcoin-president/",
    "description": "In a historical moment for both the nation and the crypto community, Argentina has ushered in a new era by welcoming its first-ever pro-Bitcoin President.  Argentina Elects Pro Bitcoin President On November 19, Argentina released the results of its presidential election. Reports of the election results reveal that right-wing libertarian and Bitcoin advocate, Javier Milei won almost 56% out of 90% of votes counted. While his rival candidate, Minister Sergio Massa garnered 44% of the votes.  Related Reading: Crypto Analyst Predicts XRP Price Will Reach $1.35 As These Metrics Heat Up The momentous victory positions Milei as the face of a new era in Argentina, marked by his stated commitment to solving inflationary problems in the country by abolishing the country’s Central Bank and using digital currencies like Bitcoin.  In a public victory speech to his supporters in Buenos Aires, Milei declared that the transformative process of Argentina had just begun and the country was on its way to economic recovery. He promised to work with all the nations to help develop Argentina and make it a better country.  “Today begins the reconstruction of Argentina. Today begins the end of Argentina’s decline. The model of decadence has come to an end. There is no way back,” Milei stated.  He further added that “Argentina will return to its place in the world that it should never have lost. We are going to work shoulder-to-shoulder with all nations of the free world, to help build a better world.” Former President of the United States, Donald Trump commended Milei on securing victory in the Argentinian Presidential election. He expressed his pride in Milei’s incredible feat and stated his anticipation for Milei’s efforts in restoring Argentina.  “Congratulations to Javier Milei on a great race for President of Argentina. The whole world was watching! I am very proud of you. You will turn your Country around and truly Make Argentina Great Again,” Trump stated.  BTC Price Surges As Argentina Embraces New Era Of Crypto Following the news of Javier Milei’s victory in Argentina’s Presidential elections, Bitcoin price has been on an upward trend, trading above the $37,000 mark. The price of the cryptocurrency at the time of writing is $37,199 according to CoinMarketCap.  Related Reading: Dogecoin Metrics Signal Impending Breakout, How High Can The Price Go? One of Milei’s primary policy plans as Argentina’s President is to discontinue the use of the Argentinian peso and adopt the United States Dollar as the country’s main currency. He has also mulled over the introduction of Bitcoin as a potential legal tender and declared possibilities of launching a Central Bank Digital Currency (CBDC) in Argentina.  While the proposals aim to significantly reduce the long-lasting inflationary crisis in the Argentinian economy, the involvement of Bitcoin could potentially herald a new wave of economic growth for the crypto industry. BTC recovers following Milei's win &#124; Source: BTCUSD on Tradingview.com Featured image from Cryptopolitan, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-20T10:53:13.000Z",
    "title": "Bitcoin Skyrockets as BTC Supporter Javier Milei Secures Argentine Presidency",
    "url": "https://www.crypto-news-flash.com/bitcoin-skyrockets-as-btc-supporter-javier-milei-secures-argentine-presidency/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-skyrockets-as-btc-supporter-javier-milei-secures-argentine-presidency",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Bitcoin-BTC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Bitcoin-BTC.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Bitcoin-BTC-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Bitcoin-BTC-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Bitcoin-BTC-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Bitcoin-BTC-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Bitcoin-BTC-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Argentina has voted in pro-Bitcoin candidate Javier Milei as President. The plans for Bitcoin are not completely unraveled yet but Milei plans to abolish the Central Bank. In a stunning turn of events, Javier Milei, an unconventional libertarian and ardent supporter of Bitcoin (BTC), has emerged victorious in the Argentine presidential race, securing 56% of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-20T10:46:19.000Z",
    "title": "Solana (SOL) at Risk of Dropping Below $50; Investors Shift to Mantle (MNT) & InQubeta (QUBE)",
    "url": "https://www.crypto-news-flash.com/solana-sol-at-risk-of-dropping-below-50-investors-shift-to-mantle-mnt-inqubeta-qube/?utm_source=rss&utm_medium=rss&utm_campaign=solana-sol-at-risk-of-dropping-below-50-investors-shift-to-mantle-mnt-inqubeta-qube",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-73.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-73.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-73-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the ever-shifting sands of the crypto market, change is the only constant. Lately, Solana (SOL), a once-celebrated star in the crypto universe, has been facing a cloud of uncertainty, potentially dipping below the $50 mark. This situation has forced investors to look towards newer, brighter horizons. Enter InQubeta (QUBE) and Mantle (MNT), two top [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-20T11:05:22.000Z",
    "title": "The Crypto Agenda of Javier Milei, Argentina’s President",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/the-ambitious-crypto-agenda-of-javier-milei-argentinas-president/",
    "description": "<p>The charismatic economist and political outsider has captured the nation&#8217;s attention with his unorthodox campaign and promises of economic revitalization through embracing digital currencies. As Milei assumes the highest office in the country, the world is eager to see how his pro-crypto stance will shape Argentina&#8217;s economic policies. In this article, we&#8217;ll take a look [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/the-ambitious-crypto-agenda-of-javier-milei-argentinas-president/\">The Crypto Agenda of Javier Milei, Argentina’s President</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-20T10:57:00.000Z",
    "title": "When is the Best Time to Buy Crypto? John Deaton Says Before the FOMO",
    "url": "https://coinedition.com/when-is-the-best-time-to-buy-crypto-john-deaton-says-before-the-fomo/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bears Capture AVAX Market After Bulls Fail to Breach $21.84 Resistance\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a series of tweets on X, reputed crypto lawyer and long-time pro-XRP advocate John Deaton put on his financial advisor hat and preached to the crypto community about how to profit off price surges.&#160;&#160; One user on X tweeted that they lost money after acting on a post from the lawyer. In response, Deaton, [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/when-is-the-best-time-to-buy-crypto-john-deaton-says-before-the-fomo/\">When is the Best Time to Buy Crypto? John Deaton Says Before the FOMO</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]