[
  {
    "source": "CoinDesk",
    "date": "2023-06-23T16:24:19.000Z",
    "title": "Bitcoin Hits One-Year High, Soars Past $31.3K",
    "url": "https://www.coindesk.com/markets/2023/06/23/bitcoin-hits-one-year-high-soars-past-313k/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The largest cryptocurrency by market capitalization has been surging this week after three financial services giants filed applications for spot bitcoin ETFs."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-23T16:13:34.000Z",
    "title": "Sam Bankman-Fried Can't Subpoena Law Firm Fenwick & West for Documents, U.S. Judge Rules",
    "url": "https://www.coindesk.com/policy/2023/06/23/sam-bankman-fried-cant-subpoena-law-firm-fenwick-west-for-documents-us-judge-rules/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The founder of collapsed crypto enterprise FTX had argued legal advice from the Silicon Valley law firm was \"at the core\" of the government's criminal allegations against him."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-23T16:20:48.000Z",
    "title": "Robert F. Kennedy Jr. Praises Bitcoin, Says CBDCs Are 'Instruments of Control'",
    "url": "https://decrypt.co/145951/robert-f-kennedy-jr-praises-bitcoin-says-cbdcs-are-instruments-of-control",
    "description": "In a recent interview with New York Post, Kennedy added that CBDCs \"are certain to be abused.”"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-23T16:30:00.000Z",
    "title": "SEC waives BlockFi's $30M fine until creditors are paid ",
    "url": "https://cointelegraph.com/news/sec-waives-blockfi-fine-until-creditors-are-paid",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/ba6b772a-4d60-462c-9b4a-ed625aafbeb8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The U.S. SEC was at the top of BlockFi creditor's list with a $30 million settlement balance from February 2022.</p>\n                    <p><p>The United States Securities and Exchange Commission (SEC) has agreed to postpone the payment of a $30 million fine from bankrupt crypto lender BlockFi until creditors are paid back. The amount represents the balance of a $50 million settlement with the regulator from February 2022. </p><p><a href=\"https://restructuring.ra.kroll.com/blockfi/Home-DocketInfo\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to June 22 court filings, the SEC will forgo the amount owed by BlockFi to \"maximize\" and avoid delays in funds' distribution to investors \"until payment in full of all other Allowed Claims.\" The document stated: \"The Commission has agreed to forego participating in any distributions under the Plan or requiring any cash reserve in connection with such distributions.\"</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/5be1876f-0861-450e-9f16-435fdd2f8bdb.png\"  /></figure><p>In February 2022, the SEC <a href=\"https://www.sec.gov/news/press-release/2022-26\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> actions against the crypto lending company over its failure to register its high-yield interest accounts as securities. BlockFi agreed to pay $50 million to the regulator as part of the settlement and another $50 million to 32 U.S. states filing similar complaints.</p><p>According to court documents, the SEC was at the top of BlockFi creditor's list, along with West Realm Shires Services Inc. (doing business as FTX US). BlockFi <a href=\"https://cointelegraph.com/news/blockfi-files-for-bankruptcy-as-many-expected-cites-ftx-collapse-for-its-troubles\">filed for Chapter 11 bankruptcy</a> protection in late November after the FTX crisis raised questions about its financial health. According to its bankruptcy filing, BlockFi had $256.9 million in liquidity at that time.</p><p>On May 11, a federal judge <a href=\"https://cointelegraph.com/news/blockfi-users-to-get-back-297m-from-wallet-accounts-report\">granted BlockFi permission</a> to return $297 million to customers with deposits held in its Wallet program. The refund did not apply to users of BlockFi Interest Accounts (BIA) that were used in its lending business and are property of the bankruptcy estates. BlockFi's BIA accounts hold over $375 million.</p><p>BlockFi will also<a href=\"https://cointelegraph.com/news/blockfi-to-provide-over-100k-in-refunds-to-california-clients\"> refund more than $100,000 to California customers</a> who continued to repay loans even after the company halted trading on Nov. 10 last year. An investigation by California's Department of Financial Protection and Innovation discovered that at least 111 borrowers in the state made roughly $103,471 in loan repayments after the bankruptcy filing.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-miami-2023-shitcoins-for-bitcoin/\"><strong><em>Bitcoin 2023 in Miami comes to grips with ‘shitcoins on Bitcoin’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-23T16:14:00.000Z",
    "title": "Robust crypto fundamentals pull through after May’s monthly red candle: Report",
    "url": "https://cointelegraph.com/news/robust-crypto-fundamentals-overcome-bearish-may",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/b49da22c-73e7-44a4-908d-ba1f074ea2b6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>What are the current trends in VC investment in the crypto sector, and when will the bear market finally end? </p>\n                    <p><p>In May, Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\"><strong>BTC</strong></a>) posted its first monthly loss <a href=\"https://www.coinglass.com/today\" target=\"_blank\" rel=\"noopener nofollow\"><strong>since December 2022 with a negative 6.98%</strong></a>. However, this consolidation was not obviously driven by a change in fundamentals or the broader macroeconomic environment. The crypto market was looking for direction and liquidity in this phase before the United States Federal Reserve announced a pause on the rate hiking cycle in June. </p><p>Many indicators, such as the futures market and VC investment, point to an optimistic underlying sentiment. But while traditional markets and tech stocks were able to continue their rally in May, actual price action in the crypto market remained suppressed and took some time to spring from its woodworks. </p><p class=\"post-content__accent post-content__accent_small\"><a href=\"https://research.cointelegraph.com/reports/detail/investor-insights-report-robust-fundamentals-remain-amid-first-red-month-of-the-year\"><em>The report is available for free on the Cointelegraph Research Terminal.</em></a></p><p>For those keen to gain a deeper understanding of the crypto space’s various sectors and their fundamental trends, Cointelegraph Research publishes a monthly Investors Insights Report that dives into venture capital, derivatives, <a href=\"https://cointelegraph.com/defi-101/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a>, regulation and much more.</p><h2>Mining stocks rally, while VC activity shows signs of life</h2><p>Blue chip crypto stocks also saw a strong month posting a month-over-month return of 7%. Mining operations and other established ventures continued to benefit from the previous phase of the market’s recovery back in March. The most notable gains were again made by mining stocks. After the explosion of TeraWulf’s evaluation, Bit Digital followed suit, and its stock rose by an astonishing 77% after <a href=\"https://in.investing.com/news/bit-digital-announces-expansion-of-mining-operations-into-iceland-432SI-3650206\" target=\"_blank\" rel=\"noopener nofollow\">mining operations in Iceland</a> were announced. </p><p>Many overleveraged mining companies had been battered throughout the bear market due to tightening credit conditions and decreasing BTC prices, which now gives competitors a chance to rapidly raise evaluations. As most now expect Bitcoin to already have hit its low for the current cycle, new mining facilities with low electricity prices and the newest hardware appear less risky to investors than other sectors of the crypto market. </p><p>Meanwhile, according to <a href=\"https://research.cointelegraph.com/reports/detail/venture-capital-database\">Cointelegraph Research’s Venture Capital Database</a>, VC investment surpassed $1 billion for the first time since September 2022 last month. It rose by 34% from April, and 81 deals were recorded. This is the third consecutive uptick in VC investment, but it is unclear if this means activity will rise sustainably from bear market levels. In a greater context, inflows remain below one-fourth of bull market levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/5b882793-67b1-4c09-90bd-444bf75475a9.jpg\"  /></figure><h2>BTC sees strongest network activity of the bear market</h2><p>Historically, there have been many ways to inscribe data on the Bitcoin blockchain. For a long time, the most popular options were OP_Return scripts, which formed the backbone of Omni and Counterparty nonfungible tokens (NFTs). However, through a loophole introduced via the Taproot scripting language, the recently hyped-up Ordinals protocol permits much larger inscriptions — in theory, up to 4MB. </p><p>After the addition of fungible, so-called BRC-20 tokens to the Ordinals protocol, the Bitcoin network experienced its first significant fee spike since 2021. This was a positive for miners, who benefitted from spikes in revenue. The ratio of fee revenues to total mining revenues briefly hit its second-highest level in history at 43% on May 8. In the weeks after, it dropped to around 5%, which is still significantly elevated from levels at the start of the year.</p><p>It remains to be seen whether the recently added feature to <a href=\"https://cointelegraph.com/news/bitcoin-ordinals-to-bridge-ethereum-nft-with-new-standard\">migrate ERC-721 tokens from Ethereum</a> to the Bitcoin blockchain can revive the hype, or if fee revenues will fade back into insignificance within the greater context of mining economics. The mining section of the Cointelegraph Research Monthly Trends report provides a monthly round-up of quantitative mining metrics and will monitor this development closely. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/9689b051-16d0-4d9b-ae3e-d1c5d363d2fe.jpg\"  /></figure><h2>The Cointelegraph Research team</h2><p>Cointelegraph’s Research department comprises some of the best talents in the blockchain industry. Bringing together academic rigor and filtered through practical, hard-won experience, the researchers on the team are committed to bringing the most accurate, insightful content available on the market.</p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template><p>Demelza Hays, Ph.D., is the director of research at Cointelegraph. Hays has compiled a team of subject matter experts from finance, economics and technology to bring the premier source for industry reports and insightful analysis to the market. The team utilizes APIs from various sources to provide accurate, useful information and analyses. </p><p>With decades of combined experience in traditional finance, business, engineering, technology and research, the <a href=\"https://research.cointelegraph.com/\">Cointelegraph Research team</a> is perfectly positioned to put its combined talents to proper use with the latest Investor Insights Report. </p><p class=\"post-content__disclaimer\">The opinions expressed in this article are for general informational purposes only and are not intended to provide specific advice or recommendations for any individual or on any specific security or investment product.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-23T16:18:58.000Z",
    "title": "Bitcoin breaks $31k as it continues to shake off recent slumps",
    "url": "https://cryptoslate.com/bitcoin-breaks-31000/",
    "description": "<p>As ongoing regulatory pressures ramp up towards several cryptocurrencies, Bitcoin (BTC)has shown impressive resilience, breaking the $31,000 barrier today and marking its highest close of the year. This jump comes after a prolonged period of stagnant trading, with Bitcoin wavering between $25,000 and $30,000 since March 16. The liquidation volumes for each cryptocurrency over the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-breaks-31000/\">Bitcoin breaks $31k as it continues to shake off recent slumps</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-23T16:14:32.000Z",
    "title": "Supreme court rules in favor of Coinbase, issues order to move user lawsuit into arbitration",
    "url": "https://cryptoslate.com/supreme-court-rules-in-favor-of-coinbase-issues-order-to-move-user-lawsuit-into-arbitration/",
    "description": "<p>The U.S. Supreme Court ruled in favor of cryptocurrency exchange Coinbase in a dispute involving the enforcement of arbitration clauses on June 23, Reuters reported. The court issued an order to halt proceedings in one of the pending customer lawsuits — Bielski vs. Coinbase — while the exchange followed up on its appeal. A second [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/supreme-court-rules-in-favor-of-coinbase-issues-order-to-move-user-lawsuit-into-arbitration/\">Supreme court rules in favor of Coinbase, issues order to move user lawsuit into arbitration</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-23T16:31:54.000Z",
    "title": "Analyst Lark Davis Explains What Are the Five Worst Times to Buy Crypto",
    "url": "https://www.cryptoglobe.com/latest/2023/06/analyst-lark-davis-explains-what-are-the-five-worst-times-to-buy-crypto/",
    "description": "In a recent video update, successful crypto investor and prominent crypto analyst Lark Davis discussed the five worst times to invest in cryptocurrencies. Davis shared the following insights to help investors avoid common pitfalls and increase their chances of success: Buying at Listing: Davis begins by cautioning against buying a coin immediately after it’s listed. […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-23T16:30:00.000Z",
    "title": "IMF still pushing CBDCs while continuing to highlight crypto risk",
    "url": "https://cryptodaily.co.uk/2023/06/imf-still-pushing-cbdcs-while-continuing-to-highlight-crypto-risk",
    "description": "<p>A recent IMF post was extremely favourable towards countries in Latin America and the Caribbean using central bank digital currencies, while denigrating El Salvador&rsquo;s adoption of Bitcoin.</p>\n<p>The post by the International Monetary Fund suggested that Latin American and Caribbean (LAC) countries were making &ldquo;significant strides in the introduction of central bank digital currencies (CBDCs).</p>\n<p>It cited the four Latin American countries of Brazil, Argentina, Colombia, and Ecuador, as ranking among the top 20 countries in 2022 for adoption of crypto assets.</p>\n<p>However, the IMF post chose to go along with the perceived disadvantages of these potential adoptions citing:</p>\n\n<p>&ldquo;crypto asset adoption also presents numerous challenges and risks, particularly for vulnerable LAC countries with a history of macroeconomic instability, low institutional credibility, substantial capital flows, corruption, and extensive informal sectors.&rdquo;</p>\n\n<p>On the subject of adoption, the IMF authors pointed out how the Dominican Republic and Argentina had prohibited the use of crypto assets, citing the concerns of &ldquo;financial stability, currency and asset substitution, tax evasion, corruption and money laundering&rdquo;.</p>\n<p>It was not mentioned that the IMF itself had obliged the Argentinian central bank to insert an anti-crypto clause in its agreement over a recent IMF bailout.</p>\n<p>The IMF said that it had carried out a survey of government officials in the LAC region and half of them had replied that they were considering retail and wholesale CBDC options.&nbsp;</p>\n\n<p>&ldquo;Most survey participants viewed CBDCs as a means to enhance their payment systems and broaden their access. They deemed financial inclusion and monetary sovereignty as crucial factors in favor of retail CBDC issuance by facilitating the integration of unbanked individuals and curbing currency substitution towards stablecoins or crypto assets.&rdquo;</p>\n\n<p>However, the IMF admitted that CBDC takeup was &ldquo;slow&rdquo; for the ECCU and the Bahamas, and stated that it was for this reason that these countries must promote CBDC adoption and raise public awareness of them.</p>\nOpinion\n<p>The IMF has a profound belief in fiat currencies, and the dollar in particular. It has spent the last several decades of its existence providing loans to primarily third world countries, thereby enslaving them in yet more debt.</p>\n<p>For such an organisation crypto assets are anathema, to be prohibited and repressed at any cost, despite acknowledging the obvious advantages that the crypto industry has brought to finance.</p>\n<p>That El Salvador might be having success with its bitcoin adoption strategy must be making officials at the IMF wring their hands with worry.&nbsp;</p>\n<p>Should the IMF be successful in urging some of these countries in the LAC region to adopt CBDCs then it can be expected that their citizens will be utterly controlled and enslaved.</p>\n<p>Hopefully citizens will have the education to reject a CBDC, just as is the case in Nigeria, where only 0.5% of the population are using the eNaira as a transaction option, even in the face of cash shortages.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-23T16:30:43.000Z",
    "title": "Institutional Interest Fuels Crypto Rally as Market Adds $110 Billion in 7 Days",
    "url": "https://news.bitcoin.com/institutional-interest-fuels-crypto-rally-as-market-adds-110-billion-in-7-days/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/22787-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Institutional Interest Fuels Crypto Rally as Market Adds $110 Billion in 7 Days\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/22787-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/22787-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/22787-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/22787-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/22787-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/22787-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/22787.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />During the past week, crypto assets increased in value by 9.62%, rising from $1.10 trillion to the current $1.21 trillion. Apart from the listed stablecoins, the top 20 crypto assets by market capitalization all experienced gains this week, as $110 billion was injected into the crypto economy. Crypto Market Surges, Rally Led by Pepe, Stacks, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T16:35:54.000Z",
    "title": "US Supreme Court supports Coinbase in landmark ruling on arbitration",
    "url": "https://www.cryptopolitan.com/us-supreme-court-supports-coinbase-in-landmark-ruling-on-arbitration/",
    "description": "In a significant victory for Coinbase Global Inc., a unit of the prominent cryptocurrency exchange, the US Supreme Court has ruled in favor of the company, reinforcing the ability of businesses to direct customer and employee disputes into arbitration. This decision, voted 5-4 by the justices, establishes that lawsuits filed in federal court must be ... <a title=\"US Supreme Court supports Coinbase in landmark ruling on arbitration\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-supreme-court-supports-coinbase-in-landmark-ruling-on-arbitration/\" aria-label=\"More on US Supreme Court supports Coinbase in landmark ruling on arbitration\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T16:31:39.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution that recently gained popularity among Ethereum users for executing ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T16:20:48.000Z",
    "title": "Binance.US addresses USD withdrawal concerns and raises caution on possible service discontinuation",
    "url": "https://www.cryptopolitan.com/binanceus-addresses-usd-withdrawal-concerns/",
    "description": "Binance.US, one of the most popular crypto exchanges in the US, has recently taken steps to address worries about the ability to withdraw USD and put out a warning about the possibility of stopping service. As the rules about cryptos continue to change, the exchange wants to ensure it stays in line while giving its ... <a title=\"Binance.US addresses USD withdrawal concerns and raises caution on possible service discontinuation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binanceus-addresses-usd-withdrawal-concerns/\" aria-label=\"More on Binance.US addresses USD withdrawal concerns and raises caution on possible service discontinuation\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-23T16:27:04.000Z",
    "title": "SAP partners with Circle to explore cross-border payment systems",
    "url": "https://crypto.news/sap-partners-with-circle-to-explore-cross-border-payment-systems/",
    "description": "SAP, the prominent German software company, has embarked on cross-border payment testing by utilizing Circle's USDC stablecoin."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-23T16:13:27.000Z",
    "title": "MUFG may issue stablecoin via Progmat blockchain platform",
    "url": "https://crypto.news/mufg-may-issue-stablecoin-via-progmat-blockchain-platform/",
    "description": "Mitsubishi UFJ Financial Group Inc. is currently in negotiations with several businesses about issuing stablecoins, a form of digital asset, through its blockchain platform Progmat."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-23T16:30:17.000Z",
    "title": "Bitcoin Unstoppable Rise: Price Breaks Through $31,000 Setting New Annual High",
    "url": "https://www.newsbtc.com/breaking-news-ticker/bitcoin-unstoppable-rise-price-breaks-through-31000-setting-new-annual-high/",
    "description": "Bitcoin (BTC), the largest cryptocurrency in the market, is continuing its unstoppable uptrend. After consolidating for a short period between $29,900 and $30,300, BTC has marked a new annual high and breached the $31,000 mark, which it had not surpassed since June 2022.  As of this writing, the leading cryptocurrency in the market is trading at $31,300, representing a surge of over 4% in the last 24 hours. Related Reading: Ethereum Bullsh Signal: Supply On Exchanges Continues To Hit New All-Time Lows This recent price increase is a positive development for Bitcoin, demonstrating the resilience and potential for continued growth and adoption in the cryptocurrency market. The consolidation period that preceded this new high indicates that investors were likely accumulating BTC in anticipation of a breakout.  Could Bitcoin Reach $35,000 Soon? There&#8217;s good news for Bitcoin bulls, as the cryptocurrency has broken its nearest resistance level at $31,000 and aims to reach $31,500. If Bitcoin can break this last bear threshold, the road to $35,000 may be served on a silver platter for the bulls.  Additionally, the recent news of Blackrock&#8217;s Bitcoin spot ETF and major Wall Street giants expressing interest in investing in Bitcoin may further fuel investor sentiment and propel Bitcoin&#8217;s bull run. However, Bitcoin must hold its current price level to prevent this price action from being just a short squeeze followed by a further pullback. If the current price level is sustained, it could provide a solid foundation for continued growth and upward momentum. As the chart above indicates, Bitcoin’s ADX (Average Directional Index) is currently peaking upwards, signifying the current trend&#8217;s strength. The ADX is a technical indicator commonly used to quantify the strength of a trend in the financial markets. The ADX calculation is based on a moving average of the price range expansion over a given period. It measures the degree to which a market is trending, and it provides traders with a way to identify the strength of a trend and determine whether it is worth trading. When the ADX rises, the trend gains strength, while a falling ADX indicates that the trend is losing momentum. A high ADX reading suggests a strong trend is in place, while a low ADX reading suggests that the market is in a range-bound or choppy state. Related Reading: Stacks (STX) Succumbs To Market Correction, Slides By 10% In The Last Day Bitcoin&#8217;s ongoing uptrend shows no signs of slowing down, and the cryptocurrency is gaining momentum, causing concern for bears. However, the influx of new investors entering the BTC market may increase its volatility, posing the risk of liquidating late long positions that could impede Bitcoin&#8217;s bullish movement. Overall, Bitcoin&#8217;s recent performance is a trend to watch in the coming weeks and months, as it will likely have a significant impact on the broader cryptocurrency market and may attract increased attention from investors, regulators, and the public. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T16:34:04.000Z",
    "title": "Monero (XMR) Surges to the Top and Leaves ZCash and Dash Behind: Privacy Coin Leads Crypto Market Gainers Amidst Rising Demand",
    "url": "https://www.crypto-news-flash.com/monero-xmr-surges-to-the-top-and-leaves-zcash-and-dash-behind-privacy-coin-leads-crypto-market-gainers-amidst-rising-demand/?utm_source=rss&utm_medium=rss&utm_campaign=monero-xmr-surges-to-the-top-and-leaves-zcash-and-dash-behind-privacy-coin-leads-crypto-market-gainers-amidst-rising-demand",
    "description": "Monero, Zcash, and Dash record an incredible surge as the crypto market attempts to bounce back. Binance has decided to delist the &#8220;so-called&#8221; privacy coins following the recent enforcement actions by authorities.  Monero appears very bullish in the market after surging by 12 percent in the last seven days and 3.4 percent in the last [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T16:30:03.000Z",
    "title": "Finding Best Meme Coins With Untapped Gains for June 2023",
    "url": "https://www.crypto-news-flash.com/finding-best-meme-coins-with-untapped-gains-for-june-2023/?utm_source=rss&utm_medium=rss&utm_campaign=finding-best-meme-coins-with-untapped-gains-for-june-2023",
    "description": "The cryptocurrency world is a dynamic space, constantly evolving and spawning innovative trends that are reshaping our understanding of digital finance. Within this vibrant domain, the phenomenon of meme coins has taken center stage, and Hollywood x Pepe stands out as a trailblazer. By redefining investment narratives and blending pop culture elements with blockchain technology, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-23T16:31:00.000Z",
    "title": "FTX Takes Legal Action: Sues Ex-Clinton Aide Firm K5 Global for $700M",
    "url": "https://coinedition.com/ftx-takes-legal-action-sues-ex-clinton-aide-firm-k5-global-for-700m/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Former-SSS-Agent-Warns-FTX-Client.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FTX Takes Legal Action: Sues Ex-Clinton Aide Firm K5 Global for $700M\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Former-SSS-Agent-Warns-FTX-Client.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Former-SSS-Agent-Warns-FTX-Client-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Former-SSS-Agent-Warns-FTX-Client-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Former-SSS-Agent-Warns-FTX-Client-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Former-SSS-Agent-Warns-FTX-Client-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Former-SSS-Agent-Warns-FTX-Client-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>FTX has filed a lawsuit for $700 million against K5 Global. FTX accuses K5 Global of fraud, causing substantial financial harm to the exchange. The new FTX management has amassed assets worth $7 billion since filing for bankruptcy. Bankrupt-cryptocurrency exchange FTX has sued K5 Global, an investment firm co-founded by Michael Kives, a former Hilary [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ftx-takes-legal-action-sues-ex-clinton-aide-firm-k5-global-for-700m/\">FTX Takes Legal Action: Sues Ex-Clinton Aide Firm K5 Global for $700M</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-23T16:32:32.000Z",
    "title": "Tether Chooses Kava As Gateway for Cosmos USDt",
    "url": "https://dailyhodl.com/2023/06/23/tether-chooses-kava-as-gateway-for-cosmos-usdt/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/Kava-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/Kava-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2022/09/Kava-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2022/09/Kava-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2022/09/Kava-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2022/09/Kava-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>June 23, 2023 – Georgetown, Cayman Islands Tether chooses Kava, a layer one blockchain designed for scalability and speed, as its gateway to the Cosmos ecosystem. Kava is excited and honored by Tether’s decision to bring the world&#8217;s most liquid, secure and transparent stablecoin USDt to Cosmos appchains and Kava EVM DApps. Tether USDt comes [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/23/tether-chooses-kava-as-gateway-for-cosmos-usdt/\">Tether Chooses Kava As Gateway for Cosmos USDt</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]