[
  {
    "source": "CryptoSlate",
    "date": "2023-11-01T18:45:52.000Z",
    "title": "Turkey tightening crypto regulation to improve standing with FATF",
    "url": "https://cryptoslate.com/turkey-tightening-crypto-regulation-to-improve-standing-with-fatf/",
    "description": "<p>Turkey is set to introduce new legislation pertaining to crypto-assets in a bid to strengthen its stance against money laundering and terrorist financing, Reuters reported, citing the country&#8217;s Finance Minister Mehmet Simsek. The move comes as an effort to persuade the Financial Action Task Force (FATF), an international crime watchdog, to elevate the nation from [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/turkey-tightening-crypto-regulation-to-improve-standing-with-fatf/\">Turkey tightening crypto regulation to improve standing with FATF</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-01T19:03:24.000Z",
    "title": "Venture capital investments in the crypto sector hit a record low",
    "url": "https://crypto.news/venture-capital-investments-in-the-crypto-sector-hit-a-record-low/",
    "description": "RootData reveals a significant decline in both the number and total amount of venture capital investments in the cryptocurrency sector, with October marking new lows."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-01T18:51:06.000Z",
    "title": "HSBC uses blockchain to revamp outdated London gold market infrastructure",
    "url": "https://crypto.news/hsbc-uses-blockchain-to-revamp-outdated-london-gold-market-infrastructure/",
    "description": "HSBC leverages blockchain technology to digitize gold assets, aiming to modernize the traditional London gold market."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-01T19:00:45.000Z",
    "title": "XRP Ledger Market Cap Soars On Regulatory Success: 59% YTD Growth Achieved",
    "url": "https://www.newsbtc.com/xrp-news/xrp-ledger-market-cap-soars-on-regulatory-success-59-ytd-growth-achieved/",
    "description": "The XRP Ledger (XRPL), a decentralized public blockchain developed by David Schwartz, CTO of Ripple Labs, has continued to evolve and show growth in the third quarter (Q3) of 2023, as highlighted in a recent report by Messari. The XRPL, facilitating cross-currency and cross-border payments for over a decade, has witnessed significant milestones, including a surge in market capitalization and advancements in network features. XRP Ledger Shows Strong Development In Q3 As of Q3 2023, XRP, the native token of the XRPL, has secured its position as the fifth-largest cryptocurrency by market capitalization at an impressive $27.8 billion.  Notably, the token&#8217;s market cap experienced remarkable growth, increasing by 59.9% year-to-date (YTD) and recording an 11.9% quarter-over-quarter (QoQ) surge.  According to Messari, one unique aspect of the XRPL is the deflationary pressure applied to its total supply of 100 billion XRP. Transaction fees on the network are burned, reducing the supply over time.  Related Reading: Galaxy Digital and Invesco Bitcoin Spot ETF Join BlackRock On The DTCC Since the inception of the XRP Ledger, approximately 10 million XRP have been burned. However, to counterbalance the burn rate, 1 billion XRP vests to Ripple each month.  Unspent or undistributed XRP returns to escrow. This process will continue until the remaining ~48 billion XRP becomes liquid, making burned fees the sole factor influencing supply. Unlike many other cryptocurrency networks, the XRPL does not provide rewards or transaction fees to its validators. Instead, validators are incentivized by supporting network decentralization, similar to full nodes on Ethereum (ETH) or Bitcoin (BTC).  The Proof-Of-Authority (PoA) consensus algorithm relies on trust between nodes, organized through unique node lists (UNLs). This approach contributed to the network&#8217;s resilience and security through 2023. NFTs Thrive On XRPL With Notable Growth In Q3 In Q2 2023, XRPL experienced declining network activity metrics, including average daily transactions and active addresses. However, Q3 witnessed a resurgence, with average daily transactions reaching 1.06 million and active addresses totaling 44,000.  In particular, NFT transactions showed significant growth, with average daily NFT transactions increasing 7.3% QoQ to 16,700. NFTs are built into the core protocol and do not require smart contracts for creation or transfers. Standardization of NFTs through XLS-20 2in October 2022 brought benefits such as royalties and anti-spam features. The XRPL ecosystem has grown steadily, with 3 million NFTs minted using the XLS-20 standard. Related Reading: Solana (SOL) Breaks Multi-Month Trend As Firedancer Hits Testnet Overall, the XRP Ledger has demonstrated significant growth and development throughout Q3 2023, driven by market capitalization gains, regulatory victories, and advancements in network features.  With a strong focus on deflationary dynamics, unique consensus algorithms, and the rise of NFT transactions, the XRPL continues to position itself as a prominent player in the world of cross-currency and cross-border payments, according to Messari.  Conversely, XRP has demonstrated consistent gains across various time frames. Currently, the token is trading at $0.6073, which has not been reached since August 2023, resulting in a modest 0.4% profit within the 24 hours. Notably, XRP has maintained an upward trend, delivering substantial returns of 10%, 24%, and 16% in the past seven, fourteen, and thirty-day time frames, respectively. Particularly noteworthy is the exceptional performance within the one-year time frame, where XRP has surged by 32%. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-01T18:45:55.000Z",
    "title": "New CBDC Pilot Goes Into Second Phase in Hong Kong As Government Explores Tokenization and Programmability",
    "url": "https://dailyhodl.com/2023/11/01/new-cbdc-pilot-goes-into-second-phase-in-hong-kong-as-government-explores-tokenization-and-programmability/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/cbdc-pilot-goes-second.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/cbdc-pilot-goes-second.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/cbdc-pilot-goes-second.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/cbdc-pilot-goes-second.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/cbdc-pilot-goes-second.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/cbdc-pilot-goes-second.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/cbdc-pilot-goes-second.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The Hong Kong Monetary Authority (HKMA) is entering the second phase of its e-HKD (e-Hong Kong dollar) pilot program, testing use cases for a possible central bank digital currency (CBDC). In a new report issued by the HKMA, the central bank says the first phase of the effort had 16 different firms exploring several areas [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/01/new-cbdc-pilot-goes-into-second-phase-in-hong-kong-as-government-explores-tokenization-and-programmability/\">New CBDC Pilot Goes Into Second Phase in Hong Kong As Government Explores Tokenization and Programmability</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-01T18:41:34.000Z",
    "title": "Coinbase Announces Launch of Crypto Futures Trading for US Retail Users",
    "url": "https://dailyhodl.com/2023/11/01/coinbase-announces-launch-of-crypto-futures-trading-for-us-retail-users/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/Coinbase-Aims-To-Educate-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/Coinbase-Aims-To-Educate-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/Coinbase-Aims-To-Educate-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/Coinbase-Aims-To-Educate-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/Coinbase-Aims-To-Educate-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/Coinbase-Aims-To-Educate-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/Coinbase-Aims-To-Educate-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Top US-based crypto exchange platform Coinbase is announcing the launch of crypto futures trading for retail investors in the US. In a new company blog post, the crypto exchange is announcing that US Coinbase Advanced customers can now trade regulated leveraged crypto futures through Coinbase Financial Markets. According to Coinbase, the futures contracts will be [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/01/coinbase-announces-launch-of-crypto-futures-trading-for-us-retail-users/\">Coinbase Announces Launch of Crypto Futures Trading for US Retail Users</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]