[
  {
    "source": "CoinDesk",
    "date": "2023-09-27T14:58:01.000Z",
    "title": "EigenLayer’s Sreeram Kannan on the Hot (and Risky) Ethereum Trend of ‘Restaking’",
    "url": "https://www.coindesk.com/tech/2023/09/27/eigenlayers-sreeram-kannan-on-the-hot-and-risky-ethereum-trend-of-restaking/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "In an exclusive interview, Sreeram Kannan, the founder of EigenLayer and a pioneer behind restaking, discusses his project's goals as a new landscape for restaking emerges."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-27T14:22:37.000Z",
    "title": "Binance successor in Russia: Everything you need to know about CommEx, so far",
    "url": "https://cointelegraph.com/news/crypto-binance-successor-russia-commex-exchange",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/4af64f31-9798-4cf3-b299-ff1f3ca84210.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The sale has sparked chatter among local crypto enthusiasts, who say the two sites appear so similar that CommEx could be a “Russian version” of Binance.US.</p>\n                    <p><p>Cryptocurrency exchange Binance has claimed that it will <a href=\"https://cointelegraph.com/news/binance-fully-exits-russia-with-sale-to-commex\">fully quit Russia by selling its local business</a> to a completely new exchange known as CommEx. While promising its customers a “smooth” migration, Binance hasn’t provided much information about its successor in Russia.</p><p>At the time of the announcement, little is known about CommEx’s founders or background. The exchange was launched on Sept. 26, 2023, just one day before Binance announced the sale of its business to the newly created exchange for an undisclosed amount.</p><p>A spokesperson for CommEx didn’t respond to multiple questions from users about the company’s owners or executives in the official Telegram group. The person <a href=\"https://t.me/CommEX_RUChat/1349\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> that CommEx is registered in the Seychelles and will serve its customers as a global exchange focused on two main regions: the Commonwealth of Independent States (CIS) and Asia.</p><h2>CommEx already on Binance-owned CoinMarketCap</h2><p>At launch, CommEx supports only a browser version, with the firm promising to introduce a mobile app in the near future. Despite being launched just one day ago, CommEx is already <a href=\"https://coinmarketcap.com/exchanges/commex/\" target=\"_blank\" rel=\"noopener nofollow\">listed</a> on CoinMarketCap, a <a href=\"https://cointelegraph.com/news/binance-announces-coinmarketcap-acquisition-cz-gives-the-scoop\">major crypto tracking website that Binance acquired</a> in April 2020. On the other hand, rival market tracker CoinGecko doesn’t include any information about CommEx at the time of writing.</p><p>According to CoinMarketCap data, CommEx lists 25 trading pairs at launch, including stablecoins like Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) and Binance’s BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) cryptocurrency. “CommEx is a rapidly expanding cryptocurrency exchange, backed by top-tier crypto VCs,” the description of the new exchange on CoinMarketCap reads.</p><p>CommEx will initially support peer-to-peer (P2P) transactions in Russia, allowing users to exchange their crypto without using the platform’s fiat channels. The platform will <a href=\"https://t.me/CommEX_RUChat/1044\" target=\"_blank\" rel=\"noopener nofollow\">launch</a> spot trading of USDT against Russia’s fiat currency, the ruble, once fiat channels are live, according to a spokesperson in CommEx’s Telegram group.</p><p>A spokesperson for Binance told Cointelegraph that it would be “entirely optional” for Binance users to move over to CommEx. “You may also withdraw your funds to another platform if you’d like,” the person noted, adding that users would still be able to migrate their assets to CommEx. The spokesperson added: </p><blockquote>“Russia KYC’d new users registration will immediately be redirected to CommEX. Then, over the next several months, Binance will sunset all exchange services and business lines in Russia.”</blockquote><p><a href=\"https://t.me/CommEX_RUChat/1510\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to the CommEx representative, users can trade without completing Know Your Customer (KYC) checks for up to 2 Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) in withdrawals. The firm will not allow account registration or services in locations including the United States, Belgium, the Republic of Cyprus, Czechia, the Netherlands and Singapore, as well as sanctioned regions like Iran and Crimea, CommEx’s location restrictions page <a href=\"https://commex.zendesk.com/hc/en-us/articles/7831162016783-CommEX-Location-Restrictions\" target=\"_blank\" rel=\"noopener nofollow\">reads</a>.</p><p>The spokesperson also <a href=\"https://t.me/CommEX_RUChat/294\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it’s unlikely that Binance’s contactless payment tool, Binance Pay, will continue to work with CommEx.</p><h2>Users question CommEx ownership</h2><p>Binance’s announcement has triggered some speculation in the local crypto community regarding the owners of Binance’s successor in Russia. Some users have found similarities in the layouts of Binance and CommEx’s websites, while others said that CommEx was a “full copy” of Binance’s website.</p><p>“They just changed the logo and colors but essentially it’s the same website. I wouldn’t be surprised if Russian tops who left banana [Binance] would be managing directors here,” one commenter wrote in a now-deleted comment on CommEx’s Telegram group.</p><p>Among the similarities are significant resemblances between Binance and CommEx’s privacy notices and other website pages like terms of use. For example, CommEx’s privacy notice essentially <a href=\"https://commex.zendesk.com/hc/en-us/articles/7496912208527-Privacy-Notice\" target=\"_blank\" rel=\"noopener nofollow\">provides</a> a reworded copy of Binance’s privacy <a href=\"https://www.binance.com/en/privacy\" target=\"_blank\" rel=\"noopener nofollow\">notice</a>, closely following its structure and many formulations.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/09c91cb3-9766-4b98-bc6e-6c44259d2ca2.png\"  /><figcaption style=\"text-align: center;\"><em>An excerpt from CommEx’s privacy notice. Source: CommEx</em></figcaption></figure><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/8f5cb0a3-7b0a-4097-91db-665f3d07a91d.png\"  /><figcaption style=\"text-align: center;\"><em>An excerpt from Binance’s privacy notice. Source: Binance</em></figcaption></figure><p><a href=\"https://cointelegraph.com/news/binance-dubs-barred-russian-banks-on-its-platform-as-yellow-and-green-cards\">Russia has been one of Binance’s biggest markets</a>, and the country is listed as the top market in terms of user visits for the website Binance.com, accounting for 6.9% of total visits at the time of writing, <a href=\"https://cointelegraph.com/news/top-binance-execs-in-russia-leave-as-firm-considers-exiting-the-market\">according</a> to data from SimilarWeb.</p><p>“I don’t think that CZ [Changpeng Zhao] is ready to abandon such a huge pie like Russia and leave just like that,” one local cryptocurrency observer told Cointelegraph. Some people in the community have drawn parallels between CommEx in Russia and Binance’s affiliate in the United States, Binance.US, which claims to operate “independently” of Binance.</p><p>“It looks like some sort of Binance.US but just without the word ‘Binance’ in its name,” another local crypto enthusiast told Cointelegraph.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-ceo-chanpgeng-zhao-asks-court-dismiss-sec-lawsuit\"><strong><em>Binance and CEO Changpeng Zhao ask court to dismiss SEC suit</em></strong></a></p><p>A spokesperson for Binance declined to comment on whether the company is aware of CommEx’s founders or executives. CommEx’s spokesperson declined to comment immediately, stating that the firm is focused on “platform optimization and stability,” as the CommEx website briefly went down amid Russian users rushing to the website after Binance made the announcement. CommEx’s Russian Telegram group, which had just about 50 members before the announcement, now <a href=\"https://t.me/CommEX_RUChat\" target=\"_blank\" rel=\"noopener nofollow\">counts</a> nearly 2,000 users.</p><p>“With this sale, Binance fully exits Russia. We have no plans to get back,” a spokesperson for Binance told Cointelegraph.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-27T15:00:24.000Z",
    "title": "Sam Bankman-Fried’s lawyers request their client be allowed to wear ‘business attire’ at trial",
    "url": "https://cryptoslate.com/sam-bankman-frieds-lawyers-request-their-client-be-allowed-to-wear-business-attire-at-trial/",
    "description": "<p>Sam Bankman-Fried&#8216;s lawyers have moved to dress him in &#8220;business attires&#8221; for his defense scheduled to start on Oct. 3. In a Sept. 26 letter to Judge Lewis A. Kaplan, the lawyers requested that the Court order the U.S. authorities to allow Bankman-Fried to be dressed in business attire while he is in Courtroom 26A [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sam-bankman-frieds-lawyers-request-their-client-be-allowed-to-wear-business-attire-at-trial/\">Sam Bankman-Fried&#8217;s lawyers request their client be allowed to wear &#8216;business attire&#8217; at trial</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-27T14:15:59.000Z",
    "title": "Mixin network DeFi TVL plunges by $200M after offering attacker $20M bounty",
    "url": "https://cryptoslate.com/mixin-network-defi-tvl-plunges-by-200m-after-offering-attacker-20m-bounty/",
    "description": "<p>The total value of assets locked on Mixin Network sharply declined by more than $200 million two days after the protocol revealed it suffered a breach, according to DeFillama data. Per the data aggregator dashboard, the decline fell to $150.68 million on Sept. 27 from $351.47 million recorded on Sept. 26. On Sept. 25, Mixin [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/mixin-network-defi-tvl-plunges-by-200m-after-offering-attacker-20m-bounty/\">Mixin network DeFi TVL plunges by $200M after offering attacker $20M bounty</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T14:55:20.000Z",
    "title": "CIA Adopts AI for Streamlined Open-Source Intelligence",
    "url": "https://www.cryptopolitan.com/cia-adopts-ai-for-open-source-intelligence/",
    "description": "In a transformative move to enhance its data processing capabilities, the Central Intelligence Agency (CIA) of the United States is delving into the realm of artificial intelligence (AI). The agency plans to develop and deploy an AI system akin to ChatGPT to expedite its open-source intelligence operations. The decision comes in response to criticisms of ... <a title=\"CIA Adopts AI for Streamlined Open-Source Intelligence\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cia-adopts-ai-for-open-source-intelligence/\" aria-label=\"More on CIA Adopts AI for Streamlined Open-Source Intelligence\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T14:54:55.000Z",
    "title": "Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Flow Coin Price Prediction 2023-2032 Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the ... <a title=\"Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flow-coin-price-prediction/\" aria-label=\"More on Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T14:45:14.000Z",
    "title": "Coinbase CEO slams Chase Bank’s UK crypto ban",
    "url": "https://www.cryptopolitan.com/coinbase-ceo-slams-chase-banks-uk-crypto-ban/",
    "description": "Chase Bank recently announced a ban on crypto transactions for its UK customers, Cryptopolitan reported. Brian Armstrong, the CEO of Coinbase, one of the largest cryptocurrency exchanges in the United States, has publicly denounced the decision. Armstrong took to X, the platform formerly known as Twitter, to express his dissatisfaction. He labeled the move &#8220;totally ... <a title=\"Coinbase CEO slams Chase Bank&#8217;s UK crypto ban\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-ceo-slams-chase-banks-uk-crypto-ban/\" aria-label=\"More on Coinbase CEO slams Chase Bank&#8217;s UK crypto ban\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T14:20:09.000Z",
    "title": "Microsoft’s Nuclear-Powered Data Centers: A Green Tech Pursuit",
    "url": "https://www.cryptopolitan.com/microsofts-nuclear-powered-data-centers/",
    "description": "Microsoft is embarking on an innovative journey by exploring nuclear technology to power its data centers, driven by the soaring energy demands of artificial intelligence (AI). AI applications, notably in advertising, machine learning, chatbots, and the booming domains of connected television (CTV) and video streaming, have ushered in a new era of energy consumption. The ... <a title=\"Microsoft&#8217;s Nuclear-Powered Data Centers: A Green Tech Pursuit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/microsofts-nuclear-powered-data-centers/\" aria-label=\"More on Microsoft&#8217;s Nuclear-Powered Data Centers: A Green Tech Pursuit\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-27T14:16:03.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-27T15:04:47.000Z",
    "title": "Marathon reportedly mined an invalid Bitcoin block",
    "url": "https://crypto.news/marathon-reportedly-mined-an-invalid-bitcoin-block/",
    "description": "Marathon reportedly mined an invalid Bitcoin (BTC) block that was later scraped"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-27T14:55:36.000Z",
    "title": "Hong Kong police retrieve $11M in assets from JPEX investigation",
    "url": "https://crypto.news/hong-kong-police-retrieve-11m-in-assets-from-jpex-investigation/",
    "description": "Approximately $11 million worth of cash and assets related to the JPEX crypto exchange scam has been retrieved"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-27T14:47:58.000Z",
    "title": "Binance Russia’s new owner, CommEX, is registered in Seychelles and will serve Crimea",
    "url": "https://crypto.news/binance-russias-new-owner-commex-is-registered-in-seychelles-and-will-serve-crimea/",
    "description": "CommEX, the new owner of Binance's local branch in Russia, will be registered in Seychelles and plans to serve Crimea, a sanctioned territory"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-27T14:41:43.000Z",
    "title": "Chainlink CCIP deploys on Base, an Ethereum layer-2",
    "url": "https://crypto.news/chainlink-ccip-deploys-on-base-an-ethereum-layer-2/",
    "description": "Chainlink has launched its Cross-Chain Interoperability Protocol (CCIP) on Coinbase's Ethereum Layer 2 scaling solution, Base"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-27T14:16:58.000Z",
    "title": "TON: What you should know about blockchain by Telegram team",
    "url": "https://crypto.news/ton-what-you-should-know-about-blockchain-by-telegram-team/",
    "description": "The Open Network project found itself on a new wave of popularity after the launch of a wallet on Telegram. However, the project's long and difficult path to success is often overlooked."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-27T15:00:30.000Z",
    "title": "ETH Gate Saga Continues: What Is Lubin’s ‘Piece Of Paper’?",
    "url": "https://www.newsbtc.com/news/ethereum/eth-gate-lubin-piece-of-paper/",
    "description": "Steven Nerayoff, an active participant in Ethereum’s (ETH) Initial Coin Offering (ICO), who is believed to know where the “bodies are buried,” has made further revelations in the ongoing ETH Gate saga, which boils on whether or not the US Securities and Exchange Commission (SEC) gave Ethereum a ‘regulatory free pass.’  Lubin’s Piece Of Paper Appears In ETH Gate After being pressured by a member of the XRP community to release the dirt that he claims to have, Nerayoff released a follow-up tweet that contained transcripts from an email that Ethereum’s co-founder Joseph Lubin sent to him personally on July 21, 2014. Lubin (whom Nerayoff now also refers to as #CrookedElbowJoe) also copied Fry, Bertrand, Vitalik Buterin, and Jeffrey Alberts in the mail.  Related Reading: Early Rejection Of 21Shares Spot Bitcoin ETF Sparks Concerns In the mail, Fry, Bertrand (there is an assumption that ‘Fry, Bertrand’ is one person rather than separate individuals) stated that the “opinion letter” was being put on a letterhead and would be forwarded to Lubin after.  Following the revelation of this mail, a video clip surfaced where pro-XRP legal expert John Deaton gave his opinion on the mail. In the clip, Deaton suggested that the ‘opinion paper’ mentioned in the mail was the same one Lubin had referred to when he said he had a “piece of paper” in his pocket before the ETH ICO. Deaton also stated that Nerayoff got that piece of paper in Lubin’s pocket and that this series of events was extremely significant. It is worth mentioning that Deaton might already have first-hand information as to what might have transpired between the SEC and Ethereum and how deep the irregularities run, as he has already been in communication with Nerayoff (under the Attorney-Client privilege communication). This is something that he revealed during his “announcement” last week.  In an earlier tweet, Nerayaoff had also suggested that the ETH Gate was beyond just former SEC Director William Hinman’s speech, where he stated that Ethereum wasn’t a security. He said, “They’re hiding more than the motives behind the speech by #DirtyHinman.” He also used the hashtags #CryptoJudas (what he refers to Vitalik as) and #CrookedElbowJoe (Joseph Lubin). What Is This Lubin’s Piece Of Paper? Attorney Bill Morgan seemed to suggest that Nerayoff was indicating that Jeffrey Alberts and Fry Bertrand (who co-authored the piece ‘Is Bitcoin A Security?’ in 2015) were the same persons who wrote the opinion letter (which Deaton suggested was the same piece of paper Lubin spoke about before the ETH ICO).  If so, he could be driving at the fact that Alberts and Bertrand (who happen to be lawyers) may have written this opinion letter to convince the SEC that Ethereum wasn’t a security before the ICO. Meanwhile, Nerayoff reposted a tweet which had a similar theory. In the tweet, the X (formerly Twitter) user highlighted a part in Alberts’ bio where he was said to have “helped structure the initial public sale of ether.”  Related Reading: Upcoming Optimism Unlock Threatens To Drag OP Below $1 The bio alluded to the fact that the SEC had concluded that Bitcoin and Ether weren’t securities, adopting the “legal interpretation Alberts had articulated years ago.” The user also noted the relationship between Alberts and Marc Berger (who charged Ripple) as they worked together at the Manhattan US Attorney Office’s securities and commodities fraud task force. Marc Berger is said to be working with Bill Hinman now.  ETH bulls defeat bears to cross $1,600 &#124; Source: ETHUSD on Tradingview.com Featured image from Fasset, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-27T15:01:35.000Z",
    "title": "Cloud Mining Made Easy with TopHash Hashpower Marketplace",
    "url": "https://www.crypto-news-flash.com/cloud-mining-made-easy-with-tophash-hashpower-marketplace/?utm_source=rss&utm_medium=rss&utm_campaign=cloud-mining-made-easy-with-tophash-hashpower-marketplace",
    "description": "<img width=\"1180\" height=\"600\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/TOPHASH.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/TOPHASH.jpg 1180w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/TOPHASH-300x153.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/TOPHASH-1024x521.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/TOPHASH-768x391.jpg 768w\" sizes=\"(max-width: 1180px) 100vw, 1180px\" />Crypto mining is no longer profitable for several reasons, according to crypto enthusiasts. However, a branch of crypto mining still attracts many miners globally by offering a way to earn consistent passive income. There is only one problem: cloud mining is only available to some. But to change this, TopHash, a hash power marketplace and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-27T15:00:52.000Z",
    "title": "Grayscale Forecasts Bitcoin, Ethereum, and Bitcoin Spark Will Rally Once the Fed Ends Rate Hikes",
    "url": "https://www.crypto-news-flash.com/grayscale-forecasts-bitcoin-ethereum-and-bitcoin-spark-will-rally-once-the-fed-ends-rate-hikes/?utm_source=rss&utm_medium=rss&utm_campaign=grayscale-forecasts-bitcoin-ethereum-and-bitcoin-spark-will-rally-once-the-fed-ends-rate-hikes",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-167.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-167.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-167-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-167-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Grayscale, a leader in digital currency investing, forecasted that cryptocurrencies like Bitcoin (BTC), Ethereum (ETH), and Bitcoin Spark (BTCS) will rally once the Fed ends rate hikes. Bitcoin price prediction On September 20th, the Federal Reserve announced its decision to keep its policies unchanged for the time being, maintaining the Fed funds target range at [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-27T15:02:00.000Z",
    "title": "Ethereum’s Legal Game Changer: The Mysterious ‘Paper’",
    "url": "https://coinedition.com/ethereums-legal-game-changer-the-mysterious-paper/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Analyst-Shares-Before-Buying-Ethereum.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ethereum Legal Game Changer\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Analyst-Shares-Before-Buying-Ethereum.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Analyst-Shares-Before-Buying-Ethereum-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Analyst-Shares-Before-Buying-Ethereum-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Analyst-Shares-Before-Buying-Ethereum-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Analyst-Shares-Before-Buying-Ethereum-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Analyst-Shares-Before-Buying-Ethereum-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A series of provocative posts on X (formerly Twitter), from Ethereum advisor Steven Nerayoff has stirred speculation about potential legal improprieties in Ethereum’s early days. Nerayoff vaguely accused Ethereum co-founders Vitalik Buterin and Joseph Lubin of regulatory transgressions regarding the project’s 2014 initial coin offering (ICO). The posts reference a mysterious “piece of paper” that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ethereums-legal-game-changer-the-mysterious-paper/\">Ethereum&#8217;s Legal Game Changer: The Mysterious &#8216;Paper&#8217;</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-27T14:27:00.000Z",
    "title": "Ex-CEO of a U.S. Bank Sinks Company After Falling for a Crypto Scam",
    "url": "https://coinedition.com/ex-ceo-of-a-u-s-bank-sinks-company-after-falling-for-a-crypto-scam/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/crypto-scam.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"crypto scam\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/crypto-scam.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/crypto-scam-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/crypto-scam-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/crypto-scam-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/crypto-scam-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/crypto-scam-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/crypto-scam-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/crypto-scam-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/crypto-scam-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/crypto-scam-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/crypto-scam-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/crypto-scam-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/crypto-scam-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/crypto-scam-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/crypto-scam-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/crypto-scam-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A former chief executive officer of a local bank in the U.S. sank the company after using the company’s money for a cryptocurrency investment, which later turned out to be a scam, a Bloomberg report revealed. According to the report, signs of the CEO&#8217;s troubles appeared after he asked one of his wealthiest clients for [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ex-ceo-of-a-u-s-bank-sinks-company-after-falling-for-a-crypto-scam/\">Ex-CEO of a U.S. Bank Sinks Company After Falling for a Crypto Scam</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-27T14:30:47.000Z",
    "title": "Justin Sun Offers 5% Reward for Hackers That Stole $8,000,000 From Crypto Exchange HTX",
    "url": "https://dailyhodl.com/2023/09/27/justin-sun-offers-5-reward-for-hackers-that-stole-8000000-from-crypto-exchange-htx/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/Hackers-That-Stole-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/Hackers-That-Stole-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/Hackers-That-Stole-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/Hackers-That-Stole-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/Hackers-That-Stole-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/Hackers-That-Stole-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/Hackers-That-Stole-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Tron (TRX) founder Justin Sun says he&#8217;ll offer a 5% reward if the hackers who stole nearly $8 million worth of Ethereum (ETH) from his exchange HTX decide to return the crypto. HTX is the newly rebranded name of Huobi, the Seychelles-based trading giant that Sun says he&#8217;s an advisor for. It remains unclear whether [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/27/justin-sun-offers-5-reward-for-hackers-that-stole-8000000-from-crypto-exchange-htx/\">Justin Sun Offers 5% Reward for Hackers That Stole $8,000,000 From Crypto Exchange HTX</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]