[
  {
    "source": "Decrypt",
    "date": "2023-10-12T22:36:59.000Z",
    "title": "Uniswap Launches Mobile Ethereum Wallet on Android",
    "url": "https://decrypt.co/201327/uniswap-launches-mobile-ethereum-wallet-android",
    "description": "Launched in beta, Uniswap's wallet offers automatic switching between mainnet and layer-2 networks, along with other features."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-12T22:24:08.000Z",
    "title": "You Can Now Add Thomas the Tank Engine to Starfield—Yes, Really",
    "url": "https://decrypt.co/201315/you-can-now-add-thomas-tank-engine-starfield-yes-really",
    "description": "Someone has created a mod that adds Thomas the Tank Engine to Skyrim creator Bethesda's latest game, Starfield. Now you can't unsee his face."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-12T22:30:28.000Z",
    "title": "MetaMask expands crypto on-ramp options with Stripe integration",
    "url": "https://cryptoslate.com/metamask-announces-support-for-stripe-adding-to-crypto-on-ramp-options/",
    "description": "<p>MetaMask, a popular Ethereum and multi-coin wallet, announced support for the major payment processor Stripe on Oct. 11. That addition will allow users to deposit fiat and receive cryptocurrency through a new on-ramp. MetaMask said that the Stripe on-ramp feature is available through its mobile app, its browser add-on, and its multifeatured Portfolio service. MetaMask [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/metamask-announces-support-for-stripe-adding-to-crypto-on-ramp-options/\">MetaMask expands crypto on-ramp options with Stripe integration</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-12T22:25:00.000Z",
    "title": "USDT on Exchanges Nears $10 Billion as Crypto Buyers Eye Opportunities",
    "url": "https://www.cryptoglobe.com/latest/2023/10/usdt-on-exchanges-nears-10-billion-as-crypto-buyers-eye-opportunities/",
    "description": "In recent days, a marked uptick in on-chain activity surrounding the leading stablecoin Tether ($USDT) has been seen, with data showing that nearly $10 billion worth of the stablecoin is now sitting on exchanges, the highest level seen in roughly seven months. According to data from on-chain data analytics platform Santiment, this means that cryptocurrency […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-12T22:37:46.000Z",
    "title": "AI and Blockchain Job Trends in 2023 Salary Insights and Economic Potential",
    "url": "https://www.cryptopolitan.com/ai-and-blockchain-job-trends-in-2023/",
    "description": "As the world moves more into the digital age, China’s AI sector emerges as the most lucrative field for university graduates in 2023. The demand for AI skills has skyrocketed, reflecting in the high salaries that industries are willing to offer. A report by Liepin, a renowned Chinese recruitment platform, highlights this trend, noting an ... <a title=\"AI and Blockchain Job Trends in 2023 Salary Insights and Economic Potential\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-and-blockchain-job-trends-in-2023/\" aria-label=\"More on AI and Blockchain Job Trends in 2023 Salary Insights and Economic Potential\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-12T22:29:45.000Z",
    "title": "China advances digital yuan development with industrial park in Shenzhen",
    "url": "https://www.cryptopolitan.com/china-advances-digital-yuan-development-industrial-park-shenzhen/",
    "description": "China has recently inaugurated a distinctive industrial park in the Luohu district of Shenzhen, adjacent to Hong Kong, expressly devoted to fostering the development of its digital yuan, commonly referred to as e-CNY.&#160; This move comes as a significant addition to China&#8217;s dedication to establishing the Central Bank Digital Currency (CBDC). This park aspires to ... <a title=\"China advances digital yuan development with industrial park in Shenzhen\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-advances-digital-yuan-development-industrial-park-shenzhen/\" aria-label=\"More on China advances digital yuan development with industrial park in Shenzhen\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-12T22:28:24.000Z",
    "title": "Tech in Accounting: A Double-Edged Sword for Accountants",
    "url": "https://www.cryptopolitan.com/tech-in-accounting/",
    "description": "In the fast-evolving world of finance and accounting, technology has become an indispensable companion. Accounting software packages and tools like Sage, Xero, Quickbooks, and Intuit have flooded the market, promising efficiency and automation. But are these technological advancements truly aiding or hindering accountants in their daily work?&#160; Accounting professionals are now faced with a staggering ... <a title=\"Tech in Accounting: A Double-Edged Sword for Accountants\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tech-in-accounting/\" aria-label=\"More on Tech in Accounting: A Double-Edged Sword for Accountants\">Read more</a>"
  }
]