[
  {
    "source": "CoinDesk",
    "date": "2023-08-01T12:58:59.000Z",
    "title": "Ether Options Market Shows Bias for Price Weakness Over Next 6 Months",
    "url": "https://www.coindesk.com/markets/2023/08/01/ether-options-market-shows-bias-for-price-weakness-over-6-months/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Ether's price appears overvalued compared to Ethereum's dwindling revenues, one analyst said."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-01T13:01:17.000Z",
    "title": "Term Labs Launches Fixed-Rate Lending Protocol on Ethereum",
    "url": "https://decrypt.co/150841/term-labs-launches-fixed-rate-lending-protocol-ethereum",
    "description": "Term Labs took inspiration from the U.S. Treasury to build a platform that matches borrowers with lenders according to their preferred rates. "
  },
  {
    "source": "Decrypt",
    "date": "2023-08-01T13:01:08.000Z",
    "title": "Genesis Digital Assets Expands Bitcoin Mining Activity in ‘Pro-Innovation’ South Carolina",
    "url": "https://decrypt.co/150837/genesis-digital-assets-expands-bitcoin-mining-activity-pro-innovation-south-carolina",
    "description": "The mining firm is launching three locations in South Carolina, with its CEO citing the state’s “abundance of clean electricity” for the move."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-01T13:00:00.000Z",
    "title": "SushiSwap furthers cross-chain functionality with Core integration ",
    "url": "https://cointelegraph.com/news/sushiswap-furthers-cross-chain-functionality-with-core-integration",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/6fa1abf2-214f-447d-8cc5-bc8763dc3489.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>SushiSwap brings liquidity pools, cross-chain swaps and its DEX aggregator to the Core blockchain ecosystem.</p>\n                    <p><p>Decentralized Finance (DeFi) platform SushiSwap is set to integrate with the growing blockchain protocol Core, tapping into the protocol’s unique consensus mechanism to provide a broad set of DeFi services to its cross-chain functionality.</p><p>The integration is touted to increase the possibilities for developers building within the Core ecosystem, with decentralized applications built on the protocol gaining access to SushiSwap’s liquidity pools, cross-chain swaps and its decentralized exchange (<a href=\"https://cointelegraph.com/explained/dex-explained\">DEX</a>) aggregator.</p><p>The liquidity of SushiSwap’s automated market maker platform is also set to benefit the Core ecosystem, with the additional liquidity from the integration expected to improve the functionality of other DeFi protocols operating on Core.</p><p>SushiSwap joins ArcherSwap, IceCreamSwap and OpenEx as the main DeFi protocols operating on Core’s network. SushiSwap users are also set to benefit from further cross-chain functionality facilitated by Core’s protocol.</p><p>A spokesperson for Core outlined the technical side of the Bitcoin-powered blockchain, which integrates both <a href=\"https://cointelegraph.com/learn/proof-of-stake-vs-proof-of-work:-differences-explained\">proof-of-work (PoW) and proof-of-stake (PoS) </a>consensus mechanisms to provide privacy, scalability and security to its protocol.</p><blockquote>\"This approach leverages the existing Bitcoin infrastructure for security and decentralization through delegated hash power. Currently 40% of Bitcoin’s hash is delegated to Core. Core is EVM-compatible, allowing use cases that otherwise would not be possible on Bitcoin.\"</blockquote><p><a href=\"https://cointelegraph.com/news/vyper-vulnerability-exposes-defi-ecosystem-stress-tests\"><strong><em>Related: Vyper vulnerability exposes DeFi ecosystem to stress tests</em></strong></a></p><p>According to the Core team, its proprietary Satoshi Plus consensus mechanism combines critical elements of the two different consensus mechanisms. Satoshi Plus uses Bitcoin miners that participate in the election of Core’s validator set by delegating hashing power to specified validators.</p><p>Core then “compliments” the decentralized security of Bitcoin’s consensus mechanism by using a form of Ethereum’s PoS:</p><blockquote>“Satoshi Plus leverages DPoS to verify transactions by selecting validators that have a combination of staked native tokens and delegated hash power, providing scalability on top of PoW’s significant decentralization and security.\"</blockquote><p>Decentralized Finance (<a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">DeFi</a>) platform <a href=\"https://cointelegraph.com/news/sushiswap-ceo-proposes-new-tokenomics-for-liquidity-decentralization\">SushiSwap</a> is set to integrate with growing blockchain protocol Chain, tapping into the protocol’s unique consensus mechanism to provide a broad set of DeFi services to its cross-chain functionality.</p><p>As previously <a href=\"https://cointelegraph.com/news/sushi-s-head-chef-addresses-community-concerns-amid-sec-subpoena\">reported </a>by Cointelegraph, Sushi 'head chef' Jared Grey addressed concerns following a subpoena from the United States Securities and Exchange Commission. This led to the establishment of a cautionary $3 million Sushi DAO legal defense fund to combat any potential legal issues in the future.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/sushiswap-furthers-cross-chain-functionality-with-core-integration&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\"><em><strong>Magazine: How smart people invest in dumb memecoins: 3-point plan for success</strong></em></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-01T12:54:10.000Z",
    "title": "FTX.com releases restructuring plan, hints at rebooted offshore exchange",
    "url": "https://cointelegraph.com/news/ftx-releases-restructuring-plan-offshore-exchange-reboot-planned",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/ad7b5b7c-421d-4b3e-abf8-037dc45b6a85.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Reams of dockets from FTX.com have been filed alongside a proposed reorganization plan which could see FTX resurrected as an offshore exchange. </p>\n                    <p><p>FTX.com has outlined its intended re-organization plan that will categorize claimants of the bankrupt exchange into specific classes and pave the way for the exchange to become <a href=\"https://cointelegraph.com/news/ftx-reboot-ceo-john-ray-bidding-process\">re-operational as an offshore entity</a>.</p><p>Dockets <a href=\"https://restructuring.ra.kroll.com/FTX/Home-DocketInfo\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> on July 31 include a draft plan of reorganization that outlines the company’s intended path to settle an “exceptionally large and complicated collection of claims”. </p><p>There are a total of 13 different classes of claims, including specific brackets for Dotcom customer entitlement claims, U.S. customer claims and nonfungible tokens (NFTs) customer claims. </p><p><a href=\"https://cointelegraph.com/news/ftx-reboot-ceo-john-ray-bidding-process\"><strong><em>Related: FTX reboot on the way: CEO holds talks with ‘interested parties’ — Report</em></strong></a></p><p>The global settlement will involve the valuation of claims in U.S. dollars on a yet to be Bankruptcy Court-approved valuation methodology prepared by FTX, including disputes over assets held on FTX.com and FTX US exchanges.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/09f6efb0-1e1a-45e1-bd02-da327180cdd0.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>FTX Draft Plan of Reorganization. Source: FTX</em></figcaption></figure><p>FTX plans to identify three primary recovery pools that will correspond with segregated assets attributable to FTX.com customers, FTX US customers and assets that the company contends are not attributable to the two defunct exchange arms.</p><p>Users that held NFTs will also have their own seperate classification. NFTs are set to be returned to applicable customers unless they were \"destroyed\" or lost. In that scenario, their claims would shift to Class 4A or 4B as outlined in the screenshot above.</p><p>The document features recognition of special “shortfall” claims by the two FTX exchange organizations against this third pool of general assets. This is intended to “compensate” the exchanges for the unauthorized borrowing and misappropriation of assets that former CEO Sam Bankman-Fried and his close associates are accused of carrying out.</p><p>The filing also outlines the intent to cancel intercompany claims as well as the “extinguishment of FTT claims”. This specific clause intimates that holders of FTT will not be compensated at all for their token holdings. The value of FTT collapsing played a pivotal role in the collapse of FTX in 2023.</p><p>The final section of the proposed plan covers the intent to liquidate the estates of FTX to payout distributions to customers and creditors in cash. However a clause notes that customers may be offered voluntary elections in connection “with a restart of an offshore exchange”.</p><p>This would see provision for specific creditors to opt for a share of equity, tokens and other interests in a potentially rebooted offshore FTX exchange.</p><p>Under bankruptcy proceedings, <a href=\"https://cointelegraph.com/news/ftx-sues-sam-bankman-fried-other-execs-recoup-one-billion\">FTX has sued </a>Bankman-Fried and other implicated directors in an attempt to recover over $1 billion in alleged misappropriated funds. The July 20 complaint names Bankman-Fried as a defendant alongside former Alameda Research CEO Caroline Ellison, FTX co-founder Zixiao “Gary” Wang, former FTX engineering director Nishad Singh.</p><p><em><strong>Magazine: ‘<a href=\"https://cointelegraph.com/magazine/elegant-and-ass-backward-jameson-lopps-first-impression-of-bitcoin/\">Elegant and ass-backward’: Jameson Lopp’s first impression of Bitcoin</a></strong></em></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-01T12:51:00.000Z",
    "title": "AI mentions skyrocket in major tech companies' Q2 calls  ",
    "url": "https://cointelegraph.com/news/ai-mentions-skyrocket-in-major-tech-q2-calls",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/1ee2203d-1abd-4f0d-a057-3db219b5a55b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>As major tech companies race to develop and deploy high-level AI systems, mentions of the technology is skyrocketing in company calls.  </p>\n                    <p><p>In earnings calls for the second fiscal quarter for major tech companies, the mention of artificial intelligence (AI) has skyrocketed compared to the previous quarter, according to a <a href=\"https://www.reuters.com/technology/companies-double-down-ai-june-quarter-analyst-calls-2023-07-31/\" target=\"_blank\" rel=\"noopener nofollow\">report</a> on the topic from Reuters. </p><p>The S&amp;P 500 companies that took the lead in discussions surrounding AI included Google’s Alphabet, Intel, Microsoft and Meta platforms, along with others who increased talks around AI such as Cadence Design, IBM, ServiceNow, Moody’s and Omnicom. </p><p>In Intel’s second-quarter call, AI was mentioned 58 times compared to 15 times in its first-quarter call. Alphabet’s call mentioned AI 62 times and Microsoft’s 58 - both up from 52 and 35 times in previous calls, respectively. </p><p>Tech companies aside, the Reuters report revealed in the first two quarters of the year the hype surrounding AI has helped create a 37% surge in the Nasdaq. </p><p>While Microsoft - backing ChatGPT’s OpenAI-, Meta and Alphabet have been active in the development and deployment of AI systems and tools, Intel has been behind in the AI boom. According to the Reuters report the company’s data center and AI business lumped by 15% in the last quarter. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/inflection-ai-raises-1-3b-in-funding-led-by-microsoft-and-nvidia\"><strong><em>Inflection AI raises $1.3B in funding led by Microsoft and Nvidia</em></strong></a></p><p>These numbers confirm trends that can be clearly spotted in the market. Microsoft, Google and OpenAI <a href=\"https://cointelegraph.com/news/google-openai-microsoft-form-frontier-model-forum-to-regulate-ai-development\">formed the ‘Frontier Model Forum’</a> on July 26, in an effort to regulate AI development. </p><p>Only a few days prior to the creation of this Forum by the biggest tech companies in the AI business, this same group with the addition of Meta<a href=\"https://cointelegraph.com/news/ai-companies-commit-safe-and-transparent-ai-white-house-reports\"> committed to developing safe, secure and transparent AI</a> to the United States White House. </p><p>On July 13, reports circulated that <a href=\"https://cointelegraph.com/news/meta-releases-commercial-ai-tools-to-rival-google-open-ai\">Meta plans to release a commercial version</a> of its AI tools to rival those already on the market from OpenAI and Google. Following this news, Meta and Microsoft announced <a href=\"https://cointelegraph.com/news/llama-2-open-source-ai-model-launched-by-meta-microsoft\">a collaboration to launch</a> an open-source large language model called Llama 2.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-human-digital-souls-agi-alignment-problem-replika/\"><strong><em>Experts want to give AI human ‘souls’ so they don’t kill us all</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-01T12:41:34.000Z",
    "title": "Bitcoin loses $29K as traders flag key BTC price levels to watch next",
    "url": "https://cointelegraph.com/news/bitcoin-loses-29k-traders-btc-price-next",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/6dca7af5-1430-4d57-a7f7-6b633b4b0b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin traders are particularly interested in the short-term holder cost basis as a potential BTC price support level.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) shed 2% into the start of August as traders’ expectations of further downside slowly came true. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/cc1030ff-bfe4-4026-8155-5d4da1614223.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><h2>Bitcoin short-term holder breakeven point in focus</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> showed BTC price trajectory leaning lower at the July monthly close.</p><p>Volatility was already anticipated, and BTC/USD did not disappoint after a week of <a href=\"https://cointelegraph.com/news/bitcoin-volume-lowest-early-2021-25k\">barely any movement whatsoever</a>. Bulls, however, were left in the cold.</p><p>For popular trader and analyst Rekt Capital, the close price was significant, but demanded that buyers now step in to protect the trend.</p><p>Commenting on a chart showing relevant levels and Bitcoin’s potential moves, he flagged $29,250 as the line in the sand.</p><p>“Instead of BTC Monthly Closing above the ~$29250 level (black)... $BTC printed a Monthly Close marginally below the ~$29250 level. BTC needs to reclaim ~$29250 as support for the blue path to be valid,” he <a href=\"https://twitter.com/rektcapital/status/1686326175319142400/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a>.</p><blockquote>“However, there are some initial signs of the ~$29250 acting as resistance this month. If this persists then price could actually reject from here and drop lower via the red path. All about the black ~$29250 now.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/605bae6f-7b16-4cad-ae27-c3807ddc5f85.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Rekt Capital/Twitter</em></figcaption></figure><p>Looking to short-term targets, meanwhile, many market participants acknokwledged that the area around $28,000 should come in for a test.</p><p>In particular, $28,300 stood out, this being the cost basis of Bitcoin’s speculative investor base, known as short-term holders (STHs). These are defined by on-chain analytics firm Glassnode as entities hodling BTC for a maximum of 155 days.</p><p>“Fully expect Bitcoin to test the short-term holder cost basis, which is $28.3K. This would be the third time testing this support level this year,” James Straten, research and data analyst at crypto insights firm CryptoSlate, <a href=\"https://twitter.com/jimmyvs24/status/1686299937665888256\" target=\"_blank\" rel=\"noopener nofollow\">forecast</a> on the day alongside Glassnode data.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/8efb307e-5737-4c67-a271-915f75e8d578.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin long/short-term cost basis data. Source: James Straten/Twitter</em></figcaption></figure><p>As Cointelegraph reported, the STH cost basis <a href=\"https://cointelegraph.com/news/bitcoin-price-stuck-30k-3-reasons-why\">has figured as support</a> throughout recent months, with <a href=\"https://cointelegraph.com/news/btc-price-metric-warns-bitcoin-sell-33k\">STH selling intensity</a> likewise on the radar as a hurdle for bulls to overcome above $33,000.</p><h2>Key BTC price moving average inches closer</h2><p>Continuing, popular trader Titan of Crypto described $28,300 as the “level to watch” for the coming week.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/btc-price-monthly-close-5-things-bitcoin-this-week\">BTC price ‘fireworks’ after monthly close? 5 things to know in Bitcoin this week</a></em></strong></p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> Update (Weekly Timeframe) <a href=\"https://twitter.com/hashtag/BTC?src=hash&amp;ref_src=twsrc%5Etfw\">#BTC</a> seems to be following the plan. <br>$28.3k is the key level to watch this week.  <a href=\"https://t.co/ZFCbYOwCb3\">https://t.co/ZFCbYOwCb3</a> <a href=\"https://t.co/CoTl5sywQC\">pic.twitter.com/CoTl5sywQC</a></p>&mdash; Titan of Crypto (@Washigorira) <a href=\"https://twitter.com/Washigorira/status/1686317984770404353?ref_src=twsrc%5Etfw\">August 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Daan Crypto Trades meanwhile eyed the 200-week moving average (MA) — a classic bear market support level — as a point of interest should further downside ensue. The 200-week MA stood at $27,235 as of Aug. 1.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/fb8872b1-aeed-4386-8a8d-cbea095e3239.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-day chart with 200-week MA. Source: TradingView</em></figcaption></figure><p>“During this year, the Daily 200MA/EMA have proven to be a strong support for Bitcoin,” he <a href=\"https://twitter.com/DaanCrypto/status/1686320115493621762\" target=\"_blank\" rel=\"noopener nofollow\">told</a> Twitter followers. </p><blockquote>“This area definitely got my interest if price were to visit there at some point. Keep in mind this could take a while and we could re-visit these at a higher price.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/282c0635-8adc-4d6e-977c-7e20e135330f.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Daan Crypto Trades/Twitter</em></figcaption></figure><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-human-digital-souls-agi-alignment-problem-replika/\"><strong><em>Experts want to give AI human ‘souls’ so they don’t kill us all</em></strong></a></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-01T12:57:48.000Z",
    "title": "Tether Swiftly Blacklists Phishing Address After $20M Theft",
    "url": "https://cryptobriefing.com/tether-swiftly-blacklists-phishing-address/?utm_source=feed&utm_medium=rss",
    "description": "A zero transfer scammer stole $20 million worth of Tether (USDT) on August 1, only to be quickly blacklisted by the stablecoins issuer. Curious who this would be if it..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-01T13:01:57.000Z",
    "title": "Nomura's Laser Digital: A New Crypto Force in Dubai",
    "url": "https://cryptodaily.co.uk/2023/08/nomura-laser-digital-a-new-crypto-force-in-dubai",
    "description": "<p>Dubai's financial landscape has witnessed a significant development with the awarding of a full crypto licence to Laser Digital Middle East FZE, a subsidiary of Nomura Holdings Inc.&nbsp;</p>\n<p>This move marks one of the initial full permits granted by Dubai since its revamp of the digital asset regulatory framework. Laser Digital, with its roots in Nomura, is poised to make a significant impact in the crypto space. The newly acquired licence empowers the firm to offer Virtual Asset Broker-Dealer Services and Virtual Asset Management and Investment Services.&nbsp;</p>\n<p>As reported by Bloomberg and Reuters, Laser Digital is gearing up to introduce over-the-counter (OTC) trading services and a diverse array of digital asset investment products tailored for institutional investors.&nbsp;</p>\n<p>The inception of Laser Digital can be traced back to last year, a venture co-founded by Steven Ashley, former leader of Nomura's wholesale division, and Jez Mohideen, who once held the roles of Nomura&rsquo;s Chief Digital Officer and Co-Head of Global Markets EMEA.&nbsp;</p>\n<p>With headquarters in Switzerland and other offices in Dubai and London, Laser Digital blends the best practices of global investment banking with the expertise of a team deeply rooted in the crypto domain. Jez Mohideen, the driving force behind Laser Digital, expressed his gratitude towards the Virtual Asset Regulatory Authority (VARA) for the licence approval.&nbsp;</p>\n\n<p>&ldquo;We are very grateful to VARA for approving our Operating Licence. VARA&rsquo;s thorough and consultative process provides institutional investors with the assurance they require to engage in this asset class. With the licence now in place, we are looking forward to Laser&rsquo;s growth over the coming years.&rdquo;</p>\n\nSlow but sure global adoption&nbsp;\n<p>Perhaps it is still happening quite slowly, but the world contenders to become the main hub for the global crypto market appear to be getting their regulatory ducks in a line and are starting to attract the kind of institutional firms, such as Nomura, that will take the crypto sector forward into the next stage of adoption.</p>\n<p>Dubai is likely to have some heavy competition from its fellow Asian jurisdictions of Hong Kong and Singapore, while in Europe, the UK, France and others are looking to become crypto hubs. However, in the US, the regulatory environment is still sluggish and anything but clear. A move en masse out of this jurisdiction could still happen.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T13:06:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T13:03:49.000Z",
    "title": "Institutional Investors Drive Crypto Price Surge; Experts Predict Further Gains",
    "url": "https://www.cryptopolitan.com/institutional-investors-drive-crypto-price-surge-experts-predict-further-gains/",
    "description": "Institutional investors boost crypto investments while exploring price prediction insights. Stay informed with our article. Institutional investors are flocking toward the crypto market. Individuals looking for a surge in the prices of their holdings can eventually expect things to go their way. Institutional investors are those who invest on someone’s behalf. Ideally, someone represents a ... <a title=\"Institutional Investors Drive Crypto Price Surge; Experts Predict Further Gains\" class=\"read-more\" href=\"https://www.cryptopolitan.com/institutional-investors-drive-crypto-price-surge-experts-predict-further-gains/\" aria-label=\"More on Institutional Investors Drive Crypto Price Surge; Experts Predict Further Gains\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T12:59:58.000Z",
    "title": "London-based Institution Launches AI-Powered Digital Teacher",
    "url": "https://www.cryptopolitan.com/ai-powered-digital-teacher/",
    "description": "Otermans Institute has announced the groundbreaking creation of reportedly the world&#8217;s first AI-powered digital teacher, OIAI, designed to bridge the global shortage of 69 million teachers and revolutionize the education landscape. The innovative educational platform utilizes digital teachers powered by Artificial Intelligence, capable of delivering personalized and human-enjoy teaching experiences to learners worldwide. The first ... <a title=\"London-based Institution Launches AI-Powered Digital Teacher\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-powered-digital-teacher/\" aria-label=\"More on London-based Institution Launches AI-Powered Digital Teacher\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-01T12:54:37.000Z",
    "title": "Analyzing crypto trends and growth potential: Borroe, Polygon, and Avalanche",
    "url": "https://crypto.news/analyzing-crypto-trends-and-growth-potential-borroe-polygon-and-avalanche/",
    "description": "Experts are unsure about Polygon and Avalanche, but hopeful for Borroe and expect ROE to outperform MATIC and AVAX"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-01T12:50:13.000Z",
    "title": "BONE sees 25% weekly gains as daily addresses surge",
    "url": "https://crypto.news/bone-sees-25-weekly-gains-as-daily-addresses-surge/",
    "description": "Bone ShibaSwap (BONE), the governance token for the ShibaSwap DEX and one of the Shiba Inu ecosystem tokens, has skyrocketed 25% over the past week. The impressive run has been supported by a noticeable surge in daily active addresses since&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-01T12:45:50.000Z",
    "title": "Binance re-enters Japan with 34 tokens listed",
    "url": "https://crypto.news/binance-re-enters-japan-with-34-tokens-listed/",
    "description": "Binance Japan, set to launch in August fully, aims to list 34 tokens initially, surpassing all domestic rivals. The news from local crypto media outlet Coinpost also revealed that Binance Japan is planning to introduce its native token, BNB, to&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-01T12:40:59.000Z",
    "title": "FTX reorganization plan announced, FTT rallies",
    "url": "https://crypto.news/ftx-reorganization-plan-announced-ftt-rallies/",
    "description": "The fallen cryptocurrency exchange FTX and its Unsecured Creditors Committee (UCC) announced its plan to reorganize and launch a new project called FTX 2.0. On May 23, the exchange revealed its initial plan to relaunch the project with its new&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-01T12:47:01.000Z",
    "title": "Federal Judge Disagrees with Ripple Decision – Is XRP in Danger?",
    "url": "https://www.crypto-news-flash.com/federal-judge-disagrees-with-ripple-decision-is-xrp-in-danger/?utm_source=rss&utm_medium=rss&utm_campaign=federal-judge-disagrees-with-ripple-decision-is-xrp-in-danger",
    "description": "<img width=\"1038\" height=\"584\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE.png 1038w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-24x14.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-36x20.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-48x27.png 48w\" sizes=\"(max-width: 1038px) 100vw, 1038px\" />A recent ruling by a US District Judge contested Judge Analisa Torres&#8217; decision in the Ripple case. Judge Rakeoff&#8217;s 50-page Opinion and Order found the SEC&#8217;s arguments plausible, indicating that the TerraUSD (UST) and LUNA sale potentially violated U.S. Securities law. On July 31, there was a significant development as U.S. Judge Jed Rakoff from [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-01T13:06:08.000Z",
    "title": "Uniswap (UNI) Down 1.20% After Whale Decides To Take Profit",
    "url": "https://coinedition.com/uniswap-uni-down-1-20-after-whale-decides-to-take-profit/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-10.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Uniswap (UNI) Down 1.20% After Whale Decides To Take Profit\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-10.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-10-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-10-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-10-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-10-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-10-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-10-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-10-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-10-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-10-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-10-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-10-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-10-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-10-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-10-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Price-analysis-10-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A whale by the name of stevu.eth deposited 200K Uniswap (UNI) to the cryptocurrency exchange OKX to take profits, according to a tweet posted earlier today by the on-chain analytics platform Lookonchain. On Saturday, this whale withdrew 500,545 UNI, worth approximately $2.46 million, from OKX when the price of the altcoin stood at $4.92. Lookonchain [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/uniswap-uni-down-1-20-after-whale-decides-to-take-profit/\">Uniswap (UNI) Down 1.20% After Whale Decides To Take Profit</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]