[
  {
    "source": "CoinDesk",
    "date": "2023-07-24T15:54:20.000Z",
    "title": "Crypto Investors Sour on Bitcoin Funds After Massive Inflows, Turn Instead to Ether and XRP",
    "url": "https://www.coindesk.com/markets/2023/07/24/crypto-investors-sour-on-bitcoin-funds-after-massive-inflows-turn-instead-to-ether-and-xrp/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Digital asset investment products recorded outflows last week for the first time since mid-June, CoinShares reported."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-24T15:45:00.000Z",
    "title": "Conflux (CFX) Price Prediction: Is Uwerx (WERX) A Better Crypto Investment Than The Them?",
    "url": "https://cryptodaily.co.uk/2023/07/conflux-cfx-price-prediction-is-uwerx-werx-a-better-crypto-investment-than-the-them",
    "description": "<p class=\"s5\">Crypto enthusiasts usually go for cryptocurrencies that have been around for a while because of these coins' proven success in the market. But the story is different with the new project Uwerx, which has traders buying in bulk even though it has yet to launch. </p>\n<p class=\"s5\">Uwerx is having a successful presale, to the amazement of its developers and the benefit of early investors. Having smashed through its first four stages in less than two months, analysts believe Uwerx will make a better investment than Open Campus (EDU) and Conflux (CFX). </p>\nOpen Campus (EDU) Sees An Downward Trend\n<p class=\"s5\">Open Campus (EDU) has reached a wider audience since it partnered with Animoca Brands to launch the Web3 Global Educators Fund. This has translated to an increase in the number of members joining the Open Campus (EDU) community. </p>\n<p class=\"s5\">Additionally, the project's Publisher NFTs have become a favorite among educators and content creators as it gives them the means to earn revenue for their work. </p>\n<p class=\"s5\">Despite the increase in Open Campus (EDU) adoption, the project has not risen in price in the last seven days. Open Campus trades at $1.00, representing a -13.84% decrease in the last seven days. Analysts predict it to trade at $2.07 by the first quarter of 2024</p>\nConflux (CFX) Rises In The Last 24hrs\n<p class=\"s5\">The past 24hrs have been good to Conflux (CFX). The project trades at $0.24, representing a 9.37% increase within 24 hours. Although this current price represents a -23.55% decrease in the last seven days, Conflux (CFX) holders believe this could be the start of the project's bull run. </p>\n<p class=\"s5\">Conflux (CFX) announced on June 2 via Twitter that it has partnered with Code4arena. This collaboration will provide enhanced security for both ecosystems.</p>\n<p class=\"s5\">Following the partnership, the Conflux (CFX) team announced on June 6 that they were aware of the recent cross-chain irregularity in their ecosystem. They assured users they had taken preventive action by removing Multichain's co-mint rights. This will ensure the security of user assets. The project also stated that they had not detected any loss, and the ecosystem was functioning as usual.</p>\n<p class=\"s5\">With more partnerships and improvements, analysts believe the CFX token could increase to $0.31 by the end of this year.</p>\nJoin The Future Of Decentralized Freelancing With Uwerx (WERX)\n<p class=\"s5\">According to a 2022 statistic from Velocity Global, at least 36% of the American workforce freelances. This suggests a need to bring new ideas and innovations to the freelance industry. Uwerx is entering the cryptocurrency market as a much-needed innovation that will revolutionalize the gig economy. It will offer unique benefits to freelancers, such as a minimal 1% transaction fee, fast payments, intellectual property rights protection, and more. </p>\n<p class=\"s5\">Still on presale, Uwerx is already making significant strides and attracting investors' attention. Uwerx is currently valued at $0.05245 in its ongoing fifth presale stage. However, analysts see the project growing exponentially in the coming months. They predict the WERX token to rise above $2.6 by Q4 2024.</p>\n<p class=\"s5\">Uwerx takes the security of investors' funds seriously. The project has received audits from InterFi Network and SolidProof, ensuring top-tier protection. It also implemented a 25-year lock on developers' liquidity tokens on June 7, 2023.</p>\n<p class=\"s5\">Additionally, Uwerx released the Alpha version of its platform on May 19, 2023. This version features a Landing page, Sign-up page, Login page, Forgot Password, Hiring Dashboard, Freelancer/Client Initiation, The Initial Step of Job Creation and Initial Step of Finding Talent, My Activity, and Job Creation process pages. </p>\n<p class=\"s5\">All these features will lead to the rollout of the platform's Beta version, enabling users to test and experience the platform. User feedback is expected and can be sent to the email: feedback@uwerx.network.</p>\n<p class=\"s5\">The Uwerx Vault is another fantastic feature of Uwerx. Launched in April 2023, this feature allows users to store their WERX tokens for various lengths of time. Users will also earn rewards for using the Vault.</p>\n<p class=\"s5\">Uwerx's presale will end on July 31, 2023, so investors are advised to take advantage of the current low price to join the community before Uwerx launches into the coin market. </p>\n<p class=\"s5\">The Uwerx team pays attention to the community's needs and makes adjustments to solve those needs. The developers recently asked the community to vote on a test airdrop. 98.2% of respondents voted in favor of the test airdrop, which the team believes will enable users to verify their receiving wallet addresses. They will also relinquish smart contract ownership of the project, which will take effect once it lists on centralized exchanges. </p>\n<p class=\"s5\">These moves have increased investors' confidence in the project and have made them believe that Uwerx could be a prominent project in the coin market by the end of this year. </p>\n<p class=\"s5\">So what are you waiting for? Join this exciting presale and enjoy a 15% purchase bonus through the links below:</p>\n<p class=\"s5\">Presale: invest.uwerx.network</p>\n<p class=\"s5\">Telegram: https://t.me/uwerx_network</p>\n<p class=\"s5\">Twitter: https://twitter.com/uwerx_network </p>\n<p class=\"s5\">Website: https://www.uwerx.network</p>\n<p class=\"s5\">&nbsp;</p>\n<p class=\"s5\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-24T15:45:00.000Z",
    "title": "Bitcoin Price Analysis:  Bears Take Out 29089 - 25 July 2023",
    "url": "https://cryptodaily.co.uk/2023/07/bitcoin-price-analysis-bears-take-out-29089-25-july-2023",
    "description": "<p>BTC/USD Bears Take Out 29089:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 25 July 2023</p>\n<p>Bitcoin (BTC/USD) remained quite weak early in the Asian session as the pair plummeted to the 28973.24 area after trading as high as the 30350.70 area, a brief move that represented a test of a recent price objective associated with buying pressure around the 29525 and 29757.44 areas.&nbsp; Stops were elected below the 29403 and 29089 levels during the acute depreciation, downside price objectives linked to recent selling pressure around the 30421.29 and 29851.28 levels.&nbsp; Related downside price objectives include the 28775, 29386, and 27757 levels.&nbsp; The rapid depreciation also represented a test of the 28937 and 28845 levels, upside price objectives related to buying pressure from June around the 24750 and 26165 levels.&nbsp; Additional downside price objectives include the 29386, 28213, 28137, 27757, 27430, 27338, 27312, 26348, and 26199 levels.&nbsp;</p>\n<p>Below current price activity, the 28095.44 area represents the 23.6% retracement of the historical depreciating range from 69000 to 15460.&nbsp;&nbsp; Following recent upside activity, areas of technical support and potential buying pressure include the 28306, 27466, 26428, and 26272 levels.&nbsp; Above the market, upside price objectives include the 30526, 30611, 30762, and 31145 areas.&nbsp; Upside price objectives related to other levels of buying pressure include the 32125 and 33569 areas, and Stops are cited above additional upside price objectives around the 32043, 34531, 34658, and 35912 areas.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 100-bar MA (hourly) and below the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 29980.73 and the&nbsp;50-bar MA&nbsp;(Hourly) at 29853.07.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is Bearishly below MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T15:56:55.000Z",
    "title": "How Move-to-Earn Fosters a More Inclusive and Democratized Financial Landscape",
    "url": "https://www.cryptopolitan.com/move-to-earn-fosters-a-more-inclusive/",
    "description": "In recent years, the world has witnessed a seismic shift in the digital landscape, driven by the rapid evolution of blockchain technology and cryptocurrencies. Among the many innovative concepts born out of this revolution, &#8220;Move-to-Earn&#8221; (M2E) has emerged as a groundbreaking phenomenon that is reshaping the way we perceive and interact with digital assets.&#160; At ... <a title=\"How Move-to-Earn Fosters a More Inclusive and Democratized Financial Landscape\" class=\"read-more\" href=\"https://www.cryptopolitan.com/move-to-earn-fosters-a-more-inclusive/\" aria-label=\"More on How Move-to-Earn Fosters a More Inclusive and Democratized Financial Landscape\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T15:45:36.000Z",
    "title": "Why is the Mt. Gox Hack A Pivotal Moment in the Evolution of Cryptocurrencies?",
    "url": "https://www.cryptopolitan.com/mt-gox-hack-a-pivotal-moment-in-crypto/",
    "description": "In the realm of digital finance, few events have left as deep an impact as the infamous Mt. Gox hack. Serving as a stark reminder of the vulnerabilities and risks associated with cryptocurrency exchanges, this watershed incident continues to reverberate throughout the financial world long after its occurrence. The Mt. Gox hack represents a pivotal ... <a title=\"Why is the Mt. Gox Hack A Pivotal Moment in the Evolution of Cryptocurrencies?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/mt-gox-hack-a-pivotal-moment-in-crypto/\" aria-label=\"More on Why is the Mt. Gox Hack A Pivotal Moment in the Evolution of Cryptocurrencies?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T15:42:33.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-24T16:00:03.000Z",
    "title": "Shiba Inu Holders Jump Ship As DigiToads Presale Projecting 200x Profit Potential",
    "url": "https://www.crypto-news-flash.com/shiba-inu-holders-jump-ship-as-digitoads-presale-projecting-200x-profit-potential/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-holders-jump-ship-as-digitoads-presale-projecting-200x-profit-potential",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T130201.105.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T130201.105.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T130201.105-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto market is a hub for promising opportunities, with substantial gains to be made by just being early. Shiba Inu is one of the many projects early crypto enthusiasts have made life-changing wealth from. And now a new opportunity has presented itself—DigiToads. With whispers and promises of potential astronomical profit spreading within the crypto [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-24T16:00:02.000Z",
    "title": "These Gems Are the Must-Buy Altcoins of the Moment: Monero (XMR), Polygon (ADA), Borroe (ROE)",
    "url": "https://www.crypto-news-flash.com/these-gems-are-the-must-buy-altcoins-of-the-moment-monero-xmr-polygon-ada-borroe-roe/?utm_source=rss&utm_medium=rss&utm_campaign=these-gems-are-the-must-buy-altcoins-of-the-moment-monero-xmr-polygon-ada-borroe-roe",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T174414.581.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T174414.581.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T174414.581-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T174414.581-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T174414.581-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T174414.581-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto market is continuously expanding, with new projects pushing the boundaries of blockchain technology and its impact on traditional industries. Among the plethora of altcoins on the market, three cryptocurrencies stand out, capturing investors’ attention: Monero (XMR), Polygon (ADA), and a game-changer entrant in the Web3 space, Borroe (ROE).  Borroe: Unleashing the Potential of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-24T15:56:25.000Z",
    "title": "Animal-Themed Cryptocurrencies Take Center Stage: Hamsters, Roaches, and Snails Charm Crypto Traders",
    "url": "https://www.crypto-news-flash.com/animal-themed-cryptocurrencies-take-center-stage-hamsters-roaches-and-snails-charm-crypto-traders/?utm_source=rss&utm_medium=rss&utm_campaign=animal-themed-cryptocurrencies-take-center-stage-hamsters-roaches-and-snails-charm-crypto-traders",
    "description": "<img width=\"1280\" height=\"853\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/stock-trading-g1986d120e_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/stock-trading-g1986d120e_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/stock-trading-g1986d120e_1280-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/stock-trading-g1986d120e_1280-1024x682.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/stock-trading-g1986d120e_1280-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/stock-trading-g1986d120e_1280-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Bitcoin takes the backseat as new animal-themed tokens make their way into the market.  One whale has reportedly made over $400,000 in profit after trading HAMS, an animal-themed asset.  As newer digital currencies make their way into the market, Bitcoin seems to be taking the backseat. A significant number of cryptocurrencies have been making rounds [...]"
  }
]