[
  {
    "source": "CryptoGlobe",
    "date": "2023-10-06T22:00:00.000Z",
    "title": "Shiba Inu ($SHIB) Could Soon Surge to 8-Month High, Says Crypto Analyst",
    "url": "https://www.cryptoglobe.com/latest/2023/10/shiba-inu-shib-could-soon-surge-to-8-month-high-says-crypto-analyst/",
    "description": "A popular proponent of the meme-inspired cryptocurrency Shiba Inu ($SHIB) has recently suggested the cryptocurrency could soon surge to move to an 8-month high of around $0.0003, at a time in which the cryptocurrency market keeps trading sideways. According to a post from the analyst $SHIB Knight on the microblogging platform X (formerly known as […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-06T22:00:15.000Z",
    "title": "39-Month Cycle Says XRP Price Is Poised For Breakout To $1,000, Here’s When",
    "url": "https://www.newsbtc.com/analysis/xrp/39-month-cycle-xrp-price-1000/",
    "description": "A crypto analyst has presented a 39-month analysis that could determine when the XRP price will rally to a new all-time high. The analysis marks a return of this trend, which could see XRP rise as high as $1,000. The 39-Month Cycle Pseudonymous crypto analyst NeverWishing on TradingView has presented a rather convincing 39-month cycle trend that often ends with the XRP price seeing a significant rise. The last time this trend was completed was back in mid-2020 just before the 2020/2021 bull market began. When this trend was marked three years ago, it ended with the XRP price rallying from $0.17 in June to $2 in April 2021. Since then, another 39-month cycle began counting and once again, it has reached the point where a surge usually occurs. In the chart presented by NeverWishing, the expected price jump this time around will be less like the 2020-2021 trend and more like the 2017-2018 jump. In 2017 when the 39-month cycle jump took place, XRP went from $0.005 to $3.3 at its peak, meaning a 66,000% jump in price. However, the analyst expects even more explosive growth with the XRP price going from around $0.53 to $1,000 by the time the rally is complete. This means a more than 188,000% rise from the current price levels. XRP nosedive to $0.51 as bears take control &#124; Source: XRPUSD on Tradingview.com When Will The XRP Price Reach $1,000? The previous 39-month cycle jumps outlined by the crypto analyst both hit their peak a little less than a year later. The 2017-2018 rally was 11 months and the 2020-2021 rally was 10 months, so it is expected that it will stick close to this timeframe this time around. NeverWishing’s chart shows the rally starting in November and hitting $2 in the next four months. From then on, there are multiple important price levels outlined including $16 by the end of April 2024 and $118 by June 2024. Roadmap to $1,000 &#124; Source: Tradingview.com Then for the grand prize of $1,000, the crypto analyst sets a target date for December 2024, around 13 months from the rally’s start. So if this prediction does come to pass, the XRP price could be trading between $869-$1,000 in a little over a year. The 39-month cycle trend looks similar to the four-year Bitcoin cycle. However, unlike Bitcoin whose four-year cycle is characterized by the infamous halving event, the XRP 39-month cycle does not have a significant event. Instead, it looks to just follow work mainly on a timeframe basis. Nevertheless, some recent developments could lend credence to a bull rally such as Ripple’s multiple wins over the US Securities and Exchange Commission (SEC) just this year alone. Additionally, Ripple has been expanding its footprint globally as it looks to take a big chunk of the payments sector for itself. Featured image from Bitcoinist, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-06T22:01:43.000Z",
    "title": "Whales Move Over $730,000,000 in Bitcoin, Ethereum, Dogecoin and XRP – Here’s Where the Crypto’s Going",
    "url": "https://dailyhodl.com/2023/10/06/whales-move-over-730000000-in-bitcoin-ethereum-dogecoin-and-xrp-heres-where-the-cryptos-going/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/Whales-Move-Over-600.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/Whales-Move-Over-600.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/Whales-Move-Over-600.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/Whales-Move-Over-600.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/Whales-Move-Over-600.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/Whales-Move-Over-600.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/Whales-Move-Over-600.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>New data reveals that deep-pocketed crypto investors are suddenly shifting hundreds of millions of dollars worth of Bitcoin (BTC) and other digital assets. According to data from whale-surveying platform Whale Alert, just over $400 million worth of the top crypto asset by market cap has moved to top US-based crypto exchange platform Coinbase or unknown [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/06/whales-move-over-730000000-in-bitcoin-ethereum-dogecoin-and-xrp-heres-where-the-cryptos-going/\">Whales Move Over $730,000,000 in Bitcoin, Ethereum, Dogecoin and XRP – Here’s Where the Crypto’s Going</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]