[
  {
    "source": "CryptoGlobe",
    "date": "2024-01-13T03:03:00.000Z",
    "title": "Solana ($SOL): Crypto Analyst Predicts Potential Rise to $165 After 480% Surge in a Year",
    "url": "https://www.cryptoglobe.com/latest/2024/01/solana-sol-crypto-analyst-predicts-potential-rise-to-165-after-480-surge-in-a-year/",
    "description": "Ethereum ($ETH) rival Solana ($SOL) could see its price soar in the near future after breaking out from a key chart pattern on its four-hour chart, to potentially as high as $150 to $165 per token. According to popular cryptocurrency analyst Ali Martinez, the price of Solana could surge an additional 47% if it manages […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-13T03:00:43.000Z",
    "title": "Grayscale’s 4,000 Bitcoin Transfer Worth $175M Stirs Market Speculation Amid Record ETF Trading Volume",
    "url": "https://news.bitcoin.com/grayscales-4000-bitcoin-transfer-worth-175m-stirs-market-speculation-amid-record-etf-trading-volume/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/gbtc-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Grayscale’s 4,000 Bitcoin Transfer Worth $175M Stirs Market Speculation Amid Record ETF Trading Volume\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/gbtc-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/gbtc-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/gbtc-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/gbtc-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/gbtc-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/gbtc-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/gbtc.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Recent blockchain analytics reveal that 4,000 bitcoins, valued at approximately $175 million, have been transferred from addresses believed to be controlled by Grayscale&#x2019;s Bitcoin Trust, commonly referred to as GBTC. Records indicate that these transfers occurred in four separate batches of 1,000 bitcoins each, directed towards Coinbase. Arkham Data Shows Flagged Grayscale Wallets Sent 4,000 [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-13T03:07:23.000Z",
    "title": "Revolutionizing Waste Management – AI-Powered Solutions Take Center Stage",
    "url": "https://www.cryptopolitan.com/waste-management-ai-powered-solutions/",
    "description": "In a groundbreaking move for smart waste management, the German company c-trace GmbH unveils its revolutionary AI-powered solution, c-detect. As smart cities continue to integrate innovative technologies to enhance residents&#8217; lives, minimize environmental impact, and optimize resource usage, efficient waste management becomes a cornerstone. The real news lies in c-trace&#8217;s commitment to meeting Germany&#8217;s strict [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-13T03:00:21.000Z",
    "title": "Coinbase Expands To Africa, This Partnership Will Make It Happen",
    "url": "https://www.newsbtc.com/coinbase/coinbase-expands-to-africa-this-partnership-will-make-it-happen/",
    "description": "On January 11, crypto exchange Coinbase unveiled its partnership with Yellow Card, the largest and first licensed Stablecoin on/off ramp on the African continent, to expand the access of their products to emerging economies across the African continent. Expansion To Emerging Economies Coinbase will expand access to its products through this new partnership with Yellow Card, starting with 20 African countries. They will provide millions of African users access to USD Coin (USDC) on the Coinbase Wallet and the Yellow Card app. Both partners expect to “increase economic freedom” in many of these countries, whose economies have suffered from high inflation and remittance dependency and the lack of a modern financial system vastly sought by the younger generations. As they state in their press release: Young people are more likely to recognize the benefits of crypto: more than seven in 10 crypto owners globally (72%) are under age 34. Related Reading: Coinbase Custody Head Departs As Crypto Giant Prepares For Bitcoin ETF Services Their Plan To Make The Global Financial System &#8220;More Accesible&#8221; To achieve opening access to a more modern and global financial system, they will facilitate access to USDC on Base for cheaper fees and faster transactions than traditional transfers starting in February 2024. In the Coinbase Wallet, users will be able to purchase USDC directly from their Wallet app, as well as sending USDC without any fee to messaging and social media apps, as they noted: Coinbase Wallet users will be able to easily send USDC without fees on any platform where they can share a link — including messaging apps like WhatsApp, iMessage and Telegram, and through popular social media apps and email. Users of the Yellow Card’s platform can purchase USDC on Base and transfer through the L2 blockchain, benefiting from cheaper fees and easy access to the stablecoin, too. Chris Maurice, Co-Founder and CEO of Yellow Card, expressed his excitement in an X (formerly known as Twitter) post. Maurice is optimistic about the future of the partnership and the solutions it might bring to African people and businesses. The partnership aims to protect users&#8217; savings across the African continent from &#8220;unstable currencies&#8221; and economic volatility due to the high inflation rates of up to 18.5%. Related Reading: Coinbase Introduces New Features For Global Remittances They will offer lower remittance fees, with the maximum fee being 2%. As well as offering access to the global financial system to small and medium enterprises (SMEs) by allowing merchants to set up a Wallet in less than a minute and broadening their growth. In summary, the Coinbase and Yellow Card partnership will expand solutions for people and businesses in 20 African countries by making the global financial system more accessible. Coinbase (COIN) is currently at $132.85 on the daily chart. Source: COINUSD on Tradingview.com Featured image from Unsplash, Chart from TradingView.com"
  }
]