[
  {
    "source": "CoinDesk",
    "date": "2023-08-11T15:45:22.000Z",
    "title": "Struggling Crypto Custodian Prime Trust Looks Poised for Potentially Massive Layoffs, Sources Say",
    "url": "https://www.coindesk.com/business/2023/08/11/struggling-crypto-custodian-prime-trust-looks-poised-for-potentially-massive-layoffs-sources-say/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Nevada regulators recently ordered the crypto company, which BitGo had planned to buy, to cease operations and noted a shortfall in customer funds."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-11T16:02:39.000Z",
    "title": "'Parallel' Puts an Epic Sci-Fi Spin on Complex NFT Card Battles",
    "url": "https://decrypt.co/152075/parallel-puts-epic-sci-fi-spin-complex-nft-card-battles-preview",
    "description": "PREVIEW: Parallel is a competitive trading card game with NFTs—for fans of the genre and space operas alike. We go hands-on with the beta."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-11T15:57:07.000Z",
    "title": "Musician Nick Cave Rails Against AI: ChatGPT Is the 'Commodification of the Human Spirit'",
    "url": "https://decrypt.co/152185/musician-nick-cave-rails-against-ai-chatgpt-is-the-commodification-of-the-human-spirit",
    "description": "Cave asserts AI overlooks the struggles in creativity and mechanizes the artistic process."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-11T16:00:39.000Z",
    "title": "Bitcoin holders display resilience despite market downturn triggered by Silicon Valley Bank collapse",
    "url": "https://cryptoslate.com/insights/bitcoin-holders-display-resilience-despite-market-downturn-triggered-by-silicon-valley-bank-collapse/",
    "description": "<p>Quick Take Tracing back to 155 days ago, the financial landscape encountered substantial turbulence with the collapse of Silicon Valley Bank around March 9 and 10, resulting in Bitcoin price plummeting below the $20,000 mark. However, this challenging environment didn&#8217;t seem to deter the resolve of long-term Bitcoin holders. Data analysis indicates that the long-term [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-holders-display-resilience-despite-market-downturn-triggered-by-silicon-valley-bank-collapse/\">Bitcoin holders display resilience despite market downturn triggered by Silicon Valley Bank collapse</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-11T16:00:00.000Z",
    "title": "Canada to Set up Storage for Seized Digital Assets",
    "url": "https://cryptodaily.co.uk/2023/08/canada-to-set-up-storage-for-seized-digital-assets",
    "description": "<p>As cybercrimes rise in the country, Canada challenges local developers to create a secure repository for seized cryptocurrencies and NFTs.&nbsp;</p>\nChallenge for Creating a Digital Asset Repository\n<p>Due to a reported rise in crypto-related illegal activities across the country, the Royal Canadian Mounted Police (RCMP) and Shared Services Canada (SSC) are pursuing a solution that can facilitate the seizure and storage of digital assets such as cryptocurrencies and non-fungible tokens (NFTs) on various blockchains, according to the statement of August 10, 2023.&nbsp;</p>\n\n<p>&ldquo;The RCMP requires the ability to safely and securely store digital assets that have been seized and retained, until their eventual disposition at the conclusion of any legal proceedings. The development of a centralized repository solution would allow police officers to seize these assets in a user friendly manner, while also offering significant security to prevent the theft of said assets during their storage,&rdquo; reads the statement.</p>\n\n<p>The authorities dare the Canadian innovative developers to come up with a safe digital asset repository that would help the police seize and safeguard stolen assets, in an effort to decrease cryptocurrency frauds.&nbsp;</p>\n<p>The RCMP outlines fourteen mandatory and three desirable features a proposed solution should have. The primary considerations require the repository to be able to accept and process transactions on the top 20 cryptocurrency networks by market capitalization, as well as onboard and support new blockchains in the future.</p>\n<p>Other demands on the list include a native Android application; secure processes to protect assets and dispose of them if needed; daily automated verification and notifications on asset transfers; clear instructions on seizing assets for officers; and more. The RCMP also listed three NFT blockchains that must be supported by the system at this stage &ndash; Ethereum, Solana, and Polygon.&nbsp;</p>\n<p>Participants of the challenge can submit their idea until September 21, 2023. Up to four contracts for Phase 1 could result from the challenge. Then, only two eligible businesses will be invited to submit a proposal for Phase 2.&nbsp;</p>\nCombatting Cryptocurrency-Related Crimes\n<p>The main reason behind the development of the digital asset repository is the surge of crypto-related activities in Canada:</p>\n\n<p>&ldquo;With the rise of new and innovative methods to store and transfer assets, Canadian Law enforcement needs a safe and secure method to identify and seize said assets. As cryptocurrency continues to gain popularity as a transaction method and store of value in the general population, it continues to be used as a payment method for criminal activities. With ransomware/malware attacks and online scams making up the majority of these transactions. This challenge aims to leverage the private sectors innovation to develop a system used by the police to seize and store the ill-gotten gains from these criminal activities.&rdquo;</p>\n\n<p>It&rsquo;s important to note that Canada is not the only country that experiences a rise in crimes linked to digital assets. For example, the FBI in the US has also recently reported numerous scams related to cryptocurrencies and NFTs, with one of the recent cases resulting in the loss of staggering $9million.&nbsp;</p>\n<p>Besides, other countries are also looking for effective ways to deal with crypto crimes. One of the latest examples is a multi-agency investigation unit established by South Korea.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-11T15:45:00.000Z",
    "title": "Glorious Ethereum Breakout on the cards as ETH and $ROE set for big rallies.",
    "url": "https://cryptodaily.co.uk/2023/08/glorious-ethereum-breakout-on-the-cards-as-eth-and-roe-set-for-big-rallies",
    "description": "<p class=\"s3\">A top crypto trader's bold prediction of a \"glorious\" Ethereum breakout has set the stage for an even more remarkable rally for $ROE, the native crypto of Borroe, an innovative AI-powered Web3 blockchain project. $ROE has emerged as a prime contender to outshine ETH in the crypto market.</p>\nBorroe Finance's Unique Marketplace Takes Center Stage as $ROE Presale Gains Momentum\n<p class=\"s11\">As innovation is the driving force in the Web3 space, one project is capturing the attention of investors and blockchain analysts alike &ndash; Borroe Finance. This groundbreaking platform has introduced a unique marketplace that utilizes blockchain, tokenization, smart contracts, NFTs, and AI-powered risk assessment to revolutionize how Web3 businesses access funding. </p>\n<p class=\"s11\">As Borroe Finance continues its presale, the crypto community is excited over the potential of its native token, $ROE, to outperform even the mighty Ethereum.</p>\n<p class=\"s11\">At the heart of Borroe Finance lies its innovative marketplace, where businesses can mint Non-Fungible Tokens (NFTs) representing future revenue streams and outstanding invoices. </p>\n<p class=\"s11\">These NFTs are then sold at a discount, enabling Web3 startups to access upfront cash quickly and efficiently. The platform's AI-driven risk assessment and automated process ensure transparency, security, and timely funding, building confidence among investors and paving the way for the $ROE token to shine.</p>\nWhat further sets Borroe Finance apart is its commitment to regulation and best practices. \n<p class=\"s11\">The project proactively seeks regulatory compliance, ensuring that it operates within legal frameworks and safeguards consumer welfare. This strategic approach provides a solid foundation for investors, offering peace of mind and reducing potential risks associated with regulatory uncertainty.</p>\n<p class=\"s11\">One of the standout features of Borroe Finance is its recent smart audit by BlockAudit, a top auditing firm renowned for its thorough analysis of blockchain projects. This audit underscores the project's commitment to security and trustworthiness, a vital factor in today's crypto landscape. </p>\n<p class=\"s11\">With the assurance of a reputable audit, $ROE's appeal as a safe investment option is further amplified.</p>\n<p class=\"s11\">As the crypto community looks ahead to an exciting future, $ROE presents an enticing entry point for investors seeking exposure to the Web3 revolution. Borroe Finance's experienced team, innovative solutions, and commitment to regulation make it an attractive choice for those looking to capitalize on the next big wave in the cryptocurrency market. </p>\n<p class=\"s11\">As analysts predict a \"glorious\" Ethereum breakout, the potential for $ROE to rally even harder and outperform ETH becomes a compelling narrative that investors can't ignore.</p>\nThe Successful $ROE Presale \n<p class=\"s13\">$ROE tokenomics is a cornerstone of Borroe Finance's ecosystem, designed to empower both investors and businesses within the Web3 space. </p>\n<p class=\"s13\">With a total supply of 1,000,000,000 tokens residing on the Polygon (Ethereum sidechain) chain, $ROE offers a unique value proposition differentiating it from traditional investments. </p>\n<p class=\"s13\">$ROE grants holders priority access to new sales in the Borroe marketplace, discounted fees, premium features, and rewards, including recognition and awards for marketplace participation. </p>\n<p class=\"s13\">Its role in facilitating the Borroe marketplace's streamlined processes and secure transactions makes $ROE essential, ensuring seamless interactions between buyers and sellers while driving growth in the Web3 ecosystem.</p>\n<p class=\"s14\">The presale stages of $ROE further enhance its appeal. With Stage One offering tokens at $0.0125 each, and the preceding Beta stage having sold out at $0.01 per token, early investors have witnessed the project's momentum and potential for value appreciation. </p>\n<p class=\"s14\">As the presale progresses through different stages, each with varying token prices, the tokenomics of $ROE creates an enticing opportunity for investors to participate in the project. </p>\n<p class=\"s14\">With the potential to outperform traditional investments and provide a unique gateway to the Web3 revolution, $ROE's tokenomics align investor incentives with Borroe Finance's mission of transforming the future of funding in the crypto space.</p>\n<p>&gt;&gt;BUY $ROE TOKENS NOW&lt;&lt;</p>\n$ROE to Dwarf ETH\n<p class=\"s3\">The crypto world is excited as Bluntz, a prominent trader known for accurately predicting Bitcoin's 2018 market bottom, unveils his latest analysis that's turning heads in the Ethereum (ETH) market. </p>\n<p class=\"s3\">In a recent tweet, Bluntz highlighted a nearly year-long wedge formation in the ETH/BTC trading pair, which he believes sets the stage for a \"glorious\" breakout. </p>\n<p class=\"s3\">The trader expressed optimism and signaled that the breakout might already be underway, suggesting a bullish target price of over 0.07 BTC (approximately $2,101). His prediction challenges the status quo, as he believes that many market participants are underprepared for Ethereum's potential upswing, making them vulnerable to a significant price movement.</p>\n<p class=\"s11\">Notably, Bluntz believes that Ethereum's bullish momentum has the potential to drive the price to an impressive high of 0.112 BTC (approximately $3,362). </p>\n<p class=\"s11\">This projection represents a substantial leap from Ethereum's current level of $1839. Investors and enthusiasts alike are eagerly watching Ethereum's price action, anticipating a \"glorious\" breakout and the potential for outsized gains continue to drive excitement within the crypto market. </p>\n<p class=\"s11\">As Ethereum's breakout scenario unfolds, $ROE's journey to outperforming ETH becomes an exciting narrative investors can't overlook. This is because, as the second-largest cryptocurrency by market capitalization, Ethereum's price movements often serve as a barometer for the broader market sentiment. </p>\n<p class=\"s11\">Ethereum's significant moves can trigger other altcoins to surge even harder and outperform the leader.</p>\nLearn more about Borroe ($ROE) here:\n<p class=\"s22\">Visit Borroe Presale | Join The Telegram Group | Follow Borroe on Twitter</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-11T15:45:00.000Z",
    "title": "Ethereum and Cardano TVL Explodes per Reports, Can Pomerdoge Catch Up?",
    "url": "https://cryptodaily.co.uk/2023/08/ethereum-and-cardano-tvl-explodes-per-reports-can-pomerdoge-catch-up",
    "description": "<p class=\"s5\">TVL or the total value of digital assets locked in a decentralized finance (DeFi) platform is often used as a metric to judge the growth of a network. A recent report shows that Ethereum (ETH) and Cardano (ADA) TVL have seen an upsurge. A new project, Pomerdoge (POMD), has shown potential, but can it keep up in the highly competitive cryptocurrency world?</p>\n<p>Click Here To Find Out More About The Pomerdoge (POMD) Presale</p>\nEthereum and Cardano TVL Explodes\n<p class=\"s5\">The TVL metric is often used to judge the growth of a DeFi network. Recent reports from Messari have shown that the TVL of Ethereum (ETH) and Cardano (ADA) has been on the rise despite the bearish crypto market.</p>\n<p class=\"s5\">According to Messari, the TVL of Cardano has increased by 198.6% year-to-date (YTD). Cardano now has more than $175 million locked in its DeFi ecosystem. The increase in TVL has helped Cardano move from the 34th position to the 21st in overall TVL across all blockchains.</p>\n<p class=\"s5\">Messari links the growth of Cardano&rsquo;s DeFi ecosystem to the launch of stablecoins, improved programming languages, and new wallets. On the other hand, Ethereum still dominates the DeFispace as the leading network. At the time of this writing, Ethereum has more than $23.5 billion in TVL.</p>\n<p class=\"s5\">The explosive growth of Cardano and Ethereum is considered impressive due to the recent price drop in crypto prices. With the prices of Ethereum and Cardano forecasted to recover by the end of 2023, the TVL locked in their respective chains could increase further.</p>\nCan Pomerdoge (POMD) Catch Up in the DeFi Space?\n<p class=\"s5\">In the already competitive DeFi space, a new project, Pomerdoge (POMD), is launching to public acclaim from market experts. There are bullish predictions for Pomerdoge because it is creating a unique niche for itself. Pomerdoge would be the first project to combine the fanfare of crypto meme coins with the fast-growing play-to-earn sector.</p>\n<p class=\"s5\">Pomerdoge is building an enthralling game where players can earn rewards and alsocommunicate via a social infrastructure. With unique, eccentric avatars called Pomerdoge, players will enter competitions in the eye-catching world of Pomerdoges. In-game products and NFTs can be sold for real money in the Pomerplace, the ecosystem's marketplace.</p>\n<p class=\"s5\">The platform is growing at an impressive rate as players have great opportunities to earn. Players can enter weekly contests and giveaways for a chance to win up to $100,000 in weekly giveaways. Experts have predicted that Pomerdoge will compete with the biggest names in DeFias it perfectly fuses entertainment and financial opportunity.</p>\n<p class=\"s5\">As a result, many analysts have predicted that Pomerdoge will become one of the P2E games and stage one of the largest rallies before the end of the year. Early forecasts estimate a 4,000% price gain for the Pomerdoge utility coin by December. Investors have a wonderful opportunity to join the Pomerdoge ecosystem before its massive rally, which is now trading at $0.007.</p>\nFind out more about the Pomerdoge (POMD) Presale Today:\n<p class=\"s5\">Website: https://pomerdoge.com/</p>\n<p class=\"s5\">Telegram Community: https://t.me/pomerdoge</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T15:50:08.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the series of delisting fuelled by the ongoing United States SEC crackdown on major crypto platforms. Basically, it&#8217;s crypto winter in the summer as it stands. How do Cardano Price Prediction analysts steer in this turbulent crypto weather? ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-11T16:06:04.000Z",
    "title": "Joe Rogan and Post Malone criticize US CBDC",
    "url": "https://crypto.news/joe-rogan-and-post-malone-criticize-us-cbdc/",
    "description": "The entertainment industry is diving into the Central Bank Digital Currencies (CBDCs) debate, with Joe Rogan and rapper Post Malone expressing their concerns. On the &#8220;Joe Rogan Experience&#8221; podcast, which boasts over 11 million listeners per episode, the two discussed&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-11T15:54:34.000Z",
    "title": "Worldcoin unlocks tokens for unverified users",
    "url": "https://crypto.news/worldcoin-unlocks-tokens-for-unverified-users/",
    "description": "The iris-scanning cryptocurrency initiative, Worldcoin, has introduced the ability for unverified users to secure their WLD tokens. The Worldcoin project recently revealed that the World App has integrated a reservations feature, simplifying the token reservation process for individuals who wish&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-11T16:00:55.000Z",
    "title": "Shiba Inu (SHIB) Rides On Bullish Waves As Shibarium Launch Nears, Buy Now?",
    "url": "https://www.newsbtc.com/shib/shiba-inu-shib-rides-on-bullish-waves-as-shibarium-launch-nears-buy-now/",
    "description": "This cryptocurrency, Shiba Inu dog-inspired logo, has garnered significant attention in the crypto community. As the highly anticipated Shibarium launch draws near, Shiba Inu (SHIB) is riding on bullish momentum.  In terms of the 7 days price gain, the meme coin is outperforming other notable assets like Bitcoin (BTC), Ethereum (ETH), XRP, and Dogecoin (DOGE), representing less than 1% price increase. Investors and enthusiasts are now considering whether to buy in as the project&#8217;s new development unfolds.  SHIB Price Gains Momentum As Shibarium Nears A recent examination of on-chain data by IntoTheBlock exposed a remarkable rise in transactions related to SHIB ranging from $100,000 to $1 million, demonstrating an astounding surge of 300% over the last month. The current upward movement can also be linked to a post by the main developer, Shytoshi Kusama, on July 31. Related Reading: Solana Cuts Saga Price By 40%, But Case For New SOL Yearly High Increases He stated that the launch of Shibarium is fast approaching, prompting the need to “mint the remaining supply of BONE and renounce the BONE contract.” Recall that the lead developer of Shiba Inu, Shytoshi Kusama, mentioned in a blog post on July 6 that the team plans to talk about and maybe launch Shibarium, the awaited layer 2 technology, at the ETHToronto and ETHWomen hackathons in Canada in August 2023.  He also shared a statement directly on the X application: &#8220;Here&#8217;s a math equation for those who like math. I won&#8217;t make it long: Shib &#62; X.&#8221; Going by his timeline, the eagerly anticipated release of the Layer 2 Shibarium will be on August 15-16 as part of the ETH Toronto event.  Launching the long-awaited Shibarium will likely boost investors&#8217; interest and hype within the Shiba Inu ecosystem. After Shibarium is launched, more people could want to invest in the $SHIB token, as it might create a new wave of excitement. Technical Indicators Signal Bullish Momentum As the Shibarium launch nears, the coin experienced bullish sentiment evident in the 4-green candles on the daily chart. According to the chart, SHIB/USDT has approached the upper Bollinger Bands indicator, suggesting a high bullish pressure.  The upper Bollinger Band is a resistance level, indicating that the coin&#8217;s price might be challenging to sustain further upward movement without a pullback. A breach of the upper Bollinger Band could signal a continuation of the uptrend, but if the price fails to break through and starts to decline, it might indicate the beginning of a retracement.  With the RSI level at 69, the coin&#8217;s price might hover in the overbought territory, suggesting a potential slowing down or a reversal. However, the MACD above the signal line indicates positive momentum and potential upward movement.  So the RSI indicates that the coin might be due for a corrective pullback, but the MACD suggests there is still buying interest.  Related Reading: Bittrex, SEC Reach Settlement In Securities Violation Case Considering the analysis, the coin could observe a period of consolidation or a minor dip before a potential continuation of the upward trend. Traders should closely monitor price action, especially around key support levels at $0.0000077, and be prepared for potential short-term volatility. As of today, Shiba Inu is trading at $0.00000105. According to CoinGecko statistics, it has advanced by 18% &#38; 24% over the last 7 and 14 days, respectively. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-11T16:02:25.000Z",
    "title": "Turning $100 Investment To $1000: $GOLDEN ERC-20 Token Potential High Amid CoinMarketCap Listing",
    "url": "https://www.crypto-news-flash.com/turning-100-investment-to-1000-golden-erc-20-token-potential-high-amid-coinmarketcap-listing/?utm_source=rss&utm_medium=rss&utm_campaign=turning-100-investment-to-1000-golden-erc-20-token-potential-high-amid-coinmarketcap-listing",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-11T185912.534.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-11T185912.534.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-11T185912.534-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the ever-evolving world of cryptocurrency investments, opportunities for substantial gains are often accompanied by calculated risks.  One such opportunity lies within the realm of hot new ERC-20 memecoin, Golden Inu ($GOLDEN), where a simple shift in decimal places could transform a hundred-dollar investment into nearly a thousand dollars.  As anticipation builds for Golden Inu’s [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-11T16:00:36.000Z",
    "title": "Avalanche Faces Skepticism; DigiToads’ Presale Beckons Investors with Huge Returns",
    "url": "https://www.crypto-news-flash.com/avalanche-faces-skepticism-digitoads-presale-beckons-investors-with-huge-returns/?utm_source=rss&utm_medium=rss&utm_campaign=avalanche-faces-skepticism-digitoads-presale-beckons-investors-with-huge-returns",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-8.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-8.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-8-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-8-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The cryptocurrency market is characterized by its contrasting volatility and positive price movements for certain projects, with investors looking to improve their portfolios. The Avalanche (AVAX) blockchain is affected by this volatility and faces the skepticism of the crypto community. This doubt results from Avalanche&#8217;s downward trend and dropping momentum as its prices fall, leaving [...]"
  }
]