[
  {
    "source": "Cointelegraph",
    "date": "2023-10-31T13:47:03.000Z",
    "title": "Siemens and Microsoft partner to push AI adoption in industrial sectors ",
    "url": "http://cointelegraph.com/news/siemens-microsoft-ai-adoption-industrial-sectors",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/a9a1e738-4760-4c75-93af-436a9284eb33.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> Microsoft and Siemens revealed a new generative-AI assistant catering to professionals in the manufacturing, healthcare, transportation and infrastructure industries.  </p>\n                    <p><p>The German technology company Siemens has partnered with Microsoft and <a href=\"https://news.microsoft.com/2023/10/31/siemens-and-microsoft-partner-to-drive-cross-industry-ai-adoption/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> its new generative artificial intelligence (AI) -powered assistant the Siemens Industrial Copilot. </p><p>On Oct. 31, the companies revealed the AI assistant to promote “human-machine collaboration” and enhance productivity. In the announcement, they have also revealed to be building additional AI assistants to cater to professionals in the manufacturing, healthcare, transportation and infrastructure industries. </p><p>The companies have stated that their goal is to bring the “benefits of generative AI to industries worldwide.” Within the manufacturing industry itself, the companies say they have planned Copilots for automotive, consumer packaged goods and machine building.</p><p>According to Microsoft, the German automotive manufacturer Schaeffler AG has already adopted the Siemens Industrial Copilot.</p><p>Satya Nadella, the chairman and CEO of Microsoft, said that he sees the next generation of AI being able to bring an acceleration of innovation “across the entire industrial sector.” </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/siemens-issues-60m-digital-bond-on-a-public-blockchain\"><strong><em>Siemens issues $64M digital bond on a public blockchain</em></strong></a></p><p>Roland Busch, the CEO of Siemens AG, echoed the sentiment saying:  </p><blockquote>“This has the potential to revolutionize the way companies design, develop, manufacture, and operate.”</blockquote><p>He highlighted that human-machine collaboration accessibility makes it so that engineers can increase the speed at which they’re able to develop code, innovate and overcome any labor shortages. </p><p>A direct competitor of Siemens, the German manufacturer Bosch, partnered with the Fetch.ai Foundation back in February to launch a <a href=\"https://cointelegraph.com/news/bosch-partners-in-100-million-web3-development-foundation\">$100 million grant scheme</a> to fund Web3, AI and IoT development projects. </p><p>Bosch was also seen at the IAA Mobility fair in Munich, German in September, piloting its innovations <a href=\"https://cointelegraph.com/news/bosch-eu-blockchain-companies-decentralized-iot-iaa-mobility\">in the automotive scene</a> alongside the EU and blockchain companies. </p><p>AI has been making waves in industries across the globe since the emergence of high-level models became more widely accessible in November 2022 with the release of OpenAI’s GPT-4.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-killed-translation-industry-easytranslate-boss-change-human-jobs/\"><strong><em>‘AI has killed the industry’: EasyTranslate boss on adapting to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-31T13:59:12.000Z",
    "title": "Bankrupt FTX moves $156M worth of assets including Ethereum and Solana",
    "url": "https://cryptoslate.com/bankrupt-ftx-moves-156m-worth-of-assets-including-ethereum-and-solana/",
    "description": "<p>Blockchain analytics firm Nansen reported that wallets connected to bankrupt FTX have moved up to $156 million worth of digital assets, including Ethereum (ETH) and Solana (SOL), in several transactions over the past week. Unstakes Solana In an Oct. 31 post on X (formerly Twitter), Nansen reported that FTX began unstaking 1.6 mill SOL tokens, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bankrupt-ftx-moves-156m-worth-of-assets-including-ethereum-and-solana/\">Bankrupt FTX moves $156M worth of assets including Ethereum and Solana</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-31T14:00:00.000Z",
    "title": "Memecoin Sensation $RISITS Surges Over 37,000% in a Week",
    "url": "https://www.cryptoglobe.com/latest/2023/10/memecoin-sensation-risits-surges-over-37000-in-a-week/",
    "description": "A little-known cryptocurrency that appears to be inspired by the Spanish comedian Juan Joya Borja, who gained global recognition for his distinctive laughter, has seen its price surge more than 37,000% in just a week. According to available data, as first reported by Benzinga, the price of the cryptocurrency Risitas ($RISITA) moved up to $0.1325 […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-31T14:00:01.000Z",
    "title": "Biden Administration Issues Landmark AI Executive Order",
    "url": "https://news.bitcoin.com/biden-administration-issues-landmark-ai-executive-order/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/firefly-una-orden-ejecutiva-sobre-una-mesa-con-una-bandera-de-estados-unidos-al-fondo-40636-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biden Administration Issues Landmark AI Executive Order\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/firefly-una-orden-ejecutiva-sobre-una-mesa-con-una-bandera-de-estados-unidos-al-fondo-40636-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/firefly-una-orden-ejecutiva-sobre-una-mesa-con-una-bandera-de-estados-unidos-al-fondo-40636-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/firefly-una-orden-ejecutiva-sobre-una-mesa-con-una-bandera-de-estados-unidos-al-fondo-40636-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/firefly-una-orden-ejecutiva-sobre-una-mesa-con-una-bandera-de-estados-unidos-al-fondo-40636-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/firefly-una-orden-ejecutiva-sobre-una-mesa-con-una-bandera-de-estados-unidos-al-fondo-40636-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/firefly-una-orden-ejecutiva-sobre-una-mesa-con-una-bandera-de-estados-unidos-al-fondo-40636-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/firefly-una-orden-ejecutiva-sobre-una-mesa-con-una-bandera-de-estados-unidos-al-fondo-40636-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />United States president Joe Biden has issued an executive order to establish new rules and standards that artificial intelligence (AI) companies will have to follow to secure the leadership of America in the field. The executive order also ostensibly seeks to protect the privacy of citizens and examine the effects that AI tools will have [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-31T14:10:51.000Z",
    "title": "Ergo team accuses CoinMarketCap of extortion",
    "url": "https://crypto.news/ergo-team-accuses-coinmarketcap-of-extortion/",
    "description": "Cryptocurrency data aggregator CoinMarketCap requires money to make changes about an asset on its website."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-31T14:00:39.000Z",
    "title": "Trader Who Bought Dogecoin In 2017 Maps Out Meteoric 37500% Rise To $26",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-meteoric-37500-26/",
    "description": "Dogecoin still boasts one of the most active following of any cryptocurrency and the community’s involvement has been one of the most bullish use cases for it. One community member, who bought the meme coin over five years ago, has come forward to explain why they still hold the coin with expectations for where the DOGE price is headed. Dogecoin Price Rise To $26 The trader first posted a chart to TradingView in September outlining why they believe that the Dogecoin price would see such a meteoric rise. According to the trader who goes by John Burr, he had been holding the altcoin for a long time after initially getting into it in 2017. Related Reading: Solo Bitcoin Miner Snags $200,000 Block Reward, How Did They Do It? Going forward, the trader had seen the meteoric rise of Dogecoin through 2017 and 2018, and then again through 2021, sitting on a profitable bag since then. However, the trader is convinced that there is more to come as he says, “I am waiting the bullish wave again.” The chart shared by Burr starts out at the $0.0615 level and then shows a similar bounce to the 2020-2021 rally. This bounce in the chart puts the DOGE price at an initial price target of $0.7, effectively returning it back to its previous all-time high levels. However, it doesn’t end there because another bounce takes place to take DOGE all the way to the $27 mark. Source: Tradingview.com In total, the cumulation of the rally would see Dogecoin rally more than 37,500% to reach this level. This could easily rival the 2021 price jump and mark two mega pumps in the history of the coin. Explaining his reasoning, the trader said: When I have a conversation about securities with my buddies, the conversation typically involves action-forcing events that trigger pumps and dumps. All of this is noise because we are talking about what happens on a daily interval. When I zoom out, none of the bear arguments matter, valid or not. Explaining The Pattern Behind The Rally The trader points to an M pattern in the chart that backs up this forecast. This has appeared before when the price starts to rise before falling back down. But then as the trader points out, the altcoin goes on to form a W pattern which cements the bull rally. Related Reading: 19,197 BTC Makes Its Way Out Of Binance, Trigger For Bitcoin Recovery? One thing that was missing from this analysis, however, is what the trader referred to as “THE DIP”. Apparently, this is a dip in DOGE price that comes once the W pattern forms. At the time, Burr was unsure if this dip had happened, saying, “I can&#8217;t tell if we have experienced that Dip recently or if there is a big Dip coming soon. Whichever the case, I see the next bullish wave coming. And I am not going to get shaken out if the Dip does come.” However, on October 31, Burr updated his analysis to include a confirmation of the dip. “I am now comfortable to say that &#8220;THE DIP&#8221; has passed. I expect generally sideway action until December 2023,” the trader said. “Then I expect the bull run to last throughout the year until December of 2024.” DOGE price settles at $0.07 &#124; Source: DOGEUSD On Tradingview.com Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-31T13:57:00.000Z",
    "title": "NFTs Are Hinged on Spectacle and Buzz With No Depth: Expert Opinion",
    "url": "https://coinedition.com/nfts-are-hinged-on-spectacle-and-buzz-with-no-depth-expert-opinion/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/NFT-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/NFT-4.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/NFT-4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/NFT-4-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/NFT-4-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/NFT-4-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Marrione Manalo, a comic book illustrator and metaverse creative director, believes the NFT industry is going through a metamorphosis that is proving to be a painful process. In a chat with Coin Edition, Manalo noted that the process would be worth it only if the industry achieved its original goal. According to the metaverse expert, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/nfts-are-hinged-on-spectacle-and-buzz-with-no-depth-expert-opinion/\">NFTs Are Hinged on Spectacle and Buzz With No Depth: Expert Opinion</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-10-31T13:44:17.000Z",
    "title": "15 Years of Bitcoin: From Savings Saviour to Global Economic Game Changer ",
    "url": "https://blog.bitfinex.com/announcements/15-years-of-bitcoin-from-savings-saviour-to-global-economic-game-changer/",
    "description": "<p>On this historic day, we celebrate the 15th anniversary of Bitcoin, the first cryptocurrency and a revolutionary technology that has reshaped our understanding of money and financial systems.  Created by the enigmatic Satoshi Nakamoto, Bitcoin has not only provided an alternative means of storing value...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/announcements/15-years-of-bitcoin-from-savings-saviour-to-global-economic-game-changer/\">15 Years of Bitcoin: From Savings Saviour to Global Economic Game Changer </a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]