[
  {
    "source": "NewsBTC",
    "date": "2024-01-16T00:00:10.000Z",
    "title": "By The Numbers: How Many Altcoins Died In The Past 10 Years, Report Shows",
    "url": "https://www.newsbtc.com/altcoin/by-the-numbers-how-many-altcoins-died-in-the-past-10-years-report-shows/",
    "description": "CoinGecko’s most recent report details the failure rate of cryptocurrencies in the last 10 years. Exhibiting the increasing number of &#8220;dead&#8221; altcoins over the years as projects deactivate, rebrand, lose trading activity, or are revealed to be scams. Related Reading: These Altcoins Are Showing Most Bullish &#38; Bearish Divergences: Santiment An 11.01% Failure Rate For The Altcoin Sector The first half of the ten-year period that CoinGecko studied showed 1,546 dead cryptocurrencies, 11.01%% of the total amount. 2014 saw the death of 37 cryptocurrencies, 2015 had a lower number with only 27, and 2016 closed this period with 32 dead coins. The 2014-2016 period saw the death of 96 cryptocurrencies in three years, accounting for less than 1% of the total of altcoins that have died over the last decade, as seen in the chart below. During the 2017-2018 Bull run, Almost 1,500 of the launched projects have since shut down, as CoinGecko explained: In comparison, 1,450 projects launched during the 2017 &#8211; 2018 bull run have since shut down. This is on the back of over 3,000 cryptocurrencies listed, resulting in a similar failure rate of ~70%. An Increase In Failed Projects Over The Last Five Years The report shows that over 88% of the failed cryptocurrencies come from the second half of the period analyzed. Just 2019 increased 2018 year&#8217;s number by 50, reaching 1,150 failed cryptocurrencies and closely matching the total number of dead coins of the previous half. However, most dead cryptocurrencies came from the 2020-2021 bull run. “Over 11,000 cryptocurrencies were listed on CoinGecko during the previous bull run, with ~70% having shut down since,” they detailed. 7,530 cryptocurrencies from launched projects during 2020-2021 have failed, accounting for 53,6% of all dead coins alone. 2021 is when cryptocurrencies suffered the most, with 5,724 dead coins—resulting in the worst year for projects launched, with over 70% of the cryptocurrencies listed having died as of January 2024. The report attributes the high number of failures over 2020-2021 to the “ease of deploying tokens and the rise in popularity of meme coins.” They noted that many memecoin projects launch without a product, and most are “abandoned over a short period of time.” In 2022, the number of failed projects declined from the previous year, with 3,520 dying. A 60% rate out of the total listed cryptocurrencies. Related Reading: Renowned Crypto Analyst Predicts The Top 5 Altcoins For 2024 Ultimately, the number of failed projects declined further in 2023, as only 289 cryptocurrencies, out of the over 4,000 listed on CoinGecko, died. This represents a failure rate of &#60;10%. However, although the number of dead cryptocurrencies declined in the last two years, perhaps suggesting a more positive trend, the precise percentage of failed projects launched in 2023 stood at 289. It remains to be seen if the trend will be sustained over the coming months or if the rise of a new bull phase will push the nascent sector back into a spike in altcoin failures. ETH is trading at $2,546.22 in the daily chart. Source: ETHUSDT on tradingview.com Featured image from Unsplash.com, chart from TradingView.com"
  }
]