[
  {
    "source": "CoinDesk",
    "date": "2023-07-25T11:50:54.000Z",
    "title": "Worldcoin Token Slumps Amid Crypto Community Unease",
    "url": "https://www.coindesk.com/business/2023/07/25/worldcoin-token-slumps-amid-crypto-community-unease/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Concerns around privacy, security and reported connections to Sam Bankman-Fried and Three Arrows Capital have raised eyebrows in the crypto community."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-25T11:52:24.000Z",
    "title": "Additional $37M discovered in web3 casino payment provider hack",
    "url": "https://cryptoslate.com/additional-37m-discovered-in-web3-casino-payment-provider-hack/",
    "description": "<p>Alphapo, a cryptocurrency payment service provider, reportedly suffered a significant security breach within its hot wallet, resulting in a loss of over $60 million, with some reports suggesting total losses could amount to around $100 million, according to De.Fi, the web3 antivirus company. The original hack was discovered on July 23 by blockchain investigator, ZachXBT, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/additional-37m-discovered-in-web3-casino-payment-provider-hack/\">Additional $37M discovered in web3 casino payment provider hack</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-25T11:45:00.000Z",
    "title": "Binance Executives Seek Dismissal of CFTC Complaint",
    "url": "https://cryptodaily.co.uk/2023/07/binance-executives-seek-dismissal-of-cftc-complaint",
    "description": "<p>Changpeng Zhao and other defendants associated with the Binance crypto exchange plan to appeal to the court to dismiss a lawsuit from the United States commodities regulator.</p>\nBinance&rsquo;s Appeal To Dismiss\n<p>Binance CEO Changpeng Zhao (CZ) and its former Chief Compliance Officer Samuel Lim have revealed that they will be filing motions with the court seeking permission to dismiss a prior complaint by the Commodity Futures Trading Commission (CFTC).&nbsp;</p>\n<p>In the July 24 filing to the Illinois District Court, the defendants, which consist of multiple entities from the Binance ecosystem, have claimed that they will be filing two separate motions to counter the CFTC&rsquo;s complaint and appeal for its dismissal.&nbsp;</p>\n<p>The CFTC's lawsuit against Binance was filed on March 27, 2023, and the defendants are required to respond latest by July 27, 2023. In its latest filing, the Foreign Binance Entities, which includes CZ, has revealed intentions to file a joint Motion to Dismiss, while Samuel Lim plans to file a separate motion and incorporate parts of the motion filed by the other defendants.</p>\nBinance Seeks To Exceed Page Limit Rule\n<p>The defendants are also seeking to exceed the 15-page limit rule on the brief as they claim that they made every effort to adhere to this limit but contend that due to the intricacy of the CFTC's complaint and the multiple arguments they wish to present, their Memoranda of Law is likely to surpass the given page restriction.</p>\n<p>The filing reads,</p>\n\n<p>&ldquo;Given the complexity of the CFTC&rsquo;s Complaint and the number of arguments Defendants anticipate making in support of their Motions to Dismiss, Defendants anticipate that their Memoranda of Law in support of the two motions will exceed the fifteen-page limits.&rdquo;</p>\n\n<p>In their motion, the defendants requested the court's permission to collectively use up to 50 pages for both Memoranda of Law. This proposed limit is 25 pages less than what the defendants would be entitled to under Local Rule 7.1 if each of them separately moved to dismiss the CFTC's complaint.&nbsp;</p>\nCFTC&rsquo;s Complaint\n<p>Notably, the CFTC has agreed not to oppose this request, as confirmed by discussions between both parties' counsels. While the court has yet to issue a ruling on their motion, the cooperation from the CFTC's counsel indicates a willingness to accommodate the defendants' request.</p>\n<p>The regulatory body had accused Binance and Zhao of violating derivatives regulations and engaging in unregistered trading activities in the United States. The complaint alleged that Binance had strategically expanded its US presence despite publicly claiming to block or restrict access for US customers. CZ responded to the lawsuit, expressing surprise and disappointment, stating that it had been actively cooperating with the agency for over two years.</p>\n<p>As the July 27 deadline for the response approaches, market participants are keenly observing the developments in this case, as its outcome may have significant implications for the cryptocurrency industry.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T12:09:11.000Z",
    "title": "BlackCat hackers target Italian asset manager Azimut in cyber assault",
    "url": "https://www.cryptopolitan.com/blackcat-hackers-target-italian-asset-manager-azimut-in-cyber-assault/",
    "description": "Italian investment firm Azimut successfully thwarted a malicious cyberattack orchestrated by the notorious ransomware group BlackCat. The attack, which occurred on July 21, marked yet another addition to the hacker group&#8217;s extensive list of 477 victims, which includes the state-owned Italian energy services provider GSE. Azimut shielded its customers from harm, as the hack failed ... <a title=\"BlackCat hackers target Italian asset manager Azimut in cyber assault\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blackcat-hackers-target-italian-asset-manager-azimut-in-cyber-assault/\" aria-label=\"More on BlackCat hackers target Italian asset manager Azimut in cyber assault\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T12:05:16.000Z",
    "title": "Lado Okhotnikov presents Meta Force — Revolutionary Income Scheme",
    "url": "https://www.cryptopolitan.com/lado-okhotnikov-presents-meta-force-revolutionary-income-scheme/",
    "description": "Meta Force by Lado Okhotnikov: Revolutionary Financial Anti-Pyramid or a New Level of Manipulation? Do you want to be rich? We are sure, you do, it’s a natural desire. Do you want to be independent and start some business? If so, it is commendable. Do you have money for initial investment? We’re 99% certain that ... <a title=\"Lado Okhotnikov presents Meta Force — Revolutionary Income Scheme\" class=\"read-more\" href=\"https://www.cryptopolitan.com/lado-okhotnikov-presents-meta-force-revolutionary-income-scheme/\" aria-label=\"More on Lado Okhotnikov presents Meta Force — Revolutionary Income Scheme\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T11:51:16.000Z",
    "title": "Catch the Wave: Uwerx (WERX) Presale Takes 2023 by Storm. Can it Surpass Binance Coin (BNB) and Liquity (LQTY)?",
    "url": "https://www.cryptopolitan.com/catch-the-wave-uwerx-werx-presale-takes-2023-by-storm-can-it-surpass-binance-coin-bnb-and-liquity-lqty/",
    "description": "Embark on an exhilarating journey into the world of cryptocurrency as we unveil the captivating rise of Uwerx in 2023. With its presale surging in popularity and gaining momentum, Uwerx has become the talk of the town in the crypto community.&#160; In this article, we dive deep into the latest developments, innovative features, and groundbreaking ... <a title=\"Catch the Wave: Uwerx (WERX) Presale Takes 2023 by Storm. Can it Surpass Binance Coin (BNB) and Liquity (LQTY)?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/catch-the-wave-uwerx-werx-presale-takes-2023-by-storm-can-it-surpass-binance-coin-bnb-and-liquity-lqty/\" aria-label=\"More on Catch the Wave: Uwerx (WERX) Presale Takes 2023 by Storm. Can it Surpass Binance Coin (BNB) and Liquity (LQTY)?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-25T12:03:04.000Z",
    "title": "Crypto Twitter marks Worldcoin as ‘evil’ project",
    "url": "https://crypto.news/crypto-twitter-marks-worldcoin-as-evil-project/",
    "description": "The iris-scanning digital currency project, Worldcoin (WLD), co-developed by OpenAI’s Sam Altman, has risen concerts right after its launch on July 24. Worldcoin was initially developed in 2019, offering third-world population 25 WLD for scanning their iris, which has risen&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T11:52:32.000Z",
    "title": "Pepe Coin (PEPE) Holders Are Amassing A Hot New Memecoin for Better Gains.",
    "url": "https://www.crypto-news-flash.com/pepe-coin-pepe-holders-are-amassing-a-hot-new-memecoin-for-better-gains/?utm_source=rss&utm_medium=rss&utm_campaign=pepe-coin-pepe-holders-are-amassing-a-hot-new-memecoin-for-better-gains",
    "description": "<img width=\"512\" height=\"286\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T123427.063.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T123427.063.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-25T123427.063-300x168.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />There is a peculiar habit common to investors: They diversify their portfolios with new cryptocurrencies in search of lucrative gains. This habit hasn’t escaped the attention of Pepecoin holders, a vibrant community of meme enthusiasts who are always on the lookout for promising opportunities. Pepecoin (PEPE), rooted in the widely recognized Pepe the Frog meme, [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-25T11:45:01.000Z",
    "title": "Benjamin Cowen Issues Cardano Warning, Says ADA Repeating Hard Times of 2019",
    "url": "https://dailyhodl.com/2023/07/25/benjamin-cowen-issues-cardano-warning-says-ada-repeating-hard-times-of-2019/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Cowen-Issues-Cardano-Warning.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Cowen-Issues-Cardano-Warning.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Cowen-Issues-Cardano-Warning.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Cowen-Issues-Cardano-Warning.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Cowen-Issues-Cardano-Warning.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Cowen-Issues-Cardano-Warning.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Cowen-Issues-Cardano-Warning.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Widely followed crypto analyst Benjamin Cowen is warning that the Ethereum (ETH) rival Cardano (ADA) is repeating a 2019 downward pattern. In a new strategy session, Cowen argues that Cardano has yet to find a bottom by comparing its 2023 price action to its market structure in the second half of 2019 when ADA kept [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/25/benjamin-cowen-issues-cardano-warning-says-ada-repeating-hard-times-of-2019/\">Benjamin Cowen Issues Cardano Warning, Says ADA Repeating Hard Times of 2019</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]