[
  {
    "source": "Decrypt",
    "date": "2023-07-10T18:17:36.000Z",
    "title": "Staked Ethereum Now Accounts for 20% of the Total Supply",
    "url": "https://decrypt.co/147968/staked-ethereum-now-accounts-for-20-of-the-total-supply",
    "description": "The amount of Ethereum pledged to secure the network has grown significantly since withdrawals were enabled in April."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-10T18:20:17.000Z",
    "title": "US lawmakers call on DOJ, SEC to investigate Prometheum, citing suspicions of “false testimony” and securities law violations",
    "url": "https://cryptoslate.com/us-lawmakers-call-on-doj-sec-to-investigate-prometheum-citing-suspicions-of-false-testimony-and-securities-law-violations/",
    "description": "<p>U.S. Senator Tommy Tuberville of Alabama and Congressman Blaine Luetkemeyer are calling on Attorney General Merrick Garland and the Securities and Exchange Commission (SEC) Chair Gary Gensler to investigate Prometheum, Inc. amid allegations of false testimony to Congress and potential violations of U.S. securities laws. In a letter dated July 10, 2023, Tuberville and Luetkemeyer [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/us-lawmakers-call-on-doj-sec-to-investigate-prometheum-citing-suspicions-of-false-testimony-and-securities-law-violations/\">US lawmakers call on DOJ, SEC to investigate Prometheum, citing suspicions of &#8220;false testimony&#8221; and securities law violations</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-10T18:29:17.000Z",
    "title": "Crypto.com Turns Up the Heat With No Lock-Up Proof-of-Stake on App",
    "url": "https://cryptobriefing.com/crypto-com-offers-staking-on-app/?utm_source=feed&utm_medium=rss",
    "description": "Crypto.com, a crypto exchange with over 80 million global users, is now offering on-chain staking on its app, according to a recent press release. This feature enables users to take..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-10T18:30:00.000Z",
    "title": "Uwerx (WERX) Keeps Breaking New Heights As Stellar (XLM) And Stacks (STX) Rally",
    "url": "https://cryptodaily.co.uk/2023/07/uwerx-werx-keeps-breaking-new-heights-as-stellar-xlm-and-stacks-stx-rally",
    "description": "<p class=\"s5\">Despite the promise of a bullish season, the crypto market has persisted with a bearish trend, causing many tokens to experience huge reductions in their total market capitalizations. Hence, tokens like Stellar (XLM) and Stacks (STX) struggle to stay in the game.</p>\n<p class=\"s5\">Uwerx has breezed through many successful presale stages, rapidly selling out and reaching new heights daily.</p>\nStacks (STX) Launches Stacks 2.1\n<p class=\"s5\">Stacks (STX) aims to create a more secure, decentralized internet owned by users. The Layer-2 blockchain provides a scalable infrastructure for building decentralized applications (dApps) and performing decentralized finance (DeFi) transactions on the Bitcoin (BTC) blockchain.</p>\n<p class=\"s5\">The Stacks (STX) platform improves the base protocol by introducing smart contract functionality for Bitcoin (BTC) users. Furthermore, it enables users to create and trade valuable non-fungible tokens (NFTs) on popular digital marketplaces.</p>\n<p class=\"s5\">Moreover, Stacks (STX) also provides the underbanked access to vital financial services, like micropayments and loans, without interference from governments or other intermediaries.</p>\n<p class=\"s5\">The blockchain recently released a significant upgrade in March 2023. Stacks (STX) launched the Stacks 2.1 upgrade to improve the speed and volume of DeFi transactions. The launch caused the STX token's price to surge 14% in less than 24hrs, reaching $1.27.</p>\n<p class=\"s5\">However, the token has steadily declined since March after reaching more than $1.5. STX stayed at $0.9 since April but has now fallen even more, trading at $0.6 currently.</p>\nStellar (XLM) Partners With Anchain.ai\n<p class=\"s5\">Stellar (XLM) is a decentralized payment system based on the Stellar Consensus Protocol. The blockchain enables the exchange of traditional crypto coins and fiat money across international borders.</p>\n<p class=\"s5\">Furthermore, Stellar (XLM) recently partnered with an AI-powered security company, Anchain.ai. This integration is aimed at enhancing cross-border payment security. Stellar (XLM) seeks to provide more accessible security tools to create a secure developer ecosystem.</p>\n<p class=\"s5\">The XLM token has been on a constant decline since March after it reached $0.13. The coin took a significant fall to settle at $0.7 in April.</p>\n<p class=\"s5\">Stellar (XLM) is experiencing a decline in Q2 2023, making only very minuscule backward and forward leaps. The XLM token has been stuck in the $0.8 range since last week. Holders are looking wide-eyed for appreciation, while investors are watching and wondering if now would be an excellent time to get in the game.</p>\n<p class=\"s5\">However, experts are predicting an exaggerated dip, even with the steadiness of the token.</p>\nUwerx (WERX) Presale Is Breaking New Heights\n<p class=\"s5\">This new crypto project focuses on the freelancer economy. With freelancing becoming widely adopted, even by big companies like Google, the project is on the right track. The project has undergone vetting and auditing by SolidProof and InterFi Network to ensure transparency.</p>\n<p class=\"s5\">Uwerx aims to provide a secure, fast, and accessible platform for freelancers and their clients. Uwerx charges a low transaction fee of 1%, while other freelancing platforms, such as Upwork and Fiverr, charge 10%-20%.</p>\n<p class=\"s5\">The project is in its fifth funding stage and has a 72.5 million token allocation, with WERX priced at $0.0315 per token. The total presale token allocation increased to 57% from 45%, creating more opportunities for early supporters. The hard cap presale will occur on 31st July 2023.</p>\n<p class=\"s5\">Uwerx recently announced preparations to transition to the Beta version to enable users to start testing. The Alpha version of the platform was launched last week. The launch came with Landing Page and Sign-Up Page. However, the platform has been recently updated with more pages, including the Login, Forgot Password, Freelancer or Client Initiation, Job Creation Process, My Activity, and Initial Step of Job Creation and Initial Step Of Finding Talent pages. Users can also send helpful feedback to Uwerx through an email, feedback@uwerx.network.</p>\n<p class=\"s5\">Uwerx provides a Uwerx Vault to help secure users' tokens. Users can store their tokens for a specified time and earn rewards using the Vault.</p>\n<p class=\"s5\">Moreover, the team has locked the developer's liquidity, which was set for 25 years after the presale. The lock happened after 82.8% of the community voted on an instant lock. Also, 92.8% of the community voted for a test airdrop to enable users to validate their wallet addresses.</p>\n<p class=\"s5\">The project has an excellent presale run, and with that, the developers have reduced the token allocation from 8% to 7%, increasing investor confidence in the project.</p>\n<p class=\"s5\">The Uwerx developers utilized an agile methodology approach to achieve presale success. The approach uses rapid development and accelerated deployment through feedback.</p>\n<p class=\"s5\">Stellar (XLM) and Stacks (STX) give holders much anxiety with their current standings as the tokens seem to be rolling downhill.</p>\n<p class=\"s5\">Fortunately, Uwerx is pushing a very successful presale run. Uwerx presents better features and investment potential and has shown a clean record to investors with a successful presale and increased value of the WERX token.Take advantage of Uwerx's current discounted price of $0.047725 with a purchase bonus of 15%. However, be aware that the price will rise to $0.05245 by today (Monday 10th) at 18:00 UTC. It is recommended to act quickly and make your WERX token purchase today.</p>\nFollow the links below to enjoy the 15% bonus:\n<p class=\"s5\">Website: https://www.uwerx.network</p>\n<p class=\"s5\">Presale: invest.uwerx.network</p>\n<p class=\"s5\">Telegram: https://t.me/uwerx_network &nbsp;</p>\n<p class=\"s5\">Twitter: https://twitter.com/uwerx_network</p>\n<p class=\"s5\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T18:34:38.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 While the crypto market navigated the fallout from the&#160;collapse&#160;of FTX in late 2022, Ava Labs says it dodged the bullet. Ava Labs founder and CEO Emin Gün Sirer assure its stakeholders that FTX impacts very little the companies and projects operating in the Avalanche ecosystem. The company had an account on ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T18:25:05.000Z",
    "title": "EU’s MiCA law threatens to kill stablecoin use-Lawyers",
    "url": "https://www.cryptopolitan.com/eus-mica-law-threatens-to-kill-stablecoin/",
    "description": "The European Union&#8217;s Markets in Crypto-Assets (MiCA) legislation, signed into law on May 31, 2023, has received mixed reactions from the crypto industry. While the legislation is seen as a positive step in providing regulatory guidance for cryptocurrencies, there is controversy surrounding one particular measure—the introduction of a daily transaction cap of €200 million for ... <a title=\"EU’s MiCA law threatens to kill stablecoin use-Lawyers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eus-mica-law-threatens-to-kill-stablecoin/\" aria-label=\"More on EU’s MiCA law threatens to kill stablecoin use-Lawyers\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T18:23:29.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T18:16:21.000Z",
    "title": "Grayscale BTC Trust discount hits historical lows since May 2022",
    "url": "https://www.cryptopolitan.com/grayscales-gbtc-discount-hits-may-2022-lows/",
    "description": "In the wake of asset manager BlackRock&#8217;s (BLK) application to launch a spot bitcoin ETF in the United States, the discount to the Grayscale Bitcoin Trust&#8217;s (GBTC) net asset value (NAV) continues to narrow. Concurrently, Grayscale has filed a letter in its litigation against the United States Securities and Exchange Commission (SEC) regarding the rejection ... <a title=\"Grayscale BTC Trust discount hits historical lows since May 2022\" class=\"read-more\" href=\"https://www.cryptopolitan.com/grayscales-gbtc-discount-hits-may-2022-lows/\" aria-label=\"More on Grayscale BTC Trust discount hits historical lows since May 2022\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T18:14:59.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-10T18:18:14.000Z",
    "title": "Crypto investigator ZachXBT alleges YouTube influencer Blue stole $1.5m through scams",
    "url": "https://crypto.news/crypto-investigator-zachxbt-alleges-youtube-influencer-blue-stole-1-5m-through-scams/",
    "description": "Cryptocurrency detective ZachXBT detailed alleged cryptocurrency fraud activities conducted by a popular YouTube personality, known as Blue or Jack, potentially amounting to over $1.5 million in stolen funds. Cryptocurrency investigator ZachXBT has published evidence alleging a YouTube influencer named Blue,&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-10T18:33:36.000Z",
    "title": "Cardano’s Hydra Pay: A Decentralized Payment Revolution with 1M TPS and Web3.0 Compatibility",
    "url": "https://www.crypto-news-flash.com/cardanos-hydra-pay-a-decentralized-payment-revolution-with-1m-tps-and-web3-0-compatibility/?utm_source=rss&utm_medium=rss&utm_campaign=cardanos-hydra-pay-a-decentralized-payment-revolution-with-1m-tps-and-web3-0-compatibility",
    "description": "<img width=\"1000\" height=\"563\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/pedrosek-Cardano.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/pedrosek-Cardano.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/pedrosek-Cardano-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/pedrosek-Cardano-768x432.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The Cardano community might soon be welcoming a new payment service. Dubbed the Hydra Pay, the solution is bound to model the throughput of the Hydra Head scaling solution. Cardano (ADA) developers are actively working on the launch of a new decentralized payment system dubbed Cardano Hydra Pay. Per a Twitter update by the popular [...]"
  }
]