[
  {
    "source": "CoinDesk",
    "date": "2023-07-19T12:30:00.000Z",
    "title": "Latin American Crypto Firm Bitso Joins Stellar Network to Boost International USDC Payments",
    "url": "https://www.coindesk.com/business/2023/07/19/latin-american-crypto-firm-bitso-joins-stellar-network-to-boost-international-usdc-payments/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Companies from all over the world will be able to make transactions to Argentina, Colombia and Mexico."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-19T12:11:43.000Z",
    "title": "Polygon Mulls Governance Restructure in Polygon 2.0 Roadmap",
    "url": "https://www.coindesk.com/tech/2023/07/19/polygon-mulls-governance-restructure-in-polygon-20-roadmap/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Developers have proposed an “Ecosystem Council” to push smart contract upgrades, as well as changes to how community-based funding works."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-19T12:20:00.000Z",
    "title": "What is extended reality (XR), explained",
    "url": "https://cointelegraph.com/explained/what-is-extended-reality-xr-explained",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/118724d67779a367f65819b7fad53e67.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Extended reality refers to the combination of virtual reality, augmented reality and mixed reality technologies.</p>\n                    <p><h2>Is the metaverse a type of extended reality?</h2><p></p><p><em>XR and the idea of the metaverse are closely connected, albeit not necessarily the same thing.</em></p><p>XR includes the blending of digital and physical settings to produce engaging experiences. The metaverse, on the other hand, is a virtual universe or interconnected network of virtual and augmented realities. It transcends the limitations of XR technology and spans a vast digital space where users can engage with a range of virtual communities and experiences.</p><p>User-generated content, social interactions, persistent online places and economic mechanisms define the metaverse. It seeks to deliver an experience that transcends particular XR technology and is shared, immersive and collaborative.</p><p>The metaverse concept goes beyond XR and encompasses a broader vision of a fully realized virtual universe with its own economy, social dynamics, and opportunities for user participation and creativity. While XR contributes to realizing the metaverse by providing the foundational technologies for <a href=\"https://cointelegraph.com/explained/the-key-technologies-that-power-the-metaverse\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/the-key-technologies-that-power-the-metaverse/amp\">virtual and augmented experiences</a>, the metaverse concept extends beyond XR.</p><h2>Challenges associated with extended reality</h2><p></p><p>Extended reality faces challenges such as technical limitations, user comfort, content development, interoperability and privacy considerations.</p><p>The technical constraints related to providing high-quality XR experiences are one major challenge. Powerful hardware and software requirements for XR systems make them expensive and may prevent their general adoption, especially for people or organizations with low funding. </p><p>Additionally, certain users may have pain and sensory problems from XR’s immersive nature, such as motion sickness, eye strain or confusion. For broader acceptance and adoption, it is essential to guarantee user comfort and safety during prolonged XR sessions.</p><p>The requirement for content development and creation presents another difficulty. Specialized material catered to the particular technology and platform is needed for XR experiences. It can take a lot of time and resources to create high-quality XR content, necessitating knowledge of 3D modeling, animation and interactive design. It’s still difficult to find diverse and interesting XR content for use in many fields and contexts.</p><p>Standardization and interoperability present additional difficulties. XR includes several platforms, technologies and devices, each with unique needs for interoperability. Cross-platform experiences and flawless interoperability between various XR systems can be difficult to enable, which hinders integration and broad adoption.</p><p>In XR, privacy and ethical issues are also significant challenges. Data privacy, security, and user consent concerns must be addressed since XR experiences entail collecting and analyzing user data. Using XR in delicate contexts like healthcare, education, or the workplace also raises ethical questions that call for careful consideration of data ownership, consent and responsible use.</p><h2>Benefits of extended reality</h2><p></p><p><em>XR offers benefits such as enhanced immersion, improved learning, efficient visualization, remote collaboration and increased accessibility.</em></p><p><a href=\"https://cointelegraph.com/app/public/index.php/news/extended-reality-to-create-thousands-of-jobs-by-2025-eu-commission/amp\">XR offers improved immersion</a>, enabling users to lose themselves entirely in virtual settings. This immersive environment creates more realistic training simulations, interesting educational materials and engaging entertainment experiences.</p><p>By facilitating direct interaction and hands-on learning, XR improves learning and memory. Users can interact with virtual objects, visualize difficult concepts, and participate in interactive scenarios, improving information retention and comprehension.</p><p>XR has important applications in manufacturing, architecture and healthcare industries, enabling collaborative design reviews, realistic visualizations and virtual prototyping. This results in better decision-making, greater effectiveness and lower costs.</p><p>Additionally, by facilitating virtual meetings and sharing virtual spaces regardless of physical locations, XR supports distant collaboration. This boosts output, reduces travel costs and encourages international cooperation.</p><p>Moreover, by generating inclusive experiences for those with disabilities, XR has the potential to increase accessibility. It can offer various communication methods, flexible user interfaces and sensory stimulation.</p><h2>XR vs. AR vs. VR vs. MR: What’s the difference?</h2><p></p><p><em>XR, AR, VR, and MR are different technologies that alter our perception of reality, with XR being the umbrella term encompassing AR, VR and MR.</em></p><p>The below table summarizes the differences between XR, VR, AR and MR:</p><p><img alt=\"\" src=\"https://s3.cointelegraph.com/storage/uploads/view/f7f94a807e393a79121201c4e3a5bb3c.png\"></p><h2>How extended reality works</h2><p></p><p><em>XR works by constructing immersive experiences that combine real-world and virtual components. The specific workings of XR depend on the technology being used, whether it’s VR, AR or MR.</em></p><p>Here’s how these technologies work:</p><h3>Virtual reality</h3><p>VR technology produces immersive experiences by replacing the user’s surroundings with virtual ones. Users <a href=\"https://cointelegraph.com/news/apple-vision-pro-mixed-reality-redefine-experiences-metaverse\">put on a VR headset</a> that has sensors integrated into it to track their head movements. The headset shows stereo 3D images that give the user a sensation of depth and immersion. </p><p>The realistic experience is further improved by the spatial audio provided by built-in headphones or speakers. Users use handheld controllers to interact with the virtual environment, and the system tracks these controllers to map the users’ positions and motions.</p><h3>Augmented reality</h3><p>Incorporating virtual features in real-world environments is known as AR, which improves a user’s perception of and engagement with their surroundings. Smartphones, tablets and <a href=\"https://cointelegraph.com/news/augmented-reality-helps-brands-tell-their-story-mvfw-2023\">special AR glasses</a> can deliver AR experiences. The device’s camera records the surroundings, while gyroscopes and accelerometers monitor its orientation and location. </p><p>AR software analyzes the camera feed, which identifies characteristics and objects in the real environment. The user’s vision is rendered and superimposed with virtual objects, text, or images on the device’s screen or through AR glasses. Touchscreens, gestures and voice commands can all be used by users to interface with the virtual components.</p><h3>Mixed reality</h3><p>Users can interact with virtual items while still being aware of and engaging with their physical environment thanks to mixed reality, which includes elements of both VR and AR. Like AR and VR systems, MR headsets are furnished with cameras, sensors and displays. </p><p>By using the cameras and sensors, the MR system maps the physical area to digitally represent the actual surroundings. After that, virtual objects are rendered and fixed in place in the user’s field of view, allowing for natural interaction and occlusion with the surrounding environment. While still viewing and engaging with the real environment, users can modify and interact with virtual items.</p><h2>An overview of extended reality</h2><p></p><p><em>Extended reality (XR) refers to technologies combining real and virtual settings to produce engaging and immersive experiences. </em></p><p>Virtual reality (VR), augmented reality (AR) and mixed reality (MR) are just a few of the technologies that <a href=\"https://cointelegraph.com/learn/augmented-reality-vs-virtual-reality-key-differences\">fall under the umbrella term of XR</a>. VR is a technology that immerses people entirely in a digital simulation, cutting them off from their surroundings. </p><p>A virtual environment is often displayed through screens or lenses while users wear a VR headset recording their head movements. Users can explore virtual surroundings, interact with objects and participate in various activities through VR experiences.</p><p>AR overlays digital information onto the real world, enhancing the user’s perception and interaction with their physical surroundings. Usually, AR is used with smartphones, tablets or AR glasses. Users can simultaneously engage with both virtual and physical aspects thanks to its ability to project virtual objects, text or images into the actual world. Numerous industries, including gaming, education, navigation and industrial training, use augmented reality applications.</p><p>MR is a hybrid form of reality integrating components of VR and AR. Users of MR systems can engage with virtual items while staying conscious of and engaging with their real-world surroundings. Wearing specialized headsets or glasses is a common requirement for MR, which enables the appearance of virtual objects and their interaction with the real world by tracking the user’s position and surroundings.</p><p><img alt=\"The spectrum of extended reality\" src=\"https://s3.cointelegraph.com/storage/uploads/view/95dd9f8d23266ff577bee7b5b5061834.png\" title=\"The spectrum of extended reality\"></p><p>XR technologies are utilized for various purposes, including recreation, <a href=\"https://cointelegraph.com/explained/what-are-web3-games-how-do-they-work\">gaming</a>, education, training simulations, online meetings and collaboration, architectural and industrial design, healthcare, and more. By creating immersive and compelling experiences beyond conventional interfaces, XR has the potential to completely transform how we engage with information, communicate, learn and experience virtual worlds.</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-19T12:10:31.000Z",
    "title": "Cronos Labs urges Crypto-AI integration for enhanced productivity",
    "url": "https://cryptoslate.com/cronos-labs-urges-crypto-ai-integration-for-enhanced-productivity/",
    "description": "<p>At the Ethereum Community Conference (EthCC) on July 19, Ken Timsit, Managing Director of Cronos Labs, delved into emerging use cases and limitations of blockchain-enabled AI. Based on research from 200+ Cronos Accelerator applicants, Timsit aimed to cut through the hype and identify high-impact applications. He organized crypto-AI innovation into three buckets: supercharging productivity, decentralized [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/cronos-labs-urges-crypto-ai-integration-for-enhanced-productivity/\">Cronos Labs urges Crypto-AI integration for enhanced productivity</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-19T12:09:41.000Z",
    "title": "Tech titans and seasonal trends: A deeper look into S&P 500 performance",
    "url": "https://cryptoslate.com/insights/tech-titans-and-seasonal-trends-a-deeper-look-into-sp-500-performance/",
    "description": "<p>Quick Take According to the global markets newsletter, the Kobessi Letter, the year-to-date performance of the S&#38;P 500 shows a striking disparity of the underlying assets behind its impressive gain of 15%. Seven tech giants &#8211; Meta (Facebook), Amazon, Apple, Microsoft, Google, Tesla, and Nvidia &#8211; are collectively up by a staggering 58%. In contrast, the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/tech-titans-and-seasonal-trends-a-deeper-look-into-sp-500-performance/\">Tech titans and seasonal trends: A deeper look into S&#038;P 500 performance</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-19T12:16:54.000Z",
    "title": "First French Crypto License Given to Societe Generale’s Crypto Branch",
    "url": "https://cryptobriefing.com/first-french-crypto-license-given-to-societe-generales-crypto-branch/?utm_source=feed&utm_medium=rss",
    "description": "Socit Gnrale&#8217;s SG Forge division earns the first-ever crypto license from the Autorit des Marchs Financiers, allowing them to conducta full range of crypto operations in France. SG Forge, now..."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-19T12:32:39.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Moves Below $30,000, Following Latest US Retail Sales Report",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-moves-below-30000-following-latest-us-retail-sales-report/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2142319699-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC Moves Below $30,000, Following Latest US Retail Sales Report\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2142319699-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2142319699-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2142319699-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2142319699-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2142319699-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2142319699-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2142319699.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin slipped below the $30,000 mark on Wednesday, as markets continued to react to the latest U.S. retail sales report. Sales rose by 0.2% last month, which is more than the 0.5% sum many had forecasted. Ethereum has remained resilient, climbing back above $1,900. Bitcoin Bitcoin (BTC) slipped below $30,000 on Wednesday, following the latest [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T12:15:51.000Z",
    "title": "AI Has Not Affected Worldwide IT Spending, $4.7 Trillion in 2023",
    "url": "https://www.cryptopolitan.com/worldwide-it-spending-no-ai-impact/",
    "description": "According to a new forecast by Gartner, worldwide IT spending is expected to reach $4.7 trillion in 2023, driven primarily by increased software and IT services expenditure. The report indicates a year-on-year increase of 4.3%, with a projection that global IT spending could grow by as much as 8.8% in 2024, reaching a total of ... <a title=\"AI Has Not Affected Worldwide IT Spending, $4.7 Trillion in 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/worldwide-it-spending-no-ai-impact/\" aria-label=\"More on AI Has Not Affected Worldwide IT Spending, $4.7 Trillion in 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T12:11:45.000Z",
    "title": "BNB auto-burn: Binance’s 24th quarterly burn eliminates $44.61 million worth of tokens",
    "url": "https://www.cryptopolitan.com/bnb-auto-burn-binances-24th-quarterly-burn-eliminates-44-61-million-worth-of-tokens/",
    "description": "Binance, one of the leading cryptocurrency exchanges, has completed its 24th quarterly burn of its native BNB coins. This strategic move was executed through the BNB Automatic Burn mechanism, aimed at reducing the overall circulating quantity of BNB tokens and increasing their potential value. The burn event witnessed the permanent destruction of 1.99 million BNB ... <a title=\"BNB auto-burn: Binance&#8217;s 24th quarterly burn eliminates $44.61 million worth of tokens\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bnb-auto-burn-binances-24th-quarterly-burn-eliminates-44-61-million-worth-of-tokens/\" aria-label=\"More on BNB auto-burn: Binance&#8217;s 24th quarterly burn eliminates $44.61 million worth of tokens\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-19T12:30:58.000Z",
    "title": "Judge Urges Ripple and SEC to Reach Settlement as XRP Price Rises 8%",
    "url": "https://www.crypto-news-flash.com/judge-urges-ripple-and-sec-to-reach-settlement-as-xrp-price-rises-8/?utm_source=rss&utm_medium=rss&utm_campaign=judge-urges-ripple-and-sec-to-reach-settlement-as-xrp-price-rises-8",
    "description": "Judge Sarah Netburn asked Ripple Labs and US SEC to settle the case as quickly as possible leading to a strong XRP Price rally. Amid the strong surge in XRP, analysts have started giving bullish price calls as high as $6. Last week, Judge Analisa Torres’ at the Southern District Court of New York announced [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-19T12:13:58.000Z",
    "title": "Why Has Fantom’s TVL Decreased So Much? – Part 1",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/why-has-fantoms-tvl-decreased-so-much-part-1/",
    "description": "<p>Multichain, previously AnySwap, is an infrastructure developed for arbitrary cross-chain interactions. It supports more than 25 chains and more than 1100 tokens. So, Multichain is an issuer of $USDC, $DAI, and $fUSDT stablecoins on the Fantom chain. And it was the only bridge available to transfer funds to/from Fantom before modern omnichain solutions such as [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/why-has-fantoms-tvl-decreased-so-much-part-1/\">Why Has Fantom’s TVL Decreased So Much? &#8211; Part 1</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]