[
  {
    "source": "NewsBTC",
    "date": "2024-01-11T02:00:22.000Z",
    "title": "Celsius Seeks Repayment: Creditors Urged To Return 27.5% Of Funds",
    "url": "https://www.newsbtc.com/news/celsius-seeks-repayment-creditors-urged-to-return-27-5-of-funds/",
    "description": "Surprisingly, bankrupt crypto lender Celsius Network customers are now facing legal action from bankruptcy managers after making substantial withdrawals within 90 days before the company&#8217;s bankruptcy declaration.  The bankruptcy managers have demanded that affected customers return some of their funds or potentially face further legal consequences. Customers Face Celsius Network&#8217;s Settlement Demands The filing, published on Tuesday, revealed that customers who withdrew over $100,000 within the specified 90-day period before July 12, 2022, find themselves at the center of the legal dispute.  These customers have been notified through an official filing outlining the procedures for settling their withdrawal preference exposure. Withdrawal preference exposure noted in the notice refers to the aggregate value of assets withdrawn by customers from the Celsius Network platform during the specified period, minus any subsequent deposits made after the first withdrawal.  Related Reading: Ethereum’s Bullish Breakout: Analysts Predict Surge To $3,500 – Here’s Why The bankruptcy managers have determined that customers with withdrawal preference exposure greater than $100,000 must settle their claims or obtain a court order ruling to avoid potential liability. The bankruptcy plan, known as the Modified Joint Chapter 11 Plan of Reorganization of Celsius Network LLC and Its Debtor Affiliates, offers an Account Holder Avoidance Action Settlement.  Under this settlement, the Debtors will release avoidance actions against account holders meeting certain criteria, including accepting the plan on all claims and providing a payment equal to 27.5% of their withdrawal preference exposure. The distribution agent is not obligated to make distributions to account holders with unresolved withdrawal preference exposure until their claims are settled, a court rules in their favor, or the withdrawal preference exposure is resolved with the litigation administrator after the plan&#8217;s effective date. Settle Now Or Face Consequences Celsius Network, in collaboration with the committee, has extended the payment deadline to allow affected customers to settle their withdrawal preference exposure and receive a release of all avoidance actions. The plan&#8217;s effective date is anticipated to occur around January 31, 2024. Customers wishing to make the settlement payment must also submit the election form by January 25, 2024. The Debtors will start accepting completed election forms on January 17, 2024. Failure to submit the form may result in the rejection of the settlement payment. It is important to note that failure to settle withdrawal preference exposure by January 31, 2024, may lead to further correspondence or actions by the litigation administrator after the plan&#8217;s effective date. Related Reading: Cardano Price Explosion: Crypto Analyst Predicts ADA Price To Hit $6 As customers grapple with the unexpected legal action, the crypto community awaits further developments in this ongoing bankruptcy case.  The Account Holder Avoidance Action Settlement outcome will shed light on resolving withdrawal preference exposure claims and the subsequent distribution of funds. Featured image from Shutterstock, chart from TradingView.com "
  }
]