[
  {
    "source": "CoinDesk",
    "date": "2024-03-07T19:00:43.000Z",
    "title": "CoinDesk Brings Consensus to Hong Kong",
    "url": "https://www.coindesk.com/business/2024/03/07/coindesk-brings-consensus-to-hong-kong/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The announcement comes as Hong Kong works to brand itself as Asia's digital assets trading hub."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-07T19:01:48.000Z",
    "title": " Montenegro High Court may extradite Do Kwon to South Korea after appeal — Report ",
    "url": "https://cointelegraph.com/news/montenegro-high-court-extradite-do-kwon-south-korea-appeal",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNWU5YzZkOTQtZTg2My00Y2Y5LWFkNmUtMmNhYzgzNmVjYzA1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The co-founder of bankrupt Terraform Labs was first set to be extradited to the United States after lengthy court battles.</p>\n                    <p><p>The High Court in Podgorica, Montenegro, has ruled that Terraform Labs co-founder and former CEO Do Kwon should be extradited to his native South Korea, rather than the United States, according to various media reports. The decision is still subject to appeal.</p><p>An appeals court <a href=\"https://cointelegraph.com/news/do-kwon-win-appeal-united-states\">overturned the High Court’s earlier decision</a> to extradite Kwon to the United States on March 5, citing “significant violations of the provisions of criminal procedure.” </p><p>South Korea filed an extradition <a href=\"https://s.wsj.net/public/resources/documents/359c8eb7-db8c-455c-8780-da78f2273790.pdf\" target=\"_blank\" rel=\"noopener nofollow\">request</a> in March 2023, which was initially refused in favor of the United States’ <a href=\"https://s.wsj.net/public/resources/documents/2f4e9823-63c3-46fd-bbd5-f40ac2ce72cf.pdf\" target=\"_blank\" rel=\"noopener nofollow\">request</a> filed two days prior. Kwon has been held in prison in Montenegro since his arrest at the Podgorica airport, where his was attempting to travel to Dubai using an allegedly fake Costa Rican passport. </p><p><a href=\"https://cointelegraph.com/news/montenegro-high-court-extradite-do-kwon-south-korea-appeal\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T19:09:09.000Z",
    "title": "Tesla’s Bitcoin holdings sparks hot purchase debate",
    "url": "https://www.cryptopolitan.com/teslas-bitcoin-holdings-purchase-debate/",
    "description": "In recent discussions within the cryptocurrency community, attention has once again turned to Tesla’s Bitcoin holdings following the integration of its Bitcoin wallet tracking feature into Arkham Intelligence’s dashboard. As of the latest data, Tesla’s wallet holds approximately 11,509 BTC, marking an increase of 1,789 BTC since its last earnings report which reported holdings of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T19:07:42.000Z",
    "title": "Cardano Price Prediction 2024-2033: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2024-2033 Cardano stands out as a project with remarkable potential beyond its role as a tradable asset. Rooted in scholarly peer-reviewed research, it has cultivated a robust community over time. Here, we delve into the essence of Cardano and offer a projection for the future value of ADA. How Much is ADA [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T18:57:58.000Z",
    "title": "Philippines launches regulatory measures against unlicensed exchanges",
    "url": "https://www.cryptopolitan.com/philippines-launches-measures-exchanges/",
    "description": "The Philippines National Telecommunications Commission (NTC) has launched an initiative to tackle cryptocurrency companies operating without the necessary licenses in the country, marking a significant move towards regulating the burgeoning cryptocurrency market. Recent reports have surfaced indicating that websites affiliated with crypto firms MiTrade and OctaFX have been blocked by one of the nation’s leading [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T18:49:03.000Z",
    "title": "Zama secures $37 million funding to revolutionize data privacy",
    "url": "https://www.cryptopolitan.com/zama-37-million-revolutionize-data-privacy/",
    "description": "Zama, a French cryptography startup, has recently secured an impressive $73 million in a Series A funding round, signaling a significant leap forward for its innovative Fully Homomorphic Encryption (FHE) technology. This substantial investment, led by Multicoin Capital and Protocol Labs, underscores the growing interest and confidence in Zama’s ambitious mission to revolutionize data privacy [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T18:47:55.000Z",
    "title": "Avalanche blockchain unveils new tool to enhance communications within its network ",
    "url": "https://www.cryptopolitan.com/avalanche-tool-enhance-within-its-network/",
    "description": "Avalanche has unveiled Teleporter, a new tool aimed at enhancing communication within its network of application-specific chains, also known as subnets.&#160; This development is targeted at mitigating ecosystem fragmentation, ensuring a more cohesive operation across Avalanche&#8217;s network. Teleporter leverages the capabilities of Avalanche Warp Messaging (AWM), which also went live today on Avalanche&#8217;s EVM-compatible network, [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-07T19:06:40.000Z",
    "title": "Nuggetrush’s new virtual world lures top crypto investors",
    "url": "https://crypto.news/nuggetrushs-new-virtual-world-lures-top-crypto-investors/",
    "description": "NuggetRush, an emerging ICO, is capturing the attention of Chainlink and The Sandbox investors with its potential for substantial returns. #partnercontent"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-07T18:56:07.000Z",
    "title": "El Salvador’s Bitcoin gamble pays off, critic Schiff silenced",
    "url": "https://crypto.news/el-salvadors-bitcoin-gamble-pays-off-critic-schiff-silenced/",
    "description": "El Salvador's bet on Bitcoin yields a 40% profit, challenging skeptics and marking a significant moment for digital currencies in national economies. Meanwhile, InQubeta introduces a platform for investing in AI. #partnercontent"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-07T18:47:48.000Z",
    "title": "Saga gaming token airdrop launches on Solana, other networks",
    "url": "https://crypto.news/saga-token-airdrop-avalanche-cosmos-solana/",
    "description": "Saga, a gaming-centric network, initiated its airdrop claim process on Wednesday, including Avalanche, Solana, Cosmos, Celestia, and Polygon."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-07T18:43:24.000Z",
    "title": "Polygon meme coin Sponge V2 soars 26%, reaching $100m cap",
    "url": "https://crypto.news/polygon-meme-coin-sponge-v2-soars-26-reaching-100m-cap/",
    "description": "Sponge V2, a meme coin on the Polygon network, has seen a 26% rise, reaching a $100 million market cap. #partnercontente"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-07T18:40:19.000Z",
    "title": "Solana-based Kamino Finance announces April token airdrop ",
    "url": "https://crypto.news/kamino-finance-solana-airdrop/",
    "description": "Kamino Finance is the latest Solana and defi project to unveil a token distribution plan based on a points system, a growing trend among cryptocurrency protocols."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-07T19:00:43.000Z",
    "title": "Crypto Analyst Uses Historical Data To Show When The Bitcoin Price Will Reach $207,000",
    "url": "https://www.newsbtc.com/news/bitcoin/crypto-analyst-bitcoin-price-207000/",
    "description": "A crypto analyst has laid out a scenario where the Bitcoin price could rise above $200,000 by June. This is based on a historical occurrence that could play out again following BTC&#8217;s recent run above its previous all-time high (ATH). How BTC Could Rise To $207,000 By June The anonymous analyst behind the prominent crypto X (formerly Twitter) account, Bitcoin Archive, alluded to the 2021 bull run when Bitcoin’s price more than tripled in just 103 days after breaking the previous cycle’s ATH. That means Bitcoin could run to $207,000 by June if history repeats itself.  Related Reading: Shiba Inu Lead Dev Co-Signs Prediction That Would Send SHIB To $100 Billion Bearing the Bitcoin Halving event in mind, Bitcoin’s price tripling by June looks feasible. Bitcoin’s price has more than tripled 90 days after previous Halving events. Considering that Bitcoin surpassed its previous ATH even before this Halving, which is set to take place in April, the flagship crypto could also achieve this exponential price surge in record time this time around.  This narrative is supported by the fact that Bitcoin’s demand continues to exceed its supply, and the supply will be further reduced when miners’ rewards are cut in half. Therefore, although ambitious, a price surge of such magnitude cannot be ruled out.  Moreover, crypto analyst MacronautBTC already calculated how Bitcoin’s price could rise to $237,000 based on the imbalance between supply and demand. BTC rising to $207,000 by June will no doubt defy expectations, with analysts like Skybridge Capital CEO Anthony Scaramucci not expecting such a price surge until next year.  Scaramuci had predicted that Bitcoin would rise to $170,000 18 months after the Halving event. Meanwhile, Tom Dunleavy, Partner and Chief Investment Officer (CIO) at MV Capital, took a conservative stance when he mentioned that Bitcoin could rise to as high as $100,000 this year.  What Next For Bitcoin? Bitcoin has cooled off following its rise to a new ATH of $69,000. As to the next move the flagship crypto could make, crypto analyst Satoshi Flipper suggested in an X post that Bitcoin could consolidate between $65,000 and $70,00 for a few weeks before breaking its ATH again.  Related Reading: Why Did Bitcoin Price Crash 10% After Reaching $69,000 All-Time High? This aligns with Alex Thorn’s (Head of Research at Galaxy Digital) analysis, where he noted that BTC could follow a similar path to December 2020. Back then, BTC touched its prior ATH of $20,000, then traded 11.3% lower for the next 15 days before going on to “definitively” break its ATH. At the time of writing, Bitcoin is trading at around $66,000, up in the last 24 hours, according to data from CoinMarketCap.  BTC price at $67,000 &#124; Source: BTCUSD on Tradingview.com Featured image from The Independent, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-07T19:05:02.000Z",
    "title": "Ethereum-Based Altcoin ‘Very Likely Going’ To Explode by Over 440%, Predicts Crypto Analyst Michaël van de Poppe",
    "url": "https://dailyhodl.com/2024/03/07/ethereum-based-altcoin-very-likely-going-to-explode-by-over-440-predicts-crypto-analyst-michael-van-de-poppe/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/12/chainlink-moving-into-2022.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/12/chainlink-moving-into-2022.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/12/chainlink-moving-into-2022.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/12/chainlink-moving-into-2022.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/12/chainlink-moving-into-2022.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/12/chainlink-moving-into-2022.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/12/chainlink-moving-into-2022.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst believes that an Ethereum (ETH)-based altcoin project is about to have an explosive rally against Bitcoin (BTC). Crypto strategist Michaël van de Poppe tells his 699,900 followers on the social media platform X that the decentralized oracle provider Chainlink (LINK) versus Bitcoin (LINK/BTC) may be printing a bullish reversal pattern. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/07/ethereum-based-altcoin-very-likely-going-to-explode-by-over-440-predicts-crypto-analyst-michael-van-de-poppe/\">Ethereum-Based Altcoin ‘Very Likely Going’ To Explode by Over 440%, Predicts Crypto Analyst Michaël van de Poppe</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]