[
  {
    "source": "CryptoGlobe",
    "date": "2024-03-07T09:47:57.000Z",
    "title": "Cardano Founder Dr. Charles Hoskinson on the Symptoms of Charles Derangement Syndrome (CDS)",
    "url": "https://www.cryptoglobe.com/latest/2024/03/cardano-founder-dr-charles-hoskinson-on-the-symptoms-of-charles-derangement-syndrome-cds/",
    "description": "Earlier today, in a post on social media platform X, formerly known as Twitter, Charles Hoskinson, the co-founder of Ethereum and founder of Cardano, shed light on a phenomenon he calls “Charles Derangement Syndrome” (CDS). Hoskinson’s 10-point list dissects the characteristics and behaviors of individuals who may be affected by this condition. “Charles Derangement Syndrome” […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-07T09:53:00.000Z",
    "title": "BlockFi To Receive $874M After Settling With FTX, Alameda Estates",
    "url": "https://cryptodaily.co.uk/2024/03/blockfi-to-receive-874m-after-settling-with-ftx-alameda-estates",
    "description": "Bankrupt crypto lender BlockFi has reached an “in principle” agreement with the estates of FTX and Alameda Research, which could see the firm receive nearly $874 billion pending judicial approval."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T09:47:41.000Z",
    "title": "African Economies at Risk of Falling Behind in the AI Revolution",
    "url": "https://www.cryptopolitan.com/african-economies-at-risk-of-falling/",
    "description": "African economies face a critical challenge in adapting to the transformative impact of artificial intelligence (AI) on business operations. Despite the global shift towards AI integration, the continent&#8217;s limited capacity for virtual storage and outdated mobile technology pose significant obstacles. Connectivity and data storage deficiencies Businesses incorporating AI into their processes require high-speed connectivity and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T09:41:45.000Z",
    "title": "Shiba Inu community anticipates ICANN approval for SHIB names",
    "url": "https://www.cryptopolitan.com/shiba-inu-community-anticipates-icann-approval-for-shib-names/",
    "description": "The Shiba Inu development team, in collaboration with D3 Global, has announced the launch of &#8220;SHIB Names,&#8221; a domain name service designed for the Shiba Inu community. This launch marks a pivotal moment for the SHIB ecosystem, offering users a unique opportunity to secure their own Shiba Inu-themed domain names. To celebrate the occasion, an [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-07T09:52:55.000Z",
    "title": "Trader loses over $674K to phishing scam",
    "url": "https://crypto.news/trader-loses-over-674k-to-phishing-scam/",
    "description": "An unidentified market participant unfortunately fell victim to a phishing scam, leading to a significant loss of over $674,000 in USDC amid the escalating prevalence of these deceptive schemes. Blockchain security platform PeckShield identified the incident in a recent post&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-07T09:50:23.000Z",
    "title": "BTC whale activity declines amid extremely greedy market conditions",
    "url": "https://crypto.news/btc-whale-activity-declines-amid-extremely-greedy-market-conditions/",
    "description": "The daily Bitcoin (BTC) whale activity has declined while the market weathers extremely greedy sentiment. According to data provided by Santiment, the number of whale transactions consisting of at least $100,000 worth of BTC declined by 17.5% in the past&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-07T09:48:25.000Z",
    "title": "Andreessen Horowitz (a16z) pauses  crypto fund expansion for AI endeavor",
    "url": "https://crypto.news/andreessen-horowitz-a16z-pauses-crypto-fund-expansion-for-ai-endeavor/",
    "description": "Andreessen Horowitz (a16z), a Silicon Valley-based venture capital firm, is recalibrating its investment strategy. The company is aiming to raise $6.9 billion for new funds with a focus on artificial intelligence (AI). This shift puts the brakes on its crypto&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-07T09:43:40.000Z",
    "title": "Las Vegas CEO faces 127 years for crypto laundering linked to cartels and charity fraud",
    "url": "https://crypto.news/las-vegas-ceo-faces-127-years-for-crypto-laundering-linked-to-cartels-and-charity-fraud/",
    "description": "The CEO of a Las Vegas Internet company could face a 127-year prison sentence following his conviction for laundering over $4 million with Bitcoin, funds connected to Mexican cartels, and a hacked charity, according to the Department of Justice. Martin&#8230;"
  }
]