[
  {
    "source": "Cointelegraph",
    "date": "2023-08-21T01:53:56.000Z",
    "title": "Friend.tech hype unsustainable? Critics give it only months to live",
    "url": "https://cointelegraph.com/news/friendtech-social-media-app-how-long-will-it-last",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/08ca45b6-cdde-4575-aad0-f5a6d2ecb6a0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Most crypto industry heavyweights have been bullish about the new decentralized social media app friend.tech, but some critics warn it's getting too hot too quickly. </p>\n                    <p><p>Friend.tech, a new decentralized social media (DeSo) app has rapidly become one of the hottest new things in crypto, with over 64,000 new users and more than 24,000 ETH in trading volume since its beta version launch of Aug. 11. </p><p>While many crypto industry heavyweights have <a href=\"https://twitter.com/TrustlessState/status/1693308971229093939\" target=\"_blank\" rel=\"noopener nofollow\">praised</a> the app for bringing thousands of people on-chain and inspiring sign-ups from even non-crypto figures — such as gaming YouTuber Faze Banks and Russian protest group Pussy Riot — some have warned it's at risk of burning out.</p><p>Built on Coinbase’s layer-2 network Base, friend.tech is a platform that allows users to purchase shares of their friends and influencers, which in turn grants them access to a private chat with that user. </p><p>Speaking to Cointelegraph, crypto commentator Yazan pointed out a number of troubling factors that led him to believe the app has between six and eight weeks before both share prices and general activity begin to nosedive.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Let me tell you one thing.<br><br>Something isn’t right about <a href=\"https://twitter.com/friendtech?ref_src=twsrc%5Etfw\">@friendtech</a>.<br><br> Creators making money from a group chat that doesn’t even work when you can’t even reply directly to people?<br><br> The way pricing works is ridiculous and can be easily taken advantage of.<br><br> Pumps and dumps. <a href=\"https://t.co/TJqcktEM6P\">pic.twitter.com/TJqcktEM6P</a></p>&mdash; Yazan (@YazanXBT) <a href=\"https://twitter.com/YazanXBT/status/1693086023058694222?ref_src=twsrc%5Etfw\">August 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Yazan argued there has been an unsustainable rate at which share prices have increased.</p><p>“The fucked up market making that guarantees that the app makes the most money along with creators — the price goes up too fast,” he said. </p><blockquote>“How come there’s 100 holders and the price is 1 ETH — 1 ETH to be able to see a private chat?”</blockquote><p>According to pseudonymous software engineer Cygaar in an Aug. 20 X thread, the price of someone's shares  on friend.tech is proportional to the square of the outstanding supply. As the supply increases, the price increases exponentially.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">It looks daunting, so let&#39;s simplify it. Let&#39;s assume that you only want to buy/sell a single share (amount = 1). This is also known as the spot price.<br><br>Using our middle school algebra skills, we can expand out the function and we&#39;ll get:<br><br>price = supply^2 / 16000</p>&mdash; cygaar (@0xCygaar) <a href=\"https://twitter.com/0xCygaar/status/1693030043314802835?ref_src=twsrc%5Etfw\">August 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Drawing parallels to BitClout — a predecessor DeSo app from 2021 — pseudonymous Web3 marketer Legendary shared his bearish <a href=\"https://twitter.com/Legendary_NFT/status/1693199945212555307\" target=\"_blank\" rel=\"noopener nofollow\">prediction</a> on the longevity of Friend.tech. </p><p>“Absolutely not. I think the platform will collapse as BitClout did. We are in a bear market, and there's nothing to do. Everyone jumps on an opportunity to make money, but I think the platform will be done within the next weeks to months,” he wrote. </p><h3>The bull case for friend.tech</h3><p>Others however, shared a far more positive outlook on the new decentralized social media platform, praising it for its novel developments in UX for crypto applications — something that crypto app developers <a href=\"https://cointelegraph.com/news/web3-crypto-user-experience-paradox-mass-adoption\">have long struggled to get right</a>.</p><p>David Phelps, cofounder of Jokerace and EcoDAO, <a href=\"https://twitter.com/divine_economy/status/1693404534226264100?s=20\" target=\"_blank\" rel=\"noopener nofollow\">described</a> Friend.tech’s UX as the “greatest crypto has seen,” pointing to three main factors as to why the app was such a significant breakthrough for crypto. </p><p>Firstly, the app doesn’t require users to download via an app store account, which points more strongly to the idea of decentralization. Secondly, it bridges the funds to the app automatically, reducing the need for convoluted transactions. </p><p>Finally, the app allows users to deposit their ETH once and then buy and sell shares without ever having to sign a transaction again. The constant need to verify transactions via Metamask signatures <a href=\"https://cointelegraph.com/innovation-circle/5-things-crypto-must-get-right-for-mainstream-adoption-to-happen\">has been a major criticism</a> of many DApps in the crypto space. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/friendtech-generates-over-1m-fees-surpassing-uniswap-bitcoin-networks\">Friend.tech generates over $1M fees in 24h, surpassing Uniswap, Bitcoin networks</a></em></strong></p><p>Regardless of the varied predictions concerning the app's future success or failure, there’s no denying that it has taken crypto by storm. </p><p>On Aug. 19, Friendtech announced that it had received seed round funding from crypto venture capital firm Paradigm, sparking a wave of <a href=\"https://twitter.com/TrustlessState/status/1692611042629611838\" target=\"_blank\" rel=\"noopener nofollow\">speculation</a> over a future airdrop and potential token launch. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Earlier this year, we partnered with <a href=\"https://twitter.com/paradigm?ref_src=twsrc%5Etfw\">@paradigm</a> to build tools for new online social interactions.<br><br>We&#39;re grateful for the community&#39;s warm reception and excited to continue growing with you all <a href=\"https://t.co/yINDMXkpuZ\">pic.twitter.com/yINDMXkpuZ</a></p>&mdash; friend.tech (@friendtech) <a href=\"https://twitter.com/friendtech/status/1692588652172640666?ref_src=twsrc%5Etfw\">August 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to <a href=\"https://defillama.com/fees\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from DefiLlama, Friend.tech has generated $1.42 million in fees in the last 24 hours, and $4.2 million since its public launch. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/f6636e94-7773-44f9-b232-a78d733e718f.png\"  /><figcaption style=\"text-align: center;\"><em>Total Friend.tech fees and revenue since launch. Source: DeFiLlama</em></figcaption></figure><p>At the time of publication, the total revenue for the project stands at $1.88 million, and has witnessed over 724,000 <a href=\"https://dune.com/austin_adams/friendstech-dashboard\" target=\"_blank\" rel=\"noopener nofollow\">transactions</a> from more than 64,500 unique traders.</p><p><strong><em>Magazine:</em></strong><strong><em> </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-games-decentralized-lattice-starknet-cartridge/\"><strong><em>Blockchain games aren’t really decentralized… but that’s about to change</em></strong></a> </p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]