[
  {
    "source": "Crypto Daily",
    "date": "2023-06-18T11:15:00.000Z",
    "title": "Crypto Weekly Roundup: SEC Under Fire And More",
    "url": "https://cryptodaily.co.uk/2023/06/crypto-weekly-roundup-sec-under-fire-and-more",
    "description": "<p>The SEC has been facing increasing levels of scrutiny and criticism over its less than ideal approach to regulating the industry. It has come under fire from various industry leaders and a bill to dismiss the chairperson has even garnered support from several lawmakers. Let&rsquo;s find out more.&nbsp;</p>\nBitcoin&nbsp;\n<p>The world&rsquo;s largest asset manager, BlackRock, has filed an application for a Bitcoin spot exchange-traded fund (ETF).&nbsp;</p>\n<p>However, there are concerns that Blackrock could, in one fail swoop, take control of Bitcoin.&nbsp;</p>\n<p>Crypto exchange Binance has announced the launch of its new subscription-based Bitcoin cloud mining services.&nbsp;</p>\n<p>The Federal Reserve did not raise rates for the first time since the inflation-inspired start of its rapid interest rate expansion. However, crypto continues its downward slide.</p>\nEthereum\n<p>The Bank of China (BOCI) has made history by issuing tokenized securities on the Ethereum blockchain in Hong Kong.&nbsp;</p>\nDeFi\n<p>Frax Finance has unveiled its plans to roll out an Ethereum Layer 2 blockchain, aptly named Fraxchain.</p>\n<p>Uniswap recently disclosed its preferred choice for handling non-Ethereum deployments in its cross-chain bridging operations: Wormhole and Axelar.</p>\n<p>Uniswap has also unveiled plans for Uniswap v4, the next iteration of the hugely popular crypto platform.&nbsp;</p>\n<p>An Aave proposal intended to prevent a particular account from accumulating more debt has led to significant controversy, with some stating that it violates the principle of neutrality in DeFi.&nbsp;</p>\nAltcoins\n<p>A group of Terra Classic Core developers, the Joint L1 Task Force (L1TF), has announced that it is ready for the Parity Upgrade, set for the 14th of June, 2023.&nbsp;</p>\n<p>Ethereum Layer-2 scaling solution Polygon (MATIC) has unveiled its Version 2.0, the blueprint for which will be revealed over the next few weeks.</p>\nTechnology\n<p>Polygon recently proposed a new decentralized governance model aimed at enhancing its network's security, upgradeability, and robustness.</p>\nBusiness\n<p>The Banco de la Republica, Colombia&rsquo;s Central Bank, has announced a partnership with Ripple as it looks to explore the use of blockchain technology in the country.&nbsp;</p>\n<p>The crypto investment arm of venture capital firm Andreessen Horowitz, a16z, announced it would be opening its first overseas office in London.</p>\n<p>Korean-based cryptocurrency lending service, Delio, has temporarily suspended customer withdrawals due to financial irregularities involving crypto investment firm Haru.</p>\n<p>Voyager customers were in for some good news a year after their assets were frozen, with the platform stating that they could withdraw a significant chunk of their crypto assets from June 20.&nbsp;</p>\n<p>San Francisco-based crypto payments firm Wyre has announced that it has begun the process of winding down its operations, citing challenges arising from the prolonged bear market.&nbsp;</p>\nRegulation\n<p>Tether, the issuer of the leading stablecoin USDT, reportedly deactivated around 29 accounts tied to significant players in the cryptocurrency sphere in 2021.</p>\n<p>Binance is reportedly under scrutiny from French financial regulatory authorities, who have been investigating the exchange's activities since at least the early quarter of 2022.</p>\n<p>Crypto exchange OKCoin has come under the scrutiny of the Federal Deposit Insurance Corporation (FDIC) over accusations of making false promises to customers.&nbsp;</p>\n<p>The Blockchain Association has filed a Freedom of Information Act request with the SEC over the regulator's interactions with Prometheum.</p>\n<p>The Hong Kong government has proactively advocated for major banks to embrace clients engaged in digital currencies.&nbsp;</p>\n<p>Coinbase has become the latest entity to push back against the SEC&rsquo;s proposal of changing the definition of an exchange.&nbsp;</p>\n<p>According to Tim Draper, the SEC Chair Gary Gensler is stifling the crypto sector leading to a potential long-term detrimental effect on technology in the US.</p>\n<p>Following a Financial Services Committee hearing on Tuesday, a digital asset bill will be voted on in July which will give clarity to the crypto industry.</p>\n<p>The SEC has requested four more months to respond to Coinbase&rsquo;s call for crypto regulatory clarity.</p>\n<p>Crypto billionaires Tyler and Cameron Winklevoss cautioned the Democratic Party that its &ldquo;war on crypto&rdquo; will result in its losing crucial voters.</p>\n<p>United States Congressman Warren Davidson has filed a new bill called the SEC Stabilization Act, which looks to restructure the regulatory body, including the dismissal of current SEC Chair Gary Gensler.&nbsp;</p>\n<p>Lawyers for FTX Founder Sam Bankman-Fried have stated that litigation proceedings against him could be significantly delayed if further charges are added against the founder.&nbsp;</p>\nNFT\n<p>Nike has started dropping hints about a potentially massive move - introducing a collection of sneaker NFTs in Fortnite.</p>\n<p>Indian e-commerce giant Flipkart has formed a key alliance with Polygon, one of the industry's key crypto firms building infrastructure around an ecosystem of Web3 products.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice. </p>"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-18T11:32:32.000Z",
    "title": "Key Metric Suggests Momentum is Building Up for an Altcoins Rally",
    "url": "https://coinedition.com/key-metric-suggests-momentum-is-building-up-for-an-altcoins-rally/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/These_5_Altcoins_Managed_to_Shine_Despite_Massive_Crypto_Market-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/These_5_Altcoins_Managed_to_Shine_Despite_Massive_Crypto_Market-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/These_5_Altcoins_Managed_to_Shine_Despite_Massive_Crypto_Market-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/These_5_Altcoins_Managed_to_Shine_Despite_Massive_Crypto_Market.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>According to Nicholas Merten, founder, and creator of the crypto YouTube Channel, DataDash, crypto prices will probably remain in their current region or correct downwards unless the stablecoins liquidity expands. Merten drew this conclusion from the historical correlation pattern between stablecoins liquidity and the altcoins market metrics.   In a video uploaded on YouTube, the DataDash [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/key-metric-suggests-momentum-is-building-up-for-an-altcoins-rally/\">Key Metric Suggests Momentum is Building Up for an Altcoins Rally</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]