[
  {
    "source": "Decrypt",
    "date": "2023-09-22T11:14:24.000Z",
    "title": "The Island Onboards Museums to On-Chain Art: ‘There is Something to Gain for Both Worlds’",
    "url": "https://decrypt.co/198332/the-island-onboards-museums-to-on-chain-art-there-is-something-to-gain-for-both-worlds",
    "description": "The platform aims to onboard traditional artists and institutions to the blockchain while bringing museum-quality standards to Web3 art. "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-22T11:30:25.000Z",
    "title": "Regulator Sues Crypto Exchange Kraken Provider in Australia",
    "url": "https://news.bitcoin.com/regulator-sues-crypto-exchange-kraken-provider-in-australia/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2067307103-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Regulator Sues Crypto Exchange Kraken Provider in Australia\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2067307103-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2067307103-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2067307103-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2067307103-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2067307103-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2067307103-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2067307103.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Australia’s securities regulator has initiated civil proceedings against Bit Trade Pty Ltd, an entity providing Kraken services to Australian users. According to the government agency, the company failed to comply with regulatory obligations meant to ensure proper consumer protection. Australian Regulator Seeks to Prohibit Kraken Partner From Ongoing Conduct The Australian Securities and Investments Commission [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-22T11:39:33.000Z",
    "title": "Can College Skills Keep Pace with the Evolving AI Job Market? Insights from Indeed’s CEO",
    "url": "https://www.cryptopolitan.com/college-skills-ai-job-market-indeeds-ceo/",
    "description": "In a thought-provoking essay, Chris Hyams, the CEO of the popular job site Indeed, has voiced his apprehensions regarding the influence of artificial intelligence (AI), specifically generative AI tools like OpenAI&#8217;s ChatGPT, on the evolving job market. Drawing parallels between the rapid evolution of AI and historical technological revolutions, Hyams has raised concerns about the ... <a title=\"Can College Skills Keep Pace with the Evolving AI Job Market? Insights from Indeed&#8217;s CEO\" class=\"read-more\" href=\"https://www.cryptopolitan.com/college-skills-ai-job-market-indeeds-ceo/\" aria-label=\"More on Can College Skills Keep Pace with the Evolving AI Job Market? Insights from Indeed&#8217;s CEO\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-09-22T11:26:50.000Z",
    "title": "Bitcoin/Ethereum Ratio Reaches New One-Year High: Implications For Crypto Investors",
    "url": "https://nulltx.com/bitcoin-ethereum-ratio-reaches-new-one-year-high-implications-for-crypto-investors/",
    "description": "In the ever-evolving world of cryptocurrency investment, one metric that has recently grabbed the attention of analysts and traders alike is the Bitcoin/Ethereum ratio. This ratio measures the relative performance of Bitcoin (BTC) against Ethereum (ETH), two of the most prominent cryptocurrencies in the market. As it reaches a new one-year high, investors are taking [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-22T11:30:07.000Z",
    "title": "Bitcoin And Crypto Face Turbulence As 10-Year US Treasury Yield Hits 15-Year High",
    "url": "https://www.newsbtc.com/news/bitcoin-crypto-turbulence-10-year-treasury-yield/",
    "description": "In an environment of soaring interest rates and economic unpredictability, Bitcoin and the broader crypto market face increased headwinds. The shift in the financial landscape was recently underscored by the Benchmark 10-year US Treasury yield, which hit a 16-year high this Thursday. Longest Yield Curve Inversion Ever Historically, an inverted yield curve, where short-term yields are higher than long-term ones, has been a harbinger of economic downturns. Notably, the 10-Year minus the 3-Month Treasury Yield curve has been inverted for a record 217 trading days. Past data indicates that the longer the delay between the inversion and the start of a recession, the more severe the recession is likely to be. Joe Consorti, Market Analyst at The Bitcoin Layer, underscored this concern, remarking on Twitter: &#8220;The yield curve is re-steepening at breakneck speed. Up by 10 bps or more today across the curve. Do you know what happens when the yield curve steepens, every single time? Hint: not economic expansion.&#8221; Related Reading: Ex-Alameda Employee Claims Firm Triggered 87% Bitcoin Price Plummet In 2021 The Fed&#8217;s recent signals and policy stance have taken the financial world by storm. Charlie Bilello, Chief Market Strategist at Creative Planning, noted, &#8220;The 10-Year Treasury Yield moved up to 4.49% today, highest since October 2007. The Real 10-Year Yield (adjusted for expected inflation) of 2.11% is now at the highest level since March 2009.&#8221; Bilello also pointed out the significant reduction in the Fed&#8217;s balance sheet, which is currently &#8220;over 10% below its April 2022 peak.&#8221; The two largest drawdowns over the last 20 years were between December 2008 and February 2009 with 18.2% (balance sheet hit a new high in Jan 2010), and from January 2015 to August 2019 with -16.7% (balance sheet hit a new high in March 2020). The rise in the 10-Year Treasury Yield was reiterated by the analysts from &#8220;The Kobeissi Letter,&#8221; who stated: &#8220;BREAKING: 10-Year Note Yield officially hits our 4.50% target&#8230; The 10-Year Note Yield is up an incredible 20 basis points in less than 24 hours&#8230; With supply side inflation out of control and oil prices back to $90+, the Fed has no choice. Higher for longer is back.&#8221; The Federal Reserve&#8217;s Stand During Wednesday&#8217;s FOMC meeting, the US central bank and chairman Jerome Powell have made clear its intentions, signaling the potential for an additional rate hike this year and forecasting fewer cuts next year. It now forecasts half a percentage point of rate cuts in 2024. Prior, the dot plot showed cut rates by a full percentage point next year. Related Reading: Why Touching This Bitcoin Level Could Hold The Key For A Rally This &#8220;higher for longer&#8221; strategy seems to diverge from the market&#8217;s prior expectations, despite three months of seemingly positive inflation data. Moreover, Powell conveyed confidence in the US. economy, emphasizing the need to ensure interest rates are adjusted correctly to achieve the central bank&#8217;s 2% inflation target. However, the market remains uncertain, with the CME Group&#8217;s FedWatch Tool indicating only a 32% chance of another rate hike in November and a 45% likelihood by December. Implications For Bitcoin And Crypto Risk assets, including Bitcoin and other cryptocurrencies, have historically been sensitive to increases in the 10-Year Treasury Yield. Charles Edwards, founder of Capriole Investments, highlighted the challenges for the Bitcoin and crypto sector: The Fed wants more unemployment. The job market is still too strong. They&#8217;ve raised the expected 2024 rates as a result and the 10YR has broken out to new decade highs. As long as the 10YR is breaking upwards like this, risk assets are going to see further headwinds. Historically, rising yields are indicative of an expectation of higher interest rates, which increase the cost of borrowing. This scenario often leads to a reduction in speculative investments, with investors favoring more stable, yield-bearing assets over riskier options such as Bitcoin and crypto. Another problem for the market is the &#8220;higher for longer&#8221; approach and the massive reduction of the Fed&#8217;s balance sheet. Risk assets like Bitcoin are traditionally a &#8220;sponge&#8221; for high liquidity, but when this dries up in the financial market, they usually suffer the most. In addition, concerns about a possible recession will continue to rise due to the inverted yield curve. Remarkably, Bitcoin and crypto have never traded in a recession, the reaction is uncertain. At press time, Bitcoin traded at $26,655. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-22T11:24:04.000Z",
    "title": "Breaking Free: How Brics Nations Are Spearheading the De-Dollarization Revolution and Embracing Bitcoin (BTC) for the People",
    "url": "https://www.crypto-news-flash.com/breaking-free-how-brics-nations-are-spearheading-the-de-dollarization-revolution-and-embracing-bitcoin-btc-for-the-people/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-free-how-brics-nations-are-spearheading-the-de-dollarization-revolution-and-embracing-bitcoin-btc-for-the-people",
    "description": "<img width=\"1280\" height=\"850\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-4406851_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Brazil\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-4406851_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-4406851_1280-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-4406851_1280-1024x680.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-4406851_1280-768x510.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-4406851_1280-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />BRICS nations are forging ahead with plans to de-dollarize and limit the United States&#8217; global influence. The bloc is rumored to be working on a common currency that would be backed by gold in reserves, Bitcoin (BTC) has also emerged as an alternative. BRICS is leading nations in an attempt to de-dollarize. The acronym BRICS [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-22T11:27:41.000Z",
    "title": "LUNC Community Pool May Dry Up By The End of This Year: Analyst",
    "url": "https://coinedition.com/lunc-community-pool-may-dry-up-by-the-end-of-this-year-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/LUNC-Communitys-Activity-Is-a-Positive-Sign-Says-Trader.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"LUNC Analysis: Price Poised to Pump Ahead of v2.2.1 Core Upgrade\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/LUNC-Communitys-Activity-Is-a-Positive-Sign-Says-Trader.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/LUNC-Communitys-Activity-Is-a-Positive-Sign-Says-Trader-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/LUNC-Communitys-Activity-Is-a-Positive-Sign-Says-Trader-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/LUNC-Communitys-Activity-Is-a-Positive-Sign-Says-Trader-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/LUNC-Communitys-Activity-Is-a-Positive-Sign-Says-Trader-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/LUNC-Communitys-Activity-Is-a-Positive-Sign-Says-Trader-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Clay, the ClayBro crypto YouTube channel&#8217;s host, believes that Terra Classic is at a crossroads. According to Clay, the blockchain project is facing some crucial decisions that could make or break the future of LUNC. He sees the possibility of LUNC’s community pool drying up by the end of this year. In a recently uploaded [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/lunc-community-pool-may-dry-up-by-the-end-of-this-year-analyst/\">LUNC Community Pool May Dry Up By The End of This Year: Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-09-22T11:37:45.000Z",
    "title": "Mobile App Change Log 6.8",
    "url": "https://blog.bitfinex.com/mobile-app/mobile-app-change-log-6-8/",
    "description": "<p>Recent updates and optimisations to the Bitfinex mobile app We’re pleased to present Version 6.8 of the Bitfinex mobile app. The latest update to the Bitfinex mobile app includes the Recurring Buy feature on Lite mode. iOS Android You can also download the latest version...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/mobile-app/mobile-app-change-log-6-8/\">Mobile App Change Log 6.8</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]