[
  {
    "source": "Bitcoin.com",
    "date": "2023-06-17T11:15:36.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Nears $27,000, as Bulls Make a Comeback",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-nears-27000-as-bulls-make-a-comeback/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1273691584-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC Nears $27,000, as Bulls Make a Comeback\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1273691584-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1273691584-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1273691584-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1273691584-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1273691584-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1273691584-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1273691584.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin bounced back strongly to start the weekend, as prices moved closer to the $27,000 mark in today&#x2019;s session. After a recent spell of consolidation, bulls returned to action, buying the recent dip in the process. Ethereum was also higher, closing in on $1,800 on Saturday. Bitcoin Bitcoin (BTC) surged on Saturday, as bulls of [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-17T11:30:35.000Z",
    "title": "Shiba Inu (SHIB) Positive Social Sentiment Sparks Bullish Speculation",
    "url": "https://www.newsbtc.com/news/shiba-inu-shib-positive-social-sentiment-sparks-bullish-speculation/",
    "description": "Shiba Inu (SHIB), a cryptocurrency that has gained immense popularity and attention in recent months, is making waves once again as its price exhibits signs of recovery.  This week, the SHIB price has displayed a promising uptick, maintaining a level above the $0.0000065 range. Moreover, on-chain data analysis reveals a notable surge in positive social sentiment within the vibrant Shiba Inu community.  Related Reading: Polygon (MATIC) Sees Surge In Whale Buying Despite US Regulatory Pressure With these encouraging developments, investors and enthusiasts eagerly ponder whether this could signal a forthcoming bullish reversal for SHIB. Is it time for the Shiba Inu token to regain its momentum and embark on a new upward trajectory? Growing Optimism Among Shiba Inu Investors After a volatile start to the month, investors in SHIB are beginning to feel more optimistic about the project&#8217;s prospects. This renewed optimism can be attributed, in part, to Santiment&#8217;s Weighted Sentiment, which assesses the overall mood of a blockchain community by comparing the number of positive comments to the negative ones. SHIB weighted sentiment. Source: Santiment Adding to the positive sentiment, the Shiba Inu community received intriguing updates from notable figures within the project. Something physical is coming. #shib #shibarmy pic.twitter.com/XuAe2AkpJw — Shytoshi Kusama™ (@ShytoshiKusama) June 14, 2023 Shytoshi Kusama, a prominent Shiba Inu developer, generated excitement with a mysterious tweet teasing an upcoming product launch. Soon after, Lucie Shib, another key contributor, affirmed the project&#8217;s vitality and commitment to development in a separate tweet. We are building. We are not going anywhere.$SHIB x #Shiboshis — 𝐋𝐔𝐂𝐈𝐄 (@LucieSHIB) June 15, 2023 Recent Price Movements And Social Sentiment As per the latest data from CoinMarketCap, the current price of SHIB stands at $0.00000669, showcasing a 2.65% uptick within the past 24 hours. The past seven days also showed some price improvement for SHIB, as the meme coin gained 7.29%. Source: CoinMarketCap Examining on-chain data, it becomes evident that these critical announcements have had a positive impact on the social sentiment within the SHIB community. The Weighted Sentiment metric for SHIB began to show an upward trend around June 9, and as of June 16, it sits at approximately -1.43. This indicates a notable 13% improvement in positive sentiment over the past week. SHIB market cap currently at $4.07 billion on the weekend chart: TradingView.com Related Reading: PEPE Jumps Nearly 10% In 24 Hours, Sparking Speculation Of A New Rally Possibility For A Bullish Reversal When the Weighted Sentiment metric starts to rise during a period of price correction, it often signals the potential for a bullish reversal. Therefore, if the recent team announcement materializes into a well-received product launch, there is a possibility that the SHIB price could enter a phase of recovery in the near future.  This development has captured the attention of investors and could pave the way for an upward trajectory for the meme coin. Featured image from The Daily Hodl"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-17T11:26:00.000Z",
    "title": "Uncertainty Rises as Crypto Experts Debate BTC’s Next Move",
    "url": "https://coinedition.com/uncertainty-rises-as-crypto-experts-debate-btcs-next-move/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/BTC-2-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Uncertainty Rises as Crypto Experts Debate BTC’s Next Move\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/BTC-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/BTC-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/BTC-2.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>A crypto analyst shared a post on Twitter yesterday speculating about what the price of the crypto market leader, Bitcoin (BTC), could do next. According to the post, the analyst believes that there are certain similarities on BTC’s chart now compared to 2020. The analyst drew similarities between the Covid crash in 2020 and the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/uncertainty-rises-as-crypto-experts-debate-btcs-next-move/\">Uncertainty Rises as Crypto Experts Debate BTC’s Next Move</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]