[
  {
    "source": "CoinDesk",
    "date": "2023-08-17T11:51:55.000Z",
    "title": "Crypto Investors Can Now Trade XRP Options on BIT Exchange",
    "url": "https://www.coindesk.com/markets/2023/08/17/crypto-investors-can-now-trade-xrp-options-on-bit-exchange/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Options allow investors to hedge bullish/bearish risks and generate additional income on top of their spot market holdings."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-17T11:50:53.000Z",
    "title": "Genesis, FTX Strike Deal for $175M Bankruptcy Claim ",
    "url": "https://www.coindesk.com/policy/2023/08/17/genesis-ftx-strike-deal-for-175m-bankruptcy-claim/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Lawyers are trying to untie a complex financial web among companies that went under in the crypto winter."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-17T11:42:40.000Z",
    "title": "Bitcoin soars in Argentina as Javier Milei wins presidential primary",
    "url": "https://cointelegraph.com/news/bitcoin-hits-record-highs-in-argentina-as-javier-milei-wins-primary",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/20dcd5ce-6b39-4c0c-b654-e10d907b83ce.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Despite slumping in global crytocurrency markets, Bitcoin has jumped to new highs in Argentine after BTC-friendly presidential candidate Javier Milei won the primary vote on August 13.</p>\n                    <p><p>The <a href=\"https://www.coingecko.com/en/coins/bitcoin\" target=\"_blank\" rel=\"noopener nofollow\">price</a> of Bitcoin (BTC) has jumped to a fresh high in Argentina since the news that Bitcoin-friendly presidential candidate Javier Milei won a primary election on Aug. 13, with 1 BTC reaching a value of 10.2 million Argentine pesos (ARS) on Aug. 14, according to data from CoinGecko. </p><p>While global cryptocurrency markets are experiencing a notable slump, some parts of the world are still recording new all-time highs for Bitcoin. In Argentina, Bitcoin has seen a sharp climb this week, with BTC rallying 21% from 8.4 million ARS to 10.2 million in less than one hour on Monday.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/38423af1-a817-4259-8f56-0f1528ec2bf6.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin versus the Argentine peso seven-day price chart. Source: CoinGecko</em></figcaption></figure><p>At the same time, Bitcoin has been steadily gaining value against ARS since late 2022. According to CoinGecko, Bitcoin has surged more than 210% versus the Argentine peso since Aug. 17, 2022.</p><p>Since hitting a new record high, BTC price versus ARS has dropped slightly. At the time of writing, Bitcoin is trading at 9.9 million ARS, down around 3% from its all-time high levels.</p><p>The most recent Bitcoin’s rally in Argentina has been attributed to the presidential primary win by pro-Bitcoin presidential candidate Javier Milei. After winning the primary with more than 30% of votes, Milei is now the front-runner in Argentina’s general election in October.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/rfk-jr-will-back-us-dollar-with-bitcoin-if-president\"><strong><em>Robert F. Kennedy Jr. vows to back US dollar with Bitcoin if elected president</em></strong></a></p><p>As previously reported, <a href=\"https://cointelegraph.com/news/bitcoiner-javier-milei-wins-argentina-presidential-primary\">Milei wants to abolish the central bank</a> and adopt the U.S. dollar as Argentina's currency. The presidential candidate also believes that Bitcoin is a reaction against “central bank scammers,” while fiat currency allows politicians to scam Argentines with inflation.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/106a13d1-38dd-4f03-a189-b9ea15cc0590.png\"  /><figcaption style=\"text-align: center;\"><em>Argentine pro-Bitcoin presidential candidate Javier Milei. Source: El País</em></figcaption></figure><p>While Bitcoin has been at its record highs in Argentina recently, the cryptocurrency has been on the decline in global markets.</p><p>Since Aug. 14, Bitcoin has <a href=\"https://www.coingecko.com/en/coins/bitcoin\" target=\"_blank\" rel=\"noopener nofollow\">lost</a> 3.7% of its value versus the U.S. dollar, dropping below the psychological mark of $29,000 on Aug. 16, according to CoinGecko. The cryptocurrency has been gradually tumbling over the past 30 days, dropping nearly 5% over the period at the time of writing.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/3955760a-1680-413e-aede-438a40d157ec.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin versus USD seven-day price chart. Source: CoinGecko</em></figcaption></figure><p>Argentina is not the only country that has seen Bitcoin price at its highest historic levels amid massive inflation recently. Bitcoin has also been trading near all-time high levels in countries like Turkey, which reportedly <a href=\"https://www.ft.com/content/2128b96c-2696-4df6-8d7f-0c625a7b2497\" target=\"_blank\" rel=\"noopener nofollow\">saw</a> its inflation rate rising to nearly 50% in July 2023.</p><p>In July, Bitcoin climbed to the highest level versus Turkish lira (TRY), reaching a value of 819,000 TRY per 1 BTC, according to data from CoinGecko.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/big-questions-did-the-nsa-create-bitcoin/\"><strong><em>Big Questions: Did the NSA create Bitcoin?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-17T12:01:03.000Z",
    "title": "Replacing Trust with Truth - Banks fear crypto",
    "url": "https://cryptodaily.co.uk/2023/08/replacing-trust-with-truth-banks-fear-crypto",
    "description": "<p>According to hedge fund manager Mark Yusko, banks take $7 trillion dollars out of the system every year. The advent of triple entry accounting with blockchain means that banks are becoming redundant.</p>\nBanks fight dirty\n<p>Founder of Morgan Creek Capital, Yusko recently gave an interview in which he gave a portrayal of the banks that isn&rsquo;t often heard. He stated that banks have paid more in fines for criminal acts such as fraud and money laundering than the entire market cap of Bitcoin.</p>\n<p>He affirmed that banks are extremely worried about crypto and blockchain technology because it heralds an end to their existence, given that the middle man is now no longer needed. He said:</p>\n\n<p>&ldquo;We (the banks) skim $7 trillion a year out of this system. It&rsquo;s 6 to 8% of GDP that goes to the banks for trust - but we can replace trust with truth.&rdquo;</p>\n\n<p>Yusko is of the belief that the FTX collapse was actually orchestrated in order to bring controversy to the crypto industry and allow US regulators to react by launching an aggressive onslaught against the crypto sector.</p>\n<p>He believes that the banking industry, in charge of money for hundreds of years, is in league with regulators to cripple the crypto industry so that it can continue its hegemony over printing money.</p>\n<p>Yusko expects the banks&rsquo; fight against the crypto industry will carry on for the next few years before the obvious advantages of crypto and blockchain are finally recognised and given government support.&nbsp;</p>\nHow the incumbent fights the newcomer\n<p>An example of an antiquated and embedded system that seeks to suppress and cripple a new and better system is given by Yusko. He points to when cars were invented and how the incumbent transport system of the horse and buggy sought to do just this in the late 19th century.</p>\n<p>Reportedly there was collusion between those seeking to protect the horse and buggy system, and the regulators. Ridiculous and onerous rules were imposed on cars that forced them to have someone walking ahead of them holding a red flag. In addition, three persons were required by law to have charge of a vehicle, and additional persons were needed if wagons or carriages were attached.</p>\n<p>These harsh and exacting laws were in place for 30 years before being repealed, and technology was finally allowed to progress.&nbsp;</p>\nImposition of CBDCs\n<p>According to Yusko, banking is attempting to do the same thing against crypto. He believes that moves are afoot to impose central bank digital currencies on citizens, forcing their use. Yusko said of CBDCs:</p>\n\n<p>&ldquo;If you haven&rsquo;t watched Agustin Carstens (Head of the Bank for International Settlements) talk about what a CBDC actually is - and of course the central bank should control how, when, and if you are allowed to spend &lsquo;your&rsquo; money - it&rsquo;s one of the most chilling 1 minute and 47 seconds that you&rsquo;ll ever watch.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T12:04:50.000Z",
    "title": "Half of Working South Africans Express Concerns About ChatGPT and Future AI Implications",
    "url": "https://www.cryptopolitan.com/south-africans-concerns-about-chatgpt/",
    "description": "As the prevalence of Artificial Intelligence (AI) continues to expand, concerns about its potential consequences are becoming more pronounced among South Africans. A recent publication by In On Africa (IOA), a prominent Africa-focused research and business advisory firm, sheds light on the adoption of ChatGPT, an advanced AI-powered language model developed by OpenAI, and the ... <a title=\"Half of Working South Africans Express Concerns About ChatGPT and Future AI Implications\" class=\"read-more\" href=\"https://www.cryptopolitan.com/south-africans-concerns-about-chatgpt/\" aria-label=\"More on Half of Working South Africans Express Concerns About ChatGPT and Future AI Implications\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T12:03:32.000Z",
    "title": "Bitcoin miners’ new tech boosts winning odds by 260%: Experts",
    "url": "https://www.cryptopolitan.com/bitcoin-miners-new-tech-boosts-odds-by-260/",
    "description": "While many remain entranced by the volatile price of Bitcoin, few may realize the pivotal shifts occurring behind the scenes. Quantum Blockchain Technologies (QBT), a UK-based research firm, is flipping the script with groundbreaking tech that promises to shake up the Bitcoin mining landscape. Harnessing the Power of AI in Bitcoin Mining Let&#8217;s cut through ... <a title=\"Bitcoin miners&#8217; new tech boosts winning odds by 260%: Experts\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-miners-new-tech-boosts-odds-by-260/\" aria-label=\"More on Bitcoin miners&#8217; new tech boosts winning odds by 260%: Experts\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T11:59:28.000Z",
    "title": "Singapore busts a $1 billion money laundering ring, seizing assets and crypto",
    "url": "https://www.cryptopolitan.com/singapore-busts-a-1-billion-money-laundering-ring-seizing-assets-and-crypto/",
    "description": "Singaporean law enforcement has taken a significant stride in combating financial crime, apprehending 10 foreign nationals suspected of laundering money. The arrests also encompass allegations of forgery and resistance to lawful authorities. The operation yielded an impressive haul of assets, totaling approximately S$1 billion ($735 million), a substantial blow to illicit activities. Most detained individuals ... <a title=\"Singapore busts a $1 billion money laundering ring, seizing assets and crypto\" class=\"read-more\" href=\"https://www.cryptopolitan.com/singapore-busts-a-1-billion-money-laundering-ring-seizing-assets-and-crypto/\" aria-label=\"More on Singapore busts a $1 billion money laundering ring, seizing assets and crypto\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T11:59:12.000Z",
    "title": "AI-Powered Breakthrough Revolutionizes Drug Discovery, Enhancing Efficiency and Accessibility",
    "url": "https://www.cryptopolitan.com/ai-revolutionizes-drug-discovery/",
    "description": "The landscape of drug discovery is on the brink of transformation with the integration of artificial intelligence (AI), offering the potential to accelerate the process and reduce associated costs. A groundbreaking AI-powered technique known as AttentionSiteDTI, developed by researchers at the University of Central Florida, holds the promise of significantly expediting drug discovery by predicting ... <a title=\"AI-Powered Breakthrough Revolutionizes Drug Discovery, Enhancing Efficiency and Accessibility\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-revolutionizes-drug-discovery/\" aria-label=\"More on AI-Powered Breakthrough Revolutionizes Drug Discovery, Enhancing Efficiency and Accessibility\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T11:54:29.000Z",
    "title": "EU got some tricks up its sleeve: Close look at the big moves",
    "url": "https://www.cryptopolitan.com/eu-got-some-tricks-up-its-sleeve-close-look/",
    "description": "The European Union, often viewed with a British lens focused on bickering and disputes, is much more than its momentary discord. While some may fixate on these internal disagreements, they&#8217;re simply missing the bigger picture: the EU is evolving, and it&#8217;s doing so rapidly. EU shifting tides post-Brexit The Brexit year, 2016, was mired with ... <a title=\"EU got some tricks up its sleeve: Close look at the big moves\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eu-got-some-tricks-up-its-sleeve-close-look/\" aria-label=\"More on EU got some tricks up its sleeve: Close look at the big moves\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T11:48:14.000Z",
    "title": "What has the Inflation Reduction Act actually done?",
    "url": "https://www.cryptopolitan.com/what-has-the-inflation-reduction-act-done/",
    "description": "It&#8217;s been precisely a year, and the reverberations of the Inflation Reduction Act (IRA) are echoing across the global clean energy markets. The United States, once a silent observer, is now dominating the cleantech manufacturing realm. And yet, as we wade through the vast sea of data, billions of investments, and political campaigns, the ultimate ... <a title=\"What has the Inflation Reduction Act actually done?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/what-has-the-inflation-reduction-act-done/\" aria-label=\"More on What has the Inflation Reduction Act actually done?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T11:42:42.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 How much is Bitcoin (BTC) worth? Today, the price of Bitcoin stands at $28,491, with a 24-hour trading volume totalling $38.62 billion. It boasts a market capitalization of $566 billion and commands 48.1% of the cryptocurrency market. Over the past day, Bitcoin’s price experienced a decrease of 2.3%. Currently, there are ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T11:42:00.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-17T12:04:23.000Z",
    "title": "Bitcoin reaches ATH in Argentina as pro-crypto candidate wins primaries",
    "url": "https://crypto.news/bitcoin-reaches-ath-in-argentina-as-pro-crypto-candidate-wins-primaries/",
    "description": "Bitcoin (BTC) has reached its peak in Argentina after a pro-Bitcoin candidate won the primary election in the country. On Aug. 13, Javier Millei, a libertarian candidate representing the political party Freedom Advances, took first place in the primary elections&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-17T11:44:19.000Z",
    "title": "Empowering DeFi: Tranchess Teams Up with Chainlink’s Oracle Power and BNB Chain’s High Performance",
    "url": "https://www.crypto-news-flash.com/empowering-defi-tranchess-teams-up-with-chainlinks-oracle-power-and-bnb-chains-high-performance/?utm_source=rss&utm_medium=rss&utm_campaign=empowering-defi-tranchess-teams-up-with-chainlinks-oracle-power-and-bnb-chains-high-performance",
    "description": "<img width=\"683\" height=\"425\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Screenshot-2023-08-17T122659.321.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Tranchess XChainlinkXBNB\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Screenshot-2023-08-17T122659.321.png 683w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Screenshot-2023-08-17T122659.321-300x187.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Screenshot-2023-08-17T122659.321-163x102.png 163w\" sizes=\"(max-width: 683px) 100vw, 683px\" />Operating on BNB Chain and Ethereum, Tranchess offers liquid staking, risk-adjusted returns, and structured products.  With BNB Chain&#8217;s performance and ecosystem, Tranchess thrives. During an interview hosted by Tranchess, Danny, one of the platform&#8217;s founders, discussed the evaluation of Tranchess&#8217; partnership with Chainlink and Binance Smart Chain (BNB). This review comes nearly three years after [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-17T12:05:54.000Z",
    "title": "Why Chainlink (LINK) Needs to Trend Lower Before Another Rally",
    "url": "https://coinedition.com/why-chainlink-link-needs-to-trend-lower-before-another-rally/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/Request_01_LINK_This_one_shows_strength_and_broke_resistance.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Micheal Predicts LINK To Hit $8.5 or $9.25 if It Holds Above $7\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/Request_01_LINK_This_one_shows_strength_and_broke_resistance.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/Request_01_LINK_This_one_shows_strength_and_broke_resistance-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/Request_01_LINK_This_one_shows_strength_and_broke_resistance-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/Request_01_LINK_This_one_shows_strength_and_broke_resistance-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/Request_01_LINK_This_one_shows_strength_and_broke_resistance-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/Request_01_LINK_This_one_shows_strength_and_broke_resistance-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Michaël van de Poppe, analyst and founder of MN Trading told his 663,200 Twitter followers that Chainlink‘s (LINK) trajectory may remain unchanged. According to Poppe, LINK was facing heavy resistance a little above $8. Troughs Before the Crest The analyst opined that the token, whose fundamentals are based on Oracle solutions and potential use cases [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/why-chainlink-link-needs-to-trend-lower-before-another-rally/\">Why Chainlink (LINK) Needs to Trend Lower Before Another Rally</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-17T11:45:34.000Z",
    "title": "On-Chain Indicator Shows Short-Term Bitcoin Bulls Unwilling To Sell Their BTC: Glassnode",
    "url": "https://dailyhodl.com/2023/08/17/on-chain-indicator-shows-short-term-bitcoin-bulls-unwilling-to-sell-their-btc-glassnode/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/to-Sell-Their-BTC.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/to-Sell-Their-BTC.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/to-Sell-Their-BTC.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/to-Sell-Their-BTC.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/to-Sell-Their-BTC.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/to-Sell-Their-BTC.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/to-Sell-Their-BTC.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Short-term Bitcoin (BTC) holders are unwilling to sell their BTC amid the ongoing crypto market doldrums, according to the analytics firm Glassnode. In a new YouTube video, the firm looks at the Bitcoin Short-Term Holder Sell-Side Risk Ratio, a metric that analyzes the amount of BTC that has moved in the past five months. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/17/on-chain-indicator-shows-short-term-bitcoin-bulls-unwilling-to-sell-their-btc-glassnode/\">On-Chain Indicator Shows Short-Term Bitcoin Bulls Unwilling To Sell Their BTC: Glassnode</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]