[
  {
    "source": "CoinDesk",
    "date": "2024-01-26T21:11:43.000Z",
    "title": "Which Is the Best Self-Custody Lightning Wallet?",
    "url": "https://www.coindesk.com/consensus-magazine/2024/01/26/which-is-the-best-self-custody-lightning-wallet/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bitcoin educator Anita Posch tested the Blixt, Green, Mutiny, Phoenix and Zeus Lightning wallets while traveling in Zimbabwe."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-26T21:35:00.000Z",
    "title": " Estonian government will allow extradition of Hashflare defendants ",
    "url": "https://cointelegraph.com/news/estonian-government-allow-extradition-hashflare-defendants",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMTdiYzE2MTItOWM5ZC00N2VhLTkzMmItMTM3ZTRlYjJlYmRhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ivan Turogin and Sergei Potapenko face 18 charges in the United States and long prison terms for allegedly making HashFlare a Ponzi scheme. </p>\n                    <p><p>Ivan Turogin and Sergei Potapenko, the co-founders of inactive Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) cloud miner HashFlare, are again slated for extradition from Estonia to the United States. The Estonian citizens’ extradition was halted by an appeals court in November, but the Estonian government has since met the necessary conditions for its continuation.</p><p>Turogin and Potapenko have been charged with 18 counts of conspiracy, wire fraud, and conspiracy to commit money laundering in the United States and face up to 20 years each in prison. Their company was once a leading cloud miner but was allegedly run as a Ponzi scheme. </p><p>Turogin and Potapenko <a href=\"https://cointelegraph.com/news/hashflare-founders-arrested-in-astounding-575m-crypto-fraud-scheme\">were arrested in Estonia</a> in November 2022, after a large-scale investigation involving U.S. and Estonian law enforcement. </p><p><a href=\"https://cointelegraph.com/news/estonian-government-allow-extradition-hashflare-defendants\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-26T21:30:00.000Z",
    "title": " Crypto Biz: Telefónica joins Helium Network, BIS targets tokenization, and more ",
    "url": "https://cointelegraph.com/news/crypto-biz-telefonica-joins-helium-network-bis-targets-tokenization-and-more",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYzVmZDViZTYtN2VlOS00YjJhLWEyNmMtOGQ0ZWZkZDgyMmZiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Bank for International Settlements is advancing plans for global tokenization and central bank digital currencies in 2024.</p>\n                    <p><p>Central bank digital currencies (CBDCs) and tokenization are among the top priorities for the Bank for International Settlements (BIS) in 2024. The organization announced on Jan. 23 that it is <a href=\"https://cointelegraph.com/news/bis-cbdc-tokenization-projects-2024\">moving forward with the second phase</a> of testing for new technologies in another demonstration of crypto-based solutions increasing integration with traditional banking.</p><p>The BIS’s work program includes six new projects focusing on cybersecurity, financial crime, CBDCs and green finance. Meanwhile, project Promissa, a joint effort with the Swiss National Bank and the World Bank, will develop a digital platform for tokenized promissory notes. The BIS aims to complete this proof-of-concept by early 2025.</p><p>Also making headlines this week is the crypto lending platform Nexo. The company is <a href=\"https://cointelegraph.com/news/nexo-seeks-3b-damages-bulgaria-dropped-investigation\">seeking $3 billion in damages</a> from the Bulgarian government due to failed criminal investigations. Nexo filed an arbitration claim with the International Centre for Settlement of Investment Disputes (ICSID) in Washington, D.C., on Jan. 24. </p><p><a href=\"https://cointelegraph.com/news/crypto-biz-telefonica-joins-helium-network-bis-targets-tokenization-and-more\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-26T21:19:10.000Z",
    "title": " Why is Bitcoin price up today? ",
    "url": "https://cointelegraph.com/news/why-is-bitcoin-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTAvMjk3NTY5OWMtYWJkZC00ZjdiLWJkMzUtNzQyNjdhNTcwMTE3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin price rallied to $42,000 after today’s options expiry, a reduction in inflation and a positive report from JP Morgan boosted BTC’s prospects.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price gained 3.2% on Jan. 26 after three days of struggling to break above the $40,000 resistance. The unexpected rally occurred a couple of hours after the <a href=\"https://cointelegraph.com/news/all-eyes-are-on-40k-bitcoin-price-leading-into-friday-s-4-5b-options-expiry\">$4.5 billion monthly BTC options expiry</a>, where the put (sell) instruments were poised to profit if the price at expiry remained below $40,000. Thus, one reason behind the recovery is the balanced outcome between Bitcoin call (buy) and put options in the Jan. 26 expiry.</p><p>Macroeconomic conditions improved after the U.S. Commerce Department’s personal consumption expenditures (PCE) price index rose by 2.9% per year in December 2023, excluding food and energy. The U.S. Federal Reserve (Fed) heavily relies on such inflationary data to decide on interest rates. The latest indicators signal higher odds of the Fed’s strategy to curb inflation without triggering a recession, as the U.S. gross domestic product (GDP) grew by 3.3% in the last quarter of 2023.</p><p><a href=\"https://www.cnbc.com/2024/01/26/pce-inflation-december-2023-.html\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to Andrew Hunter, deputy chief U.S. economist at Capital Economics:</p><p><a href=\"https://cointelegraph.com/news/why-is-bitcoin-price-up-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-26T21:30:47.000Z",
    "title": "Ethereum Foundation Reveals Finalized Dencun Upgrade Timeline",
    "url": "https://news.bitcoin.com/ethereum-foundation-reveals-finalized-dencun-upgrade-timeline/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/etherss45-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Ethereum Foundation Reveals Finalized Dencun Upgrade Timeline\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/etherss45-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/etherss45-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/etherss45-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/etherss45-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/etherss45-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/etherss45-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/etherss45.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a recent announcement by the Ethereum Foundation, the Ethereum blockchain network is set for a major enhancement through the introduction of Dencun. The foundation elaborated that Dencun is scheduled to launch on the Sepolia network at epoch 132,608 on Jan. 30, 2024, and will subsequently activate on the Holesky network at epoch 29,696 on [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T21:31:36.000Z",
    "title": "Ether options trading hits record high as bullish sentiment prevails",
    "url": "https://www.cryptopolitan.com/ether-options-trading-hits-record-high-as-bullish-sentiment-prevails/",
    "description": "In January, the trading volume of ether options on major cryptocurrency derivatives exchanges reached an unprecedented $17.9 billion, with several days remaining in the month. This surge in options trading activity reflects a prevailing bullish sentiment in the market, as indicated by the put-call skew and open interest data. Record-breaking volume According to The Block&#8217;s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T21:18:29.000Z",
    "title": "Brazil’s Jan 2024 inflation beats expert predictions – Will crypto help?",
    "url": "https://www.cryptopolitan.com/brazils-jan-2024-inflation-beats-predictions/",
    "description": "Brazil has witnessed a notable surge in its January 2024 inflation figures, surpassing the expectations set by financial experts. As the nation grapples with economic uncertainties, the question on everyone&#8217;s mind is whether cryptocurrencies can play a role in mitigating the impact of this unexpected inflationary spike. This unforeseen deviation from predictions has prompted a [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-26T21:27:07.000Z",
    "title": "Lido ($LDO) Maintains Bullish Momentum Amidst Cryptocurrency Market Volatility",
    "url": "https://nulltx.com/lido-ldo-maintains-bullish-momentum-amidst-cryptocurrency-market-volatility/",
    "description": "Amidst the struggle of Bitcoin (BTC) to maintain its position above $40,000 and Ethereum&#8217;s challenge around the $2200 mark, the overall sentiment in the cryptocurrency market leans towards bearishness. However, amidst this prevailing sentiment, Lido ($LDO) stands out as one of the altcoins exhibiting a slight bullish trend. In the [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-26T21:19:29.000Z",
    "title": "Controversy Surrounds SatoshiVM’s SAVM Cryptocurrency",
    "url": "https://nulltx.com/controversy-surrounds-satoshivms-savm-cryptocurrency/",
    "description": "SatoshiVM&#8217;s SAVM cryptocurrency, which made its much-anticipated debut on January 19, quickly found itself at the center of controversy. Following its launch, the protocol experienced a surge in value, boasting a market capitalization of approximately $90 million, as reported by DEXTool&#8217;s data. However, the excitement surrounding the SAVM token was [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-26T21:11:40.000Z",
    "title": "Bitcoin Wallet Liquidations Signal Capitulation Among Traders",
    "url": "https://nulltx.com/bitcoin-wallet-liquidations-signal-capitulation-among-traders/",
    "description": "Recent data indicates a notable decline in the total number of Bitcoin wallets, marking the swiftest rate since early October, just before the major crypto bull cycle began. Over the past four days, more than 487,000 wallets holding 1 $BTC or less have been liquidated. This reflects a 0.94% decrease [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-26T21:30:11.000Z",
    "title": "Ripple CTO Explains How AMM Feature Will Enable XRP Holders To Earn Passive Income",
    "url": "https://www.newsbtc.com/analysis/xrp/ripple-cto-amm-xrp-income/",
    "description": "The decentralized open-source blockchain, XRP Ledger, is set to introduce more innovative solutions to XRP holders through its new Automated Market Maker (AMM) feature. The XRP community is currently buzzing with excitement as the Chief Technology Officer (CTO) of Ripple, David Schwartz, unveils how the AMM offers a unique avenue for earning passive income. XRPL AMM To Empower XRP Holders In a recent X (formerly Twitter) post, Schwartz discussed the ways an XRPL AMM could provide opportunities for XRP holders to make regular income through the AMM’s distinct trading mechanism.  Related Reading: Bitcoin Whales Go On Buying Spree As Price Dips, Here’s How Much They Bought When asked by an XRP enthusiast about the potential risks of losing XRP investments if they participated in the AMM, Schwartz responded by stating that “it is not supposed to be possible to lose.” He clarified that the occurrence of losses would mean there was a flaw or unexpected bug in the implementation of the AMM.  The Ripple CTO provided details of how investors can make passive income through the AMM&#8217;s liquidity pools. He stated that when a user provides liquidity to an AMM by making a deposit to its pools, they will receive “liquidity tokens” specific to the AMM liquidity pool they deposited to.  Illustrating the strategy and mechanics behind the XRPL AMM, Schwartz revealed that the AMM works by permitting an increase in the value of a user’s liquidity token. He explained that this unique strategy was employed because it effectively converts volatility into a higher value for a token over a period of time.  While the prospect of generating passive income through the AMM exists, Schwartz emphasized that an AMM does not prevent or safeguard against a decline in the actual value of your position.  Expatiating his words with an example, Schwartz pointed out that if a user exchanged 1 XRP for $1 and after applying the AMM strategy the user received 1.05 XRP worth $1.05, then the strategy successfully increased the value of the XRP. However, if the price of XRP in dollars decreases, the overall value of your position may be lower.  Token price reaches $0.51 &#124; Source: XRPUSD on Tradingview.com Advantages And Disadvantages Of An AMM In a recent X post, co-founder of Anodos Finance, Panos Mekras, provided a comprehensive definition of an AMM and its impact on the XRPL ecosystem. Using an analogy, Mekras described an AMM as a self-operating store where the price of items is not fixed by a single entity but determined by the availability of the item.  Mekras revealed that when there is high demand for an item, active trades increase, and the AMM adjusts the price of items to reflect an inflated value. Conversely, if there is low demand, the AMM lowers the price of items to encourage trade. In essence, the AMM works by balancing the supply and demand system of an item.  Related Reading: Bitcoin Repayments: Mt Gox Starts Verifying Addresses For 200,000 BTC In Payouts Schwartz also emphasized the mechanics behind the XRPL AMM by listing out several advantages and disadvantages of the feature. According to the Ripple CTO, the benefits of the AMM include turning volatility into yield, increasing yield by providing people willing to pay a spread to trade and minimizing the risk of losing the value of your assets.  In contrast, the drawbacks of the XRPL AMM include the absence of a guaranteed yield, potential financial losses if the price of the token drops, exposure to counterparty risks, and susceptibility to potential bugs in the AMM’s implementation.  Featured image from Finbold, chart from Tradingview.com"
  }
]