[
  {
    "source": "NewsBTC",
    "date": "2023-08-18T01:10:49.000Z",
    "title": "LUNC Sheds 13% Of Its Value – A Further Retreat In The Offing?",
    "url": "https://www.newsbtc.com/all/lunc-sheds-13-of-its-value-a-further-retreat-in-the-offing/",
    "description": "Terra Luna Classic (LUNC) finds itself grappling with a significant setback as its price takes a sharp dive. Within the span of just 24 hours, the coin experienced a 13% decline in value.  The swift sell-off, which began on August 16, triggered a cascading effect that sent LUNC&#8217;s price plummeting from its recent peg of $0.00007734 to a new low of $0.00006512. While this may appear as a dramatic swing, it echoes the bearish sentiment that has persistently lingered around the coin throughout the past month. Related Reading: Chiliz (CHZ) Empowers Smart Contracts With Upgrades – Positive Impact On Price? LUNC Battles To Maintain Essential Support For a duration exceeding three weeks, LUNC&#8217;s price showcased resilience as it managed to keep itself above a crucial support zone resting at $0.000076. This period of relative stability served as a reflection of the overarching uncertainty pervading in the market.  However, with the breach of this monthly support threshold, experts caution that the existing selling pressure could magnify significantly. This breach also carries the potential to indicate a prolonged period of downward movement for the Terra classic coin. Beyond The Surface Scrutinizing the Luna Classic community on Twitter reveals a landscape marred by internal conflicts, particularly concerning the governance protocols. Recent days have witnessed heated debates revolving around the proposed implementation of the LUNC DAO validator, which would have assumed a prominent role in leading the chain. Unfortunately, this proposal met its end, and the aftermath was telling – a substantial sell-off unfolded.  This is undeniable proof that OX DAO (Formerly known as $LUNC Dao) is trying to take over #LUNC by dumping the price. pic.twitter.com/kqtDdwIxbr — Classy 🔮 (@ClassyCrypto_) August 15, 2023 Notably, Crypto Classy, a prominent LUNC validator, alleges that the sell-off was meticulously orchestrated by the LUNC DAO itself. The assertion is that the DAO orchestrated deliberate coin sales to incite panic within the investor community, ultimately facilitating coin repurchases at lower prices – a move perceived as an attempt to gain control over the network. Impact On Price Dynamics The repercussions of these recent events reverberate through LUNC&#8217;s price dynamics. As per CoinGecko&#8217;s data, the coin currently hovers around $0.00006770. A decline of 2.4% over the past 24 hours coupled with a substantial seven-day slump of 12.5% underscores the mounting strain that the coin is grappling with. Terra Luna Classic (LUNC) is currently trading at $0.00006703. Chart: TradingView.com As the LUNC community grapples with these internal struggles, governance challenges, and potential market manipulation, the future path remains uncertain. Related Reading: Cardano Holder Resilience Tested As ADA Fends Off Bearish Onslaught Investors and stakeholders are keeping a watchful eye on the evolving situation within the LUNC ecosystem, anticipating whether Terra Luna Classic can navigate these tumultuous waters and regain its footing while working to restore trust among its dedicated supporters. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Matthias Hangst/Getty"
  }
]