[
  {
    "source": "CoinDesk",
    "date": "2023-08-17T19:45:48.000Z",
    "title": "The Protocol: Blockchains Keep Launching, From Sei to Shibarium",
    "url": "https://www.coindesk.com/tech/2023/08/17/the-protocol-blockchains-keep-launching-from-sei-to-shibarium/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "In this week's issue, we cover Coinbase's launch of \"Base,\" a layer-2 network atop Ethereum, along with the crypto community's reaction to PayPal's new stablecoin and the brouhaha over Matter Labs' use of Polygon-crafted open-source software. The Protocol is CoinDesk's weekly newsletter devoted to blockchain and crypto technology."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-17T20:00:00.000Z",
    "title": "Tragedy or rug-pull? Inside the collapse of a ‘charitable’ NFT project",
    "url": "https://cointelegraph.com/news/hold-tragedy-or-rug-pull-inside-the-collapse-of-a-charitable-nft-project",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/190fe73f-9756-44c4-841f-4e9160930dbc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Orica NFT's charity efforts have succeeded, but its token holders have not, and up until now, its co-founder was nowhere to be found. </p>\n                    <p><p>Launched in November 2021, non-fungible token (NFT) marketplace Orica (ORI) held itself as an \"ethical platform\" benefitting artists, collectors, and charities alike. At the time, the organization was involved in prominent projects such as <a href=\"https://cointelegraph.com/news/funding-platform-orica-partners-with-ngo-to-use-nfts-to-build-a-school-in-uganda\">building a school in Uganda</a> to <a href=\"https://cointelegraph.com/news/3-embroidery-artists-weave-nft-charity-drop-to-help-victims-of-human-trafficking\">aiding victims of human trafficking</a>, to <a href=\"https://cointelegraph.com/news/crypto-community-rallies-with-ukraine-as-local-nft-artists-works-sell-out\">helping Ukraine</a>. </p><p>But less than two years later, the project’s founders have disappeared, and the marketplace’s user interface has gone offline. All that remains are the project's charity efforts, which proved to be genuine, in tandem with allegations from disgruntled users that the developers orchestrated a rug-pull. In a new revelation, co-founder Danial Zey breaks his year-long silence, not only denying all allegations and insisting the project was 'hacked,' but also claims that the project is still ongoing. Cointelegraph investigates. </p><h2>An ICO amidst the bear market</h2><p>According to initial coin offering (ICO) information site Cointotem, Orica <a href=\"https://cryptototem.com/orica-ori/\" target=\"_blank\" rel=\"noopener nofollow\">ran</a> a fundraiser from August 14 to September 14, 2021. It aimed to raise $3.1 million from the sale of its token, ORI. In its ICO, Orica promised to earmark 50% of the total supply of Ori for “NFT marketplace rewards.” 10% was supposed to be supplied to “advisors and partners,” 15% given to the team, and 25% sold to investors. At launch, the price of ORI rose to a peak of $3.638 per coin on August 21, 2021, then fell to $0.036 by October 1, 2022, based on data from Livecoinwatch. </p><p>The token no longer has tangible value at the time of publication, and its communication channels appear to have gone cold. A former user, who wished to remain anonymous, told Cointelegraph that \"[NFT] marketplace kind of dried out with not enough people using it and then very quickly everything went kind of offline including their website.\"</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/1794aeb3-8dd1-428c-a933-08906cc28dbe.png\"  /><figcaption style=\"text-align: center;\"><em>Ori price chart. Source: Livecoinwatch.</em></figcaption></figure><h2>The philanthropy that survived </h2><p>In late 2021, the firm partnered with Austrian charity project Bbanga to help build a school for children in Ssese Islands, Uganda. Bbanga commissioned German digital artist Mellowman to release Uganda-inspired digital art pieces as NFTs, which were then to be sold via Orica’s marketplace. The sale surpassed the $6,500 goal needed to construct the school.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/2b3e813a-0940-44d1-8b58-2e287e4c63b5.png\"  /><figcaption style=\"text-align: center;\"><em>Mellowmann &lt;&gt; Bbanga NFT sold at the Orica auction</em> | <em>Source: Orica</em></figcaption></figure><p>A former Orica staff member, who wished to remain anonymous, told Cointelegraph that \"the Uganda school received full payment as this was overseen by Sani, Founder of the Bbanga Project, who was working with Orica at the time.\" The project <a href=\"https://www.youtube.com/watch?v=TyZTBv635HE\" target=\"_blank\" rel=\"noopener nofollow\">released</a> a video this June showcasing that some of the school's buildings have already been built, including a main hall and library.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/029c9584-8a46-404f-a6a6-d10048c1503a.png\"  /><figcaption style=\"text-align: center;\"><em>The Orica &lt;&gt; Bbanga school in Uganda</em> | <em>Source: Bbanga</em></figcaption></figure><p>On December 21, 2021, charity group Hope for the Future also announced that it <a href=\"https://cointelegraph.com/news/3-embroidery-artists-weave-nft-charity-drop-to-help-victims-of-human-trafficking\">would be selling NFTs on Orica</a> to fund its efforts. Hope for the Future is another Austrian-based non-profit that helps victims of human trafficking reintegrate into society after they are rescued from captivity. The charity <a href=\"https://www.hopeforthefuture.at/en/about-us/\" target=\"_blank\" rel=\"noopener nofollow\">continues</a> to operate today. Its efforts to help Ukrainian artists also materialized in the REFUGE campaign that ran in March 2022. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/90f7f180-d05d-41e5-8250-9ab9c847d422.png\"  /><figcaption style=\"text-align: center;\"><em>An embroidery NFT \"Obra\" previously held for sale on Orica</em> | <em>Source: Aline Brant</em></figcaption></figure><p>When prompted on the matter, the former Orica staff member said, \"All artists were paid in full.\" An amount close to $30,000 was raised in conjunction with Orica's efforts to help Ukraine and processed by crypto donations processor The Giving Block. In one of the last statements before going cold, Zey wrote: \"We donated 10% of the amount we ever made. Our main product is tech that is built to give to people.\"</p><h2>And the project that didn't...</h2><p>Despite official claims as to why the project went down, blockchain data and user complaints suggest irregularities. </p><p>On May 11, 2022, the Polygon version of Orica was <a href=\"https://polygonscan.com/tx/0xe9a85a2fd37154992ae2f3daa6c9cccd5ac7bcc101b2a9ebbb4505b31038cc30\" target=\"_blank\" rel=\"noopener nofollow\">deployed</a> as part of its migration from BNB Chain. This version had a total supply of just 84 million tokens, 16 million less than the original Orica token on BNB Chain. The Polygon version of ORI was a “liquidity generator” token with built-in liquidity provider and swap functions. It had the ability to call contracts on the decentralized exchange, Quickswap, which is a fork of Uniswap V2 on Polygon. </p><p>On June 4, 2022, an Orica Discord server admin who goes by the name “Plem” told users the migration was complete. According to Plem, users had received tokens on the new chain equal to the ones they held on the previous chain.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/b871c270-189d-425c-85b1-705cbb8c072f.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Orica announcing the Polygon migration </em>|<em> Source: Discord</em></figcaption></figure><p>Some users complained that they had not received their tokens. In response, the admin told them to add the new token contract in Metamask. If they did this and still did not see their tokens, they were asked to submit a support ticket. </p><p>But the deployer on Polygon did not directly send tokens to users who held ORI on BNB. Instead, it transferred ownership to a separate account, which proceeded to sell nearly the entire supply of the coin through market-making operations. Zey stated that this second account was not operated by him. Instead, he claimed that a “hacker” stole his deployer key and transferred it. The new owner proceeded to call various liquidity-provider and swap functions over the next two months on Quickswap.</p><p>Zey did not report this attack until August 11, 2022, exactly one month after it had occurred. A member of the team had reported 24 days after the “attack” that the migration had been completed. The same day, the new owner <a href=\"https://polygonscan.com/tx/0x476b3abd94527b1144c05519ae004a25d42175d48da5bbe57dd4047ab7cb630e\" target=\"_blank\" rel=\"noopener nofollow\">transferred</a> an unusually large amount of tokens, 23,187,983, to address 0x14dd44e1d3f9a173998c53d75622127ce921ccee. After this transaction, the new owner continued to post liquidity provider transactions for ORI tokens until they stopped on September 11, 202. In a similar August 11, 2022 Telegram message, Zey claimed that his laptop had been hacked and that tokens had been “moved out directly from the deployer.”</p><p>On August 12, 2022, Plem announced that the project would be “closing communications” due to a “hard situation that involves massive uncontrollable tokens deployment and selling process.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/bf39488f-4df6-4c07-865c-e859368fdecd.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Orica staff stating that they would cease communications</em></figcaption></figure><p>In the final message, users were told to send direct messages to Zey if they had questions, referring to the team’s blockchain operations lead. Subsequent messages to the group indicate that Zey has blocked all messages.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/d274af0b-22b0-4608-acba-225cc6c8ea7c.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Orica's last message before going dark on Discord</em></figcaption></figure><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/84a49f8d-4a29-431b-9b5a-96ef0f0ef5a7.png\"  /><figcaption style=\"text-align: center;\"><em>Co-founder Danial's response to a user inquiry before new messages before the channel was archived</em> | <em>Source: Telegram</em></figcaption></figure><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/newly-discovered-bitcoin-wallet-loophole-let-hackers-steal-funds-slow-mist\"><strong>Newly discovered Bitcoin wallet loophole let hackers steal $900K — SlowMist</strong></a></p><p>On September 11, 2022, the new owner made a final transfer of approximately 150 MATIC ($133.10 at the time) to address 0xfE3fB1d3C9FBF50b6af3A60b5D070dF68D87b99e. This account had previously received 3,463 MATIC ($3,082 at the time) from the new owner. At the time of publication, 9.9 million ORI ($4,341 at today’s price) remains in the account that was transferred ownership after deployment. </p><h2>Co-founder's new revelations </h2><p>Speaking to Cointelegraph on August 17, 2023, Zey denied the rug-pull allegations, stating: </p><blockquote>\"I think the situation is complex and it is not wise to give out info that we might need to win some of the funds back. About the part with rug pull. We had a team of more than 15 people and we paid them until the end salaries plus we paid for the liquidity , Certik audit and some parts of the development.\"</blockquote><p>\"Our tokens were locked,\" said Zey. \"On the blockchain it is also provable that we had several severe attacks on us. We are a charity project but still got hacked,\" he stated while alleging that hacked funds were laundered through cryptocurrency mixer Tornado Cash, making it impossible to trace. \"The few remaining people that worked without any salary like myself are still in this project working patiently behind the scenes but the comeback has to be strong so we can make up for the situation,\" Zey claims. </p><p>Zey did not respond to a request for the hash ID of transactions linked to the alleged Orica hack. </p><p>Out of 12 team members listed in the project’s ICO, five have deleted their LinkedIn profiles, including Zey, legal counsel Ivan, process manager Karim, IT project manager Pouriya, and business development manager Rilwan. The others, save for Zey, were either unreachable or had left Orica by the time of its breakdown. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/82398e58-490a-4004-98fc-af72693651e3.png\"  /><figcaption style=\"text-align: center;\"><em>The Orica founding team became unreachable after last year</em> | <em>Source: Crypto Totem</em></figcaption></figure><h2>A mixed legacy </h2><p>As of today, most of what remains of Orica is in the brick and stone of a school in Uganda, and the artists it had helped.</p><p>But also remaining are the token holders who never received a proper explanation as to why the project had ceased to exist. Despite breaking his silence, Zey never addressed the reasons for the hiatus, and many questions remain unanswered. </p><p>It's not to uncommon to see that investors and co-founders alike build rapport around a project as friends, and exit as enemies during its collapse. But for Orica, there was at least a brief moment in which everything seemed to have worked well.</p><p><em>Cointelegraph editor <a href=\"https://cointelegraph.com/authors/zhiyuan-sun\">Zhiyuan Sun</a> contributed to this story. </em></p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/crypto-developer-commits-2m-rug-pull-fraud-to-fuel-gambling-addiction\"><strong>Crypto developer commits $2M rug pull fraud to fuel gambling addiction</strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-17T20:00:00.000Z",
    "title": "SpaceX sold $373M worth of Bitcoin acquired in 2021-2022: Report",
    "url": "https://cointelegraph.com/news/spacex-sold-bitcoin-acquired-2021-2022-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/396fcc2c-0f4c-4e21-b9ed-7c28841aaccf.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Elon Musk announced in 2021 that SpaceX had some Bitcoin holdings following an SEC filing showing Tesla planned to purchase $1.5 billion worth of the cryptocurrency.</p>\n                    <p><p>Aerospace technology firm SpaceX reportedly sold roughly $373 million worth of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) it acquired starting in 2021.</p><p>According to an Aug. 17 report in the Wall Street Journal, SpaceX <a href=\"https://www.wsj.com/tech/behind-the-curtain-of-elon-musks-secretive-spacex-revenue-growth-and-rising-costs-2c828e2b\" target=\"_blank\" rel=\"noopener nofollow\">recorded</a> $373 million worth of Bitcoin holdings on its balance sheet in 2021 and 2022, but has since sold the crypto asset. The news outlet reportedly viewed documents on the firm’s financials showing roughly $5.2 billion in total expenses for 2022, and $5.4 billion in 2021 and 2022 for acquiring property and equipment in addition to research and development costs.</p><p>SpaceX CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/elon-musk-and-crypto-twitter\">Elon Musk</a> publicly announced in 2021 that the firm had acquired a certain amount of Bitcoin. This followed a U.S. Securities and Exchange Commission filing showing Tesla — another company co-founded by Musk — planned to purchase $1.5 billion worth of the crypto asset. The announcement likely contributed to BTC hitting a then all-time high price of more than $43,000.</p><p>According to Tesla's Q2 2023 earnings report, the firm had <a href=\"https://cointelegraph.com/news/tesla-bitcoin-holdings-no-change-in-second-quarter\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/tesla-bitcoin-holdings-no-change-in-second-quarter/amp\">sold all but $184 million</a> worth of its Bitcoin holdings. Tesla reported it had liquidated more than 30,000 BTC in the second quarter of 2022 for $936 million — roughly 75% of its $1.5-billion BTC original holdings. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ex-twitter-executive-reveals-elon-musk-secrets\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ex-twitter-executive-reveals-elon-musk-secrets/amp\"><strong><em>Elon’s ‘not afraid of blowing things up’ — ex-Twitter exec on working under Musk</em></strong></a></p><p>Musk, one of the richest people in the world, has often taken to social media to comment on certain cryptocurrencies including Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) and Bitcoin, even <a href=\"https://cointelegraph.com/news/elon-musk-changes-twitter-icon-to-doge-after-seeking-lawsuit-dismissal\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/elon-musk-changes-twitter-icon-to-doge-after-seeking-lawsuit-dismissal/amp\">briefly changing Twitter's then blue bird logo</a> to the DOGE Shiba Inu. Since his $44-billion purchase of Twitter — later rebranded to X — in October 2022, he has <a href=\"https://cointelegraph.com/news/elon-musk-says-x-will-offer-an-entire-financial-world-in-the-coming-months\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/elon-musk-says-x-will-offer-an-entire-financial-world-in-the-coming-months/amp\">suggested the platform</a> could offer an ”entire financial world” including banking and payment services.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Doges ftw <a href=\"https://t.co/bl0trQ7BdU\">pic.twitter.com/bl0trQ7BdU</a></p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1681691639922806784?ref_src=twsrc%5Etfw\">July 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The timing of SpaceX’s reported Bitcoin sale is unclear, but the crypto market experienced a significant crash in 2022 amid the collapse of major firms including Terraform Labs. Many technology firms and financial institutions <a href=\"https://cointelegraph.com/news/us-bank-170-million-crypto-q2-earnings-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-bank-170-million-crypto-q2-earnings-report/amp\">continue to hold Bitcoin</a> and other cryptocurrencies.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-og-simon-dixon-bankruptcies-elon-musk-crypto-twitter-hall-of-flame/\"><strong><em>Simon Dixon on bankruptcies, Celsius and Elon Musk: Crypto Twitter Hall of Flame</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-17T19:50:48.000Z",
    "title": "Tether stops minting USDT on three blockchains, including Bitcoin’s Omni Layer",
    "url": "https://cryptoslate.com/tether-stops-minting-usdt-on-three-blockchains-including-bitcoins-omni-layer/",
    "description": "<p>On Aug. 17, leading stablecoin firm Tether announced its decision to discontinue support for its USDT stablecoin on three blockchains and blockchain layers: the Omni Layer, Kusama, and Bitcoin Cash SLP implementations of its USDT stablecoin. Tether emphasized the significance of its decision to end support for Omni, which is the Bitcoin-based network on which [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/tether-stops-minting-usdt-on-three-blockchains-including-bitcoins-omni-layer/\">Tether stops minting USDT on three blockchains, including Bitcoin&#8217;s Omni Layer</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-17T20:08:05.000Z",
    "title": "Will Arbitrum Prices Dump on March 16, 2024 Due to Upcoming $1B Token Unlock?",
    "url": "https://cryptobriefing.com/arbitrum-unlocking-1b-tokens/?utm_source=feed&utm_medium=rss",
    "description": "Arbitrum is expected to unlock over $1.24 billion worth of ARB token to reward its team and investors on March 16, 2024."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-17T20:00:13.000Z",
    "title": "Bybit Announces ‘Imminent’ Listing of Paypal’s PYUSD Stablecoin",
    "url": "https://news.bitcoin.com/bybit-announces-imminent-listing-of-paypals-pyusd-stablecoin/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/xcpyusd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/xcpyusd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/xcpyusd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/xcpyusd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/xcpyusd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/xcpyusd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/xcpyusd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/xcpyusd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to the crypto exchange Bybit, the trading platform plans to list Paypal&#8217;s stablecoin soon. Amid Bybit&#8217;s announcement, Paypal&#8217;s PYUSD token has seen little movement as most of the supply is held by the contract and the Paxos Treasury. Dubai-Based Bybit Prepares to List Paypal&#8217;s New Stablecoin, PYUSD On Thursday, August 17, 2023, the Dubai-based [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T20:02:13.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and platform they need to build blockchain solutions. At this time, we can only make educated guesses about ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T19:50:05.000Z",
    "title": "Putin talks Iran’s BRICS entry in call with Iranian leaders",
    "url": "https://www.cryptopolitan.com/putin-talks-irans-brics-entry-in-call/",
    "description": "In a move that has captured global attention, Russian President Vladimir Putin broached the topic of Iran&#8217;s potential entry into the influential BRICS consortium during a call with Iran&#8217;s leader. This discussion comes as BRICS, an alliance of burgeoning economies, contemplates its expansion, marking a significant moment in the geopolitical theater. A Pivotal Exchange: Putin ... <a title=\"Putin talks Iran&#8217;s BRICS entry in call with Iranian leaders\" class=\"read-more\" href=\"https://www.cryptopolitan.com/putin-talks-irans-brics-entry-in-call/\" aria-label=\"More on Putin talks Iran&#8217;s BRICS entry in call with Iranian leaders\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T19:42:48.000Z",
    "title": "Federal Reserve takes enforcement action against FTX-linked Farmington State Bank over stablecoin dealings",
    "url": "https://www.cryptopolitan.com/federal-reserve-enforcement-farmington-state-bank/",
    "description": "The Federal Reserve has announced an enforcement action against Farmington State Bank, alleging that it improperly changed its business plan without informing the Fed. The action centers around Farmington&#8217;s involvement in designing IT infrastructure to facilitate the issuance of stablecoins. Allegations of improper business plan changes: A look at the Fed Reserve claims According to ... <a title=\"Federal Reserve takes enforcement action against FTX-linked Farmington State Bank over stablecoin dealings\" class=\"read-more\" href=\"https://www.cryptopolitan.com/federal-reserve-enforcement-farmington-state-bank/\" aria-label=\"More on Federal Reserve takes enforcement action against FTX-linked Farmington State Bank over stablecoin dealings\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T19:41:21.000Z",
    "title": "Why is Bitcoin down today? BTC trades below $28K",
    "url": "https://www.cryptopolitan.com/why-is-bitcoin-down-today-btc-below-28k/",
    "description": "Bitcoin closed below $29,000 for the first time in 56 days on August 16. As the likely cause, analysts immediately pointed to this week&#8217;s FOMC minutes, which expressed concerns about inflation and the need to raise interest rates. Despite the immediate causes of the decline, Friday&#8217;s expiration of Bitcoin options worth $580 million has favored ... <a title=\"Why is Bitcoin down today? BTC trades below $28K\" class=\"read-more\" href=\"https://www.cryptopolitan.com/why-is-bitcoin-down-today-btc-below-28k/\" aria-label=\"More on Why is Bitcoin down today? BTC trades below $28K\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-17T19:54:17.000Z",
    "title": "US BlockFi clients free to withdraw funds after court order",
    "url": "https://crypto.news/us-blockfi-clients-free-to-withdraw-funds-after-court-order/",
    "description": "US-based who were unable to withdraw from BlockFi can now access their accounts after a directive by a Bankruptcy Court on Aug. 16"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-17T20:00:29.000Z",
    "title": "Bitcoin Faces A Weekly Double Top; This Needs To Happen",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-faces-weekly-double-top-this-needs-happen/",
    "description": "In a recent analysis of the Bitcoin price, seasoned crypto analyst Rekt Capital discussed the looming presence of a potential double top formation on the weekly chart. The scenario paints a picture of impending volatility, with both bullish and bearish narratives emerging from this often foreboding pattern. &#8220;The BTC Double Top still remains intact,&#8221; tweeted Rekt Capital, emphasizing the technical structure&#8217;s significance. He continues, &#8220;Weekly Bearish Divergence lends additional bearish confluence to this structure as well. More, the bear div is developing a new lower high (dotted green) relative to its primary downtrend (solid green).&#8221; However, BTC would need to drop an additional -9% to -13% from current prices to complete its potential double top. But what makes this analysis particularly intriguing is the current state of Bitcoin&#8217;s volume. Rekt Capital further observes, &#8220;What&#8217;s interesting about the volume behind BTC&#8217;s price action is that the two recent peaks formed on inclining volume while the RSI formed lower highs.&#8221; For many, this simultaneous increase in volume with descending RSI hints at underlying market weakness, an insight further supported by the subsequent declining volume after the local top at approximately $31,000. Related Reading: Early Signs Of Life: Why Bitcoin Is Likely To Move Away From $30,000 Soon Diving deeper in his video analysis, Rekt Capital highlighted the need for a distinct &#8220;M&#8221;-shaped formation, a hallmark of the double top pattern. &#8220;For Bitcoin to form a double top here, we have to see an &#8216;M&#8217;-shaped formation take place. When we see a M form, that&#8217;s essentially a double top. One top here [at $30,800] and one top here [at $31,300].&#8221; Losing pivotal support levels could invite substantial downward movement. &#8220;Losing this [neckline] level at $26,000 as support would enable further downside,&#8221; warns the analyst. However, for traders and investors hoping for symmetrical behavior, Rekt Capital speculates, &#8220;And if we see symmetry here, a three month second part of this M could form so that&#8217;s going to prompt further downside and just slow bleeding into that 90 day-mark which would be around next month.&#8221; Related Reading: SEC Approval Could Propel Bitcoin To New Heights: Analyst Forecasts $150,000 Clearing Price But not all is bleak. Should Bitcoin trace back to $24,000, a retracement would &#8220;see us retest the neckline of this inverse head &#38; shoulders that we saw break out.&#8221; Rekt Capital adds, &#8220;So a retest of this level as a new support should actually enable further upside.&#8221; Also, a look at the 1-week chart also shows that there is another scenario for the invalidation of the double top. Bitcoin has formed an ascending trendline from its low in early January. Provided BTC can hold this trendline on a weekly basis and bounce up from there (at around $28,200), an invalidation would take place. The symmetry of the M would be broken, the uptrend on the higher time frames could continue. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-17T20:00:41.000Z",
    "title": "Analyst Issues Bitcoin Warning, Says Crypto Could Face ‘Soul Crushing’ Plunge – Here’s Why",
    "url": "https://dailyhodl.com/2023/08/17/analyst-issues-bitcoin-warning-says-crypto-could-face-soul-crushing-plunge-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Says-BTC-Could-Face.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Says-BTC-Could-Face.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Says-BTC-Could-Face.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Says-BTC-Could-Face.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Says-BTC-Could-Face.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Says-BTC-Could-Face.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Says-BTC-Could-Face.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader just issued a warning to Bitcoin (BTC) bulls as the flagship crypto asset remains below a key resistance level. Pseudonymous analyst Bluntz tells his 224,000 followers on the social media platform X that Bitcoin could undergo a steep correction in a similar manner to four years ago when BTC pulled [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/17/analyst-issues-bitcoin-warning-says-crypto-could-face-soul-crushing-plunge-heres-why/\">Analyst Issues Bitcoin Warning, Says Crypto Could Face ‘Soul Crushing’ Plunge – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-17T19:55:08.000Z",
    "title": "Crypto Analyst Sees Positive News for Bitcoin (BTC) Traders Despite Market-Wide Drop",
    "url": "https://dailyhodl.com/2023/08/17/crypto-analyst-sees-positive-news-for-bitcoin-btc-traders-despite-market-wide-drop/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/downturns-massive-positive.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/downturns-massive-positive.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/downturns-massive-positive.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/downturns-massive-positive.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/downturns-massive-positive.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/downturns-massive-positive.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/downturns-massive-positive.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader is maintaining a positive sentiment on Bitcoin (BTC) despite the king crypto being down 3.6% in the last 24 hours. Amid the market-wide crypto price drop, trader Michaël van de Poppe tells his 663,200 X followers that the next few days will be telling for BTC. &#8220;Below $29,700 is no party for [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/17/crypto-analyst-sees-positive-news-for-bitcoin-btc-traders-despite-market-wide-drop/\">Crypto Analyst Sees Positive News for Bitcoin (BTC) Traders Despite Market-Wide Drop</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]