[
  {
    "source": "CryptoSlate",
    "date": "2023-06-23T17:52:57.000Z",
    "title": "MakerDAO-powered lending platform Spark Protocol onboards Rocket Pool staked ETH as collateral option",
    "url": "https://cryptoslate.com/makerdao-powered-lending-platform-spark-protocol-onboards-rocket-pool-staked-eth-as-collateral-option/",
    "description": "<p>MakerDAO (MKR) has announced that Spark Protocol is onboarding Rocket Pool&#8217;s staked Ethereum (rETH) as a new collateral type, creating increased opportunities for users to leverage their digital assets in the DeFi ecosystem. Expanding the lending ecosystem Founded in 2015, MakerDAO is best known for issuing the decentralized stablecoin, DAI. The latest development in its [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/makerdao-powered-lending-platform-spark-protocol-onboards-rocket-pool-staked-eth-as-collateral-option/\">MakerDAO-powered lending platform Spark Protocol onboards Rocket Pool staked ETH as collateral option</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-23T18:00:00.000Z",
    "title": "USDT freezes $4.1m in Ethereum addresses: Is decentralization the way forward over centralization?",
    "url": "https://cryptodaily.co.uk/2023/06/usdt-freezes-41m-in-ethereum-addresses-is-decentralization-the-way-forward-over-centralization",
    "description": "<p>Tether Holdings Limited, the issuer of the world's largest stablecoin, USDT, has recently frozen an account with over $4.1 million, as shown by on-chain explorers. This once again raises the question of whether centralization, with its concentration of power, is the ideal path forward or if decentralized projects like Tradecurve are essential for the survival of the DeFi ecosystem.</p>\n<p>&gt;&gt;BUY TCRV TOKENS NOW&lt;&lt;</p>\nNo explanation for $4.1 million freeze of USDT\n<p>On June 19th, Tether froze $4.11 million of USDT without providing any further comment on the action. The analytics platform Etherscan marks the USDT wallet as frozen.&nbsp;</p>\n<p>A Reddit user traced the frozen account back to a Huobi user, and on-chain data indicates that the USDT was funneled into the wallet in March 2023. There is ongoing speculation that the owner of the account may be involved in illegal activities, which appears to have prompted Tether to actively freeze the holdings in the address.</p>\n<p>Tether Holdings Limited acts as a centralized entity and manages over $83.1 billion worth of USDT in circulating supply. Each USDT token on any blockchain is issued and backed 1:1 with cash or cash equivalents.&nbsp;</p>\n<p></p>\n<p>Tether and USDT play an essential role in the cryptocurrency market but face concerns regarding centralization, which are further highlighted by the issuer's ability to freeze assets. This stands in contrast to the core principles of blockchain technology, which is inherently borderless and decentralized.</p>\n<p>Critics on social media are raising their voices, pointing out that Tether Holdings Limited behaves like a bank by freezing the address. A Reddit user highlighted the fact that Tether has integrated a \"kill switch\" in the token's code that can potentially be triggered at any point to block an address. This carries a certain risk for the overall market and the financial system.&nbsp;</p>\n<p>As the cryptocurrency industry continues to expand and evolve, it remains to be seen to what extent USDT can achieve decentralization in its final state.</p>\n<p>On the other hand, Tradecurve aims to revolutionize the trading industry by offering a decentralized hybrid exchange.</p>\n<p></p>\nTradecurve.io: Decentralized trading\n<p>Tradecurve represents the next step in decentralized trading. By combining the worlds of decentralized and centralized exchanges, it provides access to thousands of financial instruments across multiple international markets. Users can leverage their cryptocurrency to trade commodities, stocks, forex, cryptocurrencies, and more.</p>\n<p>Tradecurve users enjoy complete anonymity without the need for KYC procedures, making trading accessible to everyone and facilitating easy onboarding to a wide range of markets and instruments. Tradecurve offers various advantages, such as AI-driven algorithmic trading, 500:1 leverage, a VIP account service for whales, copy trading, and a Metaverse Trading Academy, which provides all the necessary materials for self-education.</p>\n<p>The TCRV token is currently priced at $0.018 in the 4th stage of the official presale, and analysts predict a 100x return when the presale ends.</p>\n<p>For more information about $TCRV presale tokens:</p>\n<p>Website: https://tradecurve.io/&nbsp;</p>\n<p>Buy presale: https://app.tradecurve.io/sign-up&nbsp;</p>\n<p>Twitter: https://twitter.com/Tradecurveapp&nbsp;</p>\n<p>Telegram: https://t.me/tradecurve_official&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T18:05:10.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T17:56:33.000Z",
    "title": "Lawyer makes urgent plea to reopen $4 billion Onecoin investigation",
    "url": "https://www.cryptopolitan.com/lawyer-plea-to-reopen-4-b-onecoin-case/",
    "description": "Onecoin victims&#8217; lawyer, Dr. Jonathan Levy, is urging Bulgarian authorities to reopen an inquiry into the fraudulent $4 billion crypto scheme and recover assets to compensate his clients. The lawyer has asked Sofia officials to consider the latest developments in the case, including a murder that happened recently in South Africa involving a Bulgarian crime ... <a title=\"Lawyer makes urgent plea to reopen $4 billion Onecoin investigation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/lawyer-plea-to-reopen-4-b-onecoin-case/\" aria-label=\"More on Lawyer makes urgent plea to reopen $4 billion Onecoin investigation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T17:44:24.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? Today’s Aave price today is $57.06, with a 24-hour trading volume of $33,510,445. Aave is up 2.29% in the last 24 hours. The current CoinMarketCap ranking is #48, with a live market cap of $823,779,295. It has a circulating supply of 14,436,496 AAVE coins and ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-23T17:53:08.000Z",
    "title": "Binance ordered by Belgian regulator to suspend crypto services",
    "url": "https://crypto.news/binance-ordered-by-belgian-regulator-to-suspend-crypto-services/",
    "description": "According to Belgium's Financial Services and Markets Authority, Binance, the largest cryptocurrency exchange globally, has been found to provide services from non-European economic area countries."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-23T18:00:59.000Z",
    "title": "MATIC Price Recovery Hits Roadblock, When Will Bulls Break Through?",
    "url": "https://www.newsbtc.com/matic/matic-price-recovery-hits-roadblock-when-will-bulls-break-through/",
    "description": "The MATIC price recovery has faced a hurdle in recent trading sessions, despite its impressive rebound after surpassing the $0.50 level. Although the altcoin experienced a notable 18% appreciation on the weekly chart, it lost 3% of its market value within the past 24 hours. The overall sentiment remains bearish as demand and accumulation for MATIC have remained low. While buying strength attempted to recover, it has not fully aligned with investor expectations. To reignite demand in the market, the altcoin must overcome immediate resistance levels. Surpassing these resistance levels will be key for the altcoin to rally and overcome significant barriers. The decline in MATIC market capitalization indicates a decrease in buying strength. Related Reading: Breaking Through This Ceiling Will Propel XRP By Another 12% MATIC Price Analysis: One-Day Chart At the time of writing, MATIC was valued at $0.66. The coin faced resistance at $0.68, but surpassing this level could potentially drive the price toward $0.73. With further potential MATIC may reach $0.77. However, breaching the $0.73 resistance is expected to be challenging for MATIC. Conversely, if buyers fail to emerge in the upcoming trading sessions, the coin may continue to decline. MATIC may move towards its local support level of $0.59, and with a further push downward, the altcoin may trade near $0.57. The recent session&#8217;s trading volume for MATIC also decreased, indicating that sellers had control over the price. This joins in to paint a very bearish outlook for the coin. Technical Analysis Despite a slight recovery in buying strength, the altcoin&#8217;s uptick may not be sustained unless it moves above the $0.68 level. The Relative Strength Index (RSI) experienced a marginal increase but remained below the half-line, indicating a prevailing dominance of selling pressure. Additionally, the asset&#8217;s price fell below the 20-Simple Moving Average (SMA) line, reflecting weak demand and suggesting that sellers are currently driving the market&#8217;s price momentum. Positive signs are, however, emerging for MATIC on its daily chart, indicating a potential bullish trend. The formation of buy signals suggests an increase in buying interest, but for this trend to be sustained, continued growth in demand is necessary. The Moving Average Convergence Divergence (MACD), which tracks price momentum and reversals, has shown green histograms tied to buy signals on the chart. However, the Chaikin Money Flow indicator remains below the half-line, indicating a lower inflow of capital compared to the outflow. Related Reading: Bitcoin Investor Sentiment Suggests BTC Rally Is Far From Over With consistent growth in demand though, even if by slow buildup, the altcoin has the potential to overcome immediate hurdles and achieve further gains. However, if the price remains at its current level, there is a possibility of another dip. Featured Image From UnSplash, Charts From TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T18:00:14.000Z",
    "title": "This AI Crypto Gem has a Symbiotic Relationship with Binance Coin, Ethereum, and Solana Blockchains",
    "url": "https://www.crypto-news-flash.com/this-ai-crypto-gem-has-a-symbiotic-relationship-with-binance-coin-ethereum-and-solana-blockchains/?utm_source=rss&utm_medium=rss&utm_campaign=this-ai-crypto-gem-has-a-symbiotic-relationship-with-binance-coin-ethereum-and-solana-blockchains",
    "description": "Binance Coin, Ethereum, and Solana are among the most popular cryptocurrency blockchains in the virtual space. These three projects offer great utility through improved ledger networks that provide faster transactions, cheaper gas fees as well as massive scalability compared to the Bitcoin Network.  While these projects have played a significant role in the pioneering and [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-23T18:05:57.000Z",
    "title": "JPMorgan Unveils Euro Blockchain Payments, Processes $300,000,000,000+ Worth of Transactions in Days: Report",
    "url": "https://dailyhodl.com/2023/06/23/jpmorgan-unveils-euro-blockchain-payments-processes-300000000000-worth-of-transactions-in-days-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/jpmorgan-considers-blockchain.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/jpmorgan-considers-blockchain.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/jpmorgan-considers-blockchain.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/jpmorgan-considers-blockchain.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/jpmorgan-considers-blockchain.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/jpmorgan-considers-blockchain.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/jpmorgan-considers-blockchain.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>American multinational investment banking giant JPMorgan launched euro blockchain transactions with JPM Coin this week and saw massive activity in its first days alone. On Wednesday, JPM Coin, which first launched in 2019, went live with euro transactions, processing over $300 billion worth in just a couple of days, according to a Bloomberg report. JPM [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/23/jpmorgan-unveils-euro-blockchain-payments-processes-300000000000-worth-of-transactions-in-days-report/\">JPMorgan Unveils Euro Blockchain Payments, Processes $300,000,000,000+ Worth of Transactions in Days: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]