[
  {
    "source": "CoinDesk",
    "date": "2024-01-10T04:32:24.000Z",
    "title": "Hacker Seized SEC Phone Number to Post Fake Bitcoin ETF Approval, X Says",
    "url": "https://www.coindesk.com/policy/2024/01/10/hacker-seized-sec-phone-number-to-post-fake-bitcoin-etf-approval-x-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Securities and Exchange Commission (SEC) did not employ basic security measures on its X (formerly Twitter) account when it was \"compromised\" to spread false bitcoin ETF news, according to the social media company."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-10T04:12:53.000Z",
    "title": " Celsius files intent to claw back certain pre-bankruptcy withdrawals ",
    "url": "https://cointelegraph.com/news/celsius-files-intent-claw-back-pre-bankruptcy-withdrawals-creditors",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMjczMGQzZjAtYjk0OC00NjZiLWE0MzgtYzM5ZDdmNmZlMDE3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The embattled crypto lender has filed an intent to claw back funds from those who withdrew $100,000 or more in the three months before it declared bankruptcy. </p>\n                    <p><p>Creditors of the bankrupt crypto lender Celsius that withdrew large sums from the platform before it declared bankruptcy may be required to return part of those funds or face legal action. </p><p>On Jan. 9, Celsius bankruptcy administrators <a href=\"https://cases.stretto.com/public/x191/11749/PLEADINGS/1174901092480000000030.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> an intent to notify its creditors that account holders who withdrew more than $100,000 in the 90 days before the date the company declared bankruptcy — <a href=\"https://cointelegraph.com/news/breaking-celsius-is-reportedly-filing-for-bankruptcy-imminently\">July 13, 2022</a> — may be required to return them.</p><p>The filing stated that account holders with “withdrawal preference exposure” over $100,000 who are not excluded parties, did not vote to reject the reorganization plan, and did not opt out of releases can settle their liability by paying 27.5% of the funds by Jan. 31, 2024.</p><p><a href=\"https://cointelegraph.com/news/celsius-files-intent-claw-back-pre-bankruptcy-withdrawals-creditors\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-10T04:18:34.000Z",
    "title": "iFX EXPO Dubai 2024 is Right Around the Corner",
    "url": "https://www.cryptopolitan.com/ifx-expo-dubai-2024-is-right-around-the-corner/",
    "description": "MENA’s biggest event of the year will be taking place next week in Dubai! The buzz and anticipation surrounding the iFX EXPO Dubai 2024 continues to build, with the largest online trading expo in the MENA region taking place next week! The landmark event will be taking place on January 16-18 at the Dubai World [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-10T04:16:18.000Z",
    "title": "2024 Crypto Price Predictions: Expert Forecasts You Need to Act On",
    "url": "https://www.cryptopolitan.com/2024-crypto-price-predictions-expert-forecasts-you-need-to-act-on/",
    "description": "As the next Bitcoin halving looms large in 2024, analysts believe we are in the middle of a pre-halving rally driven by retail and institutional investors looking to cash in on the buzz. After the halving occurs, a reaccumulation phase has historically kicked in, characterized by investor restlessness and impulsivity. This climaxes in a parabolic [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-10T04:15:41.000Z",
    "title": "OpenAI GPT Store Sparks Concern as Copycat Apps Surface Ahead of Launch",
    "url": "https://www.cryptopolitan.com/openai-gpt-store-copycat-apps-surface/",
    "description": "With the highly anticipated OpenAI GPT Store on the horizon, poised to become the go-to marketplace for generative chatbots, concerns are arising even before its official launch. Developers are sounding the alarm as copycat apps begin to emerge, mirroring the early challenges faced by the Apple App Store in 2008. Rebecca Nagel, VP of AI [&#8230;]"
  }
]