[
  {
    "source": "CoinDesk",
    "date": "2024-01-15T09:00:00.000Z",
    "title": "Tokenized Fund Adoption Grows but Brings Technology Risks: Moody's",
    "url": "https://www.coindesk.com/markets/2024/01/15/tokenized-fund-adoption-grows-but-brings-technology-risks-moodys/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Entities providing tokenization tech have a limited track record and may contribute to increased risk, a new report by analysts at the credit-rating agency says."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-15T09:01:23.000Z",
    "title": "Crypto Trader Who Accurately Called Bitcoin’s 2022 Market Bottom Says Bitcoin Is Headed to $60K",
    "url": "https://www.cryptoglobe.com/latest/2024/01/crypto-trader-who-accurately-called-bitcoins-2022-market-bottom-says-bitcoin-is-headed-to-60k/",
    "description": "A prominent figure in the cryptocurrency trading community, known for accurately predicting the 2022 market bottom of Bitcoin, has now presented a detailed forecast suggesting a significant rise in Bitcoin’s value. In a recent strategy session, the top crypto analyst, DonAlt, shared his insights with over 56,400 YouTube subscribers, focusing on Bitcoin’s potential trajectory in […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-15T08:44:22.000Z",
    "title": "Paolo Ardoino Confirms Bitfinex Foiled Major Exploit Attempt",
    "url": "https://cryptodaily.co.uk/2024/01/paolo-ardoino-confirms-bitfinex-foiled-major-exploit-attempt",
    "description": "Cryptocurrency exchange Bitfinex has revealed it has successfully repelled an attempt to exploit $15 billion worth of XRP tokens on the platform that were associated with an attempt using an unsuccessful partial payments exploit."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-15T09:05:11.000Z",
    "title": "Global Economy Faces Uncertain Year Ahead, Davos Survey Reveals",
    "url": "https://www.cryptopolitan.com/global-economy-faces-uncertain-year/",
    "description": "The global economy is poised for a challenging year, characterized by subdued growth prospects and a cloud of uncertainty, according to a recent survey of over 60 chief economists from the private and public sectors worldwide. Conducted annually ahead of the World Economic Forum&#8217;s (WEF) gathering in Davos, Switzerland, this survey provides insights into the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-15T08:57:04.000Z",
    "title": "Impact of Artificial Intelligence on Global Jobs: IMF Warns of Significant Changes",
    "url": "https://www.cryptopolitan.com/impact-of-ai-on-global-jobs/",
    "description": "In a recent report, the International Monetary Fund (IMF) has issued a stark warning about the potential consequences of the increasing influence of artificial intelligence (AI) on the global job market. The IMF predicts that AI could disrupt up to 40% of jobs across the world, with advanced economies like the UK facing an even [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-15T08:45:32.000Z",
    "title": "Renewed interest in DeFi and stablecoins expected as Federal Reserve considers interest rate cut",
    "url": "https://www.cryptopolitan.com/renewed-interest-in-defi-and-stablecoins/",
    "description": "A recent report released by asset manager Fidelity stated that an anticipated interest rate cut by the Federal Reserve in the United States could rekindle the interest of major institutions in decentralized finance (DeFi) and stablecoins. However, this renewed interest hinges on the further development of the infrastructure in the DeFi space this year. Fidelity [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-15T08:41:52.000Z",
    "title": "Analysts bullish on Solana and Pullix, Stacks targets more gains",
    "url": "https://crypto.news/analysts-bullish-on-solana-and-pullix-stacks-targets-more-gains/",
    "description": "Analysts remain bullish on Solana and Pullix. Meanwhile, Stacks bulls hope to reclaim $2"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-15T08:41:08.000Z",
    "title": "Celsius moves $125m in ETH to exchanges amid plan to repay creditors",
    "url": "https://crypto.news/celsius-moves-125m-in-eth-to-exchanges-amid-plan-to-repay-creditors/",
    "description": "Embattled crypto lender Celsius has moved over $125 million in Ethereum to various cryptocurrency exchanges in the last week, signaling its plans to commence creditor repayments. Data from Arkham Intelligence shows that between Jan. 8 and 12, Celsius transferred Ethereum&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-15T08:59:29.000Z",
    "title": "VeChain and BCG: Revolutionizing Sustainability with Blockchain",
    "url": "https://www.crypto-news-flash.com/vechain-and-bcg-revolutionizing-sustainability-with-blockchain/?utm_source=rss&utm_medium=rss&utm_campaign=vechain-and-bcg-revolutionizing-sustainability-with-blockchain",
    "description": "<img width=\"1191\" height=\"584\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/vechain.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Vechain\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/vechain.jpg 1191w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/vechain-300x147.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/vechain-1024x502.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/vechain-768x377.jpg 768w\" sizes=\"(max-width: 1191px) 100vw, 1191px\" />VeChain and Boston Consulting Group (BCG) are collaborating to pioneer sustainable blockchain solutions, with a spotlight on their partnership at The World Economic Forum&#8217;s Annual Meeting 2024 in Davos, Switzerland. Their initiatives aim to reduce carbon emissions in agriculture and enhance food supply chain security, positioning them as leaders in fostering sustainability, as discussed at [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-15T09:00:17.000Z",
    "title": "MultiBit Live: BRC20 to Solana Bridge",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/multibit-live-brc20-to-solana-bridge/",
    "description": "<p>This integration marks a significant step forward in the world of blockchain interoperability. Also, it offers users a streamlined experience in managing their digital assets. Let&#8217;s explore more about this important news. MultiBit Goes Live on Solana for Instant BRC20 Token Bridging MultiBit&#8217;s integration with Solana brings forth an exciting prospect for users seeking efficient [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/multibit-live-brc20-to-solana-bridge/\">MultiBit Live: BRC20 to Solana Bridge</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]