[
  {
    "source": "Decrypt",
    "date": "2024-01-12T18:17:36.000Z",
    "title": "Solana Game 'Nyan Heroes' Hits Epic Store Ahead of Airdrop",
    "url": "https://decrypt.co/212680/solana-game-nyan-heroes-hits-epic-store-ahead-airdrop",
    "description": "Nyan Heroes pairs cats and crypto in a Fortnite-like battle royale shooter on Solana, with big moves apparently ahead in 2024."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-12T18:10:22.000Z",
    "title": " The New York Times vs. OpenAI: What’s the worst that could happen? ",
    "url": "https://cointelegraph.com/news/new-york-times-vs-open-ai-artificial-intelligence-worst-that-could-happen",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNTk3YmJhM2YtMjIwNi00NWUwLTllNTYtMjZjNDUxNTgwYmZlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The future of media, artificial intelligence and U.S. copyright law could all hang in the balance. </p>\n                    <p><p data-ct-non-breakable=\"true\">When a generative artificial intelligence (AI) system outputs something strikingly similar to the data it was trained on, is it copyright infringement or a bug in the system? This is the question at the heart of The New York Times’ recent <a href=\"https://cointelegraph.com/news/openai-responds-to-nyt-lawsuit-ethical-ai-practices\">lawsuit against ChatGPT maker OpenAI</a>.</p><p>The New York Times alleges that OpenAI used more content from the NYT website to train its AI models <a href=\"https://cointelegraph.com/news/nyt-ai-case-vs-openai-microsoft-could-be-watershed-moment-community-responds\">than nearly any other proprietary source</a> — with only Wikipedia and data sets containing United States patent documents trumping it.</p><p>OpenAI says training on copyrighted data is “fair use” and The New York Times’ lawsuit is “without merit.”</p><p><a href=\"https://cointelegraph.com/news/new-york-times-vs-open-ai-artificial-intelligence-worst-that-could-happen\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-12T18:30:49.000Z",
    "title": "World Economic Forum Confronts AI Challenges and Public Cynicism Ahead of Davos Summit",
    "url": "https://news.bitcoin.com/world-economic-forum-confronts-ai-challenges-and-public-cynicism-ahead-of-davos-summit/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/wefdavos-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"World Economic Forum Confronts AI Challenges and Public Cynicism Ahead of Davos Summit\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/wefdavos-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/wefdavos-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/wefdavos-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/wefdavos-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/wefdavos-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/wefdavos-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/wefdavos.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In three days, the World Economic Forum (WEF) Annual Meeting will convene on Jan. 15-19, and much of the world’s elite will be in Davos for the event. Before the meeting, the WEF published the 19th annual edition of the Global Risks Report, which highlights the risks of disinformation, and the impact of advancements in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-12T18:30:36.000Z",
    "title": "Bitcoin’s Wall Street debut triggers volatile impact on futures market",
    "url": "https://www.cryptopolitan.com/bitcoins-wall-street-on-futures-traders/",
    "description": "The introduction of Bitcoin exchange-traded funds (ETFs) in the United States did not unfold as a straightforward “sell-the-news” event, contrary to some expectations. However, it did have a notable impact, affecting approximately $80 million in both long and short Bitcoin futures bets as prices experienced rapid fluctuations. Bitcoin ETF triggers a spike in leveraged bets [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-12T18:25:07.000Z",
    "title": "Bitcoin bulls vow to push prices above $100k in 2024",
    "url": "https://www.cryptopolitan.com/bitcoin-bulls-vow-to-push-prices-above-100k/",
    "description": "The buzz around Bitcoin is hitting new heights, and this time, it&#8217;s not just idle chatter. 2024 might just be the year we see Bitcoin soaring past the $100,000 mark. Now, before you roll your eyes and dismiss this as another crypto fantasy, let’s get into why this isn&#8217;t just a pipe dream. The Catalyst: [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-12T18:16:25.000Z",
    "title": "Bank of America could collapse in 2024 – Take a look",
    "url": "https://www.cryptopolitan.com/bank-of-america-could-collapse-in-2024/",
    "description": "The stability of Bank of America, a cornerstone in the American financial landscape, is now under intense scrutiny. With a series of troubling financial reports and industry upheavals, the question on everyone&#8217;s mind is: Could 2024 be the year this banking giant collapse? The Numbers Don&#8217;t Lie Bank of America&#8217;s recent financial performance paints a [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-12T18:18:39.000Z",
    "title": "Concordium CTO foresees promise and peril in EU digital IDs",
    "url": "https://crypto.news/concordium-cto-foresees-promise-and-peril-in-eu-digital-ids/",
    "description": "Nibras Stiebar-Bang believes blockchain may help the European Union's digital identification initiatives."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-12T18:14:01.000Z",
    "title": "Grayscale moves $183m in BTC amid ETF fee competition",
    "url": "https://crypto.news/grayscale-moves-183m-in-btc-amid-etf-fee-competition/",
    "description": "Grayscale Bitcoin Trust transferred approximately 4,000 BTC, valued at $183 million, to Coinbase Prime deposit addresses. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-12T18:30:32.000Z",
    "title": "Bitcoin Erases $49,000 ETF Rally As Coinbase Users Take To Selling",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-erases-49000-etf-rally-coinbase-selling/",
    "description": "Bitcoin had earlier shown a sharp rally toward the $49,000 mark, but the asset was quick to retrace the entire surge as the Coinbase Premium turned negative. Bitcoin Coinbase Premium Gap Plunged Into Negative During Past Day As pointed out by CryptoQuant Netherlands community manager Maartunn in a post on X, the Coinbase Premium Gap has now turned notably negative after being mostly positive for the last few days. The &#8220;Coinbase Premium Gap&#8221; refers to the difference between the Bitcoin prices listed on the cryptocurrency exchanges Coinbase (USD pair) and Binance (USDT pair). Related Reading: Is Bitcoin Near Top Yet? What Glassnode’s Price Multiplier Model Says This indicator&#8217;s value basically provides hints about how the buying or selling behaviors on these two largest platforms in the sector differ from each other right now. When the metric has a positive value, it means that the price listed on Coinbase is higher than on Binance currently. Such a trend implies the former platform&#8217;s users are participating in a higher amount of buying (or lower amount of selling) than the Binance users. On the other hand, the indicator being positive suggests that Binance might be observing a higher degree of buying pressure at the moment as the price listed on the exchange is greater. Now, here is a chart that shows the trend in the Bitcoin Coinbase Premium Gap since the start of the year: Looks like the value of the metric has taken a plunge during the past day &#124; Source: @JA_Maartunn on X As displayed in the above graph, the Bitcoin Coinbase Premium Gap has observed a sharp plunge down into the negative territory during the past day or so. Before this plummet, the indicator had been mostly at positive values since the start of the year. There were a few dips into the red zone earlier as well, but the indicator only attained minor negative values during these drops. This time, though, the premium is down to significantly negative levels. The price surges this year were being driven by the buyers on Coinbase, as the price rose every time the premium did as well. Coinbase is popularly known to be used by US institutional investors, so the green premium suggested that these large entities were buying, most likely in anticipation of the ETFs, which finally gained approval on January 10th. Related Reading: PEPE Breaks Out Of Descending Channel: Analyst Puts These Targets A while after this approval, BTC went on to sharply rally toward the $49,000 level, but the asset&#8217;s run was very short-lived as its price plummeted hard back towards the price prior to the move, thus erasing all the gains. The Coinbase Premium Gap had been notably positive alongside the surge, but the indicator then showed its plunge into the negative territory alongside this quick retrace. It would appear that some American institutional traders may have used the opportunity to harvest their profits. BTC Price Bitcoin has been moving sideways since the quick rally and drawdown, as its price is still floating around the $45,800 level. The price of the coin seems to have shown an overall trend of consolidation recently &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com, CryptoQuant.com"
  }
]