[
  {
    "source": "CoinDesk",
    "date": "2023-10-23T05:19:49.000Z",
    "title": "Bitcoin Eyes $31K as Gold Offers Bullish Cues",
    "url": "https://www.coindesk.com/markets/2023/10/23/bitcoin-eyes-31k-as-gold-offers-bullish-cues/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Interest rate-sensitive assets, such as Gold, are seeing bullish momentum in a positive sign for bitcoin, one observer said."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-23T05:26:44.000Z",
    "title": "What happened in crypto this weekend? ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-on-the-weekend",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/49ce4f13-5053-4197-842f-530122a6b860.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Lawyer says SEC’s odds of beating Ripple are 2.3%, while Magic Eden has paused BRC-20 trades on Ordinals amid double-spending concerns.</p>\n                    <p><p>Pro-XRP lawyer Jeremy Hogan has tipped a slim 2.3% chance for the United States securities regulator to win its case against Ripple after it signaled it will <a href=\"https://cointelegraph.com/news/sec-dismiss-lawsuit-brad-garlinghouse-chris-larsen\">dismiss a lawsuit</a> against two Ripple executives last week. </p><p>\"For all Intents and Purposes\" the Ripple v. SEC case is over,” <a href=\"https://cointelegraph.com/news/lawyers-debate-over-ripple-case-judge-reject-sec-motion-appeal\">the pro-XRP lawyer</a> said in an Oct. 22 post.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">&quot;For all Intents and Purposes&quot; the Ripple v. SEC case is over.<br><br>Yes, important hearings will be held in the coming months (deciding a judgment of up to $770 million is of course important).<br><br>But, YOUR time for hand wringing over this case is done. IMO.<br><br></p>&mdash; Jeremy Hogan (@attorneyjeremy1) <a href=\"https://twitter.com/attorneyjeremy1/status/1715796812966015435?ref_src=twsrc%5Etfw\">October 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“The SEC dismissed the rest of the case, so there will be no trial next year, Hogan said, adding that the facts have been set and that “nothing new or surprising” will be coming out.</p><p>Last week, lawyers representing the SEC said it planned to dismiss all claims against Ripple’s CEO Brad Garlinghouse and executive chair Chris Larsen, which was seen by Ripple CLO Stuart Alderoty as a “surrender by the SEC.”</p><p>In the X thread, Hogan said he expects a final judgment to be delivered in 2024 but noted that a settlement or appeal from one or both parties is also possible.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Luckily, we have statistics which tell us!<br><br>As you see below, the SEC has a 14.2% chance of winning on appeal. 14.2%.<br><br>And I think it&#39;s fair to say that the manner in which the Judge wrote her opinion (very fact based), at a minimum, does not increase that chance for the SEC. <a href=\"https://t.co/LTsOU5eEgE\">pic.twitter.com/LTsOU5eEgE</a></p>&mdash; Jeremy Hogan (@attorneyjeremy1) <a href=\"https://twitter.com/attorneyjeremy1/status/1715796817726644521?ref_src=twsrc%5Etfw\">October 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Should the SEC appeal, the regulator would theoretically have a 14.2% chance of winning, said Hogan. However, SEC’s path to victory will be a long and strenuous one involving not settling, winning on appeal, getting through more hearings and then winning on a final appeal put forward by Ripple — if it ever gets to that point. </p><p>“Because of the way the Judge wrote her Order, the Appellate court would have to send the case back down to the trial Judge for FURTHER judicial findings and determinations!”</p><blockquote>“SO, that's why I say that \"for all Intents and Purposes\" this case is over.”</blockquote><p>“The chance of the SEC winning is exactly 2.367%. Same odds as the Jets winning the Super Bowl!” he added.</p><h3>SEC asks for default judgment against Coinbase inside trader</h3><p>The United States Securities and Exchange Commission has filed a default judgment against one of the three individuals involved in Coinbase’s insider trading scandal.</p><p>The SEC said the defendant, Sameer Ramani, was served on May 26, 2023 and that Ramani hasn’t filed any pleadings or other defenses to the Complaint or Amended Complaint filed by the securities regulator.</p><p>“Accordingly, the SEC respectfully requests that the Clerk of Court enter default against Defendant Ramani,” the SEC said in an Oct. 19 filing.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/4e1063ed-c8ee-4a7f-a0fd-84d87b551cdb.png\"  /><figcaption style=\"text-align: center;\"><em>SEC’s recent motion against Ramani in its case against Ishan Wahi, Nikhil Wahi and Sameer Ramani. Source: Document Cloud</em></figcaption></figure><p>The SEC <a href=\"https://www.sec.gov/files/litigation/complaints/2022/comp-pr2022-127.pdf\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> that “Ramani is believed to currently be in India,” in its initial filing on July 21, 2022.</p><p>The securities regulator asserted in its initial complaint that Ishan Wahi, a former manager in Coinbase’s Assets and Investing Products group, repeatedly tipped material, non-public information about the timing and content of Coinbase’s “listing announcements” to his brother, Nikhil and Ramani (a close friend).</p><p>Nikhil and Ramani used this information to trade ahead of multiple listing announcements, earning at least $1.1 million in illicit profits, the SEC alleged.</p><p>The Wahi brothers reached a <a href=\"https://cointelegraph.com/news/sec-settles-case-against-wahi-brothers-for-coinbase-insider-trading\">settlement with the SEC in late May</a> after <a href=\"https://cointelegraph.com/news/former-coinbase-product-manager-pleads-guilty-in-insider-trading-case\">Ishan Wahi pleaded guilty </a>to two counts of conspiracy to commit wire fraud in February.</p><h3>Magic Eden pauses BRC-20 trades as community raises alarm over double spending</h3><p>Nonfungible token marketplace Magic Eden has suspended BRC-20 trading on Ordinals amid community concerns around the risks of double-spending.</p><p>“We’ve temporarily paused BRC-20 trading to best protect users until full ord consensus across all BRC-20,” Magic Eden on Bitcoin <a href=\"https://twitter.com/MEonBTC/status/1715932783804080468\" target=\"_blank\" rel=\"noopener nofollow\">explained</a> in an Oct. 22 post on X.</p><p>“All other trading remains live on Magic Eden,” the team added.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We’ve temporarily paused BRC-20 trading to best protect users until full ord consensus across all BRC-20<br><br>All other trading remains live on Magic Eden in the meantime!</p>&mdash; Magic Eden on Bitcoin  (@MEonBTC) <a href=\"https://twitter.com/MEonBTC/status/1715932783804080468?ref_src=twsrc%5Etfw\">October 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On Oct. 22, users began posting concerns about the risk of double-spending. The founder of Ordinal Fomojis, Sanj, said the issue is due to different marketplaces using different versions of Ordinals software:</p><blockquote>“Currently different marketplaces are using different versions of ord which are indexing different inscription numbers.”</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I would be careful trading BRC20’s at the moment. <br><br>There’s currently a risk of double spending due to a recent issue in ord.<br><br>Currently different marketplaces are using different versions of ord which are indexing different inscription numbers. <br><br>Until <a href=\"https://twitter.com/MEonBTC?ref_src=twsrc%5Etfw\">@MEonBTC</a> <a href=\"https://twitter.com/okx?ref_src=twsrc%5Etfw\">@okx</a> and…</p>&mdash; Sanj ‍️ (@SanjFomojis) <a href=\"https://twitter.com/SanjFomojis/status/1715883887069724888?ref_src=twsrc%5Etfw\">October 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ordinals-good-or-bad-for-bitcoin-supporters-and-opposers-raise-voice\"><strong><em>Ordinals good or bad for Bitcoin? Supporters and opposers raise voices </em></strong></a></p><p>Ordinals platform UniSat Wallet also acknowledged the BRC-20 indexing dilemma but decided not to suspend BRC-20 trading.</p><p>“We are monitoring what contributors and indexers are doing and will keep our users informed,” UniSat Wallet said in an Oct. 22 post.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We have been made aware of a brc-20 indexing mismatch due to different versions of the ord software.  <br><br>UniSat Wallet and services are aligned with the current ord version 0.9 ensuring correct matching results with <a href=\"https://t.co/SB4uYoPS0G\">https://t.co/SB4uYoPS0G</a>. <br><br>We are monitoring what contributors…</p>&mdash; UniSat Wallet - Store, Inscribe and Search. (@unisat_wallet) <a href=\"https://twitter.com/unisat_wallet/status/1716008430870339964?ref_src=twsrc%5Etfw\">October 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>Other news</h3><p>Crypto-friendly Republican Representative Tom Emmer is pursuing a <a href=\"https://cointelegraph.com/news/crypto-friendly-tom-emmer-pursues-nomination-house-speaker\">nomination to become speaker</a> of the United States House of Representatives, with the 62-year-old receiving endorsement from multiple lawmakers.</p><p>Cryptocurrency advocacy group the DeFi Education Fund filed an amicus brief to a United States court on Oct. 20, urging it consider the unique aspects of blockchain technology when evaluating the <a href=\"https://cointelegraph.com/news/crypto-advocates-file-amicus-brief-addressing-crypto-privacy-rights-under-fourth-amendment\">privacy rights of users under the Fourth Amendment</a> of the U.S. Constitution. It was filed as part of a broader fight to prevent the U.S. government from having unfettered access to a user’s transaction history on cryptocurrency platforms.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/satoshi-nakamoto-zk-proofs-bitcoin/\"><strong><em>Big Questions: What did Satoshi Nakamoto think about ZK-proofs?</em></strong></a></p><h3>The Ripple case is ‘over’</h3><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-23T05:30:21.000Z",
    "title": "Does Block.one Eclipse Microstrategy in BTC Reserves? Deciphering the Bitcoin Treasury Lists",
    "url": "https://news.bitcoin.com/does-block-one-eclipse-microstrategy-in-btc-reserves-deciphering-the-bitcoin-treasury-lists/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/btc67890000-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Does Block.one Eclipse Microstrategy in BTC Reserves? Deciphering the Bitcoin Treasury Lists\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/btc67890000-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/btc67890000-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/btc67890000-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/btc67890000-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/btc67890000-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/btc67890000-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/btc67890000.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />This weekend, bitcoin enthusiasts discussed the latest update to bitcointreasuries.net, which offers a new visual of the various companies, countries and funds with bitcoin on their balance sheets. The site indicates that Microstrategy owns 158,245 BTC, while Block.one, the company behind the development of the EOS network, reportedly holds 164,000 BTC. Behind the Bitcoin Balance [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-23T05:19:27.000Z",
    "title": "Bitcoin Breaches Halfway Mark To $31,000 – How High Can BTC Go This Week?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-breaches-halfway-mark-to-31000/",
    "description": "The price of Bitcoin is maintaining an upward trajectory, catching many off guard this weekend. As of now, BTC has surged by 3.0% in the last 24 hours, and sustaining a 12% rally in the last week. At $30,780, according to data by Coingecko, the top crypto is just inches away from reaching the vaunted $31K, a territory it briefly crossed in April 10 this year. The $30,000 mark holds considerable significance for Bitcoin, functioning as both a psychological milestone and a technical resistance point. Psychologically, it represents a round number that influences investor sentiment, inspiring confidence when surpassed and raising concerns when it becomes a barrier. Technically, $30,000 historically acts as a level where selling pressure tends to intensify, impacting short-term and long-term price movements. As a result, this price level is closely monitored by traders and investors, making it a critical reference point in the cryptocurrency market. Related Reading: Solana On Fire With Over 34% Rally Within A Week – Details The Anticipated Boost: Bitcoin ETF&#8217;s Impact On The Crypto Market There&#8217;s a lot of excitement about the possibility of the U.S. Securities and Exchange Commission allowing a Bitcoin exchange-traded fund (ETF). This could be a big boost for the struggling cryptocurrency market. Mike Novogratz, the CEO of Galaxy Digital, thinks it&#8217;s very likely that the U.S. will approve this kind of investment fund for Bitcoin soon. This news could be a major reason for Bitcoin&#8217;s price to go up. Bitcoin may soon break over its overhead resistance and begin a rapid surge, according to trading group Stockmoney Lizards. They anticipate widespread participation in the ETF and a subsequent surge in the run-up to the halving in April 2024. BTCUSD inching closer to the key $31K territory. Chart: TradingView.com The financial industry is currently witnessing the active participation of major players such as BlackRock, which manages assets above $10 trillion. These firms are also actively pursuing the approval of their applications for exchange-traded funds (ETFs), thereby creating an environment filled with eager expectation. As a result of Bitcoin&#8217;s steady ascent, tokens formed by the forking of the alpha coin, namely Bitcoin Cash (BCH) and Bitcoin SV (BSV), had a significant surge of up to 26%, surpassing other altcoins in terms of gains. This surge may indicate a potential manifestation of enthusiasm. BTC price action in the last 24 hours. Source: Coingecko Prospects Of A Bitcoin ETF In Late 2023 Or Early 2024 Several industry experts are suggesting that the long-anticipated approval of a spot Bitcoin exchange-traded fund (ETF) could materialize sometime between late 2023 and early 2024. This revelation has sent ripples of excitement throughout the cryptocurrency community and the broader financial world. If BlackRock&#8217;s spot Bitcoin ETF is approved, Matrixport, a provider of cryptocurrency services, projects that the price of Bitcoin would rise to between $42,000 and $56,000. The community of U.S. registered investment advisors and prospective investment inflows from gold ETF investors form the basis of the extremely optimistic forecast. Related Reading: Stacks (STX) Rockets 26% Higher In A Single Week: The Factors At Play A Bitcoin ETF is a big deal because it makes it easy for regular folks to invest in Bitcoin without needing to deal with all the complicated stuff that comes with digital currencies. It&#8217;s like a bridge that connects the regular money world with the wild world of cryptocurrencies, which could help more people get into Bitcoin. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Collection FRAC Lorraine"
  }
]