[
  {
    "source": "CoinDesk",
    "date": "2023-07-28T12:25:39.000Z",
    "title": "First Mover Americas: Grayscale Urges SEC for Equal Treatment of Spot Bitcoin ETF Applications ",
    "url": "https://www.coindesk.com/markets/2023/07/28/first-mover-americas-grayscale-urges-sec-for-equal-treatment-of-spot-bitcoin-etf-applications/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for July 28, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-28T12:23:37.000Z",
    "title": "Introducing 'Standard on Security' Is Key to Thwarting DeFi Hacks: OpenZepplin Security Lead",
    "url": "https://decrypt.co/150452/introducing-standard-on-security-is-key-thwarting-defi-hacks-openzepplin-security-lead",
    "description": "A blockchain architect expert told Decrypt that security in the DeFi industry demands a higher level of scrutiny from all participants."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-28T12:20:00.000Z",
    "title": "The Agenda podcast chats with Energy Web on how to fight climate change with help of blockchain",
    "url": "https://cointelegraph.com/news/the-agenda-podcast-chats-with-energy-web-on-how-to-fight-climate-change-with-help-of-blockchain",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/828784cc-d7f7-4d3c-928d-b71d970cc08d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Energy Web CEO Jesse Morris explains why blockchain can make “going green” more efficient, how fighting climate change is easier and why they are building on Polkadot. </p>\n                    <p><p>This summer, parts of the United States are wilting under a multi-month stretch of sweltering heat and data suggests that summer temperatures will continue to creep up in the coming years. The planet is on what seems to be a pretty clear <a href=\"https://public.wmo.int/en/media/press-release/global-temperatures-set-reach-new-records-next-five-years\" target=\"_blank\" rel=\"noopener nofollow\">path</a> to soon reaching 1.5 degrees Celsius of warming for the first time since preindustrial times, a milestone number that the world’s countries pledged to try to remain under in the 2015 Paris Agreement. </p><p>Humanity’s continued burning of fossil fuels combined with the return of the El Niño weather phenomenon has created a dangerous cocktail of rising temperatures that have been breaking records all around the world. In fact, July 6 was the world’s hottest day ever <a href=\"https://www.cnbc.com/2023/07/07/climate-world-records-hottest-day-ever-for-the-third-time-this-week.html\" target=\"_blank\" rel=\"noopener nofollow\">recorded</a> — and possibly the hottest day in 100,000 years — with the month of July on track to be the <a href=\"https://www.reuters.com/article/climate-change-july-record-idAFKBN2Z71E5\" target=\"_blank\" rel=\"noopener nofollow\">hottest</a> in recorded history.</p><p>Scientists say that short of drastic and monumental geoengineering projects, the only way to prevent the planet's warming from remaining under 1.5 degrees Celsius is to rapidly phase out and ultimately stop the burning of fossil fuels. But modern society requires massive amounts of power to operate, so where will all that energy come from if fossil fuels are no longer practical? </p><p>The answer, according to organizations like Energy Web, lies in clean energy, or energy that does not release greenhouse gasses into the atmosphere.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/5f50650e-fc9c-4766-9cf0-155aa22c78ff.jpg\"  /></figure><p>On episode 15 of The Agenda Podcast, hosts Jonathan DeYoung and Ray Salmond speak with Energy Web CEO Jesse Morris about his views on climate change, decarbonization and how blockchain technology can help facilitate the move to clean energy. </p><h2>The tech is actually already built and readily available</h2><p>A particular highlight from the conversation was Morris’ comment that it’s the economics of the climate change industry that need adjustment. Morris said:</p><blockquote>“Let’s just make it so that all these technologies that can help us decarbonize are cost-effective and businesses will just adopt them.” </blockquote><p>Of course, it’s slightly more complex than that, but according to Morris:</p><blockquote>“One of the big overarching challenges is we just need our electricity to be green. Yeah. And one of the ways we can make the electricity to be more green, the entire electric system is to take this concept where, let’s say we have all of these different technologies that I was talking about earlier electric cars, batteries, solar systems, heat pumps.”</blockquote><template data-ct-widget=\"buzzsprout\" data-buzzsprout-podcast-id=\"2096305\"></template><p>In Morris’ view, better public policy messaging which is couched in digestible data and a more reasonable approach to governments’ climate change and environmental preservation objectives. Morris said the first step is to “electrify everything” and,</p><blockquote>“If we have all those assets out there, which is kind of a naturally decentralized, distributed landscape with all of these assets that are out there, if we can network those things together digitally and basically use those to actually balance the grid instead of these big natural gas or coal-powered facilities, that’s a really efficient way to manage the electricity system, basically telling all of those different batteries and electric cars precisely when to and when to not use electricity. It’s kind of like a big distributed, decentralized battery that’s a really efficient and incredibly economically powerful tool for balancing the grid.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/how-blockchain-technology-and-defi-could-help-solve-the-housing-crisis\"><strong><em>How blockchain technology and DeFi could help solve the housing crisis</em></strong></a></p><h2>What’s blockchain got to do with it? </h2><p>Given the fact that environmentally friendly solutions are already in existence and ready to roll out, both co-hosts were curious about the actual role and need for blockchain in these technologies. Morris explained that after six years of building and trialing different solutions, Energy Web honed in on Green Proofs as the primary solution that had good product to market fit. </p><p>Green Proofs have applications ranging from green biofuels, to Bitcoin miners using only renewable and green energy and tracing how green the materials were that came in to create a battery. </p><p>According to Morris, “blockchain plays a pretty key role. We use blockchains to actually just represent those assets.” </p><blockquote>“So basically, if I’m a fuel producer, I log in, I register, I upload data. An on-chain representation of that data is then used and can be moved around that ecosystem to sort of track who owns the digital certificate representing that unit of green fuel, for example.” </blockquote><p>To hear more from Morris’s conversation with <em>The Agenda,</em> listen to the full episode on <a href=\"https://cointelegraph.com/podcasts/the-agenda\">Cointelegraph’s Podcasts page</a>, <a href=\"https://podcasts.apple.com/us/podcast/the-agenda/id1659393166\" target=\"_blank\" rel=\"noopener nofollow\">Apple Podcasts</a> or <a href=\"https://open.spotify.com/show/6azmkkIXj5LQbxTRAbAqXS\" target=\"_blank\" rel=\"noopener nofollow\">Spotify</a>. And don’t forget to check out Cointelegraph’s <a href=\"https://cointelegraph.com/podcasts\">full lineup</a> of other shows! </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tokenizing-music-royalties-nfts-taylor-swift-3lau-nas-the-weeknd/\"><strong><em>Tokenizing music royalties as NFTs could help the next Taylor Swift</em></strong></a></p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-28T12:30:54.000Z",
    "title": "Bankrupt crypto giants FTX and Genesis reach agreement to resolve billion-dollar claims",
    "url": "https://cryptoslate.com/bankrupt-crypto-giants-ftx-and-genesis-reach-agreement-to-resolve-billion-dollar-claims/",
    "description": "<p>Bankrupt crypto companies FTX and Genesis Global announced they had reached an agreement in principle concerning claims made by the firms against themselves, per a July 27 letter to Judge Sean Lane. Although the letter does not disclose the specifics of the settlement terms, it mentions that the firms are aiming to resolve the claims [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bankrupt-crypto-giants-ftx-and-genesis-reach-agreement-to-resolve-billion-dollar-claims/\">Bankrupt crypto giants FTX and Genesis reach agreement to resolve billion-dollar claims</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-28T12:30:00.000Z",
    "title": "Bitget's BGB Token to Launch on MEXC, Unleashing Exciting Price Growth and Enhanced Liquidity Possibilities",
    "url": "https://cryptodaily.co.uk/2023/07/bitget-bgb-token-to-launch-on-mexc-unleashing-exciting-price-growth-and-enhanced-liquidity-possibilities",
    "description": "<p>Bitget, top crypto derivatives and copy trading platform, is delighted to announce the listing of its native token BGB on the renowned cryptocurrency exchange MEXC. This strategic move is expected to further boost liquidity, accessibility, and the overall value and utility of the BGB token. Traders can now engage in seamless BGB/USDT trading on MEXC, accessing a broader range of opportunities and privileges.</p>\n<p>With a circulating supply of 1,400,000,000 BGB and a total supply of 2,000,000,000, BGB plays a pivotal role in Bitget's ecosystem. The token offers users exclusive privileges and a variety of rights on the Bitget exchange, encompassing fee discounts, access to high-quality tokens through Launchpad and Launchpool participation, the ability to Super Airdrop, and much more.</p>\n<p>The decision to list BGB on MEXC came along with the surging demand for the token in the market, where it has already amassed over 300,000 holders and achieved a total trading volume of more than two billion USD since the beginning of the year.&nbsp; BGB experienced significant price growth, reaching an all-time high of over 0.51 USDT in February and was the best-performing exchange token in H1 2023, outpacing BTC.&nbsp;</p>\n<p>This remarkable surge in BGB&rsquo;s value can be attributed to Bitget&rsquo;s successful and steady growth. With a rising share in both the spot and derivatives trading markets and a reputation for high financial security, Bitget has garnered significant traction. Additionally, Bitget's impressive track record of listing over 180 coins in 2023 and boasting the best Launchpad performance, with an ATH average ROI of 41.9x, have strengthened the use cases and attractiveness for BGB.</p>\n<p>The updated BGB whitepaper, released in April, revealed exciting new features in development, including the BGB lottery, trial fund for futures trading, and exclusive earning services. Additionally, the team is actively considering a BGB buyback and burn mechanism, aimed at reducing the token's circulating supply and bolstering its overall value. In May, Bitget introduced yet another innovative feature called \"Super Airdrop\" for its platform token, BGB. This feature offers eligible BGB holders the opportunity to receive airdrops of any new crypto assets listed on the Bitget platform.</p>\n<p>In addition to the developments of BGB functionalities, Bitget's continuous growth and influence in the cryptocurrency market also serve as key drivers for the demand and price performance of BGB. According to TokenInsight's Crypto Exchange Report Q2 2023, Bitget ranks the fourth in trading volume among all CEXs, and its market share increased by 1.81% to 8.7%, the second-highest increase among the Top5 CEXs. Bitget experienced a significant increase in market share in both the spot market and open interest, solidifying its position as a leading player in the industry.</p>\n<p>Gracy Chen, Managing Director of Bitget, commented on the listing:</p>\n\n<p>&nbsp;\"The listing of BGB on MEXC is a testament to the recognition and achievements of Bitget in the dynamic crypto space. As we continue to expand our ecosystem in both the CeFi and DeFi realms, enhancing BGB's visibility and utility remains one of our top priorities. We are excited to unlock new possibilities and reach a broader audience through this strategic collaboration with MEXC.\"</p>\n\n<p>BGB is now available for public exchange and trade on MEXC, along with Bitfinex and Bitget, with a total daily trading volume of $10 million. The Bitget team is continuing to explore future listing opportunities for BGB in the coming months.&nbsp;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T12:25:09.000Z",
    "title": "Stablecoins pose lower risk than bank deposits says former Fed policy analyst",
    "url": "https://www.cryptopolitan.com/stablecoins-pose-lower-risk-vs-bank-deposits/",
    "description": "A recent policy paper authored by Brendan Malone, a former Federal Reserve Board analyst representing Paradigm, a technology investment firm, sheds light on the comparative risks of stablecoins against traditional bank deposits and money market funds. The paper explores the potential risks that stablecoins might pose to the financial system, particularly in the context of ... <a title=\"Stablecoins pose lower risk than bank deposits says former Fed policy analyst\" class=\"read-more\" href=\"https://www.cryptopolitan.com/stablecoins-pose-lower-risk-vs-bank-deposits/\" aria-label=\"More on Stablecoins pose lower risk than bank deposits says former Fed policy analyst\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T12:22:14.000Z",
    "title": "How AI Can Revolutionize Weather Forecasting to Save Lives",
    "url": "https://www.cryptopolitan.com/how-ai-can-revolutionize-weather-forecasting/",
    "description": "Modern supercomputers have come a long way since the post-World War II era when machines like Maniac were used for weather modeling and nuclear explosion simulations. Today&#8217;s fastest supercomputers have a staggering capacity for calculations, and a significant portion of their capabilities are dedicated to weather forecasting and defense applications. Numerical weather prediction (NWP) using ... <a title=\"How AI Can Revolutionize Weather Forecasting to Save Lives\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-ai-can-revolutionize-weather-forecasting/\" aria-label=\"More on How AI Can Revolutionize Weather Forecasting to Save Lives\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T12:12:34.000Z",
    "title": "Meta to Charge Cloud Computing Companies Fees for AI Model Llama 2 Despite Initial Open-Source Plans",
    "url": "https://www.cryptopolitan.com/cloud-computing-companies-ai-model-llama-2/",
    "description": "Meta, formerly known as Facebook, has announced its decision to charge significant cloud computing companies, such as Microsoft and Alphabet, to use its artificial intelligence (AI) model, Llama 2. This is a surprise move, considering Meta had initially positioned Llama 2 as an open-source tool accessible to everyone. The CEO of Meta, Mark Zuckerberg, revealed ... <a title=\"Meta to Charge Cloud Computing Companies Fees for AI Model Llama 2 Despite Initial Open-Source Plans\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cloud-computing-companies-ai-model-llama-2/\" aria-label=\"More on Meta to Charge Cloud Computing Companies Fees for AI Model Llama 2 Despite Initial Open-Source Plans\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T12:36:09.000Z",
    "title": "XRP Surge Poses Challenge to Bitcoin’s Dominance, Says Top Analyst",
    "url": "https://www.crypto-news-flash.com/xrp-surge-poses-challenge-to-bitcoins-dominance-says-top-analyst/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-surge-poses-challenge-to-bitcoins-dominance-says-top-analyst",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-4-Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple XRP\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-4-Ripple.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-4-Ripple-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-4-Ripple-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-4-Ripple-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />XRP&#8217;s performance during this period is remarkable, fueled by a favorable ruling in the Ripple v. SEC case.  Patrick Riley&#8217;s bold prediction of XRP surpassing Bitcoin attracted diverse reactions Crypto data platform Swissblock reports that altcoins like Ethereum (ETH), Ripple&#8217;s XRP, and Solana (SOL) are causing ripples in the crypto markets, showing gains in the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T12:30:05.000Z",
    "title": "Golden Cask Club (GCC) ICO: Groundbreaking Gears Up to Surpass Chainlink (LINK) and Aave (AAVE)",
    "url": "https://www.crypto-news-flash.com/golden-cask-club-gcc-ico-groundbreaking-gears-up-to-surpass-chainlink-link-and-aave-aave/?utm_source=rss&utm_medium=rss&utm_campaign=golden-cask-club-gcc-ico-groundbreaking-gears-up-to-surpass-chainlink-link-and-aave-aave",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T152600.430.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T152600.430.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T152600.430-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Golden Cask Club (GCC) is staging an Initial Coin Offering (ICO) unlike anything we&#8217;ve seen. Currently in presale phase one, Golden Cask Club&#8217;s (GCC) unique approach of melding the crypto world with luxury spirits is already generating hype, potentially placing it ahead of big names like Chainlink (LINK) and Aave (AAVE).  Can Golden Cask Club’s [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T12:17:06.000Z",
    "title": "Binance Withdraws Crypto Licencing In Germany Amidst Europe Setbacks",
    "url": "https://www.crypto-news-flash.com/binance-withdraws-crypto-licencing-in-germany-amidst-europe-setbacks/?utm_source=rss&utm_medium=rss&utm_campaign=binance-withdraws-crypto-licencing-in-germany-amidst-europe-setbacks",
    "description": "<img width=\"1600\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance Coin\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn.png 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-1536x864.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-24x14.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-36x20.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-48x27.png 48w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />Binance withdraws crypto licensing application in Germany amid regulatory challenges in Europe. Binance&#8217;s market share declines amid regulatory challenges, with plans to focus on mature markets like France, Italy, and Spain while complying with EU regulations. Binance, the largest cryptocurrency exchange globally, has decided to withdraw its application for a cryptocurrency license from BaFin, the [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-28T12:34:04.000Z",
    "title": "Top 3 Avalanche Coins in Q3-2023.",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-avalanche-coins-in-q3-2023/",
    "description": "<p>Among its many offerings, three notable projects &#8211; Benqi, GMX, and Trader Joe &#8211; have gained significant traction and garnered attention from the DeFi community. This article delves into the unique features of each of these avalanche coins, their use cases, and provides a snapshot of their latest news. 1) Benqi  Benqi, a decentralized liquidity [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-avalanche-coins-in-q3-2023/\">Top 3 Avalanche Coins in Q3-2023.</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]