[
  {
    "source": "Crypto Daily",
    "date": "2023-07-18T12:15:00.000Z",
    "title": "DEX Top Performer Token $TET to be Listed on MEXC Exchange on July 18th, 3 pm UTC",
    "url": "https://cryptodaily.co.uk/2023/07/dex-top-performer-token-tet-to-be-listed-on-mexc-exchange-on-july-18th-3-pm-utc",
    "description": "<p>Mahe, Seychelles &ndash; We are thrilled to announce that $TET, the top-performing token on Uniswap, will be listed on the esteemed MEXC Exchange. This listing represents a significant milestone for the Tectum project and opens up exciting opportunities for investors and traders worldwide.</p>\n<p>The listing on MEXC Exchange is scheduled to take place on July 18th at 3 pm UTC. MEXC Exchange is renowned for its robust trading infrastructure, high liquidity, and a wide range of trading pairs. With this strategic move, $TET aims to provide its community with enhanced trading capabilities and a seamless trading experience.</p>\n<p>TET has garnered significant attention in the DEX space due to its exceptional performance on Uniswap, innovative features of the SoftNote, and strong community support. The token's consistent growth and positive market sentiment make it an attractive asset for investors seeking a token with long-term global utility.</p>\n<p>By listing on MEXC Exchange, TET gains exposure to a vast network of traders, institutional investors, and crypto enthusiasts. This increased visibility and accessibility will contribute to the further expansion of the $TET ecosystem and its adoption within the broader crypto community.</p>\n<p>The $TET team has been working diligently to ensure a smooth listing process on MEXC Exchange. They are committed to providing ongoing support and maintaining transparent communication channels with the community throughout this exciting phase.</p>\n<p>For more information about TET and the upcoming listing on MEXC Exchange, please visit the official website, www.softnote.com. Stay tuned for further updates on social media channels, including Twitter, Telegram, and Discord.</p>\n<p>About Tectum:</p>\n<p>From the Cybersecurity company CrispMind, The Tectum SoftNote is the ultimate Bitcoin/Crypto Layer 2 solution that overcomes the pitfalls of the lightning network. It is built on the Layer 1 Blockchain, Tectum, which is the fastest blockchain in the world and transacts at 1.3 million TPS! With SoftNote, users can enjoy instant, trustless, anonymous, and decentralized crypto payments for free. With a strong community backing and a commitment to innovation, $TET aims to shape the future of the cryptopayments for private and retail transactions and revolutionize the blockchain industry.</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T12:30:50.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.138653, accompanied by a 24-hour trading volume of $61.59 million. The market capitalization stands at $49.13 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 20.93% increase. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T12:25:30.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and the platform they need to build blockchain solutions. At this time, we can only make educated guesses ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T12:18:46.000Z",
    "title": "Crypto regulations hang in the balance as Coinbase CEO participates in confidential house meeting",
    "url": "https://www.cryptopolitan.com/crypto-regulations-hang-in-the-balance-as-coinbase-ceo-participates-in-confidential-house-meeting/",
    "description": "In an exclusive development reported by Bloomberg on Monday, it was revealed that Brian Armstrong, the CEO of Coinbase, will participate in a confidential meeting with House Democrats on Wednesday morning. This closed-door gathering will include members of the New Democrat Coalition, an influential group comprising more than a hundred Democrats known for their commitment ... <a title=\"Crypto regulations hang in the balance as Coinbase CEO participates in confidential house meeting\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-regulations-hang-in-the-balance-as-coinbase-ceo-participates-in-confidential-house-meeting/\" aria-label=\"More on Crypto regulations hang in the balance as Coinbase CEO participates in confidential house meeting\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T12:12:44.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s Solana price is $25.56 with a 24-hour trading volume of $618,897,839. Solana is up 1.45% in the last 24 hours. The current CoinMarketCap ranking is #9, with a live market cap of $7,273,881,101. It has a circulating supply of 394,890,490 SOL coins and the max. supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T12:11:28.000Z",
    "title": "San Francisco’s Lean AI Operations Result in Fewer Employment Opportunities",
    "url": "https://www.cryptopolitan.com/san-franciscos-lean-ai-operations/",
    "description": "San Francisco is experiencing an AI startup boom, with investors pouring billions into generative AI and fueling a frenzy reminiscent of the early days of social media. However, tech industry professionals caution that the rapid growth of the AI sector may not be a cure-all for the city&#8217;s economic and commercial real estate woes. Unlike ... <a title=\"San Francisco&#8217;s Lean AI Operations Result in Fewer Employment Opportunities\" class=\"read-more\" href=\"https://www.cryptopolitan.com/san-franciscos-lean-ai-operations/\" aria-label=\"More on San Francisco&#8217;s Lean AI Operations Result in Fewer Employment Opportunities\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-18T12:20:55.000Z",
    "title": "Thodex ex-CEO jailed for 7.5 months in Turkey",
    "url": "https://crypto.news/thodex-ex-ceo-jailed-for-7-5-months-in-turkey/",
    "description": "Faruk Fatih Özer, the founder and CEO of Thodex, a defunct crypto exchange in Turkey, has been imprisoned after failing to provide the necessary tax documents to the country’s Tax Inspection Board"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-18T12:30:30.000Z",
    "title": "Chainlink CCIP Goes Live On Mainnet, LINK Jumps By Nearly 10%",
    "url": "https://www.newsbtc.com/altcoin/chainlink-ccip-goes-live-on-mainnet-link-jumps-by-nearly-10/",
    "description": "The Cross-Chain Interoperability Protocol (CCIP), designed for building cross-chain applications and services, has now launched for early access users on the Avalanche, Ethereum, Optimism, and Polygon blockchains. On July 20, the Chainlink protocol will become available to developers across the four blockchains’ testnets and also Arbitrum’s Goerli. As a result of this, the price of Chainlink’s native token, LINK, rallied nearly 10% to touch $7.30 following this announcement on Monday. Chainlink&#8217;s CCIP &#8211; The Future Of Interoperability? In a blog post dated July 17, Chainlink announced the launch of the Cross-Chain Interoperability Protocol to early access users on Avalanche, Ethereum, Optimism, and Polygon blockchains. While DeFi lending protocol Aave is set to integrate the protocol, it has already been adopted on the derivatives platform Synthetix. Related Reading: Bitcoin Price Needs To Clear $30,500 For Hopes of a Fresh Rally According to the post, CCIP is an interoperability protocol that allows developers to design their own cross-chain solutions. It also offers &#8220;Simplified Token Transfers&#8221;, which allows protocols to swiftly send tokens across chains through audited token pool contracts.   Chainlink claims that CCIP is a blockchain layer designed to foster a connection between enterprises and any public or private blockchain ecosystem. The cross-chain protocol is a collaborative effort with Swift, the renowned global financial messaging network. It leverages Swift&#8217;s messaging infrastructure to facilitate token transfers across various public and private blockchains. According to Chainlink’s co-founder Sergey Nazarov, CCIP is a solution that aims to “connect the fragmented public blockchain landscape and the growing bank ecosystem into a single Internet of Contracts.” He also stated that such technology will be crucial to developing and maintaining a blockchain-powered society. Just like key standards such as TCP/IP remade a fragmented early internet into the single global internet we all know and use today, we are making CCIP to connect the fragmented public blockchain landscape and the growing bank chain ecosystem into a single Internet of Contracts.… https://t.co/BDMFMfknY2 pic.twitter.com/DDscglD2An — Sergey Nazarov (@SergeyNazarov) July 17, 2023 Some of the financial institutions and enterprises also exploring the Cross-Chain Interoperability Protocol include Australia and New Zealand Banking Group (ANZ), BNP Paribas, BNY Mellon, Citi, Euroclear, and Lloyds Banking Group. Chainlink (LINK) Up By 35% In One Month &#8211; Price Overview Following the announcement of the CCIP launch, the price of LINK experienced a significant pump, recording an almost 10% increase in the early hours of Tuesday. However, the token’s price appears to be slowing down, losing over 2% since reaching a 24-hour high of $7.29. As of this writing, LINK is valued at $7.12, with a 7.3% increase in the last day. CoinGecko data shows that the cryptocurrency has a daily trading volume of roughly $549.8 million, representing a 219% boost in the last 24 hours. Related Reading: LINK Price Prediction: Chainlink Rallies Over 7% As The Bulls Aim $8.8 A broader look at the Chainlink market reveals that the LINK price has been on an upward trajectory in recent weeks. Thanks to this bullish momentum, the token has gained about 35% in the past month. LINKUSD trading at $7.091&#124; Source: LINKUSD chart from TradingView Featured image from Binance Academy, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-18T12:21:10.000Z",
    "title": "Stellar-Powered Honeycoin App Enables USDC Cash Out At MoneyGram Locations In Multiple Countries",
    "url": "https://www.crypto-news-flash.com/stellar-powered-honeycoin-app-enables-usdc-cash-out-at-moneygram-locations-in-multiple-countries/?utm_source=rss&utm_medium=rss&utm_campaign=stellar-powered-honeycoin-app-enables-usdc-cash-out-at-moneygram-locations-in-multiple-countries",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-2048x1152.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-48x27.jpg 48w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Honeycoin App, powered by Stellar, now enables USDC cash outs at MoneyGram locations in Kenya, Uganda, Tanzania, Nigeria, Ghana, and the UK, expanding the real-world applications of Circle&#8217;s USDC on Stellar. The integration offers practicality and convenience for everyday transactions, fostering financial inclusion through efficient cross-border transactions and seamless integration into conventional economic systems. In [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-18T12:36:02.000Z",
    "title": "Apple’s Contradiction with Cryptos",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/apples-contradiction-with-crypto/",
    "description": "<p>The company has shown support for the adoption of Bitcoin and other cryptocurrencies. First, Bitcoin&#8217;s whitepaper was discovered on Mac computers. Then, they eliminated the need to connect a crypto wallet for in-app purchases. Also, StepN was integrated with Apple Pay and Axie Infinity got into the Apps Store. However, Apple hinders Nostr&#8217;s application in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/apples-contradiction-with-crypto/\">Apple&#8217;s Contradiction with Cryptos</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]