[
  {
    "source": "Cointelegraph",
    "date": "2023-09-14T10:45:00.000Z",
    "title": "Google Cloud teams up with Web3 startup to make DeFi mainstream ",
    "url": "https://cointelegraph.com/news/google-cloud-joins-web3-startup-to-make-de-fi-mainstream",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/495095cb-1b3b-4bd2-9286-f28f1aec80b5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Google Cloud told Cointelegraph that the partnership was done in light of increasing interest from clients exploring blockchain workloads on Google Cloud. </p>\n                    <p><p>Google Cloud has joined forces with a Web3 startup to develop user-centric developer tools for decentralized finance (DeFi) to lower the barrier of entry into the decentralized world.</p><p>The DeFi infrastructure provider Orderly Network has teamed up with Google Cloud to develop off-chain components of DeFi infrastructure focused on tackling self-custody and transparency challenges. Orderly will be a DeFi infrastructure provider, available on Google Cloud Marketplace. </p><p>Google Cloud told Cointelegraph that the partnership was struck in light of increasing interest from clients exploring blockchain workloads on Google Cloud.</p><p>Rishi Ramchandani, Head of APAC Web3 GTM, Google Cloud Asia Pacific told Cointelegraph that the surge in demand highlights the necessity for a tailored Web3 product suite. He added:</p><blockquote>“Working with Orderly Network to build robust infrastructure will help address the gaps in DeFi adoption and growth, and ensure scalability in the continuously evolving space through the development of secure and user-centric enterprise developer tools.”</blockquote><p>With blockchain technology being at the centre of the fintech revolution, many in the financial industry are exploring decentralized technologies, including JP Morgan which has been actively <a href=\"https://cointelegraph.com/news/jpmorgan-uses-blockchain-for-24-7-dollar-transfers-with-indian-banks\">testing various blockchain-based solutions</a> including <a href=\"https://cointelegraph.com/news/jp-morgan-executes-first-defi-trade-on-public-blockchain\">DeFi ones</a>. The traditional banking systems started showing interest in blockchain tech quite early with one report from 2021 suggesting that <a href=\"https://cointelegraph.com/news/55-of-world-s-top-100-banks-reportedly-have-crypto-and-blockchain-exposure\">55% of the top-100 banks have some exposure to the decentralized tech</a>.</p><p>Orderly hopes to distribute the DeFi load into on-chain and off-chain components to ensure a balance between speed with sufficient decentralization. The firm claimed this distribution would streamline operations without compromising the inherent advantages of a decentralized system. These off-chain components will ensure that crucial interactions are carried out on-chain while interactions that can be efficiently handled off-chain are processed away from the main blockchain. </p><p>Cointelegraph got in touch with Arjun Arora, COO at Orderly Network, to understand how their collaboration with Google will help in making DeFi mainstream. Arora told Cointelgraph that to achieve mainstream adoption, blockchain technology must outperform current solutions and Orderly is building a trading Lego for seamless dApp integration across blockchains with a focus on merging the best of decentralzied exchanges (DEXs) and centralized exchanges (CEXs.) </p><blockquote>“Our collaboration with Google ensures our matching engine competes with centralized systems seen in traditional finance, but the rest of our infrastructure and liquidity network retains all the benefits of self-custody and transparency seen in decentralized finance.”</blockquote><p>DeFi's biggest challenge comes from the entry barrier and the security issues that have plagued the ecosystem for a long. With the likes of Google Cloud entering the DeFi infrastructure market with Orderly as its key partner, the collaboration aims to build a secure environment and tools to resolve these issues. </p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-14T10:43:52.000Z",
    "title": "Layer 2 solution Arbitrum drives Ethereum ecosystem’s growth, suggests Pantera Capital",
    "url": "https://cryptoslate.com/layer-2-solution-arbitrum-drives-ethereum-ecosystems-growth-suggests-pantera-capital/",
    "description": "<p>According to the latest Pantera Capital Blockchain Letter, the crypto market may finally turn a corner after a brutal bear market in 2022, and leading Ethereum layer 2 solution Arbitrum is emerging as one of the biggest beneficiaries. As Pantera&#8217;s letter illustrates, &#8220;Arbitrum is a massive share taker within the Ethereum ecosystem, and Ethereum, in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/layer-2-solution-arbitrum-drives-ethereum-ecosystems-growth-suggests-pantera-capital/\">Layer 2 solution Arbitrum drives Ethereum ecosystem’s growth, suggests Pantera Capital</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T10:55:05.000Z",
    "title": "Alibaba makes a play in Apple-China beef – How?",
    "url": "https://www.cryptopolitan.com/alibaba-makes-a-play-in-apple-china-beef-how/",
    "description": "Tech magnate Apple recently unveiled the iPhone 15, boasting of its cutting-edge 3-nanometer mobile processors crafted by the Taiwan Semiconductor Manufacturing Co. This release, however, was shrouded in whispers and wary eyes, given China&#8217;s veiled admonishments towards the tech giant. Notably absent from this tussle? Alibaba, one of China&#8217;s leading tech behemoths. Their conspicuous silence ... <a title=\"Alibaba makes a play in Apple-China beef &#8211; How?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alibaba-makes-a-play-in-apple-china-beef-how/\" aria-label=\"More on Alibaba makes a play in Apple-China beef &#8211; How?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T10:51:48.000Z",
    "title": "AI-Based Cybersecurity Solutions Minimize Data Breach Impact and Costs",
    "url": "https://www.cryptopolitan.com/ai-based-cybersecurity-minimize-data-breach/",
    "description": "In the ever-evolving landscape of cybersecurity, staying one step ahead of cybercriminals is crucial to safeguarding sensitive data and preserving an organization&#8217;s financial stability. The latest 2023 IBM Cost of a Data Breach report reveals that businesses adopting AI-based cybersecurity tools are not only fortifying their defenses but also substantially reducing the financial repercussions of ... <a title=\"AI-Based Cybersecurity Solutions Minimize Data Breach Impact and Costs\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-based-cybersecurity-minimize-data-breach/\" aria-label=\"More on AI-Based Cybersecurity Solutions Minimize Data Breach Impact and Costs\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T10:48:40.000Z",
    "title": "SWIFT’s CBDC test: Central banks join the fray",
    "url": "https://www.cryptopolitan.com/swifts-cbdc-test-central-banks-join-the-fray/",
    "description": "The ever-evolving world of banking has been stirred once more. Three more central banks, in a move symbolizing adaptation to our digital age, have jumped aboard SWIFT&#8217;s digital currency project. Notably, this interbank messaging platform, which has long been the spine of the global banking network, is now steering into the uncharted waters of Central ... <a title=\"SWIFT&#8217;s CBDC test: Central banks join the fray\" class=\"read-more\" href=\"https://www.cryptopolitan.com/swifts-cbdc-test-central-banks-join-the-fray/\" aria-label=\"More on SWIFT&#8217;s CBDC test: Central banks join the fray\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T10:42:57.000Z",
    "title": "FTX digital assets sale gets the green light from court",
    "url": "https://www.cryptopolitan.com/ftx-digital-assets-sale-green-light-court/",
    "description": "Delaware&#8217;s judicial hallways echoed with the thud of a gavel as the verdict came down, granting FTX the power to embark on its significant digital assets sale. And in the fast-paced, always-on world of cryptocurrency, a ruling like this is more than just a legal gesture—it&#8217;s a testament to the changing landscape of finance and ... <a title=\"FTX digital assets sale gets the green light from court\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ftx-digital-assets-sale-green-light-court/\" aria-label=\"More on FTX digital assets sale gets the green light from court\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-14T11:04:30.000Z",
    "title": "Singapore issues order against Three Arrows Capital founders",
    "url": "https://crypto.news/singapore-issues-order-against-three-arrows-capital-founders/",
    "description": "The Monetary Authority of Singapore has issued a nine-year prohibition order against the founders of Three Arrows Capital (3AC). The order was issued against Zhu Su and Kyle Livingston Davies for violating different regulatory laws, such as the Securities and&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-14T10:57:40.000Z",
    "title": "Certik questions Telegram bot tokens amid TON-based wallet debut",
    "url": "https://crypto.news/certik-questions-telegram-bot-tokens-amid-ton-based-wallet-debut/",
    "description": "Blockchain security firm Certik has sounded the alarm regarding Telegram bot tokens amid the recent launch of its self-custodial wallet on the TON blockchain. The latest development comes as the community keenly anticipates the potential influence this wallet will have&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-14T10:53:01.000Z",
    "title": "North Korea linked to latest crypto hacks, surpassing $270m",
    "url": "https://crypto.news/north-korea-linked-to-latest-crypto-hacks-surpassing-270m/",
    "description": "Recent investigations link North Korea&#8217;s Lazarus Group to a series of crypto hacks totaling over $270 million in stolen assets across major platforms in the past 102 days. Investigations suggest the latest high-profile hacks targeting crypto entities have been perpetrated&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-14T11:00:17.000Z",
    "title": "Why This Crypto Exchange Founder Believes Bitcoin Can Still Rise 150% From Here",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-rise-150/",
    "description": "The price of Bitcoin has fluctuated over the past month, but BitMEX co-founder Arthur Hayes is the latest crypto expert to make a bullish forecast for the asset. According to the former CEO of the cryptocurrency exchange BitMEX, Bitcoin could reach $70,000, and the only reason the asset is not yet at this price is because investors are fixated on the Fed&#8217;s nominal rate. Bitcoin Can Still Rise 150% Various predictions have come in regarding Bitcoin, with some being more bullish than others. As for Hayes, he made his case regarding BTC in his Crypto Trader Digest blog post in light of various actions by the US Federal Reserve to curb inflation.  Related Reading: This Latest Move Suggests SEC Lawsuit Against Ripple Is Pushing The Crypto Firm Outside The US Since March 2022, the Fed has raised interest rates multiple times, causing many investors like Hayes to reconsider their predictions regarding the outlook of Bitcoin. What happens if the Fed keeps raising rates? Can the $BTC bull market gain steam? &#8220;Are We There Yet?&#8221; is an essay exploring that question.https://t.co/OGkVQreIBg pic.twitter.com/FTYR3HBq1a — Arthur Hayes (@CryptoHayes) September 11, 2023 In the blog post, Hayes shared several metrics relating to the US treasury yield and GDP growth. Hayes began adjusting his forecasts by disputing the widely held belief that BTC&#8217;s value is negatively correlated with rising interest rates.  A new outlook shows that the government&#8217;s spending rates and the current growth of GDP have driven down the actual treasury yield on 5% government bonds closer to 4%, making risky assets like BTC and stocks still attractive.  Hayes believes the Fed will be able to continue down this path of raising rates, and investors&#8217; search for positive real yields in response to this has translated into a bullish market for Bitcoin which began in March 2023.  However, although Bitcoin is up by close to 29% since then, most of the market is still yet to catch on as everyone is focused on the nominal Fed rate and not the real rate. “The reason why we aren’t at $70,000 is that everyone is focused on the nominal Fed rate, and not on the real rate when compared to the U.S.’s eye-poppingly high nominal GDP growth.” BTC price trending above $26,300 &#124; Source: BTCUSD on Tradingview.com BTC Price To $70,000? While speaking at the Korea Blockchain Week, Hayes mentioned that the next Bitcoin bull market started on March 10, the day the Federal Deposit Insurance Corporation (FDIC) took over Silicon Valley Bank (SVB).  Hayes has actually made similar predictions regarding Bitcoin. Back in March 2020, the pundit made a prediction Bitcoin could rise from $8,000 and reach $20,000 by the end of the year. BTC&#8217;s price would later close the year 2020 at around $27,000.  Related Reading: SEC Boss Gary Gensler Completes Senate Hearing: Here’s What Crypto Investors Should Know The BitMEX co-founder has previously expressed his discomfort on Spot Bitcoin ETF, from investment companies like BlackRock, calling them “crypto gatekeepers” who are only looking to balance their deposit base. However, Hayes believes a catchup by the market would Bitcoin survive more interest rate raise from Fed to skyrocket more than 150% from its current level by early 2024.  At the time of writing, Bitcoin is trading at $26,320 and is up by 2.27% in a seven-day timeframe. Featured image from Breet, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-14T11:00:45.000Z",
    "title": "Domini.art’s Price Rocket, TRON’s Hype & XRP’s Game: Best Crypto to Invest?",
    "url": "https://www.crypto-news-flash.com/domini-arts-price-rocket-trons-hype-xrps-game-best-crypto-to-invest/?utm_source=rss&utm_medium=rss&utm_campaign=domini-arts-price-rocket-trons-hype-xrps-game-best-crypto-to-invest",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T111949.209.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T111949.209.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T111949.209-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T111949.209-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T111949.209-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T111949.209-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ever wondered which cryptocurrencies are leading the pack this year? Wth a lot of new cryptos offering innovation and practical use cases, it&#8217;s crucial to pinpoint the best crypto investments. Domini.art’s ($DOMI) soaring price, TRON&#8217;s unprecedented hype, and XRP&#8217;s strategic moves are captivating the crypto community&#8217;s interest. $DOMI is creating a buzz with its art-based [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-14T10:58:46.000Z",
    "title": "Charles Hoskinson Unveils Massive Update for Cardano’s Sidechain Midnight and Innovative Upgrade for Multi-Delegation Staking on Lace – Can it Drive ADA Price to $0.30?",
    "url": "https://www.crypto-news-flash.com/charles-hoskinson-unveils-massive-update-for-cardanos-sidechain-midnight-and-innovative-upgrade-for-multi-delegation-staking-on-lace-can-it-drive-ada-price-to-0-30/?utm_source=rss&utm_medium=rss&utm_campaign=charles-hoskinson-unveils-massive-update-for-cardanos-sidechain-midnight-and-innovative-upgrade-for-multi-delegation-staking-on-lace-can-it-drive-ada-price-to-0-30",
    "description": "<img width=\"1000\" height=\"668\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-768x513.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Cardano-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The Cardano’s Midnight platform is expected to launch soon on the Devnet and leverage the Zero Knowledge Proofs (ZKP) technology. Meanwhile, Lace 1.5 has introduced a multi-delegation stake of Cardano (ADA) to enable the democratization of Dapps in the ecosystem. The Cardano (ADA) network has exploded with vibrant decentralized financial (DeFi) platforms in the past [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-14T10:42:56.000Z",
    "title": "Nasdaq Files Application: Hashdex Pursues SEC Approval for Hybrid Ethereum ETF",
    "url": "https://www.crypto-news-flash.com/nasdaq-files-application-hashdex-pursues-sec-approval-for-hybrid-ethereum-etf/?utm_source=rss&utm_medium=rss&utm_campaign=nasdaq-files-application-hashdex-pursues-sec-approval-for-hybrid-ethereum-etf",
    "description": "<img width=\"1280\" height=\"848\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ethereum-6286125_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ethereum-6286125_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ethereum-6286125_1280-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ethereum-6286125_1280-1024x678.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ethereum-6286125_1280-768x509.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ethereum-6286125_1280-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ethereum-6286125_1280-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ethereum-6286125_1280-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/ethereum-6286125_1280-48x32.jpg 48w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Nasdaq has filed an application for Hashdex Ethereum Futures ETF. This filing emphasizes the influence of Brazil in the crypto ETF terrain. Nasdaq has filed an application with the United States Securities and Exchange Commission (SEC) to list a hybrid mix of spot and futures contract Ethereum Exchange Traded Fund (ETF) for Brazilian crypto asset [...]"
  }
]