[
  {
    "source": "Decrypt",
    "date": "2023-11-20T19:55:06.000Z",
    "title": "Bitcoin, Ethereum Hover Near Yearly Highs as ETF Hopes Stay Alive",
    "url": "https://decrypt.co/206705/bitcoin-ethereum-near-yearly-highs-on-etf-hopes",
    "description": "Bitcoin is hovering near $38,000 and Ethereum has been able to stay above $2,000 as the global crypto market cap nears $1.5 trillion."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-20T19:58:06.000Z",
    "title": "Microsoft and Nvidia stocks reach all-time highs amid OpenAI CEO shuffle",
    "url": "http://cointelegraph.com/news/microsoft-nvidia-stock-reach-all-time-highs-amid-open-ai-ceo-shuffle-artificial-intelligence",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/1b520f64-cfa9-4180-9c8b-ffd90f66154d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Former OpenAI CEO Sam Altman has reportedly agreed to a position with Microsoft while Nvidia reaps the benefits of big tech’s scramble to build a better chatbot.</p>\n                    <p><p>Microsoft (MSFT) stocks hit an all-time high of $378.81 on Nov. 20 on the back of a tumultuous weekend for the AI sector involving the ousting of OpenAI CEO and co-founder Sam Altman. Not to be outdone, Nvidia (NVDA) stocks also reached an all-time high of $499.60, continuing a trend that’s seen its shares rise from a one-year low of $138.84.</p><p>Both stocks have skyrocketed over the past few years, with end-over-end growth due to an explosion in the AI field spurred by the onset of deep learning and generative models such as OpenAI’s ChatGPT. </p><p>In Microsoft’s case, many experts and pundits are attributing the late November push to the Redmond corporation’s newest AI hire, former OpenAI CEO Sam Altman.</p><p>As Cointelegraph reported, <a href=\"https://cointelegraph.com/news/sam-altman-ousted-from-open-ai-chatgpt-cto-mira-murati-named-interim-ceo\">Altman was fired by OpenAI’s board of directors on Nov. 17</a> in a surprise announcement. He was initially replaced by company CTO Mira Murati, who was named as interim CEO. Shortly thereafter, however, Murati was replaced by former Twitch CEO and co-founder Emmett Shear, </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">first and last time i ever wear one of these <a href=\"https://t.co/u3iKwyWj0a\">pic.twitter.com/u3iKwyWj0a</a></p>&mdash; Sam Altman (@sama) <a href=\"https://twitter.com/sama/status/1726345564059832609?ref_src=twsrc%5Etfw\">November 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In the meantime, both Altman and fellow OpenAI co-founder Greg Brockman have reportedly <a href=\"https://cointelegraph.com/news/microsoft-hires-sam-altman-greg-brockman-after-departure-from-openai\">agreed to head up a new AI division at Microsoft</a> — this despite the fact that the Satya Nadella led company has invested some $13 billion in OpenAI. </p><p>Microsoft stocks surged on the news, though gains have been steady for the entire sector throughout most of 2023. Many other notable AI stocks have demonstrated high yield performance alongside the most noteworthy gainers — Microsoft and Nvidia — including IBM and Tencent, who currently sit at five year and one month highs respectively as of the time of this article’s publishing. </p><p>Nividia’s all-time gains come as the company shores up its position as the go-to outlet for artificial intelligence training hardware. The company has a lion’s share of the market due to its graphical processing units (GPUs), a commodity whose demand has caused prices for flagship models to steadily increase over the past decade.</p><p>It remains to be seen whether or not the Nov. 20 highs will ultimately rise, hold, or falter before the closing bell rings. </p><p>Also up in the air is Altman’s status at Microsoft. A group composed of a majority of OpenAI’s employees has penned <a href=\"https://cointelegraph.com/news/openai-staff-board-resign-after-sam-altman-ousting-report\">an open letter demanding that the company’s board reinstate the former CEO</a>, else face a walkout. </p><p><strong><em>In related news: </em></strong><a href=\"https://cointelegraph.com/news/open-ai-investors-sam-altman-ceo\"><strong><em>OpenAI investors push for Sam Altman’s return as CEO</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-20T19:43:26.000Z",
    "title": "US Justice Dept. is reportedly ready to settle with Binance for $4 billion",
    "url": "http://cointelegraph.com/news/us-justice-dept-is-reportedly-ready-to-settle-with-binance-for-4-billion",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/8ab0bbee-40cb-4622-bb72-7382d53c0ffe.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to a report, an agreement to settle Justice Department charges against the company may be settled by the end of the month.</p>\n                    <p><p>The US Justice Department is negotiating with Binance in an attempt to <a href=\"https://www.bloomberg.com/news/articles/2023-11-20/openai-staff-threaten-to-go-to-microsoft-if-board-doesn-t-quit?sref=323RPL5z\" target=\"_blank\" rel=\"noopener nofollow\">resolve</a> its investigation into the company, according to a November 20 report from Bloomberg citing people familiar with the discussions. The agreement would require Binance to pay $4 billion in fines. In return, the company would be allowed to keep operating while complying with US laws. According to the report, the announcement of an agreement “could come as soon as the end of the month.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">*US SEEKS MORE THAN $4 BILLION FROM BINANCE TO END CRIMINAL CASE<br><br>Source: Bloomberg | Coins: BNB</p>— db (@tier10k) <a href=\"https://twitter.com/tier10k/status/1726653847534276815?ref_src=twsrc%5Etfw\">November 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As part of the agreement, Binance CEO Changpeng Zhao (also known as “CZ”) would face the possibility of criminal charges as part of an investigation into “alleged money laundering, bank fraud and sanctions violations.” The report states that CZ is currently living in the United Arab Emirates (UAE), which does not have an extradition treaty with the US. This seems to imply that charges filed in the US would be unlikely to result in CZ’s arrest.</p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/sealing-docs-binance-case-suggests-criminal-probe-says-former-sec-official\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sealing-docs-binance-case-suggests-criminal-probe-says-former-sec-official/amp\"><strong>Sealing docs in Binance case could suggest a criminal probe</strong></a></p><p>The report claims that Binance is seeking a “deferred prosecution agreement.” Under the terms of this deal, the Justice Department would make a criminal complaint, but would not actually prosecute the company so long as it complies with three conditions. </p><p>First, it would need to pay $4 billion in penalties. Second, Binance would need to publish a detailed document admitting areas where it didn’t comply with the law. Third, a monitoring process would be set up to ensure Binance complies with laws and regulations in the future, and the company would need to comply with this process.</p><p>Cointelegraph reached out to Binance for comment on the report but did not receive a response by the time of publication. In 2022, CZ <a href=\"https://cointelegraph.com/news/binance-ceo-sues-bloomberg-subsidiary-alleging-defamation\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-ceo-sues-bloomberg-subsidiary-alleging-defamation/amp\">sued a Bloomberg subsidiary</a> for allegedly publishing false stories claiming he was running a “Ponzi Scheme.”</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-20T19:42:40.000Z",
    "title": "Could Love Hate Inu (LHINU) Outperform Dogecoin in 2023?",
    "url": "https://cryptodaily.co.uk/2023/11/could-love-hate-inu-lhinu-outperform-dogecoin-in-2023",
    "description": "Discover Love Hate Inu (LHINU) - a potential game-changer in the meme coin market. Amidst the buzz of Bitcoin ETFs, LHINU stands out with its innovative approach in the crypto voting sphere. Our in-depth analysis delves into its market potential, technical indicators, and price predictions, offering a balanced view of its future prospects. Learn about LHINU's role in transforming the $3.2 billion online polling industry and its technical analysis. Get ready for a comprehensive exploration of Love Hate Inu's journey in the dynamic world of cryptocurrencies."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-20T19:46:10.000Z",
    "title": "Canadian authority seeks input from banks on crypto reporting regulations",
    "url": "https://crypto.news/canadian-authority-seeks-input-from-banks-on-crypto-reporting-regulations/",
    "description": "Canada's Office of the Superintendent of Financial Institutions has initiated a consultation process to develop guidelines for how banks should report their exposure to crypto."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-20T20:00:48.000Z",
    "title": "Crypto Market Expert Identifies The Trigger For 600% Bitcoin Price Surge",
    "url": "https://www.newsbtc.com/news/bitcoin/crypto-600-bitcoin-price-surge/",
    "description": "In a recent analysis, a crypto market expert has discovered key elements that could trigger a massive surge in the Bitcoin price.  Crypto Expert Reveals Bitcoin Price Surge Catalyst Head of Research at CoinShares, James Butterfill has published an in-depth analysis of a revelation that could catalyze a significant increase in Bitcoin’s price. Butterfill’s research delves deep into the present dynamics of the crypto market surrounding the potential approval of Spot Bitcoin ETFs and the inflows that could follow.  Related Reading: Argentina Welcomes First Pro-Bitcoin President, BTC Price Surges Above $37,000 Using an analysis by Galaxy, Butterfill deduced that if 10% of the $14.4 trillion addressable assets within the US were to go into Spot Bitcoin ETFs, each with a 1% allocation, then over $14.4 billion inflows would be witnessed. If the predictions prove true, Butterfill has stated that it would signify the largest influx ever seen in the financial markets.  “One could assume that perhaps 10% invest in a spot bitcoin ETF with an average allocation of 1%, which would equate to US$14.4 billion of inflows in the first year. If this were correct then it would be the largest inflows on record, with the largest so far being in 2021, which saw US$7.24 billion of inflows, representing 11.5% of assets under management (AuM),” Butterfill stated.  The crypto expert also highlighted a distinct correlation between asset under management (AuM) inflows and price changes, suggesting that price surges occur around the same time inflows increase.  “There does seem to be a relationship between inflows as a percentage of AuM and change in price. Inflows do appear to be coincident, the week the prices rise so do flows rather than one leading the other,” Butterfill said.  Expert Predicts Massive BTC Surge If Trigger Events Unfold In his research, James Butterfill also predicted that the price of Bitcoin could rise as high as $141,000 if driven by $14.4 billion inflows.  He stated reservations about his deductions, citing that it would be difficult to accurately estimate the amount of inflows that would occur if Spot Bitcoin ETFs were introduced.  “If we take the aforementioned US$14.4 billion of inflows, the model suggests it could push the price up to US$141,000 per Bitcoin. The problem with the estimate of inflows is that it is very difficult to ascertain exactly how much inflows there will be when the spot ETFs are launched,” Butterfill stated.  Related Reading: Crypto Analyst Predicts XRP Price Will Reach $1.35 As These Metrics Heat Up Butterfill also acknowledged the uncertainties surrounding demand for Spot Bitcoin ETFs following its potential approval. He stated that there were many variables, both regulatory and corporate that could significantly influence the perception of Bitcoin’s role in society.  “Ultimately, it is very difficult to ascertain just how big the potential wall of demand will be once a spot-based ETF is launched. We know that it effectively diversifies a portfolio and enhances Sharpe ratios, but regulatory approval and corporate acceptance are slow-burn issues due to Bitcoin’s perceived complexity,” Butterfill concluded.  BTC recovers to $37,200 &#124; Source: BTCUSD on Tradingview.com Featured image from Bitcoin News, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-20T19:51:00.000Z",
    "title": "Blockchain Security Firm Recommends How To Build a Safe DeFi",
    "url": "https://coinedition.com/blockchain-security-firm-recommends-how-to-build-a-safe-defi/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/According_to_slowmist_Apple_Store_found_a_malicious_phishing_program.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Blockchain Security Firm Recommends How To Build a Safe DeFi\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/According_to_slowmist_Apple_Store_found_a_malicious_phishing_program.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/According_to_slowmist_Apple_Store_found_a_malicious_phishing_program-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/According_to_slowmist_Apple_Store_found_a_malicious_phishing_program-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/According_to_slowmist_Apple_Store_found_a_malicious_phishing_program-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/According_to_slowmist_Apple_Store_found_a_malicious_phishing_program-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/According_to_slowmist_Apple_Store_found_a_malicious_phishing_program-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/According_to_slowmist_Apple_Store_found_a_malicious_phishing_program-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/According_to_slowmist_Apple_Store_found_a_malicious_phishing_program-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/According_to_slowmist_Apple_Store_found_a_malicious_phishing_program-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/According_to_slowmist_Apple_Store_found_a_malicious_phishing_program-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/According_to_slowmist_Apple_Store_found_a_malicious_phishing_program-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/According_to_slowmist_Apple_Store_found_a_malicious_phishing_program-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/According_to_slowmist_Apple_Store_found_a_malicious_phishing_program-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/According_to_slowmist_Apple_Store_found_a_malicious_phishing_program-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/According_to_slowmist_Apple_Store_found_a_malicious_phishing_program-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/According_to_slowmist_Apple_Store_found_a_malicious_phishing_program-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>SlowMist, a blockchain security firm, has provided information on how to build a safe decentralized finance (DeFi) platform, following recommendations from 23pds. The security outfit drew a mind map following the rampant security breaches within the DeFi ecosystem. The mind map, titled “How to Build a Safe DeFi,” was divided into two sections, including the [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/blockchain-security-firm-recommends-how-to-build-a-safe-defi/\">Blockchain Security Firm Recommends How To Build a Safe DeFi</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-20T19:45:38.000Z",
    "title": "Polygon Handled Over 16,000,000 Transactions in Single Day and ‘Didn’t Even Blink,’ Says Founder Sandeep Nailwal",
    "url": "https://dailyhodl.com/2023/11/20/polygon-handled-over-16000000-transactions-in-single-day-and-didnt-even-blink-says-founder-sandeep-nailwal/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/polygon-Other-Scaling.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/polygon-Other-Scaling.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/polygon-Other-Scaling.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/polygon-Other-Scaling.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/polygon-Other-Scaling.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/polygon-Other-Scaling.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/polygon-Other-Scaling.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Ethereum (ETH) scaling solution Polygon (MATIC) processed the highest number of daily transactions in the blockchain’s history last week. On November 16th, the Polygon blockchain saw 16,449,264 transactions, marking a sudden and massive increase from the average of below three million per day. In a post on social media platform X, Polygon founder Sandeep Nailwal [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/20/polygon-handled-over-16000000-transactions-in-single-day-and-didnt-even-blink-says-founder-sandeep-nailwal/\">Polygon Handled Over 16,000,000 Transactions in Single Day and ‘Didn’t Even Blink,’ Says Founder Sandeep Nailwal</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-20T19:41:10.000Z",
    "title": "Solana (SOL) Leads Institutional Altcoin Investments As Crypto Markets See Eight Straight Weeks of Inflows: CoinShares",
    "url": "https://dailyhodl.com/2023/11/20/solana-sol-leads-institutional-altcoin-investments-as-crypto-markets-see-eight-straight-weeks-of-inflows-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/google-a-Solana-Validator.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/google-a-Solana-Validator.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/google-a-Solana-Validator.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/google-a-Solana-Validator.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/google-a-Solana-Validator.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/google-a-Solana-Validator.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/google-a-Solana-Validator.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets manager CoinShares says institutional crypto products saw heavy inflows across the board last week for the eighth consecutive week. In its latest Digital Asset Fund Flows report, CoinShares finds that institutional investors are continuing to up their allocations to crypto with Solana (SOL) investment products leading the way for altcoins. &#8220;Digital asset investment products [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/20/solana-sol-leads-institutional-altcoin-investments-as-crypto-markets-see-eight-straight-weeks-of-inflows-coinshares/\">Solana (SOL) Leads Institutional Altcoin Investments As Crypto Markets See Eight Straight Weeks of Inflows: CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]