[
  {
    "source": "CoinDesk",
    "date": "2023-09-28T10:26:02.000Z",
    "title": "EU Seeks More Data on Crypto’s ‘Significant’ Environmental Harm",
    "url": "https://www.coindesk.com/policy/2023/09/28/eu-seeks-more-data-on-cryptos-significant-environmental-harm/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The bloc’s executive arm is commissioning a $842K study as it considers what to do about energy-hungry proof-of-work technology"
  },
  {
    "source": "Decrypt",
    "date": "2023-09-28T10:21:59.000Z",
    "title": "SEC Extends Deadline for Ark Invest, VanEck Spot Ethereum ETF Filings",
    "url": "https://decrypt.co/199090/sec-extends-deadline-ark-invest-vaneck-spot-ethereum-etf-filings",
    "description": "Though VanEck and Ark Invest have been hit with delays, a futures-based ETF could see approval by next week."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-28T10:12:32.000Z",
    "title": "What Price for Your Money? Liberty, Security, and CBDCs",
    "url": "https://decrypt.co/198753/what-price-for-your-money-liberty-security-and-cbdcs",
    "description": "CBDCs promise to energise economic growth through greater efficiency and security—at the cost of enshrining fiat’s dominance."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-28T10:25:00.000Z",
    "title": "Bitcoin halving to raise ‘efficient’ BTC mining costs to $30K",
    "url": "https://cointelegraph.com/news/bitcoin-halving-efficient-btc-mining-costs-30k",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/f44c8ed9-14bb-408b-b278-6fb581c75d47.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin miners may see “severe” economic consequences from BTC price action staying below $30,000 after the 2024 halving, Glassnode warns.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) Ordinals are boosting miner profits, but “income stress” is looming, new research warns.</p><p>In the latest edition of its weekly newsletter, “The Week On-Chain,” analytics firm Glassnode <a href=\"https://insights.glassnode.com/the-week-onchain-week-39-2023/\" target=\"_blank\" rel=\"noopener nofollow\">predicted</a> fresh problems for miners after Bitcoin’s next <a href=\"https://cointelegraph.com/learn/bitcoin-halving-how-does-the-halving-cycle-work-and-why-does-it-matter\">block subsidy halving</a>.</p><h2>Bitcoin halving impact on miners could be “severe”</h2><p>Bitcoin miner competition is exploding, with hash rate — the estimated combined processing power deployed to the blockchain — <a href=\"https://cointelegraph.com/news/fomc-btc-price-local-bottom-5-things-bitcoin-this-week\">at record highs</a>.</p><p>For Glassnode, this indicates unprecedented conditions for miners trying to eke out a living at current BTC price levels.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-ordinals-inscription-still-making-majority-btc-transactions\"></a><a href=\"https://cointelegraph.com/news/bitcoin-ordinals-inscription-still-making-majority-btc-transactions\">Ordinal inscriptions are helping</a>, with these acting as “packing-filler” which turns empty blockspace into a source of revenue for miners.</p><p>“Naturally, as blockspace demand increases, miner revenues will be positively affected,” it wrote.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/b374bc8d-9fd0-406e-89ca-b21c2e52f1b0.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Mean Hash Rate (7-day moving average) chart (screenshot). Source: Glassnode</em></figcaption></figure><p>The proportion of income received from fees has increased between 1% and 4% compared to lows seen during Bitcoin bear markets, but by historical standards remains modest.</p><p>“Meanwhile, the amount of hashrate competing for these rewards has increased by 50% since February, as more miners, and newer ASIC rigs are established and come online,” “The Week On-Chain” notes.</p><p>This hash rate spike is laying the foundation for an upcoming showdown. In April 2024, miner rewards per block will drop 50%, doubling the so-called “production cost” per BTC. Currently around $15,000, this will pass $30,000 — above the current spot price.</p><p>Glassnode presented two models for estimating the price at which miners, on aggregate, fall into the red, with the above comparing issuance to mining difficulty.</p><p>“By this model, we estimate that the most efficient miners on the network have an acquisition price of around $15.1k,” researchers explained. </p><blockquote>“However, the purple curve shows the post-halving ‘doubling’ of this level to $30.2k, which would likely put the majority of the mining market into severe income stress.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/cd30f815-8399-4357-bea0-bd482d80d16a.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Difficulty per Issuance Pricing Model (screenshot). Source: Glassnode</em></figcaption></figure><p>A previous model put the average miner acquisition price at $24,300 per Bitcoin — around 8% below spot as of Sept. 28.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/2791433e-f62e-40b3-b689-ab810f243bb6.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Difficulty Regression model (screenshot). Source: Glassnode</em></figcaption></figure><h2>BTC price incentives</h2><p>Others are more optimistic about how miners will handle the build-up to the halving.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-exchange-volume-5-year-lows-fed-btc-hodling\">Bitcoin exchange volume tracks 5-year lows as Fed inspires BTC hodling</a></em></strong></p><p>In an <a href=\"https://cointelegraph.com/news/bitcoin-price-46k-2024-halving-interview-filbfilb\">interview with Cointelegraph</a> this month, analyst Filbfilb, co-founder of trading suite DecenTrader, reiterated that miners would up BTC accumulation in advance of the event.</p><p>“Miners are incentivized to ensure that prices are well above marginal cost prior to the halving,” he <a href=\"https://cointelegraph.com/news/bitcoin-halving-q4-smart-money-buy-btc-price\">wrote</a> in an X (formerly Twitter) thread in August. </p><blockquote>“Whether they collude consciously, or not they are collectively incentivized to send prices higher before their marginal revenue is effectively halved.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/4a4a3013-a102-4248-a60c-0b443e3cd1c9.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD chart with miner accumulation data. Source: Filbfilb/X</em></figcaption></figure><p>Assisting BTC supply dynamics will be what Filbfilb calls smart money “buying the rumor” over the halving and its own impact on the amount of BTC being minted.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-28T10:13:16.000Z",
    "title": "Europe drives institutional crypto adoption: Blockchain Expo Amsterdam ",
    "url": "https://cointelegraph.com/news/europe-institutional-crypto-adoption-blockchain-expo-amsterdam",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/f108d035-2346-44da-b50d-f448fae9ddfd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Conversations with key speakers at the Blockchain Expo in Amsterdam suggest that cryptocurrency exchanges and companies see Europe as a key region for growth. </p>\n                    <p><p>Europe remains fertile ground for the cryptocurrency ecosystem to flourish in comparison to harsher regulatory environments, according to prominent speakers at this year’s Blockchain Expo in Amsterdam.</p><p>Cointelegraph attended the convention held at the RAI conference center for the second year running, with the Blockchain Expo forming part of the larger Tech Expo event being hosted in the Netherlands.</p><p>The event has typically attracted prominent mainstream industry players from the financial world to showcase how blockchain technology is being leveraged to power innovative new products and solutions across a myriad of industries.</p><p>From finance, logistics, health care and marketing, blockchain technology and Web3 functionality continues to be a key area of growth for different industry players. </p><h2>MiCA bodes well for institutional adoption</h2><p>Regulatory matters remain front and center, as was evident in a fireside chat featuring Coinbase institutional sales co-head James Morek and Zodia Markets co-founder Nick Philpott.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/0f3c5309-29ba-4ca6-a4f9-96837b47dc84.jpg\"  /><figcaption style=\"text-align: center;\">Trendmaster co-founder Chris Uhler, Zodia Markets co-founder Nick Philpott and Coinbase co-head of EMEA &amp; APAC institutional sales James Morek onstage in Amsterdam.</figcaption></figure><p>Philpott, who established the institutional-grade cryptocurrency trading platform, described the European Union’s Markets in Crypto-Assets (MiCA) regulation as a progressive regulatory measure to guide the growth of the sector while protecting users.</p><blockquote>“Institutions feel more comfortable knowing that there is a framework within which they can operate, which is at odds with what is happening in countries like America.”</blockquote><p>Philpott’s reference to the United States’ regulatory landscape centered on the cloud of uncertainty that hangs over the cryptocurrency ecosystem. This has been primarily driven by the Securities and Exchange Commission’s separate enforcement actions against key industry players, including Coinbase, Ripple and Binance.US, for alleged securities violations.</p><p>Morek, who heads up Coinbase’s institutional sales in the EMEA and APAC regions, also highlighted the establishment of clear regulatory parameters across the EU and in the United Kingdom which have helped crypto-related firms continue to do business.</p><p>Off-the-record conversations also suggest that major players like Coinbase continue to attract interest from institutional clients looking to gain exposure or custody of certain cryptocurrencies outside of the U.S. </p><p><a href=\"https://cointelegraph.com/news/eu-s-new-crypto-law-how-mica-can-make-europe-a-digital-asset-hub\"><strong><em>Related: EU’s new crypto law: How MiCA can make Europe a digital asset hub</em></strong></a></p><p>This includes a myriad of potential clients, ranging from traditional fund managers, large corporates, private banks and a variety of businesses. Morek told Cointelegraph that Coinbase currently serves over 1300 institutional customers globally.</p><p>Legal frameworks that have long allowed companies to have both onshore and offshore entities continue to be an important element in allowing cryptocurrency exchanges and companies to offer services in different jurisdictions.</p><p>Philpott also highlighted the United Arab Emirates as a fast-growing crypto and Web3 hub that is actively looking to attract the biggest firms in the industry. The likes of Binance have already established a foothold in the UAE, while Coinbase was reportedly exploring setting up a base of operations in the jurisdiction earlier in 2023.</p><h3>A tokenized future</h3><p>Tokenization also remains a drawcard for a variety of institutions, including mainstream banks and financial firms looking to issue and manage debt and investments. </p><p>Cointelegraph also spoke to Martijn Siebrand from Dutch bank ABN AMRO. Siebrand is the bank’s digital assets ecosystem manager and he shared insights into ABN AMRO’s <a href=\"https://cointelegraph.com/news/abn-amro-issues-5m-digital-green-bond-through-polygon-powered-tokeny\">recent issuance</a> of a digital green bond that made use of Polygon’s layer-2 Ethereum scaling technology to raise 5 million euros ($5.3 million).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/82d62ac0-5bb9-4593-8aed-be93dc23e1b6.jpg\"  /><figcaption style=\"text-align: center;\">ABN AMRO's Martijn Siebrand fields questions from the crowd during his presentation on day one of the conference.</figcaption></figure><p>Siebrand said that blockchain technology is proving to be a useful tool for banks to better serve capital markets:</p><blockquote>\"It's funny, if we have now talks within the bank, people say capital markets have been there for a long time already yet we haven't seen many innovations. This could be one major change where a lot of banks are investing in.\"</blockquote><p>Siebrand added that ABN Amro is already showcasing its blockchain-based digital bond exploits at conferences and exhibitions to both capital market players like mainstream banks as well as private companies looking to raise funds:</p><blockquote>“We see two tracks. We have the institutional one serving traditional capital markets. But we also have the chance to help clients that are too big for crowdfunding but too small for capital markets.”</blockquote><p>Siebrand added that tokenized debt offerings can be useful for companies that want to avoid selling equity. However, jurisdictional regulatory frameworks need to be further developed before ABN AMRO can create a working roadmap to further its blockchain tokenization offerings:</p><blockquote>“We think that private markets involving private issuances, which are one-on-one or with two or three investors, that will be easier to to scale than the institutional one.”</blockquote><h3>NFTs remain valuable for institutions</h3><p>Mia Van, Mastercard’s EMEA blockchain and digital assets, delved into the value that nonfungible tokens (NFTs) present for institutional users. The sector has produced $1.9 billion in sales volumes over the past year according to Van, with the average number of Web3 wallets increasing despite sellers dominating NFT marketplaces in <a href=\"https://cointelegraph.com/news/nft-markets-are-out-of-balance-with-sellers-dominating\">recent months</a>.</p><p>According to Van, luxury brands such as Breitling and Louis Vuitton are actively using NFTs to provide digital twins of items that also prove their provenance. Meanwhile, mainstream brands like Adidas and Nike continue to explore NFTs and metaverse activations that give users ownership of objects in both the physical world and metaverse environments. </p><p><a href=\"https://cointelegraph.com/news/nft-styled-debit-cards-the-future-of-web3-animoca-founder\"><strong><em>Related: NFT-styled debit cards the future of Web3 — Animoca founder on $30M Hi investment</em></strong></a></p><p>Mastercard is also becoming part and parcel of the Web3 ecosystem. Earlier this year, Animoca Brands announced a $30 million investment in neobank platform Hi. A unique offering of the platform is a customizable NFT-styled crypto debit card. Users can stylize their Mastercards with NFTs they digitally own - allowing one to potentially show off that prize <em>Bored Ape </em>in the physical world.</p><p>Van would not be drawn to comment on Mastercard’s blockchain and digital asset strategy and partnerships. </p><p><em>Magazine: <a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\">Blockchain detectives: Mt. Gox collapse saw birth of Chainalysis</a></em></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T10:24:59.000Z",
    "title": "Global investors on alert: Yuan dances through Golden Week challenges",
    "url": "https://www.cryptopolitan.com/yuan-dances-through-golden-week-challenges/",
    "description": "The Chinese yuan is preparing for the upcoming Golden Week holiday, which will prompt a temporary trading suspension in mainland China. In contrast, trading continues globally, potentially leading to disparities in asset values. Over the eight days, the absence of daily reference rates is anticipated due to the closure of the onshore market. As the ... <a title=\"Global investors on alert: Yuan dances through Golden Week challenges\" class=\"read-more\" href=\"https://www.cryptopolitan.com/yuan-dances-through-golden-week-challenges/\" aria-label=\"More on Global investors on alert: Yuan dances through Golden Week challenges\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-28T10:24:08.000Z",
    "title": "US SEC may approve Ethereum futures ETFs next week",
    "url": "https://crypto.news/us-sec-may-approve-ethereum-futures-etfs-next-week/",
    "description": "US SEC might approve several Ethereum futures exchange-traded funds (ETFs) as early as next week, Bloomberg analysts note"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-28T10:16:09.000Z",
    "title": "Yuga Labs security engineer briefly detained at a US airport",
    "url": "https://crypto.news/yuga-labs-security-engineer-briefly-detained-at-a-us-airport/",
    "description": "Sam Curry, a security engineer at Yuga Labs, said he was detained at a U.S. airport because he had earlier attempted to investigate a crypto scam"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-28T10:30:08.000Z",
    "title": "Horizen Introduces Groundbreaking DAO for Community-Led Governance",
    "url": "https://www.crypto-news-flash.com/horizen-introduces-groundbreaking-dao-for-community-led-governance/?utm_source=rss&utm_medium=rss&utm_campaign=horizen-introduces-groundbreaking-dao-for-community-led-governance",
    "description": "<img width=\"1014\" height=\"576\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Screenshot-2023-09-28T130327.293.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Horizen\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Screenshot-2023-09-28T130327.293.png 1014w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Screenshot-2023-09-28T130327.293-300x170.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Screenshot-2023-09-28T130327.293-768x436.png 768w\" sizes=\"(max-width: 1014px) 100vw, 1014px\" /> Horizen launches a DAO for community governance, giving $ZEN holders power to shape its future.  DAOs like Horizen&#8217;s are the future of decentralized governance in the blockchain world. Horizen, the open-source blockchain protocol renowned for its vibrant ecosystem, has ushered in an exciting era of community-driven governance by unveiling its Decentralized Autonomous Organization (DAO). This [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-28T10:18:49.000Z",
    "title": "How Federal Reserve Rates Can Impact Bitcoin?",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/how-federal-reserve-rates-can-impact-bitcoin/",
    "description": "<p>Notably, many anticipate this financial challenge to persist and potentially worsen for the Federal Reserve. Ironically, while this might seem like grim news for the Fed, it could be a silver lining for risk assets like Bitcoin. Let&#8217;s discover how the behavior of these rates can impact Bitcoin&#8217;s price. Rising Concerns of Doubling Losses The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/how-federal-reserve-rates-can-impact-bitcoin/\">How Federal Reserve Rates Can Impact Bitcoin?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-28T10:25:31.000Z",
    "title": "Crypto Lawyer: Republican President May Lead To Spot Bitcoin ETF Approval",
    "url": "https://coinedition.com/crypto-lawyer-republican-president-may-lead-to-spot-bitcoin-etf-approval/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"First Bitcoin ETF in Europe Receives an ESG Label, Sparking Debate\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>John Reed Stark, a legal expert popular among crypto circles online, believes that the upcoming elections will play a key role in the crypto policy of the United States. According to the crypto lawyer, politicians who were previously critical of cryptocurrencies may take a friendlier stance given the popularity of crypto assets. Stark took to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-lawyer-republican-president-may-lead-to-spot-bitcoin-etf-approval/\">Crypto Lawyer: Republican President May Lead To Spot Bitcoin ETF Approval</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-28T10:10:09.000Z",
    "title": "Allegations Against Ex-SEC Officials Point to Bias in Ripple Case",
    "url": "https://coinedition.com/allegations-against-ex-sec-officials-point-to-bias-in-ripple-case/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Ripples-100m-defense-against-an-SEC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Ripples-100m-defense-against-an-SEC.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Ripples-100m-defense-against-an-SEC-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Ripples-100m-defense-against-an-SEC-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Ripples-100m-defense-against-an-SEC-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Ripples-100m-defense-against-an-SEC-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Prominent crypto community members have uncovered new allegations against the U.S. Securities and Exchange Commission in its handling of Ripple’s case. The tweets drew lines to connect relationships between former SEC officials involved in Ripple’s lawsuit and a possible conflict of interest in handling the case. In particular, a post by Cowboy.Crypto on X (formerly [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/allegations-against-ex-sec-officials-point-to-bias-in-ripple-case/\">Allegations Against Ex-SEC Officials Point to Bias in Ripple Case</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]