[
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T17:00:00.000Z",
    "title": "Investor Demand for Pandoshi (PAMBO) Surges After DeFi Wallet Launch During Presale",
    "url": "https://www.cryptopolitan.com/investor-demand-for-pandoshi-pambo-surges-after-defi-wallet-launch-during-presale/",
    "description": "While 2024 is barely a month old, it has proven to be an exciting time for crypto investors. While major coins like BTC have seen a steady price increase, investors have found a new breakout star for the year called Pandoshi (PAMBO). Investor demand for PAMBO tokens has recently been surging during the presale. What [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-05T16:58:33.000Z",
    "title": "Bitcoin lover Nayib Bukele re-elected as El Salvador’s president",
    "url": "https://www.cryptopolitan.com/bukele-re-elected-as-el-salvadors-president/",
    "description": "El Salvador has once again cast its vote in favor of the millennial, Bitcoin-enthusiast Nayib Bukele, propelling him to a second term as the nation&#8217;s president. This election, characterized by its focus on the delicate balance between enhancing security and preserving democratic values, has solidified Bukele&#8217;s position not just within the country&#8217;s political landscape but [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-05T16:52:26.000Z",
    "title": "Polkadot and Cardano investors looking at DeeStream presale",
    "url": "https://crypto.news/polkadot-and-cardano-investors-looking-at-deestream-presale/",
    "description": "More investors are exploring DeeStream (DST), choosing the project over established networks like Cardano and Polkadot"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-05T16:51:47.000Z",
    "title": "Google sees spot Bitcoin ETF ad campaigns as ICOs remain banned",
    "url": "https://crypto.news/google-sees-spot-bitcoin-etf-ad-campaigns-as-icos-remain-banned/",
    "description": "Multiple Bitcoin (BTC) ETF issuers are competing to attract investors into America’s first basket of exchange-traded funds using Google ads."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-05T16:47:43.000Z",
    "title": "Tether invests $25m in Oobit to expand crypto payments globally",
    "url": "https://crypto.news/tether-invests-25m-in-oobit-to-expand-crypto-payments-globally/",
    "description": "Tether announced a $25 million investment in mobile payment platform Oobit, facilitating a more accessible path for crypto within everyday commerce. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-05T17:00:56.000Z",
    "title": "Institutions Go All In: Chainlink 30% Rally Makes It The Hot Investment Trend",
    "url": "https://www.newsbtc.com/news/institutions-go-all-in-chainlink-30-rally-makes-it-the-hot-investment-trend/",
    "description": "In a notable shift away from Bitcoin, altcoins have garnered the attention of investors, leading to a slight increase in market caps, despite an overall decrease in trading volumes. Among the altcoins, Chainlink (LINK) has emerged as a standout performer, displaying impressive resilience and attracting substantial holders and institutions. Chainlink Surges, Whales Accumulate Amid Market Shift Chainlink, known as the leading Oracle network in the blockchain space, has not only outpaced the broader market but has also demonstrated impressive individual performance. Over the last 24 hours, LINK has experienced a noteworthy surge, with a 6.1% increase in value and a striking 30% rise in the weekly chart. Currently ranked 11th among altcoins, LINK boasts a 24-hour trading volume of $3.31 billion and a market capitalization of $10.21 billion. LINK price action. Source: Coingecko 📊 #Crypto market caps have edged up +0.5% over the past week, despite trading volumes dropping off -20.3% compared to the week prior. Highlight assets have included $FLR, $RON, $LINK, $TAO, and $RNDR. #Bitcoin continues seeing less attention as eyes turn to pumping #altcoins. pic.twitter.com/jMvJSTdV7c — Santiment (@santimentfeed) February 5, 2024 According to recent data from Lookonchain, a significant accumulation of LINK by a whale or institution has been observed, as evidenced by the withdrawal of 119,583 LINK (equivalent to $2.15 million) from Binance within the past hour. This strategic move indicates a growing confidence and interest in the long-term potential of the token. Related Reading: Meme Coin Blues: Nearly 70% Of Shiba Inu Investors Underwater As Price Flops It seems that a whale/institution is accumulating $LINK! We noticed 4 fresh wallets withdrew a total of 119,583 $LINK($2.15M) from #Binance in the past 1 hour.https://t.co/G09rO9rlwNhttps://t.co/Bby3SaN7cmhttps://t.co/0NowecVP2ahttps://t.co/dVX9K2CNeK pic.twitter.com/KJsY0w7F5W — Lookonchain (@lookonchain) February 5, 2024 Interestingly, as Bitcoin loses ground, LINK deviates from the prevailing market trend, indicating its unique position in the current market landscape. One major impetus behind the altcoin&#8217;s upward movement is the activation of previously dormant wallets that had remained inactive for an extended period. This sudden resurgence has led to the highest age-consumed spike of 5.38 billion, calculated by multiplying the coins moved by the number of days those coins had been dormant. The reintegration of LINK tokens into circulation is believed to have played a pivotal role in the recent surge in their price. However, market analysts remain cautious and are closely monitoring two crucial indicators in the upcoming weeks to assess the token&#8217;s potential for sustained growth. Chainlink currently trading at $19.66 on the daily chart: TradingView.com Dormant Wallets And FUD Dynamics: LINK&#8217;s Monitoring Keeping tabs on dormant wallets and seeing how they affect the network&#8217;s circulation as a whole is the primary goal of the first statistic. The activation of dormant wallets has proven to be a significant driver of LINK&#8217;s recent price increase, and its continued impact will be closely watched. A second indicator that could cause wallet liquidations and have a further effect on the price of LINK is the existence of FUD dynamics, which stand for fear, uncertainty, and doubt. Analysts emphasize the importance of vigilant observation and analysis to identify any signs of FUD and its potential effects on the altcoin market. Related Reading: The $50K Quest: Bitcoin Oracle’s Pre-Halving Proclamation Sparks Excitement While Chainlink&#8217;s recent performance and accumulation by institutions have bolstered its value, experts caution that the sustainability of its price increase remains uncertain. Continued monitoring of the movements of previously inactive wallets and the potential impact of FUD will be crucial in determining the token&#8217;s trajectory in the coming weeks. As the altcoin market continues to evolve, Chainlink stands out as a cryptocurrency that has captured the attention of investors and institutions alike. Its impressive performance, along with the activation of dormant wallets, has contributed to its surge in value. However, market analysts stress the need for continued scrutiny and analysis to gauge the potential for sustained growth in this dynamic market environment. Featured image from Adobe Stock, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-05T17:00:11.000Z",
    "title": "Rebel Satoshi’s Presale Success Sparks Discussions in AAVE and Injective Communities",
    "url": "https://www.crypto-news-flash.com/rebel-satoshis-presale-success-sparks-discussions-in-aave-and-injective-communities/?utm_source=rss&utm_medium=rss&utm_campaign=rebel-satoshis-presale-success-sparks-discussions-in-aave-and-injective-communities",
    "description": "<img width=\"1200\" height=\"750\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-05T132653.634.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-05T132653.634.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-05T132653.634-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-05T132653.634-768x480.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-05T132653.634-150x94.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-05T132653.634-450x281.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />AAVE expects higher network activity if its V3 network deploys on BNB. Injective (INJ) staking numbers have grown as the network enters February on a bullish note. RebelSatoshi ($RBLZ) also creates decentralized communities with equitable access to financial rewards. AAVE’s community has commenced voting over deploying V3 on the BNB chain. Injective has also crossed [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-05T16:47:23.000Z",
    "title": "Elon Musk Sparks Fresh Dogecoin Speculation with Cryptic Move",
    "url": "https://www.crypto-news-flash.com/elon-musk-sparks-fresh-dogecoin-speculation-with-cryptic-move/?utm_source=rss&utm_medium=rss&utm_campaign=elon-musk-sparks-fresh-dogecoin-speculation-with-cryptic-move",
    "description": "<img width=\"1920\" height=\"1189\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-300x186.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-1024x634.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-768x476.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-1536x951.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-163x102.jpg 163w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-24x15.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/07/elon-musk-ge06f12fb7_1920-48x30.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Elon Musk recently liked an old tweet in which he proposed a new university in Texas where the tuition is paid in Dogecoin, and learners get a discount if they own a dog. Musk has been a controversial figure who has pumped DOGE and other cryptos at will with his endorsements, but this has earned [...]"
  }
]