[
  {
    "source": "Decrypt",
    "date": "2023-09-29T16:03:59.000Z",
    "title": "Stablecoins Aren't Securities, Says Circle in SEC Lawsuits Against Binance",
    "url": "https://decrypt.co/199356/stablecoins-arent-securities-says-circle-in-sec-lawsuits-against-binance",
    "description": "Neither BUSD nor USDC is a security, Circle argued—but was careful to say it's not picking sides in the case."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-29T15:59:20.000Z",
    "title": "Amazon Is Giving Away Free Gaming NFTs—Here's How to Claim",
    "url": "https://decrypt.co/151872/amazon-giving-away-free-gaming-nfts-how-claim",
    "description": "UPDATE: A new Mojo Melee champion NFT is now available for Amazon Prime subscribers, along with non-NFT items in Web3 game My Pet Hooligan."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-29T15:47:31.000Z",
    "title": "Three Arrows Capital Co-Founder Su Zhu Arrested in Singapore",
    "url": "https://decrypt.co/199354/three-arrows-capital-co-founder-su-zhu-arrested-in-singapore",
    "description": "Su Zhu will serve a four-month sentence behind bars for not complying with court orders during 3AC's bankruptcy process. "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T15:53:11.000Z",
    "title": "AI Predicts Bitcoin Price Ranges Amid 2024 Halving and Market",
    "url": "https://www.cryptopolitan.com/ai-predicts-bitcoin-price-ranges-amid-2024/",
    "description": "OpenAI&#8217;s launch of its AI platform, ChatGPT, has sparked renewed interest in the field of artificial intelligence, particularly in its applications within today&#8217;s dynamic markets. One of the pressing questions posed to ChatGPT was regarding the potential price trajectory of Bitcoin (BTC) following its highly anticipated halving event in 2024. This event is poised to ... <a title=\"AI Predicts Bitcoin Price Ranges Amid 2024 Halving and Market\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-predicts-bitcoin-price-ranges-amid-2024/\" aria-label=\"More on AI Predicts Bitcoin Price Ranges Amid 2024 Halving and Market\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-29T15:41:52.000Z",
    "title": "Year after FTX collapse: what to expect from SBF trial",
    "url": "https://crypto.news/year-after-ftx-collapse-what-to-expect-from-sbf-trial/",
    "description": "In 2022, FTX crypto exchange filed for bankruptcy, sending shockwaves through the crypto community. Legal actions against its former management have persisted. Nearly a year later, founder Sam Bankman-Fried faces an impending trial."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-29T16:00:58.000Z",
    "title": "MATIC Price Rally Threatened As Whales Deposit Millions Of Tokens To Exchanges",
    "url": "https://www.newsbtc.com/analysis/matic-analysis/matic-price-rally-whales/",
    "description": "Bitcoin has recovered over the last day after gaining momentum from the Valkyrie Ethereum ETF news and pulling up the likes of the MATIC price. This has led to a rare green day for the cryptocurrency market in as many months but MATIC may not be able to hold as well as other altcoins as whales make their move. Whales Move Tens Of Millions To Exchanges The first notable whale transaction involving MATIC was flagged by Lookonchain on Wednesday. The transaction was carrying 10.78 million tokens at the time worth around $5.5 million. Related Reading: IPO Frenzy: What Happens To XRP Price If Ripple Stock Climbs To $600? Mostly, it was the destination of these tokens that was important which turned out to be the Binance crypto exchange. The whale looked to have deposited the tokens to sell them as the MATIC price had taken a quick 3% dive following the deposit. A whale deposited a total of 10.78M $MATIC ($5.5M) into #Binance in the past 26 hours and the price of $MATIC decreased by 3%. The whale currently has 2.72M $MATIC($1.37M) left.https://t.co/C4VNQ1QDq9 pic.twitter.com/8JcoySfsRP — Lookonchain (@lookonchain) September 27, 2023 MATIC would later recover and move into the green, a price increase that seemed to have prompted more whales to take advantage of the situation. Over the course of the day, whale transaction tracker Whale Alert would report multiple whale transactions all carrying millions of dollars worth of the token toward exchanges. The next large transaction was one carrying 11,000,888 tokens worth $5.7 million to the Binance exchange. Another transaction followed shortly carrying the exact number of MATIC tokens also headed for the Binance exchange. Within the same hour, the whale tracker also reported 15,826,267 million MATIC being shifted once again to Binance. This transition was carrying approximately $8.2 million worth of tokens. This pointed toward whales looking to dump large portions of holdings. 🚨 15,826,267 #MATIC (8,199,632 USD) transferred from unknown wallet to #Binancehttps://t.co/fgGpVb7id0 — Whale Alert (@whale_alert) September 28, 2023 MATIC price resting at $0.52 &#124; Source: MATICUSD on Tradingview.com MATIC Price Could Suffer Drawdown The massive amounts of tokens being shifted toward centralized exchanges could mean that the whales are beginning to offload some of their holdings to avoid further losses. In this case, it is not farfetched to say that the altcoin’s rally over the last day might be a brief one. Such a fall could easily see the MATIC price fall back to $0.51 as bears retest the support at $0.5. Related Reading: Analyst Presents 4 Charts That Prove Crypto Is Not Dead However, all hope is not lost for the MATIC price as the coin still holds some bullishness. As one TradingView analyst points out, if the altcoin is able to break out from its current descending triangle, then the price could rally over 50%. MATIC could see an upside to $0.9 &#124; Source: Tradingview.com The analyst puts the first target of this rally at the $0.9 level as well, which is an almost 100% price increase from here. But MATIC will continue to face opposition from bears, making it a tricky situation. At the time of writing, the MATIC price is resting above $0.5232, enjoying 3.06% gains in the last day. Featured image from Cryptopolitan, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-29T16:00:19.000Z",
    "title": "Immutable $IMX Surges 27% In A Day: Can $SOL and $ROE Catch Up?",
    "url": "https://www.crypto-news-flash.com/immutable-imx-surges-27-in-a-day-can-sol-and-roe-catch-up/?utm_source=rss&utm_medium=rss&utm_campaign=immutable-imx-surges-27-in-a-day-can-sol-and-roe-catch-up",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-177.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-177.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-177-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Immutable ($IMX) exploded after being listed on South Korean Upbit exchange. On the other hand, Solana ($SOL) seems ready for a bull market, supported by many developments on its network. Yet, Borroe.Finance ($ROE) is making a name for itself after offering a 50% profit to early investors. Can Immutable and Solana maintain a bullish momentum [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-29T15:57:00.000Z",
    "title": "ETH Reaches 3-Week High After Valkyrie Includes Ether Futures In ETF",
    "url": "https://coinedition.com/eth-reaches-3-week-high-after-valkyrie-includes-ether-futures-in-etf/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Ethereum-is-only-55-Complete-post-Merge-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"ETH Reaches 3-Week High After Valkyrie Includes Ether Futures In ETF\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Ethereum-is-only-55-Complete-post-Merge-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Ethereum-is-only-55-Complete-post-Merge-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Ethereum-is-only-55-Complete-post-Merge-2-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Valkyrie recently received approval to offer Ethereum futures in its existing ETF. The approval pushed ETH’s price to a three-week high of $1,686. On-chain analytics showed that Ethereum was trending after the launch of Ethereum futures ETF. United States-based financial services firm Valkyrie Funds LLC recently received the approval to offer Ethereum futures in its [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/eth-reaches-3-week-high-after-valkyrie-includes-ether-futures-in-etf/\">ETH Reaches 3-Week High After Valkyrie Includes Ether Futures In ETF</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]