[
  {
    "source": "CoinDesk",
    "date": "2024-02-22T23:40:37.000Z",
    "title": "Protocol Village: Research Paper Details 'Snarktor,' Featuring 'Recursive Proof Aggregation'",
    "url": "https://www.coindesk.com/tech/2024/02/21/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Feb. 22-28."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-23T00:01:17.000Z",
    "title": " Reddit converts excess cash into Bitcoin and Ethereum ",
    "url": "https://cointelegraph.com/news/reddit-converts-excess-cash-into-bitcoin-and-ethereum",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMzE5ZmYxOWEtZGRiNy00ZDQxLWEzNzktNWM2NjUxZjhhODJjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The social news network also revealed it has been experimenting with Ether and Polygon as a form of payment for sales of virtual goods.</p>\n                    <p><p>Social media giant Reddit has been using its excess cash to add small amounts of Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC)</a> and Ether <a href=\"https://cointelegraph.com/ethereum-price\">(ETH)</a> to its treasury since 2022 and believes crypto and blockchain have “significant potential,” new filings reveal. </p><p><strong>“</strong>We invested some of our excess cash reserves in Bitcoin and Ether,” Reddit <a href=\"https://www.sec.gov/Archives/edgar/data/1713445/000162828024006294/reddits-1q423.htm\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> in a Feb. 22 <a href=\"https://cointelegraph.com/news/reddit-to-launch-ipo-in-march-report\">initial public offering</a> filing with the United States Securities and Exchange Commission. </p><p>The S-1 registration — used by companies planning on going public — revealed that Reddit recorded $90.8 million in net losses in 2023, though its revenue increased 20.6% to $804 million year-on-year.</p><p><a href=\"https://cointelegraph.com/news/reddit-converts-excess-cash-into-bitcoin-and-ethereum\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-23T00:00:00.000Z",
    "title": " Court-appointed insolvency firm takes over HectorDAO after $2.7M hack ",
    "url": "https://cointelegraph.com/news/court-appointed-insolvency-firm-takes-over-hectordao-after-2-7m-hack",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZjMwOWNkZmEtMDBkZC00Mjk2LWIzYmItMDUwZDM4Y2U1OWQ3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Interpath Advisory has taken control of the HectorDAO Treasury after allegations of an ‘inside job’ hack.</p>\n                    <p><p>Insolvency consultancy firm Interpath Limited has “taken full custody” of the Hector decentralized autonomous organization (Hector DAO) treasury as of February 21. The company, also known as \"Interpath Advisory,\" has likewise taken control of the HectorDAO social media channels, which it intends to use to communicate with investors going forward, according to announcements on the protocol’s Telegram channel that were posted on Feb. 19 and 21.</p><p>HectorDAO was hacked for $2.7 million in January in what <a href=\"https://cointelegraph.com/news/hector-dao-allegedly-ceases-communication-with-investors-after-hack\">analysts have described</a> as either a private key compromise or the work of a rogue developer. Since that time, some of the DAO’s investors have blamed the development team and argued that its assets should be put into the hands of a neutral third-party, which appears to be happening at the time of publication.</p><p>According to the Feb. 19 announcement, “Mr Drury and and Mr Pretlove both of Interpath (BVI) Limited [...] were appointed by the Virgin Islands High Court (Commercial Division), Eastern Caribbean Supreme Court as joint and several interim receivers (the Receivers) over all of the assets held by or on behalf of Hector DAO.” </p><p><a href=\"https://cointelegraph.com/news/court-appointed-insolvency-firm-takes-over-hectordao-after-2-7m-hack\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-22T23:44:54.000Z",
    "title": " StarkWare changes STRK token unlock schedule following controversy ",
    "url": "https://cointelegraph.com/news/starkware-changes-controversial-investor-starknet-token-unlock-schedule",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYjdmMjMyZTYtNjBjZC00NGM5LWE2NzYtZmNiZWQ2MzE0MzkyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Starknet developer StarkWare cited community feedback as the reason it changed its token unlock schedule for its investors.</p>\n                    <p><p>StarkWare has amended its Starknet (STRK) token unlock schedule following concerns that the original plan would allow the network’s investors to dump on retail Starknet users.</p><p>The changes will see a “more gradual” token unlock schedule for its early contributors and investors, implementing smaller, periodic token drops over three years instead of a larger drop which was originally slated in just two months' time.</p><p>“In recent days StarkWare reviewed feedback and decided to adjust the unlocking timeline, making it more gradual,” StarkWare, Starknet's developer, said in a Feb. 22 X post.</p><p><a href=\"https://cointelegraph.com/news/starkware-changes-controversial-investor-starknet-token-unlock-schedule\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-22T23:48:00.000Z",
    "title": "Top Crypto Analyst Who Nailed Bitcoin’s Bear Market Bottom Predicts Solana-Based Memecoin Will Go ‘Parabolic’",
    "url": "https://www.cryptoglobe.com/latest/2024/02/top-crypto-analyst-who-nailed-bitcoins-bear-market-bottom-predicts-solana-based-memecoin-will-go-parabolic/",
    "description": "A top cryptocurrency strategist who has gained a large following on social media after accurately calling bitcoin’s 2018 bear market bottom above $3,000 has recently suggested that meme-inspired cryptocurrency Dogwifhat ($WIF) is set to soon go “parabolic.” In a post shared on the microblogging platform X (formerly known as Twitter), pseudonymous cryptocurrency analyst Bluntz Capital […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-23T00:00:51.000Z",
    "title": "New ATH For WIF? Analyst Thinks Dogwifhat Will Go “Turbo Parabolic” Soon",
    "url": "https://www.newsbtc.com/news/new-ath-for-wif-analyst-thinks-dogwifhat-will-go-turbo-parabolic-soon/",
    "description": "The 2024 bullish rally has fueled the resurgence of the cryptocurrency market during the last few weeks. Memecoins have not been the exception, with coins like BONK recently seeing a rally. Nonetheless, the memecoin market has faced a pullback in the last couple of days, with some of the biggest memecoins, like DOGE and SHIB, showing red numbers. Despite this, an analyst predicted massive gains for dogwifhat (WIF) holders amid the momentary market slowdown. Related Reading: Top Memecoins Face Pullback Amid Recent Market Rally Dogwifhat Could Reach $1 In Its Next Leg Up According to the pseudonym trader and analyst Bluntz, dogwifhat could be preparing for a massive price upsurge soon. On February 10, the analyst forecasted the Solana-based cryptocurrency would reach $1. The trader reaffirmed this prediction in a Tuesday X (former Twitter) post by sharing an updated WIF performance chart. The post highlighted the token’s trajectory before and after reaching its all-time high (ATH) price of $0.47 on Valentine’s Day. what if i told you this next leg on $WIF is going to be the one that goes turbo parabolic? no more pulling back at 50c resistance, this is going to be the push that goes crazy imo. trading this on bybit 👇https://t.co/zHX9WYRMOM pic.twitter.com/5TIHXeaP3i &#8212; Bluntz (@Bluntz_Capital) February 20, 2024 As the chart shows, the memecoin’s price moved from the $0.20 price zone to the $0.38 support level before facing a pullback to the previous zone. In the following days, WIF followed a similar path and climbed to its ATH of $0.47 before retreating again, this time to the $0.38 resistance level. In the chart, the token shows signals of following the same pattern that led to the performance showcased on February 14. This suggests to the analyst that, if recent history repeats itself, the WIF’s price could go “turbo parabolic” during this next leg. Additionally, the pseudonym trader considers that this could be a push that will go “crazy” with “no more pulling back at 50c resistance.” Are Investors Still WIF Their Hats On? Dogwifhat is a cryptocurrency based on the popular 2019 meme of a Shiba Inu dog wearing a pink crochet hat. The meme began popularizing in social media, especially on X, where the eSports community began using it as a profile picture. Last year, the meme’s popularity resulted in the creation of a coin with the same name. The cryptocurrency has quickly gained traction, and despite the ups and downs in the months since its creation, the token is currently among the top 5 memecoins by market capitalization. The memecoin is the second-largest Solana-based memecoin, only behind BONK. As reported by a member of the WIF community, the dog-based cryptocurrency surpassed a total of $2 Billion trading volume on February 19, only 90 days after its launch. Consequentially, whales have recognized the potential of the memecoin and started accumulating the token in large amounts. On Monday, a whale bought 32,149 WIF tokens at $0.38318, worth around $12,318.9. WIF and BTC performance in the last 7 days. Source: CoinGecko The memecoin has closely followed Bitcoin’s performance in the last 7 days, tracing a similar performance path to that of the largest cryptocurrency, as the chart above shows. However, WIF has been down with the rest of the memecoin market during the last week. At writing time, the token is changing hands at $0.3265, a 5.4% price decrease compared to its trading price 24 hours ago. Moreover, the memecoin is also 29.02% lower than its ATH, recorded 8 days ago. The token’s market capitalization is $321.2 million, accounting for a 5.13% decrease in the last 24 hours. WIF is currently the 200th cryptocurrency by this metric. However, the memecoin’s trading volume has increased 9% in the last day, signaling a recent rise in market activity for WIF. Related Reading: Dogecoin Begins Massive Recovery Trend, But Can These Factors Drive A Rally To $0.2? WIF price performance in the 1-day chart. Source: WIFUSDT on TradingView.com Featured image from X.com, Chart from TradingView.com and CoinGecko.com"
  }
]