[
  {
    "source": "Decrypt",
    "date": "2024-03-31T15:15:50.000Z",
    "title": "This Week in Crypto Games: Bitcoin Stolen From 'Call of Duty' Cheaters, 'Notcoin' Airdrop Nears",
    "url": "https://decrypt.co/224227/this-week-crypto-games-bitcoin-swiped-call-duty-notcoin-airdrop-nears",
    "description": "Gamers lose Bitcoin to malware, Notcoin plans its next phase, and the Nyan Heroes demo hits Epic Games. More from a busy week in gaming."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-31T15:36:32.000Z",
    "title": "Avalanche To Hit $180 in Q2 While Solana Reattempts The $200 Threshold - KangaMoon Aims for $1 by Q3 With Bullish Growth Prospects",
    "url": "https://cryptodaily.co.uk/2024/03/avalanche-to-hit-180-in-q2-while-solana-reattempts-the-200-threshold-kangamoon-aims-for-1-by-q3-with-bullish-growth-prospects",
    "description": "As cryptocurrency markets continue to captivate investors' attention, analysts are expressing optimistic sentiments regarding several notable altcoins. Solana (SOL) has garnered significant attention due to its remarkable growth, with projections indicating a milestone of $200."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-31T15:30:09.000Z",
    "title": "Investors Surge to Invest in Raboo (RABT) Since BTC Rallied to $73K! Exposing a Bullish Path for STX and TAO",
    "url": "https://cryptodaily.co.uk/2024/03/investors-surge-to-invest-in-raboo-rabt-since-btc-rallied-to-73k-exposing-a-bullish-path-for-stx-and-tao",
    "description": "As the Bitcoin rally continues beyond the $73k mark, investors feel renewed optimism spilling into the cryptocurrency market. This prevailing bullish sentiment has sparked interest in the new upstart Raboo token."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-31T15:24:27.000Z",
    "title": "3 Meme Coins Skyrocket With Increased Crypto Adoption as Bitcoin Depot's BTM Rollout Continues",
    "url": "https://cryptodaily.co.uk/2024/03/3-meme-coins-skyrocket-with-increased-crypto-adoption-as-bitcoin-depots-btm-rollout-continues",
    "description": "Bitcoin Depot recently announced its plans to install BTM machines in 87 retail locations in Puerto Rico, with 40 of its kiosks already in the pre-installation stage. This expansion highlights the growing acceptance and utility of digital assets."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-31T15:15:49.000Z",
    "title": "The Race for AI Dominance: U.S. Leads as China Hustles to Catch Up",
    "url": "https://www.cryptopolitan.com/u-s-leads-as-china-hustles-to-catch-up/",
    "description": "Rising far beyond, the United States holds a strong lead over China, its top rival, in that booming area. Not only the availability of semiconductor chips and their quality but the entity pioneers also include OpenAI from the U.S. However, the ambitious stride toward self-reliance in chip production and efforts to grow the generative AI [&#8230;]"
  }
]