[
  {
    "source": "Decrypt",
    "date": "2023-11-29T21:51:39.000Z",
    "title": "Stability AI in Turmoil, CEO Under Pressure as Possible Sale Looms",
    "url": "https://decrypt.co/207997/stability-ai-emad-mostaque-controversy-sale-acquisition",
    "description": "Stability AI, known for Stable Diffusion, is exploring a sale as controversy swirls around Emad Mostaque."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-29T21:40:52.000Z",
    "title": "Swiss asset manager Pando Asset joins list of spot Bitcoin ETF applicants",
    "url": "https://cryptoslate.com/swiss-asset-manager-pando-assets-joins-list-of-spot-bitcoin-etf-applicants/",
    "description": "<p>The Switzerland-based asset management firm Pando Asset AG has filed for a spot Bitcoin exchange-traded fund (ETF), as seen in a Nov. 29 filing, marking another addition to the growing list of such applications. The filing is an S-1 registration statement resembling similar spot Bitcoin ETF applications from other asset managers. It describes a trust [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/swiss-asset-manager-pando-assets-joins-list-of-spot-bitcoin-etf-applicants/\">Swiss asset manager Pando Asset joins list of spot Bitcoin ETF applicants</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T21:42:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Binance coin and the entire crypto market have seen little gains in the past few days, as prices have been consolidating in tight regions. BNB prices have dropped by 14.11% since touching $248.9 in August 2023. What does the future hold for Binance Coin? How much is BNB worth? The ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-29T22:00:24.000Z",
    "title": "Bitcoin Eyes New Highs As Bloomberg Analyst Reiterates 90% Chance Of January ETF Approval",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-eyes-new-highs-as-bloomberg-analyst-reiterates-90-chance-of-january-etf-approval/",
    "description": "Bitcoin (BTC), the leading cryptocurrency, is currently in an upward accumulation phase, inching closer to surpassing its current yearly high of $38,390.  This upward trend is further fueled by the anticipation surrounding the approval of Bitcoin spot exchange-traded funds (ETFs) by the US Securities and Exchange Commission (SEC). Bitcoin ETF Approval By January 10 In a recent post on X (formerly Twitter), Erich Balchunas, a Bloomberg ETF expert, shared his perspective on the probability of Bitcoin ETF approval. Balchunas maintains a 90% chance of SEC approval by January 10, which has remained consistent for months.  Related Reading: A Golden Opportunity For Ethereum? 600% Buy Signal Returns Balchunas highlights that while debates over specific dates and timelines persist, the SEC and issuers are diligently working behind the scenes to make ETFs ready for this cycle, defying earlier skepticism. Balchunas stated:  People asking me if we changed odds. No, we still holding line at 90% odds of approval by Jan 10 (aka this cycle), the same odds we&#8217;ve had for months (before it was cool/safe). What we watching for now: more amended/final filings to roll in and clarity on in-kind vs cash creates As predicted by many analysts, Bitcoin is poised for a potential breakout in the upcoming months, both before and after these investment products&#8217; anticipated approval. As reported by NewsBTC, Bitcoin could surge to as high as $50,000 even before the halving event forecasted for April. In this context, Bitcoin must maintain its position above the key support level of $35,000. This mark serves as a threshold for future gains, both preceding and succeeding the approval of spot ETFs.  Upholding this support level will be instrumental in determining Bitcoin&#8217;s prospects for continued growth and market performance. Next Resistance Level Holds Key To Surpassing All-Time High Renowned crypto analyst Crypto Con has shed light on the remarkable strength of the current Bitcoin cycle, drawing comparisons to the previous from 2019 to 2022.  By examining key resistance levels and price movements, Crypto Con emphasizes the positive outlook for Bitcoin&#8217;s price trajectory and suggests that the current cycle is poised for success. Crypto Con highlights the prolonged weakness observed during the 2019-2022 Bitcoin cycle, characterized by Bitcoin&#8217;s struggle to surpass the initial Wave Trend resistance over a year.  Related Reading: XRP Community And Cardano Founder Engage In Heated Clash In contrast, the current cycle has demonstrated impressive resilience, effortlessly breaking through this resistance level. Despite the substantial rise in Bitcoin&#8217;s price, Crypto Con points out that the cryptocurrency has yet to reach the next resistance level, called green zone 2, with a price target of $40,000.  In a typical cycle, this milestone does not indicate the end of price action but rather marks the beginning of a more significant upward trajectory. Crypto Con further suggests that subsequent resistance levels, indicated by the color blue in the chart above, can drive Bitcoin&#8217;s price even higher, surpassing its previous all-time high. At the time of writing, BTC is trading at $37,700, down 0.7% over the past 24 hours, and it remains to be seen if a consolidation above $38,000 will occur.  Featured image from Shutterstock, chart from TradingView.com"
  }
]