[
  {
    "source": "Decrypt",
    "date": "2023-09-04T17:16:43.000Z",
    "title": "‘Crypto Can Be the Gateway to Better Financial Literacy’ Say Researchers",
    "url": "https://decrypt.co/154891/crypto-the-gateway-to-better-financial-literacy-connecticut-university0researchers",
    "description": "Academics from the University of Cincinnati have created a Crypto Literacy Scale to better gauge investors' education levels. "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-04T17:30:46.000Z",
    "title": "Shibarium Surpasses 1 Million Wallets in Meteoric Rise, But SHIB and Associated Tokens Face Turbulent Waters",
    "url": "https://news.bitcoin.com/shibarium-surpasses-1-million-wallets-in-meteoric-rise-but-shib-and-associated-tokens-face-turbulent-waters/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shibber-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shibber-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shibber-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shibber-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shibber-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shibber-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shibber-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shibber.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Shiba Inu&#8217;s layer two (L2) scaling endeavor, Shibarium, has successfully crossed the 1 million wallet threshold since its inception, as evidenced by data from shibariumscan.io. Yet, the project&#8217;s native token, SHIB, has seen a decline of over 4% in the past week and a substantial drop of more than 18% in the previous month. Shiba [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-04T17:36:49.000Z",
    "title": "Binance’s CZ stands firm amid regulatory challenges",
    "url": "https://www.cryptopolitan.com/binances-cz-stands-firm-amid-challenges/",
    "description": "Binance CEO Changpeng Zhao, known as CZ, remains resolute in the face of regulatory scrutiny and negative media attention directed at his cryptocurrency exchange. Instead of being deterred by recent challenges, he views them as an opportunity for Binance to showcase its credibility amidst what he refers to as “FUD” (Fear, Uncertainty, and Doubt). During ... <a title=\"Binance’s CZ stands firm amid regulatory challenges\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binances-cz-stands-firm-amid-challenges/\" aria-label=\"More on Binance’s CZ stands firm amid regulatory challenges\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-04T17:10:53.000Z",
    "title": "South Korea to “track and neutralize” North Korean digital loot",
    "url": "https://www.cryptopolitan.com/south-korea-to-track-and-neutralize-north-korean-digital-loot/",
    "description": "In a swift response to rising cybersecurity threats, South Korea is drafting legislation to track and freeze North Korean cryptocurrency assets. The move comes amid revelations that North Korea pilfered around $1.28 billion in Bitcoin and Ethereum last year alone as part of a larger haul exceeding $3 billion over the past five years. Drawing ... <a title=\"South Korea to “track and neutralize” North Korean digital loot\" class=\"read-more\" href=\"https://www.cryptopolitan.com/south-korea-to-track-and-neutralize-north-korean-digital-loot/\" aria-label=\"More on South Korea to “track and neutralize” North Korean digital loot\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-04T17:30:20.000Z",
    "title": "Shiba Inu Whales Begin Accumulation As Shibarium Grows",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-whales-shibarium/",
    "description": "The success of the Shibarium blockchain so far has led to Shiba Inu whale activity rising once more. These whales have been making large transfers carrying trillions of SHIB tokens worth tens of millions of dollars. This heightened activity, while interesting on its own, is also leading to positive sentiment around them due to their destinations. Shiba Inu Whales Moving Away From Centralized Exchanges A number of large Shiba Inu transactions were highlighted by the popular whale tracking account on X (formerly Twitter) called Whale Alert. The first transaction took place on Saturday, September 2, a couple of days after the Shibarium blockchain went public and started growing. Related Reading: Pro-XRP Legal Expert Takes The Spotlight With Daring Ripple Vs SEC Settlement Theory The transaction saw a total of 4.36 trillion SHIB tokens moved from the Bitvavo exchange to an unknown wallet. This transaction was worth roughly $37 million at the time and was speculated to be moved to a private wallet for holding. 🚨 🚨 4,630,530,677,374 #SHIB (36,696,955 USD) transferred from #Bitvavo to unknown wallethttps://t.co/XWDOaPcc0G — Whale Alert (@whale_alert) September 2, 2023 This is because when crypto users move tokens toward centralized exchanges, it is often to sell due to the deep liquidity. While moving tokens from centralized exchanges to private wallets is often for holding while investors wait for the market to recover. Another similar transaction was then flagged on Monday, September 4, carrying almost the same number of SHIB. The 4.615 trillion SHIB worth $35.69 million was also moved from the Bitvavo exchange to an unknown wallet, presumably for safekeeping. 🚨 🚨 4,615,530,677,374 #SHIB (35,694,206 USD) transferred from #Bitvavo to unknown wallethttps://t.co/ZtTK0oWWWn — Whale Alert (@whale_alert) September 4, 2023 These transactions could signal that the whales are expecting the Shibarium network to grow and positively affect the price of SHIB. The meme token is already showing signs of this recovery its trading volume rose 14% in the last day. Shibarium Continues To Grow Shibarium was launched in late August but despite an initial rocky start, the network seems to have taken it in stride and bounced back stronger. The activity on the network saw its Total Value Locked (TVL) quickly surpass $1 million. TVL crosses $1 million &#124; Source DeFiLlama This was brought about by high activity in decentralized finance (DeFi) protocols such as DogSwap and MARSWAP. The former currently boasts over 50% of Shibarium’s TVL with the latter not too far behind at 26%. Related Reading: Shiba Inu Marketing Lead Sends Important Message To SHIB Holders The network has also crossed the 1 million wallet market in addition to transactions on the blockchain reaching the same figure. However, the TVL has taken a hit to fall from the $1.42 million figure recorded on August 30 to be sitting at $1.05 million at the time of this writing. While the figures may be slowing for Shibarium, it may not mean a total lack of interest. Shibarium was launched in a deep bear market climate, which is one factor that could now be limiting its growth as prices fall. SHIB price shows high volatility &#124; Source: SHIBUSD on Tradingview.com Featured image from Unsplash, chart from Tradingview.com"
  }
]