[
  {
    "source": "Cointelegraph",
    "date": "2023-12-26T02:30:08.000Z",
    "title": " Spot Bitcoin ETF inflows could dwarf all 150 crypto ETPs today ",
    "url": "https://cointelegraph.com/news/spot-bitcoin-etf-inflows-dwarf-150-crypto-etp-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMGY3MjNmYmQtNDU1Yy00Nzg1LTg0ZTMtOWZjZjIxYjZjYmJhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Newly compiled data from BitMEX Research estimates there are 150 crypto ETPs available today, with $50.3 billion in assets under management. </p>\n                    <p><p>United States-approved spot Bitcoin exchange-traded funds (ETFs) could end up dwarfing the entire $50 billion crypto-related ETF market today. </p><p>According to new <a href=\"https://blog.bitmex.com/complete-list-of-cryptocurrency-related-etps/\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from BitMEX research, the current global market for crypto exchange-traded products (ETPs) includes approximately 150 products totaling $50.3 billion in assets under management.</p><p>The list includes spot and futures funds, and typically track the performance of Bitcoin and Ethereum. The largest ETP on the list is Grayscale’s Bitcoin Trust — which is currently attempting to be converted into a spot ETF product. </p><p><a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-inflows-dwarf-150-crypto-etp-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-26T02:23:11.000Z",
    "title": "Bitcoin Price Eyes Fresh Bullish Breakout, Can BTC Make It To $45K?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-eyes-45k/",
    "description": "Bitcoin price corrected gains and tested the $42,650 zone. BTC is again attempting a fresh increase and eyeing a move above the $43,750 resistance. Bitcoin found support above the $42,500 zone and started a fresh increase. The price is trading below $43,550 and the 100 hourly Simple moving average. There is a connecting bearish trend line forming with resistance near $43,600 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh increase if it clears the $43,750 and $44,300 resistance levels. Bitcoin Price Holds Ground Bitcoin price failed to clear the $44,300 resistance zone and started a downside correction. BTC declined below $43,500 level, but the bulls were active above the $42,500 zone. A low was formed near $42,860 and the price is now attempting a fresh increase. There was a move above the $43,200 resistance zone. The price climbed above the 50% Fib retracement level of the downward move from the $44,429 swing high to the $42,680 low. Bitcoin is still trading below $43,550 and the 100 hourly Simple moving average. There is also a connecting bearish trend line forming with resistance near $43,600 on the hourly chart of the BTC/USD pair. The trend line is close to the 61.8% Fib retracement level of the downward move from the $44,429 swing high to the $42,680 low. On the upside, immediate resistance is near the $43,550 level. The first major resistance is forming near the trend line. Source: BTCUSD on TradingView.com A close above the $43,600 resistance could start a decent move toward the $44,300 level. The next key resistance could be near $45,000, above which BTC could rise toward the $46,500 level. Any more gains might send the price toward $47,200. Another Decline In BTC? If Bitcoin fails to rise above the $43,600 resistance zone, it could start a fresh decline. Immediate support on the downside is near the $43,000 level. The next major support is near $42,600. If there is a move below $42,600, there is a risk of more losses. In the stated case, the price could drop toward the $42,000 support in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now near the 50 level. Major Support Levels – $43,000, followed by $42,600. Major Resistance Levels – $43,600, $44,000, and $44,300."
  }
]