[
  {
    "source": "NewsBTC",
    "date": "2024-02-08T21:00:43.000Z",
    "title": "Solana’s Jupiter Reveals Three Token Candidates For Next Launchpad",
    "url": "https://www.newsbtc.com/news/solana/solanas-jupiter-reveals-three-token-candidates-for-next-launchpad/",
    "description": "Solana-based decentralized exchange (DEX) aggregator Jupiter recently announced the possible launch of three new tokens through its launchpad. The announcement follows the launch of its JUP native token via the LFG launchpad last week. Related Reading: Solana DEXs Outperform Ethereum In Key Metric, Here’s What This Means Solana’s Community Holds The Power? After the scheduled closing of the JUP launch pool, Jupiter Exchange and its founder took X (formerly known as Twitter) to reveal the next steps for the Solana-based project. Jupiter: Let&#39;s Go! Hello space catdets! Over the last few months, we built a robust community of catdets with a common vision, scaled up our infrastructure to handle many levels of volume, tested a lot of things together, and overcame a hell lot of adversity together. And now,… &#8212; meow 🥧 (@weremeow) February 7, 2024 As the pseudonym founder Meow stated, the LFG launchpad is Jupiter’s “initiative to grow the pie by helping great projects get the awareness, community, and users to thrive in the long term.” As a result, the founder presented three “OG” Solana projects to the community that could be part of the next launchpad. The first candidate is Sanctum, a liquid staking service with “experience building the first SPL program used by stake pools, and liquidity sources like unstake.it.” The next project, Sharky, is an expanding NFT collateralization platform on Solana that allows “NFT holders to borrow and lend against NFTS to acquire leverage or earn yields.” Closing the list, the cross-chain infrastructure provider deBridge is presented as a project that allows users to trade assets across chains in seconds without the need for wrapped assets or liquidity pools. Jupiter’s founder highlighted that the community would have the final say in any project’s participation on the launchpad. Since LFG is a community initiative where Jupiter’s team “should play no role,” it’s up to the Solana users to discuss and decide if any projects are suitable for launch in the LFG platform. Additionally, the post announced that the introduction process of the projects to the community would take part over the next two weeks through different channels, including special ones for each project and a summary on X. For the future, Jupiter’s team will provide application channels for other projects interested in participating. Next Steps For The Project On February 7, the project confirmed in an update that the launch pool was closing after seven days, as previously scheduled. In the process, 90 million JUP tokens were withdrawn and moved to a cold multi-sig wallet, effectively taking them out of circulation. The project also announced that the launch pool was left with 65.5 million USDC, which would serve as a liquidity backstop for JUP. However, the USDC will be removed over the next couple of months in $10 million batches to allow the JUP token to regain price discovery while simultaneously “assuring all participants that the team is committed to a long-term gradual withdrawal of USDC liquidity.” While all the JUP has been removed, we are leaving ~63.5M of USDC in the launchpool to serve as liquidity backstop for JUP. The USDC will be removed over the next 2-3 months. pic.twitter.com/2AQ7zIKwJO &#8212; Jupiter 🪐 (@JupiterExchange) February 8, 2024 The founder’s post shared Jupiter’s intention to initiate a decentralized anonymous organization (DAO) this month and “incrementally evolve it into the most dynamic, most productive and proactive DAO in space.” Initially, the JUP DAO would focus on evaluating and approving launchpad projects, ratifying budgets for working groups, approving grants, and releasing budgets for ongoing community and ecosystem initiatives. The team’s update specified the steps to encourage the community’s participation and to fund it with the capital to pursue important initiatives. The steps include distributing 75% of future LFG launchpad fees to the governance participants, “100M in JUP earned from the LFG launchpad for voting incentives, and 6.15M in operational funds from JUP Launch.” Related Reading: Solana: Jupiter (JUP) Price Tumbles Amid Controversy – Buy Now? Jupiter is trading at $0.5276 in the daily chart. Source: JUPUSDT on Tradingview.com Feature Image from Unsplash.com, Chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-08T21:00:22.000Z",
    "title": "Bernstein Analysts Say Bitcoin Will Explode to New All-Time Highs on ETF-Fueled Rallies: Report",
    "url": "https://dailyhodl.com/2024/02/08/bernstein-analysts-say-bitcoin-will-explode-to-new-all-time-highs-on-etf-fueled-rallies-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/bitcoin-analyst-explode-new.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/bitcoin-analyst-explode-new.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/02/bitcoin-analyst-explode-new.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/02/bitcoin-analyst-explode-new.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/02/bitcoin-analyst-explode-new.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/bitcoin-analyst-explode-new.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/02/bitcoin-analyst-explode-new.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Analysts at Wall Street brokerage giant Bernstein reportedly think that Bitcoin (BTC) will surge into the $70,000 range by the end of the year. According to a new report by StreetInsider, analysts Gautam Chhugani and Mahika Sapra say in a new research note that the impact of the recently approved spot BTC exchange-traded funds (ETFs) [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/08/bernstein-analysts-say-bitcoin-will-explode-to-new-all-time-highs-on-etf-fueled-rallies-report/\">Bernstein Analysts Say Bitcoin Will Explode to New All-Time Highs on ETF-Fueled Rallies: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-08T20:55:17.000Z",
    "title": "Crypto Trader Says Altcoin Market Cap Is About To Begin a ‘Historic’ Breakout – Here’s What Could Set It Off",
    "url": "https://dailyhodl.com/2024/02/08/crypto-trader-says-altcoin-market-cap-is-about-to-begin-a-historic-breakout-heres-what-could-set-it-off/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/Mini-Altcoin-Season.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/Mini-Altcoin-Season.jpg 1748w, https://dailyhodl.com/wp-content/uploads/2023/10/Mini-Altcoin-Season.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/Mini-Altcoin-Season.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/Mini-Altcoin-Season.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/Mini-Altcoin-Season.jpg?resize=1536,900 1536w, https://dailyhodl.com/wp-content/uploads/2023/10/Mini-Altcoin-Season.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/10/Mini-Altcoin-Season.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst says altcoin markets are set to break out. Pseudonymous crypto trader Rekt Capital tells his 396,000 followers on the social media platform X that the altcoin market cap is about to blow. &#8220;Altcoin market cap is on the cusp of a historic breakout&#8221; According to the trader, Ethereum&#8217;s (ETH) current run could [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/08/crypto-trader-says-altcoin-market-cap-is-about-to-begin-a-historic-breakout-heres-what-could-set-it-off/\">Crypto Trader Says Altcoin Market Cap Is About To Begin a ‘Historic’ Breakout – Here’s What Could Set It Off</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]