[
  {
    "source": "Decrypt",
    "date": "2024-01-08T11:03:00.000Z",
    "title": "Bitcoin ETF Approval Odds Raised to 95%: Bloomberg Analyst",
    "url": "https://decrypt.co/211935/bitcoin-etf-approval-odds-raised-to-95-bloomberg-analyst",
    "description": "A Bloomberg Intelligence analyst puts the odds of a Bitcoin ETF being approved in January at 95%, as crunch time looms for the SEC's decision."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-08T11:00:00.000Z",
    "title": " Nebraska bill seeks fair play for crypto mining, ownership ",
    "url": "https://cointelegraph.com/news/nebraska-bill-seeks-fair-play-crypto-mining-ownership",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOWMyZDRhNmItZWZhYi00NzFjLTkwZWEtNzI1NGIxNmM2MWUyLkpQRw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Blockchain Basics Act would allow individuals to host blockchain nodes and conduct crypto mining operations in residential properties without any license requirements, among other benefits. </p>\n                    <p><p>The legislature of Nebraska saw the introduction of a bill seeking to establish basic crypto standards in the state.</p><p>On Jan. 5, United States Senator Eliot Bostar introduced the legislative <a href=\"https://nebraskalegislature.gov/FloorDocs/108/PDF/Intro/LB991.pdf\" target=\"_blank\" rel=\"noopener nofollow\">bill</a> 911, which seeks the adoption of the Blockchain Basics Act. The bill aims to establish regulations to promote a safe and legal cryptocurrency mining, holding and trading environment for the citizens of Nebraska.</p><p>The Blockchain Basics Act would allow individuals to host blockchain nodes and conduct crypto mining operations in residential properties without requiring them to hold licenses. However, all operators would also be subject to compliance with local noise ordinances. Crypto businesses, on the other hand, would be required to operate from designated industrial zones only.</p><p><a href=\"https://cointelegraph.com/news/nebraska-bill-seeks-fair-play-crypto-mining-ownership\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-08T10:58:02.000Z",
    "title": "AI Revolutionizes Farming: A Glimpse into the Future of Agriculture",
    "url": "https://www.cryptopolitan.com/ai-revolutionizes-farming-a-glimpse-into-the-future-of-agriculture/",
    "description": "Artificial Intelligence (AI) is revolutionizing farming practices in ways that were once considered unimaginable. In this era of technological advancement, British agriculture stands at the forefront of innovation, with AI making remarkable strides in transforming the industry. Countryfile presenter Adam Henson explores the exciting developments in AI and its impact on farming. The changing landscape [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-08T10:45:43.000Z",
    "title": "The Impact of Generative AI on Daily feLi",
    "url": "https://www.cryptopolitan.com/the-impact-of-generative-ai-on-daily-feli/",
    "description": "Generative AI, exemplified by tools like ChatGPT, is poised to revolutionize not only professional landscapes but also the fabric of our daily lives. The transformative potential extends beyond conventional expectations, ushering in unexpected changes that touch various aspects of our routines. Generative AI stands at the forefront of transforming the entertainment industry. From music tailored [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-08T11:03:52.000Z",
    "title": "XRP to surge 390,000%; InQubeta presale approaches $9m",
    "url": "https://crypto.news/xrp-to-surge-390000-inqubeta-presale-approaches-9m/",
    "description": "InQubeta is approaching $9 million in the ongoing QUBE presale. Meanwhile, analyst says XRP can reach $2,500 in the next few years"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-08T10:54:53.000Z",
    "title": "Japan’s largest community e-commerce platform to start accepting Bitcoin this year",
    "url": "https://crypto.news/japans-largest-community-e-commerce-platform-to-start-accepting-bitcoin-this-year/",
    "description": "Mercari, a leading online community marketplace in Japan, plans to introduce Bitcoin (BTC) as a payment option for its platform users by June 2024, a report from Japanese media outlet Nikkei confirms. According to a report in Japan’s Nikkei, Mercari&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-08T10:52:41.000Z",
    "title": "Binance releases Proof of Reserves audit, showing 100% backed assets",
    "url": "https://crypto.news/binance-released-proof-of-reserves-audit-showing-100-backed-assets/",
    "description": "Cryptocurrency exchange Binance has conducted its twelfth audit of reserves held on the exchange. Binance has released an audit of its crypto reserves published on Jan. 1, revealing that it controls 597,658.074 Bitcoins (BTC) and 4,265,238.882 Ethereum (ETH). The exchange&#8217;s&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-08T10:39:50.000Z",
    "title": "Analyzing spot Bitcoin ETF impact; meme coin craze buoys Dogecoin and Rebel Satoshi",
    "url": "https://crypto.news/analyzing-spot-bitcoin-etf-impact-meme-coin-craze-buoys-dogecoin-and-rebel-satoshi/",
    "description": "The approval of a spot Bitcoin ETF and the increasing popularity of meme coins like Dogecoin and Rebel Satoshi are big events in crypto "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-08T10:50:36.000Z",
    "title": "Injective Poised For Breakout? Unlock Event Sparks $60 INJ Price Surge Forecasts",
    "url": "https://www.newsbtc.com/news/injective-poised-for-breakout-unlock-event-sparks-60-inj-price-surge-forecasts/",
    "description": "Injective (INJ), the native token of the decentralized exchange protocol Injective Protocol, stands poised for a pivotal moment. On January 21st, a final tranche of 3.66 million INJ tokens will be unlocked, bringing the total circulating supply to a definitive 100 million. Injective Token Unlock: Market Dynamics Shift This marks the culmination of a phased release schedule outlined in Injective&#8217;s token distribution plan, and will see the remaining 16% of token supply flood the market. Analysts remain divided on the potential impact of this event. Some anticipate increased selling pressure due to the sudden influx of tokens, potentially leading to a price dip. Others view the unlock as a positive catalyst for liquidity, making INJ easier to trade and potentially attracting new investors. 🚨 Final Cliff Unlocks Alert 🚨 Mark your calendars for January 21, 2024$INJ will be fully unlocked (100%) Get ready for the massive cliff unlocks. 🪙 3.66 m tokens 💰 132.4 m dollars 🌀 4.35% of cir. supply Allocations: &#8211; Advisors: $12.04 m &#8211; Team: $120.37 m$INJ was… pic.twitter.com/EYCyv4hsuC — Token Unlocks (@Token_Unlocks) January 7, 2024 Related Reading: Akash Who? Lesser-Known Altcoin Rules Weekend’s Top 100 List With 40% Rally INJ market cap currently at $3.19 billion. Chart: TradingView.com Regardless of the short-term price action, the full token unlock undeniably represents a turning point for Injective, marking the complete transition from initial distribution to sustained market dynamics. It will be fascinating to observe how the community and market respond to this milestone event, and whether it paves the way for further growth and adoption of the Injective Protocol. $INJ Bullish Flag Formation..!! Seems lie Ready for Another Bullish Rally.#Crypto #InjectiveNetwork #INJ pic.twitter.com/OcPsNJ7laX — Captain Faibik (@CryptoFaibik) January 6, 2024 Some market participants, such as analyst Captain Faibik, believe that Injective may be ready for another rally in anticipation of the impending event. According to Faibik, INJ has established a bullish flag and might see a rise beyond $60. Faibik examines the chart and finds two rallies that are joined by a brief period of consolidation. These might potentially lead to a continuing upswing with higher highs and lowers. However, given that the market crashed on January 3 and that INJ price originally dropped to $33.55, selling pressure could be imminent. The 4-hour chart shows rising volatility, and the Bollinger Bands point to overbought circumstances following INJ&#8217;s prior surge to $40.28. INJ Price Analysis Source: TradingView The price of INJ has been trending downwards over the past 24 hours. It is currently trading at $37.412, down from a high of $37.875 earlier in the day. The Bollinger Bands (BB) are also trending downwards. This suggests that volatility is decreasing, as the price is staying closer to the moving average. The Chaikin Money Flow (CMF) is negative. This indicates that bears are currently in control of the market. The volume is relatively low. This suggests that the recent price decline is not due to a large amount of selling pressure. Overall, the chart suggests that INJ is in a bearish trend. However, the low volume suggests that this trend may not be sustained. It is important to note that this is just a snapshot of the market and that conditions can change quickly. Source: Santiment The ongoing unlocking of the token holds the promise of bolstering INJ&#8217;s social metrics, indirectly contributing to a positive influence on its price. This is particularly crucial as increased community engagement often aligns with higher social metrics, reinforcing the token&#8217;s popularity. The sustained high Social Dominance of INJ signifies robust community support, a vital factor in navigating the unpredictable cryptocurrency market. Related Reading: Cardano Surges Nearly 250% In Development Activity, Whale Buying Appetite – Details Simultaneously, the improvement in INJ&#8217;s Weighted Sentiment indicates a prevailing bullish sentiment within the market. This positive outlook among investors sets the stage for heightened trading activity, potentially triggering an uptrend in the token&#8217;s valuation. Both Social Dominance and Weighted Sentiment serve as valuable indicators, providing insights into the token&#8217;s current state and the prevailing market sentiment. Featured image from Shutterstock"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-08T10:51:50.000Z",
    "title": "2 Reasons Why Satoshi Nakamoto May Still Be Alive",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/2-reasons-why-satoshi-nakamoto-may-still-be-alive/",
    "description": "<p>Despite his disappearance in 2010, there are intriguing clues that suggest Satoshi might still be among us. This article explores three compelling reasons fueling the belief that Satoshi Nakamoto is alive and well. 1) Rare Satoshis in the First Bitcoin Wallet One of the most fascinating aspects that hint at Satoshi&#8217;s potential existence is the [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/2-reasons-why-satoshi-nakamoto-may-still-be-alive/\">2 Reasons Why Satoshi Nakamoto May Still Be Alive</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-08T10:58:53.000Z",
    "title": "Whale Accumulates 1,750 BTC Amid BTC ETF Approval — FOMO Alert?",
    "url": "https://coinedition.com/whale-accumulates-1750-btc-amid-btc-etf-approval-fomo-alert/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Bitcoin_Whale_Makes_Waves_Moving_11_Million_After_Years_of_Inactivity.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Number Of Bitcoin Whales Holding Over 1K BTC Is On The Rise\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Bitcoin_Whale_Makes_Waves_Moving_11_Million_After_Years_of_Inactivity.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Bitcoin_Whale_Makes_Waves_Moving_11_Million_After_Years_of_Inactivity-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Bitcoin_Whale_Makes_Waves_Moving_11_Million_After_Years_of_Inactivity-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Bitcoin_Whale_Makes_Waves_Moving_11_Million_After_Years_of_Inactivity-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Bitcoin_Whale_Makes_Waves_Moving_11_Million_After_Years_of_Inactivity-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Bitcoin_Whale_Makes_Waves_Moving_11_Million_After_Years_of_Inactivity-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Lookonchain, a market analytical platform reported that a Whale accumulated 1,750 $BTC ($76.9 million) from Binance in the past 2 days at $43,953. This whale activity comes at the crucial stage where the market anticipates the BTC ETF approval. Additionally, this smart whale accumulated 6,000 $BTC ($158.66 million) at $26,444 from August 24 to September [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/whale-accumulates-1750-btc-amid-btc-etf-approval-fomo-alert/\">Whale Accumulates 1,750 BTC Amid BTC ETF Approval — FOMO Alert?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-08T10:42:00.000Z",
    "title": "ETF Approval and Launch: Analyst Insights on Crucial Developments",
    "url": "https://coinedition.com/etf-approval-and-launch-analyst-insights-on-crucial-developments/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/01/Bitcoin-ETF-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2024/01/Bitcoin-ETF-2.jpg 730w, https://coinedition.com/wp-content/uploads/2024/01/Bitcoin-ETF-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/01/Bitcoin-ETF-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/01/Bitcoin-ETF-2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/01/Bitcoin-ETF-2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/01/Bitcoin-ETF-2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/01/Bitcoin-ETF-2-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/01/Bitcoin-ETF-2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/01/Bitcoin-ETF-2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/01/Bitcoin-ETF-2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/01/Bitcoin-ETF-2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/01/Bitcoin-ETF-2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/01/Bitcoin-ETF-2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/01/Bitcoin-ETF-2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/01/Bitcoin-ETF-2-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/01/Bitcoin-ETF-2-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The crypto community is anticipating fruitful developments this week as analysts predicted January of 2024 to be a significant month for crypto. Nate Geraci, a prominent figure in the crypto space, recently wrote on X, sharing insights on major events expected this week that hopefully revolutionize the crypto market. One of the key developments is [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/etf-approval-and-launch-analyst-insights-on-crucial-developments/\">ETF Approval and Launch: Analyst Insights on Crucial Developments</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]