[
  {
    "source": "CoinDesk",
    "date": "2024-01-17T09:23:51.000Z",
    "title": "Indonesian Crypto Exchanges Blame Dramatic Drop in Trading Volumes Partly on High Taxes",
    "url": "https://www.coindesk.com/policy/2024/01/17/indonesian-crypto-exchanges-blame-dramatic-drop-in-trading-volumes-partly-on-high-taxes/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Indonesian crypto exchanges saw a sharp 60% drop in trading volumes in 2023, challenging its reputation as a fast adopter of digital assets."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-17T09:14:53.000Z",
    "title": " US GAO recommendations to SEC before spot Bitcoin ETF approval revealed ",
    "url": "https://cointelegraph.com/news/us-gao-recommendation-sec-spot-bitcoin-etf-approval-revealed",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMjU4NDhlYjYtMzU3Yy00YzQzLThjNTEtOGIwMjA5NDdlYzBlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>In its assessment, the GAO found that although the SEC has a dedicated wing toward emerging technologies, it’s not well equipped to deal with the current challenges and needs specific improvements. </p>\n                    <p><p data-ct-non-breakable=\"true\">The United States Government Accountability Office (GAO) <a href=\"https://www.gao.gov/products/gao-24-106635\" target=\"_blank\" rel=\"noopener nofollow\">recommended</a> three key execution plans to the Securities and Exchange Commission (SEC) before its spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund (ETF) approval on Jan. 10. The recommendations were focused on workforce management for the digital asset market and how the regulator would deal with the nascent industry in the coming years.</p><p>The GAO recommendations were put forward to the SEC on Dec. 15 and made public on Jan. 16. The GAO report recommends that the SEC prepare a new workforce plan, document policies and procedures for its Strategic Hub for Innovation and Financial Technology (FinHub) internal controls, as well as developing performance goals and measures for the hub. </p><p>GAO is an independent, nonpartisan audit institution of the U.S. federal government within the legislative branch that offers auditing, evaluative and investigative services for the U.S. Congress. </p><p><a href=\"https://cointelegraph.com/news/us-gao-recommendation-sec-spot-bitcoin-etf-approval-revealed\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-17T09:30:02.000Z",
    "title": "Tether Criticizes UN Report for Ignoring USDT’s Role in Helping Developing Economies",
    "url": "https://news.bitcoin.com/tether-criticizes-un-report-for-ignoring-usdts-role-in-helping-developing-economies/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2166747387-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2166747387-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2166747387-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2166747387-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2166747387-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2166747387-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2166747387-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2166747387.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Tether, the issuer of the stablecoin USDT, has blasted the findings of a United Nations Office on Drugs and Crime study which ignore the stablecoin&#x2019;s &#x201C;role in helping developing economies in emerging markets.&#x201D; According to Tether, the stablecoin&#x2019;s use of public blockchains means every transaction is trackable, making it &#x201C;an impractical choice for illicit activities.&#x201D; [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T09:38:26.000Z",
    "title": "Socket resumes operations after $3.3M exploit",
    "url": "https://www.cryptopolitan.com/socket-resumes-operations-after-3-3m-exploit/",
    "description": "Interoperability service Socket and its bridging platform Bungee have resumed operations after a security breach led to a temporary halt in trading.&#160; The exploit amounted to approximately $3.3 million when attackers targeted wallets with infinite approvals to Socket contracts. Approvals are authorizations for blockchain-based tools that enable applications to access tokens in a user&#8217;s wallet. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T09:33:00.000Z",
    "title": "Temporary relief for crypto businesses as IRS delays enforcement of reporting rules",
    "url": "https://www.cryptopolitan.com/irs-delays-enforcement-of-reporting-rules/",
    "description": "The U.S. Treasury Department and the Internal Revenue Service (IRS) have recently announced a significant postponement in enforcing new reporting requirements for digital asset transactions. This delay is a notable development in the financial and cryptocurrency sectors, as it marks a temporary relief for businesses grappling with the evolving landscape of crypto regulations. The Infrastructure [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T09:30:17.000Z",
    "title": "Banks Ramp Up Investment in Technology to Combat AI-Driven Fraud",
    "url": "https://www.cryptopolitan.com/banks-ramp-up-investment-in-technology/",
    "description": "Financial institutions are increasing their technology investments to counter the surge in AI-powered fraud, according to a recent survey by regtech firm Complyadvantage. The study reveals that 86% of financial compliance chiefs are actively exploring new technologies, including AI, to combat fraud, with 66% identifying AI-powered scams as an emerging threat. Growing investment in technology [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T09:28:47.000Z",
    "title": "Phishing scammers target users amid Socket Protocol chaos",
    "url": "https://www.cryptopolitan.com/scammers-target-socket-protocol-users/",
    "description": "In a shocking turn of events, Socket, a prominent cross-chain infrastructure protocol, has fallen victim to a significant security exploit, resulting in the loss of $3.3 million from its associated contracts.&#160; The breach, confirmed by the Socket team, has sent shockwaves through the crypto community, prompting urgent action to mitigate further damage. Socket protocol exploit [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T09:17:20.000Z",
    "title": "Healthcare Sector Anticipates Resurgence in 2024, Citi Analysts Say",
    "url": "https://www.cryptopolitan.com/healthcare-anticipates-resurgence-in-2024/",
    "description": "The healthcare sector, a critical component of the global economy, faced its share of setbacks in 2023. Negative earnings-per-share (EPS) guidance for the fourth quarter and year-over-year earnings drops in several S&#38;P 500 sectors, including health care, left many investors cautious. Notable disappointments included Agilent Technologies Inc., a leader in life sciences, diagnostics, and applied [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-17T09:34:32.000Z",
    "title": "Rebel Satoshi raises $1.5m in presale, XRP and Litecoin uptrend remain",
    "url": "https://crypto.news/rebel-satoshi-raises-1-5m-in-presale-xrp-and-litecoin-uptrend-remain/",
    "description": "Rebel Satoshi has raised over $1.5 million in presale. Analysts remain bullish on Litecoin and XRP"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-17T09:34:09.000Z",
    "title": "Manta overtakes Base in terms of TVL volume",
    "url": "https://crypto.news/manta-overtakes-base-in-terms-of-tvl-volume/",
    "description": "Manta Network has surpassed the Base Network to become Ethereum&#8217;s fourth largest Layer 2 solution. According to the L2Beat platform, $858 million has already been locked in smart contracts on the new Manta Network blockchain. The surge in interest in&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-17T09:31:23.000Z",
    "title": "Binance’s market share declined by 5% amid regulatory pressure, data shows",
    "url": "https://crypto.news/binances-market-share-declined-by-5-amid-regulatory-pressure-data-shows/",
    "description": "Despite facing regulatory challenges, Binance has retained its position in the industry, with only a marginal decrease in its market share, according to TokenInsight. Binance experienced a 5% decline in market share, dropping from 54.2% to 48.7%. This shift followed&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-17T09:20:16.000Z",
    "title": "The Grayscale Effect: The Bitcoin Price Has A New Prime Trading Hour",
    "url": "https://www.newsbtc.com/news/bitcoin/grayscale-effect-bitcoin-price-new-prime-trading-hour/",
    "description": "The crypto trading landscape is witnessing a paradigm shift with the recent introduction of spot Bitcoin ETFs in the United States, catalyzing a new wave of trading dynamics. Bloomberg analyst James Seyffart revealed that the total trading volume of the US spot Bitcoin ETFs over a span of the first three days approached the $10 billion mark. This substantial volume was predominantly led by Grayscale&#8217;s GBTC, with a three-day trading volume amounting to $5.174 billion, followed by BlackRock&#8217;s IBIT at $1.997 billion, and Fidelity’s FBTC at $1.479 billion, cumulating to an aggregate trading volume of approximately $9.771 billion. Update on the #Bitcoin ETF Cointucky Derby. The ETFs have traded almost $10 billion total over 3 days. Will have updated flows and assets later tonight or tomorrow morning. pic.twitter.com/OnpCshjYJP &#8212; James Seyffart (@JSeyff) January 16, 2024 Despite these impressive figures, Bitcoin&#8217;s price performance has not mirrored the trading volume&#8217;s growth, a phenomenon analysts attribute to a strategic pivot among Grayscale&#8217;s clientele. Investors are increasingly transitioning their capital from Grayscale&#8217;s GBTC, with its 1.5% annual fee, to more cost-effective spot BTC ETFs, some offering fees as low as 0.25%. This shift, however, is not seamless due to the cash-redemption process prescribed by the Securities and Exchange Commission (SEC). Consequently, investors find themselves navigating a temporal gap, redeeming cash and reallocating it to other spot BTC ETFs, typically a few days later. Understanding The Grayscale Effect On Bitcoin Price This operational characteristic of Grayscale&#8217;s GBTC, which does not facilitate same-day cash redemptions for BTC and operates on a T+2 or T+1 settlement basis, has given rise to a discernible trading pattern. Alex Thorn, Head of Research at Galaxy, provided insight into this phenomenon, stating: We&#8217;re seeing significant Bitcoin trading volume now during US hours, particularly between 3-4pm NY now during the ETF fix, escalating into what has lately been a predictable Grayscale dump into the close. The game is evolving. Echoing this sentiment, Daan Crypto Trades observed a consistent pattern in Grayscale&#8217;s operations, highlighting, &#8220;Grayscale is sending X amount of Bitcoin to Coinbase ~1 hour before the market opens every trading day. Will be a good indicator to gauge how bad the outflows of GBTC are I think. 4K BTC was sent Friday. 9K BTC was sent [Monday].&#8221; Related Reading: Grayscale Transfers Almost 12,000 BTC To Coinbase, Bitcoin Price Reacts Further substantiating these observations, Maartunn from CryptoQuant remarked on the tangible outflow of Bitcoin from Grayscale&#8217;s fund, particularly to Coinbase, stating, &#8220;Data doesn&#8217;t lie, as seen once again. Shortly after the inflow of Bitcoin from Grayscale to Coinbase, the Coinbase Premium Gap, previously positive, turned negative for the first time this year, indicating strong selling pressure from Coinbase.&#8221; He emphasized the correlation between these events and the increased trading volume on Coinbase, especially during the trading hours of the American stock market. Related Reading: Bitwise CIO Equates Bitcoin ETF Impact To 1.4 Halvings: What This Means Crypto analyst James Van Straten further detailed the pattern of Grayscale redemptions to Coinbase Prime, noting, &#8220;We&#8217;re starting to see a pattern of Grayscale redemptions to Coinbase Prime just before the market opens. 9k Bitcoin ($387M) sent to Coinbase Prime all before 2:30 (GMT) on Jan 16. On Jan. 12, 4k Bitcoin before the market opened.&#8221; As these patterns continue to manifest and evolve, the Grayscale effect is evidently reshaping the prime trading hour for Bitcoin, introducing a new layer of complexity and strategy in the crypto trading arena. Importantly, the Grayscale selling pressure will not last forever, but as long as it exists, it could continue to put some pressure on the Bitcoin price. Until then, following the Grayscale flows could be crucial for determining BTC price trends. Grayscale still holds circa 587,000 to 617,000 Bitcoin, depending on the data provider. At press time, BTC traded at $42,754. Featured image from DALL·E  3, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-17T09:37:14.000Z",
    "title": "Chainlink and Circle Unite: USDC Now Crosses Chains with Ease",
    "url": "https://www.crypto-news-flash.com/chainlink-and-circle-unite-usdc-now-crosses-chains-with-ease/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-and-circle-unite-usdc-now-crosses-chains-with-ease",
    "description": "<img width=\"2133\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-LINK-Oracles-with-trading-charts-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-LINK-Oracles-with-trading-charts-background.jpg 2133w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-LINK-Oracles-with-trading-charts-background-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-LINK-Oracles-with-trading-charts-background-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-LINK-Oracles-with-trading-charts-background-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-LINK-Oracles-with-trading-charts-background-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-LINK-Oracles-with-trading-charts-background-2048x1152.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-LINK-Oracles-with-trading-charts-background-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-LINK-Oracles-with-trading-charts-background-450x253.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-LINK-Oracles-with-trading-charts-background-1200x675.jpg 1200w\" sizes=\"(max-width: 2133px) 100vw, 2133px\" />Chainlink&#8217;s CCIP has successfully incorporated Circle&#8217;s Cross-Chain Transfer Protocol (CCTP), offering users a streamlined process for transferring USDC across various blockchain networks. Chainlink&#8217;s CCIP acts as a cross-chain communication software while Circle&#8217;s CCTP facilitates USDC transfers between chains through burning and minting processes. Chainlink&#8217;s Cross-Chain Interoperability Protocol (CCIP) has successfully integrated Circle&#8217;s Cross-Chain Transfer Protocol [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-17T09:11:39.000Z",
    "title": "Bitcoin ETFs Hit $10 Billion in 3-Day Surge",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/bitcoin-etfs-hit-10-billion-in-3-day-surge/",
    "description": "<p>This remarkable surge in activity underscores the growing mainstream acceptance and interest in digital assets. With investors eagerly embrace the opportunity to gain exposure to the world&#8217;s leading cryptocurrency through traditional financial instruments. Bitcoin ETFs: $10 Billion Trading Frenzy and Future Speculation The market&#8217;s response to the rapid influx of trading activity has been overwhelmingly [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/bitcoin-etfs-hit-10-billion-in-3-day-surge/\">Bitcoin ETFs Hit $10 Billion in 3-Day Surge</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]