[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-19T21:48:52.000Z",
    "title": "Worldcoin Price Prediction 2023 – 2030: How High Will WLD Go?",
    "url": "https://www.cryptopolitan.com/worldcoin-price-prediction/",
    "description": "Worldcoin, spearheaded by OpenAI chief Sam Altman,&#160;launched&#160;on Monday, 24 July 2023, after years in development, promising to verify users’ identity by iris-scanning and potentially solving one of the more pressing problems posed by recent advances in artificial intelligence. When it surged in price as an opening salvo, there was a flurry of criticisms about it, ... <a title=\"Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/worldcoin-price-prediction/\" aria-label=\"More on Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-19T21:45:00.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-19T22:00:47.000Z",
    "title": "Ethereum Whale Avoids Market Crash, Do They Know Something You Don’t?",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-whale-avoids-market-crash/",
    "description": "While the broader cryptocurrency market recently took a nosedive, some mysterious Ethereum whale successfully escaped with $41 million worth of ETH. Days later, the price of ETH went down, along with BTC and other cryptocurrencies. Did this whale know something the rest of the market didn&#8217;t? Ethereum Whale Sells $41 Million Before Market Crash In the early hours of August 18, the crypto market saw investors reacting to SpaceX selling its $373 million Bitcoin holdings, pushing down Bitcoin by more than 8% in a matter of minutes. During this period, the crypto market cap dropped to $1.1 trillion,  and Ethereum also saw its value plummet by almost 6%.  Related Reading: Valkyrie Taps Into Ethereum Momentum With New ETF Filing On-chain data provided by Lookonchain reveals that a smart Ethereum whale dumped 22,341 ETH worth $41 million just prior on August 14. On-chain investigation shows that the whale moved their ETH holdings to the Binance exchange and then withdrew $41 million worth of Tether USDT. While this whale still made a loss of $1.7 million in the sale, if they hadn&#8217;t moved their funds, they would have lost at least $5 million in the crash.  The whale was very smart and dumped 22,341 $ETH ($41M) before the market crashed. Even though he lost ~$1.7M this time, he successfully avoided the market crash. Perhaps he will buy $ETH back at a cheaper price in the future. Follow this smart whale.👇https://t.co/S4Wv8XRlhW pic.twitter.com/BcdzdpmbIA — Lookonchain (@lookonchain) August 18, 2023 Coincidentally, this isn&#8217;t the first time this trader has made headline trades. This savvy Ethereum whale has shown signs of being able to predict market movements before and has had a 100% winning rate in recent months.  The whale profited from the SEC and Spot Bitcoin ETFs saga. When ETH plummeted in reaction to news of the SEC rejecting spot Bitcoin applications from BlackRock and other investment companies, this whale saw this as an opportunity to buy the dip on June 30.  They bought 8,188 ETH worth $15.23 million at $1,860 per ETH, and ETH would later rise to $1948.60 in the hours after. A smart whale deposited 25K $ETH ($47.24M) to #Binance and withdrew 15.9M $USDT 12 hrs ago. The whale is very good at buying $ETH at low prices and selling at high prices to make a profit. He has a 100% win rate of trading $ETH in the past 2 months.https://t.co/dT9p6jeCtr pic.twitter.com/pTuJAwL81O — Lookonchain (@lookonchain) June 28, 2023 Do Whales Sometimes Have Insider Knowledge? While we can&#8217;t know for sure if whales have access to insider information, their actions are worth paying attention to. It could be that this whale knew something was going to trigger a price crash or was just making the right trading decision at the right time.  Related Reading: Here Are The Factors That Could Be Behind The Latest Bitcoin Wipeout Nevertheless, whale moves could signal future price action due to the sheer size of their holdings. So by closely following the on-chain activity of major holders, investors might gain useful insights.  The market is still yet to bounce back from the recent dip. At the time of writing, ETH is down by 1.80% in the past 24 hours and down by 10.19% in a 7-day timeframe. Bitcoin and XRP are also down by 11.87% and 19.87%, respectively in a 7-day timeframe. ETH price jumps to $1,681 &#124; Source: ETHUSD on Tradingview.com Featured image from iStock, chart from Tradingview.com"
  }
]