[
  {
    "source": "Cointelegraph",
    "date": "2024-01-31T03:02:59.000Z",
    "title": " Que? Spanish gov’t X account seen hunting crypto airdrops ",
    "url": "https://cointelegraph.com/news/spanish-embassy-spotted-hunting-crypto-airdrops",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZmZlZDNkMWItZjE3Yy00NWM5LTkzNTYtZWViMzUyYjIxYWFkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The official social media account for the Spanish embassy in Bosnia and Herzegovina has been particularly interested in upcoming airdrops from Jupiter and Dymension. </p>\n                    <p><p>The official social media account for the Spanish embassy in Bosnia and Herzegovina has been spotted messaging crypto projects for details concerning airdrops and upgrades, leading onlookers to speculate that its account may have been compromised. </p><p>“Wen Jupiter Snapshot?” the Spanish embassy’s X account asked in a now-deleted <a href=\"https://x.com/EmbEspanaByH/status/1752454065466843603\" target=\"_blank\" rel=\"noopener nofollow\">response</a> to an X post from the WEN memecoin page on Jan. 30.</p><p>The embassy also pestered the gaming blockchain network BEAM for details concerning its launchpad. </p><p><a href=\"https://cointelegraph.com/news/spanish-embassy-spotted-hunting-crypto-airdrops\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-31T03:00:10.000Z",
    "title": "Marathon vs Riot: Analyzing the true cost of mining 1 bitcoin",
    "url": "https://cryptoslate.com/marathon-vs-riot-analyzing-the-true-cost-of-mining-1-bitcoin/",
    "description": "<p>Bitcoin mining is the cornerstone of the crypto industry and the crypto market. At its core, the profitability of mining comes down to a single, crucial metric — the cost of producing each bitcoin. The importance of this cost becomes even greater when it comes to publicly traded Bitcoin mining companies, as it&#8217;s essentially what [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/marathon-vs-riot-analyzing-the-true-cost-of-mining-1-bitcoin/\">Marathon vs Riot: Analyzing the true cost of mining 1 bitcoin</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-31T03:00:54.000Z",
    "title": "Famed Analyst Richard Bove Says US Dollar Is Finished as World’s Reserve Currency — Expects China to Overtake US Economy",
    "url": "https://news.bitcoin.com/famed-analyst-richard-bove-says-us-dollar-is-finished-as-worlds-reserve-currency-expects-china-to-overtake-us-economy/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/dick-bove-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Famed Analyst Richard Bove Says US Dollar Is Finished as World&#039;s Reserve Currency — Expects China to Overtake US Economy\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/dick-bove-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/dick-bove-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/dick-bove-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/dick-bove-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/dick-bove-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/dick-bove-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/dick-bove.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Renowned financial analyst with over 54 years of experience, Richard Bove, has warned that the U.S. dollar is finished as the world&#8217;s reserve currency, cautioning that China will overtake the U.S. economy. He warned that the offshoring of American manufacturing poses a significant threat to the financial sector and the U.S. dollar. Richard Bove&#8217;s Economic [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-31T03:00:30.000Z",
    "title": "DOGE Bull Mark Cuban Talks Crypto, NFTs, And More In Community AMA",
    "url": "https://www.newsbtc.com/dogecoin-2/doge-bull-mark-cuban-talks-crypto-nfts-and-more-in-community-ama/",
    "description": "On January 29, Mark Cuban, the businessman and television personality, took to the X platform (formerly known as Twitter) to have a conversation with his audience and the crypto community online. Related Reading: Dogecoin Price Prediction – DOGE Bulls Aim For Fresh Rally To $0.095 What Projects Does Mark Cuban Invest in? The Ask Me Anything (AMA) session asked about Cuban’s thoughts on various crypto-related topics. Notably, his replies to the community suggested the importance of a project’s utility for the Shark Tank investor. When asked about his thoughts on crypto, Cuban stated &#8220;I hate the speculation but love when there is utility,” similarly replying to a different question about on-chain finance “needs new ideas with more utility.” Additionally, he explained that Bitcoin’s Layer 2 solution aimed at scaling “doesn’t matter at all,” and emphasized his belief that “It’s applications with unique utility that matter.” Cuban believes blockchain technology is here to stay but identifies two issues. The first concerns the existence of “too many blockchains,” and the second is the lack of an application that makes the technology &#8220;indispensable&#8221; for all generations. For these reasons, the businessman thinks blockchain technology’s future is in the air but reaffirms that “it will always have a place.” However, he doesn’t consider blockchain security one of the biggest problems. During the AMA session, the Shark Tank investor listed Polygon (MATIC), and Injective (INJ) as two projects he’s interested in outside the flagship cryptocurrency and the largest altcoin. When asked about his concerns on the project and growth of injective, Cuban said he didn’t have any, but he hopes “they do well” as he is an investor. The Doge community took part in the questions, and Cuban admitted that he enjoys being part of the community. He also confirmed that The Dallas Mavericks continue to accept DOGE as a payment method. I don’t think about it &#8212; Mark Cuban (@mcuban) January 29, 2024 What Emerging Technology Will Thrive in The Next Decade? Regarding non-fungible tokens (NFTs), the investor explained “They are a collectible in most cases but can be used for other things,” and suggested that people should buy them to collect and not to speculate. Similarly, he expresses the challenges of selling these assets as he hasn’t found “a compelling aspect yet.” Similarly, Cuban indicated that he is &#8220;not a fan&#8221; of tokenizing assets, such as sports teams and real estate, as he doesn&#8217;t think it &#8220;adds enough value.&#8221; Entrepreneurs &#8212; Mark Cuban (@mcuban) January 29, 2024 Cuban shared his views on the future of emerging technologies, affirming that he only sees Artificial Intelligence (AI) significantly impacting entrepreneurship in the next decade. Saying, “There will be two types of companies in the USA. Those who are great at AI and everyone else.” Lastly, he was constantly asked about his thoughts on X owner and Tesla founder Elon Musk. He addressed their relationship by simply replying: “I don’t not get along with him. I don’t know him. He likes to talk shit on here and so do I.” Related Reading: Dogecoin Founder Fires Back At Ripple CEO: “DOGE Is Essentially The Same Thing As BTC” DOGE is trading at $0.08139 in the hourly chart. Source: DOGEUSDT on Tradingview.com Feature image from Unsplash.com, Chart from Tradingview.com"
  }
]