[
  {
    "source": "Cointelegraph",
    "date": "2023-06-01T13:51:00.000Z",
    "title": "Georgian central bank to launch AML probe into crypto firms",
    "url": "https://cointelegraph.com/news/georgian-central-bank-to-launch-aml-probe-into-crypto-firms",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/2b380ef3-fa91-4695-8535-9955ab11014a.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The National Bank of Georgia will launch mandatory supervision of virtual asset service providers starting from Sept. 1, 2023.</p>\n                    <p><p>Georgia, a major cryptocurrency-friendly country among Post-Soviet states, is preparing to start monitoring crypto firms to prevent money laundering and comply with sanctions.</p><p>The National Bank of Georgia plans to launch mandatory supervision of virtual asset service providers (VASP) starting Sept. 1, 2023.</p><p>NBG’s acting governor Archil Mestvirishvili said that the new regulatory measures will help the country combat money laundering, the local news agency InterPressNews <a href=\"https://www.interpressnews.ge/ru/article/152513-archil-mestvirishvili-natsbank-osushchestvliaet-monitoring-sobliudeniia-sanktsii/\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> on May 31.</p><p>In line with Anti-Money Laundering considerations, the upcoming VASP probe is expected to increase the country’s compliance with <a href=\"https://cointelegraph.com/news/eu-crypto-sanctions-against-russia-has-an-unexpected-enforcer\">Western sanctions against Russia and Belarus</a>. </p><p>Mestvirishvili noted that NBG is among the main authorities that supervise compliance with those sanctions. The supervision was especially active last year when global jurisdictions like the United States and the European Union imposed sanctions against Russia, he added, stating:</p><blockquote>“We have created an additional department for monitoring sanctions. The enforcement of the sanctions is very important and the financial sector takes it very seriously.”</blockquote><p>In addition to the VASP supervision, the NBG is also preparing to enforce a set of major restrictions for foreign bank account holders. Starting from Sept. 1, Russian citizens will not be allowed to withdraw more than 20% from their savings accounts immediately.</p><p>According to the central bank, such measures aim to support Georgia’s economic stability amid the increasing foreign currency deposits by Russians. “Since this capital inflow may be of a temporary nature, it’s better to keep it in liquid funds,” the regulator reportedly <a href=\"https://tass.ru/ekonomika/17890455\" target=\"_blank\" rel=\"noopener nofollow\">said</a>.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/tether-expands-reach-in-georgia-through-investment-in-citypay-io\"><strong><em>Tether expands reach in Georgia through investment in CityPay​.io</em></strong></a></p><p>The news comes amid the Georgian government preparing to approve cryptocurrency-related legislation in the autumn session. As previously reported, a local draft bill on crypto regulation aims to <a href=\"https://cointelegraph.com/news/georgia-aims-to-adopt-european-crypto-standards-for-anti-money-laundering\">coordinate local laws with major European Union directives</a> and provide legal status to entities involved in digital asset trading.</p><p>The upcoming crypto rules are also designed to prevent the use of crypto for money laundering and terrorist financing and help Georgia become a major global crypto hub.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\">Bitcoin is on a collision course with ‘Net Zero’ promises</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-01T13:45:00.000Z",
    "title": "Increasing number of divorce proceedings involve crypto",
    "url": "https://cointelegraph.com/news/increasing-number-of-divorce-proceedings-involve-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/cc0416d7-e522-462f-9e3a-8720ef2767cb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Lawyers say they are seeing an increasing number of divorce settlements featuring digital assets. </p>\n                    <p><p>Most crypto investors probably aren’t thinking about divorce or what will happen to their digital assets in the event of separation, but lawyers say it’s becoming a very common scenario as more people hold crypto assets. </p><p>Last year, market research firm GWI <a href=\"https://datareportal.com/reports/digital-2022-global-overview-report\" target=\"_blank\" rel=\"noopener nofollow\">suggested</a> that as much as <a href=\"https://cointelegraph.com/news/world-population-reaches-8-billion-but-how-many-are-in-crypto\">10.2% of global internet users </a>aged 16 to 64 own crypto, with most ownership skewed toward nations experiencing high inflation or fluctuation in the value of their national currency.</p><p>Independent data and statistics tracker World Population Review <a href=\"https://worldpopulationreview.com/country-rankings/divorce-rates-by-country\" target=\"_blank\" rel=\"noopener nofollow\">suggests</a> the divorce rate worldwide varies between lows of 0.15 divorces per 1,000 residents in Sri Lanka to highs of 5.52 per 1,000 people in the Maldives.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/85812a1a-f734-4b8c-b893-f7ecc50d7f89.png\"  /><figcaption style=\"text-align: center;\"><em>Divorce rates by country. Source: World Population Review</em></figcaption></figure><p>Speaking to Cointelegraph, Claire Walczak, a senior associate from <a href=\"https://cointelegraph.com/news/israel-puts-the-brakes-on-cash-to-spur-digital-payments\">independent law firm Lander &amp; Rogers</a>, who works in the firm’s family and relationship law practice, says family lawyers are seeing an increasing number of divorce settlements featuring digital assets.</p><p>She says it’s a “rapidly changing and evolving area of law,” so it’s important to have specialist family law advice if you have a matter involving digital assets.</p><p>According to Walczak, once divorce proceedings start, the court follows a process to determine how property and financial matters will be settled. </p><p>This can include determining what assets are available for division, assessing the parties’ respective contributions, considering whether it is just and equitable to make any adjustments, and evaluating each party’s future needs. </p><p>The same process applies when dealing with digital assets. Both parties in the divorce are obligated to disclose all documents concerning their assets, digital or otherwise. </p><p>Walczak says both parties to a property settlement are entitled to retain the crypto as part of their overall property settlement entitlements, regardless of whose name it is held.</p><p>If both parties seek to retain the crypto and fail to reach an agreement, courts may consider factors such as, who paid for the crypto, and who owns the wallet, when deciding who retains the asset. </p><p>“As part of this process, the court identifies and values the existing assets of the parties, which includes all digital assets,” Walczak said. </p><p>“In the case of cryptocurrency, the value of the asset type is determined by the open market and can be assessed via an exchange,” she added. </p><h2>Market fluctuations can affect values</h2><p>The crypto market can be volatile at the best of times, <a href=\"https://cointelegraph.com/news/ftx-collapse-the-crypto-industry-s-lehman-brothers-moment\">with exchange collapses</a> and other factors <a href=\"https://cointelegraph.com/news/why-have-bitcoin-and-crypto-lost-60-of-their-market-cap-since-their-all-time-highs\">pushing values down</a> without warning. </p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) — the largest cryptocurrency by market capitalization — achieved an all-time high of over $68,000 on Nov.10, 2021, but has since lost a considerable portion of its value and sits at roughly $28,000 at the time of writing. </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\">Bitcoin is on a collision course with ‘Net Zero’ promises</a></em></strong></p><p>Walczak says the volatile and <a href=\"https://cointelegraph.com/news/why-is-the-crypto-market-down-today\">rapid fluctuations in crypto value</a> can be a factor when splitting assets during divorce proceedings. </p><p>“This can pose a risk to clients seeking to retain a large proportion of their property settlement entitlements in the form of cryptocurrency. This may need to be factored into the property settlement,” Walczak said. </p><p>“Once the value is determined, the parties can negotiate as to who will retain the cryptocurrency or, if neither party wishes to retain the cryptocurrency, whether it will be sold,” she added.</p><p>She noted that another consideration for family lawyers is that people who have acquired crypto as an investment asset must pay capital gains tax on any disposal, exchange or swap. </p><p>According to Walczak, if both parties in a divorce agree that the crypto should be sold as part of the property settlement, then the capital gains tax liability will be realized and form part of the asset pool. </p><p>“If, however, a party elects to retain cryptocurrency as an investment, then the capital gains tax liability will not be triggered, and the party retaining that asset may hold substantial unrealized capital gains,” Walczak said. </p><p>“Once it is determined who will retain the cryptocurrency or whether it will be sold, this can be documented in court orders,” she added. </p><p><a href=\"https://www.lexology.com/library/detail.aspx?g=85665730-344b-47fb-92fd-33312a2ce64c\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to the legal research platform Lexology, the case law on issues relating to cryptocurrency and its value is limited. However, there have been several high-profile cases in recent years where the value of crypto assets has taken center stage. </p><p>Lexology cites the 2020 Australian case of Powell vs. Christensen, where one party in divorce proceedings had purchased crypto, and the other sought the digital asset to be valued at its original purchase value rather than the market price. </p><p>The party who purchased the crypto argued that its value had decreased significantly since the purchase but did not disclose any documentation to support the case.</p><p>Ultimately, the Family Court of Australia determined the purchase value should be used for the divorce settlement rather than the reduced market value. </p><h2>Staking and divorce </h2><p>Walczak says crypto staking rewards can also form part of either spouse’s income and are recorded on their individual tax returns — similar to how dividends are dealt with.</p><p><a href=\"https://cointelegraph.com/news/crypto-staking-how-to-pick-the-best-staking-coins-for-passive-income\">Crypto staking</a> involves locking up crypto holdings to earn interest or rewards. Staking is also how specific blockchain networks verify transactions.</p><p>“This will have the effect of increasing that spouse’s taxable income, which may impact upon their final property settlement entitlements,” she said. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/ae2483f1-838c-4f9d-80f4-ebfadc62dd71.png\"  /></figure><p>She also noted that if a spouse elects to retain the “crypto staking rewards,” they will be retaining a potential income-generating asset, which may impact upon that party’s property settlement entitlements.</p><p>A party may also request to be paid in a particular currency, which could include crypto; however, Walczak says a party can’t elect to pay another party in a currency where it is seen to disadvantage the recipient of that payment.</p><h2>Laws in place to keep everybody honest</h2><p>In a recent case, the divorce proceedings of a New York couple took a turn after a forensic accountant helped <a href=\"https://cointelegraph.com/news/housewife-finds-husband-s-bitcoin-stash-amid-divorce-proceedings\">track down the husband’s stash</a> of BTC, which he was trying to hide from his wife. </p><p>Australian digital assets lawyer Joni Pirovich told Cointelegraph that broadly, crypto tokens are included in the pool of assets for division in a divorce.</p><p>Pirovich, the principal at Blockchain &amp; Digital Assets, also noted specific laws requiring each spouse to be truthful about the assets and other forms of property owned.</p><p>During her career, she has already had experience with crypto divorce cases and revealed there are options available to help track down any hidden crypto. </p><p>According to Pirovich, one of the parties often knows the other has purchased crypto, but the other is not being truthful or doesn’t know how to aggregate the information.</p><p>“In some cases, a ‘legal request’ is made of the other party to produce the information,” she said. </p><p>“In other cases, I have provided contacts such as crypto tax specialists or crypto forensic specialists to assist with identification of crypto tokens held, and profits/losses made from crypto token activities to assets with the fair and equitable division of property in a divorce,” she added. </p><h2>Prenuptial agreements and crypto</h2><p>A prenuptial agreement, or pre-nup, is a common legal agreement a couple makes before they marry concerning the ownership of their respective assets should the marriage fail.</p><p>According to Pirovich, crypto can be included in a binding financial agreement, including a prenuptial style agreement.</p><p>She says if a binding financial agreement exists, then specific entitlements to specific assets, such as crypto tokens, must be honored according to that agreement.</p><p><strong><em>Recent: </em></strong><a href=\"https://cointelegraph.com/news/housewife-finds-husband-s-bitcoin-stash-amid-divorce-proceedings\"><strong><em>Wife finds husband’s Bitcoin stash amid divorce proceedings</em></strong></a></p><p>However, if there is no pre-nup, then factors such as the length of the marriage, financial and non-financial contributions throughout the marriage, and whether one party will become the primary or substantial carer of any children are relevant factors in splitting the asset pool.</p><p>“Often, the party not involved in crypto tokens does not wish to receive any share of crypto tokens but rather the fiat currency amount invested, or their share of profits on the sale of the crypto tokens paid to them in fiat currency,” Pirovich said. </p><p>Ultimately, to avoid any issues down the track, she advises honest and open discussions with a partner about finances on a regular basis. </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/cricket-star-ab-de-villiers-ventures-into-web3\">From cricket to crypto: AB de Villiers ventures into Web3</a></em></strong></p><p>“There can be emotional reasons why a person seeks to maintain a level of financial independence from the marriage and assets treated as jointly owned by the couple. This tends to come up for people reentering marriage after a first divorce,” Pirovich said. </p><p>“At least annual discussions should be had about crypto and the couple’s financial position as part of annual tax return filing obligations, and at least every three years when the couple considers their wills and estate planning documents and revisions required,” she added. </p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-01T13:58:08.000Z",
    "title": "Bitcoin Magazine Ventures launches Bitcoin Ecosystem Fund with Sora Ventures’ support",
    "url": "https://cryptoslate.com/bitcoin-magazine-ventures-launches-bitcoin-ecosystem-fund-with-sora-ventures-support/",
    "description": "<p>Bitcoin Magazine Ventures, managed by David Baily and Tyler Evans, is launching the world&#8217;s first Bitcoin Ecosystem Fund. The venture capital fund, dedicated exclusively to investing in the Bitcoin ecosystem, is raising $30 million and is already oversubscribed by $90 million, according to internal sources shared with CryptoSlate. The new fund emphasizes the growth of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-magazine-ventures-launches-bitcoin-ecosystem-fund-with-sora-ventures-support/\">Bitcoin Magazine Ventures launches Bitcoin Ecosystem Fund with Sora Ventures&#8217; support</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-01T13:49:04.000Z",
    "title": "Cardano’s Commercial Arm EMURGO Breaks Down CIP-1694: A Bullish Future for ADA Holders?",
    "url": "https://www.cryptoglobe.com/latest/2023/06/cardanos-commercial-arm-emurgo-breaks-down-cip-1694-a-bullish-future-for-ada-holders/",
    "description": "In an article published earlier today, EMURGO, the official commercial arm of Cardano, offered an in-depth analysis of the Cardano Improvement Proposal (CIP) 1694, shedding light on its potential implications for Cardano ADA holders. EMURGO’s detailed breakdown provides a comprehensive understanding of CIP-1694 and its potential impact on the Cardano ecosystem. According to EMURGO, Cardano, […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-01T14:00:00.000Z",
    "title": "Uphold Launches New Uphold Institutional OTC Trading and Research Services",
    "url": "https://cryptodaily.co.uk/2023/06/uphold-launches-new-uphold-institutional-otc-trading-and-research-services",
    "description": "<p>Crypto Valley Conference, Rotkreuz, Switzerland, June 1, 2023&nbsp; - Uphold, the Web3 financial platform, today announced a new offering for all classes of institutional investors trading digital assets. This is the first solution to provide institutional grade research, optimal OTC execution, superior product breadth - offering more than 280 assets - and settlement in multiple currencies.</p>\n<p>The OTC Platform: Branded Uphold Ascent, the customizable OTC trading platform is designed for optimal execution, handling large orders with minimal price impact and competitive&nbsp; pricing.</p>\n<ul>\n<li> &nbsp; &nbsp; &nbsp; Superior Liquidity: with connection to 29 trading venues, Ascent allows traders to smart route orders to centralized exchanges, decentralized exchanges and Layer 2 networks.</li>\n<li> &nbsp; &nbsp; &nbsp; Expansive Digital Asset Coverage: Uphold has set a high bar in the industry for depth of product, offering more than 280 tokens, including access to many assets unavailable on other OTC platforms</li>\n<li> &nbsp; &nbsp; &nbsp; Trading Expertise: our team is comprised of CeFi, DeFi and high-frequency trading experts</li>\n<li> &nbsp; &nbsp; &nbsp; Fully Customizable trading tools and order management interface</li>\n</ul>\n\n<p>&ldquo;Whether institutional investors are trading digital assets now, or looking to get into the space, our new Ascent OTC platform and in-depth research will provide them access to comprehensive and extensive insights and the deepest liquidity pool in digital asset management through which to execute trades,&rdquo; said Simon McLoughlin, Chief Executive Officer of Uphold.</p>\n\n<p>Token Discovery: Uphold Intelligence, digital asset research, has proven to identify meaningful assets early. With Dr. Martin Hiesbock, Head of Research at Uphold Institutional, clients gain direct access to first-hand knowledge of what is happening and about to happen in the market.</p>\n\n<p>&ldquo;We sort through the assets with just flash from those that have fundamental value for our clients,&rdquo; said Scott Kaplan, Chief Executive Officer of Uphold Securities. &ldquo;We identify important digital assets early based on sound methodology intended to spot fundamental long term value.&rdquo;</p>\n\n<p>&nbsp;</p>\n<p>About Uphold</p>\n<p>Ranked #1 in the San Francisco Business Times Fast 100 List, Uphold is committed to making Web3 easy. As a Web3 financial platform, Uphold serves over 10 million customers in more than 180 countries. It provides businesses and consumers with easy access to financial technology and services. Uphold&rsquo;s patented &ldquo;Anything to Anything&rdquo; platform gives end users seamless access to and between digital assets and national currencies and precious metals. To learn more about Uphold&rsquo;s products and services visit uphold.com.</p>\n<ul>\n<li>Certain currencies and assets are not available in all jurisdictions ###</li>\n</ul>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n<p></p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-01T13:45:00.000Z",
    "title": "First Digital Rolls Out FDUSD Amid HK Crypto Regulation",
    "url": "https://cryptodaily.co.uk/2023/06/first-digital-rolls-out-fusd-amid-hk-crypto-regulation",
    "description": "<p>Hong Kong-based First Digital Group has announced the introduction of a new stablecoin that will be pegged to the United States Dollar but regulated in Asia.&nbsp;</p>\n<p>The announcement comes shortly after Hong Kong announced the introduction of a new regulatory framework for digital assets in its jurisdiction.&nbsp;</p>\nThe First Digital USD\n<p>The new stablecoin christened the &ldquo;First Digital USD&rdquo; or FDUSD, is intended to be backed on a 1:1 basis with the USD or an asset of equivalent fair value. First Digital also added that the reserves backing the stablecoin would be held in segregated accounts at different institutions in Asia. This is to prevent the co-mingling of assets. The FDUSD stablecoin will be backed by &ldquo;high-quality reserves&rdquo; and issued by the First Digital Trust, a trust company registered under Hong Kong&rsquo;s Trust ordinance. The stablecoin has been issued on BNB and Ethereum, with the company in discussions with major exchanges for a listing. First Digital, in its statement, added,&nbsp;</p>\n\n<p>&ldquo;First Digital Labs will work closely with local and overseas regulatory authorities to ensure full compliance with current and future applicable laws and regulations, and First Digital Labs will participate in the shaping of their evolution, including the shaping of any regulatory regimes that FDUSD and/or First Digital may fall under in the foreseeable future. Stablecoins provide increased stability, a form of remittance, a hedge against central bank policymakers who seek to influence their domestic currencies.&rdquo;</p>\n\n<p>The CEO of First Digital, Vincent Chok, stated that the launch represented a major stride forward in providing an efficient and secure digital currency integrated into transactions.&nbsp;</p>\n\n<p>&ldquo;The launch of this stablecoin represents a major stride forward in our mission to provide a secure and efficient digital currency that can be seamlessly integrated into everyday transactions.&rdquo;</p>\n\nHong Kong Enacts Guidelines&nbsp;\n<p>The announcement comes at a time when Hong Kong&rsquo;s &ldquo;Guidelines for Virtual Asset Trading Platform Operators&rdquo; that are becoming effective on the 1st of June 2023. The new rules define clear standards for the safe custody of assets, avoidance of conflict of interest, segregation of client assets, and cybersecurity standards that are expected from licensed trading platforms.&nbsp;</p>\n\n<p>&ldquo;Providing clear regulatory expectations is the key to fostering responsible development. Hong Kong&rsquo;s comprehensive virtual assets regulatory framework follows the principle of &lsquo;same business, same risks, same rules&rsquo; and aims to provide robust investor protection and manage key risks. This will enable the industry to develop sustainably and support innovation.&rdquo;</p>\n\n<p>The Securities and Futures Commission (SFC) will also provide additional guidance on the new regulatory requirements and other implementation details, such as license application procedures and information about transitional arrangements. Regulators in Hong Kong have stated that stablecoins should not be allowed for trading by investors until the proposed rules for the asset class are implemented in its jurisdiction.&nbsp;</p>\nRegulatory Uncertainty In The US Continues&nbsp;\n<p>Meanwhile, regulatory uncertainty in the United States is continuing and has pushed major players to warn regulators that it could lose its position as a leader in the sector. The warning comes as many firms in the country are weighing their options and looking to shift to friendlier jurisdictions. According to Brian Armstrong, Coinbase CEO, with the regulatory uncertainty in the US, it was not surprising that Hong Kong was positioning itself as a crypto hub.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T13:53:34.000Z",
    "title": "Everything to know about First Digital’s USD-backed stablecoin",
    "url": "https://www.cryptopolitan.com/everything-about-first-digital-stablecoin/",
    "description": "The Asian financial technology firm First Digital has unveiled its latest innovative venture, a USD-pegged stablecoin coined First Digital USD (FDUSD). This pivotal move broadens the scope of stablecoins currently available on the market, providing an exciting alternative for individuals seeking increased stability amid the fluctuating financial environment. Revolutionary aspirations: First Digital&#8217;s stablecoin First Digital&#8217;s ... <a title=\"Everything to know about First Digital&#8217;s USD-backed stablecoin\" class=\"read-more\" href=\"https://www.cryptopolitan.com/everything-about-first-digital-stablecoin/\" aria-label=\"More on Everything to know about First Digital&#8217;s USD-backed stablecoin\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T13:43:44.000Z",
    "title": "Crypto companies: Layoffs and hires amid industry shifts",
    "url": "https://www.cryptopolitan.com/crypto-companies-layoffs-hires-amid-shifts/",
    "description": "A new wave of employee restructuring is sweeping across the digital currency world. Binance, the widely recognized crypto exchange, is at the center of this change with plans to cut 20% of its workforce come June. Despite earlier assurances that there would be no layoffs, the company has framed this move as a shift in ... <a title=\"Crypto companies: Layoffs and hires amid industry shifts\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-companies-layoffs-hires-amid-shifts/\" aria-label=\"More on Crypto companies: Layoffs and hires amid industry shifts\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-01T13:45:16.000Z",
    "title": "XRP Hype Spikes As Price Surges 12%, Is This A Top Signal?",
    "url": "https://www.newsbtc.com/news/ripple/xrp-hype-spikes-price-surges-12-will-lead-to-top/",
    "description": "Data shows the hype around XRP has spiked as the asset has registered a 12% gain during the past week, something that may lead to a top. XRP Social Dominance Has Surged To High Values Recently According to data from the on-chain analytics firm Santiment, crowd optimism around XRP has shot up recently. A relevant indicator here is the &#8220;social volume,&#8221; which measures the total number of unique social media text documents that are currently making mentions of a given coin or topic. These &#8220;social media text documents&#8221; refer to text-based posts or threads sourced from various popular social media platforms like Reddit, Twitter, and Telegram. Since this metric only measures the unique number of such documents, it means that even if a post mentions the cryptocurrency in question several times, its share of the social volume still only remains one unit. Because of this restriction, the indicator can provide a reliable picture of whether the users in the wider social media platforms are discussing the asset or not right now. Another indicator, called &#8220;social dominance,&#8221; is also of interest here; this metric compares the social media of the cryptocurrency (which would be XRP in the current case), to that of the combined social volume of the top 100 assets by market cap in the sector. Now, here is a chart that shows the trend in the XRP social volume, as well as the social dominance, over the last year: The two metrics seem to have observed some pretty high values in recent days &#124; Source: Santiment on Twitter As displayed in the above graph, both the XRP social volume and the social dominance have spiked to high levels recently. At the peak of this surge, the latter indicator had hit a value of 16.2%, which means that 16.2% of all discussions on social media websites related to the top 100 assets were about the token. Related Reading: Bitcoin Wealth Is Transferring From Old To New Hands, Why This Is Positive These elevations in the social metrics of the cryptocurrency have come as the price has outperformed all the largest coins in the market after registering a gain of more than 12% during the past week. Generally, whenever the social volume rises along with a price rise, it means that the investors are becoming more optimistic about the near-term outcome of the asset. While such positive attention can sometimes help fuel the price rise further, it&#8217;s also true that too much of it can actually have the opposite effect on the cryptocurrency. Historically, digital asset markets have tended to move against the expectations of the opinion of the crowd, so a large amount of hype and euphoria can offer the perfect recipe for the formation of a top to take place. Related Reading: Bitcoin Price Takes Hit – Upsides Turn Attractive To Sellers The latest spike in the social dominance of XRP doesn&#8217;t necessarily have to be bearish, but it&#8217;s still something that can increase the probability of a top taking place. Though, there has also been a bullish sign for the asset recently, as the number of active addresses has rapidly increased. Such a trend is usually a sign that a large number of users are participating in the blockchain, which is something that can help the price rise to be more sustainable. XRP Price At the time of writing, XRP is trading around $0.5047, up 12% in the last week. Looks like the coin has enjoyed a rise recently &#124; Source: XRPUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T14:02:24.000Z",
    "title": "This New Meme Coin Promising 1000% ROI Receives Listing on Major Exchange",
    "url": "https://www.crypto-news-flash.com/this-new-meme-coin-promising-1000-roi-receives-listing-on-major-exchange/?utm_source=rss&utm_medium=rss&utm_campaign=this-new-meme-coin-promising-1000-roi-receives-listing-on-major-exchange",
    "description": "<p>Cardano&#8217;s meme coin SNEK has been listed on the CoinEx cryptocurrency exchange, enabling deposit, withdrawal, and trading of the token. The Cardano network has experienced significant growth in May, with the launch of new projects, an increase in token policies and native tokens, and advancements in Plutus scripts and transactions. The meme coin SNEK, built [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/this-new-meme-coin-promising-1000-roi-receives-listing-on-major-exchange/\">This New Meme Coin Promising 1000% ROI Receives Listing on Major Exchange</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-01T14:05:40.000Z",
    "title": "Symbiosis Finance Now Supports Polygon zkEVM",
    "url": "https://www.altcoinbuzz.io/product-release/symbiosis-finance-now-supports-polygon-zkevm/",
    "description": "<p>One of the big headaches in crypto is having to move money across chains. Your favorite lending app is on one chain and your favorite staking option is on another. We all have to deal with this from time to time. Thankfully, there are some protocols like Symbiosis Finance that are making this easier for [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/product-release/symbiosis-finance-now-supports-polygon-zkevm/\">Symbiosis Finance Now Supports Polygon zkEVM</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-01T14:00:00.000Z",
    "title": "Singapore’s MAS Grants Crypto.com Digital Payment Token License",
    "url": "https://coinedition.com/singapores-mas-grants-crypto-com-digital-payment-token-license/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Crypto.com-Secures-Key-Trading-License-in-Asia-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Crypto.com-Secures-Key-Trading-License-in-Asia-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Crypto.com-Secures-Key-Trading-License-in-Asia-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Crypto.com-Secures-Key-Trading-License-in-Asia-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Crypto.com-Secures-Key-Trading-License-in-Asia-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Crypto.com-Secures-Key-Trading-License-in-Asia-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Crypto.com-Secures-Key-Trading-License-in-Asia.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Wall Street Journal reported after receiving initial approval in June of last year, that the cryptocurrency exchange Crypto.com has successfully completed its licensing process in Singapore. On Thursday, June 1, Crypto.com announced that it had obtained its Major Payment Institution (MPI) license for Digital Payment Token (DPT) services from the Monetary Authority of Singapore (MAS). [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/singapores-mas-grants-crypto-com-digital-payment-token-license/\">Singapore’s MAS Grants Crypto.com Digital Payment Token License</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-01T13:40:00.000Z",
    "title": "Influencer Pauly0x Collects $1M ETH by Promising Nothing In Return",
    "url": "https://coinedition.com/influencer-pauly0x-collects-1m-eth-by-promising-nothing-in-return/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Crypto_Influencer_Receives_1_Million_in_ETH_After_Simply_Asking-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Crypto_Influencer_Receives_1_Million_in_ETH_After_Simply_Asking-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Crypto_Influencer_Receives_1_Million_in_ETH_After_Simply_Asking-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Crypto_Influencer_Receives_1_Million_in_ETH_After_Simply_Asking-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Crypto_Influencer_Receives_1_Million_in_ETH_After_Simply_Asking-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Crypto_Influencer_Receives_1_Million_in_ETH_After_Simply_Asking-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Crypto_Influencer_Receives_1_Million_in_ETH_After_Simply_Asking.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In a recent social experiment that rocked the cryptocurrency sector, crypto influencer Pauly0x collected over $1 million in Ethereum from followers after publicly requesting funds and promising nothing in return​. He dubbed his Ethereum wallet, aptly named &#8220;yougetnothing.eth,&#8221; the venue for this unique experiment. On May 30, Pauly0x shared his wallet address with a GIF [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/influencer-pauly0x-collects-1m-eth-by-promising-nothing-in-return/\">Influencer Pauly0x Collects $1M ETH by Promising Nothing In Return</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]