[
  {
    "source": "Crypto Briefing",
    "date": "2024-01-12T21:03:04.000Z",
    "title": "Robinhood unlocks Bitcoin ETF trading for its 23 million users",
    "url": "https://cryptobriefing.com/robinhood-unlocks-bitcoin-etf-trading/?utm_source=feed&utm_medium=rss",
    "description": "Robinhood opens doors to Bitcoin ETF trading, offering greater investment flexibility and market access to its 23 million users."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-12T21:00:19.000Z",
    "title": "BNB’s Liquidity Fell In Q4 2023, Bitcoin, XRP, And Dogecoin Lead",
    "url": "https://www.newsbtc.com/news/binance-coin/bnb-liquidity-fell-bitcoin-dogecoin-lead/",
    "description": "Amidst regulatory scrutiny and leadership changes, Binance Coin (BNB) lost its footing in the liquidity race, slipping to 13th place in Q4 2023, according to Kaiko data on January 11. This surprising development contrasts BNB&#8217;s position as the third-largest cryptocurrency by market capitalization, raising questions about its general liquidity. Dogecoin Flips BNB In Liquidity Rankings Kaiko&#8217;s findings, based on spot trading data from multiple exchanges, revealed that Bitcoin (BTC), Ethereum (ETH), XRP, and Dogecoin (DOGE) emerged as the top four most liquid cryptocurrencies in Q4 2023.  Liquidity is a metric that shows how easily a given asset can be traded without significant price impacts. One of the biggest assumptions is that a crypto asset higher up the market cap ranking is more liquid. However, as Kaiko data shows, this is not usually the case, as factors such as exchange listing play a big role. Related Reading: Crypto Analyst Unveils Bullish End Of Year Predictions For Ethereum DOGE flipping BNB in liquidity dynamics may be attributed to a combination of factors, including regulatory concerns surrounding Binance, leadership changes within the company, and the status of Dogecoin. DOGE is the first meme coin, and over the years, it has continued to cement its place as the world&#8217;s largest meme coin by market cap despite heavy competition. To illustrate, despite the popularity of alternatives like PepeCoin (PEPE) or Bonk coin (BONK), none has managed to flip DOGE. Binance Legal Battles, Price Recovers Steadily In 2023, Binance grappled with legal battles and internal restructuring. In early June 2023, the Securities and Exchange Commission (SEC) filed charges against the exchange, alleging that it had violated securities laws by selling unregistered securities. Additionally, Binance founder and CEO Changpeng Zhao stepped down from his executive role in late Q4 2023, further adding to the exchange&#8217;s uncertainty. Despite its legal troubles, Binance agreed to pay a $4.3 billion settlement with the SEC and other US agencies in late 2023. While this settlement may have eased some regulatory concerns, it is unclear whether it will be enough to restore BNB&#8217;s liquidity position.  Related Reading: Ethereum Classic (ETC) Explodes Over 50% In Massive Price Jump – Here’s Why So far, looking at the daily chart, BNB has been trending higher, quickly shaking off the weakness of late November 2023. After Changpeng Zhao, the founder, exited as the CEO, BNB prices sharply fell. However, without follow-through and the community remaining optimistic about the platform&#8217;s prospects, prices recovered as the broader crypto scene rose, hoping the SEC would approve the first spot Bitcoin ETF. BNB is up 37% from November 2023 lows and is stable, looking at the performance in the daily chart. As a bull flag forms, it is unclear whether the coin will break higher above $340, establishing new 2024 highs or contract following Bitcoin. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-12T21:00:01.000Z",
    "title": "Retail Trading Giant Robinhood Lists Newly Approved Spot Bitcoin (BTC) Exchange-Traded Funds",
    "url": "https://dailyhodl.com/2024/01/12/retail-trading-giant-robinhood-lists-newly-approved-spot-bitcoin-btc-exchange-traded-funds/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/giant-newly-spot-traded.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/giant-newly-spot-traded.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/giant-newly-spot-traded.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/giant-newly-spot-traded.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/giant-newly-spot-traded.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/giant-newly-spot-traded.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/giant-newly-spot-traded.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Retail trading giant Robinhood has listed the newly approved spot Bitcoin (BTC) exchange-traded funds (ETFs). The 11 greenlit BTC ETFs became available to the company&#8217;s customers on Thursday morning in both retirement and brokerage accounts through Robinhood Financial, according to a new press release. Robinhood chief executive Vlad Tenev says the new Bitcoin financial products [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/12/retail-trading-giant-robinhood-lists-newly-approved-spot-bitcoin-btc-exchange-traded-funds/\">Retail Trading Giant Robinhood Lists Newly Approved Spot Bitcoin (BTC) Exchange-Traded Funds</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-12T20:55:41.000Z",
    "title": "Analyst Breaks Down Top Cryptos by Market Cap Bitcoin (BTC) and Ethereum (ETH) Post-ETF Approval",
    "url": "https://dailyhodl.com/2024/01/12/analyst-breaks-down-top-cryptos-by-market-cap-bitcoin-btc-and-ethereum-eth-post-etf-approval/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/01/BTC-ETH-early-adoption.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/01/BTC-ETH-early-adoption.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/01/BTC-ETH-early-adoption.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/01/BTC-ETH-early-adoption.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/01/BTC-ETH-early-adoption.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/01/BTC-ETH-early-adoption.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/01/BTC-ETH-early-adoption.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is diving into the top two digital assets by market cap after the historic US approval of spot Bitcoin (BTC) exchange-traded funds (ETFs). Crypto trader Michaël van de Poppe tells his 683,400 followers on the social media platform X that BTC&#8217;s next move is to stabilize, allowing Ethereum (ETH) to go on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/12/analyst-breaks-down-top-cryptos-by-market-cap-bitcoin-btc-and-ethereum-eth-post-etf-approval/\">Analyst Breaks Down Top Cryptos by Market Cap Bitcoin (BTC) and Ethereum (ETH) Post-ETF Approval</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]