[
  {
    "source": "CoinDesk",
    "date": "2024-03-15T08:24:14.000Z",
    "title": "Mike Novogratz’s Galaxy Digital Should be a ‘Core Holding’ for Digital Asset Investors, Stifel Says",
    "url": "https://www.coindesk.com/business/2024/03/15/mike-novogratzs-galaxy-digital-should-be-a-core-holding-for-digital-asset-investors-stifel-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "There are a number of key catalysts for the company, and these include ETF net inflows, the development of GalaxyOne and a potential Nasdaq listing, the report said."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-15T08:16:57.000Z",
    "title": "Democrats Ask SEC's Gensler to Block Approval of More Crypto ETPs",
    "url": "https://www.coindesk.com/policy/2024/03/15/democrats-ask-secs-gensler-to-block-approval-of-more-crypto-etps/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Senators say that retail investors face \"enormous risks\" from such products because thin order books for some cryptocurrencies."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-15T08:30:25.000Z",
    "title": "Banco Do Brasil to Test Offline Payments in Brazilian CBDC Pilot",
    "url": "https://news.bitcoin.com/banco-do-brasil-to-test-offline-payments-in-brazilian-cbdc-pilot/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/886c66f2-8bd3-4c9a-974d-62db87bad90d-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Banco Do Brasil to Test Offline Payments Option in Brazilian CBDC Pilot\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/886c66f2-8bd3-4c9a-974d-62db87bad90d-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/886c66f2-8bd3-4c9a-974d-62db87bad90d-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/886c66f2-8bd3-4c9a-974d-62db87bad90d-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/886c66f2-8bd3-4c9a-974d-62db87bad90d-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/886c66f2-8bd3-4c9a-974d-62db87bad90d-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/886c66f2-8bd3-4c9a-974d-62db87bad90d-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/886c66f2-8bd3-4c9a-974d-62db87bad90d.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Banco Do Brasil, a bank owned in its majority by the Brazilian state, and Giesecke+Devrient, are partnering to explore the possibilities of bringing offline payments to the future Brazilian CBDC, Drex. The joint initiative will include this functionality in Drex&#8217;s pilot, to extend access to financial services to Brazilians with difficult or no access to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-15T08:23:49.000Z",
    "title": "Chainlink’s CCIP revenue jumps 180% amid growing adoption",
    "url": "https://www.cryptopolitan.com/chainlinks-ccip-revenue-180-growing-adoption/",
    "description": "Chainlink&#8217;s Cross Chain Interoperability Protocol (CCIP) has experienced a substantial revenue increase of 180% over the past two months, demonstrating a significant uptick in its adoption. According to data from Dune Analytics, CCIP&#8217;s fee revenue jumped from around $61,000 in January to more than $171,000 in the first half of March. This growth brought the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-15T08:23:26.000Z",
    "title": "Bitcoin mining difficulty hits all-time high as BTC price tumbles",
    "url": "https://www.cryptopolitan.com/bitcoin-mining-difficulty-hits-all-time-high/",
    "description": "On March 14, the cryptocurrency market watched as Bitcoin mining difficulty skyrocketed to an unprecedented 83.95 trillion hashes. This shows that miners are getting more and more competitive as they try to solve the hard puzzles that keep the Bitcoin network running. And guess what? This happened right when Bitcoin&#8217;s price decided to play its [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-15T08:20:34.000Z",
    "title": "Bitcoin Miners Brace For Impact As Difficulty Reaches Unprecedented Levels",
    "url": "https://www.newsbtc.com/news/bitcoin-miners-brace-for-impact-as-difficulty-reaches-unprecedented-levels/",
    "description": "The winds of change are blowing through the Bitcoin landscape. On March 14th, 2024, the network witnessed a monumental shift – mining difficulty skyrocketed to a record-breaking 84 trillion hashes. This unprecedented challenge coincides with another significant event on the horizon: the Bitcoin halving slated for April. Related Reading: Euphoria Or False Dawn? Why The Ethereum $4,000 Party Might End Soon According to BTC.com, the rate has risen by nearly 5.80% since the previous modification. The mining hashrate for the original coin has also peaked, indicating that more people are now participating in the mining process. At present, the value stands at 617 EH/s. Source: BTC.com Bitcoin Mining: The Difficulty Dilemma Mining Bitcoin is no easy feat. Miners compete to solve complex cryptographic puzzles, and the difficulty of these puzzles adjusts based on the overall network hash rate. As more miners join the network, the difficulty increases to ensure a steady block production rate (roughly 1 block every 10 minutes). This recent surge in difficulty signifies an influx of new miners, likely drawn by Bitcoin&#8217;s recent price rally that saw it peak at a staggering $73,800 on the same day. The Halving Effect The upcoming halving event in April throws another variable into the equation. Every four years, the block reward for miners – the amount of Bitcoin earned for successfully mining a block – is cut in half. This economic policy is a cornerstone of Bitcoin&#8217;s design, aiming to control inflation and maintain scarcity over time. The last halving in May 2020 witnessed a significant price increase in the following months, and many analysts believe the upcoming halving will follow suit. BTCUSD weakens today and trades at $68,178: TradingView.com Here&#8217;s the logic: with the supply of new Bitcoins being halved, the existing ones become relatively more scarce, potentially driving the price up due to increased demand. A Balancing Act For Miners Despite the rising difficulty, the potential for Bitcoin&#8217;s price to appreciate after the halving could incentivize miners to weather the storm. This economic incentive is bolstered by the recent spike in mining rewards, which reached nearly $79 million This suggests that even with the increased difficulty, miners are still reaping substantial profits due to the high Bitcoin price. However, the long-term sustainability of this model is debatable. As difficulty continues to climb, the energy consumption required for mining will also rise. It raises concerns about the environmental impact of Bitcoin mining, especially considering the reliance on non-renewable energy sources in some regions. Related Reading: Number Of Ethereum Short-Term Holders Increasing – Is A Bull Rally Next? Beyond The Headlines The narrative surrounding Bitcoin&#8217;s recent surge often focuses on its price and the upcoming halving. However, there are crucial underlying factors to consider. The ever-increasing mining difficulty raises questions about the long-term viability of proof-of-work, Bitcoin&#8217;s current consensus mechanism. Alternative, more energy-efficient mechanisms are being explored, but their widespread adoption remains uncertain. Featured image from Unsplash, chart from TradingView"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-15T08:38:24.000Z",
    "title": "Ethereum (ETH) Rally Incoming?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/ethereum-eth-rally-incoming/",
    "description": "<p>This surge is supported by a 75% increase in trading volumes, reaching $22 billion, signaling a strengthening upside momentum. In February, the total derivatives trading volume on CME rose 1.58% to $96.4 billion. Let&#8217;s discover more about Ethereum (ETH). Surge in Trading Volumes Signals Bullish Momentum for ETH BTC futures volumes on the exchange increased [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/ethereum-eth-rally-incoming/\">Ethereum (ETH) Rally Incoming?</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-15T08:28:01.000Z",
    "title": "Be Part of the Future: Nominate Now for the Global AI Awards!",
    "url": "https://coinedition.com/be-part-of-the-future-nominate-now-for-the-global-ai-awards/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/03/1-64.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/03/1-64.jpg 730w, https://coinedition.com/wp-content/uploads/2024/03/1-64-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/03/1-64-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/03/1-64-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/03/1-64-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/03/1-64-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/03/1-64-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/03/1-64-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/03/1-64-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/03/1-64-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/03/1-64-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/03/1-64-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/03/1-64-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/03/1-64-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/03/1-64-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/03/1-64-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Global AI Show, a premiere platform which will bring together thought leaders from the artificial intelligence &#38; machine learning space, is pleased to announce its official awards ceremony taking place on April 15 at the Grand Hyatt, Dubai. Organized by VAP Group, the Global AI Awards seeks to recognise excellence and innovation, and pay [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/be-part-of-the-future-nominate-now-for-the-global-ai-awards/\">Be Part of the Future: Nominate Now for the Global AI Awards!</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]