[
  {
    "source": "Cointelegraph",
    "date": "2023-07-31T05:59:49.000Z",
    "title": "Ethereum logs $1M MEV block reward amid Curve Finance exploit",
    "url": "https://cointelegraph.com/news/ethereum-million-dollar-mev-block-reward-amid-curve-finance-exploit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/449b5789-b6a6-4002-8369-0df4eeb882e6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The highest recently generated block reward was 584 ETH, created  by a MEV bot front-running transactions during the DeFi chaos.   </p>\n                    <p><p>The recent Curve Finance exploit has reportedly led to one of the largest ever Maximal Extractable Value (MEV) reward blocks of 584.05 Ether (ETH). </p><p>On July 31, Ethereum core developer “eric.eth” reported that “today has produced some of the largest MEV reward blocks in Ethereum’s history,” adding it was caused by the exploit of <a href=\"https://cointelegraph.com/news/curve-finance-pools-exploited-over-24-reentrancy-vulnerability\">Curve Finance stable pools</a> on July 30.</p><p>Data shows a larger MEV reward block of 692 ETH was <a href=\"https://beaconcha.in/slot/6039069\" target=\"_blank\" rel=\"noopener nofollow\">recorded</a> in March. </p><p>“A bot notices an incoming hack in the mempool, reproduces the tx [transaction] and front runs it”, he explained before adding, “To do so they pay the block producer a lot of ETH to be front of the line.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today has produced some of the largest MEV reward blocks in Ethereum’s history. <br><br>Slot 6,992,273: 584 ETH<br>Slot 6,993,342: 345 ETH<br>Slot 6,992,050: 247 ETH<br>Slot 6,993,346: 51 ETH</p>&mdash; eric.eth (@econoar) <a href=\"https://twitter.com/econoar/status/1685778343697018881?ref_src=twsrc%5Etfw\">July 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>A <a href=\"https://cointelegraph.com/learn/what-is-mev-ethereums-invisible-tax\">MEV bot</a> is designed to generate extra revenue by reordering and/or inserting transactions in an otherwise normal block to generate arbitrage opportunities.</p><p>MEV bots can also see pending liquidation transactions and front-run them to buy the liquidated assets first at a discount.</p><p>The validator gets to propose a block using a relay that outsources their block production to entities specialized in extracting this extra revenue. They will get a cut of this revenue in exchange for allowing the MEV bot to front-run the transaction.</p><p>This is known as the “block reward” and some huge ones have been logged over the past few hours. </p><p>The highest MEV bot block reward was 584.05 ETH, valued at around $1 million, around 12 hours ago, according to <a href=\"https://beaconcha.in/slot/6992273\" target=\"_blank\" rel=\"noopener nofollow\">Beaconcha.in</a>. There have also been block rewards for 345 ETH and 247 ETH over the past few hours. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/vyper-vulnerability-exposes-defi-ecosystem-stress-tests\"><strong><em>Vyper vulnerability exposes DeFi ecosystem to stress tests</em></strong></a></p><p>Moral questions were <a href=\"https://twitter.com/_apedev/status/1685782708985696256\" target=\"_blank\" rel=\"noopener nofollow\">raised</a> among the responses to the tweet and the implications of potentially illicit funds being used to pay validators to allow the front-running of transactions. </p><blockquote>“And this is where the morality of MEV rewards going to miners gets pretty shady. These are effectively hacked funds.”</blockquote><p>In April, a Subway-themed trading bot made millions in extractable value by using “<a href=\"https://cointelegraph.com/news/subway-themed-trading-bot-makes-millions-using-sandwich-attacks\">sandwich attacks</a>” during the memecoin trading frenzy. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ethics-101-crypto-projects-negotiate-hackers/\">Should crypto projects ever negotiate with hackers? Probably</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-31T06:00:00.000Z",
    "title": "Re-entrancy Exploit Hits Curve Finance",
    "url": "https://cryptodaily.co.uk/2023/07/re-entrancy-exploit-hits-curve-finance",
    "description": "<p class=\"md-end-block md-p\">An exploit in the Curve Finance platform has put more than $100 million in cryptocurrency at risk, intensifying security concerns in Ethereum's decentralized finance (DeFi) ecosystem.</p>\n<p class=\"md-end-block md-p\">Central to this exploit is a \"re-entrancy\" bug in Vyper, the programming language instrumental to Curve's system. This vulnerability has provided hackers with an avenue to drain several stablecoin pools on the platform, unsettling the pricing and liquidity of numerous DeFi services.</p>\n<p class=\"md-end-block md-p\">While it's uncertain how much has been drained due to the attack, BlockSec, a blockchain auditing firm, projects the total losses to be above $42 million.</p>\n<p class=\"md-end-block md-p\">Curve hosts 232 different pools. Despite this number, only those using Vyper versions 0.2.15, 0.2.16, and 0.3.0 have been identified as at risk, according to Mimaklas, a member of the Curve team. Mimaklas added:</p>\n\n<p class=\"md-end-block md-p\">\"all affected pools have been drained or white hacked, and the team is assessing the situation with affected teams.\"</p>\n\nEchoes of Past DeFi Attacks\n<p class=\"md-end-block md-p\">This incident isn't a one-off in the DeFi landscape. The space has been plagued by a series of attacks in recent times. Just last year, the Ronin Network lost a staggering $622 million to hackers due to a breach in the Ethereum sidechain. BadgerDAO also fell prey to an $80 million heist, sparking widespread concerns over the security practices in the DeFi sector.</p>\nFallout: Impact on CRV Token and DeFi Sector\n<p class=\"md-end-block md-p\">The exploit has sent ripples across the trading markets fo Curve DAO&rsquo;s native CRV token. The token's value tumbled by 17%, standing at $0.61 at press time. This price plummet could instigate a forced liquidation on Curve&rsquo;s founder's $70 million borrowing position on Aave, further complicating the situation.</p>\n<p class=\"md-end-block md-p\">These recurring incursions underscore the urgent need for robust security measures and rigorous audit practices within the DeFi ecosystem. As the DeFi sphere continues to expand, tackling these challenges head-on becomes increasingly crucial to protect participants' assets and uphold confidence in the system's resilience.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T06:05:41.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 How much is LTC worth? The current price of Litecoin stands at $93.3. Over the past 24 hours, it has experienced a trading volume of $1.72B and a market capitalization of $6.71B. Litecoin’s market dominance is at 0.55%. However, there has been a decrease in the LTC price by 1.34% within ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T05:51:50.000Z",
    "title": "Crypto Founder Charles Hoskinson Explains Decision to Keep No Public Crypto Addresses",
    "url": "https://www.cryptopolitan.com/cardano-explain-decision-to-crypto-addresses/",
    "description": "In a departure from the norm among prominent figures in the cryptocurrency space, Cardano founder Charles Hoskinson has revealed that he maintains no public crypto addresses. This surprising revelation has drawn attention and raised questions from the community. Hoskinson took to Twitter to provide a detailed explanation for his decision, citing security concerns as the ... <a title=\"Crypto Founder Charles Hoskinson Explains Decision to Keep No Public Crypto Addresses\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-explain-decision-to-crypto-addresses/\" aria-label=\"More on Crypto Founder Charles Hoskinson Explains Decision to Keep No Public Crypto Addresses\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T05:49:58.000Z",
    "title": "Kraken resolves issue with Ethereum funding gateway after brief delay in withdrawals",
    "url": "https://www.cryptopolitan.com/kraken-resolves-issue-with-ethereum-funding-gateway-after-brief-delay-in-withdrawals/",
    "description": "On July 30, cryptocurrency exchange Kraken made an announcement regarding the resolution of a critical issue with the funding gateway of Ethereum, the world&#8217;s second-largest cryptocurrency. The problem, which had the potential to cause delays in deposits and withdrawals, prompted the company to investigate promptly to address the concerns of its users. Earlier that day, ... <a title=\"Kraken resolves issue with Ethereum funding gateway after brief delay in withdrawals\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kraken-resolves-issue-with-ethereum-funding-gateway-after-brief-delay-in-withdrawals/\" aria-label=\"More on Kraken resolves issue with Ethereum funding gateway after brief delay in withdrawals\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T05:41:05.000Z",
    "title": "SEC asked Coinbase to pause all crypto trading pre-lawsuit",
    "url": "https://www.cryptopolitan.com/sec-asked-coinbase-to-pause-crypto-trading/",
    "description": "The curtain has been drawn back on the intentions of the U.S. Securities and Exchange Commission (SEC), as they approached Coinbase with a proposal that sent shockwaves throughout the cryptocurrency industry. A recommendation was made to Coinbase to halt all trading activities involving cryptocurrencies except Bitcoin, prior to taking legal action against the Nasdaq-listed company. ... <a title=\"SEC asked Coinbase to pause all crypto trading pre-lawsuit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-asked-coinbase-to-pause-crypto-trading/\" aria-label=\"More on SEC asked Coinbase to pause all crypto trading pre-lawsuit\">Read more</a>"
  }
]