[
  {
    "source": "Cointelegraph",
    "date": "2023-11-22T11:51:21.000Z",
    "title": "CoinMarketCap rival CoinGecko acquires NFT startup Zash",
    "url": "http://cointelegraph.com/news/cmc-rival-coingecko-acquires-nft-startup",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/9e0548aa-c48d-45db-847c-abcf453837d0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>CoinGecko has acquired the NFT data infrastructure platform Zash as the firm remains bullish about the NFT market. The terms of the deal have not been disclosed.</p>\n                    <p><p>Major cryptocurrency tracking website CoinGecko is scaling its data offering by acquiring the nonfungible token (NFT) data infrastructure platform Zash.</p><p>CoinGecko plans to integrate Zash’s NFT data into its Application Programming Interface (API) by the second quarter of 2024, the firm announced on Nov. 21, though the deal terms have not been disclosed.</p><p>“API users will be able to enjoy a unified crypto data offering, where they can access fungible and nonfungible token data seamlessly and enjoy enriched crypto market insights,” CoinGecko co-founder and chief operating officer <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2021/bobby-ong\">Bobby Ong</a> told Cointelegraph.</p><p>According to the exec, front-end users of CoinGecko’s web and mobile app will also be able to access the on-chain NFT data through the NFT floor price tracker next year.</p><p>CoinGecko didn’t disclose the cost of the Zash acquisition to Cointelegraph. Founded in 2021, Zash operates an enterprise-grade NFT indexer and API, allowing users to track NFT data across 87 unique marketplaces — or a total of 102 marketplaces — like the major NFT exchange OpenSea.</p><p>“Zash’s data also encompasses secondary sales, bundled trades, converts settlement in 12 currencies and encompass ERC-721 and ERC-1155 token standards,” Ong noted, adding that Zash’s coverage is “over four times more than alternatives.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-exchange-bullish-buys-100-stake-in-crypto-media-site-coindesk\"><strong><em>Crypto exchange Bullish buys 100% stake in crypto media site CoinDesk: Report</em></strong></a></p><p>CoinGecko’s latest move into the NFT market comes despite a <a href=\"https://cointelegraph.com/news/defi-activity-on-the-decline-but-investment-rolls-in-finance-redefined\">significant decline in the NFT market</a>, which is sometimes interpreted as a <a href=\"https://cointelegraph.com/news/nft-price-decline-just-maturing-decentraland\">signal the NFT technology is maturing</a> rather than a sign of distress. CoinGecko is bullish on the NFT industry despite the ongoing market decline, Ong said, stating:</p><blockquote>“We hold the vision where any asset that can be tokenized, will be tokenized. We believe that NFTs will continue to innovate beyond PFPs, GameFi and unlock new opportunities and use cases worldwide. For that reason, we’re optimistic about the NFT market’s resurgence.”</blockquote><p>After <a href=\"https://cointelegraph.com/news/binance-announces-coinmarketcap-acquisition-cz-gives-the-scoop\">Binance acquired CoinGecko’s major competitor</a>, CoinMarketCap, in 2020, CoinGecko was also open to acquisitions as of July 2022. However, the firm was considering potential acquisitions in the long term rather than in the short term.</p><p>“This will be our third crypto winter, and we are focused on improving CoinGecko to prepare for the eventual bull run that will come again,” CoinGecko’s Ong told Cointelegraph last year.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/interview-2-years-after-john-mcafee-death-wife-janice-broke-still-grieving/\"><strong><em>Exclusive: 2 years after John McAfee’s death, widow Janice is broke and needs answers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-22T11:45:29.000Z",
    "title": "Binance’s market dominance wanes with regulatory woes and futures market shifts",
    "url": "https://cryptoslate.com/insights/binances-market-dominance-wanes-with-regulatory-woes-and-futures-market-shifts/",
    "description": "<p>Quick Take Binance, a dominant player in the cryptocurrency exchange market, has seen a notable downturn in its transaction volume over the past year. In November 2022, the exchange handled approximately $500 billion in monthly volume. However, according to The Block, by November 2023, this number has fallen sharply to $230 billion. Regulatory pressures have [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/binances-market-dominance-wanes-with-regulatory-woes-and-futures-market-shifts/\">Binance&#8217;s market dominance wanes with regulatory woes and futures market shifts</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-22T12:07:35.000Z",
    "title": "DPRK hackers impersonate South Korean officials to steal crypto",
    "url": "https://crypto.news/dprk-hackers-impersonate-south-korean-officials-to-steal-crypto/",
    "description": "According to South Korea’s National Police Agency, the hackers stole the information of 1,468 victims between March and October 2023. North Korean hackers are now trying to lure victims by pretending to be South Korean officials and journalists in a&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-22T11:55:46.000Z",
    "title": "Bitcoin dip amid Binance controversy; investors can explore these 2 alternatives",
    "url": "https://crypto.news/bitcoin-dip-amid-binance-controversy-investors-can-explore-these-2-alternatives/",
    "description": "Amid the Binance and Changpeng Zhao controversy and falling crypto prices, analysts are exploring these two Bitcoin derivatives"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-22T12:00:11.000Z",
    "title": "Pro-XRP Lawyer Deaton Picks His Top 10 Cryptos For The Year Ahead",
    "url": "https://www.newsbtc.com/crypto/pro-xrp-lawyer-deaton-top-10-cryptos/",
    "description": "In a recent post on X (formerly Twitter), noted XRP advocate and lawyer John Deaton shared his top 10 cryptocurrency picks for the next 12 months. His selection includes a mix of well-established and emerging digital currencies. He stated, “If you had to pick only 10 tokens to own for the next 12 months (as a trade) what are they? Here’s mine: BTC, XRP, ETH, QNT, RNDR, SOL, KAS, AVAX, HBAR, CSPR. What am I missing?” Analysis Of The Pro-XRP Lawyer’s Picks Bitcoin (BTC): Deaton likely selected Bitcoin due to the potential imminent approval of a spot Bitcoin ETF in the United States. Bloomberg Intelligence analysts anticipate that the US Securities and Exchange Commission (SEC) might approve multiple spot Bitcoin ETF by January 10, 2024, a move that could significantly impact Bitcoin&#8217;s value XRP: Deaton&#8217;s choice of XRP is consistent with his role as a strong supporter and legal advocate for the XRP community. XRP&#8217;s status as a regulatory-defined token in the United States with high utility adds to its appeal. Currently, XRP is consolidating after being rejected at the 0.618 Fibonacci retracement level at $0.7492. Ethereum (ETH): Despite the harsh criticism of Ethereum&#8217;s founder, Deaton has included ETH in his list. This might be due to its position as the second-largest cryptocurrency by market cap. Also, BlackRock and several other financial giants have recently applied for a Spot Ethereum ETF, adding to the potential bullish trajectory of ETH in the next 12 months. Related Reading: Did JPMorgan Secretly Buy 7.5 Million XRP? Here’s What We Know Quant (QNT): The QNT token of Quant Network has found itself in a downtrend channel since late January this year, down approximately 35% from its year-to-date high. With the current price of $98.74, QNT is 78% below its all-time high of $428.38 on November 21, 2023. Nevertheless, Quant can boast partnerships with major financial institutions, including the Bank for International Settlements (BIS), Bank of England, Bank of Canada, MasterCard, Amazon, and Barclays, to develop and test use cases for central bank digital currencies (CBDCs). Render Network (RNDR): The RDNR token is currently up 725% since the beginning of the year. Render Network provides a decentralized GPU rendering platform, allowing artists to scale GPU rendering work on-demand to high-performance GPU nodes. Notably, the RDNR price has also profited from the AI narrative. Solana: SOL has been one of the other big winners this year, up nearly 600% at the current price since it went below $8 at the end of last year. Solana is currently seen as the potential biggest challenger to Ethereum as a layer-1 blockchain, which is why Deaton may have ranked SOL on his list. Kaspa (KAS): Kaspa has gained attention due to its positioning as a highly scalable Layer-1 blockchain, with a focus on fast confirmations and high throughput. Its underlying technology, GhostDAG/PHANTOM protocol, aims to balance security, scalability, and decentralization. The KAS token&#8217;s impressive performance, with an over 2,600 % increase year-to-date, makes it a notable inclusion. Avalanche (AVAX): Avalanche&#8217;s AVAX token might be included due to its recent gains of almost 130% since mid-October. Deaton may have chosen AVAX because of Avalanche&#8217;s involvement in the Monetary Authority of Singapore&#8217;s tokenization initiative, Project Guardian, as well as its partnership with Amazon Web Services and Deloitte, all of which are potential catalysts for price appreciation. Related Reading: XRP Price: Cup And Handle Pattern Hints At Short-Term 208% Surge Hedera (HBAR): Hedera Hashgraph has gained prominence by becoming part of FedNow, the US Federal Reserve&#8217;s instant payments platform. This development led to a significant surge in the price of Hedera&#8217;s HBAR token. Casper (CSPR): Casper&#8217;s inclusion may be due to its position as one of the fastest-growing blockchain projects, with a focus on solving the blockchain trilemma of scalability, security, and decentralization. Remarkably, Deaton&#8217;s selections reflect a balance between established market leaders like Bitcoin and Ethereum, and emerging, high-potential projects like Kaspa and Casper. This blend indicates a strategic approach to cryptocurrency investment, recognizing both stability and innovation within the digital asset space. Featured image from YouTube / CryptoLaw, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-22T11:58:00.000Z",
    "title": "Binance Delists Aptos (APT), Axie Infinity (AXS), Filecoin (FIL), and 7 Other Tokens Amid Legal Challenge",
    "url": "https://www.crypto-news-flash.com/binance-delists-aptos-apt-axie-infinity-axs-filecoin-fil-and-7-other-tokens-amid-legal-challenge/?utm_source=rss&utm_medium=rss&utm_campaign=binance-delists-aptos-apt-axie-infinity-axs-filecoin-fil-and-7-other-tokens-amid-legal-challenge",
    "description": "<img width=\"1601\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Binance-announcement.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance announcement\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Binance-announcement.jpg 1601w, https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Binance-announcement-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Binance-announcement-1024x576.jpg 1024w\" sizes=\"(max-width: 1601px) 100vw, 1601px\" />Binance Exchange has unveiled plans to delist 10 new spot trading pairs. This delisting comes after the Exchange&#8217;s founder stepped down as CEO as part of a DOJ settlement. Binance Holdings Ltd, the world&#8217;s largest crypto exchange by trading volume, has announced the removal of ten spot trading pairs, including Aptos (APT), Axie Infinity (AXS), [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-22T11:53:10.000Z",
    "title": "Cardano vs XRP: Two Cryptos Aiming For $1 Price",
    "url": "https://www.crypto-news-flash.com/cardano-vs-xrp-two-cryptos-aiming-for-1-price/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-vs-xrp-two-cryptos-aiming-for-1-price",
    "description": "<img width=\"512\" height=\"268\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-2023-11-22T130308.167.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-2023-11-22T130308.167.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-2023-11-22T130308.167-300x157.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-2023-11-22T130308.167-351x185.png 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The cryptocurrency market has always been dynamic and unpredictable, with various tokens competing for dominance and investor attention. Two such digital currencies, Cardano (ADA) and XRP, stand out due to their unique technologies, robust communities, and ambitious goals. In this article, we delve into the recent trends, developments, and price predictions surrounding Cardano and XRP, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-22T11:47:40.000Z",
    "title": "Worldcoin (WLD) Investors Celebrate 5% Surge as Sam Altman Returns to OpenAI CEO Role",
    "url": "https://www.crypto-news-flash.com/worldcoin-wld-investors-celebrate-5-surge-as-sam-altman-returns-to-openai-ceo-role/?utm_source=rss&utm_medium=rss&utm_campaign=worldcoin-wld-investors-celebrate-5-surge-as-sam-altman-returns-to-openai-ceo-role",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/brands-people-eye-scanning-worldcoin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Worldcoin\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/brands-people-eye-scanning-worldcoin.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/brands-people-eye-scanning-worldcoin-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/brands-people-eye-scanning-worldcoin-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/brands-people-eye-scanning-worldcoin-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/brands-people-eye-scanning-worldcoin-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/brands-people-eye-scanning-worldcoin-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />OpenAI announces Sam Altman&#8217;s return as CEO after recent organizational upheaval. The announcement prompts a 5 percent price jump for Worldcoin (WLD). Tech giant Microsoft engages in discussions with OpenAI to propose governance changes and potential board presence. In a major announcement earlier today, OpenAI said that Sam Altman will be returning to the company [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-22T11:46:12.000Z",
    "title": "Unleashing the Power of Memes: GameStop Memes, Shiba Inu or Pepe – Who Will Lead the Memes’ Clan?",
    "url": "https://www.crypto-news-flash.com/unleashing-the-power-of-memes-gamestop-memes-shiba-inu-or-pepe-who-will-lead-the-memes-clan/?utm_source=rss&utm_medium=rss&utm_campaign=unleashing-the-power-of-memes-gamestop-memes-shiba-inu-or-pepe-who-will-lead-the-memes-clan",
    "description": "<img width=\"720\" height=\"461\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/X.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/X.png 720w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/X-300x192.png 300w\" sizes=\"(max-width: 720px) 100vw, 720px\" />The world of cryptocurrency is a dynamic realm, constantly evolving with innovative trends and concepts. In this ever-changing landscape, we invite you to embark on a journey into the captivating universe of meme-powered cryptocurrencies, focusing our exploration on the presale of GameStop Memes ($GSM). Delving into the nuances of this digital frontier, we aim to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-22T11:40:58.000Z",
    "title": "SEC Engages Grayscale: Memo Unearths Clues to Spot Bitcoin ETF Approval – Time to Buy Discount BTC?",
    "url": "https://www.crypto-news-flash.com/sec-engages-grayscale-memo-unearths-clues-to-spot-bitcoin-etf-approval-time-to-buy-discount-btc/?utm_source=rss&utm_medium=rss&utm_campaign=sec-engages-grayscale-memo-unearths-clues-to-spot-bitcoin-etf-approval-time-to-buy-discount-btc",
    "description": "<img width=\"1000\" height=\"666\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BlackRock\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Grayscale Investments&#8217; recent meeting with the SEC hints at the potential approval of its spot Bitcoin ETF. The narrowing gap between the market price and net asset value of crypto funds like GBTC reflects growing investor optimism about the approval of a Bitcoin ETF. According to a recent report by Yahoo Finance, the Grayscale Bitcoin [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-22T11:57:00.000Z",
    "title": "Top 10 Cryptocurrency Picks To Own Over the Next 12 Months: Deaton",
    "url": "https://coinedition.com/top-10-cryptocurrency-picks-to-own-over-the-next-12-months-deaton/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/Top-10-Cryptocurrency-Picks-To-Own-Over-the-Next-12-Months.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/Top-10-Cryptocurrency-Picks-To-Own-Over-the-Next-12-Months.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/Top-10-Cryptocurrency-Picks-To-Own-Over-the-Next-12-Months-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/Top-10-Cryptocurrency-Picks-To-Own-Over-the-Next-12-Months-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/Top-10-Cryptocurrency-Picks-To-Own-Over-the-Next-12-Months-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/Top-10-Cryptocurrency-Picks-To-Own-Over-the-Next-12-Months-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/Top-10-Cryptocurrency-Picks-To-Own-Over-the-Next-12-Months-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/Top-10-Cryptocurrency-Picks-To-Own-Over-the-Next-12-Months-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/Top-10-Cryptocurrency-Picks-To-Own-Over-the-Next-12-Months-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/Top-10-Cryptocurrency-Picks-To-Own-Over-the-Next-12-Months-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/Top-10-Cryptocurrency-Picks-To-Own-Over-the-Next-12-Months-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/Top-10-Cryptocurrency-Picks-To-Own-Over-the-Next-12-Months-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/Top-10-Cryptocurrency-Picks-To-Own-Over-the-Next-12-Months-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/Top-10-Cryptocurrency-Picks-To-Own-Over-the-Next-12-Months-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/Top-10-Cryptocurrency-Picks-To-Own-Over-the-Next-12-Months-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/Top-10-Cryptocurrency-Picks-To-Own-Over-the-Next-12-Months-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/Top-10-Cryptocurrency-Picks-To-Own-Over-the-Next-12-Months-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Lawyer and cryptocurrency enthusiast John Deaton shared his top 10 token picks on X today. According to the post, Deaton would choose to hold Bitcoin (BTC), Ripple (XRP), Ethereum (ETH), Quant (QNT),  Render (RNDR), Solana (SOL),  Kaspa (KAS), Avalanche (AVAX), Hedera (HBAR), and Casper (CSPR). Bitcoin (BTC) The global cryptocurrency market cap took a 2.24% [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/top-10-cryptocurrency-picks-to-own-over-the-next-12-months-deaton/\">Top 10 Cryptocurrency Picks To Own Over the Next 12 Months: Deaton</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]