[
  {
    "source": "CoinDesk",
    "date": "2023-07-21T10:00:00.000Z",
    "title": "Wormhole Launches New Bridge Connecting to any Cosmos Appchain",
    "url": "https://www.coindesk.com/tech/2023/07/21/wormhole-launches-new-bridge-connecting-to-any-cosmos-appchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Wormhole Gateway is designed to make it easier for developers and users to on-ramp liquidity into the Cosmos ecosystem."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-21T10:06:56.000Z",
    "title": "Bitcoin’s resilient journey: a decade-long analysis of value and growth",
    "url": "https://cryptoslate.com/insights/bitcoins-resilient-journey-a-decade-long-analysis-of-value-and-growth/",
    "description": "<p>Quick Take Bitcoin, known as the gold standard of cryptocurrency, has impressively held the title of the best-performing asset over the past decade. This is no small feat, given the competitive nature of the financial markets. A fascinating aspect of Bitcoin&#8217;s performance is the number of days the asset has spent within various price ranges. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoins-resilient-journey-a-decade-long-analysis-of-value-and-growth/\">Bitcoin&#8217;s resilient journey: a decade-long analysis of value and growth</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-21T09:53:02.000Z",
    "title": "DOJ accuses SBF of leaking Caroline Ellison’s private diary to taint trial; FTX sues former executives for $1B",
    "url": "https://cryptoslate.com/doj-accuses-sbf-of-leaking-caroline-ellisons-private-diary-to-taint-trial-ftx-sues-former-executives-for-1b/",
    "description": "<p>The U.S. Department of Justice (DOJ) alleged that Sam Bankman-Fried (SBF) released the private diary of Caroline Ellison to reporters from the New York Times, according to a July 20 letter to Judge Lewis Kaplan. On June 20, the New York Times published Ellison&#8217;s private writings detailing her relationship with the disgraced former FTX CEO and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/doj-accuses-sbf-of-leaking-caroline-ellisons-private-diary-to-taint-trial-ftx-sues-former-executives-for-1b/\">DOJ accuses SBF of leaking Caroline Ellison&#8217;s private diary to taint trial; FTX sues former executives for $1B</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-21T09:45:00.000Z",
    "title": "Uniswap Founder Regains Control Of Twitter Account After Exploit",
    "url": "https://cryptodaily.co.uk/2023/07/uniswap-founder-regains-control-of-twitter-account-after-exploit",
    "description": "<p>Uniswap founder Hayden Adam&rsquo;s Twitter account suffered a breach, with hackers sending out several tweets leading users to scam websites and phishing links.</p>\n<p>Crypto Twitter was quick to warn users of the hack and urged them not to click on any links tweeted by the compromised account.&nbsp;</p>\nBack In Control&nbsp;\n<p>Adams was able to regain control of his Twitter account a few hours after the attack was first reported. After regaining access to his account, Adams thanked the community for their assistance and warned others of the malicious links tweeted from the account. He also stated that he will share more updates soon.&nbsp;</p>\n\n<p>&ldquo;In control of my Twitter again. Appreciate everyone who helped out tonight and the effort people put in to help with takedowns, warnings, etc. Will follow up with updates when ready.&rdquo;</p>\n\nDetails Of The Hack&nbsp;\n<p>The hack was first reported on the &ldquo;Web3 Security Alerts&rdquo; channel on Telegram, which notified its followers that the Twitter account belonging to the Uniswap founder was compromised. Hackers used the account to tweet that Uniswap&rsquo;s Permit2 contract was affected by an unknown exploit and user tokens were at risk. The tweet then encouraged users to click on a malicious link to secure their tokens. However, the scam tweet, the first of many, was online only for a few minutes before being removed.&nbsp;</p>\n<p>However, after the first tweet, several more malicious tweets from the account were reported, with one tweet asking UniswapX users to check their eligibility to receive gifted $UNI tokens by clicking a link to a website hosted in Russia. A Twitter user was quick to notice that the website in question was registered on the day the hack had been orchestrated, suggesting considerable planning behind the entire episode. The official Uniswap Twitter handle was quick to step in, warning users of the hack and asking them not to click on any of the links, urging them to wait for updates.&nbsp;</p>\n\n<p>&ldquo;@haydenzadamsTwitter account has been hacked. Please do not click on any links. There is no giveaway, airdrop, or bounty. The Protocol has not been hacked or exploited. We will let you know when the issue is resolved.&rdquo;&nbsp;</p>\n\n<p>The hack did not impact the Uniswap protocol or any of its functions.&nbsp;</p>\nAn Age Old Problem&nbsp;\n<p>Hackers have long been using social media platforms to exploit user accounts and seize control of their assets. Meta&rsquo;s new Twitter Rival, Threads, saw over 100 million sign-ups in days. However, hackers quickly appeared on the platform, promoting fake non-fungible token projects and impersonating prominent crypto personalities. However, social media organizations have taken notice of the growing menace and have taken steps to curb such attempts. On the 1st of July, Elon Musk announced that Twitter would be introducing a temporary limit on the number of posts users could read in a day as it looked to detect and eliminate bots and other bad actors.&nbsp;</p>\n<p>Security experts have also highlighted the importance of SIM card-based 2FA and also recommended options such as Authy or Google Authenticator to secure their accounts. Both platforms utilize time-sensitive codes on user devices, minimizing the risks of a hack occurring through SIM swaps.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T10:02:42.000Z",
    "title": "OpenSea introduces new P2P mechanism to revolutionize NFT trading",
    "url": "https://www.cryptopolitan.com/opensea-introduces-new-p2p-mechanism-to-revolutionize-nft-trading/",
    "description": "OpenSea, the prominent Non-Fungible Token (NFT) marketplace, has introduced a novel peer-to-peer trading mechanism named &#8220;Deals&#8221;. Announced yesterday, the feature is intended to enrich user trading experience by adding a new layer of transactional freedom to the platform. It important to note that Deals empowers traders to engage in peer-to-peer NFT swaps, strengthening their collections ... <a title=\"OpenSea introduces new P2P mechanism to revolutionize NFT trading\" class=\"read-more\" href=\"https://www.cryptopolitan.com/opensea-introduces-new-p2p-mechanism-to-revolutionize-nft-trading/\" aria-label=\"More on OpenSea introduces new P2P mechanism to revolutionize NFT trading\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T09:59:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T10:00:18.000Z",
    "title": "Aptos (APT) Price Prediction: Uwerx (WERX) Look Impressive For The Year",
    "url": "https://www.crypto-news-flash.com/aptos-apt-price-prediction-uwerx-werx-look-impressive-for-the-year/?utm_source=rss&utm_medium=rss&utm_campaign=aptos-apt-price-prediction-uwerx-werx-look-impressive-for-the-year",
    "description": "<img width=\"1200\" height=\"768\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/890.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/890.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/890-300x192.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/890-1024x655.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/890-768x492.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Emerging opportunities in the crypto market are best maximized at the early stage. This is where token prices are relatively low, and they offer the least risk possible. Uwerx is an emerging crypto project offering its WERX tokens on presale at the lowest price possible. The presale has progressed to Stage 5, and the tokens [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T09:44:29.000Z",
    "title": "Binance Labs Invests $10M in Radiant Capital, RDNT Token Gains Double-Digit Growth",
    "url": "https://www.crypto-news-flash.com/binance-labs-invests-10m-in-radiant-capital-rdnt-token-gains-double-digit-growth/?utm_source=rss&utm_medium=rss&utm_campaign=binance-labs-invests-10m-in-radiant-capital-rdnt-token-gains-double-digit-growth",
    "description": "<img width=\"1600\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance Coin\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn.png 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-1536x864.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-24x14.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-36x20.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-48x27.png 48w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />The new investment will help Radiant build new technologies and deploy more collateral on the Ethereum mainnet. The Radiant team also said that this investment will help them expand to other EVM chains. On Thursday, July 20, crypto exchange Binance&#8217;s investment arm Binance Labs announced a $10 million investment in leading decentralized finance (DeFi) lending [...]"
  }
]