[
  {
    "source": "Cointelegraph",
    "date": "2023-08-19T02:17:16.000Z",
    "title": "Yuga Labs to wind back from OpenSea over its axing of royalty enforcements ",
    "url": "https://cointelegraph.com/news/yuga-labs-to-wind-back-use-of-opensea-over-its-axing-of-royalty-enforcements",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/80fe4ce4-d824-4717-8b44-20cf3f8d1194.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Yuga Labs said it will start winding back OpenSea support for “all upgradable contracts and any new collections” following the announcement from the NFT marketplace.  </p>\n                    <p><p>Bored Ape Yacht Club (BAYC) creators Yuga Labs is set to wind down support for OpenSea following the platform’s upcoming removal of its on-chain royalty enforcement tool Operator Filter. </p><p>The Operator Filter was <a href=\"https://cointelegraph.com/news/opensea-launches-new-on-chain-tool-to-enforce-nft-royalties\">launched in November</a> 2022, essentially enabling creators to restrict secondary nonfungible token sales only to marketplaces that enforce creator royalties, thus filtering out platforms like Blur. </p><p>However, <a href=\"https://cointelegraph.com/news/opensea-disable-on-chain-royalty-enforcement-tool\">OpenSea revealed</a> on Aug. 17 that it will soon “sunset” the tool at the end of August, citing a lack of “opt-in by the entire ecosystem,” platforms being able to bypass the tool and pushback from creators.</p><p>The following day, Yuga Labs CEO Daniel Alegre <a href=\"https://twitter.com/yugalabs/status/1692627502999691453\" target=\"_blank\" rel=\"noopener nofollow\">shared</a> an announcement via X (Twitter), stating that the firm will gradually wind down its use of OpenSea’s Seaport marketplace smart contract: </p><blockquote>“Yuga Labs will begin the process of sunsetting support for OpenSea’s SeaPort for all upgradable contracts and any new collections, with the aim of this being complete in February 2024 in tandem with OpenSea’s approach.”</blockquote><p>“Yuga believes in protecting creator royalties so creators are properly compensated for their work,” he added. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">On <a href=\"https://twitter.com/opensea?ref_src=twsrc%5Etfw\">@opensea</a>&#39;s decision to sunset their Operator Filter. <a href=\"https://t.co/ahc155WWkX\">pic.twitter.com/ahc155WWkX</a></p>&mdash; Yuga Labs (@yugalabs) <a href=\"https://twitter.com/yugalabs/status/1692627502999691453?ref_src=twsrc%5Etfw\">August 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The post was met with a positive reaction from members of the BAYC community, while content creators/NFT project founders such as EllioTrades and Alex Becker also <a href=\"https://twitter.com/ZssBecker/status/1692629295188021660\" target=\"_blank\" rel=\"noopener nofollow\">praised</a> the move. </p><p>The CEO and co-founder of the Forgotten Runes Wizards Cult NFT project @dotta, was also in support, noting that they loved to see how Yuga Labs responded to OpenSea. </p><blockquote>“The creators have enough power in aggregate to move to royalty-paying marketplaces. Yuga leading the charge is the spark that was needed.”</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Yuga is banning OpenSea in light of their choice to stop enforcing creator royalties<br><br>You love to see it<br><br>Like I mentioned yesterday, OpenSea taught us how to filter exchanges with bad behavior by giving us the OperatorFilter registry<br><br>Those of us that implemented it, now plan on…</p>&mdash; dotta (@dotta) <a href=\"https://twitter.com/dotta/status/1692632914020712682?ref_src=twsrc%5Etfw\">August 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Notably, Luca Netz, the CEO of the Pudgy Penguins NFT project also seemingly hinted towards doing the same thing as Yuga Labs, as he responded to the firm’s post by calling it a “great move.”</p><p>In a separate post from Coinbase NFT on Aug. 18 highlighting its “commitment to enforcing creator royalties,” Netz also stated: “Let’s talk.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Let’s talk</p>&mdash; Luca Netz  (@LucaNetz) <a href=\"https://twitter.com/LucaNetz/status/1692687613675638791?ref_src=twsrc%5Etfw\">August 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>Divided market </h3><p>The notion of <a href=\"https://cointelegraph.com/explained/what-are-nft-royalties-and-how-do-they-work\">creator royalties</a> and whether they should be supported/enforced or not, has become a divisive topic in the NFT community over the past year or so. </p><p>In the early stages of the NFT boom around 2021, it was the general practice to enforce creator royalties. However, marketplaces like Blur then stormed the market in October 2022 and managed to secure <a href=\"https://cointelegraph.com/news/blur-runs-after-opensea-market-share-but-its-success-depends-on-upcoming-governance-proposals\">significant market</a> share by offering zero trading fees and an optional creator royalty payment model. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/nifty-news-coca-cola-nft-collection-coinbase-network-base\"><strong>Nifty News: Coca-Cola gets Based, Reddit avatars reach 20M milestone and more</strong></a></p><p>As a result, trading fees and royalty percentages started to decrease across the board as marketplaces competed for users. </p><p>As it stands, it generally appears that the NFT community is split between those who favor the cheaper NFT trading model of platforms like Blur, and argue for different methods of creator compensation, and those who staunchly advocate for the need to pay royalties. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">In their current form, NFT royalties don’t make sense <br>- owed for perpetuity <br>- owed even if sold at loss <br>-unenforceable without compromising ownership<br><br>Isn’t it better to make them optional and incentivise compliance, while working out other monetisation avenues for artists?</p>&mdash; scriblooooor (@scriblooooor) <a href=\"https://twitter.com/scriblooooor/status/1692543490721517827?ref_src=twsrc%5Etfw\">August 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/pfp-holders-doomed-grails-famed-nft-artists-amazon-prime-nfts/\"><strong><em>NFT Collector: Grails’ lucky dip of famous NFT artists, new hope for PFP holders</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  }
]