[
  {
    "source": "CoinDesk",
    "date": "2024-01-05T14:00:00.000Z",
    "title": "North Korea Was Responsible for Over $600M in Crypto Thefts Last Year: TRM Labs",
    "url": "https://www.coindesk.com/policy/2024/01/05/north-korea-was-responsible-for-over-600m-in-crypto-thefts-last-year-trm-labs/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "North Korea-affiliated actors were behind a third of all crypto hacks in 2023, making off with some $600 million in funds, a new TRM Labs study said."
  },
  {
    "source": "CoinDesk",
    "date": "2024-01-05T13:57:33.000Z",
    "title": "If a Bitcoin ETF Is Approved, Here’s What May Happen",
    "url": "https://www.coindesk.com/markets/2024/01/05/if-a-bitcoin-etf-is-approved-heres-what-may-happen/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "This week marked the 15th year since the genesis block was mined on Bitcoin and for 10 of those years industry stalwarts pleaded with the SEC to approve a spot bitcoin ETF. So far, the SEC has rejected every spot ETF application, but that may be about to change."
  },
  {
    "source": "CoinDesk",
    "date": "2024-01-05T13:43:06.000Z",
    "title": "First Mover Americas: Crypto ETPs Gained $2.2 Billion of Investment in 2023",
    "url": "https://www.coindesk.com/markets/2024/01/05/first-mover-americas-crypto-etps-gained-22-billion-of-investment-in-2023/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin [BTC] and crypto markets in context for Jan. 5, 2024. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-05T14:01:00.000Z",
    "title": " Holiday price action: Signs of the next crypto bull run? ",
    "url": "https://cointelegraph.com/news/holiday-bitcoin-price-next-crypto-bull-run",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOGM3ZDJjMDgtZWU4Ny00ZDU1LTk2MzAtZDc3ODlhNWI0NzA3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A closer look at the similarities between today’s thriving crypto market and the 2020–2021 bull run. </p>\n                    <p><p>As 2023 drew to a close and with the start of 2024, the crypto market is once again experiencing a resurgence, one that is reminiscent of the bull run witnessed back in December 2020. </p><p>The ongoing revival has brought with it a renewed sense of <a href=\"https://alternative.me/crypto/fear-and-greed-index/\" target=\"_blank\" rel=\"noopener nofollow\">optimism</a> and potential, with investors hoping for a major turnaround. </p><p>To this point, since the start of 2023, the market capitalization of the digital asset sector has <a href=\"https://www.coingecko.com/en/global-charts\" target=\"_blank\" rel=\"noopener nofollow\">boomed</a> from $831 billion to over $1.8 trillion, thereby showcasing a growth of nearly 100%.</p><p><a href=\"https://cointelegraph.com/news/holiday-bitcoin-price-next-crypto-bull-run\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2024-01-05T13:41:52.000Z",
    "title": "XRP slips down crypto top 10 charts amid competition from new tokens",
    "url": "https://crypto.news/xrp-slips-down-crypto-top-10-charts-amid-competition-from-new-tokens/",
    "description": "As XRP risks dropping from the top 10 by trading volume, NuggetRush (NUGX) and Silly Dragon (SILLY) have been garnering more attention"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-05T13:40:05.000Z",
    "title": "Buy the rumor, sell the news? Not with Bitcoin’s ETF",
    "url": "https://crypto.news/buy-the-rumor-sell-the-news-not-with-bitcoins-etf/",
    "description": "Crypto market analyst known as Mr. Anderson on Twitter suggested that the old adage of \"buy the rumor, sell the news\" does not apply to the current situation"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-05T14:00:57.000Z",
    "title": "Maker Market Heats Up: Over 600 Addresses Complete MKR Trades In Single Day",
    "url": "https://www.newsbtc.com/news/maker-market-heats-up-over-600-addresses-complete-mkr-trades-in-single-day/",
    "description": "The starting point of 2024 has a positive outlook for the Maker (MKR) coin, suggesting that the year may be productive. Activity has increased, according to on-chain data, indicating a potential positive trend. Since the start of the year, the number of active addresses on a daily basis—a crucial indicator of user engagement—has increased significantly. Related Reading: Falling Down: XRP Sheds 10% As Short-Term Recovery Prospects Remain Dim Presently, there are more than 600 addresses trading MKR, which is a 4% rise from the original 590. This increase in involvement suggests that there is increasing momentum and interest in the token. Moreover, since the beginning of the year, there has been an over 5% increase in the establishment of new addresses only for MKR trading. This inflow of new players gives the ecosystem more room to flourish and more liquidity. MKR Daily Active Addresses. Source: Santiment 2024 is off to a good start for MakerDAO, the driving force behind the DAI stablecoin in the decentralized finance (DeFi) space. Analysts are upbeat, projecting steady returns and even calling it a safe pick given the volatile state of the cryptocurrency market. Still, let&#8217;s examine this more closely before jumping on the MKR bandwagon. One of MakerDAO&#8217;s strongest points is its mature ecosystem. A key component of DeFi lending and borrowing is the MKR token, which controls the DAI stablecoin. MKR market cap currently at $1.6 billion. Chart: TradingView.com This mutually advantageous association has bestowed MakerDAO with considerable sway and a foothold in the market. However, to attribute its future exclusively to the Bitcoin ETF decision, as some contend, offers an inadequate perspective. Although the crypto markets could benefit from an authorized Bitcoin ETF, it&#8217;s important to understand how complex and interwoven the sector is. Regulations, the general use of DeFi, and even rivals&#8217; actions impact MakerDAO&#8217;s trajectory. Ignoring these things could result in unrealistic expectations. According to Coinglass data, there has been a notable spike in liquidations as a result of Maker&#8217;s hike from a minimum of $1,826 to a maximum of $1,928. Source: Coinglass The sudden surge in MKR&#8217;s value has forced the liquidation of more than $500,000 worth of short bets, defying the sellers&#8217; gloomy projections. There could be both good and negative effects on Maker&#8217;s pricing if the number of profitable addresses rises. Some 74% of addresses, or 69,400 addresses, are in profit, which is a two-year high, according to IntoTheBlock data. Related Reading: Celestia Adds 35% More To Its Value As TIA Guns For $20 This increase could lift buying pressure for the cryptocurrency as hopeful Maker holders may want to stockpile more tokens in expectation of future price improvements. As the Maker market witnesses a surge with over 600 addresses completing MKR trades in a single day, the momentum appears robust and promising. This heightened activity signifies growing interest and participation in the MKR ecosystem. Featured image from Freepik"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-05T13:44:07.000Z",
    "title": "23 Features of Etherscan: Unveiling Ethereum’s Power Tools",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/23-features-of-etherscan-unveiling-ethereums-power-tools/",
    "description": "<p>Etherscan introduced 23 features in 2023, enhancing the user experience and expanding its utility. In this article, you will discover the features that have made Etherscan an indispensable tool for crypto enthusiasts. Here are 5 of them: 1) Explorer-as-a-Service (EaaS) Etherscan leaped forward by contributing to the block exploration for Layer 2 and Layer 1 [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/23-features-of-etherscan-unveiling-ethereums-power-tools/\">23 Features of Etherscan: Unveiling Ethereum&#8217;s Power Tools</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-05T14:01:00.000Z",
    "title": "Cardano (ADA) Slumps Following Market Sell-Off: What’s Next for 2024?",
    "url": "https://coinedition.com/cardano-ada-slumps-following-market-sell-off-whats-next-for-2024/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/ADA-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano (ADA) Slumps Following Market Sell-Off: What&#039;s Next for 2024?\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/ADA-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/ADA-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/ADA-2-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/ADA-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/ADA-2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/ADA-2-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/ADA-2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/ADA-2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/ADA-2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/ADA-2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/ADA-2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/ADA-2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/ADA-2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/ADA-2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/ADA-2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/ADA-2-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>ADA’s value has dropped by over 10% in the last week. Coin accumulation has lost momentum on the daily chart. Investors have preferred to remove liquidity from the ADA market. Cardano (ADA) has trended downward since the year began, shedding 11% of its value in the last seven days, according to data from CoinMarketCap. Due [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/cardano-ada-slumps-following-market-sell-off-whats-next-for-2024/\">Cardano (ADA) Slumps Following Market Sell-Off: What&#8217;s Next for 2024?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]