[
  {
    "source": "Cointelegraph",
    "date": "2023-09-13T19:03:20.000Z",
    "title": "Why is Bitcoin price up today?",
    "url": "https://cointelegraph.com/news/why-is-bitcoin-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2022-10/2975699c-abdd-4f7b-bd35-74267a570117.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin price gains strength despite today’s CPI report reflecting a slight energy price-induced increase in inflation.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price is up today, trading over $26,300 despite a higher-than-expected rise in inflation, according to the Sept. 13 <a href=\"https://www.bls.gov/charts/consumer-price-index/consumer-price-index-by-category-line-chart.htm\" target=\"_blank\" rel=\"noopener nofollow\">Consumer Price Index (CPI)</a> report. Bitcoin price regained the key $26,000 <a href=\"https://cointelegraph.com/news/bitcoin-price-cpi-inflation-jump-beyond-forecasts\">level sharply after</a> the report’s release giving confidence to <a href=\"https://cointelegraph.com/news/bitcoin-price-must-take-26k-says-trader-after-textbook-short-squeeze\">traders and analysts</a> who see this level as crucial. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/8217edd4-8f2c-4aa1-a04d-919284050f00.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin price. Source: </em><a href=\"https://www.tradingview.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>Let’s look into the reasons why Bitcoin price is up today. </p><h2>Annual Core CPI falls despite an overall uptick in inflation </h2><p>Bitcoin price and equities markets gained momentum after the release of the CPI report. According to the report, the overall CPI rose 3.7% in August, higher than the 3.5% in July. </p><p>The market seemed reactionary to energy prices, particularly for gasoline which showed a 10.6% monthly increase, as a temporary jump. Although gasoline costs are the second largest expense for households, prices are down on an annual basis. </p><p>The annual core CPI model which measures all items minus food and energy showed more positive data. August annual core CPI came in at 4.3% which is less than the previous month’s jump of 4.5%. Still, outliers may be providing confidence to the overall market. The U.S. Bureau of Labor Statistics noted on annual core CPI,</p><p>“The shelter index increased 7.3 percent over the last year, accounting for over 70 percent of the total increase in all items less food and energy.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/2dedbdcb-ac0c-44ea-994a-585cca97f8f9.png\"  /><figcaption style=\"text-align: center;\"><em>Annual CPI index. Source BLS.gov</em></figcaption></figure><p>The potential that inflation may reach the United States Federal Reserve’s 2% targets is providing hope that interest rate increases will pause, an outcome that investors believe benefits risk assets like Bitcoin. According to Quinn Thompson, Head of Growth and Capital Markets at Maple,</p><blockquote>“This is still a really challenging environment for long-duration tech assets, and it shouldn’t be all that surprising that the digital asset market has been struggling of late. There’s a lack of fresh capital flowing into the space, with interest rates remaining high many investors are choosing to park their money into high-yielding savings accounts and money-market funds. The recent strength across a number of commodities also is part of this problem because it highlights how underlying economic conditions are still relatively strong and that inflation is still an issue. Until that ends, capital availability in terms of being able to be deployed into crypto will be relatively scarce.”</blockquote><h2>Institutional interest in Bitcoin boosts market sentiment </h2><p>After U.S. <a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\">Court of Appeals</a> Circuit Judge Neomi Rao sided with Grayscale Bitcoin Trust (GBTC) in its case against the U.S. Securities and Exchange Commission (SEC) on Aug. 29, many large institutions filed for ETFs. </p><p>The recent <a href=\"https://cointelegraph.com/news/rising-institutional-interest-is-a-bullish-sign-for-crypto-seba-bank-exec\">growing institutional interest</a> in Bitcoin from companies like BlackRock and Fidelity Investments. While both institutions had BTC spot ETF approvals delayed on Sept. 2, the $1.5 trillion asset manager <a href=\"https://cointelegraph.com/news/franklin-templeton-files-bitcoin-spot-etf\">Franklin Templeton</a> filed with the <a href=\"https://www.sec.gov/Archives/edgar/data/1992870/000113743923001074/ftdhts1092023.htm\" target=\"_blank\" rel=\"noopener nofollow\">SEC</a> for a spot Bitcoin ETF on Sept. 12. </p><p>To date, the SEC has refused to approve a spot Bitcoin ETF, despite numerous applicants including <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">BlackRock</a>, Fidelity, <a href=\"https://cointelegraph.com/news/third-time-s-the-charm-ark-and-21shares-again-file-with-sec-for-bitcoin-etf\">Cathie Wood’s ARK</a> and 21Shares which has filed for approval three times. </p><p>BlackRock is the world’s <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-trust-good-or-bad-for-btc\">largest asset manager</a> with over $8.5 trillion in assets under management. The firm will also utilize Coinbase to custody the BTC in the trust according to the filing with the <a href=\"https://www.sec.gov/Archives/edgar/data/1980994/000143774923017574/bit20230608_s1.htm\" target=\"_blank\" rel=\"noopener nofollow\">SEC</a>. </p><p>The SEC’s next deadline for deciding on the application is Oct. 16.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</em></strong></a></p><h2>Bitcoin on exchanges continues to drop </h2><p>Coinciding with Bitcoin price gains, the BTC <a href=\"https://cointelegraph.com/news/bitcoin-exchanges-same-btc-supply-late-2017\">supply on exchanges </a>continues to remain below the Sept. 4 monthly peak. Exchanges have shed over 40,000 Bitcoin since that monthly peak.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/f5980268-1a14-485f-a4b5-1a917b387389.png\"  /><figcaption style=\"text-align: center;\"><em>BTC balance on exchanges. Source: Coinglass</em></figcaption></figure><p>The market perceives coins leaving crypto exchanges as a bullish signal, given traders withdraw their BTC typically when they want to hold it in self-custody long-term. </p><p>Interestingly, on-chain data shows that despite the elongated bear market, large swaths of Bitcoin investors are positioning for a BTC price rally as the number of wallets holding 0.1 BTC reached an <a href=\"https://cointelegraph.com/news/bitcoin-data-highlights-3-key-reasons-why-investors-don-t-care-about-btc-price\">all-time high</a> of 12 million on Sept. 12. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-to-hit-100k-in-2024-canaan-vp\"><strong><em>Bitcoin to hit $100K in 2024? Canaan VP weighs up 2024 halving opportunities</em></strong></a></p><p>While Bitcoin price is showing some bullish momentum in the short-term after the CPI report and Franklin Templeton ETF application, the <a href=\"https://cointelegraph.com/news/bitcoin-price-this-week-fear-26k-key-5-things\">Bitcoin Fear &amp; Greed Index</a> shows the market is still fearful, down 9 points compared to the previous month. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/dda67d12-e284-4637-bcb5-5a02746a1f4e.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Fear &amp; Greed Index. Source: Alternative.me</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/why-is-bitcoin-price-up-today&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-13T19:00:00.000Z",
    "title": "Google to allow NFT game ads, metaverse ‘hot’ in Asia: Nifty Newsletter",
    "url": "https://cointelegraph.com/news/google-to-allow-nft-game-ads-metaverse-hot-in-asia-nifty-newsletter",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/1eda9f9b-5bea-4cc9-8e33-88361a1f1185.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Google will allow NFT game advertisements that do not have any gambling or gambling services included within the games.  </p>\n                    <p><p>In this week’s newsletter, read about how Google will start allowing games featuring <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible tokens (NFTs)</a> to advertise and promote themselves using its platform and how a developer stole $1 million in assets from the Milady NFT collection. Check out how an insurance company excluded NFTs from a $20-million policy and how the metaverse is “hot” in Asian markets like Hong Kong, Korea and Japan. And don’t forget this week’s Nifty News featuring Binance ending its support for Polygon-based NFTs. </p><h2>Google will allow ads for NFT games starting Sept. 15</h2><p>Google made an update to its crypto ad policy to enable NFT game advertisements as long as gambling or gambling services are not promoted. According to a Google announcement, the changes will come into effect on Sept. 15.</p><p>NFT games that let players purchase in-game items, such as weapons or armor for characters, that enhance the user experience will be allowed. However, games that let players stake NFTs or wager their assets for rewards like crypto or other NFTs are still not allowed. </p><p><a href=\"https://cointelegraph.com/news/google-ads-nft-cryptocurrency-games-september\"><strong>Continue reading…</strong></a></p><h2>NFT collection Milady exploited by developer stealing $1M in fees</h2><p>Ethereum-based NFT project Milady Maker has been exploited by a developer within its ecosystem who stole $1 million in generated fees from Remilia, the decentralized autonomous organization (DAO) behind Milady. </p><p>A co-founder of the collection, Charlotte Fang announced on X (formerly Twitter) that they had identified the people involved in the attack and would pursue legal action against them. The executive said that they are expecting all of their property to be returned. </p><p><a href=\"https://cointelegraph.com/news/nft-project-milady-suffers-1million-fee-exploit\"><strong>Continue reading…</strong></a></p><h2>CNA Insurance excludes NFTs from coverage of $20M trust policy</h2><p>United States-based commercial insurer CNA Financial has excluded NFT coverage from a $20-million policy. In an SEC filing, the insurer attached an exclusion to the document about Schwab Strategic Trust’s policy.</p><p>The exclusion highlighted that the bond will not cover damages, losses or lawsuits related to NFTs. The document defined NFTs as any digital identifier connected to digital ledger technology. </p><p><a href=\"https://cointelegraph.com/news/nft-cna-insurance-excludes-coverage-from-20-m-trust-policy\"><strong>Continue reading…</strong></a></p><h2>Metaverse is dead in the West, but ‘so hot’ in Asia: The Sandbox co-founder</h2><p>While the metaverse may not be gaining as much traction in Western countries, The Sandbox co-founder and chief operating officer Sebastien Borget said that it’s “hot” in Asian markets. </p><p>According to the executive, roughly 50% of its business has come from several Asian countries, such as Hong Kong, Korea and Japan. “If you don’t focus on Asia, you will think the metaverse is dead from the North American and the Western side,” Borget said. </p><p><a href=\"https://cointelegraph.com/news/metaverse-dead-united-states-thriving-asia-sandbox-sebastien-borget\"><strong>Continue reading…</strong></a></p><h2>Nifty News: NFT restaurant crumbles, Binance NFT ends Polygon support and more</h2><p>Plans for an NFT-based restaurant and lounge project in San Francisco have ended after the team behind the company said that construction could not proceed due to challenging economic factors. Meanwhile, Binance’s NFT arm has announced that it will stop its support for Polygon-based NFTs without providing a reason behind the move. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-01/43adc850-7dbd-4fa8-811b-9eb32b6c1983.jpg\"  alt=\"\"  title=\"Google to allow NFT game ads, metaverse &lsquo;hot&rsquo; in Asia: Nifty Newsletter\"  /></figure><p><a href=\"https://cointelegraph.com/news/nifty-news-nft-restaurant-crumbles-binance-nft-ends-polygon-support-and-more\"><strong>Continue reading…</strong></a></p><p class=\"post-content__accent post-content__accent_big\"><a href=\"https://cointelegraph.com/podcasts/nft-steez\">CHECK OUT COINTELEGRAPH’S NFT STEEZ PODCAST</a></p><p><em>Thanks for reading this digest of the week’s most notable developments in the NFT space. Come again next Wednesday for more reports and insights into this actively evolving space.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-13T19:00:00.000Z",
    "title": "Ripple says security incident accelerated its acquisition of Fortress Trust",
    "url": "https://cointelegraph.com/news/ripple-security-incident-accelerated-fortress-trust-acquisition",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/af538f60-3f58-4446-982c-c6aee1aa26bf.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A multimillion-dollar security breach involving a third-party vendor hastened Ripple’s acquisition of Fortress Trust on Sept. 8. </p>\n                    <p><p>The takeover of Fortress Trust by financial technology company Ripple on Sept. 8 involved more than just an acquisition deal. The transaction was accelerated by a security incident hours earlier <a href=\"https://twitter.com/Fortress_io/status/1699793873395191813\" target=\"_blank\" rel=\"noopener nofollow\">involving</a> a Fortress third-party analytics vendor, Ripple confirmed to Cointelegraph. </p><p>According to a representative from Ripple, discussions between the companies intensified last week after cloud tools of a third-party analytics vendor were compromised. In an interview with Fortune, Fortress CEO Scott Purcell <a href=\"https://fortune.com/crypto/2023/09/12/fortress-trust-12-to-15-million-hack-bitcoin-usdc-usdt-ripple/\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the company lost $12 million to $15 million in the incident. A majority of the funds were Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), along with small amounts of USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) and Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>). </p><p>Ripple, an investor in Fortress since its seed round in 2022, had to step in to make customers whole: </p><blockquote>\"[T]his opportunity makes sense for Ripple in the long term. Luckily, Ripple was in a position to act quickly to step in and make customers whole, and there have been no breaches to Fortress technology or systems. Fortress notified customers immediately of the incident when it happened — as they mentioned in their tweets.\"</blockquote><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/ripple-acquires-fortress-trust-expands-license-portfolio-united-states\"><strong>Ripple acquires Fortress Trust, expands license portfolio in the US</strong></a></em></p><p>The incident stirred controversy across the crypto community. BitGo CEO Mike Belshe <a href=\"https://twitter.com/mikebelshe/status/1701322135778820181\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> on X (formerly Twitter) that “Fortress was not forthcoming about what actually did happen,\" claiming the company chose to “omit facts” and “downplay the event” by saying no funds were stolen. Fortress uses BitGo to custody part of its assets. BitGo said assets under its custody had not been affected.</p><p>Fortress co-founder Kevin Lehtiniitty labeled Belshe’s comments as “misleading statements,\" asserting that BitGo was “fully in the loop from the start.\" Moreover, he hinted at an acquisition proposal from BitGo to Fortress, saying, “[You] appear to be upset that Scott [Fortress’ CEO] chose to go with Ripple instead of the deal you proposed.\"</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Mike, without breaking the terms of our NDA, you 1/ were fully in the loop from the start 2/ appear to be upset that Scott chose to go with Ripple instead of the deal you proposed, and 3/ are now trying to stoke fear among our clients with misleading statements. 1/2 <a href=\"https://t.co/KaLgtxeMT8\">https://t.co/KaLgtxeMT8</a></p>&mdash; Kevin Lehtiniitty  (@KevLeht) <a href=\"https://twitter.com/KevLeht/status/1701633251624821020?ref_src=twsrc%5Etfw\">September 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Ripple announced plans last week to invest even further in Fortress’ group, including ongoing discussions with parent company Fortress Blockchain Technologies, as well as FortressPay. In a statement to Cointelegraph, the company’s representative said:</p><blockquote>“Fortress has been entertaining acquisition conversations for a couple of months now with numerous parties as they look to hone in and grow their payments business (FortressPay). This wasn’t our first time speaking to them about a potential acquisition.\"</blockquote><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-13T18:52:18.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-13T18:44:08.000Z",
    "title": "The Jets QB’s injury at the Bills Match sends Draftkings NFT soaring",
    "url": "https://www.cryptopolitan.com/jets-qbs-injury-sends-draftkings-nft-soaring/",
    "description": "The New York Jets fans&#8217; worst nightmare came to fruition on Monday, as Aaron Rodgers, the New York Jets QB, fell victim to a knee injury in his much-anticipated debut in the first quarter against the NFL franchise, the Buffalo Bills.&#160; The QB is feared to have injured his Achilles, which may keep him off ... <a title=\"The Jets QB’s injury at the Bills Match sends Draftkings NFT soaring\" class=\"read-more\" href=\"https://www.cryptopolitan.com/jets-qbs-injury-sends-draftkings-nft-soaring/\" aria-label=\"More on The Jets QB’s injury at the Bills Match sends Draftkings NFT soaring\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-13T19:06:25.000Z",
    "title": "SEC charges ‘Stoner Cats’ NFT creators for selling unregistered securities",
    "url": "https://crypto.news/sec-charges-stoner-cats-nft-creators-for-selling-unregistered-securities/",
    "description": "The SEC has said actress Mila Kunis' Stoner Cats raised $8 million from selling unregistered securities in more than one US state"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-13T18:58:28.000Z",
    "title": "Hong Kong’s SFC cautions against unregulated crypto trading by JPEX",
    "url": "https://crypto.news/hong-kongs-sfc-cautions-against-unregulated-crypto-trading-by-jpex/",
    "description": "The Hong Kong Securities and Futures Commission (SFC) has advised investors to exercise caution regarding JPEX, a cryptocurrency exchange operating without regulatory approval"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-13T19:00:39.000Z",
    "title": "This Latest Move Suggests SEC Lawsuit Against Ripple Is Pushing The Crypto Firm Outside The US",
    "url": "https://www.newsbtc.com/ripple-2/us-sec-lawsuit-ripple/",
    "description": "Ripple may be in the process of leaving the United States market for good as the prominent crypto firm has stated that it will be acquiring the majority of its employee candidates from countries outside the US.  Ripple Will Recruit A Workforce Overseas US-based cryptocurrency solutions provider, Ripple has enacted plans to conduct its hiring processes outside US borders. The cryptocurrency firm has stated that over 80% of its workforce will be recruited from countries outside the US that encourage crypto adoption and innovation. Related Reading: SEC Boss Gary Gensler Completes Senate Hearing: Here’s What Crypto Investors Should Know The decision to hire the majority of its workforce internationally can be seen as a strategic move to counteract the effects brought about by the regulatory changes enacted by the United States Securities and Exchange Commission (SEC). In light of the legal dispute between Ripple and the US SEC, the Chief Executive Officer of Ripple, Brad Garlinghouse expressed his enthusiasm about the crypto firm’s expansion in new regions. He stated that the firm will be focusing on hiring candidates in regions like Singapore, Hong Kong, and Dubai which have favorable outlooks and regulatory conditions on cryptocurrency.  “It’s super frustrating that you see markets like we have here in Singapore, where governments are partnering with the industry, providing clear rules, and you’re seeing growth. That’s why Ripple is hiring there,” Garlinghouse stated in an interview with Bloomberg.  Presently, the United States does not have a clear regulatory framework for cryptocurrency assets, and the US Congress has also been relatively slow in clarifying the status of cryptocurrencies. XRP prices maps recovery above $0.48 &#124; Source: XRPUSD on Tradingview.com SEC Lawsuit Developments Ripple has been embroiled in a lawsuit with the US SEC since 2020. The SEC had previously sued Ripple for allegedly raising over $1 billion in unregistered securities offerings by selling XRP.  In July 2023, Ripple secured a victory after Judge Analisa Torres ruled in favor of Ripple and stated that XRP was not a security. The SEC responded by filing an interlocutory appeal, however, it is unsure if Judge Torres will grant the SEC’s request. Related Reading: Why The NASDAQ’s Latest Move Is Important For Fund Managers Filing Ethereum ETFs Over the years, Ripple has reportedly spent over $200 million defending itself against the SEC allegations. The cryptocurrency’s native token XRP was delisted from several exchanges in 2021 while its price declined significantly and lost the majority of the gains it had accumulated over the years. However, since Judge Torres’s ruling, leading exchanges such as Coinbase and Bitstamp have already moved to relist XRP since the court did not deem programmatic exchange sales to qualify as securities offerings. Featured image from CoinTurk News, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-13T19:02:54.000Z",
    "title": "Ripple CEO Addresses SEC Appeal: Optimism Amid Legal Battle For a Rising XRP Price Beyond $1",
    "url": "https://www.crypto-news-flash.com/ripple-ceo-addresses-sec-appeal-optimism-amid-legal-battle-for-a-rising-xrp-price-beyond-1/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-ceo-addresses-sec-appeal-optimism-amid-legal-battle-for-a-rising-xrp-price-beyond-1",
    "description": "<img width=\"512\" height=\"279\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-71.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-71.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-71-300x163.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ripple CEO Brad Garlinghouse speaks on the decision of SEC to go for appeal following a court ruling on the security status of XRP. Garlinghouse also hinted that the company would be making 80 percent of its hiring outside the US.  Ripple&#8217;s long-standing legal battle against the US Securities and Exchange Commission was nearly concluded [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-13T18:45:29.000Z",
    "title": "Former Celsius CEO Alex Mashinsky Asks Court To Dismiss FTC’s Fraud Charges",
    "url": "https://dailyhodl.com/2023/09/13/former-celsius-ceo-alex-mashinsky-asks-court-to-dismiss-ftcs-fraud-charges/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/ceo-ask-court-fraud.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/ceo-ask-court-fraud.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/ceo-ask-court-fraud.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/ceo-ask-court-fraud.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/ceo-ask-court-fraud.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/ceo-ask-court-fraud.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/ceo-ask-court-fraud.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The former chief executive of bankrupt crypto lending company Celsius has asked a US court to dismiss the Federal Trade Commission&#8217;s (FTC) charges against him. Alex Mashinsky and Celsius&#8217; former chief revenue officer Roni Cohen-Pavon were arrested in July. The former executives were slapped with a variety of criminal and civil charges from the FTC, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/13/former-celsius-ceo-alex-mashinsky-asks-court-to-dismiss-ftcs-fraud-charges/\">Former Celsius CEO Alex Mashinsky Asks Court To Dismiss FTC’s Fraud Charges</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-13T18:41:30.000Z",
    "title": "Tom Emmer Launches Anti-Surveillance State Act With 49 Republicans in New Push Against CBDCs",
    "url": "https://dailyhodl.com/2023/09/13/tom-emmer-launches-anti-surveillance-state-act-with-49-republicans-in-new-push-against-cbdcs/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/Altcoin-Project-Goes-on.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/Altcoin-Project-Goes-on.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/Altcoin-Project-Goes-on.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/Altcoin-Project-Goes-on.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/Altcoin-Project-Goes-on.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/Altcoin-Project-Goes-on.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/Altcoin-Project-Goes-on.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Congressman Tom Emmer is leading the reintroduction of a bill that aims to prevent the Federal Reserve from creating a digital dollar. Emmer says on the social media platform X that if it isn&#8217;t designed to emulate cash, then a central bank digital currency (CBDC) would dismantle Americans&#8217; right to financial privacy while also emboldening [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/13/tom-emmer-launches-anti-surveillance-state-act-with-49-republicans-in-new-push-against-cbdcs/\">Tom Emmer Launches Anti-Surveillance State Act With 49 Republicans in New Push Against CBDCs</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]