[
  {
    "source": "CoinDesk",
    "date": "2024-02-06T18:02:55.000Z",
    "title": "Bankruptcy Was Crypto Winter’s Circuit Breaker",
    "url": "https://www.coindesk.com/consensus-magazine/2024/02/06/bankruptcy-was-crypto-winters-circuit-breaker/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Societies have often frowned on bankruptcy, viewing it in moral terms as a breach of trust. But, in the wake of 2022's scandals, the process helped relaunch the crypto industry, says Michael Casey."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-06T17:47:41.000Z",
    "title": "Twitter Rival Bluesky Opens to Public Right as Farcaster Gains Steam",
    "url": "https://decrypt.co/216106/twiter-rival-bluesky-opens-public-farcaster",
    "description": "Bluesky, a decentralized social media platform, has gained 3 million users since it launched in beta last March."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-06T17:45:00.000Z",
    "title": " ETH price may repeat $2.7K January spike as Bitcoin cools — analysis ",
    "url": "https://cointelegraph.com/news/eth-price-repeat-2-7-k-january-spike-bitcoin-analysis",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMTM0N2YxMzAtOTNlZC00MzI4LTg0OGYtYmFkMGZhM2M2NDY1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ethereum is stealing Bitcoin traders' attention as BTC price action rests within a consolidation range.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) returned to attack liquidity at $43,500 after the Feb. 6 Wall Street open as attention focused on Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>).</p><p>Data from <a href=\"https://subscription.cointelegraph.com/\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> tracked repeat BTC price action within a narrow intraday range.</p><p>The largest cryptocurrency saw <a href=\"https://cointelegraph.com/news/btc-price-new-february-high-bitcoin-target-25k\">new February highs of $43,515</a> on Bitstamp the day prior before giving back all its gains, only to attempt a reclaim after the daily close.</p><p><a href=\"https://cointelegraph.com/news/eth-price-repeat-2-7-k-january-spike-bitcoin-analysis\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-06T17:44:37.000Z",
    "title": " Federal Reserve drops enforcement action against FTX-linked US bank ",
    "url": "https://cointelegraph.com/news/fed-drops-enforcement-action-ftx-bank",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMjczOTE2NDMtOGIwNy00MGQ2LWI4ZmYtZjMxODYzZGFlNTU4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>According to the Fed, Farmington State Bank had winded down operations and “no longer functions as a bank” following the initial enforcement action.</p>\n                    <p><p>The Federal Reserve Board of the United States announced it terminated an enforcement action against Farmington State Bank, a financial institution tied to the defunct cryptocurrency exchange FTX.</p><p>In a Feb. 6 statement, the Fed <a href=\"https://www.federalreserve.gov/newsevents/pressreleases/enforcement20240206b.htm\" target=\"_blank\" rel=\"noopener nofollow\">said</a> following its July 2023 enforcement action, Farmington had winded down operations and “no longer functions as a bank.” The Federal Reserve said it terminated its actions against Farmington and its holding company, FBH Corporation.</p><p>Formerly named Moonstone, Farmington State Bank received roughly $11.5 million from FTX’s sister firm, Alameda Research, through FBH Corporation in March 2022. The Fed said in August 2023 that the enforcement action was taken to wind down operations and protect depositors.</p><p><a href=\"https://cointelegraph.com/news/fed-drops-enforcement-action-ftx-bank\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-06T17:44:08.000Z",
    "title": "Solana resumes operations after resolving major outage",
    "url": "https://cryptoslate.com/solana-resumes-operations-after-resolving-major-outage/",
    "description": "<p>The Solana blockchain network resumed full operations following a five-hour major outage that temporarily halted transactions and disrupted services. The interruption, which started at approximately 9:53 AM UTC, was resolved after a collaborative effort by Solana&#8217;s engineers and validator operators, leading to a successful network restart at 14:57 UTC. It was the first outage for [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/solana-resumes-operations-after-resolving-major-outage/\">Solana resumes operations after resolving major outage</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-06T17:46:32.000Z",
    "title": "EigenLayer’s TVL soars 120% in less than 48 hours",
    "url": "https://cryptobriefing.com/eigenlayer-tvl-soars-48-hours/?utm_source=feed&utm_medium=rss",
    "description": "With 558,000 stETH restaked, Lido commands a 54% market share in EigenLayer's liquid staking tokens ecosystem."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-06T17:50:00.000Z",
    "title": "CoinStats Launches AI-powered Exit Strategy Feature to Maximize User Profits",
    "url": "https://cryptodaily.co.uk/2024/02/coinstats-launches-ai-powered-exit-strategy-feature-to-maximize-user-profits",
    "description": "In a meaningful development for cryptocurrency investors, CoinStats, the all-in-one digital asset management platform, has launched its new Exit Strategy feature."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-06T18:00:35.000Z",
    "title": "Enhancing DeFi: Equalizer Introduces New Meta Aggregator and Airdrop Explorer Services",
    "url": "https://news.bitcoin.com/enhancing-defi-equalizer-introduces-new-meta-aggregator-and-airdrop-explorer-services/",
    "description": "<img width=\"768\" height=\"461\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240206_171423_549-768x461.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240206_171423_549-300x180.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240206_171423_549-1024x614.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240206_171423_549-768x461.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/img_20240206_171423_549.png 1200w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. Road Town, British Virgin Islands, February 6th, 2024, Chainwire. Equalizer Elevates Their DeFi Platform with Launch of DEX &#38; Bridge Aggregator and Airdrop Explorer Features In a significant leap forward for decentralized finance, Equalizer is proud to announce the launch of two innovative services: a Meta Aggregator and an Airdrop Explorer. These additions, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-06T17:59:13.000Z",
    "title": "WRX Price Prediction 2024-2033: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2024-2033 How much is WRX worth? The current price of WazirX (WRX) is $0.194, accompanied by a 24-hour trading volume of $1.1 million. The market capitalization stands at $50.9 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 4.7% decrease. Currently, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-06T17:48:43.000Z",
    "title": "Nvidia Soars to Record High on Goldman Sachs’ Raised Price Target",
    "url": "https://www.cryptopolitan.com/nvidia-soars-to-record-high-on-goldman-sachs-raised-price-target/",
    "description": "Nvidia Corporation&#8217;s (NASDAQ: NVDA) stock surged to new heights on Monday, reaching an all-time high, as Goldman Sachs upped its price target for the semiconductor powerhouse. The move comes amid expectations of substantial earnings growth stemming from the ongoing artificial intelligence (AI) boom.&#160; Record-breaking ascent Nvidia&#8217;s shares jumped approximately 4% to a staggering $689.21 on [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-06T18:07:36.000Z",
    "title": "Consensys, Robinhood announce MetaMask integration to simplify crypto purchases",
    "url": "https://crypto.news/consensys-robinhood-announce-metamask-integration-to-simplify-crypto-purchases/",
    "description": "Consensys, in collaboration with Robinhood, announced the integration of Robinhood Connect with MetaMask."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-06T18:00:11.000Z",
    "title": "Ronin Plunges Nearly 30% After Binance Debut, Raising Concerns About Pre-Listing Hype",
    "url": "https://www.newsbtc.com/news/ronin-plunges-nearly-30-after-binance-debut-raising-concerns-about-pre-listing-hype/",
    "description": "Ronin (RON), the token powering the Ronin Network, experienced a rollercoaster ride in the past 24 hours, rallying to a two-year high before crashing nearly 30% after its listing on Binance. This dramatic price swing has raised questions about potential market manipulation and the long-term viability of the project. Related Reading: Market Dip? Not For Dogecoin Wallets As Over 400,000 New Users Drive Frenzy Upward From Hero To Zero: A Short-Lived Rally On February 5th, RON enjoyed a meteoric rise, surging 15% to reach a peak of $3.54. This rally was fueled by investor optimism surrounding the network&#8217;s growing user base and address activity. Trading volume spiked to $80 million, signifying increased market participation. However, the euphoria was short-lived. Coinciding with the Binance listing announcement, the price began a precipitous decline five hours after trading commenced on the exchange. By today, RON has shed nearly 30% of its value, currently trading at $2.54. This drop marks a breach of the crucial $3 support level, which the token had recently reclaimed after 14 months. Ronin currently trading at $2.7899 on the daily chart: TradingView.com Negative Sentiment And Selling Pressure Mount Social media sentiment surrounding RON mirrored the price action. Santiment data (chart below) reveals a 250% increase in social volume within 24 hours, but with a concerning shift towards bearishness. Negative sentiment spiked from 0.87 to 5.58, reflecting growing investor concerns. This negativity translated into significant selling pressure, with 24-hour trading volume soaring 275% to $203 million. Market participants, eager to offload their holdings, contributed to the downward spiral. Source: Santiment Related Reading: Crypto Winter In Spain? New Taxes Target Digital Assets Binance Under Scrutiny: Pump And Dump Allegations The timing of the price surge and subsequent crash has fueled speculation of a &#8220;pump and dump&#8221; scheme, with some accusing Binance of complicity. While no concrete evidence has surfaced, Yi He, Binance&#8217;s co-founder, acknowledged the concerns and announced a $5 million bounty program to expose any corrupt employees involved in such activities. Future Uncertain: A Cautious Outlook Despite the recent setback, RON still stands at a 23-month high compared to February 2022. However, the future remains uncertain. The sharp drop, shifting sentiment, and potential manipulation allegations have cast a shadow over the project&#8217;s prospects. Featured image from Adobe Stock, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-06T17:55:28.000Z",
    "title": "Majority of Crypto Market Participants See Bitcoin Running As High as $100,000 in Next BTC Expansion: Bitget",
    "url": "https://dailyhodl.com/2024/02/06/majority-of-crypto-market-participants-see-bitcoin-running-as-high-as-100000-in-next-btc-expansion-bitget/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/majority-market-see-as.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/majority-market-see-as.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/02/majority-market-see-as.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/02/majority-market-see-as.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/02/majority-market-see-as.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/majority-market-see-as.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/02/majority-market-see-as.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Most crypto participants believe that Bitcoin (BTC) will surpass its all-time high (ATH) price sometime after the upcoming halving event, according to a new study. The research, issued by crypto trading platform Bitget, surveyed 9,748 crypto investors from different regions across the globe including West Europe, East Europe, South East Asia, East Asia, MENA (Middle [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/06/majority-of-crypto-market-participants-see-bitcoin-running-as-high-as-100000-in-next-btc-expansion-bitget/\">Majority of Crypto Market Participants See Bitcoin Running As High as $100,000 in Next BTC Expansion: Bitget</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]