[
  {
    "source": "Cointelegraph",
    "date": "2023-06-14T02:40:11.000Z",
    "title": "SEC and Binance.US to negotiate deal avoiding total asset freeze",
    "url": "https://cointelegraph.com/news/sec-binance-us-negotiate-deal-asset-freeze",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/e863d071-248b-4dab-9b00-cf8de2ec8d6d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>U.S. District Judge Amy Berman Jackson has ordered the two entities to work towards a compromise.</p>\n                    <p><p>Binance.US and the United States Securities and Exchange Commission (SEC) have agreed to work on an arrangement that will allow the exchange to avoid freezing all of its assets.</p><p>On June 14, Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2023-06-13/binance-us-sec-not-far-apart-on-deal-avoiding-full-asset-freeze#xj4y7vzkg\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> U.S. District Judge Amy Berman Jackson referred the two organizations to a magistrate judge to work <a href=\"https://cointelegraph.com/news/sec-and-binance-seek-compromise-on-us-assets-freeze\">towards a compromise</a> arrangement that can protect customer funds without having to shut down the exchange. </p><p>“Shutting it down completely would create significant consequences not only for the company but for the digital asset markets in general,” Jackson said at a June 13 hearing. </p><p>Judge Jackson noted she wouldn’t come to a final decision on <a href=\"https://cointelegraph.com/news/sec-files-motion-for-restraining-order-against-binance\">the SEC’s motion</a> for a temporary restraining order until the two parties had worked through the situation with the magistrate.</p><p>An update on the negotiations made with the magistrate has been scheduled for the end of business hours on June 15. </p><p>Additionally, she noted the SEC and Binance.US seemed “not that far apart” when it came to reaching an agreement on the matter. </p><p>Before Judge Jackson reached her decision at the hearing, former SEC enforcement attorney John Read Stark informed his 20,000 Twitter followers that there is “a lot of conflict between what each party” wanted to get out of the hearing.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">SEC/Binance Newsflash: Dueling Consent Orders (Read Them Now)<br><br>The SEC and the Binance defendants have each submitted draft orders of what each party wants the Judge to order in the SEC/Binance Emergency Asset Freeze Enforcement Action. <br><br>There is obviously a lot of conflict… <a href=\"https://t.co/UWjXSgL5lR\">pic.twitter.com/UWjXSgL5lR</a></p>&mdash; John Reed Stark (@JohnReedStark) <a href=\"https://twitter.com/JohnReedStark/status/1668681623489990658?ref_src=twsrc%5Etfw\">June 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“That does not mean the judge cannot order a compromise and find common ground,” Stark explained.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-can-t-find-binance-ceo-changpeng-zhao-asks-court-for-alternative-service\"><strong><em>SEC can’t find Binance CEO Changpeng Zhao, asks court for ‘alternative service’</em></strong></a></p><p>The SEC filed an emergency motion for a temporary restraining order on Binance.US on June 6, after <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.dcd.256060/gov.uscourts.dcd.256060.21.0_2.pdf\" target=\"_blank\" rel=\"noopener nofollow\">accusing</a> Binance CEO Changpeng Zhao (CZ) of being able to access Binance.US customer funds.</p><p>The regulator alleged Zhao moved $12 billion of Binance’s funds through an entity he controlled called Merit Peak. </p><p>In a June 12 joint <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.dcd.256060/gov.uscourts.dcd.256060.43.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">memorandum</a> submitted ahead of the hearing on the restraining order, both Binance.US and Zhao denied the claims that funds were ever mishandled. They accused the SEC of being “unable to identify a single instance” in which Binance.US customer funds were ever misused. </p><blockquote>“Indeed, there is no ‘emergency’ here at all, other than the one manufactured by the SEC for its own purposes.”</blockquote><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation — Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-14T02:39:53.000Z",
    "title": "Bitcoin Price Looks Set To Start Recovery Toward $27K, Here’s Why",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-recovery-toward-27k/",
    "description": "Bitcoin price is forming a base above the $25,500 support. BTC could start a fresh increase if it clears the key $26,200 resistance zone in the near term. Bitcoin is holding the key $25,500 support zone and consolidating. The price is trading above $26,000 and the 100 hourly Simple moving average. There is a major rising channel forming with support near $25,750 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a recovery wave if there is a move above the $26,200 resistance. Bitcoin Price Could Soon Recover Bitcoin price is still trading above the $25,400 support zone. BTC remained supported after the US CPI report was released which showed the inflation eased to 4% in May 2023. The price is slowly moving higher above the $25,800 level. It cleared the 50% Fib retracement level of the recent drop from the $26,260 swing high to the $25,713 low. Besides, there is a major rising channel forming with support near $25,750 on the hourly chart of the BTC/USD pair. Bitcoin price is now trading above $26,000 and the 100 hourly Simple moving average. It seems to be facing resistance near the $26,150 level or the 76.4% Fib retracement level of the recent drop from the $26,260 swing high to the $25,713 low. The first major resistance is near the $26,200 level. A clear move above the $26,200 resistance might start a fresh increase. The next major resistance is near the $26,775 level, above which the bulls might send BTC toward the $27,000 resistance zone. Source: BTCUSD on TradingView.com The next key resistance is near the $27,200 level, above which Bitcoin might rise toward the $27,500 resistance. Any more gains above the $27,500 resistance zone might send the price toward the $28,000 resistance zone. Fresh Decline in BTC? If Bitcoin’s price fails to clear the $26,200 resistance, it could start another decline. Immediate support on the downside is near the $25,780 level and the channel zone. The next major support is near the $25,500 level, below which the price might struggle to remain in a positive zone. In the stated case, the price could drop toward the $25,000 support in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is above the 50 level. Major Support Levels – $25,750, followed by $25,500. Major Resistance Levels – $26,150, $26,200, and $26,775."
  }
]