[
  {
    "source": "Cointelegraph",
    "date": "2024-03-07T20:11:53.000Z",
    "title": " Solana (SOL) tops $150 amid Pantera Capital bid, surge in memecoin and DApp activity  ",
    "url": "https://cointelegraph.com/news/solana-sol-tops-150-amid-pantera-capital-bid-surge-in-memecoin-and-dapp-activity",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYWE1MzA4YzUtN2EzMi00YmRkLWJkNzMtODhkNWNkNzJhZjAwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A handful of new developments back Solana’s swift rally to $150, but are any of them sustainable?</p>\n                    <p><p>Solana’s native (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) token surged by 19.5% between March 5 and March 7, reaching $150 for the first time since January 2022. The increase gained momentum after Bloomberg reported Pantera Capital's asset manager's <a href=\"https://cointelegraph.com/news/pantera-fundraise-buy-250-million-sol-ftx\">plans to purchase</a> $250 million worth of SOL tokens from the bankrupt FTX estate. Traders are now questioning whether SOL can sustain its 47% gains over twelve days and the likelihood of the altcoin surpassing $200.</p><p>Regardless of whether Pantera Capital's proposal is accepted, it represents only a fraction of the $5.9 billion held in SOL tokens by the FTX estate, accounting for nearly 10% of the supply. Therefore, the bullish momentum likely stems from other factors, such as the frenzy surrounding Solana SPL memecoins. For example, on March 6, a collection of tokens <a href=\"https://cointelegraph.com/news/traders-investing-poorly-drawn-celebrity-solana-memecoins\">inspired by celebrities</a> and poorly drawn tokens like Jeo Boden, Juses crust, and Spooderman, dominated in terms of volume and performance.</p><p>Even for those who see no value in the trend, it encourages investors to speculate on newly launched tokens within the Solana network and prompts developers to provide liquidity for their projects. Essentially, the momentary hype positively influences the demand for SOL tokens and the utilization of its decentralized exchanges (DEX) ecosystem. By attracting attention, particularly from newcomers, the Solana network solidifies its appeal to traders who may be less concerned about decentralization and perhaps even lower fees on competing blockchains.</p><p><a href=\"https://cointelegraph.com/news/solana-sol-tops-150-amid-pantera-capital-bid-surge-in-memecoin-and-dapp-activity\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-07T20:27:00.000Z",
    "title": "Fed chair Powell confirms regulator has no plans to recommend, adopt CBDCs",
    "url": "https://cryptoslate.com/fed-chair-powell-confirms-regulator-has-no-plans-to-recommend-adopt-cbdcs/",
    "description": "<p>US Federal Reserve Chair Jerome Powell told lawmakers that the regulator remains far from adopting or even recommending a central bank digital currency (CBDC). Powell made the statement during a March 7 Senate Banking Committee hearing on monetary policy. The Fed chair&#8217;s testimony aimed to quell fears over privacy concerns, emphasizing that the Federal Reserve [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/fed-chair-powell-confirms-regulator-has-no-plans-to-recommend-adopt-cbdcs/\">Fed chair Powell confirms regulator has no plans to recommend, adopt CBDCs</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-07T20:38:35.000Z",
    "title": "CEX.IO Expands Portfolio with 19 New Cryptos in Q1 2024",
    "url": "https://cryptodaily.co.uk/2024/03/cexio-expands-portfolio-with-19-new-cryptos-in-q1-2024",
    "description": "CEX.IO Expands Portfolio with 19 New Cryptos in Q1 2024"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-07T20:33:46.000Z",
    "title": "SOL anticipates surge with upcoming retail launch of GFOX",
    "url": "https://crypto.news/sol-anticipates-surge-with-upcoming-retail-launch-of-gfox/",
    "description": "Amid the cryptocurrency market's fluctuations, Solana stands out for its scalability and efficiency, while Galaxy Fox captures attention with its blend of meme culture and blockchain gaming.  #partnercontent"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-07T20:29:28.000Z",
    "title": "K33Research: Cryptocurrency spike returns retail to market",
    "url": "https://crypto.news/crypto-spike-retail-market/",
    "description": "K33Research spots spikes in website traffic to crypto exchanges, suggesting retail is gradually returning."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-07T20:23:34.000Z",
    "title": "Jerome Powell: CBDC not on the horizon anytime soon",
    "url": "https://crypto.news/jerome-powell-cbdc/",
    "description": "In testimony before the Senate Banking Committee, Federal Reserve Chair Jerome Powell stated the Federal Reserve is nowhere near making a recommendation or adopting a CBDC."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-07T20:23:04.000Z",
    "title": "Solana’s rise and Rebel Satoshi launch offer new crypto opportunities",
    "url": "https://crypto.news/solanas-rise-and-rebel-satoshi-launch-offer-new-crypto-opportunities/",
    "description": "Solana (SOL) nears a major peak, signifying market recovery and investor interest. Rebel Satoshi ($RBLZ) launches, offering new profit avenues post-successful presale. #partnercontent"
  }
]