[
  {
    "source": "Decrypt",
    "date": "2023-11-30T14:01:02.000Z",
    "title": "Ubisoft-Backed Horizon Launches Sequence Builder to Make Crypto Game Dev Easier",
    "url": "https://decrypt.co/208034/ubisoft-backed-horizon-launches-sequence-builder-make-crypto-game-dev-easier",
    "description": "Horizon Blockchain Games' Sequence development platform has launched Builder, which is designed to make adding crypto and NFTs to games easier and faster."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-30T13:56:58.000Z",
    "title": "Bitcoin Miner AntPool to Refund Record-Breaking $3 Million Transaction Fee",
    "url": "https://decrypt.co/208103/bitcoin-miner-antpool-to-refund-record-breaking-3-million-transaction-fee",
    "description": "The Bitcoin user who paid a $3 million transaction fee has been invited to verify their identity and collect a refund from AntPool."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-30T14:00:00.000Z",
    "title": "ChatGPT’s first year marked by existential fear, lawsuits and boardroom drama",
    "url": "http://cointelegraph.com/news/chat-gpt-artificial-intelligence-first-year-marked-existential-fear-lawsuits-boardroom-drama",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/91f14224-1e92-4dbc-ad0f-be2aba97707d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cointelegraph reflects on the artificial intelligence pause that never happened, a lawsuit that could change the entire AI industry, and the Sam Altman firing and rehiring drama.</p>\n                    <p><p>OpenAI’s ChatGPT is, by the numbers, the most popular artificial intelligence (AI) tool in the world. It was launched a year ago, on Nov. 30, 2022, and catapulted to 100 million monthly users within its first three months.</p><p>On its one-year anniversary, ChatGPT now boasts 100 million weekly users, and <a href=\"https://trends.google.com/trends/explore?q=chatgpt&amp;hl=en-GB\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to Google Trends data, it is currently at the height of its global popularity. </p><p>In just 12 months, ChatGPT’s existence has contributed to narratives surrounding the extinction of humankind, accusations that OpenAI built it by allegedly committing mass-scale copyright infringement, and a tumultuous CEO firing and rehiring that pundits are still trying to understand. </p><h2>ChatGPT’s existential threat to humanity</h2><p>In March 2023, thousands of researchers, CEOs, academics and pundits involved in the field of AI signed an open letter <a href=\"https://cointelegraph.com/news/elon-musk-and-tech-execs-call-for-pause-on-ai-development\">calling on AI developers around the world</a> to pause the development of any AI systems that are more powerful than GPT-4 for at least six months, sharing concerns that “human-competitive intelligence can pose profound risks to society and humanity,” among other things. </p><p>While the efficacy and viability of a global, self-imposed pause on AI development is still being debated, the letter had almost no discernable impact on the industry. OpenAI and its competitors, such as Anthropic, Google and Elon Musk — one of the signatories advocating for the pause — continued to develop their respective AI endeavors throughout 2023. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">GPT-4? More like GPT-Snore! <br><br>When it comes to humor, GPT-4 is about as funny as a screendoor on a submarine. <br><br>Humor is clearly banned at OpenAI, just like the many other subjects it censors. <br><br>That’s why it couldn&#39;t tell a joke if it had a goddamn instruction manual. It&#39;s like…</p>&mdash; Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1722893370010313117?ref_src=twsrc%5Etfw\">November 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p>In the case of Musk, his chatbot and <a href=\"https://cointelegraph.com/news/elon-musk-launches-ai-chatbot-grok-says-it-can-outperform-chatgpt\">self-professed ChatGPT competitor</a>, Grok, was launched nearly six months to the day after the billionaire mogul signed the letter. </p><h2>A lawsuit’s existential threat to ChatGPT</h2><p>A <a href=\"https://cointelegraph.com/news/authors-guild-class-action-lawsuit-open-ai\">class-action lawsuit involving a group of authors</a>, including John Grisham and George R.R. Martin, got underway in September. The outcome of this particular case could, eventually, have an outsized impact on the entire field of AI.</p><p>The authors are suing OpenAI for alleged copyright infringement. They claim the company violated copyright by training ChatGPT on their works without crediting, licensing or permission. In doing so, argue the lawyers representing them, OpenAI jeopardized their livelihood. They seek damages of up to $150,000 for each piece of work where copyright is infringed. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/amazon-chatgpt-competitor-q-for-business\"><strong><em>Amazon launches ‘Q’ — a ChatGPT competitor purpose-built for business</em></strong></a></p><p>Why it matters: While the fines could potentially be substantial depending on how many individual books the plaintiffs allege were unlawfully used to train ChatGPT, the more important issue will be whether OpenAI and other companies can continue training on data scraped from the internet. </p><p>It’s likely beyond the scope of this case to determine the future of ChatGPT, but a ruling in favor of the plaintiffs could set a precedent that ultimately restricts a company’s ability to monetize publicly available data. This could, hypothetically, serve as a poison pill for large language models as, by and large, the scale of a model’s data set has so far been among the most determinant factors governing its capabilities. </p><h2>Who’s the boss (at OpenAI)? </h2><p>Meanwhile, OpenAI’s board appears to have committed 2023’s biggest unforced error in executive hiring and firings. </p><p>In the span of only four days, the company’s board of directors managed to <a href=\"https://cointelegraph.com/news/sam-altman-ousted-from-open-ai-chatgpt-cto-mira-murati-named-interim-ceo\">fire CEO and cofounder Sam Altman</a>, replace him with chief technology officer Mira Murati, <a href=\"https://cointelegraph.com/news/who-is-the-new-openai-ceo-emmet-shear\">replace Murati with former Twitch boss Emmett Shear</a>, and then rehire Sam Altman to <a href=\"https://cointelegraph.com/news/open-ai-rehire-sam-altman-ceo-new-initial-board-members\">replace Shear amid a board shakeup</a>. </p><blockquote class=\"twitter-tweet\"><p lang=\"art\" dir=\"ltr\">❤️❤️ <a href=\"https://t.co/n1x47m5bTZ\">https://t.co/n1x47m5bTZ</a></p>&mdash; Sam Altman (@sama) <a href=\"https://twitter.com/sama/status/1727206691262099616?ref_src=twsrc%5Etfw\">November 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-30T14:01:27.000Z",
    "title": "Hong Kong regulator considers allowing ICOs to bolster economic revival",
    "url": "https://cryptoslate.com/hong-kong-regulator-considers-allowing-icos-to-bolster-economic-revival/",
    "description": "<p>Hong Kong, a city renowned for its dynamic financial landscape, may be toying with groundbreaking changes in its digital asset approach. In a recent letter, Mr. Chen Zhihua, President of the Hong Kong Securities and Futures Association, proposed introducing an &#8220;Initial Coin Offering (ICO) mechanism&#8221; in Hong Kong. The suggestion was one of many made [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/hong-kong-regulator-considers-allowing-icos-to-bolster-economic-revival/\">Hong Kong regulator considers allowing ICOs to bolster economic revival</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-30T14:00:53.000Z",
    "title": "Polygon Whales Go On 120 Million MATIC Buying Spree, Rally Soon?",
    "url": "https://www.newsbtc.com/matic/polygon-whales-120-million-matic-buying-rally/",
    "description": "On-chain data shows the Polygon whales have loaded up on 120 million MATIC during the past week, a sign that could be bullish for the asset&#8217;s price. Polygon Whales Have Increased Their Holdings Recently As pointed out by an analyst in a post on X, MATIC whales have made a decent amount of buys during the past week. The relevant indicator here is the &#8220;Supply Distribution,&#8221; which keeps track of the total amount of Polygon that the different holder groups are carrying in their wallets right now. In the context of the current topic, the whales are the ones of interest and their group address balance range may be defined as 10 million to 100 million MATIC (which converts to about $7.7 million to $77 million at the current exchange rate). Related Reading: Chainlink Signal Resurfaces: Is Another 31% Rally Coming? The whales are the most powerful entities on the network, because of the sheer scale of reserves they hold. As such, their movements can often be worth keeping an eye on, as they may end up having an influence on the asset&#8217;s value. Now, here is a chart that shows the trend in the Polygon Supply Distribution specifically for these humongous holders over the past month: The value of the metric seems to have gone up in recent days &#124; Source: @ali_charts on X As displayed in the above graph, the indicator&#8217;s value for the Polygon whales has registered a notable uplift during the past week. In total, these large investors have scooped up more than 120 million MATIC (approximately $92.5 million) in this window. These buys from the whales have come while the cryptocurrency&#8217;s price has been trading around its lows following a sharp pullback from just under the $1 level. Naturally, this accumulation could be a positive sign for the asset&#8217;s future, as it suggests that the whales believe the current prices are low enough to gamble more on. While this may be so, though, another signal has also been brewing for Polygon recently and this one&#8217;s not quite as optimistic. As another analyst has explained in a CryptoQuant Quicktake post, the MATIC exchange reserve has observed a considerable rise recently, as the below chart shows. Looks like the indicator has continued to rise recently &#124; Source: CryptoQuant The &#8220;exchange reserve&#8221; here is an indicator that keeps track of the total amount of Polygon that&#8217;s currently being stored in the wallets of all centralized exchanges. From the chart, it&#8217;s apparent that the metric started rising shortly after the recent rally in the asset took place, implying that investors began making net deposits. One of the main reasons why investors would transfer their coins to the exchanges is for selling purposes, so it&#8217;s likely that these deposits were coming from those looking to cash in on the profit-taking opportunity. Related Reading: Dogecoin To Double Its Price If This Barrier Breaks, Analyst Predicts This isn&#8217;t particularly egregious behavior, but the worrying fact may be that the exchange reserve has only continued to rise even after the asset has observed a significant downtrend from the top, meaning that the selling pressure isn&#8217;t slowing down. The whale accumulation is a bullish sign for Polygon, but so long as these exchange inflows continue, it&#8217;s perhaps unlikely that the price would feel any benefit in the short term. MATIC Price Polygon is currently trading above the $0.77 mark, having seen a plunge of over 21% since the top earlier in the month. MATC has been moving sideways in the last few days &#124; Source: MATICUSD on TradingView Featured image from Swanson Chan on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-30T14:00:27.000Z",
    "title": "Bitcoin 65% Crash Possible? $54 Million In Buy Orders Pile Up At $12,000",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-54-million-buy-orders/",
    "description": "Bitcoin is still trending at a reasonably high price, especially after falling below $15,000 in 2022 following the FTX collapse. Given its rise since then, investors have turned bullish, expecting the start of another bull market. However, not all investors have bought into this bullish narrative for Bitcoin and this is evidenced by the amount of buy orders sitting at prices more than 65% below its current value. 4,500 BTC Bids At $12,000 In an interesting turn of events, a developer has revealed a massive buy wall waiting in the expectation that the Bitcoin price will crash further. One X (formerly Twitter) user who goes by @tedstalksmacro took to the social media platform to reveal the massive buy wall. Related Reading: XRP Price Prediction: Analyst Identifies 3 Key Factors That Will Trigger Parabolic Move According to the post, there were 4,500 BTC bids waiting at around 65% below the current price of Bitcoin. These Bitcoin bids came out to a total of $54 million, going by the asset’s price at the time, and made up the largest buy wall at any price point for the cryptocurrency. Source: X These 4,500 BTC bids at the $12,000 mark suggest that these Bitcoin investors expect the price to keep falling. Now, if the Bitcoin price were to return to this level, it would mean an approximately 68% drop from the tight range of $37,500 to $38,000 that the price has been trading at. Another X user pointed out that the buy wall did not recently appear. Rather, the 4,500 BTC bids have been standing for more than a year. BTC struggles to hold $37,700 &#124; Source: BTCUSD on Tradingview.com Why Investors Are Expecting Bitcoin To Fall In response to Ted’s post, another X user, Luke Broyles, took to the platform to explain why there are so many bids for Bitcoin at $12,000. According to Broyles, the bids are a result of a “big unit bias level” that investors developed during the FTX crash. When the crypto exchange filed for bankruptcy in 2022 and the Bitcoin price dropped to $15,000, the calls for a decline to $12,000 had intensified. But of course, that never happened. However, not all investors have let go of the belief that this could still happen. Related Reading: The Other Side Of The Bitcoin: Analyst Highlights What Happens If Bulls Fail Broyles explains that “many people have either $10k or $25k saved up which would’ve made a nice comfy amount of coins at $12k.” Further adding that “Buying 2 coins at $12k sounded better than buying 1.5 in low teens.” The crypto enthusiast posits that the market has already moved beyond this level, although some people have yet to accept it. “Lots of people still waiting for $12k… still yet to accept market has been reversing for over a year now,” Broyles concludes. Featured image from GetBlock.net, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-30T14:07:43.000Z",
    "title": "Uniswap’s Game-Changing Move: 10 Million UNI Tokens Delegated to Engaged Voters",
    "url": "https://www.crypto-news-flash.com/uniswaps-game-changing-move-10-million-uni-tokens-delegated-to-engaged-voters/?utm_source=rss&utm_medium=rss&utm_campaign=uniswaps-game-changing-move-10-million-uni-tokens-delegated-to-engaged-voters",
    "description": "<img width=\"1201\" height=\"601\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Uniswap\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card.png 1201w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card-300x150.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card-1024x512.png 1024w\" sizes=\"(max-width: 1201px) 100vw, 1201px\" />The Uniswap DAO proactively votes on a resolution to allocate UNI tokens held by the Uniswap Foundation to delegates, aiming to boost participation rates. The proposal, evolving to select seven delegates for 10 million UNI voting rights, garners broad support with over 17 million UNI token holders expressing approval. In a proactive move to address [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-30T13:48:11.000Z",
    "title": "Revealing the Top Altcoin Trio: Solana (SOL), Ripple (XRP), Meme Moguls (MGLS) Set To Ignite 2024’s Crypto Craze",
    "url": "https://www.crypto-news-flash.com/revealing-the-top-altcoin-trio-solana-sol-ripple-xrp-meme-moguls-mgls-set-to-ignite-2024s-crypto-craze/?utm_source=rss&utm_medium=rss&utm_campaign=revealing-the-top-altcoin-trio-solana-sol-ripple-xrp-meme-moguls-mgls-set-to-ignite-2024s-crypto-craze",
    "description": "<img width=\"512\" height=\"268\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-92.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-92.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-92-300x157.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-92-351x185.png 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Certain altcoins emerge as contenders for the spotlight in the rising cryptocurrency market, promising meteoric growth and sparking major interest. As we march into 2024, three altcoins are poised to set the crypto sphere ablaze with their potential: Solana (SOL), Ripple (XRP), and Meme Moguls (MGLS). Solana (SOL): Surging Ahead The recent developments surrounding Solana [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-30T13:47:30.000Z",
    "title": "How Economic Change in China Could Propel BTC to New Prices",
    "url": "https://www.crypto-news-flash.com/how-economic-change-in-china-could-propel-btc-to-new-prices/?utm_source=rss&utm_medium=rss&utm_campaign=how-economic-change-in-china-could-propel-btc-to-new-prices",
    "description": "<img width=\"640\" height=\"426\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/kanchanara-dRgxo-ujT2U-unsplash.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Arthur-Hayes-claims-that-capital-is-about-to-flood-into-Bitcoin-(BTC)-from-China.\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/kanchanara-dRgxo-ujT2U-unsplash.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/kanchanara-dRgxo-ujT2U-unsplash-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/kanchanara-dRgxo-ujT2U-unsplash-104x69.jpg 104w\" sizes=\"(max-width: 640px) 100vw, 640px\" />Arthur Hayes foresees a possible significant flow of capital into Bitcoin from China, driven by key economic changes. Hong Kong emerges as a crucial financial bridge, and Bitcoin could be a preferred asset in this scenario. In the midst of the complex global financial network, Arthur Hayes, co-founder of BitMEX, sheds light on a potential [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-30T13:48:00.000Z",
    "title": "Unveiling the KyberSwap Exploiter: A Demand for Control",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/unveiling-the-kyberswap-exploiter-a-demand-for-control/",
    "description": "<p>This audacious move includes temporary full authority over the governance mechanism and access to sensitive company information. Also, the surrender of all assets, and a promise to transform Kyber into an entirely new project. In this article, we delve into the details of this unprecedented demand for the KyberSwap Exploiter. Also, the implications it holds [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/unveiling-the-kyberswap-exploiter-a-demand-for-control/\">Unveiling the KyberSwap Exploiter: A Demand for Control</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-30T13:40:24.000Z",
    "title": "Sei (SEI) Price Prediction 2023-2030: Will SEI Price Hit $1 Soon?",
    "url": "https://coinedition.com/sei-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Sei-(SEI)-Price-Prediction\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>What is Sei (SEI)? Built upon a layer-1 blockchain architecture using the Cosmos SDK framework, the SEI network is tailored specifically for high-frequency trading applications. The Twin Turbo Consensus enables the network to process transactions at lower transaction costs and at industry-leading throughput. The company behind the SEI network, SEI Labs announced the launch of [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/sei-price-prediction/\">Sei (SEI) Price Prediction 2023-2030: Will SEI Price Hit $1 Soon?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]