[
  {
    "source": "Decrypt",
    "date": "2023-10-18T20:26:26.000Z",
    "title": "RoboCop: Rogue City Is Like an Xbox 360 Throwback in the Best Way",
    "url": "https://decrypt.co/202227/robocop-rogue-city-preview-xbox-360-throwback-best-way",
    "description": "PREVIEW: One of the most appealing games coming this fall is based on the ‘80s RoboCop film and plays like an early-aughts shooter."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-18T20:16:42.000Z",
    "title": "Sam Bankman-Fried’s trial is telling a story of classic financial deceit",
    "url": "https://cointelegraph.com/news/sam-bankman-fried-trial-telling-story-classic-financial-deceit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/a8251ffa-e0cc-44ee-84d9-b5c5601489bb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Disgraced FTX CEO Sam Bankman-Fried wasn't the first financial kingpin to get creative with balance sheets, and he won't be the last.</p>\n                    <p><p>The courtroom drama unfolding around FTX founder and former CSam Bankman-Fried (SBF) has all the ingredients of a binge-worthy Netflix series, replete with a cast of shady characters and a plot that thickens with each passing day. Among the highlights were SBF's lofty presidential ambitions and a <a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-updates\">staggering $100-150 million bribe to Chinese official</a>s, which add a surreal twist to the narrative.</p><p>If SBF aimed to script a thrilling courtroom drama for his Netflix debut, he's nailed it. However, when it comes to establishing his innocence, the plot leaves much to be desired.</p><p>The courtroom was electrified by <a href=\"https://cointelegraph.com/magazine/caroline-ellison-speaks-on-ftx-binance-war-sec-wont-appeal-grayscale-btc-etf-hodlers-digest-oct-8-14/\">testimony from Caroline Ellison</a>, the former CEO of Alameda Research, FTX’s trading arm. It resonated with brutal honesty that's rare in such high-stake trials. It was emotional and raw, in a sincere way. One shocking revelation she shared was that the company<a href=\"https://cointelegraph.com/news/caroline-ellison-alternative-balance-sheets-alameda-exposure-ftx\"> created seven fraudulent balance sheets</a> created seven fraudulent balance sheets, laid out for SBF to cherry-pick one that would best serve his agenda.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/time-for-the-sec-to-settle-with-coinbase-ripple\"><strong><em>It’s time for the SEC to settle with Coinbase and Ripple</em></strong></a></p><p>“When I started working at Alameda, I don’t think I would have believed you if you told me I would be sending false balance sheets to our lenders, or taking customer money, but over time, it was something I became more comfortable with,” Ellison told jurors.</p><p>The jury doesn't seem to need a spoiler alert to predict the ending of this story. The overwhelming evidence points towards a guilty verdict, a risk calculus that seems to elude SBF. Which isn’t surprising given that he was ultimately responsible for calculating the odds for FTX’s risk management before it imploded.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Fun Fact from the FTX Trial: Caroline Ellison prepared seven different fake balance sheets to send to Genesis after they asked for $500M back from Alameda and asked Sam to pick his favorite version of BS a la carte to send them. Ultimately, Caroline claims they didn&#39;t even care</p>&mdash; Autism Capital  (@AutismCapital) <a href=\"https://twitter.com/AutismCapital/status/1713262986759119147?ref_src=twsrc%5Etfw\">October 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>When the gavel finally falls, it's likely to echo the verdict handed down to Theranos founder Elizabeth Holmes — though it could easily surpass her 11-year sentence. (He’s facing a combined total of more than 100 years.) And the legal rollercoaster doesn’t end here for SBF, because a second trial is due to begin in March. That trial will include <a href=\"https://cointelegraph.com/news/sbf-sam-bankman-fried-binance-media-leak\">six charges</a> beyond the seven in court today, including campaign finance violations.</p><p>Grifters are going to grift. But what are the takeaways from this riveting saga?</p><p>There's a profound lesson to be learned from the SBF trial. While cryptocurrency is hailed for its potential to redefine the financial ecosystem, the trial is showing how traditional financial deceit can infiltrate the space, casting long shadows over the revolutionary promise of blockchain technology.</p><p>As SBF awaits his fate in the courtroom, the crypto community should seize this moment to reflect, learn, and realign with the fundamental ethos of cryptocurrency. The journey of <a href=\"https://cointelegraph.com/learn/bitcoin-wallets-a-beginners-guide-to-storing-btc\">self-custody</a> may be laden with challenges, but it's a path that leads to financial autonomy and empowerment, embodying the true spirit of what cryptocurrencies are envisioned to be.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">SBF trial exhibits (much) earlier today: DOJ proves venue via emails including this one showing Bankman-Fried scheduling facetime with Bill Clinton at Clinton Initiative parallel to (corrupt) UN General Assembly week 2022 as FTX customers&#39; money was potlatched <a href=\"https://t.co/sxjwpvy9Vn\">pic.twitter.com/sxjwpvy9Vn</a></p>&mdash; Inner City Press (@innercitypress) <a href=\"https://twitter.com/innercitypress/status/1714500731565125706?ref_src=twsrc%5Etfw\">October 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As the trial unfolds and the crypto world watches with bated breath, let it serve as a catalyst for introspection and a return to basics of self-custody and decentralization.</p><p>FTX’s fall from grace wasn't a product of crypto's inherent flaws but a classic tale of financial deceit, where the crypto landscape was merely the backdrop. The fraud wasn’t unique to the crypto domain; it was the age-old narrative of unaudited balance sheets meeting fraud, a scene right out of the traditional finance playbook.</p><p>This trial isn’t just a sensational headline; it’s a stark reminder of the perils of veering away from the core principles of cryptocurrency. The ethos of crypto is rooted in the elimination of middlemen, which stands in stark contrast to the narrative SBF spun around his empire.</p><p>While the founders of bona fide crypto exchanges like Coinbase and Kraken advocate for the mantra of “not your keys, not your coins,” promoting self-custody, SBF championed the opposite, urging investors to entrust him with their digital assets — perhaps because he planned to steal them.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/michael-lewis-going-infinite-positive-spin-sam-bankman-fried\"><strong><em>Michael Lewis' new book puts a positive spin on Sam Bankman-Fried</em></strong></a></p><p>A slew of crypto investors, enticed by the mirage of convenience, relinquished the responsibility of self-custodying their assets, allowing SBF and his crew of pirates to steer the ship, much to their detriment.</p><p>The traditional banking system, with its ease and convenience, comes at a hefty price— censorship risks, fiat inflation, hidden fees, and sluggish transactions. Self custody, like freedom, isn’t easy, it’s hard. But crypto isn’t supposed to be easy. It is a revolution in finance aimed to make you more free and empowered. It's not meant to be a walk in the park; it’s a revolution aimed at empowering individuals in the financial realm.</p><p>This trial beckons a return to the basics for the crypto community. It’s high time to delve back into the writings of cypherpunk visionaries like Timothy May, Eric Hughes, and modern-day prophets like Vitalik Buterin and Nick Szabo.</p><p>Ignore the flashy ads, sidestep the crypto clickbait, and invest time in understanding the principles of hardware wallets and operational security. Dive into the ethos of the cypherpunks, grasp the essence of operational security, and ensure you're in the crypto space for the right reasons. The allure of “number go up” and the charm of charismatic founders should never eclipse the fundamental principles that form the bedrock of cryptocurrency.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>J.W. Verret</strong> is an associate professor at George Mason University’s Antonin Scalia Law School. He is a practicing crypto forensic accountant and also practices securities law at Lawrence Law LLC. He is a member of the Financial Accounting Standards Board’s Advisory Council and a former member of the SEC Investor Advisory Committee. He also leads the Crypto Freedom Lab, a think tank fighting for policy change to preserve freedom and privacy for crypto developers and users.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-18T20:30:00.000Z",
    "title": "Galaxy Digital CEO Mike Novogratz Foresees Spot Bitcoin ETF Approval in 2023",
    "url": "https://news.bitcoin.com/galaxy-digital-ceo-mike-novogratz-foresees-spot-bitcoin-etf-approval-in-2023/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/novi-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Galaxy Digital CEO Mike Novogratz Foresees Spot Bitcoin ETF Approval in 2023\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/novi-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/novi-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/novi-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/novi-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/novi-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/novi-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/novi.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Galaxy Digital CEO Mike Novogratz expects a spot bitcoin exchange-traded fund (ETF) to be approved in 2023. “It’s going to get approved, we think it happens this year,” the American investor said on Wednesday. Billionaire and Crypto Investor Mike Novogratz Say There’s Been a ‘Huge Psychological Shift’ After predicting in August, Galaxy Digital CEO Mike [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T20:17:45.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 As we venture into 2023 to 2032, the next decade promises to be a critical period for Aptos as it strives to establish itself as a significant blockchain platform. The rapidly changing market dynamics, technological advancements, and evolving adoption trends will undoubtedly shape Aptos&#8217;s path. Against this backdrop, investors and stakeholders ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-18T20:10:32.000Z",
    "title": "QCP Capital does not anticipate any Bitcoin ETF approval in Q4 2023",
    "url": "https://crypto.news/qcp-capital-does-not-anticipate-any-bitcoin-etf-approval-in-q4-2023/",
    "description": "QCP Capital's Q4 2023 forecast warns of volatility in Bitcoin and equities, citing macro factors and geopolitical tensions as key drivers while dismissing hopes for ETF approval. "
  }
]