[
  {
    "source": "CoinDesk",
    "date": "2024-03-26T15:00:32.000Z",
    "title": "A16z-Backed Protocol Unveils U.S. Dollar Stablecoin Passing Yield from RWA and DeFi",
    "url": "https://www.coindesk.com/business/2024/03/26/a16z-backed-protocol-unveils-us-dollar-stablecoin-passing-yield-from-rwa-and-defi/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Angle also aims to establish a forex hub offering seamless conversion between its dollar and euro-pegged stablecoins."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-26T15:05:04.000Z",
    "title": "Dogwifhat Outpacing Meme Coin Rivals Bonk, Pepe and Dogecoin With 20% Gains",
    "url": "https://decrypt.co/223455/dogwifhat-meme-coin-rally-bonk-pepe-dogecoin",
    "description": "WIF’s lead over fellow Solana dog-themed token BONK appears to be solidifying."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-26T15:00:51.000Z",
    "title": "Pyth Network launches price feed data on Bitcoin layer 2 Merlin Chain",
    "url": "https://cryptobriefing.com/pyth-merlin-price-feed-data-integration/",
    "description": "Pyth Network partners with Merlin to bring Pyth's real-time price feeds to Merlin Chain, enhancing dApps on Bitcoin layer 2 chain."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-26T14:52:50.000Z",
    "title": "WGC Market Strategist Explains Why Current Macro Economic Environment Favors Gold",
    "url": "https://www.cryptoglobe.com/latest/2024/03/wgc-market-strategist-explains-why-current-macro-economic-environment-favors-gold/",
    "description": "On March 25, during an interview on CNBC’s “Closing Bell: Overtime,” Joe Cavatoni, Market Strategist at the World Gold Council (WGC), discussed the current prospects for gold investment, especially in light of the commodity nearing all-time highs. The conversation, led by co-anchor Jon Fortt, delved into the reasons behind gold’s appeal to investors, the impact […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-26T15:04:22.000Z",
    "title": "Cardano Sparks Market Optimism Can ADA Target $1? Rapid Growth Projected for this AI Altcoin",
    "url": "https://cryptodaily.co.uk/2024/03/cardano-sparks-market-optimism-can-ada-target-1-rapid-growth-projected-for-this-ai-altcoin",
    "description": "In the electrifying realm of cryptocurrency, where the thrill of the next big gain is always just around the corner, Cardano (ADA)"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-26T14:52:42.000Z",
    "title": "Missed Out on dogfight (WIF) and Not Early to Solana (SOL)? NuggetRush (NUGX) is a Second Chance at Massive Gains",
    "url": "https://cryptodaily.co.uk/2024/03/missed-out-on-dogfight-wif-and-not-early-to-solana-sol-nuggetrush-nugx-is-a-second-chance-at-massive-gains",
    "description": "If you missed out on dogwifhat (WIF) and Solana’s (SOL) explosive surge from last year, here is a second shot at massive gains: NuggetRush (NUGX)."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-26T14:43:31.000Z",
    "title": "BONK Down 27%, FLOKI Down 17%, $GFOX The Perfect Bear Market Token",
    "url": "https://cryptodaily.co.uk/2024/03/bonk-down-27-floki-down-17-gfox-the-perfect-bear-market-token",
    "description": "After an explosive rally in early March, meme coins have cooled off, leading to major price declines across the market. Bonk ($BONK) and Floki ($FLOKI), which were two of the top meme coins to buy during the rally, are now facing declines of 34% and 17%"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-26T15:02:11.000Z",
    "title": "El Salvador hits 5,700 in BTC Holdings; nearly $80M in Profit",
    "url": "https://www.cryptopolitan.com/el-salvador-hits-5700/",
    "description": "El Salvador&#8217;s President Nayib Bukele recently stated on X(formerly Twitter) that the country has increased its Bitcoin holdings to 5700 BTC, amounting to about $400 million, according to current market prices. The nation&#8217;s continued commitment to cryptocurrency adoption and its vision of becoming a global leader in the space becomes more apparent each day as [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-26T14:51:32.000Z",
    "title": "Analysts predict big gains in Algotech (ALGT), while Dogecoin (DOGE) and Fantom (FTM) surge",
    "url": "https://nulltx.com/analysts-predict-big-gains-in-algotech-algt-while-dogecoin-doge-and-fantom-ftm-surge/",
    "description": "The volatile crypto market is showing a bullish trend, with these coins riding the uptrend. Dogecoin (DOGE) and Fantom (FTM) are surging on weekly charts, while investors eye Algotech&#8217;s (ALGT) presale for big gains. Massive Dogecoin (DOGE) transfer detected In a recent update, Whale Alert, the blockchain tracking service, reported [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-26T14:59:59.000Z",
    "title": "Bitcoin ETFs break outflow streak with $15.7m net inflow",
    "url": "https://crypto.news/bitcoin-etfs-outflows-inflow/",
    "description": "Bitcoin ETFs saw a total net inflow of $15.7 million on Monday, reversing a five-day streak of net outflows. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-26T15:00:28.000Z",
    "title": "Chainlink Facing Strong Rejection From Profit-Taking, Will CCIP Recharge Demand?",
    "url": "https://www.newsbtc.com/chainlink-news/chainlink-facing-strong-rejection-from-profit-taking-will-ccip-recharge-demand/",
    "description": "One analyst on X notes that Chainlink is facing a tug-of-war between bullish momentum and strong upside resistance from profit-taking traders. For bulls to add to their longs and extend the uptrend, the existing oversupply must be moped, paving the way for more gains above immediate liquidation levels.  Profit Taking Slowing Down LINK Bulls Looking at the LINK price action in the daily chart, it is clear that buyers have the upper hand. Bulls have been relentless since the token bottomed out in September 2023.  Related Reading: Triple-Digit Gains: Ondo Finance (ONDO) Explodes 138% — Should You Invest? Since then, LINK has doubled, even breaking above the psychological round number at $20. At press time, buyers are still in control, snapping back to trend despite the market-wide cool-off after Bitcoin crashed last week.  LINK is within a broader range, with clear caps at around $17.9 on the lower end and $21.7 on the upper end. After protracted expansion from September, the emergence of a ranging market could suggest that traders are exiting their positions, slowing down the uptrend. This has been confirmed by on-chain data that the analyst tagged, explaining the recent slowdown. Indeed, on-chain data suggests investors have been cashing in on the recent expansion. As a result, the excess supply needs to be absorbed by the market before LINK Bulls builds enough momentum to drive the coin to new 2024 highs above $21.8.  Chainlink CCIP Adoption To Recharge Demand? Despite the short-term headwinds, Chainlink bulls are banking on the widespread adoption of the Chainlink Cross-Chain Interoperability Protocol (CCIP) as a demand catalyst. CCIP is critical for blockchain interoperability. The solution allows secure communication between smart contracts of linked blockchains and external data sources. CCIP has been adopted by, among others, Metis, a layer-2 scaling solution for Ethereum. Circle, the issuer of USDC, a stablecoin, is also leveraging the platform to enhance interoperability. Related Reading: Hold Onto Your Seats: XRP Primed For 90% Rally, According To Top Analyst Recent data shows a surge in CCIP revenue, pointing towards increased adoption of this multichain bridging platform. As of March 26, Dune Analytics data shows that the CCIP has generated over $484,000 in revenue. This figure will likely increase as CCIP finds adoption and Chainlink integrates with even more protocols, businesses, and blockchains.  Still, the pace at which LINK breaks above March highs and registers fresh 2024 highs will also demand the performance of other coins, including Bitcoin and Ethereum. A resurgent BTC could draw more capital, lifting altcoins, including LINK, in the process. Feature image from Shutterstock, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-26T15:00:21.000Z",
    "title": "Radicle 1.0 Launches a Decentralized Code Collaboration Breakthrough",
    "url": "https://www.crypto-news-flash.com/radicle-1-0-launches-a-decentralized-code-collaboration-breakthrough/?utm_source=rss&utm_medium=rss&utm_campaign=radicle-1-0-launches-a-decentralized-code-collaboration-breakthrough",
    "description": "<img width=\"1200\" height=\"719\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-26T170621.078-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-26T170621.078-1.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-26T170621.078-1-300x180.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-26T170621.078-1-768x460.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-26T170621.078-1-150x90.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-26T170621.078-1-450x270.png 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Radicle 1.0 launched, offering decentralized code collaboration and empowering developers with autonomy and data ownership.  features like a decentralized identity and a robust gossip protocol, Radicle provides a secure alternative to centralized platforms like GitHub. Radicle, a decentralized code collaboration platform, has officially launched its much-anticipated version 1.0, aiming to transform the landscape of open-source [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-26T14:50:00.000Z",
    "title": "Cronos Upgrade: Faster Performance, Future Features Set",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/cronos-upgrade-faster-performance-future-features-set/",
    "description": "<p>This upgrade was completed seamlessly, thanks to developers and node operators&#8217; flawless execution. It introduces advancements to enhance network efficiency and pave the way for future end-user features The Cronos Upgrade Boosts Efficiency and Prepares for Future Features One of the key highlights of the Cronos Titan mainnet upgrade is the major performance improvements it [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/cronos-upgrade-faster-performance-future-features-set/\">Cronos Upgrade: Faster Performance, Future Features Set</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-26T15:00:00.000Z",
    "title": "Ethereum (ETH) Investors Absorb New SHIB Rival With ETH & Shiba Inu (SHIB) Profits",
    "url": "https://coinedition.com/ethereum-eth-investors-absorb-new-shib-rival-with-eth-shiba-inu-shib-profits/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/03/PR-2-129.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/03/PR-2-129.jpg 730w, https://coinedition.com/wp-content/uploads/2024/03/PR-2-129-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/03/PR-2-129-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/03/PR-2-129-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/03/PR-2-129-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/03/PR-2-129-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/03/PR-2-129-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/03/PR-2-129-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/03/PR-2-129-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/03/PR-2-129-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/03/PR-2-129-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/03/PR-2-129-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/03/PR-2-129-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/03/PR-2-129-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/03/PR-2-129-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/03/PR-2-129-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A recent development capturing the attention of the market is the rise of Shiba Budz (BUDZ) (BUDZ), a new entrant poised as a rival to the popular meme coin, Shiba Inu (SHIB). Notably, Ethereum (ETH) investors, bolstered by their profits from ETH and SHIB investments, are now eyeing Shiba Budz (BUDZ) as a lucrative addition [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/ethereum-eth-investors-absorb-new-shib-rival-with-eth-shiba-inu-shib-profits/\">Ethereum (ETH) Investors Absorb New SHIB Rival With ETH &amp; Shiba Inu (SHIB) Profits</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]