[
  {
    "source": "Cointelegraph",
    "date": "2024-01-17T08:30:07.000Z",
    "title": " Multiple U.S. Senate bills object to CBDC&#039;s definition as &#039;money&#039; ",
    "url": "https://cointelegraph.com/news/us-senate-bills-exclude-cbdcs-money-definition",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOThkYmUxMjAtMmE2Yy00MzJkLWI2MGMtMzdjNTY1YTBjZjZkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The filed bills create potentially significant roadblocks to its use as such in the state.</p>\n                    <p><p>Bills against referring to central bank digital currency (CBDC) as money have been filed in Utah, South Carolina, South Dakota and Tennessee. The filed bills in the different states would expressly exclude a CBDC from the definition of money in the state, creating potentially significant roadblocks to its use as such in the state.</p><p>Sen. Frank Niceley <a href=\"https://legiscan.com/TN/text/SB1764/2023\" target=\"_blank\" rel=\"noopener nofollow\">introduced</a> the bill in the Tennessee Senate on Jan. 12. <a href=\"https://law.justia.com/codes/tennessee/2010/title-47/chapter-1/part-2/47-1-201#:~:text=(24)%20%E2%80%9CMoney%E2%80%9D%20means,a%20domestic%20or%20foreign%20government.\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to the Tennessee Uniform Commercial Code (UCC), “money” is an authorized medium of exchange. However, The proposed bill would add the term “does not include any central bank digital currency” to that definition.</p><p>The UCC is a comprehensive set of standardized laws governing commercial transactions within the United States. It provides a consistent framework for business dealings and transactions across different states.</p><p><a href=\"https://cointelegraph.com/news/us-senate-bills-exclude-cbdcs-money-definition\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-17T08:15:00.000Z",
    "title": " $383B worth of crypto projects based in Switzerland and Liechtenstein: Report ",
    "url": "https://cointelegraph.com/news/383-billion-worth-crypto-projects-based-switzerland-and-lichtenstein",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNGQzM2IwNzgtMjJmNS00NTJiLWE2NWEtYTkzMzYxYmQ1MTM1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The largest of them all, the Ethereum Foundation, is headquartered in Zug, Switzerland.</p>\n                    <p><p data-ct-non-breakable=\"true\">The value of crypto projects based in Switzerland and Liechtenstein has increased by 107% year-over-year to $382.93 billion.</p><p>According to a Jan. 16 report by Swiss venture capital firm Crypto Valley (CV VC), Ethereum, through the Ethereum Foundation, is currently the highest-valued project based in the two countries, with a market cap of $273 billion. This is followed by Solana at $43.3 billion and Cardano at $20.8 billion. The increase in valuation is mainly due to momentum from the overall crypto market recovery.</p><p>Despite a market rebound for tokens, the global Web3 venture capital landscape has yet to recover. Researchers at CV VC have tallied 1,031 deals amounting to $9.8 billion in VC funding for firms in the category, representing 55% and 69% declines for the same metrics in 2022, respectively. Crypto firms in Switzerland and Liechtenstein raised $283.5 million across 49 deals in 2023, compared to $964.3 million through 93 deals in 2022.</p><p><a href=\"https://cointelegraph.com/news/383-billion-worth-crypto-projects-based-switzerland-and-lichtenstein\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-17T08:33:17.000Z",
    "title": "Grayscale Bitcoin Trust sees $1.18 billion exodus amid spot ETF popularity",
    "url": "https://cryptoslate.com/insights/grayscale-bitcoin-trust-sees-1-18-billion-exodus-amid-spot-etf-popularity/",
    "description": "<p>Quick Take According to James Butterfill, analyst at CoinShares, net outflows have reached a staggering $424 million this week as investors increasingly opt for the more cost-efficient US funds. Since the launch of spot-based ETFs, Grayscale Bitcoin Trust (GBTC) has witnessed a significant trend reversal, with outflows totaling $1.18 billion. In contrast, the newly introduced [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/grayscale-bitcoin-trust-sees-1-18-billion-exodus-amid-spot-etf-popularity/\">Grayscale Bitcoin Trust sees $1.18 billion exodus amid spot ETF popularity</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-17T08:09:56.000Z",
    "title": "AI Adoption and Its Disproportionate Effect on Marginalized Communities",
    "url": "https://www.cryptopolitan.com/ai-adoption-effect-marginalized-communities/",
    "description": "In a rapidly advancing technological landscape, the integration of artificial intelligence (AI) stands at the forefront of societal transformation. However, a recent government report prepared by Ansh Bhatnagar and Devyani Gajjar highlights the potential ramifications of this swift AI adoption. The report underscores the likelihood of disproportionate impacts on women and disadvantaged communities, specifically in [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-17T08:20:08.000Z",
    "title": "Bitcoin ETFs surpass triple the combined daily volume of 500 ETFs launched in 2023",
    "url": "https://crypto.news/bitcoin-etfs-surpass-triple-the-combined-daily-volume-of-500-etfs-launched-in-2023/",
    "description": "On Jan. 16, the total volume generated by 10 spot Bitcoin ETFs surpassed the cumulative volume of all 500 ETFs launched in 2023, exceeding it by more than three times. As per data from Yahoo Finance, the 10 newly approved&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-17T08:18:18.000Z",
    "title": "Bitcoin Backs Down: Ethereum Steals The Spotlight With Surge In Market Dominance",
    "url": "https://www.newsbtc.com/news/bitcoin-backs-down-ethereum-steals-the-spotlight-with-surge-in-market-dominance/",
    "description": "Amidst the lull in the realm of Bitcoin, Ethereum emerges as a trailblazer, confidently charting its course. While the crypto king takes a breather following its ETF approval, Ethereum, undeterred, is experiencing a surge in both price and dominance, propelled by an influx of new users and the prevailing trend of self-custody. Recent data from Santiment vividly illustrates Ethereum&#8217;s ascendancy. The platform&#8217;s price dominance, reflecting its market share in comparison to all other cryptocurrencies, has witnessed a remarkable surge of 22.4% within a mere week. Ethereum&#8217;s Remarkable Surge: Growing Community, Strong On-Chain This surge is not merely a passive spectacle; Ethereum is actively attracting an astonishing 89,400 new addresses on a daily basis, with an unprecedented 96,300 joining the Ethereum community in a single day. Related Reading: Stablecoin Takeover? Record Tether 71% Dominance Raises Questions About Crypto Future Source: Santiment This momentum is not solely about acquiring new participants; it&#8217;s about retention. Ethereum&#8217;s exchange supply, representing the quantity readily available for sale, is approaching its historical low of 8.05%. This shift signals a notable move towards self-custody and staking, mitigating the immediate risk of a substantial selloff and fortifying Ethereum&#8217;s price floor. The on-chain strength witnessed translates into tangible market action. Following a brief dip that tested the $2,500 support, Ethereum not only stabilized but turned this once-resilient level into a launchpad. Ethereum currently trading at $2,556 on the daily chart: TradingView.com Analysts are now setting their sights on the $2,700 barrier as the gateway to unlocking a potential price surge, with FOMO (fear of missing out) traders anticipated to join the rally. Beyond this juncture, the horizon appears boundless, with $3,400 emerging as an enticing target. Caution Amid Excitement: Ethereum&#8217;s Unpredictable Trajectory Yet, amid the excitement, an air of caution permeates the volatile crypto landscape. A breach below the &#8220;hammer&#8221; formation that materialized on Monday holds the potential to send Ethereum plummeting towards the 20-Day EMA (exponential moving average) at approximately $2,300. Traders are poised on tenterhooks, meticulously monitoring these crucial levels to decipher the forthcoming trajectory of Ethereum&#8217;s journey. Related Reading: Ethereum Classic Maintains 32% Steady Rise – What’s Driving ETC Up? One undeniable truth emerges: Ethereum is casting off the shadow of Bitcoin and carving out its unique path. With an increasing dominance, a fervent user base, and a focus on self-custody, Ethereum is laying the groundwork for future expansion. Whether it attains the envisioned $3,400 pinnacle or steers towards an alternate destiny, one certainty prevails—Ethereum is an influential force, and its narrative is only in its nascent stages. History repeating itself.#Bitcoin dominance peaking before the halving and potentially marking a cycle top. Altcoins are likely to outperform coming period. pic.twitter.com/ox36x2M5NG — Michaël van de Poppe (@CryptoMichNL) January 15, 2024 Meanwhile, in order to bolster Ethereum&#8217;s increasing dominance over Bitcoin, Michaël van de Poppe, the founder and CEO of trading company MNTrading, observed that Bitcoin was falling behind Ethereum in terms of the total market capitalization of cryptocurrencies. In a post on X dated January 12, he included the following graphic with the caption, &#8220;#Bitcoin dominance peaking before the halving and maybe signifying a cycle top.&#8221; It&#8217;s conceivable that altcoins will perform better in the near future. Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-17T08:36:25.000Z",
    "title": "Uniswap’s UNI Token Gains Momentum, 15% Price Surge on the Horizon",
    "url": "https://www.crypto-news-flash.com/uniswaps-uni-token-gains-momentum-15-price-surge-on-the-horizon/?utm_source=rss&utm_medium=rss&utm_campaign=uniswaps-uni-token-gains-momentum-15-price-surge-on-the-horizon",
    "description": "<img width=\"1800\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Uniswap-UNI-logo-with-background-of-price-trading-charts.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Uniswap-UNI-logo-with-background-of-price-trading-charts\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Uniswap-UNI-logo-with-background-of-price-trading-charts.jpg 1800w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Uniswap-UNI-logo-with-background-of-price-trading-charts-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Uniswap-UNI-logo-with-background-of-price-trading-charts-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Uniswap-UNI-logo-with-background-of-price-trading-charts-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Uniswap-UNI-logo-with-background-of-price-trading-charts-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Uniswap-UNI-logo-with-background-of-price-trading-charts-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Uniswap-UNI-logo-with-background-of-price-trading-charts-450x300.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Uniswap-UNI-logo-with-background-of-price-trading-charts-1200x800.jpg 1200w\" sizes=\"(max-width: 1800px) 100vw, 1800px\" />UNI token rises above $6.50, aiming for $8.00; bullish momentum expected if it clears the $7.25 resistance. Reaching $100 for UNI token poses a challenge despite previous growth; market conditions and factors influence the timeline. Uniswap&#8217;s native cryptocurrency, UNI, has recently been on a notable upward trajectory, surpassing the $6.00 and $6.20 resistance levels. Currently, [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-17T08:12:34.000Z",
    "title": "A Guide to CARV’s $SOUL Airdrop Campaign",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/a-guide-to-carvs-soul-airdrop-campaign/",
    "description": "<p>Today, we&#8217;re participating in CARV&#8217;s new $SOUL airdrop campaign. Let&#8217;s dive into the details below! Preliminary Information Users: Only for Intermediate Users and Above. Funds Required: About 0.04 $BNB (USD$12.60/- nowadays) is needed for minting the CARV ID and bridging from the BNB chain to OpBNB. Time Required: About 2 hours to qualify for daily [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/a-guide-to-carvs-soul-airdrop-campaign/\">A Guide to CARV&#8217;s $SOUL Airdrop Campaign</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-17T08:24:00.000Z",
    "title": "Stablecoin Saga and Beyond: Circle’s CEO on Crypto Landscape and Tether’s Validation",
    "url": "https://coinedition.com/circle-ceo-discusses-stablecoins-amid-tethers-assets-validation/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Technology-Didnt-Commit-Fraud-Says-Circle-CEO-Jeremy-Allaire.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Circle CEO Discusses Stablecoins Amid Tether’s Assets Validation\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Technology-Didnt-Commit-Fraud-Says-Circle-CEO-Jeremy-Allaire.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Technology-Didnt-Commit-Fraud-Says-Circle-CEO-Jeremy-Allaire-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Technology-Didnt-Commit-Fraud-Says-Circle-CEO-Jeremy-Allaire-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Technology-Didnt-Commit-Fraud-Says-Circle-CEO-Jeremy-Allaire-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Technology-Didnt-Commit-Fraud-Says-Circle-CEO-Jeremy-Allaire-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Technology-Didnt-Commit-Fraud-Says-Circle-CEO-Jeremy-Allaire-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent interview with Bloomberg, Circle CEO Jeremy Allaire discussed the evolution of the cryptocurrency industry, the significance of institutional involvement, and the role of stablecoins within the market.   Allaire emphasized that the initial vision behind cryptocurrency was to integrate traditional financial systems with blockchain technology. This integration aimed to revolutionize how money flows [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/circle-ceo-discusses-stablecoins-amid-tethers-assets-validation/\">Stablecoin Saga and Beyond: Circle&#8217;s CEO on Crypto Landscape and Tether’s Validation</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]