[
  {
    "source": "CryptoSlate",
    "date": "2023-05-30T23:17:10.000Z",
    "title": "Coinbase CEO considers China’s digital payments industry an ‘ambitious adversary’",
    "url": "https://cryptoslate.com/coinbase-ceo-considers-chinas-digital-payments-industry-an-ambitious-adversary/",
    "description": "<p>Coinbase CEO Brian Armstrong said in a May 30 op-ed on MarketWatch that the U.S. crypto industry faces a strong challenge from China&#8217;s digital payments industry. Armstrong opined that the U.S. faces an &#8220;ambitious adversary&#8221; in the form of China&#8217;s digital payment industry. He said: &#8220;Two Chinese tech behemoths, Alipay and Tencent, offer integrated payment systems [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/coinbase-ceo-considers-chinas-digital-payments-industry-an-ambitious-adversary/\">Coinbase CEO considers China&#8217;s digital payments industry an &#8216;ambitious adversary&#8217;</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-30T23:30:26.000Z",
    "title": "US Government Presses for Independent Examiner in FTX Bankruptcy Case",
    "url": "https://news.bitcoin.com/us-government-presses-for-independent-examiner-in-ftx-bankruptcy-case/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/sammas-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"US Government Presses for Independent Examiner in FTX Bankruptcy Case\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/sammas-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/sammas-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/sammas-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/sammas-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/sammas-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/sammas-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/sammas.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Following the U.S. bankruptcy court judge&#8217;s rejection of the U.S. Trustee&#8217;s plea to designate an impartial investigator for the FTX bankruptcy case, the government is now appealing this verdict. In essence, the U.S. Trustee&#8217;s appeal has been forwarded to the U.S. Third Circuit Court of Appeals, and chief judge Colm F. Connolly acknowledged that he [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-30T23:30:45.000Z",
    "title": "Raydium Prices Shot 30% 2 Weeks Ago Before Plunging, What Happened?",
    "url": "https://www.newsbtc.com/news/defi/raydium-prices-shot-30-2-weeks-ago-before-plunging-what-happened/",
    "description": "RAY, the native governance token of Raydium, the automated market maker (AMM) decentralized exchange (DEX) on Solana, soared 30% on May 17 before reversing gains, plunging to spot rates.  RAY Prices Under Pressure According to CoinMarketCap data on May 30, RAY is changing hands at $0.19, stable against the USD, Bitcoin, and Ethereum on the last trading day.  RAY has a market capitalization of $41.2 million at this rate, with an average trading volume of $2 million in the past 24 hours.  At this pace, RAY remains in a bearish formation as bears peeled back gains posted on May 17, aligning the token with bears from mid-February 2023.  Related Reading: Can This THORChain New Feature Push Back RUNE Bears? Like Solana and tokens based on this network, RAY&#8217;s bearish price action has persisted and hasn&#8217;t reversed losses from mid-November 2022.  The collapse of FTX, a crypto exchange, and Alameda Research, the investment wing of FTX, which was heavily invested in Solana, triggered a sharp sell-off of SOL, weighing negatively on RAY and other ecosystems. Raydium Updates The sharp expansion of RAY prices on May 17 coincided with the upgrade of the Raydium DEX to version V.2.10.11.  According to the development team, the decision was reached following a server load due to API abuse. Specifically, there was a nearly 3X jump in API pings in April than in March 2023. The extra load stressed Raydium&#8217;s servers, disrupting the connection. The team behind the project stated: Raydium&#8217;s APIs were pinged more than 50 billion times in April, up from 18 billion in March. May figures are set to surpass April highs. This highlights how much stress servers have been under and why issues have popped up. Nearly 2,000 new pools were created in the first two weeks of May, bringing Raydium&#8217;s total pool count to nearly 8,000. This update, V.2.10.11, served to correct this issue. Besides increasing the server capacity by 11X, there were several bug fixes that the exchange expects to &#8220;greatly improve user interface responsiveness.&#8221; While the update was received enthusiastically, momentum has waned, and RAY is trading near May 2023 lows. Trackers show that Raydium&#8217;s total value locked (TVL) is around $30 million as of May 30, down from $2.2 billion recorded in mid-November 2021. Meanwhile, there has been a noticeable drop in the number of unique active wallets (UAW) from early May 2023, according to DappRadar.  Related Reading: Rare Crypto Signal Emerges That Could Spark Another 2017-Style Boom The contraction in the number of users coincides with the closure of the RAY Claim Portal on May 14. This portal was opened following the hack in December 2022, when the DEX lost over $2 million. The hacker drained user funds from various Raydium liquidity pools without burning or owning any liquidity pool (LP) tokens. Feature Image From Canva, Chart From TradingView"
  }
]