[
  {
    "source": "Cointelegraph",
    "date": "2023-11-23T22:41:42.000Z",
    "title": "Ethereum (ETH) price reclaims $2K as data shows a surge in network activity",
    "url": "http://cointelegraph.com/news/ethereum-eth-price-reclaims-2k-as-data-shows-a-surge-in-network-activity",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/0689584b-d6aa-4b4e-9a09-23d9550f8b78.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Despite regulatory action against Binance, a surge in Ethereum network activity and the expectation of a spot ETF approval fueled a price move above $2,000. </p>\n                    <p><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) price is trading slightly higher on Nov. 23, maintaining support above the $2,000 level after briefly retesting $1,930 on Nov. 21. Over the past week, Ether's price has increased by 2.5%, while the total market capitalization has grown by 0.5%. This uptrend can be attributed to improved decentralized applications (DApps) metrics, increased protocol fees, and Ethereum's dominance in the non-fungible token (NFT) market.</p><p>To assess whether Ether can sustain its $2,000 price point, one must consider the repercussions of Binance's recent regulatory challenges following its <a href=\"https://cointelegraph.com/news/cz-a-flight-risk-should-stay-in-us-doj\">plea deal with the U.S. Department of Justice</a> (DoJ).</p><h2>Investor fear drops as Ethereum network conditions improve</h2><p>Binance leads in Ether spot trading volume, accounting for 30% of ETH futures contracts' open interest. The closure of Binance's $2.35 billion worth of ETH derivatives contracts within a short period could have significant consequences. Despite initial analyses showing minimal changes in spreads and liquidity, Binance witnessed net outflows of $1.53 billion between Nov. 21 and Nov. 23, as reported by DefiLlama.</p><p>The regulatory landscape presents risks and opportunities. Some view Binance's actions as evidence of sufficient reserves, while others are concerned about the $4.3 billion fine facing Binance and its former CEO, Changpeng \"CZ\" Zhao. Notably, Bitcoin advocate Luke Broyles advised followers to withdraw their coins from exchanges.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Anyone that claims to know which snowflake will cause the avalanche is naieve.<br><br>However... The <a href=\"https://twitter.com/hashtag/Binance?src=hash&amp;ref_src=twsrc%5Etfw\">#Binance</a> $4.3 BILLION fine is a really big snowflake atop a really big pile of snow.<br><br>Act accordingly.<br>Self custody now.<a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a></p>&mdash; Luke Broyles (@luke_broyles) <a href=\"https://twitter.com/luke_broyles/status/1727525539567571360?ref_src=twsrc%5Etfw\">November 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Even if Binance continues operations and safeguards all client assets, the long-term effects of full compliance and increased scrutiny remain uncertain. Additionally, the relationship between Binance and stablecoin issuers like Tether (USDT), TrueUSD (TUSD) and Binance USD (BUSD) raises further questions.</p><p>Government agencies gaining access to previously undisclosed money laundering and terrorist financing operations through Binance, including fiat payment gateways and banking partners, increases the likelihood of regulatory actions against stablecoin providers. This news has been particularly detrimental to Ethereum, given Binance's status as the third-largest ETH staker, with $1.24 billion in deposits according to DefiLlama.</p><p>However, recent regulatory developments also offer some positives. Binance's move towards full compliance reduces the risk associated with unregulated exchanges, making it more likely for the U.S. Securities and Exchange Commission (SEC) to <a href=\"https://cointelegraph.com/news/is-binance-settlement-greenlight-to-spot-bitcoin-etf\">approve spot exchange-traded fund (ETF) instruments</a> for cryptocurrencies. Leading industry mutual fund managers, such as BlackRock and Fidelity, have recently expressed interest in launching Ether spot-based ETFs.</p><p>Furthermore, the <a href=\"https://cointelegraph.com/news/sec-sues-kraken-for-securities-laws-violations\">SEC's lawsuit against Kraken</a> on Nov. 20, which lists 16 cryptocurrencies as securities, excludes Ether (ETH). This omission reduces the likelihood of regulatory actions against the Ethereum Foundation and entities involved in the 2015 ICO, providing a silver lining amidst regulatory uncertainties.</p><h2>Ethereum network health and NFT markets surge </h2><p>Assessing the Ethereum network's health, Ethereum DApps achieved a total value locked (TVL) of $26 billion on Nov. 23, representing a 5% increase from the previous week, according to DappRadar. However, a hack significantly impacted dYdX, resulting in a 16% decline in the protocol's deposits.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/fb8426a6-0a0d-419e-aa79-15af399bdacb.png\"  /><figcaption style=\"text-align: center;\"><em>Top blockchains by active addresses and DeFi TVL. Source: DappRadar</em></figcaption></figure><p>While Ether's market capitalization of $248 billion trails behind Bitcoin's $728 billion, the two networks generate similar protocol revenues. Over the past seven days, the Bitcoin network collected $57.5 million in fees, compared to Ethereum's $54.3 million. These figures do not include ecosystem fees from platforms like Lido, Uniswap, or Maker protocols.</p><p>Ethereum also reclaimed its leadership position in NFT sales, recording $12.6 million in transactions within 24 hours. Despite a brief period where Bitcoin led in NFT activity, Ethereum remains the preferred blockchain for prominent NFT projects.</p><p>The positive performance from Ethereum on Nov. 23 can be attributed to improved on-chain metrics, growing expectations of spot ETF approval and reduced regulatory concerns stemming from the 2015 ICO.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-23T22:50:27.000Z",
    "title": "Will BRICS currency be backed by crypto or gold?",
    "url": "https://www.cryptopolitan.com/will-brics-currency-be-backed-by-crypto-gold/",
    "description": "As the BRICS nations continue to strengthen their economic alliance, there&#8217;s growing anticipation around the possible introduction of a BRICS currency at the 2024 annual summit. With the alliance&#8217;s expansion to include six more countries this year, speculation is rife about whether the new currency will be a digital asset or a gold-backed alternative, signaling ... <a title=\"Will BRICS currency be backed by crypto or gold?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/will-brics-currency-be-backed-by-crypto-gold/\" aria-label=\"More on Will BRICS currency be backed by crypto or gold?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-23T22:44:13.000Z",
    "title": "Crypto Recap: Today’s top stories and events",
    "url": "https://www.cryptopolitan.com/crypto-recap-todays-top-stories-and-events/",
    "description": "In today&#8217;s fast-paced world of cryptocurrency, significant events continue to unfold, impacting the landscape of digital finance. From the sophisticated $46 million KyberSwap hack to regulatory developments in Europe and legal challenges facing former Binance CEO Changpeng Zhao, the crypto industry remains a hotbed of activity and intrigue. KyberSwap Heist: An Ingenious Exploit The crypto ... <a title=\"Crypto Recap: Today&#8217;s top stories and events\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-recap-todays-top-stories-and-events/\" aria-label=\"More on Crypto Recap: Today&#8217;s top stories and events\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-23T23:02:02.000Z",
    "title": "Nearly $6.5b in Bitcoin and Ethereum options are set to expire",
    "url": "https://crypto.news/nearly-6-5b-in-bitcoin-and-ethereum-options-are-set-to-expire/",
    "description": "Over $6.51 billion in Bitcoin and Ethereum options are due to expire on Nov. 24, potentially indicating heightened trading activity. A  vast number of Bitcoin (BTC) and Ethereum (ETH) options are set to expire on Nov. 24, potentially influencing market&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-23T22:54:15.000Z",
    "title": "Sam Bankman-Fried swaps Bitcoin for mackerel in prison",
    "url": "https://crypto.news/sam-bankman-fried-swaps-bitcoin-for-mackerel-in-prison/",
    "description": "The FTX founder participates in ‘prisonomics’ at a Brooklyn detention center where demand for mackerel pouches outshines interest in Bitcoin and crypto. Convicted FTX founder Sam Bankman-Fried has battered seafood delicacies with fellow inmates during his time at the Brooklyn&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-23T22:45:52.000Z",
    "title": "GROK token surges 16% ahead of Elon Musk’s Grok AI launch",
    "url": "https://crypto.news/grok-token-surges-16-ahead-of-elon-musks-grok-ai-launch/",
    "description": "A particular Grok token saw price gains likely due to news around the public release of an AI chatbot backed by Elon Musk and his social network X, formerly Twitter. The price of GROK, one of several tokens inspired by&#8230;"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-23T23:01:41.000Z",
    "title": "Kyber Network Crystal Dips As KyberSwap DeFi Platform Drained $46,500,000 in Ethereum, Arbitrum and Other Assets",
    "url": "https://dailyhodl.com/2023/11/23/kyber-network-crystal-dips-as-kyberswap-defi-platform-drained-46500000-in-ethereum-arbitrum-and-other-assets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/north-have-stolen-assets.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/north-have-stolen-assets.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/north-have-stolen-assets.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/north-have-stolen-assets.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/north-have-stolen-assets.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/north-have-stolen-assets.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/north-have-stolen-assets.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Decentralized finance (DeFi) platform KyberSwap has been hacked to the tune of tens of millions of dollars worth of virtual currencies, causing its native asset to dip. Data from blockchain tracker Lookonchain reveals that $46.5 million worth of digital assets were stolen from KyberSwap, including $20.78 million worth of Wrapped Ethereum (wETH), $9.53 million worth [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/23/kyber-network-crystal-dips-as-kyberswap-defi-platform-drained-46500000-in-ethereum-arbitrum-and-other-assets/\">Kyber Network Crystal Dips As KyberSwap DeFi Platform Drained $46,500,000 in Ethereum, Arbitrum and Other Assets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]