[
  {
    "source": "Cointelegraph",
    "date": "2023-11-13T05:57:07.000Z",
    "title": "What happened in crypto this weekend?",
    "url": "http://cointelegraph.com/news/what-happened-in-crypto-on-the-weekend",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/49ce4f13-5053-4197-842f-530122a6b860.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A Bitcoin dev unveiled a decentralized file hosting service for the blockchain, while $27 million was stolen from a Binance-linked hot wallet.</p>\n                    <p><h3>Bitcoin gets a decentralized file-hosting service</h3><p>A Bitcoin developer has introduced a new decentralized file hosting solution that offers an alternative fee model to existing solutions that have run into “computational overhead” issues.</p><p>On Nov. 12, Robin Linus — a developer at Bitcoin zero-knowledge proofs creator ZeroSync — <a href=\"https://robinlinus.com/bitstream.pdf\" target=\"_blank\" rel=\"noopener nofollow\">published</a> the “BitStream: Decentralized File Hosting Incentivised via Bitcoin Payments” white paper.</p><p>Linus explained that Bitcoin-based atomic swaps for files would enable the open market for content hosting in which anyone can “monetize their excess bandwidth and data storage capacities.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">BitStream: Decentralized File Hosting Incentiviced via Bitcoin Payments<a href=\"https://t.co/cdVIqcC5Ec\">https://t.co/cdVIqcC5Ec</a> <a href=\"https://t.co/rdVALgynTx\">pic.twitter.com/rdVALgynTx</a></p>&mdash;  яobin linus (@robin_linus) <a href=\"https://twitter.com/robin_linus/status/1723343871067804060?ref_src=twsrc%5Etfw\">November 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Decentralized file hosting networks are alternatives to centralized solutions like Google Cloud, Microsoft OneDrive and Dropbox. It typically involves splicing data into tiny pieces and storing it on nodes linked to a subset of computers or nodes.</p><p>BitStream is looking to offer a better revenue model than existing solutions with a decentralized structure, Linus said.</p><p>He pointed out a flaw in the file hosting service used by the decentralized social media platform Nostr, claiming that its fee model burdens the network.</p><blockquote>“Users are paying to upload their data, so servers are not paid per download. If a server fulfills too many download requests from various users, then the server can become overwhelmed from the bandwidth costs outweighing their earnings.”</blockquote><p>Linus argues that a pay-to-download approach will instead enable a server’s revenue to scale while the social media platform grows which he claimed would create a “balanced and profitable ecosystem.”</p><p>Compatible payment systems like the Lightning Network, Ecash, and other systems that support hash-timelock contracts will be able to implement BitStream, Linus noted.</p><p>Last month, <a href=\"https://cointelegraph.com/news/bitcoin-bitvm-goal-is-scaling-not-ethereum-defi-altcoins-supertestnet\">Linus also launched BitVM,</a> a Bitcoin-based virtual machine that aims to scale Bitcoin. </p><h3>$27M in stablecoins drained in alleged hack</h3><p>A cryptocurrency wallet tied to Binance allegedly lost $27 million in Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) on Nov. 11, <a href=\"https://x.com/zachxbt/status/1723757797316133240\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to on-chain analyst ZachXBT.</p><p>The crypto sleuth isn’t sure if it was a planned hack but noted the recipient wasted no time transferring USDT to Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) and then transferring to noncustodial exchanges like FixedFloat and ChangeNow before bridging the funds to Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) via THORChain. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">It appears someone had 27M USDT stolen yesterday.<br><br>0x0f2183c8e415e61b4ad7774bf1097019eb2d5b85798a2a229070495131d60321<br><br>USDT was quickly swapped for ETH,  then transferred to a number of services (FixedFloat, ChangeNow, etc), and bridged to Bitcoin via THORChain. <a href=\"https://t.co/SgEBwyZZSc\">pic.twitter.com/SgEBwyZZSc</a></p>&mdash; ZachXBT (@zachxbt) <a href=\"https://twitter.com/zachxbt/status/1723757797316133240?ref_src=twsrc%5Etfw\">November 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The recipient transferred $2.7 million to 10 new addresses within eight minutes of the alleged exploit, <a href=\"https://etherscan.io/token/0xdac17f958d2ee523a2206206994597c13d831ec7?a=0x03c401124dc8f1d04722eb00d4d925bd7d9f37e3\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to Etherscan. The first transfer was made in less than two minutes.</p><p>ZachXBT noted the alleged victim’s address is linked to the Binance deployer.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Update: The victims address is  connected to the Binance deployer <a href=\"https://t.co/6jr6vcjqac\">pic.twitter.com/6jr6vcjqac</a></p>&mdash; ZachXBT (@zachxbt) <a href=\"https://twitter.com/zachxbt/status/1723766453273293224?ref_src=twsrc%5Etfw\">November 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Etherscan <a href=\"https://etherscan.io/tx/0x019f63f29790b56f58134deac3a271e6b6ec16f31c21861cdefe33b9cc0e7904\" target=\"_blank\" rel=\"noopener nofollow\">data</a> also shows the alleged victim received $26 million from “Binance 16” — one of Binance’s hot wallets — on Nov. 5.</p><p>Onlookers such as X (Twitter) user “Cashyol” <a href=\"https://x.com/cashyolx/status/1723786339391279369\" target=\"_blank\" rel=\"noopener nofollow\">pondered</a> if a Binance team member was hacked or if Binance’s systems were compromised. </p><p>Others noted the alleged victim put themselves in a vulnerable position by storing $27 million worth of USDT in a hot wallet.</p><p>“When will people learn??? $27M in a hot wallet??? This is crazy,” <a href=\"https://x.com/Smartecio/status/1723795046921613634\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> “SmartecVitalik,” a representative for Ethereum layer 2 scaling solution Starknet.</p><h3>Ransomware attack forces bank to use USBs for trading </h3><p>The Industrial and Commercial Bank of China (ICBC) suffered a ransomware attack on Nov. 9 which prevented it from clearing swathes of United States Treasury trades in its typical fashion, instead forcing it to use USBs.</p><p>The operational change was part of an effort to limit the damage done by cybercrime organization Lockbit, Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2023-11-10/world-s-biggest-bank-forced-to-trade-via-usb-stick-after-hack\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> on Nov. 11. Lockbit confirmed it was the perpetrator behind the ICBC attack, <a href=\"https://www.reuters.com/technology/lockbit-cybercrime-gang-claims-hack-chinas-biggest-lender-icbc-2023-11-10/\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to Reuters.</p><p>“Yes we confirm,” a Lockbit representative said when asked if it breached ICBC’s systems.</p><p>The incident impacted ICBC’s United States unit, according to Bloomberg. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">CyberCX&#39;s Alastair <a href=\"https://twitter.com/macgibbon?ref_src=twsrc%5Etfw\">@MacGibbon</a> spoke with <a href=\"https://twitter.com/Bloomberg?ref_src=twsrc%5Etfw\">@Bloomberg</a> to discuss the <a href=\"https://twitter.com/hashtag/ransomware?src=hash&amp;ref_src=twsrc%5Etfw\">#ransomware</a> attack against Industrial and Commercial Bank of China (ICBC) and share his insights on LockBit, the organisation suspected to be behind the attack.<br><br>Watch the full interview: <a href=\"https://t.co/pHcROqxgDi\">https://t.co/pHcROqxgDi</a> <a href=\"https://t.co/u0iRObLXFH\">pic.twitter.com/u0iRObLXFH</a></p>&mdash; CyberCX (@CyberCX) <a href=\"https://twitter.com/CyberCX/status/1723476950327394427?ref_src=twsrc%5Etfw\">November 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Ransomware groups like Lockbit continue to instill fear in many large banks worldwide, said Marcus Murray, the founder of Swedish cybersecurity firm Truesec.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-needs-ethereum-evm-botanix-founder\"><strong><em>Bitcoin needs Ethereum VM to reach its full potential — Web3 exec </em></strong></a></p><p>“This is a true shock to large banks around the world,” Murray added.</p><blockquote>“The ICBC hack will make large banks around the globe race to improve their defenses, starting today.”</blockquote><p>ICBC said it has been improving its cybersecurity practices over the last few months to combat ransomware attacks.</p><p>Blockchain analytics firm Chainalysis said <a href=\"https://cointelegraph.com/news/crypto-scams-down-but-one-exploit-is-making-comeback-chainalysis\">$449 million was paid to ransom attackers</a> over the first six months of 2023, up 62.4% from the same timeframe in 2022.</p><h3>Other news</h3><p>MicroStrategy co-founder Michael Saylor thinks Bitcoin demand could grow up to <a href=\"https://cointelegraph.com/news/demand-for-bitcoin-grow-by-10-x-michael-saylor\">10 times by the end of 2024.</a> He claimed the Bitcoin halving would play a big role in its price surge and described the next 12 months as Bitcoin’s “coming out party” as it heads out into the real world. </p><p>BlackRock argued the U.S. Securities and Exchange Commission doesn’t have<a href=\"https://cointelegraph.com/news/blackrock-argues-sec-has-no-grounds-to-treat-crypto-futures-and-spot-etfs-differently\"> any legitimate reason</a> to treat spot-crypto and crypto-futures exchange-traded fund applications differently. The $9 trillion asset manager made its point in its Nov. 9 19b-4 application for a spot Ether ETF called the “iShares Ethereum Trust.”</p><p><strong><em>Magazine:</em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em> </em></strong><strong>Crypto regulation — Does SEC Chair Gary Gensler have the final say?</strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-11-13T05:59:19.000Z",
    "title": "XRP price to maintain bullish momentum, analyst predicts",
    "url": "https://crypto.news/ripple-xrp-continues-bullish-momentum-analyst-predicts/",
    "description": "In less than a month, XRP has risen by over 37%. Analysts are now predicting further increases for the asset in the near term, buoyed by positive developments, including its legal victory against the U.S. SEC."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-13T05:53:32.000Z",
    "title": "SOL Price Uptrend To Continue? Can Bulls Send Solana To $75?",
    "url": "https://www.newsbtc.com/analysis/sol-price-uptrend-continue-75/",
    "description": "Solana rallied above the $50 resistance against the US Dollar. SOL price is consolidating gains above $55 and might extend its rally above $65. SOL price started a major rally above the $50 resistance against the US Dollar. The price is now trading above $55 and the 100 simple moving average (4 hours). There is a key contracting triangle forming with support near $51.00 on the 4-hour chart of the SOL/USD pair (data source from Kraken). The pair could restart its rally if it clears the $60.00 resistance zone. Solana Price Sets Up For $75 In the past few days, Solana saw a major rally above the $40 level. SOL gained bullish momentum and cleared many hurdles near the $50, outperforming Bitcoin and Ethereum. It even surged above the $55 and $60 levels. A new multi-week high was formed near $63.99 before the price started a minor downside correction. There was a move below the $60 level. The price declined below the 23.6% Fib retracement level of the upward move from the $38.05 swing low to the $63.99 high. SOL is now trading above $55 and the 100 simple moving average (4 hours). There is also a key contracting triangle forming with support near $51.00 on the 4-hour chart of the SOL/USD pair. Source: SOLUSD on TradingView.com On the upside, immediate resistance is near the $60.00 level. The first major resistance is near the $65.00 level. A successful close above the $65.00 resistance could set the pace for a larger increase. The next key resistance is near $70.00. Any more gains might send the price toward the $75.00 level. Are Dips Limited in SOL? If SOL fails to recover above the $60.00 resistance, it could start a downside correction. Initial support on the downside is near the $55.00 level. The first major support is near the $51.00 level, the trend line zone, and the 50% Fib retracement level of the upward move from the $38.05 swing low to the $63.99 high. If there is a close below the $51.00 support, the price could decline toward the $45.00 support in the near term. Technical Indicators 4-Hours MACD – The MACD for SOL/USD is gaining pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for SOL/USD is above the 50 level. Major Support Levels – $55.00, and $51.00. Major Resistance Levels – $60.00, $65.00, and $75.00."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-13T06:01:59.000Z",
    "title": "Ripple Prepares to Fight for XRP Before Supreme Court as Brad Garlinghouse Aims for XRP to Become the Next Bitcoin",
    "url": "https://www.crypto-news-flash.com/ripple-prepares-to-fight-for-xrp-before-supreme-court-as-brad-garlinghouse-aims-for-xrp-to-become-the-next-bitcoin/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-prepares-to-fight-for-xrp-before-supreme-court-as-brad-garlinghouse-aims-for-xrp-to-become-the-next-bitcoin",
    "description": "<img width=\"680\" height=\"383\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/F-vyNnvWwAAsJnN.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/F-vyNnvWwAAsJnN.jpg 680w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/F-vyNnvWwAAsJnN-300x169.jpg 300w\" sizes=\"(max-width: 680px) 100vw, 680px\" />Ripple CEO Brad Garlinghouse expresses willingness to take legal battle with SEC to the Supreme Court. Ripple has already spent over $150 million on its defense against SEC&#8217;s allegations regarding XRP token issuance. Brad Garlinghouse, the CEO of Ripple, has signaled the company&#8217;s readiness to escalate its legal dispute with the U.S. Securities and Exchange [...]"
  }
]