[
  {
    "source": "CoinDesk",
    "date": "2023-10-02T19:27:22.000Z",
    "title": "Congress Can't Let Gary Gensler Regulate Digital Assets Out of Existence",
    "url": "https://www.coindesk.com/consensus-magazine/2023/10/02/congress-cant-let-gary-gensler-regulate-digital-assets-out-of-existence/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "We should support an amendment from House Majority Whip Tom Emmer to limit the SEC’s authority over the industry, say Tim Ryan and David McIntosh, co-chairs of the Blockchain Innovation Project."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-02T19:23:31.000Z",
    "title": "Is Michael Lewis Throwing Out His Reputation to Defend Sam Bankman-Fried?",
    "url": "https://www.coindesk.com/consensus-magazine/2023/10/02/is-michael-lewis-throwing-out-his-reputation-to-defend-sam-bankman-fried/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The author’ latest book, “Going Infinite,” is an eyewitness account of the fall of FTX’s founder, who Lewis said is “misunderstood.”"
  },
  {
    "source": "Decrypt",
    "date": "2023-10-02T19:34:39.000Z",
    "title": "Adidas and Moncler Collab Features AI 'Adventurers' and NFTs",
    "url": "https://decrypt.co/199800/adidas-moncler-fashion-collab-features-ai-adventurers-nfts",
    "description": "The collaboration between iconic apparel brands Adidas and Moncler includes a campaign created with generative AI, plus NFT collectibles."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-02T19:34:13.000Z",
    "title": "One-third of all CFTC crypto enforcement actions took place this year: Chair Behnam",
    "url": "https://cointelegraph.com/news/cftc-chair-rostin-behnam-one-third-cftc-crypto-enforcement-actions-occurred-this-year",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/18bca9f6-8711-4817-a6f7-eabda473f625.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>CFTC chair Rostin Behnam told an audience at the Financial Industry Association Expo about the agency’s activity in the crypto space and its need for modern legislation. </p>\n                    <p><p>United States Commodity Futures Trading Commission (CFTC) chair Rostin Behnam highlighted his agency’s activity in the crypto sphere and the need for up-to-date legislation at the Financial Industry Association Expo 2023 event in Chicago. He described the CFTC Enforcement Division’s efforts as a “nonstop drumbeat.”</p><p>In the text version of his keynote address to the industry group, Behnam recounted the $6 billion his agency collected in penalties in fiscal year 2023. He added: </p><blockquote>“45 of those [enforcement] actions this fiscal year involved digital asset related misconduct, representing over 34% of the 131 such actions brought by the Commission since 2015.”</blockquote><p>Behnam singled out the “precedent-setting litigation” his agency won against Ooki DAO, which resulted in the closure of the decentralized autonomous organization (DAO) and <a href=\"https://cointelegraph.com/news/ooki-dao-to-shut-down-after-precedent-setting-court-battle-with-cftc\">netted a $643,542 penalty</a>. In its default judgment against Ooki DAO, the U.S. District Court for the Northern District of California found that the DAO was a “person” under the Commodity Exchange Act (CEA) of 1936. </p><p>Behnam returned to the CEA when he discussed the agency’s future direction. “The cornerstone of our latest era is disintermediation brought about by groundbreaking technology: DeFi, AI, and standard WiFi,” he said, but:</p><blockquote>“The limits in the CEA established in essentially another era create real barriers to engaging in rulemakings and policy that is necessary to our mission, but just beyond our scope.”</blockquote><p>Furthermore, those limits “forc[e] the agency to engage in increasingly resource intensive quests for assurances that we are acting within the bounds of our intended remit.” </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I look forward to speaking Monday morning at <a href=\"https://twitter.com/FIAconnect?ref_src=twsrc%5Etfw\">@FIAconnect</a> <a href=\"https://twitter.com/hashtag/FIAExpo?src=hash&amp;ref_src=twsrc%5Etfw\">#FIAExpo</a> on the <a href=\"https://twitter.com/CFTC?ref_src=twsrc%5Etfw\">@CFTC</a> agenda and enforcement. My remarks will be posted online at <a href=\"https://t.co/JojHNdQoVh\">https://t.co/JojHNdQoVh</a>.</p>&mdash; Rostin Behnam (@CFTCbehnam) <a href=\"https://twitter.com/CFTCbehnam/status/1708673237435965693?ref_src=twsrc%5Etfw\">October 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Vertical integration — an “outgrowth of electronification and the promise of DeFi” — is occurring throughout financial markets and leading to egulatory concerns, and “customer protections mean something different now,” according to Behnam.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/cftc-commissioner-calls-crypto-regulatory-pilot-program\">CFTC commissioner calls for crypto regulatory pilot program</a></em></strong></p><p>Behnam’s statements contrasted sharply with Securities and Exchange Commission chair Gary Gensler’s position that <a href=\"https://cointelegraph.com/news/sec-boss-worries-crypto-bill-undermines-financial-protections\">Depression-era financial legislation</a> “has been quite a benefit to investors and economic growth over the last 90 years,” and should not be tampered with. </p><p>Behnam also indirectly addressed limitations on the CFTC’s enforcement authority. “To suggest that […] we must wait until victims suffer and cry out for help to be proactive […] undermines our mission and purpose,” he said. “I have continued to advocate for additional authority in the crypto space,” he added later.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/cleaning-crypto-how-much-enforcement-needed/\">Cleaning up crypto: How much enforcement is too much?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-02T19:19:07.000Z",
    "title": "Book describes Sam Bankman-Fried with little attention span or respect for appointments",
    "url": "https://cointelegraph.com/news/sam-bankman-fried-book-little-attention-span-respect-appointments",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/e798e6d6-6ec8-41cf-ba04-0f183c07eb19.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The former FTX CEO was reportedly invited by Vogue editor-in-chief Anna Wintour to be her special guest at the Met Gala, only to cancel at the last minute. </p>\n                    <p><p>Michael Lewis, author of <em>The Big Short</em>, has painted an interesting picture of <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried</a> (SBF) in his soon-to-be released book on the former FTX CEO.</p><p>In an excerpt of <em>Going Infinite: The Rise and Fall of a New Tycoon</em> published in the Washington Post on Oct. 1, Lewis <a href=\"https://www.washingtonpost.com/opinions/interactive/2023/michael-lewis-sam-bankman-fried-ftx-crypto/\" target=\"_blank\" rel=\"noopener nofollow\">described</a> several interactions Bankman-Fried had with the media and influential figures prior to the downfall of FTX and his criminal charges in the United States. According to the author, he would frequently play video games in the background of online interviews — his <a href=\"https://cointelegraph.com/news/sbf-won-t-be-able-to-play-league-of-legends-under-proposed-bail-changes\">League of Legends exploits</a> are well reported — often giving little attention to people including Vogue editor-in-chief Anna Wintour.</p><p>“Sam didn’t want to seem rude,” said Lewis on SBF’s talk with Wintour. “It was just that he needed to be playing this other game at the same time as whatever game he had going in real life. His new social role as the world’s most interesting new child billionaire required him to do all kinds of dumb stuff. He needed something, other than what he was expected to be thinking about, to occupy his mind.” </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">At one point, Sam Bankman-Fried was worth $22.5 billion.<br>No one but Mark Zuckerberg had become richer faster.<br> <br>Then his crypto empire collapsed.<br> <br>Michael Lewis was there for the rise and fall. Read an exclusive excerpt from his book on SBF&#39;s last year: <a href=\"https://t.co/ie7rn8ZdSe\">https://t.co/ie7rn8ZdSe</a> <a href=\"https://t.co/hkPwuT0H8B\">pic.twitter.com/hkPwuT0H8B</a></p>&mdash; Washington Post Opinions (@PostOpinions) <a href=\"https://twitter.com/PostOpinions/status/1708636055044337713?ref_src=twsrc%5Etfw\">October 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Lewis added that Natalie Tien, who moved into the role of FTX’s head of public relations and SBF’s “personal scheduler”, said the former CEO cancelled many highly publicized appearances — often at the last minute — for seemingly no reason at all. The Wintour interview reportedly led to FTX's sponsorship and Bankman-Fried as a special guest at the Met Gala, which he ended up snubbing.</p><p>“Sam treated everything on his schedule as optional,” said the book. “The schedule was less a plan than a theory. When people asked Sam for his time, they assumed they’d posed a yes or no question [...] All he had done, when he said yes, was to assign some non-zero probability to the proposed use of his time. The dial would swing wildly as he calculated and recalculated the expected value of each commitment, right up until the moment he honored it or didn’t.”</p><p>Other in-person showings by Bankman-Fried included testifying before the U.S. House Financial Services Committee in December 2021 and meeting with Senator Mitch McConnell. The appearances marked some of the rare times SBF <a href=\"https://cointelegraph.com/news/sam-bankman-fried-appear-suit-tie-trial\">appeared in public wearing a suit</a> as opposed to his usual T-shirt and shorts — though social media users pointed to footage of the then CEO's shoes slipped on without being tied at the hearing.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-preview\"><strong><em>Sam Bankman-Fried FTX trial — 5 things you need to know</em></strong></a></p><p>It’s unclear what other information will become available once the book is released on Oct. 3, the same day jury selection begins for SBF’s criminal trial in New York. Amid the expected court proceedings, a slew of podcasts, news features, books, and other media have been released detailing aspects of Bankman-Fried’s life before and after the downfall of FTX. A <em>60 Minutes </em>interview with Lewis revealed SBF <a href=\"https://cointelegraph.com/news/ftx-sam-bankman-fried-sbf-offer-donald-trump-not-to-run-president\">had plans to pay off</a> former U.S. President Donald Trump not to run for the office again based on the threat to elections and democracy as a whole. </p><p>On Oct. 4, Bankman-Fried will appear in a New York courtroom for the first day of his trial, scheduled to run through November. He will face 7 charges related to fraud at FTX and Alameda Research, for which he has pleaded not guilty.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-02T19:30:50.000Z",
    "title": "‘Big Short’ Author Reveals Sam Bankman-Fried’s ‘Gamified’ Saga in Latest Tell-All",
    "url": "https://news.bitcoin.com/big-short-author-reveals-sam-bankman-frieds-gamified-saga-in-latest-tell-all/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/ddccxxc-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/ddccxxc-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ddccxxc-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ddccxxc-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ddccxxc-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ddccxxc-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ddccxxc-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ddccxxc.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />This week, the renowned writer of &#8220;The Big Short,&#8221; Michael Lewis, has embarked on an extensive promotional campaign for his latest literary endeavor, chronicling the turbulent odyssey of Sam Bankman-Fried, the beleaguered co-founder and former CEO of FTX. Dubbed &#8220;Going Infinite: The Rise and Fall of a New Tycoon,&#8221; the tome delves into various chapters [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-02T19:21:52.000Z",
    "title": "Market turns green with BTC’s bullish momentum, BSV and eCash surge",
    "url": "https://crypto.news/market-turns-green-with-btcs-bullish-momentum-bsv-and-ecash-surge/",
    "description": "The global crypto market has gained bullish momentum as investors hop on the “Uptober” bus — a bullish term used by traders."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-02T19:23:43.000Z",
    "title": "Project Mariana, with BIS and Central Banks, Achieves Milestone – Millions of People Flock to Privacy Coins Monero, Dash, and Zcash",
    "url": "https://www.crypto-news-flash.com/project-mariana-with-bis-and-central-banks-achieves-milestone-millions-of-people-flock-to-privacy-coins-monero-dash-and-zcash/?utm_source=rss&utm_medium=rss&utm_campaign=project-mariana-with-bis-and-central-banks-achieves-milestone-millions-of-people-flock-to-privacy-coins-monero-dash-and-zcash",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Cryptographer-Monero.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Cryptographer-Monero.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Cryptographer-Monero-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Cryptographer-Monero-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Cryptographer-Monero-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The Bank for International Settlements (BIS) just concluded whole CBDC testing. The testing featured DeFi, AMM and other Decentralized innovations. The Bank for International Settlement (BIS) in collaboration with several central banks in certain regions including France, Singapore, and Switzerland, has successfully tested cross-border settlements using wholesale Central Bank Digital Currencies (wCBDCs).  The initiative which [...]"
  }
]