[
  {
    "source": "CoinDesk",
    "date": "2023-06-06T13:32:16.000Z",
    "title": "Coinbase Violated State Securities Laws With Staking Program, Alabama Regulator Alleges",
    "url": "https://www.coindesk.com/policy/2023/06/06/coinbase-violated-state-securities-laws-with-staking-program-alabama-regulator-alleges/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The crypto exchange is facing scrutiny from a task force of ten U.S. state securities regulators after getting sued by the SEC on the same day."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-06T13:19:19.000Z",
    "title": "Altcoins Dip Following Second SEC Lawsuit Against Crypto Exchange",
    "url": "https://www.coindesk.com/markets/2023/06/06/altcoins-dip-following-second-sec-lawsuit-against-crypto-exchange/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The SEC's lawsuit against Coinbase named thirteen altcoins as securities."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-06T13:30:00.000Z",
    "title": "Tornado Cash 2.0: The race to build safe and legal coin mixers",
    "url": "https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/magazine-Alternatives-to-Tornado-cash-scaled.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Projects are racing to create legal coin mixers that preserve privacy while revealing just enough data to stay on the right side of the law.</p>\n                    <p><p><strong>When the U.S. government sanctioned coin mixer Tornado Cash, many thought it might spell the end for illicit crypto mixing services. But theyre back  and with a glossy new institutional sheen and legit use cases to help traders and funds keep their market moves a “trade” secret. <br><br></strong>Tornado Cash is what is known as a <a href=\"https://cointelegraph.com/explained/what-is-a-cryptocurrency-mixer-and-how-does-it-work\" target=\"_blank\" rel=\"nofollow\" >mixer</a>, a coin anonymizer that breaks the identifying links in blockchain transactions, providing a certain degree of anonymity for users.</p><p>The reasons people use coin anonymizers vary from criminality to ideology. Bad actors can use Tornado Cash to<a href=\"https://cointelegraph.com/news/roundup-of-crypto-hacks-exploits-and-heists-in-2020\" target=\"_blank\" rel=\"nofollow\" > hide</a> their naughty deeds, effectively laundering the proceeds of crime and preventing stolen crypto from being traced to them on the blockchain. Thats why the United States Department of the Treasurys Office of Foreign Assets Control sanctioned the protocol last year. </p><p>But there are legitimate reasons for not wanting your every transaction tracked, and supporters argue that Tornado Cash provides important privacy infrastructure. But is it possible to build a privacy-preserving protocol that provides regulators with just enough information to know users are staying on the right side of the law? </p><p>Various developers are experimenting with redesigned mixers using ZK-proofs and believe theres a way to make it happen.</p><section class=\"adv-banner adbutler-ad adbutler-ad__desktop\"><div class=\"container\"><!-- 1456x180 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><section class=\"adv-banner adbutler-ad adbutler-ad__mobile\"><div class=\"container\"><!-- 600x500 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><p>The mathematical machinery has been around for quite a while, explains Matthew Niemerg, co-founder of Aleph Zero.</p><p>Its more about designing a solution that balances an individuals privacy from the broader public while allowing the revealing of limited pieces of data to particular entities, such as banks or government agencies, using ZK-proofs. It takes time to design such a scheme and bring a product to market.</p><p>But the big use case for these new coin mixers wont be dodgy crypto thieves: Itll be the big institutions and hedge funds, trying to get ahead of front-running bots and to keep their business dealings secret from competitors.</p><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Coinmixer-2.jpg\" alt=\"\" class=\"wp-image-20597\" width=\"507\" height=\"342\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Coinmixer-2.jpg 737w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Coinmixer-2-300x202.jpg 300w\" sizes=\"(max-width: 507px) 100vw, 507px\" /><figcaption class=\"wp-element-caption\"><em>Bitcoin smoothie anyone?</em></figcaption></figure><h2 id=\"h-how-does-tornado-cash-work\"><strong>How does Tornado Cash work?</strong> </h2><p>Tornado Cash is an important yet controversial product in the Ethereum ecosystem. The decentralized, noncustodial privacy solution accepts ETH and ERC-20 deposits to muddy transactional histories by breaking the on-chain link between source and destination addresses. Send some coins in, take some different coins out. </p><p>Tornado Cashs origin story is a fascinating account of true decentralization dreamers fighting the regulatory powers that be. Tornado Cash first launched in August 2019 but was initially experimental software because the original software developers retained control over user funds through a multisig wallet.<sup> </sup></p><figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" width=\"713\" height=\"398\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Example-of-a-mixing-transaction.-Source-TarushTech-Medium.jpg\" alt=\"Mixing Transaction\" class=\"wp-image-20600\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Example-of-a-mixing-transaction.-Source-TarushTech-Medium.jpg 713w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Example-of-a-mixing-transaction.-Source-TarushTech-Medium-300x167.jpg 300w\" sizes=\"(max-width: 713px) 100vw, 713px\" /><figcaption class=\"wp-element-caption\"><em>Example of a mixing transaction. (TarushTech-Medium)</em></figcaption></figure><p>In 2020, Tornado Cashs developers burned their admin keys, turning the privacy tool into permissionless code. Tornado Cash was supposedly a truly perpetual persistent script, completely trustless and unstoppable, and the developers believed they were no longer responsible for the platform as the application operated as self-executing code.</p><p>Burning the admin keys had two goals. It removed the possibility of admin key rug pull risk, where a team member can steal all the funds out of the smart contract and disappear. And, in theory, the idea was that by burning their admin keys and relinquishing control to the ether, theyd be able to avoid potential legal ramifications.</p><p>Then they came for the Tornado Cash developers.</p><figure class=\"wp-block-image alignleft size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Coinmixer-4.jpg\" alt=\"\" class=\"wp-image-20599\" width=\"465\" height=\"309\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Coinmixer-4.jpg 786w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Coinmixer-4-300x199.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Coinmixer-4-770x511.jpg 770w\" sizes=\"(max-width: 465px) 100vw, 465px\" /><figcaption class=\"wp-element-caption\"><em>Tornado Cash has been the target of U.S. regulators.</em></figcaption></figure><p>In August 2022, Tornado Cash was the target of the U.S. Treasurys Office of Foreign Assets Control (OFAC), which<a href=\"https://home.treasury.gov/news/press-releases/jy0916\" target=\"_blank\" rel=\"nofollow\" > sanctioned</a> the digital currency mixer for being a money-laundering tool. There was a lot of debate over whether it was possible to sanction a piece of code, and effectively, they<a href=\"https://cointelegraph.com/news/tornado-cash-dev-alex-pertsev-set-to-be-released-from-prison-under-surveillance\" target=\"_blank\" rel=\"nofollow\" > went after</a> the developers and U.S.-based users, who could <a href=\"https://www.coincenter.org/analysis-what-is-and-what-is-not-a-sanctionable-entity-in-the-tornado-cash-case/\" target=\"_blank\" rel=\"nofollow\" >qualify</a> as a sanctioned entity. This led to accusations of clumsy law enforcement shooting the evangelicals. </p><p>Stopping Tornado Cash completely is beyond the Treasurys ability at present. This is because open-source software built upon the Ethereum blockchain is accessible to anyone and runs mostly autonomously. Tornado Cashs code is still accessible and can be easily copied and resurrected under different aliases and on other Ethereum Virtual Machine blockchains. </p><p>Developers have already forked Tornado Cashs code to build Privacy Pools on the Optimism blockchain. Ameen Soleimani, co-founder and CEO of SpankChain  an adult service on-chain  was a notable supporter.</p><p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ We fixed <a href=\"https://twitter.com/TornadoCash?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >@tornadocash</a> <br><br>v0 of <a href=\"https://t.co/Nt4b2Tgx1D\" target=\"_blank\" rel=\"nofollow\" >https://t.co/Nt4b2Tgx1D</a> is live on <a href=\"https://twitter.com/optimismFND?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >@optimismFND</a><br><br>test out the demo, but please note:<br>– this is experimental code<br>– it has not been audited<br>– the trusted setup is untrusted<br><br>read the full story anon <a href=\"https://t.co/9nAU3RrgpN\" target=\"_blank\" rel=\"nofollow\" >https://t.co/9nAU3RrgpN</a></p>— Ameen Soleimani (@ameensol) <a href=\"https://twitter.com/ameensol/status/1632083054272430080?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >March 4, 2023</a></blockquote> </p><p>No one seems to have a solution for the regulators playing whack-a-mole, but many ordinary users are deterred by the idea of using sanctioned protocols or their offshoots.</p><p><strong><em>Also read: </em></strong><a target=\"_blank\"  href=\"https://cointelegraph.com/magazine/porn-payments-crypto-killer-app/\"><strong><em>Porn payments were supposed to be cryptos killer app: Why have they flopped?</em></strong></a></p><p>So, whats next for crypto privacy that doesnt offend the powers that be?</p><p>Tornado Cash Mark II has already launched:</p><p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I sincerely hope no one thought we were finished <a href=\"https://t.co/YVpSMtjeCd\" target=\"_blank\" rel=\"nofollow\" >pic.twitter.com/YVpSMtjeCd</a></p>— Ameen Soleimani (@ameensol) <a href=\"https://twitter.com/ameensol/status/1629942658008514560?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >February 26, 2023</a></blockquote> </p><h2 id=\"h-what-replaces-tornado-cash\"><strong>What replaces Tornado Cash?</strong></h2><p>The metrics are simple: providing tech that ensures user privacy while satisfying the regulators Know Your Customer demands (so that banks can identify their customers for regulators). Easy. </p><p>The aforementioned Privacy Pools launched its early experimental code in March 2023 and has its sights set on becoming an improved Tornado Cash, but meeting regulatory demands is a tough ask. The solution works on a technical level but regulatory enforcement is perhaps likely at some point. </p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/sell-or-hodl-how-to-prepare-for-the-end-of-the-bull-run-part-2/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Sell or hodl? How to prepare for the end of the bull run, Part 2</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/nurse-fired-for-onlyfans-launches-crypto-porn-app/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Boston nurse fired for nudes on OnlyFans launches crypto porn app</p>                        </a>                    </div></div></div><p>Founding contributor Soleimani even tweeted that would be the case eventually. He argued that Privacy Pools is a kind of an experiment with the aim of helping regulators understand a potentially more attractive equilibrium between privacy and regulation that we didnt even know existed a few months ago. He is referring to developments such as zero-knowledge proofs, a computational proof of a transaction that took place while anonymizing the terms of the transaction as used in private cryptocurrency Zcash and in a slightly different way in layer-2 protocols, such as StarkNet. But its not clear that will be enough for regulators. </p><p>Soleimani hints on Twitter the regulators will keep coming. </p><p><blockquote class=\"twitter-tweet\" data-conversation=\"none\"><p lang=\"en\" dir=\"ltr\">18/ What&#039;s next, anon?<a href=\"https://t.co/Nt4b2Tgx1D\" target=\"_blank\" rel=\"nofollow\" >https://t.co/Nt4b2Tgx1D</a> v0 is not the final product<br><br>we are shipping this to start a conversation<br><br>to help regulators understand a potentially more attractive equilibrium between privacy and regulation that we didn&#039;t even know existed a few months ago</p>— Ameen Soleimani (@ameensol) <a href=\"https://twitter.com/ameensol/status/1632089721395372038?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >March 4, 2023</a></blockquote> </p><h2 id=\"h-we-need-to-poke-back-at-the-bear\"><strong>We need to poke back at the bear</strong></h2><p>Aleph Zeros Niemerg says there needs to be pushback against the idea that privacy-preserving protocols are de facto illegal.</p><p>If we want to live in a world with financial privacy, we need to poke back at the bear and say this new solution does what regulators want and point out that its better than the existing system, he says, adding that mixers are needed by investors for security reasons, not just to prevent copy trades and counter trades. Theres a personal security risk of having funds in an account attributed to you, he says.</p><p>With a Ph.D. in mathematics, he believes the crypto community can deliver a legal solution using math. All the pieces are there. Decentralized IDs and ZK proofs  there are various components necessary to build this, he says.</p><p>Aleph Zeros tech stack focuses on providing developers with the underlying tools and cryptographic primitives necessary to use ZK-proofs for multiparty computation for privacy-enhancing applications. For example, a mixer could use verified credentials combined with ZK-proofs to prove any person using the mixer at a given moment was not on any sanctions list and that all persons have been KYCed by a reputable third party. But the users and their transactions would remain anonymous. Niemerg says:</p><blockquote class=\"wp-block-quote\"><p>Post-Tornado Cash, the industry has to be proactive and say, We have solutions to combat terrorist financing and money laundering, which are the two main factors that concern regulators.</p></blockquote><p> By constructing the provenance of transaction history using ZK-proofs combined with on-chain verified credentials, we can streamline and make compliance cheaper while providing more certainty to financial institutions regarding the provenance of funds but still adhere to the privacy of transactions related to people who are not directly a given financial institutions customer. </p><p>Further, he argues, crypto can be a better KYC system than the current one: In other words, a financial institution should not be concerned with the private details of the customer of your customer. That is the current ruleset with cash. What we can do with cryptography nowadays is more than whats required under the existing system.</p><figure class=\"wp-block-image alignleft size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Coinmixer-6.jpg\" alt=\"\" class=\"wp-image-20595\" width=\"494\" height=\"324\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Coinmixer-6.jpg 779w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Coinmixer-6-300x197.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Coinmixer-6-770x505.jpg 770w\" sizes=\"(max-width: 494px) 100vw, 494px\" /><figcaption class=\"wp-element-caption\"><em>Coin mixers can be used to hide naughty deeds.</em></figcaption></figure><p>Chloe White, an international regulatory policy adviser in Dubai turned independent adviser to the crypto industry, agrees.</p><p>Now is the time for policy advocates to come forward with creative win-win solutions, she tells Magazine. Discussions around privacy coins and mixers have tended to be somewhat binary and, in my view, quite outdated, given how the technology and industry have developed.<br><br>The industrys horror year of protocol and company collapses in 2022 has made the debate increasingly polarized, and White fears that governments and the industry are growing further apart.<br><br>Crypto advocates often cite on-chain statistics from tracing companies that show illicit use to be a tiny fraction of total activity, but many policymakers dont believe and wont accept these statistics, she says, apparently from first-hand experience.</p><p>Niemerg says the industry needs to be more proactive in dealing with policymakers. </p><p>Part of becoming a more mature industry is that we need to engage regulators. Whether or not we like it, we have to put on our big boy pants and go in and lobby, he says.</p><h2 id=\"h-the-responsibility-is-on-us\"><strong>The responsibility is on us</strong></h2><p>Niemerg points out that the goals of regulators and the crypto community are often diametrically opposed.</p><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/coinmixer-1.jpg\" alt=\"\" class=\"wp-image-20596\" width=\"477\" height=\"313\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/coinmixer-1.jpg 768w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/coinmixer-1-300x197.jpg 300w\" sizes=\"(max-width: 477px) 100vw, 477px\" /><figcaption class=\"wp-element-caption\"><em>Governments want to police crypto mixers.</em></figcaption></figure><p>What do governments want? They dont want anonymous peer-to-peer transfers. Their actual goal is just a straight-up ban on cash so they can monitor and tax every single transaction. Some people go so far as wanting to restrict undesirable yet fully legal economic activity, he says. </p><p>Governments seek to police the on- and off-ramps to crypto ecosystems, and that is understandable, he argues, as these are the integration points with the traditional financial system. Banks partially evolved into service companies for ensuring the privacy of our transactions. But it is important to note that judges may be able to approve court orders when needed for law enforcement in crypto, too.</p><p>Crypto transactions are currently more traceable than cash, for example. Chainalysis, a blockchain analysis firm, reported that, in the first month of the war, the <a href=\"https://blog.chainalysis.com/reports/russia-ukraine-war-cryptocurrency-one-year/\" target=\"_blank\" rel=\"nofollow\" >Ukrainian government received</a> more than $56 million in crypto donations, mostly Bitcoin and Ether. Thats another use case why mixer advocates argue privacy mixers for individuals are needed.</p><p>What will regulators accept as a compliance solution? is the question Niemerg says we need to be asking ourselves. The math and tech should make regulators comfortable, but this requires ongoing discourse and education.</p><figure class=\"wp-block-image alignleft size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/coin-mixer-3-new.jpg\" alt=\"\" class=\"wp-image-20598\" width=\"474\" height=\"316\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/coin-mixer-3-new.jpg 767w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/coin-mixer-3-new-300x200.jpg 300w\" sizes=\"(max-width: 474px) 100vw, 474px\" /><figcaption class=\"wp-element-caption\"><em>Crypto mixers have all sorts of uses.</em></figcaption></figure><h2 id=\"h-privacy-solutions-are-needed\"><strong>Privacy solutions are needed</strong></h2><p>Demonstrating a clear and legitimate use case for crypto mixers that helps institutions make money and therefore helps bootstrap the economy is probably the best bet to get regulators onside. And there are signs this is starting to emerge.</p><p>Forget dodgy individuals using coin mixers via a Tor browser from an internet cafe in Nigeria, hedge funds, banks and superfunds also need privacy, as all their transactions can currently be seen on-chain. We already accept there needs to be an aspect of commercial in confidence in business dealings, and privacy protocols can help make this a reality with blockchain technology. </p><p>So, whats next after Tornado Cash? asks Jemma Xu, founding contributor at Portal Gate. Decentralized, compliant and anonymous solutions that stop the bad guys but let the good guys in, Portal Gate is a new compliant and private DeFi solution that is coming out of stealth mode, backed by Melbourne crypto fund Apollo Crypto. She envisages it as a core piece of decentralized financial infrastructure.</p><blockquote class=\"wp-block-quote\"><p>We are building a compliant, decentralized dark pool, leveraging ZK-based compliance oracles for permissioned access.</p></blockquote><p>Portal Gates core mission is to build an institutional-grade DeFi solution that allows legitimate users to transfer, trade and transact on-chain in a compliant manner whilst protecting their privacy on-chain.</p><p>Xu adds that funds making crypto trades in a competitive environment need to keep those trades secret, so the protocols aim to minimize returns erosions from alpha leakages and front-running bots. It is very hard to trade on-chain with size at the moment, particularly for assets other than the major cryptocurrencies. Portal Gate is here to solve that.</p><figure class=\"wp-block-image aligncenter size-large is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Portal-Gate-1024x341.jpg\" alt=\"Portal Gate\" class=\"wp-image-20601\" width=\"-326\" height=\"-108\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Portal-Gate-1024x341.jpg 1024w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Portal-Gate-300x100.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Portal-Gate-770x257.jpg 770w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Portal-Gate.jpg 1500w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption class=\"wp-element-caption\"><em>Portal Gate is a DeFi startup bringing private, legal dark pools to the industry. </em></figcaption></figure><p>Users are onboarded to the platform under standard Know Your Customer and Know Your Business and, thereafter, can trade anonymously. This is a very different use case from Tornado Cash and one that may appease regulators while helping to grow the crypto industry. </p><p>Xu says their dark pool development is led by a highly regarded technical founder who previously designed and implemented one of the top Web3 protocols. The core development team is mainly made up of experts in cryptography. Perhaps fittingly, they have chosen to remain anonymous, although Xu tells Magazine additional details. </p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/ai-blockchain-control-robots-incentivise-humans/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>How to control the AIs and incentivize the humans with crypto</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/crypto-effect-trading-altcoins-edge-addiction/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>The crypto effect: Trading altcoins at the edge of addiction</p>                        </a>                    </div></div></div><p>Progress in decentralized dark pools has been challenging due to both technical difficulties and a lack of on-chain liquidity. But since the 2020 DeFi Summer, which saw an explosion of on-chain liquidity, the team believes compliant and private DeFi infrastructure is now possible, and they have the expertise to implement a solution. </p><p>These use cases are legitimate, Xu says, highlighting that<a href=\"https://www.investopedia.com/articles/markets/050614/introduction-dark-pools.asp\" target=\"_blank\" rel=\"nofollow\" > dark pools </a>are frequently used in traditional finance trading among Wall Street banks. Unlike a traditional centralized dark pool where the dark pool owner (typically an institutional bank or market maker) can route orders to benefit its own traders ahead of its clients, a decentralized dark pool relies on a trustless network to match orders and settle on-chain. This provides traders with a unique venue to trade with hidden prices and order size and know they are trading against KYC/KYBed users, so they do not need to fear that trades are tainted. Currently, DeFi trading is in what the professionals call lit pools where orders are publicly submitted on-chain and trade intentions are known. </p><p>If I trade using lit pools like Uniswap or aggregators of lit pools like 1inch, once I submit an order, it takes time for the blocks to confirm and order to settle. This means that in the interim time period, my trading intention is known and my order can be easily front-run using MEV bots. </p><figure class=\"wp-block-image aligncenter size-large is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/How-a-crypto-mixer-works-1024x415.jpg\" alt=\"Crypto Mixer graphic\" class=\"wp-image-20602\" width=\"955\" height=\"387\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/How-a-crypto-mixer-works-1024x415.jpg 1024w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/How-a-crypto-mixer-works-300x122.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/How-a-crypto-mixer-works-770x312.jpg 770w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/How-a-crypto-mixer-works.jpg 1227w\" sizes=\"(max-width: 955px) 100vw, 955px\" /><figcaption class=\"wp-element-caption\"><em>The lowdown on how crypto mixers work.</em></figcaption></figure><p>So, Portal Gates target market is institutional grade funds and institutions who are happy to be compliant but dont want their trading and investment decisions to be made public. This is a legitimate use case. And Portal Gate was built with that user use case in mind. It is projected that a majority of its users will be institutional funds and liquid on-chain traders.</p><p>In the meantime, other jurisdictions are making Tornado Cash clones easier to use. </p><h2 id=\"h-what-is-legal-and-safe-anyway\"><strong>What is ‘legal and safe’ anyway?</strong></h2><p>There is a fundamental disagreement about the legitimacy of privacy technologies, at a time when the worlds major powers  the federal government of the United States and China  are arguably doubling down on their efforts to leverage the financial system as an arm of state surveillance and economic control. </p><p>White notes, however, there are jurisdictions taking an alternate route to the traditional privacy coin ban lists. She points to regulatory approaches in New York and Dubai as examples of how the technology neutrality principle can be applied to tackle the problem differently. White, who led the development of key aspects of Dubais policy framework, argues that principles-based rules are what is needed in this space. </p><p>Even an asset such as Zcash can be compatible with Anti Money-Laundering requirements, she explains, adding, It all depends on how the assets are used and the context surrounding the users and their transaction. New Yorks financial watchdog, the Department of Financial Services (NYDFS), acknowledged when they greenlisted Zcash for trading on the (for now) U.S.-based exchange Gemini. </p><p>In its <a href=\"https://www.dfs.ny.gov/reports_and_publications/press_releases/pr1805141\" target=\"_blank\" rel=\"nofollow\" >press release</a> at the time, the NYDFS said, The Zcash network supports two kinds of transactions, transparent and shielded the privacy provided by Zcash does not prevent regulated entities from fulfilling their regulatory obligations, including customer due diligence, transaction monitoring, record-keeping, and reporting suspicious transactions. </p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Coinmixer-5.jpg\" alt=\"\" class=\"wp-image-20594\" width=\"-186\" height=\"-122\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Coinmixer-5.jpg 786w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Coinmixer-5-300x197.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Coinmixer-5-770x506.jpg 770w\" sizes=\"(max-width: 786px) 100vw, 786px\" /><figcaption class=\"wp-element-caption\"><em>Crypto is under scrutiny in the United States.</em></figcaption></figure><p>However, as crypto becomes an increasingly politicized issue in the United States, some observers fear that the NYDFS will backflip on its policy stance. </p><p>Given the industrys young, internet-native and highly mobile workforce, White says entrepreneurs are flocking to jurisdictions like Dubai and Hong Kong where governments want to provide a pathway to licensing. </p><p>Two years ago, the industry was more motivated and passionate about participating in policy development, but now, many founders are experiencing lobbying fatigue  they will not wait endlessly for clarity in their operating environment, she says. With a few exceptions like Coinbases Brian Armstrong and Messaris Ryan Selkis, most CEOs are not willing to call out the hypocrisy of the current approach and would rather quietly leave home instead.</p><p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The UAE  deserves a lot of credit for being forward thinking on crypto. First dedicated crypto regulator in the world, a clear rule book published (!), business friendly plus strong customer protections. Really enjoying my visit so far.</p>— Brian Armstrong  (@brian_armstrong) <a href=\"https://twitter.com/brian_armstrong/status/1655494936673017856?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >May 8, 2023</a></blockquote> </p><p>White says this is reflected in the types of calls she receives now at her new international advisory firm Riskmastery.xyz. </p><blockquote class=\"wp-block-quote\"><p>By far, the single most popular enquiry Ive received this year is from startup founders asking how they can set up and obtain licensing in Dubai.</p></blockquote><p>The Dubai governments new crypto regulator Virtual Asset Regulatory Authority (VARA) launched a full set of licenses in February, including rules on anonymity-enhanced digital assets and transactions. It allows for the use of privacy coins and tools if they are fully compliant with national and global money laundering and terrorism financing laws. </p><p>How the evolutionary process for mixers unfolds will ultimately come from the choices of founders, investors and state regulatory bodies. DAOs are also now a logical option for operating these mixers, as legal liability can theoretically be limited, governance rules can be set, and governments have someone to contact when the need arises. But the demand is there, and legitimate use cases make mixers a necessary crypto-native product that will be around with or without regulators blessings.</p><div class=\"subscribe subscribe--inner\"><div class=\"container\"><div class=\"subscribe__inner\"><div class=\"subscribe__content\">    <div class=\"subscribe__title display2\">Subscribe</div>    <div class=\"subscribe__desc text-l\">The most engaging reads in blockchain. Delivered once a        week.</div>        <div class=\"wpcf7 no-js\" id=\"wpcf7-f13672-o1\" lang=\"en-US\" dir=\"ltr\"><div class=\"screen-reader-response\"><p role=\"status\" aria-live=\"polite\" aria-atomic=\"true\"></p> <ul></ul></div><form action=\"/magazine/wp-json/wp/v2/posts?_embed&per_page=100#wpcf7-f13672-o1\" method=\"post\" class=\"wpcf7-form init subscribe__form demo\" aria-label=\"Contact form\" novalidate=\"novalidate\" data-status=\"init\"><div style=\"display: none;\"><input type=\"hidden\" name=\"_wpcf7\" value=\"13672\" /><input type=\"hidden\" name=\"_wpcf7_version\" value=\"5.7.4\" /><input type=\"hidden\" name=\"_wpcf7_locale\" value=\"en_US\" /><input type=\"hidden\" name=\"_wpcf7_unit_tag\" value=\"wpcf7-f13672-o1\" /><input type=\"hidden\" name=\"_wpcf7_container_post\" value=\"0\" /><input type=\"hidden\" name=\"_wpcf7_posted_data_hash\" value=\"\" /></div><fieldset class=\"form-group\"><p><input size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-email wpcf7-validates-as-required wpcf7-validates-as-email\" id=\"footer-subscribe\" aria-required=\"true\" aria-invalid=\"false\" value=\"\" type=\"email\" name=\"your-email\" /><label for=\"footer-subscribe\">Email address</label></p></fieldset><p><button class=\"subscribe__btn btn btn-white\">SUBSCRIBE</button></p><div class=\"wpcf7-response-output\" aria-hidden=\"true\"></div></form></div></div><div class=\"subscribe__img\">    <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2022/10/reading-copy.png\" alt=\"Subscribe to Magazine by Cointelegraph Newsletter.\" /></div></div></div></div></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-06T13:13:40.000Z",
    "title": "Coinbase drops 15% in pre-market trading after SEC lawsuit",
    "url": "https://cryptoslate.com/insights/coinbase-drops-15-in-pre-market-trading-after-sec-lawsuit/",
    "description": "<p>Quick Take Coinbase (COIN) is down 15% in premarket trading after the SEC sued the exchange, alleging multiple securities law violations It is now trading below $50.00. However, Coinbase was trading 8% lower on Monday.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/coinbase-drops-15-in-pre-market-trading-after-sec-lawsuit/\">Coinbase drops 15% in pre-market trading after SEC lawsuit</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-06-06T13:30:00.000Z",
    "title": "Tornado Cash 2.0: The race to build safe and legal coin mixers",
    "url": "https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/magazine-Alternatives-to-Tornado-cash-scaled.jpg\"></p><p>Projects are racing to create legal coin mixers that preserve privacy while revealing just enough data to stay on the right side of the law.</p>\n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-06T13:32:49.000Z",
    "title": "SEC Sues Coinbase, Alleging It Acted as an Unregistered Broker",
    "url": "https://cryptodaily.co.uk/2023/06/sec-sues-coinbase-alleging-it-acted-as-an-unregistered-broker",
    "description": "<p>In a shocking development, the SEC filed suit against crypto exchange Coinbase on Tuesday, alleging it acted as an unregistered broker and exchange. </p>\n<p>On Tuesday, the US Securities and Exchange Commission (SEC), in its relentless pursuit of the crypto industry, sued crypto exchange Coinbase in a New York federal court. The agency alleges the exchange acted as an unregistered broker and exchange and is demanding that the firm be &ldquo;permanently restrained and enjoined&rdquo; from further doing so.</p>\n<p>The complaint comes less than a day after the agency sued Binance and its CEO, Changpeng Zhao.</p>\nSEC: Coinbase Is an Unregistered Exchange, Broker, and Clearing Agency\n<p>In a press release, the securities regulator said Coinbase acted as an unregistered securities exchange, broker, and clearing agency and charged it for &ldquo;the unregistered offer and sale of securities in connection with its staking-as-a-service program.&rdquo;</p>\n<p>The SEC details:</p>\n\n<p>Since 2019, Coinbase has been engaging in an unregistered securities offering through its staking-as-a-service program, which allows customers to earn profits from the &ldquo;proof of stake&rdquo; mechanisms of certain blockchains and Coinbase&rsquo;s efforts.</p>\n\n<p>Through its unregistered services, the agency said Coinbase allegedly:</p>\n\n<p>Provides a marketplace and brings together the orders for securities of multiple buyers and sellers using established, non-discretionary methods under which such orders interact.</p>\n\n<p>Further, it states that Coinbase:</p>\n\n<p>Engages in the business of effecting securities transactions for the accounts of Coinbase customers.</p>\n\n<p>Finally, the SEC alleges that Coinbase:</p>\n\n<p>Provides facilities for comparison of data respecting the terms of settlement of crypto asset securities transactions, serves as an intermediary in settling transactions in crypto asset securities by Coinbase customers, and acts as a securities depository.</p>\n\n<p>The regulator further deems at least 13 crypto assets available to Coinbase users as &ldquo;crypto asset securities&rdquo;.</p>\nGensler and Grewal Comment\n<p>Chairman of the SEC, Gary Gensler, took to Twitter to share the news.</p>\n<p>Gensler commented:</p>\n\n<p>Coinbase&rsquo;s alleged failures deprive investors of critical protections, including rulebooks that prevent fraud and manipulation, proper disclosure, safeguards against conflicts of interest, and routine inspection by the SEC.</p>\n\n<p>Director of the SEC&rsquo;s Division of Enforcement, Gurbir S. Grewal, had this to say:</p>\n\n<p>You simply can&rsquo;t ignore the rules because you don&rsquo;t like them or because you&rsquo;d prefer different ones: the consequences for the investing public are far too great.</p>\n<p>As alleged in our complaint, Coinbase was fully aware of the applicability of the federal securities laws to its business activities, but deliberately refused to follow them. While Coinbase&rsquo;s calculated decisions may have allowed it to earn billions, it&rsquo;s done so at the expense of investors by depriving them of the protections to which they are entitled.&nbsp;Today&rsquo;s action seeks to hold Coinbase accountable for its choices.</p>\n\nThe SEC Appears to be Out for Blood\n<p>The crypto market has been in free fall since news broke that the agency filed suit against crypto exchange Binance and its founder and CEO, Changpeng Zhao. The agency accused Binance of mishandling funds and lying to investors and regulators about its operations.</p>\n<p>Binance responded by denying the claims.</p>\n<p>Coinbase has been under the radar amid the SEC&rsquo;s broader crackdown on unregistered securities.</p>\n<p>After the SEC and crypto exchange Kraken reached a settlement earlier in the year where the company agreed to shutter its staking program, Coinbase said they would defend the agency&rsquo;s classification of staking as a security. &nbsp;</p>\n<p>Coinbase executives claim that staking cannot be classified as a security under the US Securities Act or the Howey Test.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-06T13:13:05.000Z",
    "title": "Coinbase Becomes the Latest Target of SEC: Accused of Unregistered Brokerage and Securities Violations",
    "url": "https://news.bitcoin.com/coinbase-becomes-the-latest-target-of-sec-accused-of-unregistered-brokerage-and-securities-violations/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbsued-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbsued-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbsued-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbsued-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbsued-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbsued-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbsued-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/cbsued.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />After the U.S. Securities and Exchange Commission (SEC) sued Binance, it has now filed a legal case against the San Francisco-based exchange, Coinbase. The SEC alleges that Coinbase breached multiple securities regulations and has been functioning as an unregistered broker since 2019. SEC Alleges Coinbase Operated an Unregistered Brokerage and Committed Multiple Securities Offenses The [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T13:16:40.000Z",
    "title": "Litecoin price analysis: Bears degrade price to $86.63, more downtrend ahead?",
    "url": "https://www.cryptopolitan.com/litecoin-price-analysis-2023-06-06/",
    "description": "Litecoin price analysis for today indicates that the bearish momentum is still strong, and it has taken the price down to $86.63, a decline of 5.56 percent in the last 24 hours. The downtrend has been further supported by the lack of buying pressure in the market, as more traders seem to be exiting their ... <a title=\"Litecoin price analysis: Bears degrade price to $86.63, more downtrend ahead?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-analysis-2023-06-06/\" aria-label=\"More on Litecoin price analysis: Bears degrade price to $86.63, more downtrend ahead?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-06T13:21:36.000Z",
    "title": "Bitcoin (BTC) Dominance Trend Shifts Alongside Stablecoin Flows: Glassnode",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-dominance-records-shifting-trends-stablecoin-flows/",
    "description": "Amid the continuous downward trend in the global crypto market, leading on-chain analytics firm Glassnode yesterday reported some significant movement recorded in the Bitcoin (BTC) and Stablecoin markets. According to Glassnode, the dominance of Bitcoin and stablecoin flows have seen &#8220;dramatic shifts&#8221; over the years. Changes In Bitcoin Supply Ownership In a series of tweets posted earlier today, Glassnode released a recent report shedding light on the evolving landscape of Bitcoin supply ownership and the dynamics surrounding stablecoins. Related Reading: No All-Time High For Bitcoin In 2023, Former BitMEX Head Arthur Hayes Predicts The findings reveal significant shifts in the dominance of Bitcoin supply and the distribution of stablecoin holdings, indicating changing investor behaviors and potential migration of liquidity towards lower-risk digital assets. According to Glassnode&#8217;s report, the dominance of BTC supply has witnessed a noteworthy transformation over the past two years. US entities now hold 11% less Bitcoin than in June 2022, while investors active during Asian trading hours have increased their holdings by 9.9%. This reversal of fortunes represents a distinct departure from the trends observed during the 2020-2021 bull cycle, signifying a shift in market dynamics and investor preferences. Stablecoin Dynamics And Changing Market Sentiment Glassnode&#8217;s report also highlights significant developments in the stablecoin space. The supply of USDT (Tether) has reached all-time highs, indicating a surge in demand for this popular stablecoin. In contrast, the supplies of USDC (USD Coin) and BUSD (Binance USD) have declined to multi-year lows. This divergence suggests that non-interest-bearing stablecoins, such as USDT, are attracting more attention and capital, potentially due to their utility in trading and liquidity provision. Related Reading: Tether: How Its $2 Billion USDT Minting Impacts Ethereum’s Success In The Bull Market Furthermore, Glassnode&#8217;s analysis of on-chain flows reveals a decline in demand since April. While stablecoin inflows had significantly outweighed Bitcoin and Ethereum inflows in the first quarter, the market correction has led to a reversal in this trend. Glassnode now observes larger BTC and Ethereum inflows, possibly indicating sell-side activities as market participants adjust their positions in response to the evolving landscape. These findings collectively suggest a net capital rotation and the migration of liquidity towards lower-risk digital assets. Glassnode&#8217;s data aligns with the observation that BTC futures trade volumes are increasingly dominating the market, surpassing Ethereum and other digital assets in 2023. The recent increase in Bitcoin&#8217;s volume dominance, surpassing 65%, supports the notion that Bitcoin is perceived as a relatively lower-risk digital asset within the digital asset realm. Meanwhile, Bitcoin has witnessed a dramatic plunge in the past week and in the past 24 hours. The largest crypto asset by market capitalization has recorded a bearish movement down by 8.8% in the past 7 days. Over the past 24 hours, BTC has seen a 4.2% loss. At the time of writing, BTC currently trades below $26,000. This plummet follows the ongoing negativity in the crypto market including the lawsuit from the US regulator, the Securities and Exchange Commission (SEC) which has now affected the world&#8217;s largest crypto exchange Binance. ~ Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-06T13:36:46.000Z",
    "title": "Bitcoin Analysis Points to Bullish June Opportunity, Experts Explain",
    "url": "https://coinedition.com/bitcoin-analysis-points-to-bullish-june-opportunity-experts-explain/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Theres_a_window_for_BTC_to_rip_in_June_My_educated_guess_would-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Theres_a_window_for_BTC_to_rip_in_June_My_educated_guess_would-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Theres_a_window_for_BTC_to_rip_in_June_My_educated_guess_would-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Theres_a_window_for_BTC_to_rip_in_June_My_educated_guess_would-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Theres_a_window_for_BTC_to_rip_in_June_My_educated_guess_would-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Theres_a_window_for_BTC_to_rip_in_June_My_educated_guess_would-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Theres_a_window_for_BTC_to_rip_in_June_My_educated_guess_would.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Bitcoin enthusiasts are eagerly eyeing June for a potential bullish rally, according to analysts engaged in a dialogue on Twitter. A Bitcoin fundamental data analyst Willy Woo suggested that despite the usually flat or bearish summer market trend, historical data indicated that June, within the re-accumulation phase, has consistently exhibited a bullish inclination. Meanwhile, analyst [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-analysis-points-to-bullish-june-opportunity-experts-explain/\">Bitcoin Analysis Points to Bullish June Opportunity, Experts Explain</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-06T13:31:02.000Z",
    "title": "Crypto Market Cap May Not Drop Further, Predicts Renowned Trader",
    "url": "https://coinedition.com/crypto-market-cap-may-not-drop-further-predicts-renowned-trader/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Crypto_Market_Cap_May_Not_Drop_Further_Predicts_Renowned_Trader-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Crypto_Market_Cap_May_Not_Drop_Further_Predicts_Renowned_Trader-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Crypto_Market_Cap_May_Not_Drop_Further_Predicts_Renowned_Trader-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Crypto_Market_Cap_May_Not_Drop_Further_Predicts_Renowned_Trader-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Crypto_Market_Cap_May_Not_Drop_Further_Predicts_Renowned_Trader-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Crypto_Market_Cap_May_Not_Drop_Further_Predicts_Renowned_Trader-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Crypto_Market_Cap_May_Not_Drop_Further_Predicts_Renowned_Trader.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The renowned crypto trader Michael van de Poppe predicted in a tweet published earlier today that the global crypto market cap may establish its low for this latest correction. In the post, he noted that the total crypto market cap was still trading above the 200-week EMA and 200-week MA lines. The recent drop in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-market-cap-may-not-drop-further-predicts-renowned-trader/\">Crypto Market Cap May Not Drop Further, Predicts Renowned Trader</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-06T13:25:10.000Z",
    "title": "DYDX Price Prediction 2023-2030: Will dYdX Price Hit $10 Soon?",
    "url": "https://coinedition.com/dydx-price-prediction/",
    "description": "<img width=\"150\" height=\"150\" src=\"https://coinedition.com/wp-content/uploads/2022/10/DYDX-Price-Prediction-150x150.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"DYDX-Price-Prediction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" /><p>Bullish DYDX price prediction ranges from $5.09 to $6.13. DYDX price might also reach $10 this 2023. DYDX’s bearish market price prediction for 2023 is $1.078. dYdX’s mission is to democratize access to financial opportunities for various individuals by implementing advanced technology. As part of its mission, dYdX hopes to become a new-generation exchange and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/dydx-price-prediction/\">DYDX Price Prediction 2023-2030: Will dYdX Price Hit $10 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]