[
  {
    "source": "CryptoSlate",
    "date": "2023-07-25T03:00:57.000Z",
    "title": "Ransomware group known to use Monero and Bitcoin targets Italian asset manager",
    "url": "https://cryptoslate.com/ransomware-group-known-to-use-monero-and-bitcoin-targets-italian-asset-manager/",
    "description": "<p>The Italian asset manager Azimut has been targeted by the international ransomware group BlackCat, Reuters reported on July 24. Reuters said that the company disclosed the cyberattack on the same day and added that the firm has rejected any demand for a ransom payment. The company suggested that the attack did not harm client data, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ransomware-group-known-to-use-monero-and-bitcoin-targets-italian-asset-manager/\">Ransomware group known to use Monero and Bitcoin targets Italian asset manager</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-25T03:00:23.000Z",
    "title": "Bitcoin Exodus: Exchange Balances Plummet To Lowest Levels Since 2018",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-exodus-exchange-balances-plummet-to-lowest-levels-since-2018/",
    "description": "Bitcoin (BTC) continues to dominate the cryptocurrency market, as exchange balances have dropped to levels last seen in early 2018. This signals a growing trend of investors moving their Bitcoin holdings to cold storage, which is considered to be more secure.  According to a recent report by Bitfinex, while some of this decline in exchange balances may be attributed to the usage of decentralized exchanges and funds not covered in the data, the overarching trend appears to be a widespread movement of people withdrawing their Bitcoin from exchanges. Bitcoin-Backed Funds Lead Crypto Investment Surge  This trend is also reflected in the recent data from CoinShares, which shows that traditional fund investors are demonstrating a renewed interest in Bitcoin.  Crypto-backed investment funds saw a net inflow of $137 million last week, with a staggering 99 percent of this sum directed toward Bitcoin-backed funds.  Related Reading: Elon Musk Incorporates Dogecoin Symbol In Twitter Bio, Triggering 5% Increase In Price According to Bitfinex, this marks the fourth consecutive week of gross inflows into crypto funds, amassing a total of $742 million over the period, representing the largest run of inflows since the final quarter of 2021. The sustained inflows into Bitcoin-backed funds indicate strong investor confidence in the asset, despite the volatility inherent in the crypto market. Additionally, the outflows from short-Bitcoin funds reinforce the bullish sentiment for the BTC price among investors, which has now been in a tight range for months.  This data can thus be used as a proxy for institutional investor bias that the price will break out of this range toward the upside. Meanwhile, Ethereum funds were the only other category to see outflows last week, losing $1.6 million on a net basis. Altcoin funds, on the other hand, recorded slight inflows, with the largest going to multi-asset funds, followed by funds backed by Solana&#8217;s SOL token and Polygon&#8217;s MATIC.  Overall, this data paints a clear picture of Bitcoin&#8217;s continued dominance in the crypto market. While altcoins are making their presence felt, Bitcoin remains the preferred asset for traditional fund investors.  The sustained inflows into Bitcoin-backed funds suggest that investors have confidence in the asset&#8217;s long-term growth potential, despite the short-term volatility in the crypto market.  BTC Whales Increased Activity Indicates Bullish Market Sentiment According to a report by Glassnode, whales, or entities holding 1,000 or more BTC, have been making significant moves in the cryptocurrency market, with whale inflows to exchanges being historically large and accounting for 41% of the total. The dominance of whale inflow volumes to exchanges is significant, with over 82% of whale inflows destined for Binance, the largest exchange in the industry. This trend highlights the importance of the role played by whales in the cryptocurrency market, as their activity can have a significant impact on the price and overall sentiment of Bitcoin. While the report notes that many of these active whale entities are classified as short-term holders, with notable activity around local market peaks and troughs, it also highlights the long-term behavior of whales.  Related Reading: Russian Introduces A Third Form Of Currency As Putin Signs Digital Ruble Into Law Glassnode&#8217;s Trend Accumulation Score by Cohort shows that the smallest entities with less than 100 BTC have slowed down their spending over the last month.  On the other hand, the whale subdivisions with more than 1,000 BTC demonstrated divergent behavior, with those holding more than 10,000 BTC distributing and those holding between 1,000 and 10,000 BTC accumulating at a significantly higher rate. This behavior suggests that whales are actively reshuffling their holdings, moving funds internally between entities. While this can have short-term implications for the market, it also highlights the long-term potential for Bitcoin to remain a valuable asset for investors. Featured image from iStock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-25T03:08:22.000Z",
    "title": "44 Countries Now Interested in Joining BRICS As Multiploar World Takes Shape: Report",
    "url": "https://dailyhodl.com/2023/07/24/44-countries-now-interested-in-joining-brics-as-multiploar-world-takes-shape-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/four-reasons-world-needs.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/four-reasons-world-needs.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/four-reasons-world-needs.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/four-reasons-world-needs.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/four-reasons-world-needs.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/four-reasons-world-needs.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/four-reasons-world-needs.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The list of countries looking to join the global economic alliance known as BRICS is now at 44, according to one of the group&#8217;s top insiders. Anlil Sooklal, South Africa&#8217;s top diplomat in charge of relations with the bloc, tells Reuters that on top of the 22 countries that have already formally asked to join, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/24/44-countries-now-interested-in-joining-brics-as-multiploar-world-takes-shape-report/\">44 Countries Now Interested in Joining BRICS As Multiploar World Takes Shape: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]