[
  {
    "source": "CoinDesk",
    "date": "2023-07-04T15:19:41.000Z",
    "title": "Bitcoin, Ether Supply on Exchanges Fell in June: Goldman Sachs",
    "url": "https://www.coindesk.com/markets/2023/07/04/bitcoin-ether-supply-on-exchanges-fell-in-june-goldman-sachs/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Still, bitcoin miners’ inventory sales climbed to a record as they took advantage of the cryptocurrency’s strong performance, the report said."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-04T15:26:36.000Z",
    "title": "UK financial watchdog reminds crypto firms of October deadline for marketing compliance",
    "url": "https://cointelegraph.com/news/uk-financial-watchdog-reminds-crypto-firms-october-deadline-marketing-compliance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/9bbbc592-42ac-464c-82fb-d3ccf842b2ad.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Companies operating in the U.K. will have only “four routes to lawfully communicate cryptoasset promotions” in order to be in compliance with the FCA's regime.</p>\n                    <p><p>The United Kingdom’s Financial Conduct Authority, or FCA, has announced that all cryptoasset firms marketing to users in the country must be in compliance with its financial promotions regime by October 2023.</p><p>In letters dated July 4, the FCA <a href=\"https://www.fca.org.uk/publication/correspondence/letter-to-cryptoasset-firms-financial-promotions-regime.pdf\" target=\"_blank\" rel=\"noopener nofollow\">said</a> starting on Oct. 8, companies operating in the U.K. will have only “four routes to lawfully communicate cryptoasset promotions” in order to be in compliance with the financial watchdog’s regime. These legal avenues included having an authorized party approve or communicate a promotion, having a promotion created by a business registered with the FCA, or having a promotion that qualifies as exempt under the U.K.’s Financial Services and Markets Act. </p><p>According to the financial watchdog, promotions included “websites, mobile apps, social media posts and online advertising” which were “capable of having an effect in the UK” and not limited to firms based in the country. Jayson Probin, crypto financial promotions lead at the FCA, <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7081969508847869952/\" target=\"_blank\" rel=\"noopener nofollow\">suggested</a> in a July 4 LinkedIn post that firms’ failure to comply could result in criminal charges. </p><p>“We will take robust action against persons illegally promoting to U.K. consumers,” said the FCA notice. “This may include, but it is not limited to, placing firms on our warning list requesting take downs of websites, social media accounts, apps and all other promotions that are in breach, and enforcement action.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/087c44e7-1f18-43dc-ae6b-3ab922cfe046.png\"  /><figcaption style=\"text-align: center;\"><em>July 4 statement from FCA's Jayson Probin on marketing compliance. Source: <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7081969508847869952/\" target=\"_blank\" rel=\"noopener nofollow\">LinkedIn</a></em></figcaption></figure><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-law-united-kingdom-law-commission-recommends-crypto-law-reforms\"><strong><em>UK Law Commission recommends ‘distinct’ legal category for crypto</em></strong></a></p><p>The FCA first <a href=\"https://cointelegraph.com/news/crypto-ads-face-stricter-rules-including-a-referral-bonus-ban-by-fca\">announced the October deadline</a> on June 8, suggesting crypto firms adopt an approach to marketing that allows customers a “cooling-off period” to consider the risks of investing in digital assets. Once firms submit the required information for registration, the FCA said it could take up to three months to consider an application. </p><p>In addition to complying with the regulator’s marketing regime, companies must register with the FCA to “carry out crypto asset activities” in the U.K. At the time of publication, the FCA listed 42 registered <a href=\"https://cointelegraph.com/news/bitstamp-fca-list-of-registered-crypto-firms\">crypto firms in compliance</a> with its requirements, including Bitstamp, Revolt, MoonPay, and Galaxy Digital UK.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-04T15:17:38.000Z",
    "title": "Bitcoin futures premium hits 18-month high — Time to flip bullish?",
    "url": "https://cointelegraph.com/news/bitcoin-futures-premium-18-month-high-flip-bullish",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/56a6ee40-31b5-40b0-a0b0-a42671d19a6b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Bitcoin futures' premium surge is having traders ask whether this is excitement or a return to the average after a multi-month bear market.</p>\n                    <p><p>The Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) futures' premium has reached its highest level in 18 months on July 4. But traders are now questioning whether the derivatives metrics indicate \"excessive excitement\" or a \"return to the mean\" after a prolonged bear market.</p><h2>BTC price gains capped by regulators, macroeconomics</h2><p>Bitcoin's price has been trading in a narrow 4.4% range since June 22, oscillating between $29,900 and $31,160 as measured by its daily closing prices. The lack of a clear trend might be uncomfortable to some, but that is a reflection of the opposing drivers currently in play. </p><p>For instance, investor sentiment was negatively affected by the historic reversion of the U.S. Treasury yield curve, which reached its highest level on record.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/edaf23b9-7b1f-4d6b-a8e4-96a926576cba.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>U.S. 10-year / 2-year spread. Source: Real Investment Advice</em></figcaption></figure><p>The closely monitored inverted spread between the 2-year and 10-year Treasury notes has reached its highest level since 1981, standing at 1.09%. The phenomenon known as <a href=\"https://cointelegraph.com/news/us-treasury-yields-are-rising-what-does-it-mean-for-bitcoin-price\">yield curve inversion</a>, when shorter-dated Treasury notes trade at higher yields than longer-dated notes, typically precedes economic recessions.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/fed-pauses-interest-rates-but-bitcoin-options-data-still-points-to-btc-price-downside\">Fed pauses interest rates, but Bitcoin options data still points to BTC price downside</a></em></strong></p><p>On the other hand, signs of strength in the U.S. economy have reportedly <a href=\"https://finance.yahoo.com/news/us-2yr-10yr-yield-curve-122657298.html\" target=\"_blank\" rel=\"noopener nofollow\">driven</a> investors to price in the possibility of further interest rate increases by the central bank to keep inflation under control.</p><p>In addition to these macroeconomic distortions, cryptocurrency regulation has also been at the center of investors’ attention as of late. Here are just some recent examples:</p><ul><li>Kraken exchange was required by the U.S. District Court for the Northern District of California to<a href=\"https://cointelegraph.com/news/kraken-ordered-by-court-disclose-user-data-irs-tax-compliance\"> provide details of users</a> who engaged in transactions exceeding $20,000 within a calendar year;</li><li>Thailand’s Securities and Exchange Commission<a href=\"https://cointelegraph.com/news/crypto-thai-sec-bans-the-use-of-customer-crypto-assets-for-lending-and-investment\"> banned crypto lending services</a>, thus prohibiting crypto platforms from offering any form of return on deposited crypto by customers;</li><li>The Monetary Authority of Singapore announced new requirements for crypto service providers to<a href=\"https://cointelegraph.com/news/singapore-to-require-crypto-firms-to-put-user-assets-into-trusts-by-year-end\"> hold customer assets in a statutory trust</a> by year-end.</li></ul><p>So investors are probably now asking: Does Bitcoin <a href=\"https://cointelegraph.com/news/bitcoin-price-analyst-32-5-k-launchpad-btc\">have the strength to break above the $31,000 resistance</a>? Of course, one must take a potential economic recession and the increasing regulatory clampdown measures around the world into account first. </p><p>Luckily, Bitcoin futures' contract premiums can provide some clues for traders about the market's next move for reasons discussed below — as well as the costs of hedging using BTC options.</p><h2>Bitcoin futures premium reaches 18-month high</h2><p><a href=\"https://cointelegraph.com/explained/margin-trading-vs-futures-what-are-the-differences\">Bitcoin quarterly futures</a> are popular among whales and arbitrage desks. However, these fixed-month contracts typically trade at a slight premium to spot markets, indicating that sellers are asking for more money to delay settlement.</p><p>As a result, BTC futures contracts in healthy markets should trade at a 5% to 10% annualized premium — a situation known as contango, which is not unique to crypto markets.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/9abee752-f108-431f-a2f0-fc281a6d3cd7.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin 3-month futures annualized premium. Source: Laevitas</em></figcaption></figure><p>The demand for leveraged BTC longs has significantly increased over the past week as the futures contract premium jumped to 6.4% on July 3 from 3.2% one week prior. Besides reaching the highest level in 18 months, the metric has finally moved to a neutral-to-bullish area.</p><p><em><strong>Related: <a href=\"https://cointelegraph.com/news/bitcoin-only-buy-and-hold-investment-strategy-outperforms-altcoins-over-the-long-term-analysis-shows\">​​</a><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Here’s what happened in crypto today</a></strong></em></p><p>To gaugue market sentiment further, it's also helpful to look at the <a href=\"https://cointelegraph.com/learn/crypto-derivatives\">options markets</a> as the 25% delta skew can assess whether the price stagnation has made investors less optimistic. It reveals when arbitrage desks and market makers charge higher prices for protection against upside or downside movements.</p><p>In short, if traders expect a drop in Bitcoin's price, the skew metric will rise above 7%, while periods of excitement typically have a negative 7% skew.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/5b642e66-0c09-4bfb-91c6-69a4c54f523d.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin 30-day options 25% delta skew. Source: Laevitas</em></figcaption></figure><p>The 25% delta skew metric experienced a complete turnaround, indicating bullish momentum picked up on June 21 when it dropped below -7%. As Bitcoin's price climbed back above $30,000, the indicator continued to improve, culminating in \"greed\" with a negative 13% skew on July 2.</p><h2>Moderate optimism \"healthy\" for Bitcoin market</h2><p>Typically, a 6.4% futures basis and a negative 13% delta skew would be considered moderately bullish. However, considering analysts' estimating a <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-grayscale-sec\">50% chance for BlackRock's spot Bitcoin approval</a>, these metrics might be seen as conservative. But a certain amount of skepticism is indeed healthy for buyers using derivatives contracts and avoids the risk of cascading liquidations.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-etf-race-begins-has-institutional-trust-returned-to-crypto\">Bitcoin ETF race begins: Has institutional trust returned to crypto?</a></em></strong></p><p>Currently, macroeconomic factors and <a href=\"https://cointelegraph.com/news/web-3-crypto-u-s-regulatory-uncertainty-could-be-hong-kong-s-gain-yat-siu\">regulatory uncertainty</a> likely explain the suppressed optimism for BTC derivatives despite multiple ETF requests from the world's largest asset managers.</p><p>So 18-month highs aside, the current Bitcoin futures' premium remains relatively modest, compared to previous instances of excessive optimism such as the 19% in October 2021.</p><p>Thus, today's 6.3% futures premium represents a healthy market as opposed to 10% or higher indicating excessive optimism or euphoria. Moreover, traders should remain confident given that bulls have room to further leverage long positions without running excessive risk.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-04T15:30:36.000Z",
    "title": "Which Bitcoin miner has been the year’s top performer?",
    "url": "https://cryptoslate.com/insights/which-bitcoin-miner-has-been-the-years-top-performer/",
    "description": "<p>Quick Take Among Bitcoin miners, the most remarkable performance this year has come from Core Scientific, whose value has impressively soared by over 1000%. Notably, this substantial upswing came on the heels of the company filing for bankruptcy and laying out reorganization plans just two weeks prior. It is, however, important to highlight that despite [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/which-bitcoin-miner-has-been-the-years-top-performer/\">Which Bitcoin miner has been the year&#8217;s top performer?</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-04T15:30:00.000Z",
    "title": "Bitcoin Price Analysis:  Better After Testing 30862 - 5 July 2023",
    "url": "https://cryptodaily.co.uk/2023/07/bitcoin-price-analysis-better-after-testing-30862-5-july-2023",
    "description": "<p>BTC/USD Tests 30862 Target:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 5 July 2023</p>\n<p>Bitcoin (BTC/USD) retraced part of its recent pullback early in the Asian session as the pair moved back above the 31000 figure after trading as low as the 30870.63 area, representing a test of a downside price objective related to recent selling pressure around the 31333 and 31097 areas.&nbsp; The recent sell-off to the 29417.14 area represented a test of the 38.2% retracement of the appreciating range from 26165.98 to 31443.67.&nbsp; This depreciation occurred after BTC/USD rallied higher to the 30277 area, its strongest print in several trading sessions, and increased the possibility of a test of the 28604.83 area.&nbsp; The pair&rsquo;s recent print around the 31443.67 area was a twelve-month high and test of an upside price objective associated with buying pressure that strengthened around the 26637.41 area.&nbsp; Additional upside price objectives include the 31737, 32125, and 33569 areas.&nbsp; Stops are cited above additional upside price objectives around the 31674, 32043, 34531, and 34658 areas.</p>\n<p>Following recent selling pressure, areas of potential technical support and buying pressure include the 29863, 29427, 28886, 28804, 28182, 28096, and 27306 areas.&nbsp; &nbsp;Stops were also recently triggered above additional upside price objectives around the 29068, 29159, 29458, 30088, 30200, 30292, and 30477 levels.&nbsp; &nbsp;&nbsp;Technicians are closely watching to see how much technical support develops around the 28095.44 area, representing the 23.6% retracement of the historical depreciating range from 69000 to 15460.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bullishly indicating above the 100-bar MA (4-hourly)&nbsp;and&nbsp;above the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bullishly indicating above the 100-bar MA (hourly) and above the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 30556.97 and the&nbsp;50-bar MA&nbsp;(Hourly) at 30825.47.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T15:11:21.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 While the crypto market navigated the fallout from the&#160;collapse&#160;of FTX in late 2022, Ava Labs says it dodged the bullet. Ava Labs founder and CEO Emin Gün Sirer assure its stakeholders that FTX impacts very little the companies and projects operating in the Avalanche ecosystem. The company had an account on ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-04T15:27:34.000Z",
    "title": "Crypto ATM giant Bitcoin Depot goes public on Nasdaq",
    "url": "https://crypto.news/crypto-atm-giant-bitcoin-depot-goes-public-on-nasdaq/",
    "description": "Bitcoin Depot, a prominent bitcoin ATM operator, has successfully launched on the Nasdaq stock exchange, becoming the first US company in the bitcoin ATM industry to go public."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T15:30:58.000Z",
    "title": "Anarchy Presale Continues to Attract Whale Investors, Leaving Tron Crypto and Chainlink (LINK) Behind",
    "url": "https://www.crypto-news-flash.com/anarchy-presale-continues-to-attract-whale-investors-leaving-tron-crypto-and-chainlink-link-behind/?utm_source=rss&utm_medium=rss&utm_campaign=anarchy-presale-continues-to-attract-whale-investors-leaving-tron-crypto-and-chainlink-link-behind",
    "description": "One trait that earns the crypto whales their status is that they know when to move on from a project and have the nose to smell the next big-hit project from a distance. It’s this proactive instinct that gets you the big bag. Lately, there&#8217;s been a lot of herd movement in the direction of [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-04T15:26:00.000Z",
    "title": "Meta To Launch Microblogging Site; Could this Spell Doom for Twitter?",
    "url": "https://coinedition.com/meta-to-launch-microblogging-site-could-this-spell-doom-for-twitter/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Meta-To-Launch-Microblogging-Site.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Meta To Launch Microblogging Site\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Meta-To-Launch-Microblogging-Site.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Meta-To-Launch-Microblogging-Site-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Meta-To-Launch-Microblogging-Site-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Meta-To-Launch-Microblogging-Site-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Meta-To-Launch-Microblogging-Site-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Meta-To-Launch-Microblogging-Site-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Meta-To-Launch-Microblogging-Site-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Meta-To-Launch-Microblogging-Site-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Meta-To-Launch-Microblogging-Site-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Meta-To-Launch-Microblogging-Site-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Meta-To-Launch-Microblogging-Site-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Meta-To-Launch-Microblogging-Site-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Meta-To-Launch-Microblogging-Site-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Meta-To-Launch-Microblogging-Site-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Meta-To-Launch-Microblogging-Site-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Meta-To-Launch-Microblogging-Site-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In an interesting turn of events, Meta Platforms is rumored to release a microblogging app similar to Twitter. According to various reports, this new platform is set to be launched on Thursday. This reveal comes at an interesting time as Elon Musk just announced a restrictive limit to the number of Twitter posts users can [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/meta-to-launch-microblogging-site-could-this-spell-doom-for-twitter/\">Meta To Launch Microblogging Site; Could this Spell Doom for Twitter?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]