[
  {
    "source": "Cointelegraph",
    "date": "2023-11-13T07:32:19.000Z",
    "title": "Australian regulators will compel businesses to report cyberattacks: Report",
    "url": "http://cointelegraph.com/news/australian-regulators-compel-businesses-report-cyberattacks-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/f4c180c7-9750-4ce4-b2ab-aa92dba1712a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This obligation won’t be backed by a fine if the company fails to comply, and businesses will still be permitted to pay ransoms, though this is discouraged.</p>\n                    <p><p>Australian authorities will oblige local companies to be fully transparent and report any ransomware cyberattacks on their businesses. The country’s economy <a href=\"https://parlinfo.aph.gov.au/parlInfo/search/display/display.w3p;query=Id%3A%22chamber%2Fhansards%2F52172652-4b4b-4271-a888-16e6944fcccc%2F0114%22\" target=\"_blank\" rel=\"noopener nofollow\">lost</a> $2.59 billion to cybercrimes in 2021. </p><p>As <a href=\"https://www.theaustralian.com.au/subscribe/news/1/?sourceCode=TAWEB_WRE170_a&amp;dest=https%3A%2F%2Fwww.theaustralian.com.au%2Fnation%2Fpolitics%2Fransomware-crackdown-in-new-cyber-security-strategy%2Fnews-story%2F4222e027d7749b439d52bcba213481a3&amp;memtype=anonymous&amp;mode=premium&amp;v21=GROUPB-Segment-1-NOSCORE&amp;V21spcbehaviour=append\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> by the Australian on Nov. 13, the national cybersecurity strategy, which will be revealed this week, will feature a mandatory system under which local businesses must alert the government about ransomware cyberattacks. However, this obligation won’t be backed by a fine if the company fails to comply. </p><p>The companies will still be allowed to pay ransoms, although new National Cyber Security Coordinator Air Marshal Darren Goldie has publicly discouraged them from doing so. In October, Australia joined almost 40 other nations in a <a href=\"https://www.cpomagazine.com/cyber-security/40-country-pact-to-refuse-ransomware-payments-includes-us-eu/\" target=\"_blank\" rel=\"noopener nofollow\">pledge</a> not to pay ransomware demands made against government agencies.</p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/the-anatomy-of-a-cyberattack\"><strong><em>The anatomy of a cyberattack</em></strong></a></p><p>Before enacting the mandatory system, the government intends to consult with the business community on its design, as Minister for Cyber Security Clare O’Neil has specified: </p><blockquote>“We’ll create a ransomware playbook that will provide clear guidance to businesses and citizens on how to prepare for, deal with, and bounce back from ransom demands.”</blockquote><p>Ransomware attacks remain a common problem in the digital economy. In July, The United States Department of Justice (DoJ) announced the <a href=\"https://cointelegraph.com/news/crypto-us-department-of-justice-to-double-its-crypto-team\">doubling of its crypto crimes team</a> and setting the immediate focus on combatting ransomware crimes. </p><p>According to Chainalysis, wallets involved in ransomware attacks often turn to crypto mining pools to launder the funds acquired through exploits. The research firm believes there <a href=\"https://cointelegraph.com/news/hackers-use-mining-pools-as-mixers-chainalysis-report\">has been an increase</a> in value sent from ransomware wallets to mining pools. In one instance, Chainalysis highlighted that an exchange wallet address had received $158.3 million from ransomware addresses since 2018.</p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/interview-2-years-after-john-mcafee-death-wife-janice-broke-still-grieving/\"><strong><em>2 years after John McAfee’s death, widow Janice is broke and needs answers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-13T07:32:01.000Z",
    "title": "Funding rates echo $69K BTC price — 5 things to know in Bitcoin this week",
    "url": "http://cointelegraph.com/news/funding-rates-69k-btc-price-5-things-bitcoin-this-week",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/5ea8b857-241d-4574-8af8-98ac1bf272f3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin funding rates are in classic bull market territory, but can BTC price upside sustain as macro volatility triggers line up?</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) starts a new week still riding high near $37,000 as macroeconomic data returns to the fore.</p><p>The largest cryptocurrency continues to circle its highest levels in 18 months, with excitement over a possible exchange-traded fund (ETF) approval in the United States driving sentiment.</p><p>That is getting increasingly greedy, however, as according to the Crypto Fear &amp; Greed Index, conditions match those seen as BTC price action hit its current all-time highs in late 2021.</p><p>What could shake up the status quo to produce volatility in the coming days?</p><p>The odds of an external trigger are more significant this week. A raft of U.S. macro data, including the Consumer Price Index (CPI), has the potential to disrupt any sideways trading activity across risk assets.</p><p>Multiple officials from the Federal Reserve are also due to speak, while the precarious geopolitical situation in the Middle East grinds on in the background.</p><p>On the institutional side, meanwhile, the future looks firmly bullish for Bitcoin — ahead of the prospective ETF approval, the Grayscale Bitcoin Trust (GBTC) is closing in on parity with net asset value.</p><p>Can Bitcoin markets stay the course and avoid a significant retracement? Cointelegraph takes a look at conditions in the weekly rundown of BTC price volatility catalysts waiting in the wings.</p><h2>Funding rates flash warning with BTC price stuck at $37,000</h2><p>Bitcoin’s weekly close set a new 18-month high on Nov. 12, but what followed was not the gains seen after <a href=\"https://cointelegraph.com/news/uptober-40k-btc-price-5-things-bitcoin-this-week\">other recent closes</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/467f8e80-f108-4fa2-8b56-9a57cb221a13.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><p>During the Asia trading session, BTC/USD instead fell below $37,000, sticking firmly to the trading range in place throughout the weekend, per data from <a href=\"https://subscription.cointelegraph.com/\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a>.</p><p>Monitoring the situation, popular trader and analyst Credible Crypto suggested that this would soon change. The reason, he said, was open interest (OI), now at multi-day highs and apt to spark volatility.</p><p>“OI has ramped right back up off the lows which means more positions to squeeze out,” part of an X post <a href=\"https://twitter.com/CredibleCrypto/status/1723940133903241282/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">read</a>.</p><p>Credible Crypto gave a target of $36,600 for a potential local low, with another post adding that Bitcoin was “very close” to further upside.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/7fb020e9-300b-49d2-a3f9-f6ebc1120848.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD chart with OI. Source: Credible Crypto/X</em></figcaption></figure><p>Countering the optimism over short-term market action was funding rates. These were not only positive, but at their highest since Bitcoin’s November 2021 all-time highs, indicating an overall disadvantage of being long BTC at current levels.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Bitcoin’s funding rates are at the highest level since last ATH. <a href=\"https://t.co/mMlnJleQ5u\">pic.twitter.com/mMlnJleQ5u</a></p>&mdash; Thomas Kralow (@TKralow) <a href=\"https://twitter.com/TKralow/status/1723820963584741442?ref_src=twsrc%5Etfw\">November 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“Pretty elevated levels of funding rates across the board,” fellow trader Daan Crypto Trades <a href=\"https://twitter.com/DaanCrypto/status/1723770635212706108\" target=\"_blank\" rel=\"noopener nofollow\">commented</a> alongside data from monitoring resource <a href=\"https://www.coinglass.com/FundingRate\" target=\"_blank\" rel=\"noopener nofollow\">CoinGlass</a>. </p><blockquote>“Even though this isn't always an immediate reason for a flush, ideally this goes back to normal after some more ranging. Good to note that during strong up trends, this can stay this way for weeks or even months.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/a83e50db-c9c3-4ef8-b482-b84f04fc7aa2.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto funding rates as of 7am UTC, Nov. 13 (screenshot). Source: CoinGlass</em></figcaption></figure><p>Also noting the conspicuous state of play on funding, popular analyst Caue Oliveira told traders to exercise caution.</p><p>“This value suggests that optimism is prevailing in the market, driving a high number of futures contracts to bet on an increase in price,” he wrote in an <a href=\"https://cryptoquant.com/insights/quicktake/654e5954ddc9c407ec14bfdf-Funding-rates-at-the-highest-level-since-Bitcoins-last-ATH\" target=\"_blank\" rel=\"noopener nofollow\">Quicktake market update</a> for on-chain analytics platform CryptoQuant on Nov. 10.</p><blockquote>“However, this setup is dangerous as it can demonstrate excessively bullish sentiment and a price contraction could trigger a cascade of liquidations.”</blockquote><h2>CPI comes amid fresh U.S. gov't shutdown turmoil</h2><p>A classic macro setup marks the third week of November — CPI leads a deluge of data prints which have sparked risk asset volatility in the past.</p><p>Due on Nov. 14 for the month of October, the CPI print is keenly watched by inflation monitors, with the Producer Price Index (PPI) following a day later.</p><p>Various Fed officials will also take to the stage in speaking engagements both during and after the data releases, providing insights into the Fed’s perspective on inflationary forces in real time.</p><p>“Important week for inflation and the Fed,” financial commentary resource The Kobeissi Letter summarized while uploading significant macro diary dates to X.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Key Events This Week:<br><br>1. October CPI Inflation data - Tuesday<br><br>2. October PPI Inflation data - Wednesday<br><br>3. Retail Sales data - Wednesday<br><br>4. Philly Fed Manufacturing data - Thursday<br><br>5. Building Permits data - Friday<br><br>6. Total of 14 Fed speaker events<br><br>Important week for…</p>&mdash; The Kobeissi Letter (@KobeissiLetter) <a href=\"https://twitter.com/KobeissiLetter/status/1723680231150489610?ref_src=twsrc%5Etfw\">November 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Popular trader Skew meanwhile noted expectations pointing to receding inflation, this despite some unwelcome surprises in October’s data prints.</p><p>This should notionally provide a tailwind for crypto markets, but as Cointelegraph <a href=\"https://cointelegraph.com/news/bitcoin-cpi-btc-price-tackling-26-8-k\">reported</a>, Bitcoin’s reaction to even larger target misses has become muted this year.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">CPI &amp; PPI this coming week <br>CPI - Tuesday 14th Nov<br>PPI - Wednesday 15th Nov <br><br>Expectations are for a considerable decline of entrenched inflation ~ less inflation expected <a href=\"https://t.co/PrQ0Rsf1Ab\">pic.twitter.com/PrQ0Rsf1Ab</a></p>&mdash; Skew Δ (@52kskew) <a href=\"https://twitter.com/52kskew/status/1723692012422004960?ref_src=twsrc%5Etfw\">November 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Adding to the mix is another familiar wildcard — a partial U.S. government shutdown in the making. While so far avoided this year, the need to reach a deal on spending in Congress is once again becoming tangible ahead of the Nov. 17 deadline.</p><p>Should it occur, the shutdown would only be the fourth in the U.S. in the past ten years.</p><h2>Altcoins in focus as crypto capital inflows return</h2><p>With a potential ETF approval firmly on the radar for crypto market participants, capital inflows into the industry are being keenly monitored.</p><p>Buyer interest forms a key item on the list for a bull market comeback, and the about turn in inflows is already attracting mainstream attention.</p><p>“For the first time in years, crypto markets are beginning to see tons of new liquidity,” Kobeissi wrote in a <a href=\"https://twitter.com/KobeissiLetter/status/1723703879517229542\" target=\"_blank\" rel=\"noopener nofollow\">dedicated X post</a>.</p><p>It noted that the combined crypto market cap has increased $600 billion since November 2022, in the aftermath of the FTX meltdown and Bitcoin’s cycle lows of $15,600.</p><p>“That's a +75% jump in one year while Bitcoin is up +120% over the last year,” it added. </p><blockquote>“This comes after years of consistent outflows from crypto markets. One thing we have seen multiple times in the past? A return of liquidity always causes historic moves in crypto.”</blockquote><p>It is not just Bitcoin showing potential — altcoin markets are waking up, traders and analysts say.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Altcoins?src=hash&amp;ref_src=twsrc%5Etfw\">#Altcoins</a> are flying. It will be epic. <a href=\"https://t.co/bSAw0nKKL0\">pic.twitter.com/bSAw0nKKL0</a></p>&mdash; Stockmoney Lizards (@StockmoneyL) <a href=\"https://twitter.com/StockmoneyL/status/1722520202821148917?ref_src=twsrc%5Etfw\">November 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Despite Bitcoin’s dominance of the overall crypto market cap still being strong, analyst CryptoCon suggested not to take this as a sign of comparative altcoin weakness.</p><p>“Some people have told you to completely ignore Altcoins because Bitcoin dominance is going up. And as you might have noticed, this is a critical mistake,” he <a href=\"https://twitter.com/CryptoCon_/status/1723360722028007640\" target=\"_blank\" rel=\"noopener nofollow\">told</a> X subscribers at the weekend.</p><p>An accompanying chart showed BTC price behavior in each year of its halving cycle, with altcoins likewise exhibiting specific reactions.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/0b0cf8b9-b455-469a-b4b2-985eae39e224.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Halving Cycles Theory chart. Source: CryptoCon/X</em></figcaption></figure><p>With Bitcoin due an “early” cycle top in mid-2024, per CryptoCon, altcoins are unlikely to underdeliver.</p><p>“I think it is now very likely that Altcoins have already bottomed for the cycle, and those who did nothing will have to buy higher,” he continued. </p><blockquote>“Imagine being told, ‘Ignore Altcoins at their bottoms and only buy Bitcoin which is already up.’ That's happened this year. 2024 is coming, Altcoins are ready to get even stronger!”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/6e15d819-b175-47f6-904a-b34fcb39d51f.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin % market cap dominance chart. Source: TradingView</em></figcaption></figure><h2>GBTC discount passes two-year lows</h2><p>A yardstick for the return of Bitcoin to the mainstream spotlight — despite the absence of retail interest — is its largest institutional investment vehicle.</p><p>The Grayscale Bitcoin Trust (GBTC) is fast approaching parity to net asset value (NAV), the Bitcoin spot price. </p><p>GBTC traded with an implied share price higher than BTC/USD in the past, but the past two years has seen the premium become a discount which at one point neared 50%.</p><p>Now, the discount to NAV is just 10.35% — its <a href=\"https://cointelegraph.com/news/first-bitcoin-etf-trades-gbtc-discount-69k-btc-price\">smallest</a> since August 2021.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/526aec04-64d8-4753-b9fc-d2b4f07cfb23.png\"  /><figcaption style=\"text-align: center;\"><em>GBTC premium vs. asset holdings vs. BTC/USD chart (screenshot). Source: CoinGlass</em></figcaption></figure><p>Commenting on the phenomenon, William Clemente, co-founder of market research firm Reflexivity, tied GBTC’s reversal of fortune to a prospective ETF go-ahead.</p><p>“Looks like the market is pricing in very high probability of BTC ETF approval at this point,” he <a href=\"https://twitter.com/WClementeIII/status/1722394985637585308\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> last week.</p><p>Grayscale continues to petition to gain the <a href=\"https://cointelegraph.com/news/btc-price-2-week-highs-grayscale-sec-bitcoin-etf-win\">right to convert</a> GBTC to a Bitcoin spot ETF.</p><h2>Crypto investors stay greedy</h2><p>There is no ignoring the desire to squeeze profits after a record long crypto bear market.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/pre-etf-btc-price-crash-150k-2025-bitcoin-forecasts\">Pre-ETF BTC price 'crash' or $150K in 2025? Bitcoin forecasts diverge</a></em></strong></p><p>This continues to be aptly displayed by the <a href=\"https://alternative.me/crypto/fear-and-greed-index/\" target=\"_blank\" rel=\"noopener nofollow\">Crypto Fear &amp; Greed Index</a>, the classic market sentiment gauge now at levels last seen in November 2021.</p><p>While not at its extreme levels yet, the Index unequivocally shows that the average crypto investor is nearing a state of irrational exuberance.</p><p>Fear &amp; Greed stood at 72/100 on Nov. 13, having hit 74/100 on Nov. 6.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/ff9cbcc5-0cb7-4445-8c39-bcca6529b6ad.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto Fear &amp; Greed Index (screenshot). Source: Alternative.me</em></figcaption></figure><p>Commenting on market psychology at the start of the month, popular trader Pentoshi reminded X readers that extreme levels of both fear and greed can offer the “best opportunities” for those able to time and exploit market volatility at extreme sentiment levels.</p><p>Typically, when the Index is either below 10/100 or above 90/100, crypto markets are in line for a snap trend reversal.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Now is a good time to share this again<br><br>Fear and greed<br><br>Markets force participation, they force you to act <a href=\"https://t.co/f1nJOyGaLS\">https://t.co/f1nJOyGaLS</a></p>&mdash; Pentoshi  euroPeng  (@Pentosh1) <a href=\"https://twitter.com/Pentosh1/status/1723816548614218144?ref_src=twsrc%5Etfw\">November 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-11-13T07:33:52.000Z",
    "title": "THORChain becomes second-largest DEX in daily trading volume",
    "url": "https://crypto.news/thorchain-becomes-second-largest-dex-in-daily-trading-volume/",
    "description": "THORChain has become the second-largest decentralized exchange (DEX) while its native token, RUNE, registered a slight decline over the past day. According to data provided by DeFi Llama, THORChain’s daily trading volume has reached $334.3 million, surpassing PancakeSwap and making&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-13T07:34:54.000Z",
    "title": "Mysterious Wallet Transfers 17.8 Million MATIC To Coinbase – What’s Going On?",
    "url": "https://www.newsbtc.com/news/mysterious-wallet-transfers-17-8-million-matic-to-coinbase-whats-going-on/",
    "description": "An mysterious wallet surfaced from the shadows and masterminded a significant transfer of 17,895,970 MATIC—which translates to a staggering 14,789,937 USD—directly into Coinbase, in a crypto twist that sent shockwaves through the digital landscape. The surge in significant transaction volume has caused the MATIC price to rise above $0.80 for the first time since July. The market capitalization of MATIC has surged by 62% during the last four weeks due to increased turnover and acquisition by whales. Related Reading: Boom! Cronos Unleashes 57% Weekend Explosion, Beating All In The Top 100 Crypto Ranking MATIC Mysterious Financial Maneuver Unveiled During this enigmatic financial maneuver, the cryptocurrency universe witnessed Polygon&#8217;s MATIC token commence a bullish journey. It became more complicated as MATIC rose above the $0.75 resistance level, only to face a strong resistance at the $0.89 support level. At the time of writing, MATIC was trading at $0.88, up 8.5% in the last 24 hours, and tallied an impressive 27% rally in the last seven days, data from CoinMarketCap shows. MATIC seven-day price action. Source: CoinMarketCap The recent increase in value is occurring in conjunction with a revitalized cryptocurrency market, propelled by a rising sense of confidence surrounding Bitcoin. Nevertheless, the surge in MATIC&#8217;s price cannot be only attributed to general market sentiment. Empirical evidence indicates that the aggregation of large investors and significant collaborations have played a crucial role in driving MATIC&#8217;s breakout. Institutional and whale demand has picked up strongly, with Bitcoin seeing an 80% increase in the volume of transactions of over $100k, Ethereum 170%, and Polygon over 3,800% compared to 30 days ago. pic.twitter.com/ElM1CDZ3wA — IntoTheBlock (@intotheblock) November 11, 2023 According to IntoTheBlock, an on-chain analytics company, institutional and whale demand for the cryptocurrency space has significantly increased. In this sense, during the past 30 days, the amount of transactions involving over $100,000 has increased by 3,800% according to Polygon, an Ethereum scaling solution. Source: IntoTheBlock Based on data provided by the analytics platform Santiment, it has been seen that large-scale investors, commonly referred to as whales, with holdings ranging from 100,000 to 10 million MATIC tokens, have accumulated an excess of 42 million more tokens during the latter part of October. Strong Buying Activity Related Reading: Solana Breaks Past $54 On Steady Price Momentum – Will SOL Hit $60 This Month? In a 24-hour timeframe, a total of 161 transactions involving MATIC were executed, each surpassing a value of $100,000. This notable buying activity serves as a testament to the strong desire of significant stakeholders to accumulate MATIC holdings. The accumulation of assets has had a direct impact on the favorable movement of prices. Source: Santiment Increased Whale Appetite The surge in huge transaction volume has caused the MATIC price to rise above $0.80 for the first time since July this year. Because of whales&#8217; accumulation and increased activity over the last 30 days, MATIC&#8217;s market value has increased by more than 60%. 🚨 19,896,435 #MATIC (16,443,201 USD) transferred from unknown wallet to #Coinbasehttps://t.co/dCSA4N6H3m — Whale Alert (@whale_alert) November 12, 2023 Meanwhile, Coinbase has received over 55 million Polygon [MATIC] tokens, according to three different posts made by Whale Alert on X (previously Twitter). The transfers were coming from unidentified addresses, according to the whale tracking handle. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Freepik"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-13T07:15:07.000Z",
    "title": "Musk said that the most profitable mining platform in the past three years is here",
    "url": "https://www.crypto-news-flash.com/musk-said-that-the-most-profitable-mining-platform-in-the-past-three-years-is-here/?utm_source=rss&utm_medium=rss&utm_campaign=musk-said-that-the-most-profitable-mining-platform-in-the-past-three-years-is-here",
    "description": "<img width=\"2988\" height=\"1992\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Musk.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Musk.png 2988w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Musk-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Musk-1024x683.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Musk-768x512.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Musk-1536x1024.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Musk-2048x1365.png 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/Musk-104x69.png 104w\" sizes=\"(max-width: 2988px) 100vw, 2988px\" />CGMD miner unveils its user-friendly cloud mining platform, simplifying crypto mining for investors, especially beginners. CGMD Miner, one of the world’s leading hash-rate providers, announces the public release of its revolutionary cloud mining platform, offering crypto investors a convenient and efficient entry into cryptocurrency mining. Cryptocurrencies have transformed how we generate income, and mining digital [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-13T07:28:11.000Z",
    "title": "XLM Breaking Above $0.135 Could Lead to a Rally, Says Analyst",
    "url": "https://coinedition.com/xlm-breaking-above-0-135-could-lead-to-a-rally-says-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/STELLAR-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/STELLAR-4.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/STELLAR-4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/STELLAR-4-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/STELLAR-4-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/STELLAR-4-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/STELLAR-4-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/STELLAR-4-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/STELLAR-4-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/STELLAR-4-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/STELLAR-4-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/STELLAR-4-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/STELLAR-4-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/STELLAR-4-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/STELLAR-4-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/STELLAR-4-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/STELLAR-4-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto Tony, a popular cryptocurrency trader and analyst, predicted in an X post today that Stellar (XLM) could rally soon. In his post, the trader shared that he is keeping an eye on the $0.135 mark on XLM’s chart. More specifically, Crypto Tony is waiting for the altcoin’s price to flip this key level into [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/xlm-breaking-above-0-135-could-lead-to-a-rally-says-analyst/\">XLM Breaking Above $0.135 Could Lead to a Rally, Says Analyst</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-13T07:10:15.000Z",
    "title": "Celestia (TIA) Traders Could Be Presented With An Entry Soon: Analyst",
    "url": "https://coinedition.com/celestia-tia-traders-could-be-presented-with-an-entry-soon-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Tezos Narobi Deployment Yet to Impact on XTZ Price Action\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The popular trader and analyst Crypto Tony revealed in an X post today that he is waiting for the perfect entry for Celestia (TIA). In his post, he shared that he is waiting for a wave 4 consolidation before he buys into the altcoin again. TIA has been performing strong lately and continued its positive [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/celestia-tia-traders-could-be-presented-with-an-entry-soon-analyst/\">Celestia (TIA) Traders Could Be Presented With An Entry Soon: Analyst</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]