[
  {
    "source": "Decrypt",
    "date": "2023-08-04T21:44:58.000Z",
    "title": "Twitter User Has @Music Handle 'Ripped Away' by Elon Musk",
    "url": "https://decrypt.co/151378/twitter-music-handle-ripped-away-elon-musk",
    "description": "First \"@X\" and now \"@Music.\" Popular Twitter handles are being seized by the newly rebranded X."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-04T21:47:30.000Z",
    "title": "The absurd AI mania is coming to an end",
    "url": "https://cointelegraph.com/news/ai-manias-coming-end",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/da999e2b-16e7-4b0f-8ad0-b50f83ec62f0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>AI large language models raised over $25 billion in the first half of 2023. The industry is starting to look like a bubble that’s about to burst.</p>\n                    <p><p>Venture capital interest in cryptocurrency has decreased significantly since the bull run of 2021. At $2.3 trillion in market capitalization, every VC wanted a piece of the industry.</p><p>The picture is now very different. Another dominant force in the market has attracted the vast majority of venture funding over the past year: artificial intelligence large language models (LLMs).</p><p>However, AI has already started showing signs of weaknesses that indicate a giant bubble ready to pop. By the time most people realize it, it will be too late.</p><h2>The beginning of AI domination</h2><p>AI dominance in the VC market started on Nov. 30, 2022, with the launch of OpenAI’s ChatGPT. From OpenAI’s perspective, it couldn’t have chosen a better time.</p><p>With the collective failures of <a href=\"https://cointelegraph.com/news/everything-that-s-happened-with-celsius-and-alex-mashinsky-so-far\">Celsius</a>, <a href=\"https://cointelegraph.com/news/voyager-s-1b-deal-with-binance-us-moves-forward-after-deal-with-feds\">Voyager</a>, <a href=\"https://cointelegraph.com/news/3ac-cofounder-rejects-jurisdiction-bankruptcy-court-renounced-us-citizenship\">Three Arrows Capital</a>, <a href=\"https://cointelegraph.com/news/analysts-assess-the-aftermath-of-the-terra-luna-collapse-cointelegraph-interview\">Terra</a> and <a href=\"https://cointelegraph.com/news/ftx-collapse-the-crypto-industry-s-lehman-brothers-moment\">FTX</a>, 2022 was a crypto nightmare. The VCs desperately wanted a way out of the seemingly toxic industry to park their cash elsewhere.</p><p>Precisely 19 days after the collapse of FTX, LLMs opened up an entirely new space for VCs to venture into. ChatGPT onboarded a million users in just five days, showing unprecedented demand in the market. </p><p>That was the opening companies like Google, Microsoft, Facebook and other tech behemoths needed to jump headfirst into the chaos searching for opportunities. </p><p>Microsoft acquired a significant chunk of OpenAI and launched the Bing AI chatbot. Google launched Bard, leveraging Google AI and DeepMind, its own version of GPT. Facebook ramped up its speed on developing Llama.</p><p>While these major companies compete on core products, thousands of smaller companies have launched to get a piece of the pie. As I mentioned above, VCs went all in on AI startups. </p><p>Jasper AI, a GPT-based copywriting platform, <a href=\"https://techcrunch.com/2022/10/18/ai-content-platform-jasper-raises-125m-at-a-1-7b-valuation/\" target=\"_blank\" rel=\"noopener nofollow\">raised</a> $125 million at a $1.5 billion valuation. Anthropic <a href=\"https://www.reuters.com/markets/deals/alphabet-backed-ai-startup-anthropic-raises-450-million-funding-freeze-thaws-2023-05-23/\" target=\"_blank\" rel=\"noopener nofollow\">raised</a> $450 million, backed by Google. Inflection AI, building Chatbot Pi, <a href=\"https://www.reuters.com/technology/inflection-ai-raises-13-bln-funding-microsoft-others-2023-06-29/\" target=\"_blank\" rel=\"noopener nofollow\">raised</a> $1.3 billion at a $4 billion valuation. Mistral AI <a href=\"https://techcrunch.com/2023/06/13/frances-mistral-ai-blows-in-with-a-113m-seed-round-at-a-260m-valuation-to-take-on-openai/\" target=\"_blank\" rel=\"noopener nofollow\">raised</a> $113 million in seed funds with no products or proof-of-concept. In the entire first half of 2023, AI startups <a href=\"https://news.crunchbase.com/venture/vc-funding-falling-report-data-q2-2023-global/\" target=\"_blank\" rel=\"noopener nofollow\">raised</a> over $25 billion. </p><p>A survey conducted by PitchBook <a href=\"https://pitchbook.com/media/press-releases/new-pitchbook-survey-finds-majority-of-venture-capitalists-have-invested-in-ai\" target=\"_blank\" rel=\"noopener nofollow\">found</a> that 74% of surveyed investors had invested in at least one artificial intelligence/machine learning startup. And 14% of them claimed to have invested in more than six such startups. </p><p>This and other such surveys show that AI has climbed the ladder from being a dormant research field to a lucrative marketplace in just a few months.</p><h2>GPU shortage</h2><p>The question one should ask is: Where exactly are these millions of dollars going? In any other space, a significant chunk of raised funds goes into research and development and customer acquisition. However, with AI, the focus is entirely elsewhere: graphics processing units.</p><p>These AI startups are spending the vast majority of raised funds on acquiring high-performing GPUs from companies like Nvidia and AMD. Taking the huge demand and a broken supply chain, we are looking at a critical GPU shortage right now. </p><p>An industry insider <a href=\"https://gpus.llm-utils.org/nvidia-h100-gpus-supply-and-demand/\" target=\"_blank\" rel=\"noopener nofollow\">analyzed</a> the current demand for GPUs, and all around, the market wants about 432,000 H100 GPUs. “At approx $35k a piece, that’s about $15b worth of GPUs [excluding Chinese companies like ByteDance, Baidu and Tencent].”</p><p>To put the numbers into perspective, GPT-4 required around 10,000–25,0000 A100s. Meta, Tesla and Stability AI combined <a href=\"https://www.stateof.ai/compute\" target=\"_blank\" rel=\"noopener nofollow\">use</a> around 34,000 A100s.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Who’s getting how many H100s and when is top gossip of the valley rn <a href=\"https://t.co/AxarseOmg9\">https://t.co/AxarseOmg9</a></p>&mdash; Andrej Karpathy (@karpathy) <a href=\"https://twitter.com/karpathy/status/1686880098417508353?ref_src=twsrc%5Etfw\">August 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>AI startups are trying to out-pay their competitors to acquire these GPUs. In the long run, the GPU supply and demand will come back on par, probably by the end of 2024, as some experts predict. </p><p>The question, therefore, is whether it’s worth it to invest in companies that are essentially not building a product moat but fighting to acquire tools.</p><h2>Lack of IP</h2><p>While some startups are building a core product, the vast majority of AI platforms are lurking in the periphery, using API to siphon off services from OpenAI.</p><p>AI startups like Jasper AI use the OpenAI API to provide services. Much like what we saw with the recent Reddit API fiasco, products that overly rely on APIs have zero control or ownership of intellectual property. </p><p>And that is becoming clearer every day.</p><p>Jasper recently laid off a chunk of its workforce as demand for AI platforms decreases. Another AI startup, Mutiny, laid off around 30% of its employees. </p><p>Recent data shows a <a href=\"https://cointelegraph.com/news/chatgpt-sees-traffic-fall-10-in-june-after-initial-rush-from-users\">decline in interest</a> in ChatGPT for the first time since it hit the market. Other AI chatbots like Bard or Bing aren’t doing well either, a clear signal of market saturation as the novelty factor wears off.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/948fdce3-1ccb-42fb-9118-782ae76029b8.jpg\"  /><figcaption style=\"text-align: center;\">ChatGPT and other major platforms are seeing decreased interest. Credit: Chandler Nguyen</figcaption></figure><p>There are also reports of increased inaccuracies in GPT-4. A Stanford study <a href=\"https://arxiv.org/pdf/2307.09009.pdf\" target=\"_blank\" rel=\"noopener nofollow\">found</a> that GPT-3.5 and GPT-4’s performance on numerous tasks has gotten “substantially worse over time.”</p><p>While core products like GPT and DeepMind are important in leading the AI race, it’s clear that the market has gained an unhealthy amount of weight, causing it to form a bubble. All it needs is a slight pinch in the form of some industry reports or a couple of bankruptcies to burst the bubble.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Chris Coll-Beswick</strong> is the founder and managing partner of Transcend Labs, a Web3 incubation platform. He’s also a mentor and judge for Stanford’s AI &amp; Web3 Research Lab Association. Prior to Transcend Labs, he founded Yeswetrust and Calibre Capital. He holds an undergraduate degree from the University of Sheffield.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-04T21:45:00.000Z",
    "title": "CBDC supporter likely in White House next term, crypto divide not red v. blue: Grayscale",
    "url": "https://cointelegraph.com/news/cbdc-supporter-likely-white-house-next-term-crypto-divide-not-red-v-blue-grayscale",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/97690f82-9f99-49a2-9ac2-29f39c60ceb9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The crypto asset manager took a look at the leading U.S. presidential candidates’ positions and did not see a partisan divide.</p>\n                    <p><p>The next president of the United States is likely to be in favor of central bank digital currency (CBDC), crypto asset manager Grayscale observed in a post on its website, as the current frontrunners in both political parties have expressed their support for it. Neither seems to like Bitcoin.</p><p>Joe Biden and Donald Trump currently have healthy leads in the 2024 presidential polls among members of their respective parties. Both of them are “favorable toward exploring CBDC,” echoing conclusions drawn by Forbes earlier this year.</p><p>Trump has called Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) a “scam,” and Biden’s position was intuited from his support for a 30% tax on Bitcoin mining. Grayscale did not comment on Trump’s overall attitude toward crypto and digital assets. It can be recalled that he is at, a minimum, <a href=\"https://cointelegraph.com/news/new-trump-nfts-sell-out-on-day-one\">favorably disposed toward nonfungible tokens</a>. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Joe Biden&#39;s got laser-eyes on his coffee cup  <br>Someone in the White House is a <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> HODL agent <br> <a href=\"https://t.co/I5q5uO8zDL\">pic.twitter.com/I5q5uO8zDL</a></p>&mdash; Bitcoin Archive (@BTC_Archive) <a href=\"https://twitter.com/BTC_Archive/status/1687414861498548224?ref_src=twsrc%5Etfw\">August 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Biden’s “Executive Order on Ensuring Responsible Development of Digital Assets“ was taken as evidence of his general support. Another White House document, the 2023 Economic Report of the President, <a href=\"https://cointelegraph.com/news/crypto-fud-industry-outraged-as-white-house-report-slams-crypto\">was not as complimentary toward crypto</a>, however.  </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/2024-us-presidential-candidates-crypto-stance\">7 presidential candidates have dropped clues about their crypto stance</a></em></strong></p><p>The candidates polling in second place, Democrat Robert Kennedy, Jr. and Republican Ron DeSantis, <a href=\"https://cointelegraph.com/news/republican-candidate-end-president-biden-war-on-bitcoin-if-elected\">have both been vocal</a> about <a href=\"https://cointelegraph.com/news/rfk-jr-will-back-us-dollar-with-bitcoin-if-president\">their support for cryptocurrency</a> and opposition to CBDC.</p><p>Trump and DeSantis are not the only pro-crypto candidates in the crowd of Republican contenders. Vivek Ramaswamy, to whom Grayscale ascribes 7% support (compared to Trump’s 63%), is also seen as being pro-Bitcoin and anti-CBDC.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/7629e019-deae-4ced-9c5c-db5184480a34.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Ron DeSantis' economic platform. Source: Ron DeSantis for president</em></figcaption></figure><p>Possibly the most ardent crypto supporter on either side is Republican Miami Mayor Francis Suarez, who <a href=\"https://cointelegraph.com/news/miamicoin-disbursement-to-fund-a-rental-assistance-program-says-mayor-suarez\">made his love for the technology</a> known far before campaigning began. His presidential ambitions have been <a href=\"https://nymag.com/intelligencer/2023/06/miami-mayor-francis-suarez-launches-improbable-2024-bid.html\" target=\"_blank\" rel=\"noopener nofollow\">called</a> “improbable,” however.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/powers-on-biden-blockchain-benefits-adoption/\">Powers On… Biden accepts blockchain technology, recognizes its benefits and pushes for adoption</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-04T21:53:34.000Z",
    "title": "New York Attorney General probing Digital Currency Group in relation to Genesis Global Capital : Report",
    "url": "https://cryptoslate.com/new-york-attorney-general-probing-digital-currency-group-in-relation-to-genesis-global-capital-report/",
    "description": "<p>The New York Attorney General (NYAG) is currently probing Digital Currency Group (DCG), according to reports from Bloomberg on Aug. 4. In recent months, the regulator has reportedly been investigating the DCG over its dealings with its subsidiary Genesis Global Capital. The investigation is said to extend to Genesis&#8217; past chief risk officer, Michael Patchen, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/new-york-attorney-general-probing-digital-currency-group-in-relation-to-genesis-global-capital-report/\">New York Attorney General probing Digital Currency Group in relation to Genesis Global Capital : Report</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-04T22:00:11.000Z",
    "title": "Facebook Owner Meta May Launch Chatbot ‘Personas’ Next Month, Report",
    "url": "https://news.bitcoin.com/facebook-owner-meta-may-launch-chatbot-personas-next-month-report/",
    "description": "<img width=\"768\" height=\"433\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2274874195-768x433.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Facebook Owner Meta May Launch Chatbot ‘Personas’ Next Month, Report\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2274874195-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2274874195-1024x578.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2274874195-768x433.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2274874195-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2274874195-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2274874195-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2274874195.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />U.S. tech giant Meta is preparing to launch multiple chatbots powered by artificial intelligence (AI) as early as September. According to an article quoting knowledgeable sources, the company seeks to encourage user engagement on its social media platforms with the chatbots that could also be used to collect more user data. Meta Seeks to Seize [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-04T22:00:52.000Z",
    "title": "Curve Finance Exploiter Returns 61,000 ETH After Protocol’s Stern Warning",
    "url": "https://www.newsbtc.com/news/curve-finance-exploiter-returns-61000-eth-after-protocols-stern-warning/",
    "description": "In a surprising turn of events, the hacker known as the &#8220;Alchemix/Curve Finance Exploiter&#8221; has returned a total of 4,819.55 alteth and 6106 Ethereum (ETH) to Alchemix Finance, as reported by the journalist Colin Wu.   The hacker, who had gained unauthorized access to the protocol, had earlier demanded that the Alchemix Finance team confirm the address to which they wanted the stolen funds returned. Curve Finance Breach Ends On Positive Note Curve Finance has announced the return of stolen funds worth over $60 million, which were taken in a recent exploit.  As reported by NewsBTC, the protocol had issued a statement on Etherscan, urging the hackers to return the funds, and offered a 10% reward for their return. The hackers have agreed to return the funds, keeping 10% of the stolen amount. Related Reading: Will Bitcoin Rebound Anytime Soon? Here’s What On-Chain Data Says The attack on Curve Finance, which took place on July 30th, significantly impacted the decentralized finance (DeFi) sector and raised concerns about its security.  The hack targeted several pools on Curve Finance, withdrawing more than $47 million from various DeFi projects. This led to a drop in the value of Curve DAO (CRV), prompting its founder, Michael Egorov, to sell off the asset to save it. Following the attack, Curve Finance has taken measures to improve its security, including updating its contracts and implementing stricter security protocols. The protocol has also called on the hacker to return the stolen funds and offered a reward for their cooperation. The hack had caused significant concern among the cryptocurrency community. Still, the Alchemix Finance team&#8217;s swift response and the hacker&#8217;s decision to return the stolen funds demonstrate the importance of protocols taking swift action to protect their users and assets. CRV Sees Strong Trading Volume Despite Recent Hack Curve Finance is one of the largest decentralized exchanges (DEXs) in the cryptocurrency market, with a total value locked (TVL) of $2.349 billion, according to data from DeFiLlama.  The exchange has a market capitalization of $540.35 million and a fully diluted valuation of $2.035 billion, making it a significant player in the DeFi ecosystem. Related Reading: Bitstamp Makes Highly Anticipated XRP Announcement, But Does It Live Up To The Hype? The Curve Finance token (CRV) price currently stands at $0.62, with a 24-hour trading volume of $177.09 million. The staked amount of CRV is $432.64 million, representing approximately 80.07% of the market capitalization of the protocol. The data from DeFiLlama highlights the significant role that Curve Finance plays in the DeFi sector, with a substantial TVL and a high level of staked tokens. The liquidity available for trading on the exchange is also significant, with a high annualized trading volume and fees. The revenue generated by Curve Finance demonstrates the potential for decentralized exchanges to become profitable businesses, offering a viable alternative to centralized exchanges.  Overall, the data from DeFiLlama highlights the significant role that Curve Finance plays in the DeFi ecosystem and the potential for decentralized exchanges to become profitable businesses. With its high TVL, staked tokens, and liquidity, Curve Finance is well-positioned to continue its growth and become a leader in the DeFi sector. Featured image from Unsplash, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-04T21:50:00.000Z",
    "title": "Hoskinson Denies His Involvement With the Controversial ‘Ether Speech’",
    "url": "https://coinedition.com/hoskinson-denies-his-involvement-with-the-controversial-ether-speech/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Charles-Hoskinson-Calls-Out-The-Block-for-Its-Snide-Reporting.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Charles Hoskinson Calls Out The Block for Its Snide Reporting\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Charles-Hoskinson-Calls-Out-The-Block-for-Its-Snide-Reporting.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Charles-Hoskinson-Calls-Out-The-Block-for-Its-Snide-Reporting-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Charles-Hoskinson-Calls-Out-The-Block-for-Its-Snide-Reporting-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Charles-Hoskinson-Calls-Out-The-Block-for-Its-Snide-Reporting-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Charles-Hoskinson-Calls-Out-The-Block-for-Its-Snide-Reporting-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Charles Hoskinson, the creator of Cardano and one of Ethereum&#8217;s co-founders, has taken to Twitter to refute claims of his involvement in the controversial “Ether speech.” The accusations suggested that Ethereum received favorable treatment from regulators, while other cryptocurrencies faced scrutiny. The allegations stemmed from a follower sharing a screenshot of emails allegedly sent by [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/hoskinson-denies-his-involvement-with-the-controversial-ether-speech/\">Hoskinson Denies His Involvement With the Controversial ‘Ether Speech’</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-04T22:01:33.000Z",
    "title": "Payments Giant Western Union Collaborates With $75,000,000,000 Bank on a US CBDC Pilot Study",
    "url": "https://dailyhodl.com/2023/08/04/payments-giant-western-union-collaborates-with-75000000000-bank-on-a-us-cbdc-pilot-study/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/CBDC-a-Surveillance-Tool.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/CBDC-a-Surveillance-Tool.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/CBDC-a-Surveillance-Tool.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/CBDC-a-Surveillance-Tool.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/CBDC-a-Surveillance-Tool.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/CBDC-a-Surveillance-Tool.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/CBDC-a-Surveillance-Tool.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Payments giant Western Union is collaborating with a $75 billion bank to study the effects of a US central bank digital currency (CBDC). According to a new press release, Western Union and Philippines-based BDO Unibank are working together to explore how the implementation of a US CBDC, or a digital asset issued and backed by [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/04/payments-giant-western-union-collaborates-with-75000000000-bank-on-a-us-cbdc-pilot-study/\">Payments Giant Western Union Collaborates With $75,000,000,000 Bank on a US CBDC Pilot Study</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]