[
  {
    "source": "Cointelegraph",
    "date": "2023-09-28T20:43:14.000Z",
    "title": "Valkyrie will offer exposure to Ether futures as SEC delays spot Bitcoin ETF",
    "url": "https://cointelegraph.com/news/valkyrie-exposure-ether-futures-etf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/329f85bd-0b25-43fd-a9fb-513009967a45.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Some analysts have speculated the SEC will announce decisions or delays on crypto exchange-traded funds before Sept. 30 in anticipation of a U.S. government shutdown.</p>\n                    <p><p>Asset management firm Valkyrie will begin offering exposure to Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) futures to United States investors through its existing Bitcoin Strategy exchange-traded fund, or ETF.</p><p>A Valkyrie spokesperson told Cointelegraph on Sept. 28 that the firm's Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) Strategy ETF will allow investors access to ETH and BTC futures \"under one wrapper\", making it one of the first firms to do so amid several pending applications with the U.S. Securities and Exchange Commission (SEC). Starting on Oct. 3, the fund's name will be updated to the Valkyrie Bitcoin and Ether Strategy ETF.</p><p>At the time of publication, the SEC had not published a proposed rule change allowing listing a new Ether futures ETF on the Nasdaq Stock Exchange. However, the commission <a href=\"https://www.sec.gov/files/rules/sro/nasdaq/2023/34-98606.pdf\" target=\"_blank\" rel=\"noopener nofollow\">released</a> an order regarding \"additional analysis\" over the listing of the Valkyrie Bitcoin Fund — a spot BTC ETF.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The jockeying has begun in full as Valkyrie announcing they are buying Ether futures for <a href=\"https://twitter.com/search?q=%24BTF&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTF</a> today (ahead of formal name change on Tue). In related news, hearing that some issuers are ready to launch Monday morning, unclear how many yet, but at least a couple. Game on. <a href=\"https://t.co/I1FiVU58RZ\">https://t.co/I1FiVU58RZ</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1707474550143754523?ref_src=twsrc%5Etfw\">September 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Valkyrie <a href=\"https://cointelegraph.com/news/breaking-valkyrie-files-for-ether-futures-etf-with-the-sec\">filed an application</a> with the SEC on Aug. 16 for a fund not offering a direct investment in Ether but through ETH futures contract. The firm also offers a Bitcoin Miners ETF, tracking securities of companies that derive their revenue or profits from crypto mining, and was also one of the first companies in the U.S. to <a href=\"https://cointelegraph.com/news/valkyrie-bitcoin-futures-linked-etf-launches-on-nasdaq-with-share-prices-dropping-3-in-first-hour\">launch an ETF</a> tied to BTC futures in 2021.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/breaking-valkyrie-files-for-ether-futures-etf-with-the-sec\"><strong><em>Breaking: Valkyrie files for Ether futures ETF with the SEC</em></strong></a></p><p>Bloomberg Intelligence analyst James Seyffart had speculated that Ether futures ETFs <a href=\"https://cointelegraph.com/news/ether-futures-etfs-launch-next-week-government-shutdown\">would begin trading</a> in the first week of October partly in response to a potential U.S. government shutdown. Should members of Congress be unable to vote on a bill funding the government into the next fiscal year with enough time for U.S.President Joe Biden to sign it into law by Sept. 30, the SEC and many other federal agencies will be reduced to a skeleton crew.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">UPDATE: Okay here we go. Those other 7 Spot <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a>  filings (which includes <a href=\"https://twitter.com/BlackRock?ref_src=twsrc%5Etfw\">@BlackRock</a> as many have poitned out) that are  due for decision in mid October are getting their delay orders. Starting to trickle in. First up <a href=\"https://twitter.com/ValkyrieFunds?ref_src=twsrc%5Etfw\">@ValkyrieFunds</a>! <a href=\"https://t.co/xywjwLlojT\">pic.twitter.com/xywjwLlojT</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1707487127498334248?ref_src=twsrc%5Etfw\">September 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>To date, the SEC has not <a href=\"https://cointelegraph.com/news/nasdaq-refiles-valkyrie-spot-bitcoin-etf-coinbase-surveillance-partner\">approved any spot crypto ETF</a> for trading in the United States, but many experts have suggested that position could change following Grayscale Investments winning a review of its spot BTC ETF in court. Valkyrie, along with several other firms including BlackRock, have applications pending for spot crypto ETFs.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethereum-is-woefully-undervalued-but-growing-more-powerful-defi-dad-hall-of-flame/\"><strong><em>Ethereum is ‘woefully undervalued’ but growing more powerful: DeFi Dad, Hall of Flame</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-28T20:45:35.000Z",
    "title": "Valkyrie to offer partial Ethereum futures ETF Friday, VanEck prepares to follow suit",
    "url": "https://cryptoslate.com/valkyrie-to-offer-partial-ethereum-futures-etf-friday-vaneck-prepares-to-follow-suit/",
    "description": "<p>Valkyrie Investments is set to become the first provider of a U.S.-based ETF that includes Ethereum futures, according to reports from FOX Business on Sept. 28. A separate tweet from Eleanor Terret, the author of that piece, suggests that the fund will make the relevant change on Sept. 29. Valkyrie itself has not confirmed that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/valkyrie-to-offer-partial-ethereum-futures-etf-friday-vaneck-prepares-to-follow-suit/\">Valkyrie to offer partial Ethereum futures ETF Friday, VanEck prepares to follow suit</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T21:05:41.000Z",
    "title": "Crypto Exchange FTX Founder Faces Potential Lengthy Sentence as Trial Begins",
    "url": "https://www.cryptopolitan.com/ftx-founder-faces-potential-lengthy-sentence/",
    "description": "In a prelude to the high-profile trial of Sam Bankman-Fried, the founder of the now-bankrupt cryptocurrency exchange FTX, U.S. District Judge Lewis Kaplan made it clear that Bankman-Fried could potentially face a &#8220;very long sentence&#8221; if convicted on charges of fraud and conspiracy. The trial is set to begin next week, and the judge&#8217;s comments ... <a title=\"Crypto Exchange FTX Founder Faces Potential Lengthy Sentence as Trial Begins\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ftx-founder-faces-potential-lengthy-sentence/\" aria-label=\"More on Crypto Exchange FTX Founder Faces Potential Lengthy Sentence as Trial Begins\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T20:48:38.000Z",
    "title": "Ripple abandons Fortress Trust acquisition amid security incident fallout",
    "url": "https://www.cryptopolitan.com/ripple-abandons-fortress-trust-acquisition/",
    "description": "Financial technology firm Ripple has decided to cancel its acquisition of Fortress Trust, a move that has sent shockwaves through the financial and cryptocurrency industries. Ripple CEO Brad Garlinghouse announced the unexpected decision on September 28, just days after the initial acquisition announcement on September 8. The decision comes in the wake of a significant ... <a title=\"Ripple abandons Fortress Trust acquisition amid security incident fallout\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-abandons-fortress-trust-acquisition/\" aria-label=\"More on Ripple abandons Fortress Trust acquisition amid security incident fallout\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T20:42:02.000Z",
    "title": "How Tech Giants are Sharing in Africa’s Digital Future With AI",
    "url": "https://www.cryptopolitan.com/africas-digital-future-with-ai/",
    "description": "Digitalization is becoming a major catalyst for growth across Africa. The continent is increasingly attracting attention and even investments from leading tech companies as efforts to unlock the next-level digital and technological future of Africa take a new shape among African countries.&#160; One key technology that has taken the spotlight in this journey is Artificial ... <a title=\"How Tech Giants are Sharing in Africa’s Digital Future With AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/africas-digital-future-with-ai/\" aria-label=\"More on How Tech Giants are Sharing in Africa’s Digital Future With AI\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-28T21:00:51.000Z",
    "title": "ETH Price Rally On The Horizon: Ether Futures ETFs Poised For October 3 Approval",
    "url": "https://www.newsbtc.com/analysis/eth/eth-price-rally-on-the-horizon-ether-futures-etfs-poised-for-october-3-approval/",
    "description": "In an unexpected turn of events, Ethereum (ETH) Futures Exchange Traded Funds (ETFs) are drawing closer to fruition, potentially becoming available for trading as early as October 3, which could be a significant catalyst for ETH price. Renowned Bloomberg ETF expert Erich Balchunas recently shared insights indicating that the Securities and Exchange Commission (SEC) might expedite its approval process to avoid potential disruptions caused by a looming government shutdown. SEC Considers Fast-Tracking Ether ETFs A government shutdown, which could go into effect if Congress and President Biden fail to reach an agreement on a budget or a short-term continuing resolution by September 30, entails suspending most federal government functions.  Related Reading: Bitcoin, XRP Price Receive Boost Following This Coinbase Announcement The implications of a shutdown extend beyond its duration, as services provided by the U.S. Department of Housing and Urban Development (HUD) may experience disruptions and delays, affecting citizens both during the shutdown and while federal agencies strive to regain momentum once it ends. NBC reports that a government shutdown is increasingly likely if Congress does not take swift action. While Congress convened on Wednesday, progress in breaking the impasse has been limited.  President Joe Biden expressed optimism, stating that a shutdown is not inevitable and urging House Republicans to fulfill their responsibilities by funding the government.  In light of these developments, Erich Balchunas believes that recent actions taken by the SEC indicate its intention to expedite decision-making processes, as evidenced by the postponement of several spot Bitcoin ETFs weeks ahead of schedule.  To potentially preempt the impact of an impending shutdown, the SEC may aim to accelerate the launch schedule for Ethereum ETFs. If this occurs, ETF issuers would likely need to submit their final prospectus this week to allow for an effective launch as early as October 2. Supporting Balchunas&#8217; perspective, Bloomberg Intelligence analyst James Seyffart concurred:  Nothing yet but watching for filings to indicate Ethereum Futures ETFs are indeed being accelerated for launch next week. We expect a lot more filings from the SEC today as they continue to clear their desks as much as possible before the shut down. Normalcy is out the window These updates reinforce the notion that Ether futures ETFs are likely to receive approval immediately, aligning with a recent Bloomberg report that posited a 90% chance of their launch in October. However, until the SEC officially announces its decision, the crypto community remains on tenterhooks, eagerly anticipating the potential groundbreaking debut of Ether Futures ETFs by October 3. ETH Price Shows Resilience With Upward Momentum  Ethereum (ETH) has exhibited a significant upward movement in the past week, marking a positive trend extending into the past 24 hours.  Over the past seven days, ETH has recorded a gain of over 4%, while within the last 24 hours, it has seen a rise of more than 3%. As of the latest update, ETH is currently trading at $1,662. This notable surge in price comes at a crucial juncture, with the monthly close approaching.  Related Reading: Under-The-Radar Altcoin Soars Over 260% – Here’s Why A favorable outcome for Ethereum in these time frames could potentially set the stage for bullish price action in October, particularly with the prospective approval of Ether Futures Exchange Traded Funds (ETFs). Although breaking the overall downtrend structure has proven challenging for bullish investors, a close above the $1,650 mark would position the cryptocurrency favorably for a bullish October. This is a critical resistance level to overcome, and surpassing it would instill renewed optimism in the market. Featured image from iStock, chart from TradingView.com "
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-28T21:01:00.000Z",
    "title": "IOHK Highlights Cardano’s Milestone on the Sixth Anniversary",
    "url": "https://coinedition.com/iohk-highlights-cardanos-milestone-on-the-sixth-anniversary/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Cardano-100-Price-Tag.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano $100 Price Tag\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Cardano-100-Price-Tag.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/Cardano-100-Price-Tag-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Cardano-100-Price-Tag-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Cardano-100-Price-Tag-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Cardano-100-Price-Tag-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/Cardano-100-Price-Tag-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>InputOutputHK (IOHK), the leading blockchain infrastructure research and engineering company behind the Cardano project, has taken to X (formerly Twitter) to celebrate the project’s sixth anniversary. IOHK congratulated the Cardano Community for the growth it has experienced over the years and the milestones achieved while thanking everyone involved in the project for their dedication. IOHK [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/iohk-highlights-cardanos-milestone-on-the-sixth-anniversary/\">IOHK Highlights Cardano’s Milestone on the Sixth Anniversary</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]