[
  {
    "source": "Cointelegraph",
    "date": "2023-12-14T04:29:56.000Z",
    "title": " Bitcoin ETF applicants will have to ‘bend the knee’ on cash redemption model ",
    "url": "https://cointelegraph.com/news/bitcoin-etf-applicants-bend-the-knee-cash-redemption-model",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYzFkZmRmZTItZDQ1Ny00MWVkLTljMWMtYmU3Nzc2NTRiMDhjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The SEC is pushing Bitcoin ETF issuers down the cash create route for creation and redemptions, but BlackRock has other ideas.</p>\n                    <p><p>As spot Bitcoin exchange-traded fund (ETF) issuers iron out details of their filings with the U.S. securities regulator, it appears that the SEC is steadfast in demanding a “cash” redemption model rather than alternative model proposed by other issuers, such as BlackRock.</p><p>On Dec. 14 finance lawyer Scott Johnsson <a href=\"https://twitter.com/SGJohnsson/status/1735067054636507257\" target=\"_blank\" rel=\"noopener nofollow\">said</a> that ETF applicant Invesco has become the latest to bend the knee to using a cash creation and redemption model for its ETF. </p><p>Seyffart also noted that Bitwise has been set for cash-only creates/redeems since Dec. 4, “though for months they had in-kind or cash in their documents before this.” </p><p><a href=\"https://cointelegraph.com/news/bitcoin-etf-applicants-bend-the-knee-cash-redemption-model\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T04:39:33.000Z",
    "title": "Smart AI Model Boosts Heart Checks – Finding Heartbeat Issues Made Easy",
    "url": "https://www.cryptopolitan.com/smart-ai-model-boosts-heart-checks/",
    "description": "Researchers at Scripps Research have unveiled an AI model poised to revolutionize the screening process for atrial fibrillation (AFib). This heart condition, characterized by irregular and rapid heartbeats, poses a significant risk of stroke and heart failure. The newly developed AI model showcases the potential to identify subtle variations in normal heartbeats, providing a more [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T04:20:54.000Z",
    "title": "Brian May Proclaims 2023 as the Last Year of Human Songwriting in the Era of AI Dominance",
    "url": "https://www.cryptopolitan.com/brian-may-2023-last-human-songwriting-ai/",
    "description": "legendary Queen guitarist and astrophysicist Brian May predicts that 2023 will mark the culmination of an era where discerning whether a song was crafted by a human or artificial intelligence (AI) becomes nearly impossible. May explores the growing importance of AI in the music industry in a conversation with Rosie Bennet for the Fret Not [&#8230;]"
  }
]