[
  {
    "source": "Crypto Daily",
    "date": "2023-08-03T19:00:00.000Z",
    "title": "Hacker Behind 2016 Bitfinex Attack Pleads Guilty at Court",
    "url": "https://cryptodaily.co.uk/2023/08/hacker-behind-2016-bitfinex-attack-pleads-guilty-at-court",
    "description": "<p>Ilya Lichtenstein admitted to laundering the $4.5B worth of Bitcoin stolen during the 2016 Bitfinex attack; his wife Heather Morgan also pleaded guilty.</p>\nSeven-year-long Investigation Comes to an End\n<p>According to the CNBC report, resident of New York City Ilya Lichtenstein admitted to being the original hacker behind the 2016 Bitfinex attack in a federal court in Washington, D.C on July 3. On the same day, his wife Heather Morgan also pleaded guilty to the counts of money laundering and conspiracy related to the hack.</p>\n<p>The cyberattack deprived Bitfinext of almost 120 BTC, which was worth $70 million at the time and has since risen to the price of $4.5 billion. It took the US Department of Justice (DOJ) seven years to seize the stolen funds and the person responsible for the hack.&nbsp;</p>\n\n<p>&ldquo;Bitfinex diligently worked with the U.S. Department of Justice to identify the perpetrators of the hack, recover the stolen bitcoin, and bring the hackers to justice,\" said an external spokesperson for Bitfinex. \"After seven years, those efforts have come to fruition.&rdquo;</p>\n\nThe Bizarre Couple Caught for Money Laundering\n<p>Ilya Lichtenstein and his wife Heather Morgan, also known as &ldquo;Razzlekhan&rdquo; (the name she uses to publish her comedy rap videos) were arrested on charges of money laundering and theft in connection to the 2016 Bitfinex hack in February 2022. However, the Department of Justice didn&rsquo;t accuse the couple of being the original hackers behind the attack at that time.&nbsp;</p>\n<p>Morgan proclaimed to be a cybercrime expert specializing in social engineering on her LinkedIn, while Lichtenstein had technical background in coding and data analysis. These facts suggested that the couple had enough expertise to pull off the hack, even though many didn&rsquo;t believe it due to the image of eccentric personas the two projected on the Internet.</p>\nMost of the Bitfinex Funds Recovered\n<p>At the time of Lichtenstein's and Morgan&rsquo;s arrest, the DOJ was able to recover 94,000 BTC linked to the hack, the sum now equivalent to around $3.6 billion. It was discovered that in early 2017, Lichtenstein &ldquo;began to move a portion of the Bitcoin&rdquo; stolen during the Bitfinex attack &ldquo;in a series of small, complex transactions across multiple accounts and platforms.&rdquo; The shuffling process, which involved a large number of transactions, was aimed at obscuring the path of the stolen money.</p>\n<p>Last month, the crypto exchange recovered another part of its lost funds: $312,219 in cash and 6.9 in Bitcoin Cash (BCH) worth around $1951 today. Apparently, the United States Department of Homeland Security got control of the sum in 2022 after the culprit&rsquo;s arrest.&nbsp;</p>\n<p>The couple is now facing up to 25 years in prison. Following their arrest in 2022, Netflix announced it might create a series about the case.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T19:05:38.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the series of delisting fuelled by the ongoing United States SEC crackdown on major crypto platforms. Basically, it&#8217;s crypto winter in the summer as it stands. How do Cardano Price Prediction analysts steer in this turbulent crypto weather? ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T18:57:15.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s Solana price is $22.86 with a 24-hour trading volume of $618,897,839. Solana is up 0.92% in the last 24 hours. The current CoinMarketCap ranking is #9, with a live market cap of $9,473,881,101. It has a circulating supply of 418,890,490 SOL coins and the max. supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T18:52:48.000Z",
    "title": "PayPal faces investor concern over Q2 margins; executives express optimism for year-end growth",
    "url": "https://www.cryptopolitan.com/paypal-faces-investor-concern-over-q2-margins/",
    "description": "PayPal Holdings is facing increased scrutiny from investors as shares fell 7% in extended trading on Wednesday, driven by disappointment in the company&#8217;s quarterly operating margin. Even though PayPal executives have forecasted improvements towards the end of the year, the uncertainty surrounding the company&#8217;s financial performance is sparking concern. PayPal&#8217;s margins underwhelm investors PayPal&#8217;s adjusted ... <a title=\"PayPal faces investor concern over Q2 margins; executives express optimism for year-end growth\" class=\"read-more\" href=\"https://www.cryptopolitan.com/paypal-faces-investor-concern-over-q2-margins/\" aria-label=\"More on PayPal faces investor concern over Q2 margins; executives express optimism for year-end growth\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-03T19:04:48.000Z",
    "title": "Twitter user unveils possible mastermind behind BALD rug pull",
    "url": "https://crypto.news/twitter-user-unveils-possible-mastermind-behind-bald-rug-pull/",
    "description": "A Twitter user has shared his suspicion that a past associate could be the mysterious figure behind the recent BALD meme coin rug pull"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-03T18:55:44.000Z",
    "title": "Curve’s founder sells 7.5 million CRV, settles $3 million debt on Aave",
    "url": "https://crypto.news/curves-founder-sells-7-5-million-crv-settles-3-million-debt-on-aave/",
    "description": "Michael Egorov, the founder of Curve, has sold an additional 7.5 million CRV in an over-the-counter (OTC) transaction and paid a $3 million debt in USDT on Aave"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-03T19:00:09.000Z",
    "title": "Binance CEO Shares Details Of $20 Million Scam Attempt",
    "url": "https://www.newsbtc.com/binance/binance-ceo-shares-details-of-20-million-scam-attempt/",
    "description": "Binance CEO, Changpeng ‘CZ’ Zhao has recently provided details on a failed $20 million scam attempt in a bid to keep the crypto community on alert for future occurrences. Crypto Scammers Are &#8220;So Good Now,&#8221; Binance CEO Says In a tweet on August 2, Changpeng Zhao described a recent scam attempt as &#8220;clever,&#8221; stating that it was &#8220;luckily&#8221; prevented as the bad actors in the crypto space seem to have gotten better.  Related Reading: Curve DAO (CRV) Price Recovery Post-Exploit: What Would Be A Realistic Scenario? Specifically, the Binance CEO drew attention to how these scammers now generate addresses with identical starting and ending letters as other wallet addresses. Using these new addresses, they then proceed to impersonate other network participants and swindle unsuspecting crypto users. Technically, these kinds of scams are referred to as  “zero-transfer phishing attacks.” I want to share this (luckily) unsuccessful, but very clever and close scam incident from yesterday 👇. Saved $20m. Hope it may also save you one day. The scammers are so good now they generate addresses with the same starting and ending letters, which is what most people check… https://t.co/DFpdX8aNay — CZ 🔶 Binance (@cz_binance) August 2, 2023 Changpeng Zhao noted that these scams are particularly effective as most crypto users only confirm the first and last characters of an address when conducting transactions. In fact, he stated that most wallet designs exclude the middle parts of addresses in an attempt to offer a better user interface to users Asides from creating similar wallet addresses, the Binance CEO mentioned that these scammers would send “dust transactions” so they could be registered in their targets’ transaction history. To explain, dust refers to a minute amount of cryptocurrency, usually valued at less than a cent, and cannot be traded on any exchange.  With the scammer’s address now present in their target’s transaction history, one can unknowingly transfer assets to these bad actors, especially if the impersonated address is one they constantly transact with. &#160; Total crypto market cap valued at $1.13 trillion on the 4-hour chart &#124; Source: TOTAL chart on Tradingview.com Fast Response Helped Thwart Zero-Transfer Phishing Attack Changpeng Zhao stated that a zero phishing attack happened to a veteran crypto operator on Aug 1 in which they transferred $20 million worth of USDT to the wrong address. For context, the original wallet address was 0xa7Bf48749D2E4aA29e3209879956b9bAa9E90570, while the phishing address was 0xa7B4BAC8f0f9692e56750aEFB5f6cB5516E90570. Luckily, the operator detected the scam quickly, and Binance was able to officially request for Tether to freeze the stolen USDT. The stablecoin operator responded promptly by blacklisting the wallet to prevent any further deposit or withdrawal.  Related Reading: Ethereum DeFi Coins Plunge As Curve Concerns Threaten Major Market Crash The Binance CEO rounded off his tweet by stating that a fast reaction was vital to reclaiming users&#8217; funds in these kinds of attacks. However, he did state that the assets recovery may take some time as the sender would have to complete a number of processes, including submitting a police report.  It is no news that the crypto space is riddled with heists, scams, and attacks which result in the loss of millions of dollars yearly. And these crypto scams are considered one of the major plagues in the crypto space. According to data from Certik Security, crypto scams and hacks claimed over $313 million in just Q2 2023 alone. Another report from TRM Labs in June 2023 said that over $9 billion was lost to various scams and frauds in 2022. A huge portion (around $7.8 billion) of this figure was lost to Ponzi schemes alone, TRM added.  Featured image from Binance, chart from Tradingview"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-03T18:45:16.000Z",
    "title": "Sam Bankman-Fried Pushes Back Against Witness-Tampering Allegations in New Court Filing Amid Threat of Detention",
    "url": "https://dailyhodl.com/2023/08/03/sam-bankman-fried-pushes-back-against-witness-tampering-allegations-in-new-court-filing-amid-threat-of-detention/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/sam-back-new-court.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/sam-back-new-court.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/sam-back-new-court.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/sam-back-new-court.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/sam-back-new-court.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/sam-back-new-court.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/sam-back-new-court.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Indicted former FTX head Sam Bankman-Fried is denying witness-tampering allegations levied against him by federal prosecutors. According to a new court filing, Bankman-Fried’s attorneys say that federal prosecutors are mischaracterizing their client’s intentions for giving a New York Times reporter writings of his former romantic partner Caroline Ellison, who is an expected witness in the case [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/03/sam-bankman-fried-pushes-back-against-witness-tampering-allegations-in-new-court-filing-amid-threat-of-detention/\">Sam Bankman-Fried Pushes Back Against Witness-Tampering Allegations in New Court Filing Amid Threat of Detention</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-03T18:41:56.000Z",
    "title": "Coinbase Releases Bridge for Its Ethereum Layer-2 Solution, Sets Launch Date for the Mainnet",
    "url": "https://dailyhodl.com/2023/08/03/coinbase-releases-bridge-for-its-ethereum-layer-2-solution-sets-launch-date-for-the-mainnet/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/04/protocol-tapped-by-coinbase.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/04/protocol-tapped-by-coinbase.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/04/protocol-tapped-by-coinbase.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/04/protocol-tapped-by-coinbase.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/04/protocol-tapped-by-coinbase.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/04/protocol-tapped-by-coinbase.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/04/protocol-tapped-by-coinbase.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Top US-based crypto exchange platform Coinbase is announcing the launch of a bridge for its Ethereum (ETH) layer-2 scaling solution. The project, called Base, is powered by the blockchain-scaling solution Optimism (OP) and is also slated to launch its mainnet on August 9th. To help kick off the launch of the bridge, Base is throwing [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/03/coinbase-releases-bridge-for-its-ethereum-layer-2-solution-sets-launch-date-for-the-mainnet/\">Coinbase Releases Bridge for Its Ethereum Layer-2 Solution, Sets Launch Date for the Mainnet</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]