[
  {
    "source": "CoinDesk",
    "date": "2023-11-16T10:41:31.000Z",
    "title": "Bitcoin Ordinals Token Ecosystem Emerges as Latest Crypto Play, Led by ORDI Hype",
    "url": "https://www.coindesk.com/tech/2023/11/16/bitcoin-ordinals-token-ecosystem-emerges-as-latest-crypto-play-led-by-ordi-hype/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Overall capitalization of such tokens has risen over 21% in the past 24 hours, outperforming most other token sectors."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-16T10:40:01.000Z",
    "title": "Do Kwon's Appeal in Fake Passport Case Denied by Montenegro High Court ",
    "url": "https://www.coindesk.com/policy/2023/11/16/do-kwons-appeal-in-fake-passport-case-denied-by-montenegro-high-court/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The founder of Terraform Labs was sentenced to four months in prison, and faces extradition following the completion of his sentence."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-16T10:50:49.000Z",
    "title": "Ferrari’s Bitcoin acceptance is major market win, says CoinFlip CEO",
    "url": "http://cointelegraph.com/news/ferrari-bitcoin-acceptance-market-win",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/2d6a9df3-0fbb-47f3-8099-16d9654f3d83.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>It’s not a matter of will big-name companies follow Ferrari’s lead to adopt Bitcoin, but when, according to CoinFlip CEO Ben Weiss.</p>\n                    <p><p>Ferrari’s decision to allow U.S. residents to <a href=\"https://cointelegraph.com/news/ferrari-to-accept-crypto-payments-in-the-us\">buy its cars in exchange for cryptocurrencies</a> like Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) has become one of the biggest market wins in 2023, according to the CEO of the Bitcoin ATM operator CoinFlip.</p><p>Ferrari has been aware of the growing demand from clients for alternative payment solutions and decided to support dealers in meeting these clients’ requests, the representative said, adding:</p><blockquote>“The source of the cryptocurrencies will be proven, and volatility risks associated with exchange rates will be eliminated. Dealers — and ultimately Ferrari — will receive payments in traditional currency and will not be managing cryptocurrencies directly.”</blockquote><p>Ferrari <a href=\"https://bitpay.com/blog/ferrari-now-accepts-crypto-payments-via-bitpay/\" target=\"_blank\" rel=\"noopener nofollow\">added</a> the crypto payment support by integrating BitPay, a major crypto payment firm <a href=\"https://cointelegraph.com/news/amc-theatres-mobile-app-accepts-dogecoin-shiba-inu-and-more\">serving global brands like AMC Theaters</a>, the electronics retailer <a href=\"https://cointelegraph.com/news/online-electronics-shop-newegg-to-accept-shiba-inu-crypto-during-holidays\">Newegg</a> and others. According to BitPay, Ferrari customers in 10 U.S. locations — including Washington and Las Vegas — can now exchange their crypto for a top Ferrari car model like SF90 Stradale, Ferrari Purosangue, Daytona SP3 and more.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/49a087f0-51f7-4339-ae6c-da0520093a7c.png\"  /><figcaption style=\"text-align: center;\"><em>SF90 Stradale as one of Ferrari models that can be bought with Bitcoin. Source: BitPay</em></figcaption></figure><p>According to CoinFlip CEO Ben Weiss, Ferrari’s move to accept crypto payments is significant for the market. “Their notable reputation can increase adoption, cryptocurrency value, and consumer confidence,” Weiss said, suggesting that their crypto move is also likely to spark interest from lawmakers to develop clear regulatory frameworks.</p><p>Weiss believes that Ferrari’s push will eventually push more traditional global firms to accept Bitcoin as payment. He said:</p><blockquote>“It’s not a matter of will big-name companies follow Ferrari’s footsteps, but when. Bitcoin is the best performing asset of the decade proving it’s here to stay and encouraging other big names like PayPal and BlackRock to embrace digital assets.”</blockquote><p>Ferrari’s decision to adopt cryptocurrency payment has come in line with aspects related to environmental, social and corporate governance, the firm’s representative told Cointelegraph. </p><p>“The analysis of data regarding the environmental impact associated with cryptocurrencies has been a fundamental part of our decision-making process to adopt cryptocurrencies — in line with our objective to become carbon neutral by 2030,” the spokesperson stated.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/honda-denies-accepting-crypto-payment\"><strong><em>Crypto payment option for Honda cars only works via third-party platform</em></strong></a></p><p>According to industry analysts, the share of <a href=\"https://cointelegraph.com/news/bitcoin-clean-energy-usage-exceeds-50-percent-tesla-accepting-btc-payments\">Bitcoin mining energy from renewable sources</a> exceeded 50% as of mid-September 2023. However, Elon Musk’s Tesla still hasn’t adopted the BTC payment option after <a href=\"https://cointelegraph.com/news/bitcoin-loses-6-in-an-hour-after-tesla-drops-payments-over-carbon-concerns\">halting such payments</a> in 2021 over carbon concerns.</p><p>“Tesla still accepts Dogecoin, and Elon continues to be a proponent of crypto,” CoinFlip CEO Weiss noticed, adding that the Tesla founder could also boost crypto adoption by introducing it to the social media platform X (formerly Twitter). He said:</p><blockquote>“Elon also has significant experience with payments from his PayPal days and if Elon decides to bring payments to X, as many expect, crypto would be a natural payment rail.”</blockquote><p>In a publicly accessible doc titled “What You Need To Know If You Use Bitcoin,” Tesla <a href=\"https://www.tesla.com/assets/pdf/BTC_What_You_Need_To_Know_en_US.pdf\" target=\"_blank\" rel=\"noopener nofollow\">listed</a> several facts about the cryptocurrency, including that Bitcoin payments are irreversible.</p><p>“That’s just the way the Bitcoin network works — no do-overs. So please make sure you enter the correct Bitcoin price in the amount field and the correct Bitcoin address in the recipient field,” the document reads.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/5050-bitcoin-for-5-dollars-2009-helsinki-claim-to-crypto-fame-crypto-city-guide/\"><strong><em>5,050 Bitcoin for $5 in 2009: Helsinki’s claim to crypto fame</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-16T10:55:56.000Z",
    "title": "Regulatory victory for Paxos as Singapore approves US dollar stablecoin plan",
    "url": "https://cryptoslate.com/regulatory-victory-for-paxos-as-singapore-approves-us-dollar-stablecoin-plan/",
    "description": "<p>Paxos has secured an in-principle approval (IPA) from the Monetary Authority of Singapore (MAS) for Paxos Digital Singapore. This approval marks an expansion of a US dollar stablecoin platform into the Asian market, aligning with MAS&#8217; forthcoming stablecoin framework. The news comes after several new tokenization pilots were released in the region to increase commercial [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/regulatory-victory-for-paxos-as-singapore-approves-us-dollar-stablecoin-plan/\">Regulatory victory for Paxos as Singapore approves US dollar stablecoin plan</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-16T11:01:13.000Z",
    "title": "Grayscale’s strategy rocks crypto ETFs: SEC in a tight spot",
    "url": "https://www.cryptopolitan.com/grayscales-strategy-rocks-crypto-etfs-sec/",
    "description": "Grayscale Investments has employed an unconventional strategy in its bid to secure approval for a spot Ether ETF. ETF analyst James Seyffart has characterized Grayscale’s application for an Ether futures ETF as a tactical maneuver aimed at pressuring the U.S. Securities and Exchange Commission (SEC) into approving its spot Ether ETF. The SEC’s dilemma to ... <a title=\"Grayscale&#8217;s strategy rocks crypto ETFs: SEC in a tight spot\" class=\"read-more\" href=\"https://www.cryptopolitan.com/grayscales-strategy-rocks-crypto-etfs-sec/\" aria-label=\"More on Grayscale&#8217;s strategy rocks crypto ETFs: SEC in a tight spot\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-16T11:00:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-16T10:49:54.000Z",
    "title": "Cryptocurrency’s role in crime investigated by US house subcommittee",
    "url": "https://www.cryptopolitan.com/cryptocurrencys-role-in-crime-investigated/",
    "description": "The United States House Financial Services Subcommittee on Digital Assets, Financial Technology, and Inclusion convened a hearing titled &#8220;Crypto Crime in Context: Breaking Down the Illicit Activity in Digital Assets&#8221; on November . The bipartisan hearing emphasized the importance of collaboration and regulation in addressing the use of blockchain technology in criminal activities. Chair French ... <a title=\"Cryptocurrency&#8217;s role in crime investigated by US house subcommittee\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cryptocurrencys-role-in-crime-investigated/\" aria-label=\"More on Cryptocurrency&#8217;s role in crime investigated by US house subcommittee\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-16T10:46:45.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now: how will this affect our Cosmos Price Prediction? How ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-16T10:40:44.000Z",
    "title": "Gulf Energy and Binance partnership to showcase Thailand Blockchain potential",
    "url": "https://www.cryptopolitan.com/gulf-energy-and-binance-partnership/",
    "description": "Binance, one of the world&#8217;s largest cryptocurrency exchanges, is set to establish a presence in Thailand through a joint venture with Gulf Energy Development, a prominent local energy giant. The collaboration, named Gulf Binance, has received approval from the Securities and Exchange Commission (SEC) and is set to commence operations on an invitation-only basis. This ... <a title=\"Gulf Energy and Binance partnership to showcase Thailand Blockchain potential\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gulf-energy-and-binance-partnership/\" aria-label=\"More on Gulf Energy and Binance partnership to showcase Thailand Blockchain potential\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-16T10:45:08.000Z",
    "title": "Bitcoin Price Is Up Despite SEC Delay, Is The Spot ETF Decision Priced In Already?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-spot-etf-priced-in/",
    "description": "On Wednesday, the Bitcoin price rallied toward $38,000 amid expectations of the United States Securities and Exchange Commission (SEC) finally approving the first Spot BTC ETF. The regulator would end up exercising its right to delay its decision further, something that has usually been bearish for the price. However, the Bitcoin price continued to show strength, suggesting that a Spot Bitcoin ETF approval might be priced into the market already. SEC Delays Spot BTC ETFs The SEC announced on Wednesday that it had decided to further delay its decision on Spot Bitcoin ETF filings; in particular, the Hashdex Spot Bitcoin ETF filing which was due to a decision or a delay on November 15. The Commission had decided that it needed more time to contemplate and thoroughly investigate the filing before giving a final answer. This means that a decision for the Hashdex ETF filing is not expected until 2024. Related Reading: ‘Vitalik Slept On My Couch &#38; Copied My Inventions’ Ethereum Insider Says Not only did the SEC decide to delay its decision on the Hashdex Spot ETF filing, but it also chose to do so on the Grayscale Ethereum Futures filing. This comes even after Grayscale had emerged victorious over the regulator in court, which demanded that the SEC review Grayscale’s Spot Bitcoin ETF filing. Just like the Hashdex ETF, the SEC choosing to defer its decision on the Grayscale Ethereum Futures ETF pushes its deadline date into 2024, dashing hopes of the ETFs coming this year. However, both Bitcoin and Ethereum seemed to have shaken off this news with little to no reaction. BTC bulls hold steady &#124; Source: BTCUSD on Tradingview.com Bitcoin Price Already Accounts For ETF Approvals? The approvals for a Spot Bitcoin ETF and an Ethereum Futures ETF have been anticipated by the crypto community for months now. And like any asset, investors may be becoming indifferent to whether the news affects their investment decisions or not. Such a development would mean that the Bitcoin and Ethereum ETF approvals are being priced in already, and would not have much effect on the price when they are eventually approved. However, this does not seem to be entirely the case. Related Reading: Solana Institutional Inflows Surge In One Week, Can The Price Reach $100? One example is when the price of XRP surged upon the rumors of BlackRock filing an XRP ETF, and then subsequently crashing once it was debunked. Then again, on Wednesday, as expectations around the SEC’s decision mounted, the prices of Bitcoin and Ethereum rallied to $38,000 and $2,080, respectively, suggesting that investors are still expecting approval to significantly move the market. What seems to be happening is that news of delays from regulators is no longer having the bearish effects that they used to have. In this case, investors are simply not reacting to the news of a delay as they usually would seemingly because it is not widely understood that it is not the same thing as a rejection. The Bitcoin price has since retraced since hitting $38,000 but it maintains a healthy $37,000 at the time of this writing. Ethereum has also followed suit, dropping to $2,046 from its Wednesday peak of $2,080. Featured image from CNBC, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-16T10:57:32.000Z",
    "title": "Ethereum Insider Releases A Bombshell Against Buterin and Lubin",
    "url": "https://coinedition.com/ethereum-insider-releases-a-bombshell-against-buterin-and-lubin/",
    "description": "<img width=\"696\" height=\"392\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Vitalik_publishes_an_article_about_the_benefits_of_the_Ethereum-696x392-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Vitalik_publishes_an_article_about_the_benefits_of_the_Ethereum-696x392-1.jpg 696w, https://coinedition.com/wp-content/uploads/2023/03/Vitalik_publishes_an_article_about_the_benefits_of_the_Ethereum-696x392-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Vitalik_publishes_an_article_about_the_benefits_of_the_Ethereum-696x392-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Vitalik_publishes_an_article_about_the_benefits_of_the_Ethereum-696x392-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Vitalik_publishes_an_article_about_the_benefits_of_the_Ethereum-696x392-1-600x338.jpg 600w\" sizes=\"(max-width: 696px) 100vw, 696px\" /><p>Vitalik Buterin and Joseph Lubin, Ethereum’s co-founders, are accused of sabotaging crypto and engaging in fraudulent initial coin offerings by former advisor Steven Nerayoff. In several posts on “X” and an episode on the blockchain podcast channel Crypto Town Hall, Nerayoff explains he has recordings to buttress his claims. In his podcast appearance, Nerayoff asserted [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/ethereum-insider-releases-a-bombshell-against-buterin-and-lubin/\">Ethereum Insider Releases A Bombshell Against Buterin and Lubin</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]