[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-22T00:41:26.000Z",
    "title": "Does Gen AI Impact Female Clerical Workers in a Harsh Way?",
    "url": "https://www.cryptopolitan.com/impact-of-gen-ai-on-female-clerical-workers/",
    "description": "Gen AI's Negative Impact on Female Clerical Workers: ILO Report"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-22T01:00:40.000Z",
    "title": "RUNE Beyond Swaps: THORChain Introduces New Lending Protocol",
    "url": "https://www.newsbtc.com/analysis/rune/rune-beyond-swaps-thorchain-introduces-new-lending-protocol/",
    "description": "In a recent development, THORChain (RUNE), the liquidity network, has unveiled its lending feature, enabling users to leverage their native Layer-1 (L1) assets, such as Bitcoin (BTC) and Ethereum (ETH), to secure loans denominated in TOR, a USD equivalent stablecoin.  According to the announcement, this move opens up new avenues for financial participation, allowing users to borrow funds without the “burdens” of interest, liquidations, or expiration. THORChain Introduces Interest-Free Loans The lending process is designed to be user-friendly and “straightforward,” focusing on minimizing cognitive burden.  Depending on prevailing market conditions, borrowers can collateralize their assets within a range of collateralization ratios (CR), ranging from 200% to 500%. The CR determines the amount of debt borrowers can receive in proportion to their collateral. Related Reading: Bitcoin Price Follows This 1930’s Chart, Why BTC Could Keep On Falling One of the critical advantages of THORChain&#8217;s lending protocol is the absence of interest charges. By eliminating interest, the protocol encourages borrowers to hold onto their loans for extended periods, thereby increasing the equity value of the protocol.  This approach aims to align the interests of borrowers with the protocol itself, fostering a mutually beneficial ecosystem. Furthermore, THORChain&#8217;s lending system does not involve liquidations. In traditional lending models, borrowers risk having their collateral forcibly sold if its value falls below a certain threshold. However, THORChain&#8217;s design eliminates this risk by treating the collateral as equity (RUNE IOU).  Consequently, if the collateral falls below the debt value, it does not pose a problem, as the stored equity acts as the liability. Per the report, this approach ensures a more user-friendly experience and eliminates the need for borrowers to monitor asset prices constantly. The loans issued through THORChain&#8217;s lending feature have a minimum period of 30 days, providing borrowers with flexibility.  Repayment can occur anytime after the initial 30-day period, allowing borrowers to manage their debt according to their circumstances. Partial repayments are also possible, although the collateral is not released until the debt is fully repaid. THORChain&#8217;s Circuit Breaker System To enhance security and protect against inflation, THORChain has implemented a circuit breaker mechanism.  In the event of a drastic drop in RUNE’s price-native token of the THORchain network- against collateral assets such as BTC and ETH, which could lead to net inflation of RUNE, the system will pause new loans and disable the lending feature.  At this point, no further inflation of RUNE can occur, and the protocol&#8217;s reserve will cover the remaining collateral payouts. Initially, the lending feature will support BTC and ETH collateral, with plans to expand to other Layer 1 gas assets, including Binance Coin (BNB), Litecoin (LTC), Avalanche (AVAX), and DOGE.  According to the announcement, this expansion will further diversify borrowing options, accommodating a broader range of users and assets. Related Reading: Gemini Hits Back At SEC Lawsuit With Dismissal Filing Overall, with the introduction of the lending feature, THORChain takes a significant step toward expanding financial opportunities within its liquidity network. As of the latest update, THORChain&#8217;s native token, RUNE, has experienced a decline of nearly 8% within the past 24 hours, currently trading at $1.694, despite the anticipation surrounding the announcement of the new lending protocol. Nevertheless, the token has successfully maintained substantial gains of 20% and 80% over the past seven and fourteen days, respectively, attributed to a simultaneous increase in the social volume of the THORChain cryptocurrency. Featured image from iStock, chart from TradingView.com"
  }
]