[
  {
    "source": "Decrypt",
    "date": "2023-06-12T10:24:50.000Z",
    "title": "Lummis Renews Commitment to US Crypto Regulation: ‘The Fight is Far From Over’",
    "url": "https://decrypt.co/144182/lummis-renews-commitment-to-us-crypto-regulation-the-fight-is-far-from-over",
    "description": "The Senator said to ‘stay tuned’ for more on her efforts to establish a regulatory framework for the crypto sector in the U.S."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-12T10:10:09.000Z",
    "title": "Andreessen Horowitz applauds UK’s progressive approach to crypto regulation as a16z to open UK office",
    "url": "https://cryptoslate.com/andreessen-horowitz-applauds-uks-progressive-approach-to-crypto-regulation/",
    "description": "<p>Andreessen Horowitz (a16z) General Partner Chris Dixon praised the U.K.&#8217;s regulatory approach to crypto and announced expansion plans in the country, including opening a London office, marking its first international station outside the U.S. Recent months have seen U.S. regulators take an increasingly hostile stance toward the digital asset industry, with matters accelerating last week [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/andreessen-horowitz-applauds-uks-progressive-approach-to-crypto-regulation/\">Andreessen Horowitz applauds UK&#8217;s progressive approach to crypto regulation as a16z to open UK office</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-12T10:32:33.000Z",
    "title": "Venture Capital Titan a16z Sets Sights on London for First International Outpost",
    "url": "https://www.cryptoglobe.com/latest/2023/06/venture-capital-titan-a16z-sets-sights-on-london-for-first-international-outpost/",
    "description": "In a significant move that underscores the growing importance of the UK and European markets, venture capital behemoth Andreessen Horowitz (a16z) has announced London as the location for its first-ever international office. The decision highlights the UK government’s proactive stance towards fostering a conducive environment for startups, particularly those in the decentralized space. Based in […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-12T10:13:51.000Z",
    "title": "Cardano (ADA/USD) Price Analysis for 12 June 2023: Technical Indicators Suggest Strong Buy",
    "url": "https://www.cryptoglobe.com/latest/2023/06/cardano-ada-usd-price-analysis-for-12-june-2023-technical-indicators-suggest-strong-buy/",
    "description": "Introduction This report provides a comprehensive analysis of Cardano (ADA)’s price dynamics on Binance, covering technical indicators, moving averages, and pivot points. Price and Volume Snapshot At the time of the report, Cardano (ADA) was priced at $0.2824, experiencing an increase of $0.0205 (+7.83%) compared to the previous period. The snapshot was taken at 05:44:11 […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T10:32:20.000Z",
    "title": "How Is Fragmented Blockchain Interoperability Solved By LayerZero Protocol?",
    "url": "https://www.cryptopolitan.com/fragmented-blockchains-fixed-layerzero/",
    "description": "LayerZero is an innovative protocol that solves the blockchain ecosystem&#8217;s most significant challenge: interoperability. With the proliferation of blockchains, developers have a variety of platforms on which to run their smart contracts, but this freedom has come at a cost. Each chain is isolated, forcing users to silo their liquidity and limiting their options to ... <a title=\"How Is Fragmented Blockchain Interoperability Solved By LayerZero Protocol?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fragmented-blockchains-fixed-layerzero/\" aria-label=\"More on How Is Fragmented Blockchain Interoperability Solved By LayerZero Protocol?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-12T10:28:01.000Z",
    "title": "DeFi protocol Sturdy Finance falls victim to $800k security attack",
    "url": "https://crypto.news/defi-protocol-sturdy-finance-falls-victim-to-800k-security-attack/",
    "description": "Decentralized lending platform Sturdy Finance has suffered a major security breach resulting in the loss of approximately $800,000 worth of ether."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-12T10:18:46.000Z",
    "title": "Ethereum non-zero addresses hit all-time high despite the price drop",
    "url": "https://crypto.news/ethereum-non-zero-addresses-hit-all-time-high-despite-the-price-drop/",
    "description": "Ethereum (ETH) is witnessing an uptick in adoption rate despite the latest market-wide slump. Its non-zero addresses recently hit an all-time high value amid a 7-day decline of 8.25% in the asset&#8217;s price. The number of non-zero addresses holding ETH&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-12T10:10:50.000Z",
    "title": "Andreessen Horowitz to open crypto branch in London",
    "url": "https://crypto.news/andreessen-horowitz-to-open-crypto-branch-in-london/",
    "description": "Andreessen Horowitz (also known as a16z) has announced intentions to create its first international office in London later this year, signaling confidence in the UK&#8217;s potential as a worldwide center for crypto and web3 innovation.  a16zcrypto has already got approval&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-12T10:22:03.000Z",
    "title": "Shiba Inu Traders Anxiously Await Shibarium Launch Date Amidst Uncertainty",
    "url": "https://www.newsbtc.com/news/shiba-inu-traders-anxiously-await-shibarium-launch-date-amidst-uncertainty/",
    "description": "Shiba Inu (SHIB) enthusiasts and traders find themselves caught in a state of uncertainty as the much-anticipated Shibarium launch date remains elusive.  With the upcoming launch of Shibarium, which promises to provide a dedicated ecosystem for SHIB enthusiasts, excitement has been running high. However, despite the buzz surrounding the project, the exact date of Shibarium&#8217;s release remains a mystery, leaving traders and community members eager for more information.  When will Shibarium finally make its grand entrance into the world of Shiba Inu trading? Shiba Inu Traders Await Shibarium Launch The Shiba Inu community, eagerly anticipating the release of Shibarium&#8217;s mainnet, finds themselves in a state of uncertainty due to recent updates. LucieSHIB, a prominent promoter of Shiba Inu, initially announced that the highly anticipated Shibarium mainnet would be launched sometime between the second and third quarters of 2023.  However, the same source has now hinted at a potential delay in the previously anticipated launch date, raising doubts among traders and enthusiasts. #Shibarium is not coming this month, and there&#8217;s a BIG MAYBE it will come in the next 2-3 months. However, since we have waited this long, we can wait a few more weeks. Meanwhile, let&#8217;s enjoy the things that will come before, such as Metaverse teasers or new $SHIB achievements.… pic.twitter.com/PAhqpXOuxf — 𝐋𝐔𝐂𝐈𝐄 (@LucieSHIB) June 9, 2023 Although there is uncertainty surrounding the exact timing of the mainnet launch, significant advancements have been observed on the Shibarium testnet. This progress is clearly evident as indicated by the information obtained from the Puppynet scanner, which provides insights into the steady and continuous development of the testnet. Related Reading: BNB Displays Short-Term Bullish Momentum Amidst Massive Binance Outflows Despite the ambiguity surrounding the specific details and timeline of the mainnet launch, the Shibarium testnet has been actively evolving and making notable strides. The information gathered through the Puppynet scanner serves as a reliable source of evidence, demonstrating the consistent progress being made within the testnet environment. SHIB market cap losing its grip on the $4 billion handle. Chart: TradingView.com Related Reading: Pepecoin Price Drops, Breaking Key Support Level – Further Downfall Ahead? The ongoing advancements on the Shibarium testnet signify the dedication and commitment of the development team to ensure a robust and reliable infrastructure for the impending mainnet release. While the exact launch date may still be uncertain, the steady growth and improvement witnessed on the testnet instill confidence in the project&#8217;s overall development trajectory. Shibarium: At A Glance Shibarium is a forthcoming and long-awaited Layer 2 blockchain solution for Shiba Inu that aims to resolve Ethereum&#8217;s slow transaction speed. Its purpose is to set the groundwork for constructing the Shiba Inu ecosystem, which will include a metaverse, a DEX, and blockchain games. An illustration of Shibarium. Image: Vcgamers As of the latest report, the testnet has witnessed an impressive number of transactions, surpassing 19.4 million. Furthermore, there are currently over 16.7 million wallet addresses and more than 1.2 million blocks within the testnet. These figures demonstrate the active engagement and growing interest within the Shiba Inu community, despite the lingering uncertainty about the official launch date of Shibarium. Shiba Inu (SHIB) Price Dips Shiba Inu (SHIB) is currently being traded at a price of $0.00000662, as reported by CoinGecko. However, the cryptocurrency has experienced a 1.7% decline within the last 24 hours. This downward trend becomes even more pronounced when considering the past seven days, as SHIB has seen a significant decline of 22.4%. Source: Coingecko The recent price drop has pushed SHIB into a strong bear trend, indicating a notable downward movement. This bearish sentiment is further supported by the Relative Strength Index (RSI) which has fallen below 30, placing SHIB in the oversold zone. These indicators reflect a negative market sentiment and suggest that investors are currently more inclined towards selling SHIB tokens. The launch of Shibarium&#8217;s mainnet had the potential to act as a catalyst for a potential price rally in SHIB tokens. However, the prevailing uncertainty surrounding the release of Shibarium has added to the bearish sentiment and may have a negative impact on the value of SHIB.  As traders and investors await more clarity on the launch date, it remains to be seen how the market will respond to the anticipated event. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Getty Images"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T10:13:01.000Z",
    "title": "JPMorgan’s Blockchain Pilot Takes Off in India: Ripple and XRP in the Mix? Streamlining Dollar Transactions with Blockchain Technology",
    "url": "https://www.crypto-news-flash.com/jpmorgans-blockchain-pilot-takes-off-in-india-ripple-and-xrp-in-the-mix-streamlining-dollar-transactions-with-blockchain-technology/?utm_source=rss&utm_medium=rss&utm_campaign=jpmorgans-blockchain-pilot-takes-off-in-india-ripple-and-xrp-in-the-mix-streamlining-dollar-transactions-with-blockchain-technology",
    "description": "JP Morgan, a leading bank, has joined forces with six prominent banks in India.  This cutting-edge technology enabled by real-time blockchain will be available round-the-clock. In a bold move towards the future of finance, JP Morgan, a leading bank, has joined forces with six prominent banks in India.  They will work together to enable quick [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T10:12:58.000Z",
    "title": "VeChain (VET) News – Collateral Network and Cosmos Price Set to Surge in June 2023",
    "url": "https://www.crypto-news-flash.com/vechain-vet-news-collateral-network-and-cosmos-price-set-to-surge-in-june-2023/?utm_source=rss&utm_medium=rss&utm_campaign=vechain-vet-news-collateral-network-and-cosmos-price-set-to-surge-in-june-2023",
    "description": "If you’re on a search for crypto gems this year, you are in the right place. The fast-moving world of blockchain technology has never been more active.  Below, we’re having a look at the most recent VeChain (VET) news and introduce you to Collateral Network (COLT), a pioneer in the DeFi space whose price is [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-12T10:26:46.000Z",
    "title": "Top 5 Security Tokens 30% Cheaper in the Last 7 Days – Part 2",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-5-security-tokens-30-cheaper-in-the-last-7-days-part-2/",
    "description": "<p>This is the second part of this article. You can read the first part here. Let&#8217;s discover other 5 tokens that The SEC classified as securities and had very a very important decrease of their prices. 1) SOL (Solana) SOL is the native token of the Solana blockchain. Solana aims to provide a high-performance and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-5-security-tokens-30-cheaper-in-the-last-7-days-part-2/\">Top 5 Security Tokens 30% Cheaper in the Last 7 Days – Part 2</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-12T10:26:31.000Z",
    "title": "Fetch.ai (FET) Price Falls 33% in 7 Days: Is It Time to Buy the Dip?",
    "url": "https://coinedition.com/fetch-ai-fet-price-falls-33-in-7-days-is-it-time-to-buy-the-dip/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Fetch_ai_FET_Price_Falls_33_in_7_Days_Is_It_Time_to_Buy_the_Dip-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Fetch_ai_FET_Price_Falls_33_in_7_Days_Is_It_Time_to_Buy_the_Dip-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Fetch_ai_FET_Price_Falls_33_in_7_Days_Is_It_Time_to_Buy_the_Dip-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Fetch_ai_FET_Price_Falls_33_in_7_Days_Is_It_Time_to_Buy_the_Dip.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The Fetch.ai market has been under a bearish grip for the previous 7 days, with bulls unable to break above the intra-week high of $0.2513. The resistance at the 24-hour high of $0.1878 prompted a dip, eventually resulting in a 90-day low of $0.178 (a 33% dip from the week’s high). The negative drop was [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/fetch-ai-fet-price-falls-33-in-7-days-is-it-time-to-buy-the-dip/\">Fetch.ai (FET) Price Falls 33% in 7 Days: Is It Time to Buy the Dip?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-12T10:33:59.000Z",
    "title": "Overwhelming Majority of Americans Oppose US CBDC That Would Allow Government to Track and Control Spending: Survey",
    "url": "https://dailyhodl.com/2023/06/12/overwhelming-majority-of-americans-oppose-us-cbdc-that-would-allow-government-to-track-and-control-spending-survey/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/cbdc-government-us.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/cbdc-government-us.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/cbdc-government-us.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/cbdc-government-us.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/cbdc-government-us.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/cbdc-government-us.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/cbdc-government-us.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A new survey from an American think tank shows an overwhelming majority of US adults are against the adoption of a central bank digital currency (CBDC) that allows the government to track and control their financial activities. The Cato Institute, in collaboration with market research firm YouGov, collected responses from 2,126 US adults between February [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/12/overwhelming-majority-of-americans-oppose-us-cbdc-that-would-allow-government-to-track-and-control-spending-survey/\">Overwhelming Majority of Americans Oppose US CBDC That Would Allow Government to Track and Control Spending: Survey</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]