[
  {
    "source": "CoinDesk",
    "date": "2023-07-12T18:59:28.000Z",
    "title": "Even as Inflation Risk Fades, Bitcoin Remains Stuck Below $31K",
    "url": "https://www.coindesk.com/markets/2023/07/12/even-as-inflation-risk-fades-bitcoin-remains-stuck-below-31k/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Wednesday's CPI report showed sizable decelerations in both overall and core U.S. inflation, which one might've thought would drive BTC's price higher."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T19:00:00.000Z",
    "title": "Bored Ape floor price falls below 30 ETH: Nifty Newsletter, July 5–11",
    "url": "https://cointelegraph.com/news/bored-ape-floor-price-falls-below-30-eth-nifty-newsletter-july-5-11",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/595aa0b2-0327-41eb-b24a-f5d1314593d7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A decentralized finance borrower used a nonfungible token representing a luxury watch to take out a $35,000 loan. </p>\n                    <p><p>In this week’s newsletter, read about Ethereum <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible token (NFT)</a> royalties hitting their lowest point in two years. Check out Bitcoin Ordinals trading volume, which hit $210 million in the second quarter of 2023, and how a decentralized finance (DeFi) borrower used an NFT representing a physical luxury watch to take out a loan. In other news, find out why Animoca Brands co-founder Yat Siu is still bullish on blockchain games, and don’t forget this week’s Nifty News, featuring a Sega executive’s opinion on play-to-earn gaming. </p><h2>Ethereum NFT royalties hit 2-year low as Bored Ape floor price falls below 30 ETH</h2><p>A report from blockchain analytics firm Nansen showed that royalties earned by NFT projects have reached a 2-year low. The dip may be fueled by lower NFT floor prices of popular collections like the Bored Ape Yacht Club and the Azuki Elementals launch controversy. </p><p>According to the report, NFT marketplaces OpenSea and Blur are going head-to-head with each other in terms of royalties paid. However, when the trading volume surges, Blur often takes the lead. </p><p><a href=\"https://cointelegraph.com/news/ethereum-nft-royalties-hit-two-year-low-as-bored-ape-floor-price-falls-below-30-eth\"><strong>Continue reading</strong></a></p><h2>Bitcoin Ordinals volume hits $210 million in Q2 — DappRadar</h2><p>The creation of the Bitcoin Ordinals protocol on the Bitcoin blockchain has resulted in a significant trading volume exceeding $210 million, according to DappRadar. The data highlights the surging popularity of Bitcoin Ordinals, leading to a remarkable increase in trading volume throughout the second quarter of 2023. </p><p>Starting at $7.18 million in the first quarter, the trading volume soared to $210.7 million by the end of June, representing a staggering 2834% quarterly growth. Additionally, the report reveals that over 550,000 Ordinals trades took place in Q2, involving approximately 150,000 unique traders, further contributing to the remarkable trading volume surge.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-ordinals-volume-hits-210-million-in-q2-2023\"><strong>Continue reading</strong></a></p><h2>DeFi borrower uses luxury watch-backed NFT as collateral for a loan</h2><p>A DeFi borrower has used a Patek Phillipe luxury watch to collateralize a $35,000 loan. The watch was sent to an escrow firm that deals with NFTs backed by physical assets in exchange for an NFT representing ownership of the watch. The NFT was then listed as collateral at the DeFi protocol Arcade and was used to borrow the money.</p><p>Some expressed positive feelings about the use of Web3 technology in lending, while others believe that it’s adding NFTs where it’s not necessary. </p><p><a href=\"https://cointelegraph.com/news/nft-de-fi-borrower-uses-luxury-watch-backed-nft-as-collateral-for-a-loan\"><strong>Continue reading</strong></a></p><h2>Animoca still bullish on blockchain games, awaits license for metaverse fund</h2><p>Despite the waning interest in NFTs and blockchain gaming, Animoca Brands co-founder Yat Siu highlighted that their firm remains optimistic in the sector. In a Cointelegraph interview, Siu noted that he’s expecting AAA-rated blockchain games to hit the market by 2023. </p><p>Apart from this, the Animoca executive also noted that the company is waiting for a license before it can put its much-anticipated metaverse fund to work. </p><p><a href=\"https://cointelegraph.com/news/animoca-still-bullish-on-blockchain-games-awaits-license-for-metaverse-fund\"><strong>Continue reading</strong></a></p><h2>Nifty News: Sega exec calls P2E games ‘boring,’ Tom Brady’s NFT firm switches it up and more</h2><p>Shuji Utsumi, an executive from Sega, the company behind popular game franchises like Sonic The Hedgehog, described play-to-earn games as “boring” and said that Sega is discontinuing its plans to develop blockchain games. Meanwhile, the NFT-focused startup of American sports star Tom Brady is reportedly moving away from NFTs, quietly removing crypto language in its materials. </p><p><a href=\"https://cointelegraph.com/news/nifty-news-sega-p2e-boring-tom-brady-moves-from-nfts\"><strong>Continue reading</strong></a></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-01/43adc850-7dbd-4fa8-811b-9eb32b6c1983.jpg\"  alt=\"\"  title=\"Bored Ape floor price falls below 30 ETH: Nifty Newsletter, July 5&ndash;11\"  /></figure><p class=\"post-content__accent post-content__accent_big\"><a href=\"https://cointelegraph.com/podcasts/nft-steez\">CHECK OUT COINTELEGRAPH’S <em>NFT STEEZ</em> PODCAST</a></p><p><em>Thanks for reading this digest of the week’s most notable developments in the NFT space. Come again next Wednesday for more reports and insights into this actively evolving space.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T19:00:00.000Z",
    "title": "CFTC case against Digitex futures exchange and CEO results in $16M court order",
    "url": "https://cointelegraph.com/news/cftc-digitex-futures-exchange-16m-court-order",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/1a036b06-4cf8-4ae2-848b-32a0396db4b4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The commission filed charges against Digitex and CEO Adam Todd in September 2022 for alleged price manipulation and failure to register.</p>\n                    <p><p>A United States federal court has ordered Digitex CEO Adam Todd to pay roughly $16 million in disgorgement and penalties related to a Commodity Futures Trading Commission (CFTC) case.</p><p>In a June 12 announcement, the CFTC <a href=\"https://www.cftc.gov/PressRoom/PressReleases/8748-23\" target=\"_blank\" rel=\"noopener nofollow\">said</a> a judge in the U.S. District Court for the Southern District of Florida issued a default judgment against Todd and Digitex LLC, Digitex Limited, Digitex Software Limited and Blockster Holdings Limited Corporation for failure to register with the CFTC and manipulating the price of the DGTX token. As part of the judgment, the CEO and four companies under his control are banned from “trading in any CFTC-regulated markets” and required to pay $3,912,220 in disgorgement as well as a $11,736,660 civil monetary penalty.</p><p>“Regardless of the technology used, the CFTC will aggressively use its well-established authority to ensure entities are lawfully registered and to address the manipulation of commodities in interstate commerce,” said CFTC enforcement director Ian McGinley.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Federal Court Orders Digital Asset Derivatives Platform and Florida Resident to Pay More than $15 Million for Multiple Violations of the Commodity Exchange Act. Learn more: <a href=\"https://t.co/AprX50QcGf\">https://t.co/AprX50QcGf</a></p>&mdash; CFTC (@CFTC) <a href=\"https://twitter.com/CFTC/status/1679161064741646339?ref_src=twsrc%5Etfw\">July 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to McGinley, Todd allegedly pumped the price of DGTX using a computerized bot, which in 2020 he deployed on third-party exchanges to buy more of the token than it sold. The commission <a href=\"https://cointelegraph.com/news/cftc-takes-legal-action-against-digitex-futures-exchange-and-ceo\">filed charges against Todd and Digitex</a> in September 2022. The $16 million order or additional financial penalties may not necessarily result in repayment to Digitex users.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/cftc-commissioner-says-proposal-to-reassess-risk-management-could-consider-crypto\"><strong><em>CFTC commissioner says proposal to reassess risk management could consider crypto</em></strong></a></p><p>Along with the U.S. Securities and Exchange Commission, the CFTC is currently involved in several civil suits with crypto firms and their executives over failure to comply with regulatory guidelines. These cases include <a href=\"https://cointelegraph.com/news/cftc-allegations-and-1-billion-lawsuit-for-binance-law-decoded-march-27-april-3\">allegations against crypto exchange Binance</a> and civil charges for former FTX CEO Sam Bankman-Fried. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T18:42:08.000Z",
    "title": "Price analysis 7/12: BTC, ETH, BNB, XRP, ADA, DOGE, SOL, LTC, MATIC, DOT ",
    "url": "https://cointelegraph.com/news/price-analysis-7-12-btc-eth-bnb-xrp-ada-doge-sol-ltc-matic-dot",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/5d4b08a3-a82d-48f6-a1a7-b4fcd976e9e7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin continues to face strong resistance at $31,000 but supportive macroeconomic factors could tilt the advantage in favor of the bulls.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) bulls are again having a go at the overhead resistance of $31,000. The bullish sentiment may get a <a href=\"https://www.cnbc.com/2023/07/11/stock-market-today-live-updates.html\" target=\"_blank\" rel=\"noopener nofollow\">boost</a> from the United States inflation report, which showed signs of slowing down. Economists were expecting the year-on-year consumer price index to rise 3.1% but the June print came in at 3%. </p><p>The month-on-month increase of 0.2% was also less than forecast. This suggests that the Federal Reserve’s rate hikes are having the desired effect. That may limit future rate hikes by the Fed.</p><p>Supported by macroeconomic conditions, institutional investors seem to be turning positive on cryptocurrencies, especially Bitcoin. CoinShares report published on July 10 showed <a href=\"https://cointelegraph.com/news/bitcoin-continues-dominance-3rd-week-fund-inflows-correct-previous-months-outflows\">inflows of $136 million into digital</a> investment products in the past week. That brings the total inflows of three consecutive weeks to $470 million, indicating a positive outlook.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/bc00db62-c880-43c4-88ad-b22d415257c9.png\"  /><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>Large investors could be turning positive on Bitcoin because they anticipate a huge inflow of traditional finance money if the U.S. Securities and Exchange Commission approves a spot Bitcoin exchange-traded fund. Bloomberg ETF analyst Eric Balchunas <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-could-unlock-30-trillion-worth-of-wealth-bloomberg-analyst-says\">said in an exclusive interview with Cointelegraph</a> that an ETF approval would unlock $30 trillion worth of capital for Bitcoin. </p><p>Could the tailwind of the positive triggers prove bullish for Bitcoin and the major altcoins? Let’s study the charts of the top-10 cryptocurrencies to find out.</p><h2>Bitcoin price analysis</h2><p>Bitcoin turned down from the overhead resistance at $31,000 on July 10 but a positive sign is that the bulls did not allow the price to dip below the 20-day exponential moving average ($30,012).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/42181d48-9b38-480b-9120-e21e0f9e06c1.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The upsloping 20-day EMA and the relative strength index (RSI) in the positive territory indicate that the path of least resistance is to the upside. If buyers drive and sustain the price above $31,000, the BTC/USDT pair is likely to start the next leg of the uptrend. </p><p>The pair could ascend to $32,400 where the bears are expected to again mount a strong defense. If bulls do not allow the price to fall below the 20-day EMA, the pair is likely to soar toward $40,000.</p><p>Time is running out for the bears. If they want to make a comeback, they will have to quickly pull the price below $29,500. That could start a decline to the 50-day simple moving average ($28,312).</p><h2>Ether price analysis</h2><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) once again bounced off the 50-day SMA ($1,843) on July 10, indicating that the bulls are fiercely guarding this level.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/a5251501-48af-469b-b566-b6996ecbfed8.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The price turned up and closed above the 20-day EMA ($,1874), indicating that the bulls are trying to make a comeback. If buyers drive the price above $1,906, the ETH/USDT pair could attempt a rally to the overhead resistance at $2,000. This level is likely to witness strong selling by the bears.</p><p>The crucial support to watch on the downside is the 50-day SMA. If this level gives way, it could pave the way for a deeper correction to $1,700.</p><h2>BNB price analysis</h2><p>The price action of the past few days has formed a symmetrical triangle in BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>). This suggests indecision between the bulls and the bears.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/e961d1c7-eacc-43a9-a5c9-3f08ef6b4e05.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The symmetrical triangle usually behaves as a continuation pattern but in some cases, it turns into a reversal setup. If buyers kick and maintain the price above the triangle, it will suggest a possible trend reversal. The BNB/USDT pair could rise to $265 and thereafter sprint to the pattern target of $293.</p><p>Contrarily, if the price turns down and slips below the 20-day EMA ($242), it will suggest that the pair may spend some more time inside the triangle. The bears will have to yank the price below the support line to seize control.</p><h2>XRP price analysis</h2><p>The bulls tried to thrust XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) above the 20-day EMA ($0.48) on July 10 but the bears held their ground.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/6580dbb4-7ab3-40fe-b75a-0caea79130fc.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bulls will have to cross the roadblock at the 20-day EMA and then at the 50-day SMA ($0.49) to gain the upper hand. If they do that, the XRP/USDT pair could pick up momentum and surge to $0.53 and eventually to $0.56.</p><p>On the contrary, if the price turns down sharply from the current level, it could retest the strong support at $0.45. This level has held on two previous occasions, hence the bulls are expected to defend it aggressively. If the buyers fail in their endeavor, the pair may collapse to $0.41.</p><h2>Cardano price analysis</h2><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) rose above the 20-day EMA ($0.29) on July 11, indicating that the bulls are buying at lower levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/3e4194bc-008e-4582-a9d3-785451496e62.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The flat 20-day EMA and the RSI near the midpoint indicate a balance between supply and demand. This advantage will tilt in favor of the buyers if they shove the price above the 50-day SMA ($0.31). The ADA/USDT pair could then start a rally to $0.38.</p><p>Alternatively, if the price turns down from the overhead resistance, it will suggest that the bears have not given up yet. The pair could then oscillate between the 50-day SMA and the uptrend line for some time. A slide below the uptrend line will give the edge to the bears in the near term.</p><h2>Dogecoin price analysis</h2><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) is struggling to rise above the 20-day EMA ($0.07) but a positive sign is that the bulls have not ceded ground to the bears. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/9b0614de-b3e7-4baf-a967-9250d99116a9.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The flattening 20-day EMA and the RSI just below the midpoint suggest a range-bound action between $0.07 and $0.06 for some time. If bulls propel the price above the moving averages, the bulls will try to overcome the obstacle at $0.07. If they can pull it off, the DOGE/USDT pair may climb to $0.08.</p><p>The bears will gain the upper hand if they sink and sustain the price below the crucial support at $0.06. The pair may then tumble to $0.05.</p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) is facing resistance at $22.30 but a positive sign is that the bulls have not given up much ground. This suggests that the buyers expect the rally to continue.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/67234b44-1c64-4bdd-b7f5-d1ebb76dbaf8.png\"  /><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The upsloping 20-day EMA ($19.73) and the RSI in the overbought territory indicate that the bulls are in command. A break and close above $22.50 could start the next leg of the up-move. The SOL/USDT pair could then attempt a rally to $27.12. There is a minor resistance at $24 but it is likely to be crossed.</p><p>The first support on the downside is at the 20-day EMA and then at the 50-day SMA ($18.55). Buyers are expected to defend this zone with vigor. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-s-pre-halving-rally-may-start-soon-here-s-why\"><strong><em>Bitcoin’s pre-halving rally may start soon — Here’s why</em></strong></a></p><h2>Litecoin price analysis</h2><p>The long tail on Litecoin’s (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) July 10 candlestick shows that the bulls aggressively purchased the dip below the 20-day EMA ($95).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/7352056c-3661-44a1-b6f0-f19835a754fc.png\"  /><figcaption style=\"text-align: center;\"><em>LTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>Buyers will have to overcome the barrier at the psychological level of $100 to signal the start of a sustained recovery. The LTC/USDT pair could then advance to $106 and subsequently strive to reach the overhead resistance at $115. </p><p>The important level to watch on the downside is the 20-day EMA. If this level fails to hold, the pair may descend to the 50-day SMA ($89). Such a move could delay the start of the next leg of the up-move. </p><h2>Polygon price analysis</h2><p>Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) soared above the overhead resistance of $0.73 on July 10, completing a bullish ascending triangle pattern.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/8c00f7c0-c3d8-49ef-a0ff-33cc84cd5b7c.png\"  /><figcaption style=\"text-align: center;\"><em>MATIC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bulls have maintained the price above the breakout level but they are facing stiff resistance from the bears at higher levels. If bulls sustain the price above $0.72, the MATIC/USDT pair could start a new uptrend to the pattern target of $0.94.</p><p>Conversely, if bears yank the price below $0.72, it may trap some aggressive bulls. The pair could then fall to the uptrend line, which is an important level to keep an eye on. If this support cracks, the pair could start a downward move to $0.60.</p><h2>Polkadot price analysis</h2><p>Polkadot (<a href=\"https://cointelegraph.com/polkadot-price-index\">DOT</a>) bounced off the moving averages on July 10, indicating a change in sentiment from selling on rallies to buying on dips.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/130bb17f-5d23-4519-bad2-1924f436be12.png\"  /><figcaption style=\"text-align: center;\"><em>DOT/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bulls will try to push the price to the overhead resistance of $5.64 while the bears will attempt to halt the recovery. The 20-day EMA ($5.11) is flattish but the RSI above 52 shows that the bulls have a slight edge. A break and close above $5.64 will complete a bullish inverse head and shoulder pattern, signaling a potential trend reversal.</p><p>If bears want to prevent the up-move, they will have to quickly yank the price below $4.97. The DOT/USDT pair may then drop to $4.74 and later to $4.50. </p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-12T19:02:36.000Z",
    "title": "UN greenlights Dynamic Coalition on Blockchain Assurance and Standardization to research emergent tech",
    "url": "https://cryptoslate.com/un-greenlights-dynamic-coalition-on-blockchain-assurance-and-standardization-to-research-emergent-tech/",
    "description": "<p>The United Nations Internet Governance Forum&#8217;s (UN-IGF) secretariat has approved the establishment of a Dynamic Coalition aimed at developing blockchain standards for application in various domains — including public services and emergent technology like AI. The Dynamic Coalition on Blockchain Assurance and Standardization is supported and hosted by the Government Blockchain Association (GBA). UN Joint Staff [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/un-greenlights-dynamic-coalition-on-blockchain-assurance-and-standardization-to-research-emergent-tech/\">UN greenlights Dynamic Coalition on Blockchain Assurance and Standardization to research emergent tech</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T18:40:24.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T18:39:39.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and the platform they need to build blockchain solutions. At this time, we can only make educated guesses ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-12T19:00:42.000Z",
    "title": "Silk Road’s Ghosts Haunt Bitcoin Market As US Government Moves 9,800 BTC",
    "url": "https://www.newsbtc.com/bitcoin-news/silk-roads-ghosts-haunt-bitcoin-market-as-us-government-moves-9800-btc/",
    "description": "A significant development has emerged in the ongoing saga surrounding the defunct criminal online marketplace Silk Road. On-chain data suggest that a massive amount of funds tied to the marketplace is on the move, with more than 9,000 Bitcoin (BTC) recently transferred from two Silk Road-related addresses. The addresses in question are suspected to have been seized by the US Department of Justice. US Government BTC On The Move? The latest transfer of funds follows the seizure of over 50,000 Bitcoin from James Zhong, who recently pled guilty to wire fraud for unlawfully obtaining the Bitcoin from the Silk Road dark web marketplace in 2012. Law enforcement seized the Bitcoin from Zhong&#8217;s home in Gainesville, Georgia, in November 2021, in what was the largest cryptocurrency seizure in the history of the US Department of Justice. Related Reading: Celsius Takes Legal Action Against StakeHound For Withholding $150 Million According to court filings, Zhong created a string of Silk Road accounts to conceal his identity, triggering over 140 transactions in rapid succession to trick Silk Road&#8217;s withdrawal-processing system into releasing approximately 50,000 BTC into his accounts. He then transferred the Bitcoin into separate addresses under his control, all in a manner designed to prevent detection and obfuscate the Bitcoin&#8217;s source. Zhong&#8217;s possession of the 50,000 Bitcoin led to him receiving 50,000 Bitcoin Cash in a hard fork coin split in August 2017. He then exchanged all the BCH Crime Proceeds for additional Bitcoin, amounting to approximately 3,500 Bitcoin of additional crime proceeds. By the last quarter of 2017, Zhong possessed roughly 53,500 Bitcoin of total crime proceeds. In March 2022, Zhong began voluntarily surrendering to the government additional Bitcoin that he had access to and had not dissipated. In total, he surrendered 1,004.14621836 additional Bitcoin. The US government had previously sold 9,800 Bitcoin in March 2022, with plans to sell another 41,500 BTC. However, the recent transfer of more than 9,000 BTC from the Silk Road-related addresses has raised questions about the fate of the remaining seized Bitcoin. Is The Bitcoin Bull Run In Jeopardy? As previously reported by NewsBTC, the US government plans to sell the remaining 41,500 BTC in connection with the Silk Road case. The US government has been selling the confiscated BTC in batches since then, and the upcoming sale of 41,500 BTC could have a significant impact on the cryptocurrency market. If there is no demand for Bitcoin when the US government sells the remaining BTC, it could lead to a drop in Bitcoin&#8217;s price. This is because the sudden influx of BTC into the market could create an oversupply, which could overwhelm the existing demand. As a result, the market price of BTC could fall, leading to a temporary drop in the cryptocurrency&#8217;s value. Related Reading: Polygon Volume Registers Sharp Increase, What Does It Mean? However, it&#8217;s important to note that the impact of the government&#8217;s BTC sale on the market is not entirely predictable. If buyers are willing to purchase the BTC at the offered price, then the market may not experience much volatility.  On the other hand, if demand for BTC is strong and buyers are willing to pay a premium for the confiscated BTC, the sale could push BTC prices higher. Despite these concerns, BTC appears to be regaining its bullish momentum, attempting to breach the $31,000 mark. If BTC can consolidate above this resistance level, it could signal a potential upward trend in the cryptocurrency&#8217;s value.  Currently, BTC is trading at $30,700, which is the same price level as it was in the 24-hour timeframe from July 11th. BTC&#8217;s support floor at $30,000 has been holding up well, despite poor price action. This could serve as a threshold for Bitcoin bulls in case of another failed attempt to breach the upper resistance lines in the short term. Featured image from Unsplash, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-12T18:45:46.000Z",
    "title": "Bank of England Governor Blasts Bitcoin (BTC) and Stablecoins, Touts Other Forms of Digital Money",
    "url": "https://dailyhodl.com/2023/07/12/bank-of-england-governor-blasts-bitcoin-btc-and-stablecoins-touts-other-forms-of-digital-money/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/bank-blasts-btc-touts.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/bank-blasts-btc-touts.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/bank-blasts-btc-touts.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/bank-blasts-btc-touts.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/bank-blasts-btc-touts.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/bank-blasts-btc-touts.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/bank-blasts-btc-touts.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Bank of England’s governor Andrew Bailey says that crypto assets have various limitations that prevent them from being used in the existing financial system. In a speech delivered earlier this week, Bailey says that crypto assets such as Bitcoin (BTC) and stablecoins fail to qualify as money. &#8220;Let me move on to crypto assets, as [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/12/bank-of-england-governor-blasts-bitcoin-btc-and-stablecoins-touts-other-forms-of-digital-money/\">Bank of England Governor Blasts Bitcoin (BTC) and Stablecoins, Touts Other Forms of Digital Money</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-12T18:41:43.000Z",
    "title": "Coinbase Launches Feature Allowing for Direct Messaging Between Ethereum Addresses",
    "url": "https://dailyhodl.com/2023/07/12/coinbase-launches-feature-allowing-for-direct-messaging-between-ethereum-addresses/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/global-knocks-coinbase.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/global-knocks-coinbase.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/global-knocks-coinbase.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/global-knocks-coinbase.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/global-knocks-coinbase.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/global-knocks-coinbase.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/global-knocks-coinbase.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Top US-based crypto exchange platform Coinbase is launching a new feature that would allow private direct messaging between Ethereum (ETH) addresses. In a new thread, Coinbase says that it is rolling out a new decentralized chat feature for its wallet powered by web3 chat protocol XMPT that aims to grant users ownership of their chats. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/12/coinbase-launches-feature-allowing-for-direct-messaging-between-ethereum-addresses/\">Coinbase Launches Feature Allowing for Direct Messaging Between Ethereum Addresses</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]