[
  {
    "source": "Decrypt",
    "date": "2023-11-03T20:18:59.000Z",
    "title": "Will Caroline Ellison and Sam Bankman-Fried’s Other Co-Defendants Go to Prison?",
    "url": "https://decrypt.co/204376/caroline-ellison-sam-bankman-fried-co-defendants-prison",
    "description": "Despite delivering key testimony against their former boss, Caroline Ellison, Nishad Singh, and Gary Wang are each still facing decades behind bars."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-03T20:18:37.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "http://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Bitcoin futures contracts traded on CME reached an all-time high this week, as BTC's price briefly eclipsed $35,000. Meanwhile, FTX claim pricing has reached as high as 57%, according to data from Claims Market. This came after Sam Bankman-Fried was found guilty of all seven charges laid against him in his criminal trial, just hours after prosecutors laid down their final rebuttal to the defense. </p><h3>CME Bitcoin futures hit record high</h3><p>Open interest on Bitcoin futures <a href=\"https://cointelegraph.com/news/cme-bitcoin-futures-hit-record-high-but-uncertainty-looms-above-36k\">reached $3.65 billion</a> on the Chicago Mercantile Exchange (CME), a new all-time high. The metric suggests that more traders are gaining access to the Bitcoin market through derivatives. </p><p>In terms of bullish sentiment, there were 122 active large holders involved in Bitcoin futures during the week of Oct. 31, the highest on record. As a result, the Bitcoin CME futures premium reached its highest level in over two years. </p><p>Digital asset markets have seen a wave of positive momentum tied to speculation that the U.S. Securities and Exchange Commission is on track to approve its <a href=\"https://cointelegraph.com/news/invesco-galaxy-spot-bitcoin-etf-added-to-dtcc-website\">first spot Bitcoin ETF</a>. This may have prompted the largest inflows into crypto exchange-traded products in over a year. According to CoinShares, crypto fund inflows <a href=\"https://cointelegraph.com/news/crypto-funds-see-largest-weekly-inflows-more-than-year-coinshares\">totaled $326 million</a> last week.</p><h3>FTX claims climb to 57% as Sam Bankman-Fried found guilty on all counts</h3><p>The current claim pricing of FTX has reached a maximum of 57%, according to data from Claims Market. The increase in FTX’s claim pricing is attributed to the valuation of the artificial intelligence (AI) companies that the now-bankrupt crypto exchange previously invested in. </p><p>Creditors stake their claims to try to recoup some of their investment when businesses experience financial difficulties or bankruptcy. Investors frequently trade these claims based on their estimates of the total amount recovered. There is an increase in the estimated recovery value when the pricing of a claim rises.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/e3e610a5-68b7-46f5-93e9-fbfe40f6e2d2.png\"  /></figure><p>As the value of FTX’s investment in these AI companies jumped, so did the potential amount that could be recovered from its bankruptcy procedure. A claim is a legal assertion of a certain monetary amount. The claim percentage value refers to the percentage of the investment amount expected to be recovered from the platform. FTX claims value has jumped to the highest spot when compared with other bankrupt crypto firms, such as Celsius with 35–40%, Genesis with about 50%, Alameda with 10% and Three Arrows Capital with only 7–9%.</p><p>The surge in FTX claims also comes amid former FTX CEO Bankman-Fried’s public trial ending on Nov. 2, with the j<a href=\"https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-found-guilty-on-all-charges\">ury finding him guilty on all seven charges</a>. The judge will announce sentencing in March 2024.</p><h3>Sam Bankman-Fried is found guilty on all 7 charges in criminal trial </h3><p>Bankman-Fried was found guilty of all seven charges by a jury in New York after about four hours of deliberations.</p><p>Bankman-Fried was found guilty of two counts of wire fraud, two counts of wire fraud conspiracy, one count of securities fraud, one count of commodities fraud conspiracy and one count of money laundering conspiracy.</p><p>He will return to court for sentencing by New York District Judge Lewis Kaplan on March 28, 2024. Government prosecutors will recommend a sentence, but Kaplan will have the final say.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">SBF guilty on all charges. <br><br>Later dude. <br><br>I remember when consensus on this platform was that he was too politically connected to go to jail, the system was rigged, he would never get arrested, he would never go to court. <br><br>He was always going away, sorry conspiracy theorists.</p>&mdash; The Wolf Of All Streets (@scottmelker) <a href=\"https://twitter.com/scottmelker/status/1720228142084726923?ref_src=twsrc%5Etfw\">November 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Bankman-Fried’s crimes each carry a maximum sentence of between five and 20 years in prison, with the wire fraud, wire fraud conspiracy and money laundering conspiracy carrying a maximum 20-year sentence.</p><p>In a press conference outside the court, U.S. Attorney Damian Williams called Bankman-Fried’s crimes “a multibillion-dollar scheme designed to make him the king of crypto” and one of the biggest financial frauds in American history.</p><h3>SBF “lied to get customers’ trust,” prosecutor says</h3><p>U.S. Assistant Attorney Danielle Sassoon <a href=\"https://cointelegraph.com/news/sam-bankman-fried-lied-customers-trust-prosecution-makes-closing-argument-against-sbf\">presented the prosecution’s rebuttal</a> to Bankman-Fried’s defense on Nov. 2. </p><p>Speaking to the court, Sassoon claimed that prosecutors “met the burden” of proving <a href=\"https://cointelegraph.com/news/sam-bankman-fried-sbf-doubled-down-buying-binance-stake-ftx-u-s-prosecutors\">Bankman-Fried’s guilt</a> related to seven counts of fraud and conspiracy to commit fraud. She claimed that the former FTX CEO lied to customers about the safety of their funds, as well as FTX’s relationship with Alameda Research.</p><p>“He didn’t want to be a criminal on the run,” she said. “He lied to get customers’ trust.“ </p><p>Sassoon also claimed that Bankman-Fried avoided hiring a risk officer because he “knew what he was doing was wrong.“</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-03T20:30:39.000Z",
    "title": "Bitcoin Magazine Clashes With Federal Reserve Over Satirical ‘Fednow’ Merchandise",
    "url": "https://news.bitcoin.com/bitcoin-magazine-clashes-with-federal-reserve-over-satirical-fednow-merchandise/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/247-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Magazine Clashes With Federal Reserve Over Satirical &#039;Fednow&#039; Merchandise\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/247-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/247-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/247-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/247-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/247-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/247-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/247.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to Bitcoin Magazine, a media outlet dedicated to bitcoin news launched in 2012, representatives, including legal counsel, from the U.S. Federal Reserve have expressed concerns regarding the publication&#8217;s satirical Fednow merchandise. The Fed&#8217;s representatives assert that the parodied items, which bear the name, infringe upon its Fednow image and trademarks. Federal Reserve Challenges Bitcoin [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-03T20:10:32.000Z",
    "title": "OpenSea CEO announces layoffs for half of workforce",
    "url": "https://crypto.news/opensea-ceo-announces-layoffs-for-half-of-workforce/",
    "description": "Ethereum’s oldest NFT marketplace is downsizing its workforce as part of a \"2.0 strategy\" focused on community, product, and reliability. "
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-03T20:36:00.000Z",
    "title": "Vitalik Buterin, Lubin 1000x Bigger Fraudsters than SBF: Ex-ETH Insider",
    "url": "https://coinedition.com/vitalik-buterin-lubin-1000x-bigger-fraudsters-than-sbf-ex-eth-insider/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Vitalik-Buterin-Sends-200-ETH-to-Kraken-What-Does-This-Mean.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Vitalik Buterin Sends 200 ETH to Kraken - What Does This Mean\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Vitalik-Buterin-Sends-200-ETH-to-Kraken-What-Does-This-Mean.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Vitalik-Buterin-Sends-200-ETH-to-Kraken-What-Does-This-Mean-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Vitalik-Buterin-Sends-200-ETH-to-Kraken-What-Does-This-Mean-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Vitalik-Buterin-Sends-200-ETH-to-Kraken-What-Does-This-Mean-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Vitalik-Buterin-Sends-200-ETH-to-Kraken-What-Does-This-Mean-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Vitalik-Buterin-Sends-200-ETH-to-Kraken-What-Does-This-Mean-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Steven Nerayoff, a lawyer who has served as an advisor for Ethereum, has candidly alleged that the founders of Ethereum are greater fraudsters than the disgraced ex-CEO of FTX Sam Bankman-Fried (SBF), who is now dealing with a fraud trial. Nerayoff made the allegation on X in response to an update concerning the prosecution of&#160; [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/vitalik-buterin-lubin-1000x-bigger-fraudsters-than-sbf-ex-eth-insider/\">Vitalik Buterin, Lubin 1000x Bigger Fraudsters than SBF: Ex-ETH Insider</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]