[
  {
    "source": "Bitcoin.com",
    "date": "2023-06-05T04:00:04.000Z",
    "title": "Russia’s Rosbank Launches Crypto Payments Solution for Cross-Border Settlements",
    "url": "https://news.bitcoin.com/russias-rosbank-launches-crypto-payments-solution-for-cross-border-settlements/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1989960305-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Russia’s Rosbank Launches Crypto Payments Solution for Cross-Border Settlements\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1989960305-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1989960305-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1989960305-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1989960305-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1989960305-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1989960305-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1989960305.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Rosbank has become the first large Russian bank to offer clients an option to use cryptocurrencies in international settlements. The solution, provided in tandem with a Russian fintech, is mostly intended to meet the needs of businesses working with foreign partners. Russian Companies to Be Able to Pay Suppliers With Cryptocurrency Through Rosbank One of [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-05T04:08:09.000Z",
    "title": "Shiba Inu (SHIB) Poised For Significant Breakout: Here’s What To Watch Out For",
    "url": "https://www.newsbtc.com/news/shiba-inu-shib-poised-for-significant-breakout-heres-what-to-watch-out-for/",
    "description": "Shiba Inu (SHIB) has faced challenges in maintaining the level of liquidity it once enjoyed. In recent weeks, the coin has exhibited minimal volatility, leaving many investors wondering about its future direction.  However, despite the apparent inactivity, various indicators hint at the possibility of a substantial price movement in the near future. As the path ahead for SHIB seems somewhat restricted, it raises the question of where the coin may head next and what potential opportunities or hurdles lie ahead. Related Reading: Bedrock Upgrade: How Optimism Game-Changer Could Impact OP Price Shiba Inu (SHIB) Liquidity Woes During the peak of the 2021 bull market, Shiba Inu (SHIB) emerged as a prominent player, spearheading price rallies that garnered significant attention. As a result, ShibaSwap, the decentralized exchange associated with SHIB, experienced a surge in Total Value Locked (TVL), reaching an impressive $1.75 billion. However, the previously soaring TVL has taken a massive hit, plummeting to just $25.16 million, according to DefiLlama. At first glance, this dramatic decline in TVL may raise concerns about a potential liquidity crisis. Yet, a closer examination suggests that this situation may be temporary rather than a long-term predicament.  Recent data indicates a notable increase in SHIB purchases across various time intervals, and a closer look at wallet data reveals a mixed picture, with some ranges displaying an increase in holdings while others demonstrate a decrease. SHIB total market cap currently at $5.1 billion on the daily chart: TradingView.com SHIB Investors Show Confidence in Long-Term Potential  Upon analyzing on-chain data, Santiment&#8217;s chart reveals a notable pattern among SHIB token holders. Specifically, investors with SHIB holdings ranging from 1 to 1,000,000 tokens have demonstrated a consistent increase in their balances. This upward trend suggests that a considerable segment of the retail cohort holds a certain degree of belief in the long-term performance of this meme-inspired cryptocurrency. Related Reading: XRP Climbs 12% As Crypto Celebrates 11-Year Milestone Network usage data also highlights a decline in daily transactions, dropping from an average of 7,000 to approximately 3,500. Nonetheless, this is not necessarily indicative of an impending emergency. Instead, this could be part of a larger phase of stabilization for the token, as holders wait for a price rebound. 7/10 Network usage data is also worth noting &#8211; daily transactions have halved from an average of 7k to 3.5k. This decrease could signal a reduced interest in #SHIB, adding weight to the liquidity crisis theory. — U.Today (@Utoday_en) June 2, 2023 Given the current state of a stagnant price and reduced volatility, the likelihood of SHIB preparing for a significant price shift appears high. This prospect has garnered the attention of investors who are closely monitoring the market for any forthcoming developments. Source: Coingecko The SHIB price on CoinGecko is currently at $0.00000855, experiencing a slight 1.0% drop in the last 24 hours and a 3.1% decrease over the past seven days. -Featured image from Perfect Dog Breeds"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-05T03:54:48.000Z",
    "title": "Ethereum Price at Clear Risk of Further Losses After Multiple Rejections",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-rejections-1920/",
    "description": "Ethereum price started a fresh decline from the $1,920 resistance against the US Dollar. ETH is moving lower and might dive below the $1,850 support. Ethereum is struggling to gain bullish momentum above the $1,920 resistance. The price is trading below $1,900 and the 100-hourly Simple Moving Average. There was a break below a key bullish trend line with support near $1,895 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move down toward the $1,840 and $1,800 levels. Ethereum Price Faces Another Rejection Ethereum’s price attempted another increase above the $1,900 resistance. However, ETH struggled to clear the $1,920 resistance and started another decline, similar to Bitcoin. There was a move below the $1,900 support zone. The bears pushed the price below the 50% Fib retracement level of the upward move from the $1,838 swing low to the $1,914 high. Besides, there was a break below a key bullish trend line with support near $1,895 on the hourly chart of ETH/USD. Ether is now trading below $1,900 and the 100-hourly Simple Moving Average. It is also testing the 61.8% Fib retracement level of the upward move from the $1,838 swing low to the $1,914 high. If the price stays above the $1,865 support, it could attempt a fresh increase. Immediate resistance is near the $1,900 zone and the 100-hourly Simple Moving Average. The next major resistance is near the $1,900 level. A proper move above the $1,900 and $1,920 resistance levels might send Ether toward $1,940. Source: ETHUSD on TradingView.com The next resistance sits near $1,965, above which Ethereum could rise toward $2,000. Any more gains above the $2,000 resistance zone might send the price toward the $2,120 resistance. More Losses in ETH? If Ethereum fails to clear the $1,900 resistance, it could continue to move down. Initial support on the downside is near the $1,868 level. The next major support is near the $1,855 zone. If there is a break below the $1,855 support, the price could decline toward the $1,840 support. Any more losses may perhaps send the price toward the $1,800 level or even $1,740 in the coming sessions. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is below the 50 level. Major Support Level – $1,840 Major Resistance Level – $1,900"
  }
]