[
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T03:59:21.000Z",
    "title": "Windows 11 Introduces AI-Powered “Generative Eraser” for Photo Editing",
    "url": "https://www.cryptopolitan.com/windows-11-generative-eraser-photo-editing/",
    "description": "In a move that further solidifies Windows 11 as a cutting-edge operating system, Microsoft has unveiled its latest innovation: the Generative Eraser feature for the built-in Photos app. This AI-powered tool promises to revolutionize photo editing by effortlessly removing unwanted elements from images. Introducing the generative eraser feature in Windows 11 The real news lies [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T03:45:38.000Z",
    "title": "First-Ever ICO on Bitcoin Blockchain Goes Viral in Launch Week",
    "url": "https://www.cryptopolitan.com/first-ever-ico-on-bitcoin-blockchain-goes-viral-in-launch-week/",
    "description": "Bitcoin Dogs has unleashed upon the cryptosphere the first-ever Initial Coin Offering (ICO) on the hallowed Bitcoin blockchain.&#160; In little more than a week, it has captured investors&#8217; imaginations and wallets globally, raising $3m and promising the kind of opportunity that you dream of bragging to your friends about. With a presale window tightly leashed [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T03:45:34.000Z",
    "title": "Bitbot’s Security Features Make It a Standout Compared to Banana Gun",
    "url": "https://www.cryptopolitan.com/bitbots-security-features-make-it-a-standout-compared-to-banana-gun/",
    "description": "Trading bots have become part of every smart crypto trader&#8217;s weaponry, helping them find low-priced gems and execute automated trading strategies to deliver tremendous profits. Bitbot is looking to conquer the Telegram trading bot space, with its fast-selling presale already raising $640k since launching 5 weeks ago.&#160; With the Telegram trading bot space possessing a [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-23T04:00:00.000Z",
    "title": "Saylor stresses $1m Bitcoin potential, points to current price",
    "url": "https://crypto.news/saylor-stresses-1m-bitcoin-potential-points-to-current-price/",
    "description": "InQubeta and Bitcoin are rising. Michael Saylor expects BTC to reach $1 million"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-23T03:48:33.000Z",
    "title": "Ethereum Price At Make-or-Break Levels, Can ETH Surge To $3,200?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-eth-surge-3200/",
    "description": "Ethereum price is struggling below the $3,030 resistance. ETH is consolidating and might start a downside correction below the $2,930 support. Ethereum struggled to stay above the $3,000 level and corrected lower. The price is trading above $2,930 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support at $2,930 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a fresh increase unless there is a clear move below $2,930. Ethereum Price Hits Support Ethereum price made another attempt to gain pace above the $3,000 resistance zone. However, the bears were active above the $3,000 resistance. A new multi-week high is formed near $3,036 and the price started a downside correction, like Bitcoin. There was a move below the $3,000 and $2,980 levels. The price spiked below the 50% Fib retracement level of the upward move from the $2,865 swing low to the $3,036 high. However, the bulls are now active near the $2,940 level. Ethereum is now trading above $2,930 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support at $2,930 on the hourly chart of ETH/USD. The trend line is close to the 100-hourly Simple Moving Average and the 61.8% Fib retracement level of the upward move from the $2,865 swing low to the $3,036 high. Source: ETHUSD on TradingView.com Immediate resistance on the upside is near the $2,980 level. The first major resistance is near the $3,000 level. The next major resistance is near $3,035, above which the price might rise and test the $3,080 resistance zone. If there is a move above the $3,080 resistance, Ether could even rally toward the $3,200 resistance. Any more gains might call for a test of $3,250. More Losses In ETH? If Ethereum fails to clear the $3,000 resistance, it could continue to move down. Initial support on the downside is near the $2,930 level and the 100-hourly Simple Moving Average. The first major support is near the $2,865 level. The next key support could be the $2,820 zone. A clear move below the $2,820 support might send the price toward $2,720. Any more losses might send the price toward the $2,550 level in the coming days. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $2,865 Major Resistance Level – $3,000"
  }
]