[
  {
    "source": "CoinDesk",
    "date": "2023-09-29T20:47:54.000Z",
    "title": "The Most Pressing Issue on Ethereum is Validator Size Growth",
    "url": "https://www.coindesk.com/consensus-magazine/2023/09/29/the-most-pressing-issue-on-ethereum-is-validator-size-growth/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "If appetite for staking on Ethereum does not slow meaningfully over the next several months, the size of Ethereum’s validator set could become problematic for the blockchain, says Christine Kim, Vice President of Research at Galaxy Digital."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-29T21:00:00.000Z",
    "title": "Crypto Biz: Kraken offers stock trading as exchanges adapt to changing regulations",
    "url": "https://cointelegraph.com/news/crypto-biz-kraken-offers-stock-trading-exchanges-adapt-regulations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/0ae63f9d-9e38-43ca-8a13-221be06ae54a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This week’s Crypto Biz explores Kraken’s securities arm, Gemini’s expansion in India, Binance’s return to Belgium, and an oil company in Argentina investing in crypto mining.</p>\n                    <p><p>Cryptocurrency exchanges are adopting alternative strategies to conduct business in the face of tighter crypto regulatory environments worldwide. Signs are everywhere.</p><p>Kraken is reportedly moving to offer securities trading in the United States and the United Kingdom to expand its reach and compete with popular apps like Robinhood, which offer both crypto and stock trading. On the other hand, Gemini is expanding its presence in India with a $24 million investment in its development center. </p><p>Another challenge for crypto exchanges has been licensing and communication with regulators. Binance reopened its branch in Belgium this week after a three-month hiatus in the country due to problems with local regulators. </p><p>Kraken has also expanded its European licenses, and it now provides euro-to-crypto trading services in 27 European Union member states and European Economic Area countries. As crypto regulations evolve, exchanges are adapting to incorporate the practices of a new era.</p><p>This week’s Crypto Biz explores Kraken’s securities arm, Gemini’s expansion in India, Binance’s return to Belgium and an oil company in Argentina investing in crypto mining.</p><h2>Crypto exchange Kraken plans move into U.S. stock trading: Report</h2><p>Kraken reportedly <a href=\"https://cointelegraph.com/news/kraken-launches-stock-trading\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/kraken-launches-stock-trading/amp\">plans to offer trading services for stocks</a> and exchange-traded funds listed in the United States. The crypto exchange intends to launch its trading services in the U.S. and U.K. in 2024 through a new division called Kraken Securities. The expansion beyond cryptocurrencies would require licensing from the Financial Industry Regulatory Authority and financial regulators in the U.K., which the exchange reportedly already holds. Meanwhile, in Europe, Kraken <a href=\"https://cointelegraph.com/news/kraken-secures-money-license-registrations-spain-ireland\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/kraken-secures-money-license-registrations-spain-ireland/amp\">received an Electronic Money Institution license</a> from the Central Bank of Ireland and a virtual asset service provider (VASP) registration from the Bank of Spain. The Irish license enables Kraken to expand euro-to-crypto trading services to 27 European Union member states and European Economic Area countries. The VASP registration in Spain allows Kraken to offer exchange and wallet custodial services. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Cryptocurrency exchange <a href=\"https://twitter.com/krakenfx?ref_src=twsrc%5Etfw\">@krakenfx</a> is reportedly planning to expand its services by offering users the ability to trade stocks and ETFs listed in the United States <a href=\"https://t.co/mX0MlXOVkL\">https://t.co/mX0MlXOVkL</a></p>— Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1707126860952572337?ref_src=twsrc%5Etfw\">September 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Gemini invests $24 million for expansion in India</h2><p>Cryptocurrency exchange Gemini is allocating 2 billion rupees ($24 million) for its <a href=\"https://cointelegraph.com/news/gemini-invests-24-million-india-expansion\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/gemini-invests-24-million-india-expansion/amp\">expansion in India</a>. The funds will be used to grow the exchange’s development center in Gurgaon, a major satellite city of Delhi. Since its initial launch in May, the Gemini Gurgaon Development Center has expanded to over 70 staff, with active hiring for software engineers, technical product managers, talent acquisition, finance, support and compliance. In supporting the expansion, Gemini cited the Indian government’s “robust support framework that allows startups to thrive.” The move is part of Gemini’s “big plans for international growth this year in APAC.”</p><h2>Crypto exchange Binance reopens exchange services in Belgium</h2><p>Crypto exchange Binance <a href=\"https://cointelegraph.com/news/crypto-exchange-binance-resumes-services-belgium\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-exchange-binance-resumes-services-belgium/amp\">has reopened registrations and access</a> to products and services for Belgian users again — three months after Belgium’s finance regulator ordered the exchange to cease cryptocurrency-related services. “New registrations of Belgian residents are welcome on our platform once again,” Binance said, adding that various products and services will become accessible again to Belgian users who accept its new Terms of Use in the country. Binance has not disclosed what changes were made to allow it to resume services in Belgium. Elsewhere in Europe, Binance has signaled plans to <a href=\"https://cointelegraph.com/news/binance-delist-stablecoins-in-europe-mica-compliance\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-delist-stablecoins-in-europe-mica-compliance/amp\">delist stablecoins for the European market</a> by June 2024 to comply with the European Union’s incoming Markets in Crypto-Assets (MiCA) legislation, which is set to come into effect around that time.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Great news for our Belgian community <br><br>We've now reopened registrations and access to <a href=\"https://twitter.com/hashtag/Binance?src=hash&ref_src=twsrc%5Etfw\">#Binance</a> products and services in Belgium. <a href=\"https://t.co/IActiqYMjm\">https://t.co/IActiqYMjm</a></p>— Binance (@binance) <a href=\"https://twitter.com/binance/status/1706350568703156691?ref_src=twsrc%5Etfw\">September 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Argentine oil company to start mining crypto with gas power leftovers</h2><p>Tecpetrol, an oil company based in Buenos Aires, <a href=\"https://cointelegraph.com/news/argentinian-oil-company-starts-mining-crypto-gas-power-leftovers\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/argentinian-oil-company-starts-mining-crypto-gas-power-leftovers/amp\">has decided to convert excessive gas</a> into energy for cryptocurrency mining. According to local media reports, Tecpetrol plans to drill at least 35,000 barrels of oil daily at the facility, but given the absence of infrastructure to consume the gas being released in the process, the company decided to explore crypto mining. Tecpetrol hopes to start its mining activities between late October and early November. The primary goals are to reduce environmental impact by avoiding gas emissions and generating additional profits. As part of the plan, it is working with an American company with experience implementing similar strategies.</p><p><em>This week’s Crypto Biz explores Kraken’s securities arm, Gemini’s expansion in India, Binance’s return to Belgium and an oil company in Argentina investing in crypto mining.</em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n</p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-09-29T21:06:42.000Z",
    "title": "Analyst: Valkyrie likely pressured not to buy more Ethereum futures",
    "url": "https://crypto.news/analyst-valkyrie-likely-pressured-not-to-buy-more-ethereum-futures/",
    "description": "Valkyrie announced they will not purchase any more Ethereum futures, and it is suggested that the SEC may have pressured them to do so"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-29T20:47:26.000Z",
    "title": "SBI Holdings and TradeFinex partner to drive blockchain adoption in Japan",
    "url": "https://crypto.news/sbi-holdings-and-tradefinex-partner-to-drive-blockchain-adoption-in-japan/",
    "description": "SBI Holdings and TradeFinex have established a joint venture in Japan to promote their enterprise blockchain platform on the XDC Network"
  }
]