[
  {
    "source": "CoinDesk",
    "date": "2023-07-05T12:45:11.000Z",
    "title": "First Mover Americas: Cryptocurrency Trading Volumes Increase for First Time in Three Months ",
    "url": "https://www.coindesk.com/markets/2023/07/05/first-mover-americas-cryptocurency-trading-volumes-increase-for-first-time-in-three-months/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for July 5, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T13:00:00.000Z",
    "title": "OPNX launches ‘oUSD’ credit currency for crypto margin trading",
    "url": "https://cointelegraph.com/news/opnx-launches-ousd-credit-currency-for-crypto-margin-trading",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/10c2b1e4-c3be-489c-a869-5276e1232f3f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The new “credit currency” will allow users to rely on cryptocurrencies as collateral without needing to obtain loans from other institutions.</p>\n                    <p><p>Crypto futures exchange OPNX has launched a credit currency for margin trading, according to a July 5 statement made to Cointelegraph from the exchange’s co-founder, Mark Lamb. Called “oUSD,” the currency is available in its “phase 1” iteration, meaning that users cannot receive it without depositing crypto assets into the exchange. </p><p>In a future “phase 2” version, the platform intends to make oUSD available to users who deposit crypto into on-chain contracts to allow for possible “bankruptcy remoteness,” Lamb stated.</p><p>In the currency’s litepaper, oUSD is identified as a solution to three problems. First, lenders do not want to trust platforms to hold cash loans backed by crypto collateral. Second, exchanges and lending platforms don’t want to lend cash to margin traders, as this practice led to multiple bankruptcies during the 2022 bear market. Third, crypto derivatives traders want “portfolio margin,” or the ability to borrow and trade based on their crypto holdings rather than their stablecoin holdings.</p><p>To solve this problem, oUSD exists as a “credit currency.” It can be purchased at a 1-to-1 ratio with Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) or used to measure profit and loss when users rely on Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) or other cryptocurrencies as collateral. Users with a negative oUSD balance must pay an interest rate determined by holders of the platform’s native token, OX. Users who have a positive balance cash out by redeeming it for USDT.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/bd574560-ca4f-40d0-8ff8-8432c555dab6.png\"><figcaption style=\"text-align: center;\"><em>OPNX user interface. Source: OPNX</em></figcaption></figure><p>In a conversation with Cointelegraph, Lamb claimed that users would eventually be able to acquire oUSD by staking cryptocurrency within smart contracts outside the platform. This will allow them to have bankruptcy remoteness, protecting them from any possible insolvency at the exchange.</p><p>“The problem with most exchanges is that [...] you’re the broker, the exchange, the ATS, the reporting agent, you're every leg in the financial interaction,\" Lamb stated, further explaining:</p><blockquote>“If we can instead remove that custodial aspect and put that custody on-chain, we end up with a system where users have provable solvency, and they know that their collateral is not being touched. [...] And so you give users that bankruptcy remoteness, that protection of their assets, they then are able to trade on a safer exchange.”</blockquote><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/kyle-davies-donate-future-opnx-earnings-3ac-creditors\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/kyle-davies-donate-future-opnx-earnings-3ac-creditors/amp\"><strong>Kyle Davies to donate future OPNX earnings to 3AC creditors for ‘karma’</strong></a></em></p><p>OPNX <a href=\"https://cointelegraph.com/news/3ac-and-coinflex-launch-website-waitlist-for-crypto-claims-exchange\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/3ac-and-coinflex-launch-website-waitlist-for-crypto-claims-exchange/amp\">has been controversial since its inception</a>, as two of its co-founders, Kyle Davies and Su Zhu, were also the co-founders of failed hedge fund Three Arrows Capital. The exchange has been so heavily criticized that its CEO, Leslie Lamb, <a href=\"https://cointelegraph.com/news/opnx-ceo-scolds-claimed-backers-after-they-deny-investing-in-the-firm\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/opnx-ceo-scolds-claimed-backers-after-they-deny-investing-in-the-firm/amp\">has scolded investors for allegedly</a> misleading the public by distancing themselves from it.</p><p>In response to a question about this criticism, Lamb argued that Davies’ and Zhu’s mistakes have helped them make OPNX a better exchange.</p><blockquote>“I think Kyle and Su kind of portrayed the zeitgeist of the last crypto bull market well, and they lost the majority of their net worth, but they are building back, and that’s what I am doing as well, and that’s what everyone should do, [...] is just build back.”</blockquote><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T13:00:00.000Z",
    "title": "Is this the start of the next bull run?",
    "url": "https://cointelegraph.com/news/is-this-the-start-of-the-next-bull-run",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/48be665e-2f8e-442a-be2f-10c888b3cfd2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>On this week’s episode of The Market Report, Cointelegraph’s resident expert discusses whether Bitcoin touching $31,000 is a sign that the next bull run is right around the corner.</p>\n                    <p><p>In the latest episode of <em>The Market Report</em>, Cointelegraph analyst and writer Marcel Pechman discusses the latest change to the <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-filing-coinbase-surveillance-partner\">BlackRock spot Bitcoin exchange-traded fund (ETF) filing</a><a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-filing-coinbase-surveillance-partner\"></a>, which adds Coinbase as a “surveillance-sharing partner.“ Some analysts have signaled that the filings by BlackRock, Fidelity and others are responsible for the recent Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) rally toward $31,000, but according to Pechman, they’re only partially correct because it doesn’t indicate the United States Securities and Exchange Commission (SEC) will accept any of the ETF filings.</p><p>Pechman argues that in the case of a refusal by the SEC, a court decision may be needed. The SEC could be required to explain the rule for existing spot ETF markets, such as gold and oil, with the judge deciding if the same methodology has been applied to Bitcoin.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/Vl6vJGyIUZg\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>As for the recent Bitcoin rally, Pechman believes it was justified, but given the history of multiple consecutive rejections, and complaints regarding wash trading and price-making on Tether-based exchanges, one should not give it a 60% probability of approval.</p><p>Consequently, Pechman believes that the $30,000 support price for Bitcoin remains at risk due to macroeconomic uncertainties, namely the potential crisis and weak stock market performance, and the harsh regulatory environment towards cryptos.</p><p>On to the show’s next topic, Pechman explains how the Gemini exchange Earn program has been severely impacted by Genesis Trading, a DCG Company, and why the <a href=\"https://cointelegraph.com/news/cameron-winklevoss-open-letter-barry-silbert-final-offer\">Winklevoss brothers knew exactly what the risks were.</a></p><p>But, regardless of DCG’s Barry Silbert acting in an antithetical and unfair manner, investors believe $25 billion in crypto is at risk. According to Pechman, DCG owns Grayscale, which happens to manage the Bitcoin Trust, a tradable investment fund worth $19 billion in Bitcoin, besides a similar instrument for Ether holding $6 billion.</p><p>Want to know what Pechman’s opinion is on the odds of Grayscale Fund liquidation and whether or not we’ve entered a bull market? Get those answers in the latest \"The Market Report\", a show that runs exclusively on the new <a href=\"https://www.youtube.com/@cointelegraphmarketresearch\" target=\"_blank\" rel=\"noopener nofollow\">Cointelegraph Markets &amp; Research YouTube channel</a>.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-05T12:48:00.000Z",
    "title": "Reserve Bank of India Explores Cross-Border Payments with Digital Rupee",
    "url": "https://cryptobriefing.com/reserve-bank-india-explores-digital-rupee/?utm_source=feed&utm_medium=rss",
    "description": "The Reserve Bank of India (RBI) is actively exploring the potential of its digital currency, the digital rupee, for cross-border transactions. The RBI is in discussions with central banks from..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-05T13:00:00.000Z",
    "title": "ERC 7265: What It Means For DeFi Security and Ethereum $ETH",
    "url": "https://cryptodaily.co.uk/2023/07/erc-7265-what-it-means-for-defi-security-and-ethereum-eth",
    "description": "<p class=\"md-end-block md-p\">In the wake of a series of high-profile security breaches plaguing the decentralized finance (DeFi) space, a proposed solution has emerged from the Ethereum community.</p>\n<p class=\"md-end-block md-p\">A group of Ethereum community members has put forth a new standard, ERC 7265, aiming to enhance the security of DeFi protocols. This standard could be pivotal in mitigating the risk of significant losses due to hacks and other security threats in an increasingly vulnerable DeFi landscape.</p>\nAlarming Vulnerabilities\n<p class=\"md-end-block md-p\">The decentralized finance (DeFi) landscape has been marred by an upswing in security breaches recently, with protocols including Poly Network, Chibi Finance, Sturdy Finance, Jimbos Protocol on Arbitrum, Hundred Finance, Sentiment, Deus Finance, and Tornado Cash, among others, all falling prey to malicious actors.</p>\n<p class=\"md-end-block md-p\">As these attacks escalate, both in frequency and impact, this proposal addresses some of the risks that the aforementioned exploits represent. The urgency for effective protective measures in the DeFi sector has been driven by several high-profile hacking incidents. </p>\n<p class=\"md-end-block md-p\">These incidents highlight a critical vulnerability in the DeFi sector. Once protocols are compromised, the damage is often irreparable, causing total value locked (TVL) to plummet to zero within seconds. Against this backdrop, the Ethereum community is rallying to propose a standard known as ERC 7265.</p>\nCircuit Breaker: ERC 7265\n<p class=\"md-end-block md-p\">The Ethereum community's proposed standard, ERC 7265, suggests the integration of a \"circuit breaker\" into DeFi protocols. This feature could act as a fail-safe in smart contracts, stopping token transactions before they exit contracts during a hack.</p>\n<p class=\"md-end-block md-p\">\"ERC 7265 allows teams to create a circuit breaker protecting their protocol, with highly customized rate limit parameters per asset,\" explains Meir Bank of Fluid Protocol. In the event of a hack, he says, \"the attacker will no longer be able to drain an entire contract in seconds. The majority of funds can be recovered.\"</p>\n<p class=\"md-end-block md-p\">The ERC 7265 standard is primarily intended for DeFi protocols that can be upgraded by governance, a common practice in DeFi. Bank assures that this integration carries few downsides and numerous benefits for such governed DeFi protocols.</p>\nThe Path Forward?\n<p class=\"md-end-block md-p\">ERC 7265 is currently in the proposal stage and awaits approval by the broader Ethereum community. If accepted and implemented by core developers, it could become a critical tool in the ongoing battle against DeFi hacks.</p>\n<p class=\"md-end-block md-p\">The proposed ERC 7265 could play a key role in improving Ethereum's ecosystem. It comes in response to ongoing security worries in DeFi protocols, many of which are based on Ethereum. As we see, these requent exploits have shaken trust in these platforms.The Ethereum community's proactive stance in proposing ERC 7265 underscores the industry's commitment to tackling the security issues head-on. As DeFi continues to mature and evolve, protective measures like this circuit breaker may prove crucial in safeguarding protocols and building trust within the community. In the dynamic world of DeFi, one thing remains certain: security must remain at the forefront of every attempt at innovation.</p>\n<p class=\"md-end-block md-p\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T13:01:46.000Z",
    "title": "Singapore Bank DBS launches innovative e-CNY payment solution for customers",
    "url": "https://www.cryptopolitan.com/singapore-bank-dbs-launches-innovative-e-cny-payment-solution-for-customers/",
    "description": "DBS, the renowned Singaporean bank, announced today a groundbreaking development that allows its customers to accept payments in e-CNY, the digital currency issued by the Chinese central bank. In a major step forward, DBS has established a seamless system through which e-CNY can be directly settled into a company&#8217;s bank account, leveraging automated processes for ... <a title=\"Singapore Bank DBS launches innovative e-CNY payment solution for customers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/singapore-bank-dbs-launches-innovative-e-cny-payment-solution-for-customers/\" aria-label=\"More on Singapore Bank DBS launches innovative e-CNY payment solution for customers\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T12:47:17.000Z",
    "title": "Dogecoin (DOGE): 2023 Price Predictions and Market Analysis",
    "url": "https://www.cryptopolitan.com/dogecoin-doge-2023-price-predictions-and-market-analysis/",
    "description": "From Uwerx&#8217;s (WERX) groundbreaking presale to Kava (KAVA) and Dogecoin&#8217;s (DOGE) potential market maneuvers, the 2023 crypto market holds an intriguing forecast. Uwerx (WERX), aiming to transform the freelance economy with its minimal 1% commission, has set the stage ablaze with its ongoing presale.&#160; Meanwhile, Kava (KAVA) and Dogecoin (DOGE), two digital currencies making waves ... <a title=\"Dogecoin (DOGE): 2023 Price Predictions and Market Analysis\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dogecoin-doge-2023-price-predictions-and-market-analysis/\" aria-label=\"More on Dogecoin (DOGE): 2023 Price Predictions and Market Analysis\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-05T13:00:43.000Z",
    "title": "Zilliqa (ZIL) Notches 10% In Anticipation Of Network Upgrade",
    "url": "https://www.newsbtc.com/altcoin/zilliqa-zil-notches-10-in-anticipation-of-network-upgrade/",
    "description": "The ZIL token has seen a jump in its price over the last day in anticipation of the latest Zilliqa network upgrade. According to data by CoinMarketCap, ZIL has now gained 10.13% in the last 24 hours, emerging as the top gainer of the day.  Zilliqa Network Upgrade Now Underway According to a tweet by Zilliqa&#8217;s official Twitter handle, its mainnet network upgrade v9.2 has commenced today, July 5, as scheduled.  This network upgrade is expected to introduce vital improvements to the Zilliqa network, most notably increased interoperability between the Scilla &#8211; the platform&#8217;s customized smart contract language &#8211; and the Ethereum Virtual Machine.  Related Reading: Stablecoins Volume Down Despite Crypto Market Recovery, Ratings Agency Finds Furthermore, the upgrade will look to augment Zilliqa&#8217;s security and functionality by extending support for third-party EVM contracts and implementing full backward compatibility with all existing Scilla (v0.13.3) contracts.  That said, as the Zilliqa network upgrade got closer, its native token, ZIL, has experienced significant buying pressure in the last few days.  Most notably, in the early hours of today, ZIL gained by 11% moving from $0.0222 to hit a price of $0.0247 for the first time since the first week of June. Following that price gain, the ZIL token witnessed a slight price loss finding support at the $0.0237 price level and has since remained in that price zone. At the time of writing, Zilliqa (ZIL) is exchanging hands at $0.238, with a 0.10% decrease in the last hour. However, the token’s daily trading volume is up by 189.83% and is valued at $83 million. With a total market cap value of $377 million, Zilliqa is ranked as the 93rd biggest cryptocurrency. Zilliqa’s Price Analysis  Looking at ZIL’s hourly chart, the Relative Strength Index shows the token is descending from the overbought zone indicating the bullish run may be over.  Furthermore, Ziliqa’s Moving Average Convergence Divergence (MACD) is just about crossing the signal line, meaning a potential incoming bearish run is on the horizon. According to chart data, ZIL appears to have encountered a resistance zone at the $0.0250 price mark. If the bulls are able to increase the buying pressure and push ZIL past this barrier, the token is expected to resume its upward price trajectory.  Related Reading: What’s Next For Bitcoin Price? Bulls Aren’t Running Out Of Steam Yet However, a significant level of selling pressure in the market could drive the token’s price as low as $0.0225, which represents its next support level. If this support level falls to hold, ZIL is likely to fall to the price level of $0.02.  Launched in 2019, Zilliqa is a public, permissionless blockchain, equipped with a sharded architecture designed to address the scalability and throughput issues common with most blockchains. ZIL Trading At $0.0228 On The Hourly Chart &#124; Source: ZILUSD Chart On Tradingview.com Featured Image from Binance Academy, Chart from Tradingview."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-05T12:46:30.000Z",
    "title": "Mercuryo’s Big Time Summit in Cyprus: Revolutionizing the FinTech Industry",
    "url": "https://www.newsbtc.com/news/mercuryos-big-time-summit-in-cyprus-revolutionizing-the-fintech-industry/",
    "description": "The global payments infrastructure platform Mercuryo has announced the launch of Big Time Summit – a FinTech event to be held for the first time in Limassol, Cyprus, on July 7, 2023.  The event will be held with the support of Invest Cyprus, Mercuryo&#8217;s trusted partner. Their team is ready to support businesses during the location selection process and expanding operations in Cyprus.  Offering unparalleled value to professionals in the field, the conference will gather over 400 FinTech thought leaders, and industry innovators from around the globe. In order to put the Big Time Summit together, Mercuryo has partnered with a number of major industry representatives, including names like Binance, Coinbase, TrustWallet, MetaMask, 1inch, and Consensys.  Mercuryo has also struck an exclusive partnership with the international PR firm Drofa Comms for the purposes of providing media support and coverage of the event in global media. Throughout the course of the Summit, a lineup of 20+ keynote speakers will hold panels, roundtables and workshops on the topics relevant to the FinTech sector, discussing what trends and drivers this industry is seeing today. The event will also include plenty of opportunities for networking and an evening party where attendees will be able to engage in conversations of their preference.  The topics to be covered as part of the conference include leveraging blockchain technology in businesses, the latest trends in digital payments, current regulation landscape, and valuable learnings taken from a tumultuous period in the CEX and DEX markets.  Events like Big Time Summit represent a crucial element in the development of the global FinTech stage because they allow numerous participants of this market to interact with peers and industry leaders and exchange experiences. They get to share opinions and insights about the ongoing market agenda, as well as emerging trends and technologies.  “Attending such events is how industry members get to stay up-to-date on all the recent developments, broaden their knowledge base, and contribute to shaping the future of finance worldwide. At Mercuryo, we recognize this and it is our intention to hold more such events in the upcoming years,” – states Petr Kozyakov, CEO of Mercuryo. About Mercuryo Mercuryo is a global payments infrastructure platform, providing businesses from both the fiat and crypto worlds with a wide range of financial services accessible through API integration. Since its inception in 2018, Mercuryo has secured over 200 partners, working with leading industry players to accelerate growth and boost enterprise revenues worldwide. &#160;"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-05T13:00:00.000Z",
    "title": "Primex Finance Unveils Mainnet Plans, Set to Launch in September 2023",
    "url": "https://coinedition.com/primex-finance-unveils-mainnet-plans-set-to-launch-in-september-2023/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/pr-2-51.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/pr-2-51.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/pr-2-51-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/pr-2-51-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/pr-2-51-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/pr-2-51-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/pr-2-51-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/pr-2-51-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/pr-2-51-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/pr-2-51-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/pr-2-51-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/pr-2-51-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/pr-2-51-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/pr-2-51-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/pr-2-51-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/pr-2-51-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/pr-2-51-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Non-custodial prime brokerage protocol Primex Finance is thrilled to announce the upcoming launch of its highly anticipated mainnet. With the code frozen and the auditing process underway, the Primex core team is making significant strides towards the release. With independent auditors expected to complete the auditing process in the next 12 weeks, Primex Finance is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/primex-finance-unveils-mainnet-plans-set-to-launch-in-september-2023/\">Primex Finance Unveils Mainnet Plans, Set to Launch in September 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-05T12:49:00.000Z",
    "title": "STORJ’s Massive Spike Could Witness Price Retracement Soon",
    "url": "https://coinedition.com/storjs-massive-spike-could-witness-price-retracement-soon/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Detecting a massive surge in the crypto world, the web3 data analytics platform Lookonchain observed that the price of STORJ rose by nearly 45% today. Lookonchain notified the community that the Storj team deposited 2.5 million STORJ to Binance after the altcoins&#8217; double-digit spike in one day. The web3 data analytics platform concluded its analysis [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/storjs-massive-spike-could-witness-price-retracement-soon/\">STORJ’s Massive Spike Could Witness Price Retracement Soon</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]