[
  {
    "source": "CoinDesk",
    "date": "2023-07-19T16:54:29.000Z",
    "title": "UK FCA Chief Warns Against Judging Crypto Firms by Size for Approval Decisions",
    "url": "https://www.coindesk.com/policy/2023/07/19/uk-fca-chief-warns-against-judging-crypto-firms-by-size-for-approval-decisions/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The FCA has turned down some of the largest crypto firms in the world in the last 18 months, its CEO Nikhil Rathi told lawmakers at a hearing."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-19T16:53:47.000Z",
    "title": "Stablecoin Issuer Lybra Finance Launches Arbitrum Testnet Amid Quest to Be More DeFi-Friendly",
    "url": "https://www.coindesk.com/business/2023/07/19/stablecoin-issuer-lybra-finance-launches-arbitrum-testnet-amid-quest-to-be-more-defi-friendly/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Users can now interact with Lybra’s new companion stablecoin peUSD, which is said to be more compatible with decentralized finance protocols than the protocol’s main stablecoin eUSD."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-19T16:57:19.000Z",
    "title": "Robert F. Kennedy Jr. Wants Bitcoin Backed U.S. Dollars and Tax Breaks for Investors",
    "url": "https://decrypt.co/149222/robert-f-kennedy-jr-wants-bitcoin-backed-u-s-dollars-and-tax-breaks-for-investors",
    "description": "“Bitcoin is among the hardest currencies and the Kennedy administration is going to encourage its proliferation and propagation,” he said."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-19T16:45:23.000Z",
    "title": "AI Won’t Replace Human Spies, Says Britain’s MI6 Chief",
    "url": "https://decrypt.co/149220/ai-wont-replace-human-spies-says-britains-mi6-chief",
    "description": "The head of Britain’s SIS says ‘human factors’ important in intelligence gathering can’t yet be replicated by AI."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-19T16:56:12.000Z",
    "title": "Crypto.com Puts Luxury on Your Finger with Bäumer Vendôme NFT Collection",
    "url": "https://cryptobriefing.com/crypto-com-baumer-vendome-nft-collection/?utm_source=feed&utm_medium=rss",
    "description": "Bumer Vendme, a well-established name in high jewelry with three decades of crafting exceptional pieces, has pioneered a unique NFT collection based on Crypto.com&#8217;s NFT platform. The Maison has revealed..."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-19T17:00:55.000Z",
    "title": "B2BinPay Now Offers Branded Hardware Wallets Through Collaboration With Ledger",
    "url": "https://news.bitcoin.com/b2binpay-now-offers-branded-hardware-wallets-through-collaboration-with-ledger/",
    "description": "<img width=\"768\" height=\"416\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-768x416.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-300x162.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-1024x554.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-768x416.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed.png 1432w\" sizes=\"(max-width: 768px) 100vw, 768px\" />B2BinPay, a leading crypto-processing platform, has revealed a new partnership with Ledger, the global platform for digital assets. As a result of this collaboration, clients of B2BinPay will have the chance to acquire a limited-edition Ledger Nano X, which will be branded with the B2BinPay logo. B2BinPay will provide unique Ledgers to its new merchants [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-19T17:00:53.000Z",
    "title": "Ethereum Monthly Burn Surpasses 146,000 ETH As Total Clears $6.5 Billion",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-monthly-burn-surpasses-146000-eth/",
    "description": "Featuring Ethereum Improvement Proposal (EIP) 1559, the London hard fork introduced significant changes to Ethereum’s transaction fee mechanism. Users now pay a base fee that is subsequently burned, effectively removing ether from circulation forever. This approach significantly impacted the token&#8217;s supply, resulting in a monthly burn rate of approximately 146,000 ETH. The London Hard Fork And Its Deflationary Impact Integrated into the Ethereum network on August 5, 2021, the London hard fork brought a paradigm shift in the cryptocurrency&#8217;s transaction fee structure. Through the EIP-1559, the network introduced a unique mechanism that involved the burning of a significant portion of transaction fees, known as the &#8220;base fee.&#8221; This innovative approach aimed to counterbalance Ethereum&#8217;s inflation while providing block rewards and priority fees to miners. Related Reading: ARK Invest CEO Says Firm Is Still Bullish On Coinbase Despite Selling COIN Stocks As a result, the base fee is permanently removed from circulation, leading to a deflationary effect on the token&#8217;s supply. The scale of the burn has been enormous, with over 3.46 million ETH, worth $6.68 billion, annihilated since the London hard fork&#8217;s enforcement. This translates to an average monthly burn rate of more than 146,000 ETH over the 710-day period that followed the upgrade. 146,000 ETH burned per month &#124; Source: Beaconcha.in Ethereum&#8217;s deflationary path effectively offset the issuance of new tokens, curbing its supply growth by approximately 0.1% annually. Leading Contributors To The Ethereum Burn The principal factors driving Ethereum&#8217;s burn phenomenon include regular ETH transfers, non-fungible token (NFT) transactions on Opensea, and activities on the decentralized exchange Uniswap. Regular ETH transfers accounted for the most substantial reduction in supply, leading to the incineration of nearly 300,000 ETH. Uniswap v2 follows closely, with $56.5 million worth of ETH burned since the hard fork, while transfers of Tether stablecoins contributed to the destruction of $50.5 million worth of ETH. ETH price struggles to hold $1,900 support &#124; Source: ETHUSD on TradingView.com Blockchain gaming platform Axie Infinity and Uniswap v3 each burned $32 million and $30 million worth of ETH, respectively. At the same time, the number of ETH staked in the Ethereum Beacon contract has also been on the rise. It is now sitting at over 26.87 million ETH, translating to a dollar value of $51.35 billion. Related Reading: USDC Market Cap Drops As Redemptions Climb To $1.4 Billion With the Ethereum supply sitting at 120.2 million, it means that over 11% of its supply is currently locked up while the burn continues to take coins out of circulation. Both of these developments combined could see the circulating supply of the digital asset reduce drastically, leading to a rise in the price of ETH as time goes on. ETH is currently trading at a price of $1,903 at the time of this writing, representing a 0.72% increase in the last day. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-19T16:46:37.000Z",
    "title": "This is Why Chainlink’s CCIP Is a Game Changer for Trillion-Dollar Banks, SWIFT, Stellar (XLM), and the Entire Industry",
    "url": "https://www.crypto-news-flash.com/this-is-why-chainlinks-ccip-is-a-game-changer-for-trillion-dollar-banks-swift-stellar-xlm-and-the-entire-industry/?utm_source=rss&utm_medium=rss&utm_campaign=this-is-why-chainlinks-ccip-is-a-game-changer-for-trillion-dollar-banks-swift-stellar-xlm-and-the-entire-industry",
    "description": "<img width=\"1200\" height=\"630\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Chainlink X SWIFT\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-300x158.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-1024x538.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-768x403.jpeg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-351x185.jpeg 351w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-24x13.jpeg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-36x19.jpeg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-48x25.jpeg 48w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Chainlink launches its Cross-Chain Interoperability Protocol (CCIP) to address some security concerns and advance its ecosystem. CCIP is said to be different from other cross-chain solutions with its unique features and user experience. Chainlink launches its core productive tool, the Cross-Chain Interoperability Protocol (CCIP), on the mainnet as part of the effort to solidify its [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-19T16:55:24.000Z",
    "title": "Former SEC and CFTC Heads Say Both Agencies Should Work Jointly To Regulate Crypto: Report",
    "url": "https://dailyhodl.com/2023/07/19/former-sec-and-cftc-heads-say-both-agencies-should-work-jointly-to-regulate-crypto-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/former-sec-heads-both.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/former-sec-heads-both.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/former-sec-heads-both.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/former-sec-heads-both.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/former-sec-heads-both.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/former-sec-heads-both.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/former-sec-heads-both.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The former chairs of two top US financial regulators think their old agencies need to work hand in hand to regulate crypto. Jay Clayton, the former chair of the Securities and Exchange Commission (SEC), and Timothy Massad, the former chair of the Commodity Futures Trading Commission (CFTC), co-wrote an opinion piece about domestic crypto policy [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/19/former-sec-and-cftc-heads-say-both-agencies-should-work-jointly-to-regulate-crypto-report/\">Former SEC and CFTC Heads Say Both Agencies Should Work Jointly To Regulate Crypto: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]