[
  {
    "source": "Cointelegraph",
    "date": "2024-01-03T10:00:47.000Z",
    "title": " Bitcoin ETF race will push issuers to disclose addresses — Samson Mow ",
    "url": "https://cointelegraph.com/news/bitcoin-etf-race-disclose-addresses-samson-mow",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZWM4ZmMzYTQtNzk4NS00YTI3LWEzMWMtMzcyY2NkMWQxN2RiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A situation where a spot Bitcoin ETF issuer fakes the underlying BTC volumes is hypothetically possible in case an issuer violates the rules, Samson Mow said.</p>\n                    <p><p>Some issuers of potential spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded funds (ETF) will eventually have to disclose the on-chain addresses for the underlying BTC to compete with other issuers, according to one industry activist.</p><p>Disclosures of verifiable on-chain proofs showing Bitcoin reserves would be the best option for spot Bitcoin ETF issuers to ensure their holdings, according to Jan3 CEO Samson Mow. But none of the existing 14 applicants have been working to provide on-chain proofs, Mow said in an interview with Cointelegraph on Dec. 28.</p><p>Some cryptocurrency observers have been skeptical about the underlying holdings of a spot Bitcoin ETF, with certain executives even <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-millions-unbacked-btc\">suggesting that a spot Bitcoin ETF could potentially create</a> “millions of unbacked BTC.”</p><p><a href=\"https://cointelegraph.com/news/bitcoin-etf-race-disclose-addresses-samson-mow\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-03T09:47:36.000Z",
    "title": " What are Telegram trading bots and how to use them in crypto? ",
    "url": "https://cointelegraph.com/news/what-are-telegram-trading-bots",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOGRkMGFhMWQtMzAwMC00ZDJkLWJlNjktZGQyMWNjNTk5NGFjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Explore the world of crypto trading within Telegram using specialized bots, offering efficiency and convenience. </p>\n                    <p><p>Telegram trading bots redefine trading simplicity by executing commands without missing a beat. Dive into a realm where algorithms reign supreme, making trading an art of precision.</p><p>Automated programs known as Telegram trading bots can be easily integrated with the Telegram messaging platform via its bot <a href=\"https://cointelegraph.com/learn/a-beginners-guide-to-blockchain-apis\">application programming interface (API)</a>. This integration allows users to communicate with the trading bot over chat, provide commands, get updates, and execute trades using interactive buttons or straightforward text commands within the Telegram interface.</p><p>Unibet (Unibot) is an example of a Telegram crypto bot. It was designed to enable quick swaps and snipers; it was first presented as the fastest Telegram Uniswap sniper accessible for a 1% transaction charge. </p><p><a href=\"https://cointelegraph.com/news/what-are-telegram-trading-bots\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-03T09:43:25.000Z",
    "title": "Bitcoin outshines Ethereum, leads for four successive quarters in performance",
    "url": "https://cryptoslate.com/insights/bitcoin-outshines-ethereum-leads-for-four-successive-quarters-in-performance/",
    "description": "<p>Quick Take Bitcoin has maintained a notable ascendancy over Ethereum throughout 2023, sustaining a performance that outstripped Ethereum each quarter. In Q1, Bitcoin&#8217;s value surge of 72% significantly overshadowed Ethereum&#8217;s 52% increase. The trend continued into Q2, with Bitcoin and Ethereum growing at 7% and 6% respectively. While both experienced a downturn in Q3, Bitcoin&#8217;s [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoin-outshines-ethereum-leads-for-four-successive-quarters-in-performance/\">Bitcoin outshines Ethereum, leads for four successive quarters in performance</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-03T09:56:45.000Z",
    "title": "IT Operations Facing Challenges in 2024",
    "url": "https://www.cryptopolitan.com/it-operations-facing-challenges-in-2024/",
    "description": "As the year 2024 unfolds, the enterprise network market is poised for significant changes, driven by the evolving landscape of IT operations and emerging technologies. One key trend that is expected to shape the industry is the growing strain on IT operations teams. This strain is a direct consequence of IT&#8217;s multifaceted role, the rapid [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-03T09:52:50.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-03T09:50:19.000Z",
    "title": "Emotional Intelligence Must Guide Artificial Intelligence in Healthcare",
    "url": "https://www.cryptopolitan.com/emotional-intelligenceguide-ai-in-healthcare/",
    "description": "In the rapidly evolving landscape of healthcare, the integration of Artificial Intelligence (AI) has been met with both excitement and skepticism. While AI holds the potential for efficiency and precision, it cannot replace the essential human touch and emotional connection that patients often need. This article explores the importance of Emotional Intelligence (EI) in guiding [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-03T09:49:59.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 How much is Bitcoin (BTC) worth? Today, the price of Bitcoin stands at $45,272, with a trading volume over the past 24 hours reaching $24 billion. Its market capitalization is $887 billion, and it currently commands 54% of the market share. Over the last 24 hours, the BTC price has experienced [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-03T09:44:09.000Z",
    "title": "AI-Driven Professional Development Boosts Math Teacher Effectiveness",
    "url": "https://www.cryptopolitan.com/ai-development-boosts-math-teacher/",
    "description": "AI technology has demonstrated its potential to enhance the skills of middle school math teachers, resulting in improved student performance, according to a recent study. The study, conducted by a team of researchers, implemented an online professional development program that leveraged artificial intelligence (AI) to empower math educators. The results of this experiment reveal significant [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-03T10:05:59.000Z",
    "title": "Michael Saylor starts selling $216m in MicroStrategy shares to purchase more BTC",
    "url": "https://crypto.news/michael-saylor-starts-selling-216m-in-microstrategy-shares-to-purchase-more-btc/",
    "description": "Michael Saylor, MicroStrategy&#8217;s Executive Chairman, has initiated a four-month plan to sell $216 million of his MicroStrategy shares, previously stating his intention to use part of the proceeds to buy additional Bitcoin (BTC). Saylor revealed in a Jan. 2 filing&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-03T10:04:29.000Z",
    "title": "South Korea excludes decentralized crypto wallets from overseas declarations",
    "url": "https://crypto.news/south-korea-excludes-decentralized-crypto-wallets-from-overseas-declarations/",
    "description": "South Korea&#8217;s National Tax Service (NTS) has updated its position on virtual assets. In a new statement, NTS clarified its position regarding the owners of decentralized crypto wallets. Thus, individuals who own virtual assets through non-custodial decentralized wallets, such as&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-03T10:00:00.000Z",
    "title": "XRP and Chainlink bullish, ELDG holders to get free night stays at luxury resorts",
    "url": "https://crypto.news/xrp-and-chainlink-bullish-eldg-holders-to-get-free-night-stays-at-luxury-resorts/",
    "description": "XRP and Chainlink are bullish. Meanwhile, Everlodge is gaining traction as ELDG holders are set to receive multiple benefits"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-03T10:00:38.000Z",
    "title": "Solana (SOL) Sets Yearly Record Above $115; The Graph (GRT) and InQubeta (QUBE) Emerge as Investor Favorite Picks",
    "url": "https://www.crypto-news-flash.com/solana-sol-sets-yearly-record-above-115-the-graph-grt-and-inqubeta-qube-emerge-as-investor-favorite-picks/?utm_source=rss&utm_medium=rss&utm_campaign=solana-sol-sets-yearly-record-above-115-the-graph-grt-and-inqubeta-qube-emerge-as-investor-favorite-picks",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-35-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" />Solana (SOL) made its way onto 2023&#8217;s best-performing cryptocurrencies lists by rising above $115. Solana&#8217;s surge served as the perfect finale for what was an eventful year for the cryptocurrency. Its market run over the past was dotted with multiple achievements including outperforming Ethereum. The other names on crypto investors&#8217; list of favorites were InQubeta [...]"
  }
]