[
  {
    "source": "CoinDesk",
    "date": "2023-07-28T02:00:18.000Z",
    "title": "U.S. Stablecoin Bill Takes Big Step Despite Fight From Democrats, White House",
    "url": "https://www.coindesk.com/policy/2023/07/28/us-stablecoin-bill-takes-big-step-despite-fight-from-democrats-white-house/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "House lawmakers cleared stablecoins legislation for the next step in its route through Congress on Thursday, though the House Financial Services Committee moved the bill toward a potential floor vote without bipartisan support as Chair Patrick McHenry (R-N.C.) blamed White House objections for the stalemate."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-28T01:46:00.000Z",
    "title": "Grayscale urges SEC to approve all Bitcoin ETFs simultaneously",
    "url": "https://cointelegraph.com/news/grayscale-sec-approve-all-bitcoin-etfs-together",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/269d9258-2ebb-446c-9384-c415e12bff8d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Grayscale's ETF was previously knocked back by the SEC and it wants it and competing ETFs approved together so none have an advantage.</p>\n                    <p><p>Crypto fund manager Grayscale is urging the Securities and Exchange Commission (SEC) to approve all proposed spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded funds (ETFs) at the same time to avoid one having an advantage.</p><p>A July 27 <a href=\"https://grayscale.com/grayscales-latest-gbtc-comment-letter/\" target=\"_blank\" rel=\"noopener nofollow\">post</a> by Grayscale chief legal officer Craig Salm said its legal team submitted a <a href=\"https://grayscale.com/wp-content/uploads/2023/07/97062447v22-Grayscale-Comment-Letter-7.27.2023.pdf\" target=\"_blank\" rel=\"noopener nofollow\">letter</a> regarding eight <a href=\"https://cointelegraph.com/learn/bitcoin-etfs-a-beginners-guide-to-exchange-traded-funds\">spot Bitcoin ETF</a> filings — including its own — arguing the SEC shouldn’t pick “winners and losers” and instead make a fair and orderly decision.</p><p>The letter claimed the SEC could approve the spot ETFs based on its <a href=\"https://cointelegraph.com/news/grayscale-lawyers-sec-approval-volatility-shares-etf-lawsuit\">approvals for Bitcoin futures ETFs</a> saying the two fund types are “inextricably linked.”</p><p>Grayscale added recent surveillance sharing agreements (SSAs) <a href=\"https://cointelegraph.com/news/cboe-and-coinbase-enter-bitcoin-etf-surveillance-agreements\">between Coinbase</a> and the spot ETF providers are “not a new idea” and claimed they would not meet the SEC’s standards.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The SEC should approve spot <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcoin</a> ETFs to trade in the US. <br>What’s more, their previous approval of bitcoin futures ETFs shows that they are already in a position to do so. <br>Read more about the latest from our legal team: <a href=\"https://t.co/UC8ksqNcwy\">https://t.co/UC8ksqNcwy</a> <a href=\"https://twitter.com/search?q=%24GBTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$GBTC</a> <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a></p>&mdash; Grayscale (@Grayscale) <a href=\"https://twitter.com/Grayscale/status/1684681713962921986?ref_src=twsrc%5Etfw\">July 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>ETF filings from Invesco, BlackRock, Valkyrie, VanEck, Wisdom, Fidelity and ARK Invest were recently updated to include SSAs with Coinbase.</p><p>Coinbase would share information on its trading books and other information so the SEC can monitor any possible market manipulation or irregular trading activity.</p><p>In late June SEC <a href=\"https://cointelegraph.com/news/us-sec-deems-spot-bitcoin-etfs-filings-as-inadequate-report\">pushed back</a> on the ETFs due to there being no SSAs, saying they were needed due to what it claimed was the potential for crypto markets to be manipulated.</p><p>Grayscale claimed, however, that the SSA’s “would neither satisfy nor be necessary” under the SEC's standards as Coinbase isn’t registered with the SEC as a securities exchange or broker-dealer nor with the Commodity Futures Trading Commission (CFTC) as a futures exchange.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/1_RCqOFYSzE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>It added approving the ETFs would be “a positive but sudden and significant change” in the SEC's application of its standard and would “improperly grant an unfairly discriminatory and prejudicial first-mover advantage to these proposals.”</p><p>The Grayscale Bitcoin Trust (GBTC), which aims to track Bitcoin’s price, has nearly 1 million investors, Salm claimed.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blackrock-etf-validates-bitcoin-grayscale-ceo-sonnenshein\"><strong><em>Grayscale CEO: BlackRock ETF filing a ‘moment of validation’ for Bitcoin</em></strong></a></p><p>He said if it's converted to an ETF it would return billions in value to investors, adding there’s “simply no reason” the SEC should keep GBTC investors from a spot Bitcoin ETF.</p><p>The SEC denied Grayscale’s application to convert the GBTC to a spot Bitcoin ETF last June.</p><p>In response, Grayscale <a href=\"https://cointelegraph.com/news/breaking-grayscale-launches-legal-challenge-to-bitcoin-spot-etf-rejection\">sued the regulator</a> saying it was acting arbitrarily by “failing to apply consistent treatment to similar investment vehicles.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\"><strong><em>Should you ‘orange pill’ children? The case for Bitcoin kids books</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-28T01:54:00.000Z",
    "title": "$SHIB: Shiba Inu’s Shibarium Beta Bridge is Now Open for Public Testing",
    "url": "https://www.cryptoglobe.com/latest/2023/07/shib-shiba-inus-shibarium-beta-bridge-is-now-open-for-public-testing/",
    "description": "The developers behind the meme-inspired cryptocurrency Shiba Inu ($SHIB) have recently rolled out the beta version of the Shibarium bridge, an eagerly awaited test phase that allows the public to give the layer-2 scaling solution a try. The announcement of this milestone was made recently by an influential figure within the community and has been […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-28T02:00:18.000Z",
    "title": "Economist Peter Schiff Advises ‘Get out of the Dollar’ — Says the USD Is Being Destroyed",
    "url": "https://news.bitcoin.com/economist-peter-schiff-advises-get-out-of-the-dollar-says-the-usd-is-being-destroyed/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/schiff-fed-dollar-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Economist Peter Schiff Advises &#039;Get out of the Dollar&#039; — Says the USD Is Being Destroyed\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/schiff-fed-dollar-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/schiff-fed-dollar-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/schiff-fed-dollar-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/schiff-fed-dollar-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/schiff-fed-dollar-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/schiff-fed-dollar-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/schiff-fed-dollar.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Economist Peter Schiff has warned that the Federal Reserve is wrong about its recession outlook, advising everyone to get out of the U.S. dollar. He stressed that the U.S. currency is being destroyed, emphasizing that it is losing purchasing power. “Rather than fighting inflation, the Fed fueled the fire,” Schiff claimed. Peter Schiff Warns U.S. [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-28T02:00:36.000Z",
    "title": "Bullish Price Formation For Solana – Is $30 Around The Corner?",
    "url": "https://www.newsbtc.com/news/solana/bullish-price-formation-for-solana-is-30-around-the-corner/",
    "description": "Solana (SOL) has experienced a notable downturn recently, unable to sustain itself above the $32 mark. The altcoin remains below a strong resistance level, but a potential breakthrough could lead to a 20% price appreciation. Related Reading: PEPE Whales Load Up Their Bags As Memecoin Jumps 13% In the last 24 hours, SOL saw a modest surge of 2.2%, but its performance on the weekly chart shows minimal upward movement. Despite the challenges, there are two essential bullish signals to consider: the morning star reversal sign and a bullish pennant formation. These signals suggest that if SOL surpasses the immediate resistance, the coin might aim for a rally back to levels it reached two weeks ago. In the broader market context, Bitcoin&#8217;s re-entry into the $29,000 price level has caused retracements in altcoins on their respective charts. Therefore, for SOL to surpass the immediate resistance, it will require strong support from the broader market. The market capitalization of SOL has also experienced a decline, indicating a slight weakening in buying strength. Solana Price Analysis: One-Day Chart At the time of writing, SOL was valued at $24.90. The coin tried to reach the $32 level, but the bulls faced resistance and could not sustain it. Subsequently, SOL has been striving to breach the immediate resistance level at $26. A successful move above $26 could propel the coin&#8217;s value to $28. It may encounter a potential price ceiling at that level. If this level is surpassed, the coin could rally further to reach $30. On the other hand, there is a downside risk. If SOL fails to hold above the $26 level, it might face a decline to $21. A further fall below this mark could result in a drop to $18. The price movement remains crucial for SOL&#8217;s future trajectory. Technical Analysis The market exhibited bullish signals, with the bulls taking control despite a slight dip in buying strength. The Relative Strength Index (RSI) indicated buyers dominated the market, as it remained above the half-line. Moreover, the price movement above the 20-Simple Moving Average (SMA) line highlighted the influence of buyers in driving the price momentum. Should the price maintain its position above the 20-SMA, increased demand is anticipated to propel the asset&#8217;s value above the immediate resistance line. This could potentially lead to further bullish movement in the market. Despite the continued dominance of buyers, SOL presented sell signals on the daily chart. The Moving Average Convergence Divergence (MACD) formed red signal bars, suggesting a potential slight dip in the price before any attempt to breach the $26 mark. This indicator reflects the price momentum and its shift. Additionally, the Chaikin Money Flow (CMF) was below the half-line, indicating that capital inflows were lower than capital outflows. Related Reading: Dogecoin Ascendance: How It Captured PEPE Investors’ Attention This observation suggests a potential decrease in buying pressure at the given moment. The upcoming trading sessions hold significance for the altcoin&#8217;s price movement, as the broader market may influence the further trajectory of SOL. Featured image from UnSplash, charts from TradingView.com"
  }
]