[
  {
    "source": "Decrypt",
    "date": "2023-10-30T20:04:45.000Z",
    "title": "Ubisoft Killing Online Play for Assassin's Creed, Splinter Cell, Ghost Recon Games",
    "url": "https://decrypt.co/203715/online-offline-ubisoft-assasins-creed-splinter-cell-ghost-recon",
    "description": "If you’re still playing these big Ubisoft games online, you’ll have about three months left to enjoy them before they go offline for good."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-30T19:48:07.000Z",
    "title": "Gaming Tokens GALA, Axie Infinity, and ApeCoin Post Huge Gains",
    "url": "https://decrypt.co/203713/crypto-games-gla-xs-ape-mana-sand-gains-bitcoin-etf",
    "description": "Bitcoin buzz is boosting the crypto market, and gaming and metaverse tokens are among the biggest winners this week."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-30T20:00:00.000Z",
    "title": "SBF claims innocence, contradicts other witnesses: Law Decoded",
    "url": "http://cointelegraph.com/news/sbf-claims-innocence-contradicts-other-witnesses-law-decoded-oct-23-30",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/fd0f5a35-5376-45ab-a9d5-7ca04eb0a21d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sam Bankman-Fried was the final witness to take the stand after more than three weeks of testimonies in court.</p>\n                    <p><p>Last week, the criminal trial of FTX founder and CEO Sam “SBF” Bankman-Fried continued in New York, with the man himself giving testimony as part of his defense. According to the SBF, <a href=\"https://cointelegraph.com/news/sam-bankman-fried-testifies-without-jury\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sam-bankman-fried-testifies-without-jury/amp\">he didn’t know any details</a> about the creation of North Dimension, an alleged “shadowy entity” used to launder customer funds from the crypto exchange through Alameda Research. It was former chief regulatory officer Dan Friedberg who provided him with the papers setting up the firm, which he signed without question, SBF claimed. </p><p>Bankman-Fried denied knowing why crypto exchange FTX <a href=\"https://cointelegraph.com/news/sam-bankman-fried-denies-ftx-deposits-north-dimension\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sam-bankman-fried-denies-ftx-deposits-north-dimension/amp\">began moving user funds</a> from a bank account with Alameda to North Dimension. He suggested that banks may have been more comfortable with North Dimension in order to avoid well-known hedge funds connected to crypto, such as Alameda.</p><p>The former CEO also suggested that Gary Wang, FTX’s former chief technology officer, <a href=\"https://cointelegraph.com/news/sam-bankman-fried-denies-defrauding-ftx-users\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sam-bankman-fried-denies-defrauding-ftx-users/amp\">had been partly responsible</a> for creating the “allow negative” button for Alameda Research. The feature gave the crypto hedge fund the ability to trade more funds than it had available. “At the time, I wasn’t entirely sure what was happening,” Bankman-Fried said regarding Alameda’s line of credit. “I thought the funds were being held in a bank account or sent to FTX in stablecoins. If Alameda was keeping it, I figured it would be reflected as a negative number on FTX.”</p><p>Bankman-Fried’s claims partly or directly contradict the testimonies offered by Wang and former Alameda CEO Carline Ellison. Wang took the stand on Oct. 6, <a href=\"https://cointelegraph.com/news/alameda-account-ftx-special-privileges-gary-wang\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/alameda-account-ftx-special-privileges-gary-wang/amp\">saying Bankman-Fried had ordered him</a> and former FTX engineering director Nishad Singh to implement the “allow negative” feature in 2019. Ellison testified that she had wanted to step down as CEO of Alameda, but SBF <a href=\"https://cointelegraph.com/news/caroline-ellison-desired-step-down-feared-bank-run-ftx-sam-bankman-fried\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/caroline-ellison-desired-step-down-feared-bank-run-ftx-sam-bankman-fried/amp\">asked her to stay</a>, citing the risk of rumors about the firm’s financial health.</p><h3>Californian lawmakers want to cap crypto ATM withdrawals at $1,000 daily</h3><p>California legislators have proposed the Digital financial asset transaction kiosks bill, which seeks to impose a cap on crypto ATM withdrawals of $1,000 per day in light of growing scams. Additionally, starting in 2025, the law would limit operators’ fees to $5 or 15% (whichever is higher). The bill, if approved, would come into effect on Jan. 1, 2024. The bill was introduced after legislative members visited a crypto ATM in Sacramento and found markups as high as 33% on some crypto assets compared with their prices on crypto exchanges. On average, a crypto ATM charges fees between 12% and 25%, according to a legislative analysis. </p><p><a href=\"https://cointelegraph.com/news/california-bill-aims-cap-crypto-atm-withdrawals-1000-dollars-per-day-combat-scams\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/california-bill-aims-cap-crypto-atm-withdrawals-1000-dollars-per-day-combat-scams/amp\"><strong>Continue reading</strong></a><strong> </strong></p><h3>Cynthia Lummis calls for DOJ action against Binance and Tether</h3><p>United States Senator Cynthia Lummis has called on the U.S. Department of Justice (DOJ) to consider charges against crypto exchange Binance following the terrorist group Hamas’ attack on Israel. In a letter to U.S. Attorney General Merrick Garland, Lummis and Arkansas Representative French Hill urged Justice Department officials to “reach a charging decision on Binance” and “expeditiously conclude” investigations of allegedly illicit activities involving Tether.</p><p>“We urge the Department of Justice to carefully evaluate the extent to which Binance and Tether are providing material support and resources to support terrorism through violations of applicable sanctions laws and the Bank Secrecy Act,” said Lummis and Hill.</p><p><a href=\"https://cointelegraph.com/news/cynthia-lummis-charge-binance-tether-illicit-activities\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cynthia-lummis-charge-binance-tether-illicit-activities/amp\"><strong>Continue reading</strong></a></p><h3>Crypto firms have breached new U.K. promo rules 221 times</h3><p>The United Kingdom Financial Conduct Authority (FCA) claims that since the Oct. 8 crypto promotion rules came into place, firms are still failing to provide visible enough risk warnings and adequate information about risks and are making claims about the safety, security or ease of using crypto without highlighting the risks involved. Crypto-promoting firms have breached the new rules at least 221 times since coming into force, the FCA claims. While many of the FCA’s crypto-related alerts appear to be illegitimate schemes offering high-yield returns on crypto investments, the FCA has taken action against seemingly legitimate businesses as well.</p><p><a href=\"https://cointelegraph.com/news/uk-fca-crypto-promotion-rules-breached-221-times\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/uk-fca-crypto-promotion-rules-breached-221-times/amp\"><strong>Continue reading</strong></a></p>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-30T20:00:11.000Z",
    "title": "Bitcoin’s post-FTX performance in line with previous cycles",
    "url": "https://cryptoslate.com/insights/bitcoins-post-ftx-performance-in-line-with-previous-cycles/",
    "description": "<p>Quick Take Bitcoin&#8217;s (BTC) resilience is once again underscored by recent data showing a 113% rally from the cycle low, sparked by the fallout from the FTX collapse in November 2022. This rise, strikingly, is commensurate with the performance during previous cycles, indicating an enduring robustness in Bitcoin&#8217;s market resilience. In a historical context, when [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoins-post-ftx-performance-in-line-with-previous-cycles/\">Bitcoin&#8217;s post-FTX performance in line with previous cycles</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-30T19:54:36.000Z",
    "title": "Ethereum (ETH), Litecoin (LTC), Chainlink (LINK) Sail High, But For How Long? – Market Shows Mixed Signals",
    "url": "https://cryptodaily.co.uk/2023/10/ethereum-eth-litecoin-ltc-chainlink-link-sail-high-but-for-how-long-market-shows-mixed-signals",
    "description": "Delve into the cryptocurrency world with our detailed analysis on Ethereum (ETH), Litecoin (LTC), and Chainlink (LINK), amidst a mix of market signals and notable price movements. Gain insight into the recent bullish trends, potential highs and lows, and crucial technical levels that are shaping the future of these major digital assets. Stay ahead in the fast-paced world of crypto with our expert commentary, guiding you through another thrilling week filled with opportunities, risks, and unwavering excitement."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-30T19:46:07.000Z",
    "title": "OKX celebrates 1 year anniversary of Proof of Reserves",
    "url": "https://crypto.news/okx-celebrates-1-year-anniversary-of-proof-of-reserves/",
    "description": "OKX has marked its one-year anniversary of consistently publishing Proof of Reserves, showcasing a commitment to transparency and trust."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-30T20:00:34.000Z",
    "title": "Is Bitcoin Top Here? This Metric Would Say Otherwise",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-top-this-metric-would-otherwise/",
    "description": "The Bitcoin MVRV ratio, an on-chain indicator, could suggest the asset may not have hit its top for the current rally just yet. Bitcoin MVRV Ratio Says Market Isn&#8217;t Overheated Right Now According to data from the market intelligence platform IntoTheBlock, past bull markets hit their peaks when the MVRV ratio crossed the 300% mark. The &#8220;Market Value to Realized Value (MVRV) ratio&#8221; refers to an indicator that keeps track of the ratio between the Bitcoin market cap and realized cap. The &#8220;realized cap&#8221; here is a capitalization model for BTC that calculates the total value of the cryptocurrency by assuming that each coin in circulation is worth the same as the price at which it was last moved, rather than the current spot price. As the price at which a coin was last moved on the blockchain was likely the price at which it changed hands, the realized cap can be interpreted as the total amount of capital that the investors as a whole have put into the asset. Related Reading: November Outlook For Bitcoin Price: Another Pump Or Retrace? The MVRV ratio compares the price of the coin (the market cap) with the realized cap, so it can tell us whether the investors are holding more or less than they put in. Now, here is a chart that shows the trend in the Bitcoin MVRV ratio over the last few years: Looks like the value of the metric has been going up in recent days &#124; Source: IntoTheBlock on X In the above graph, the Bitcoin MVRV ratio is shown as a percentage. At the 100% mark, the two capitalization models approach a equal value, suggesting that the market as a whole is just breaking-even. Above this threshold, the investors are holding a net amount of profit, while below they are carrying loss. From the chart, it&#8217;s visible that the BTC MVRV ratio has remained above the break-even in recent months as the asset&#8217;s price has observed a rally. At present, the metric is floating about the 150% level, suggesting that the market cap is 50% more than the realized cap. Historically, the larger the investors&#8217; profits have gotten, the more likely they have become to take part in a selloff. Because of this reason, tops have generally formed when the MVRV ratio has hit high levels. IntoTheBlock notes, however, that the bull markets in the past have usually only hit their peaks when the indicator has crossed the 300% mark. Related Reading: Bitcoin Price Poised For Another Surge Like Last Week: Here’s Why Clearly, the indicator is still a significant distance away from this mark at the moment. This could be a potential sign that the Bitcoin rally hasn&#8217;t reached a state of overheat yet and thus, there might be more to come for the cryptocurrency&#8217;s price in terms of bullish momentum. BTC Price The Bitcoin rally has hit the pause button in the past week as the asset&#8217;s price has taken to sideways movement. Currently, the coin is trading around the $34,500 mark. The value of BTC appears to have gone stale in the last few days &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com, IntoTheBlock.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-30T19:50:39.000Z",
    "title": "XRP Revolution: Banker Predicts Ripple Will Redefine International Payments by Replacing Payment Service Providers (PSPs) and Nostro Accounts",
    "url": "https://www.crypto-news-flash.com/xrp-revolution-banker-predicts-ripple-will-redefine-international-payments-by-replacing-payment-service-providers-psps-and-nostro-accounts/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-revolution-banker-predicts-ripple-will-redefine-international-payments-by-replacing-payment-service-providers-psps-and-nostro-accounts",
    "description": "<img width=\"1038\" height=\"584\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE.png 1038w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-24x14.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-36x20.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-48x27.png 48w\" sizes=\"(max-width: 1038px) 100vw, 1038px\" />Former banker Kyren sees XRP as a solution for slow and costly international payments, aiming to replace traditional methods. Ripple whales selling XRP holdings raise concerns about price fluctuations influenced by SEC lawsuit outcomes. Former banker Kyren has shed light on the potential disruption that XRP, a prominent cryptocurrency, could bring to the world of [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-30T20:00:54.000Z",
    "title": "Bitcoin Rally to $50,000 Now in the Cards As BTC Bull Market Arrives, According to Analyst – Here’s His Timeline",
    "url": "https://dailyhodl.com/2023/10/30/bitcoin-rally-to-50000-now-in-the-cards-as-btc-bull-market-arrives-according-to-analyst-heres-his-timeline/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/Faster-Horse-Bitcoin-Will-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/Faster-Horse-Bitcoin-Will-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/Faster-Horse-Bitcoin-Will-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/Faster-Horse-Bitcoin-Will-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/Faster-Horse-Bitcoin-Will-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/Faster-Horse-Bitcoin-Will-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/Faster-Horse-Bitcoin-Will-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst believes that Bitcoin (BTC) has officially entered bull market territory and is now primed for a rally toward $50,000. Trader Michaël van de Poppe tells his 669,700 followers on the social media platform X that the &#8220;Bitcoin bull market is here.&#8221; Van de Poppe predicts that Bitcoin will rally to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/30/bitcoin-rally-to-50000-now-in-the-cards-as-btc-bull-market-arrives-according-to-analyst-heres-his-timeline/\">Bitcoin Rally to $50,000 Now in the Cards As BTC Bull Market Arrives, According to Analyst – Here’s His Timeline</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-30T19:55:42.000Z",
    "title": "$326,000,000 in Institutional Capital Hits Bitcoin and Altcoins In Largest Wave Since July 2022: CoinShares",
    "url": "https://dailyhodl.com/2023/10/30/326000000-in-institutional-capital-hits-bitcoin-and-altcoins-in-largest-wave-since-july-2022-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/bitcoin-verge-rebound.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/bitcoin-verge-rebound.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/bitcoin-verge-rebound.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/bitcoin-verge-rebound.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/bitcoin-verge-rebound.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/bitcoin-verge-rebound.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/bitcoin-verge-rebound.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Rising optimism in crypto has pushed institutional investors into making their largest allocation of capital into digital assets markets in over a year. In its latest report, Digital assets manager CoinShares says institutions put $326 million into crypto investment products last week, the largest weekly inflow since July of 2022. CoinShares says the inflows coincide [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/30/326000000-in-institutional-capital-hits-bitcoin-and-altcoins-in-largest-wave-since-july-2022-coinshares/\">$326,000,000 in Institutional Capital Hits Bitcoin and Altcoins In Largest Wave Since July 2022: CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]