[
  {
    "source": "CryptoSlate",
    "date": "2023-08-26T15:00:02.000Z",
    "title": "The case for raising the Fed’s inflation target to 3%",
    "url": "https://cryptoslate.com/market-reports/the-case-for-raising-the-feds-inflation-target-to-3-percent/",
    "description": "<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/market-reports/the-case-for-raising-the-feds-inflation-target-to-3-percent/\">The case for raising the Fed&#8217;s inflation target to 3%</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-26T15:07:35.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-26T14:48:03.000Z",
    "title": "Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better ... <a title=\"Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fantom-price-prediction/\" aria-label=\"More on Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-26T15:00:07.000Z",
    "title": "Exodus Of 30,000 BTC To Cold Wallets Spells Good News For Bitcoin Price",
    "url": "https://www.newsbtc.com/bitcoin-news/btc-exodus-bitcoin-price/",
    "description": "A massive 30,000 BTC was transferred into unknown wallets over the past week, leading many investors to wonder about the current outlook concerning Bitcoin. When big money moves into cold storage, it reduces selling pressure because it often indicates that whales and institutional investors are expecting the price to go up and opting for self-custody. Massive Exodus Of BTC To Cold Storage Data from CoinGlass shows that almost 30,000 BTC have been moved off exchanges in the past week. With Bitcoin currently trading around $26,000, this equates to over $780 million moved into cold storage.  Related Reading: Cathie Wood’s ARK Invest Joins Ethereum Futures ETF Race After Spot Bitcoin ETF Delay Most of this movement has come from Binance, with an 11,457 BTC net change in its reserves. Coinbase, Bitfinex, and Gemini also witnessed a net exodus of 4,455 BTC, 2,808 BTC, and 6,004 BTC, respectively. In contrast to this, the crypto exchange OKX had 2,149 BTC moved into its exchange. On-chain whale movement alerts from Whale Alerts this week have also shown various instances of BTC movement off crypto exchanges into unknown wallets: 🚨 🚨 🚨 🚨 🚨 🚨 5,140 #BTC (134,268,844 USD) transferred from #Bybit to unknown wallethttps://t.co/LWXJsbooVX — Whale Alert (@whale_alert) August 25, 2023 🚨 🚨 🚨 🚨 2,910 #BTC (76,010,381 USD) transferred from unknown wallet to #Coinbasehttps://t.co/5bD9vpvMAE — Whale Alert (@whale_alert) August 24, 2023 🚨 🚨 🚨 🚨 🚨 4,000 #BTC (106,039,171 USD) transferred from #Bitfinex to unknown wallethttps://t.co/982bCEb4SO — Whale Alert (@whale_alert) August 24, 2023 Unknown wallets typically mean movement into cold storage, which refers to any method of storing crypto offline. Investors use cold wallets to hold Bitcoin long-term as a way to accumulate their assets.  For many long-term holders, this is a safer option than keeping large amounts of crypto on an exchange which could be at higher risk of hacks or scams. BTC price sitting above $26,000 &#124; Source: BTCUSD on Tradingview.com  How Is This Bullish For The Price Of Bitcoin? Bitcoin into cold storage points to a bullish outlook from serious investors. It reduces selling pressure since the amount of BTC available for sale on exchanges has become smaller. According to the economic principles of supply and demand, the lower supply is poised to lead to higher prices.  Related Reading: Here’s Why Arthur Hayes Is Not In Support Of A BlackRock Spot Bitcoin ETF While it’s not entirely clear what is causing this transition, the timing of this movement to cold storage is also notable. The SEC&#8217;s decision on spot Bitcoin ETF applications is imminent, and many believe that approval would lead to a spike in the price of Bitcoin. However, the regulator can still delay the applications for up to 240 days.  The price of Bitcoin has gone through a considerable dip in the past month as the market reacted to various news. At the time of writing, the cryptocurrency is trading at $26,000 and is down by 11.83% in the past month but up by 0.42% in a 7-day timeframe. This would suggest that the movement into cold storage has not had a significant effect, as the price of Bitcoin is still struggling to recover. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-26T15:00:32.000Z",
    "title": "XRP Price Analysis: Will Ripple Sink or Swim Amid Sideways Storm?",
    "url": "https://www.crypto-news-flash.com/xrp-price-analysis-will-ripple-sink-or-swim-amid-sideways-storm/",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-3-Ripple-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple XRP Flare Networks FLR\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-3-Ripple-1.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-3-Ripple-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-3-Ripple-1-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-3-Ripple-1-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />XRP&#8217;s price remains sandwiched between critical support and resistance levels, hinting at potential breakouts. Analysis of both daily and 4-hour charts reflects indecisiveness in the market, leading to possible volatility. Buckle up, crypto enthusiasts! We&#8217;ve delved deep into the exciting world of XRP and, drawing from the recent insights of Cointelegraph, have a fresh and [...]"
  }
]