[
  {
    "source": "Bitcoin.com",
    "date": "2023-06-14T08:30:48.000Z",
    "title": "No Billion Crypto Users Without ‘Wallets That Work Like Modern Technology’ — Binance Head of Product",
    "url": "https://news.bitcoin.com/no-billion-crypto-users-without-wallets-that-work-like-modern-technology-binance-head-of-product/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/checkjoh-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"No Billion Crypto Users Without &#039;Wallets That Work Like Modern Technology&#039; — Binance Head of Product\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/checkjoh-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/checkjoh-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/checkjoh-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/checkjoh-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/checkjoh-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/checkjoh-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/checkjoh.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />While the blockchain and decentralized finance are often touted as the future of finance, according to Binance&#8217;s head of product Mayur Kamat, more people will become comfortable using these when there are crypto &#8220;wallets that work like modern technology.&#8221; For Kamat, an early bitcoin buyer and holder, simplifying the user experience and reducing friction for [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T08:17:37.000Z",
    "title": "HQ MENA Announces Blockchain Expo Dubai 2023, the Premier Blockchain Event in the Middle East",
    "url": "https://www.cryptopolitan.com/hq-mena-announces-blockchain-expo-dubai-2023-the-premier-blockchain-event-in-the-middle-east/",
    "description": "Dubai, May 26, 2023 &#8211; HQ MENA, a leading events management company, is proud to announce the upcoming Blockchain Expo Dubai 2023. Set to take place on September 20-21, this highly anticipated event will bring together global experts, innovators, and thought leaders in the blockchain industry to explore the latest advancements, trends, and opportunities in ... <a title=\"HQ MENA Announces Blockchain Expo Dubai 2023, the Premier Blockchain Event in the Middle East\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hq-mena-announces-blockchain-expo-dubai-2023-the-premier-blockchain-event-in-the-middle-east/\" aria-label=\"More on HQ MENA Announces Blockchain Expo Dubai 2023, the Premier Blockchain Event in the Middle East\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T08:15:02.000Z",
    "title": "Egypt joins BRICS in shifting away from US Dollar in trade settlements",
    "url": "https://www.cryptopolitan.com/egypt-joins-brics-in-shifting-away-from-us-dollar-in-trade-settlements/",
    "description": "Egypt has made a significant move in its trade practices by abandoning the US dollar in transactions with the BRICS economic bloc. The country aims to utilize local currencies, such as the Indian rupee, Russian ruble, and Chinese yuan, to pay imports from these key BRICS members. Egypt&#8217;s Supply Minister, Ali Moselhy, emphasized ongoing discussions ... <a title=\"Egypt joins BRICS in shifting away from US Dollar in trade settlements\" class=\"read-more\" href=\"https://www.cryptopolitan.com/egypt-joins-brics-in-shifting-away-from-us-dollar-in-trade-settlements/\" aria-label=\"More on Egypt joins BRICS in shifting away from US Dollar in trade settlements\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-14T08:10:49.000Z",
    "title": "FUD Or Real: Is Binance Selling Bitcoin To Prop Up BNB?",
    "url": "https://www.newsbtc.com/news/fud-or-real-binance-selling-bitcoin-to-prop-up-bnb/",
    "description": "Despite the recent flood of major news in the crypto sector, one topic is more hotly debated than any other at the moment: Is Binance selling Bitcoin on the spot market to prop up the Binance Coin (BNB)? NewsBTC already reported yesterday that the rumor emerged after crypto trader &#8220;JW&#8221; drew attention to eye-catching data. However, the rumor stands on shaky legs and data. Still, there are a few data points that experts are calling striking. Popular trader @52Skew stated that he can confirm that &#8220;it looks like BTC is being sold for USDT reserves&#8221;. Via Twitter, the crypto trader shared the chart below and explained that USDT reserves have been aggressively pumped into BNB since May 27th. Moreover, BNB is supposedly being sold to BUSD in order to suppress the volatility of BTC: BUSD is pumped into BTC to suppress downside volatility so BTC can be swapped out for USDT. This is technically market manipulation, Binance is definitely up to something here to prevent BNB from crashing as well as BTC. Binance CEO Changpeng Zhao aka &#8220;CZ&#8221; felt compelled to respond to the allegations a few hours ago. Via Twitter, CZ called the trader&#8217;s allegations &#8220;FUD&#8221; and questioned the data. Related Reading: Binance CEO Controversial Move: Selling Bitcoin To Save BNB? &#8220;4. Binance has not sold BTC or BNB. We even still have a bag of FTT. It is amazing they can know exactly who sold based on just a price chart involving millions of traders. FUD,&#8221; writes Zhao, who also accuses the trader of self-serving intentions: &#8220;Maybe they are shorting&#8230; who knows.&#8221; Renewed Binance FUD Or Real? However, the voices about unusual price action on Binance are increasing. Joe Consorti, market analyst at The Bitcoin Layer, states that there is a lot of selling pressure on Bitcoin on Binance that is not present on other exchanges: More cannon fodder that they may be selling spot BTC to prop up BNB. The $220 level is being staunchly defended &#8211; may be a liquidation level for a BNB collateralized loan. As reported by NewsBTC, BNB is facing a potentially disastrous situation following an exploit on Binance Smart Chain&#8217;s Binance Bridge. The exploiter could be liquidated for $200 million on Venus Decentralized Autonomous Organization (DAO) if BNB&#8217;s price falls below $220. Related Reading: BNB Price Prediction: Recovery Could Fade Above $260 In light of this, &#8220;Binance critics&#8221; suspect that the exchange wants to keep BNB above $220 at all costs to prevent a &#8220;liquidation waterfall&#8221;. However, the CVD data is not really capable of proving this rumor true. The cumulative volume delta (CVD) shows the cumulative volume changes based on the trading volume of aggressive sellers versus aggressive buyers. This allows a judgment to be made on the volume of an asset, but not on the source of the volume. Therefore, until further evidence is presented, the rumor must be dismissed as just that: a rumor. Even if the CVD data shows an anomaly, this may be due to exceptional market activity on the world&#8217;s largest crypto exchange. At press time, the BNB price is up 5.4% in the last 24 hours, trading at $248. Meanwhile, Bitcoin is slightly down -0.8% in the same time period. Featured image from Markus Winkler / Unsplash, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-14T08:29:24.000Z",
    "title": "Crypto Trader Exposes Sophisticated Coinbase Phishing Scam",
    "url": "https://coinedition.com/crypto-trader-exposes-sophisticated-coinbase-phishing-scam/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/COINBASE-6-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/COINBASE-6-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/COINBASE-6-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/COINBASE-6.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Jacob Canfield, a renowned cryptocurrency trader, recently revealed on Twitter that he was targeted by an intricate scam related to the crypto exchange Coinbase. Canfield claimed to have been a victim of the scam, which he described as one of the “most complex scams” in crypto he has ever encountered. According to Canfield&#8217;s tweets, the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-trader-exposes-sophisticated-coinbase-phishing-scam/\">Crypto Trader Exposes Sophisticated Coinbase Phishing Scam</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-14T08:10:09.000Z",
    "title": "Unlock the Secrets of Trading Success: Traders Fair 2023 Invites You to Join the Journey",
    "url": "https://coinedition.com/unlock-the-secrets-of-trading-success-traders-fair-2023-invites-you-to-join-the-journey/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/PR-41-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/PR-41-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/PR-41-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/PR-41.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>FINEXPO proudly presents the Traders Fair 2023, a unique and unrivalled event that unites traders, investors, financial experts, brokers, and service providers from all corners of the globe. This exceptional gathering aims to foster meaningful connections, facilitate knowledge exchange, and showcase groundbreaking products and services within the world of trading and investing. Set against the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/unlock-the-secrets-of-trading-success-traders-fair-2023-invites-you-to-join-the-journey/\">Unlock the Secrets of Trading Success: Traders Fair 2023 Invites You to Join the Journey</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]