[
  {
    "source": "Cointelegraph",
    "date": "2024-01-15T11:00:00.000Z",
    "title": " Web3 education bridges East to West: Blockchain Academy joins Cointelegraph Accelerator ",
    "url": "https://cointelegraph.com/news/web3-education-bridges-east-to-west-blockchain-academy-joins-cointelegraph-accelerator",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9jY2ZkMmQ2MTUwNjIyMzQ3MGUxYzZiY2ZjZTY4NTY1Ni5qcGc=.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Blockchain Academy bridges Asia to the West through Web3-focused education that consists of in-person courses, digital events and hackathons.</p>\n                    <p><p>While the blockchain industry is often perceived as being heavily reliant on the performance of crypto prices, 2023 demonstrated that <a href=\"https://cointelegraph.com/learn/web3-ai-blockchain-cryptocurrencies-decentralization\">Web3</a> development and innovation thrive independently of market fluctuations. Even amid the so-called “crypto winter,” new trends like <a href=\"https://cointelegraph.com/news/web3-gaming-trends-2024-future-of-blockchain-gaming\">Web3 gaming</a> and <a href=\"https://cointelegraph.com/learn/tokenized-real-world-assets-rwa-in-defi\">real-world asset (RWA) </a>tokenization emerged, highlighting the industry’s resilience and adaptability. This raises a crucial question: does the current talent pool possess the capacity to support the rapid expansion of the Web3 ecosystem into untapped niches?</p><p>​​The short answer is no. Blockchain is an advanced multidisciplinary technology requiring a new layer of education on top of software development and engineering skills. The lack of talent, combined with the industry’s accelerated growth, will create a bottleneck hindering innovation and further developments of Web3, reports <a href=\"https://app.intropia.io/report/Web3-Talent-Report-2022.pdf\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">say</a>.</p><p><a href=\"https://www.talentre.academy/\" rel=\"noopener noreferrer nofollow\" target=\"_blank\">Blockchain Academy</a>, an educational platform and community dedicated to Web3, aims to foster Web3 adoption through <a href=\"https://cointelegraph.com/tags/education\">education</a>. The Hong Kong-based education platform combines academic needs with industry practice through a curriculum created with the support of top universities.</p><p><a href=\"https://cointelegraph.com/news/web3-education-bridges-east-to-west-blockchain-academy-joins-cointelegraph-accelerator\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-15T10:58:04.000Z",
    "title": "Sui’s value skyrockets to ATH amid booming DeFi ecosystem",
    "url": "https://cryptoslate.com/suis-value-skyrockets-to-ath-amid-booming-defi-ecosystem/",
    "description": "<p>Sui made CryptoSlate&#8217;s top gainers&#8217; list for Jan. 15 following a 13% increase during the past day that pushed its value to a new all-time high of $1.43. This continues a persistent uptrend that the digital asset has enjoyed during the last 30 days, outperforming major cryptocurrencies like Bitcoin, Ethereum, Solana, etc. According to CryptoSlate&#8217;s [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/suis-value-skyrockets-to-ath-amid-booming-defi-ecosystem/\">Sui&#8217;s value skyrockets to ATH amid booming DeFi ecosystem</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-15T10:50:28.000Z",
    "title": "$ETH: Popular Analyst Has a $3600 Price Target for Ethereum",
    "url": "https://www.cryptoglobe.com/latest/2024/01/eth-popular-analyst-has-a-3600-price-target-for-ethereum/",
    "description": "Recent discussions on platform X have sparked interest in Ethereum’s market trajectory, with a particular focus on its potential to reach new heights in value. CrediBULL Crypto’s analysis, shared on January 10, highlights Ethereum’s steady upward movement, overcoming sell orders and attracting fresh bids. A notable observation was the emergence of a substantial block of […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-15T10:54:21.000Z",
    "title": "Dollarino (DOLS) - The First Anti ETF Crypto Coin Is On The Market",
    "url": "https://cryptodaily.co.uk/2024/01/dollarino-dols-the-first-anti-etf-crypto-coin-is-on-the-market",
    "description": "Dollarino (DOLS) - The First Anti ETF Crypto Coin Is On The Market"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-15T10:55:14.000Z",
    "title": "Dollarino (DOLS) – The First Anti ETF Crypto Coin Is On The Market",
    "url": "https://www.cryptopolitan.com/dollarino-dols-the-first-anti-etf-crypto-coin-is-on-the-market/",
    "description": "Vilnius, Lithuania, January 15th, 2024, Chainwire The single-industry-focused ETFs limit diversification and Dollarino is here to do the exact opposite. Dollarino is the first major reaction that acts as an anti ETF coin, standing on behalf of those who want to generate their own negotiation on ETFs in order to be able to diversify their [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-15T10:52:22.000Z",
    "title": "XRP community and Charles Gasparino clash over crypto theories",
    "url": "https://www.cryptopolitan.com/xrp-community-and-charles-gasparino-clash/",
    "description": "Veteran financial journalist Charles Gasparino has recently become embroiled in a contentious exchange with the XRP community, the cryptocurrency linked to tech company Ripple. Known for his direct reporting style, Gasparino has been a vocal critic of certain theories proposed by XRP supporters. His recent comments regarding the unlikely discussion of XRP-related conspiracy theories at [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-15T10:51:31.000Z",
    "title": "BlackRock’s understated Bitcoin ETF Ad campaign targets wealthy baby boomers",
    "url": "https://www.cryptopolitan.com/blackrocks-bitcoin-etf-ad-campaign/",
    "description": "Investment giant BlackRock has taken a different approach in marketing its recently launched iShares Bitcoin Trust ETF (IBIT), opting for a subdued and straightforward ad campaign. While some may consider it boring, industry commentators suggest that this strategy may be a winning formula for attracting the wealthy baby boomer demographic. On January 11th, BlackRock unveiled [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-15T10:54:12.000Z",
    "title": "South Korea to strengthen control over crypto mixers",
    "url": "https://crypto.news/south-korea-to-strengthen-control-over-crypto-mixers/",
    "description": "The South Korean authorities plan to strengthen control over cryptocurrency mixers following the United States. On Jan. 15, local media in South Korea reported that the Financial Intelligence Unit (FIU) of the Financial Services Commission was considering introducing virtual asset&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-15T11:00:20.000Z",
    "title": "American Investment Bank TD Cowen Says Ethereum ETF Will Be Delayed",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-etf-will-be-delayed/",
    "description": "Despite the United States Securities and Exchange Commission (SEC) granting approval for Spot Bitcoin ETFs, TD Cowen, a prominent American investment bank and financial service firm, foresees potential delays in the approval process of Ethereum Spot ETFs.  Ethereum Spot ETF Faces Potential Hold-Up TD Cowen, an investment bank and financial service division of TD Securities has made a bold forecast, predicting that the US SEC is unlikely to approve Ethereum Spot ETFs before its deadline. Presently, the SEC is obligated to make its final decision on its rejection or acceptance of Ethereum Spot ETF from May 23 to August 7, 2024.  Related Reading: How To Buy And Trade Tokens On The SEI Network Earlier on January 10, the SEC officially approved Spot Bitcoin ETFs, triggering expectations that ETH Spot ETFs would follow suit. Several major firms including Ark 21 Shares, VanEck, Fidelity, BlackRock, and Hashdex have submitted applications for a Spot Ethereum ETF. Additionally, the regulatory agency has fixed a new deadline for Grayscale’s Ethereum Spot ETF to January 25.  TD Cowen&#8217;s predictions align with the SEC’s typical cautionary approach towards cryptocurrency-related investment products. The investment bank has disclosed that the regulator may delay ETH Spot ETFs until it accumulates sufficient knowledge and experience from its previously approved Bitcoin Spot ETFs. The bank estimates that while the delay may not take as long as 26 months, it is likely to persist beyond the upcoming elections. Similarly, Scott Melker, a crypto investor on X (formerly Twitter) has highlighted the possibility of the SEC hesitating to approve Ethereum Spot ETFs. Melker predicted that the SEC would be reluctant to approve Ethereum ETFs without external legal pressures similar to those observed during the approval process of Spot Bitcoin ETFs.  “Gary Gensler isn’t going to entertain an Ethereum Spot ETF unless the courts force it on him. I very seriously doubt we will see one anytime soon, but would love to be proven wrong,” Melker stated.  ETH price recovers above $2,500 &#124; Source: ETHUSD on Tradingview.com Class Before Approval JP Morgan, an American multinational financial service firm has introduced another layer of complexity in the approval process of Ethereum Spot ETFs. Managing Director at JP Morgan, Nikolaos Panigirtzoglou stated that there was a 50% chance of the US SEC approving these Spot ETFs by its May deadline.  Related Reading: How To Buy, Sell, And Trade Tokens On The BSC Network Panigirtzoglou revealed that the SEC would need to classify ETH as a commodity, similar to Bitcoin before it can officially grant authorization for Spot Ethereum ETFs.  In contrast, Bloomberg senior analyst, Eric Balchunas is more optimistic on Ethereum Spot ETF approvals. The analyst has disclosed a 70% chance of the SEC approving ETH Spot ETFs. Balchunas said previously that he could not imagine a scenario where the SEC would approve Spot Bitcoin ETFs and reject Ethereum Spot Bitcoin ETFs.  Featured image from Tech Cabal, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-15T11:00:42.000Z",
    "title": "2024 Shaping Up to be the Year of Layer-2s, GameFi and Memecoins. Which Are the Top Picks?",
    "url": "https://www.crypto-news-flash.com/2024-shaping-up-to-be-the-year-of-layer-2s-gamefi-and-memecoins-which-are-the-top-picks/?utm_source=rss&utm_medium=rss&utm_campaign=2024-shaping-up-to-be-the-year-of-layer-2s-gamefi-and-memecoins-which-are-the-top-picks",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-15T101433.674.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-15T101433.674.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-15T101433.674-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-15T101433.674-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-15T101433.674-450x300.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Diverse sectors of the crypto landscape are primed for gains this year. Committing to projects in these sectors improves profit-making possibilities for investors. Here, we consider the top 5 cryptocurrencies across these sectors, including the budding $GFOX, showing an impressive presale performance so far.  Galaxy Fox: Best New Meme Token On the Market This Year  [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-15T10:48:13.000Z",
    "title": "4 Reasons Stacks Why Blockchain Could Power BlackRock’s Ledger",
    "url": "https://www.altcoinbuzz.io/spotlight/4-reasons-stacks-blockchain-could-power-blackrocks-ledger/",
    "description": "<p>Stacks blockchain emerges as a compelling candidate for such endeavors. In this article, I&#8217;ll tell you four key reasons why BlackRock might consider it as the foundation for its ledger: 1) SEC Qualification Stacks stands out as a blockchain platform that has garnered approval and recognition from the U.S. SEC. This qualification is a crucial [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/spotlight/4-reasons-stacks-blockchain-could-power-blackrocks-ledger/\">4 Reasons Stacks Why Blockchain Could Power BlackRock&#8217;s Ledger</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-15T10:54:12.000Z",
    "title": "ProBit Global Enlists LOVE Token Fostering Global Crypto Adoption",
    "url": "https://coinedition.com/probit-global-enlists-love-token-fostering-global-crypto-adoption/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/01/ProBit_Global_Enlists_LOVE_Token_Fostering_Global_Crypto_Adoption.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/01/ProBit_Global_Enlists_LOVE_Token_Fostering_Global_Crypto_Adoption.jpg 730w, https://coinedition.com/wp-content/uploads/2024/01/ProBit_Global_Enlists_LOVE_Token_Fostering_Global_Crypto_Adoption-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/01/ProBit_Global_Enlists_LOVE_Token_Fostering_Global_Crypto_Adoption-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/01/ProBit_Global_Enlists_LOVE_Token_Fostering_Global_Crypto_Adoption-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/01/ProBit_Global_Enlists_LOVE_Token_Fostering_Global_Crypto_Adoption-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/01/ProBit_Global_Enlists_LOVE_Token_Fostering_Global_Crypto_Adoption-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/01/ProBit_Global_Enlists_LOVE_Token_Fostering_Global_Crypto_Adoption-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/01/ProBit_Global_Enlists_LOVE_Token_Fostering_Global_Crypto_Adoption-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/01/ProBit_Global_Enlists_LOVE_Token_Fostering_Global_Crypto_Adoption-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/01/ProBit_Global_Enlists_LOVE_Token_Fostering_Global_Crypto_Adoption-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/01/ProBit_Global_Enlists_LOVE_Token_Fostering_Global_Crypto_Adoption-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/01/ProBit_Global_Enlists_LOVE_Token_Fostering_Global_Crypto_Adoption-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/01/ProBit_Global_Enlists_LOVE_Token_Fostering_Global_Crypto_Adoption-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/01/ProBit_Global_Enlists_LOVE_Token_Fostering_Global_Crypto_Adoption-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/01/ProBit_Global_Enlists_LOVE_Token_Fostering_Global_Crypto_Adoption-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/01/ProBit_Global_Enlists_LOVE_Token_Fostering_Global_Crypto_Adoption-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent update, the prominent crypto exchange ProBit Global announced the inclusion of LOVE, the native token of the Love.io protocol, into their trading platform. Through the alliance, ProBit Global intends to foster crypto adoption and Love.io’s vision of establishing decentralized finance (DeFi). LOVE is a “revolutionary cryptocurrency” introduced by Love.io and is designed [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/probit-global-enlists-love-token-fostering-global-crypto-adoption/\">ProBit Global Enlists LOVE Token Fostering Global Crypto Adoption</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]