[
  {
    "source": "CoinDesk",
    "date": "2023-11-08T21:24:13.000Z",
    "title": "Bitcoin Breakout Toward $45K 'Imminent' Says Matrixport",
    "url": "https://www.coindesk.com/markets/2023/11/08/bitcoin-breakout-toward-45k-imminent-says-matrixport/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Polygon's MATIC and Chainlink's LINK led altcoin gains Wednesday afternoon."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-08T21:19:35.000Z",
    "title": "Arbitrum Voters Polarized Over 'Research' Pitch With $2M Price Tag",
    "url": "https://www.coindesk.com/tech/2023/11/08/arbitrum-voters-polarized-over-research-pitch-with-2m-price-tag/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Proposed coalition of professional researchers could help \"accelerate decision-making\" at the Ethereum layer-2 project, but complaints have surfaced over the cost and potential conflicts of interest."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-08T21:16:44.000Z",
    "title": "Microsoft, Meta Lay Down AI Rules to Safeguard Elections",
    "url": "https://decrypt.co/204987/microsoft-facebook-meta-election-politics-ai-deepfakes",
    "description": "Focusing on authenticity and transparency ahead of 2024, two tech titans outline measures to combat AI-powered political disinformation."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-08T21:24:44.000Z",
    "title": "Chainlink (LINK) pumps 26% in 6 days — Is there room for more? ",
    "url": "http://cointelegraph.com/news/chainlink-pumps-26-in-6-days-is-there-room-for-more",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/25ba6b9a-bfb6-45ad-b449-819ec9ee246c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>LINK token continues to strengthen as professional traders and enterprise solution clients enter Chainlink’s ecosystem.</p>\n                    <p><p>Chainlink's (<a href=\"https://cointelegraph.com/chainlink-price-index\">LINK</a>) token has experienced a remarkable 26% surge between Nov. 2 and Nov. 8, approaching $14, a level not seen since April 2022. This solidified its position as the 10th largest cryptocurrency (excluding stablecoins) by market capitalization.</p><p>While the price action is a welcome sight for traders, is Chainlink's current valuation of $8.1 billion justified? Cointelegraph research shows that the impressive price surge is driven by expectations of real-world asset (RWA) tokenization and initial signs of institutional adoption. However, let's delve deeper to assess the sustainability of the current rally.</p><h2>Spot Bitcoin ETF expectations and real world asset tokenization boost sentiment</h2><p>Bloomberg's ETF strategists, James Seyffart and Eric Balhunas, issued a research note on Nov. 8, which has boosted the confidence of cryptocurrency traders.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">New Research note from me today. We still believe 90% chance by Jan 10 for spot <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> ETF approvals. But if it comes earlier we are entering a window where a wave of approval orders for all the current applicants *COULD* occur <a href=\"https://t.co/u6dBva1ytD\">pic.twitter.com/u6dBva1ytD</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1722321412218638632?ref_src=twsrc%5Etfw\">November 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In their note, they explain that the window for approving a Bitcoin spot exchange-traded fund is set to open on Nov. 9, as the U.S. Securities and Exchange Commission concludes its latest round of postponements. </p><p>Seyffart maintains a 90% likelihood of approval, but cautions that the regulator's final decision may be delayed until mid-January.</p><p>Altcoins have also seen notable price increases in the past seven days, with Trust Wallet Token (TWT) surging by 41%, Immutable X (IMX) by 29%, and NEO by 28%. LINK's appreciation is indicative of the positive sentiment towards altcoins, particularly following Bitcoin's (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) apparent stagnation around the $35,500 mark.</p><p>Within the Chainlink's ecosystem several positive developments have contributed to the LINK’s recent performance. </p><p>On Nov. 7, Vodafone, a major European and North Africa-based telecom company, officially <a href=\"https://www.vodafone.com/news/technology/vodafone-sumitomo-announce-brand-economy-things-venture\" target=\"_blank\" rel=\"noopener nofollow\">launched</a> its partnership with the Japanese financial conglomerate Sumitomo Corporation, utilizing Chainlink oracles to facilitate transactions and offer diverse applications, including electric vehicle charging stations and toll roads. </p><p>This digital platform, known as Pairpoint, enables vehicles and devices to autonomously interact and trade in the emerging Internet of Things (IoT) landscape. Pairpoint leverages Vodafone's existing digital assets platform and has full integration with partners such as MasterCard, HSBC, Deloitte, and IBM.</p><p>Apart from IoT, a broader trend appears to be favoring Chainlink's oracle solution. RWA tokenization is poised to become mainstream, as evidenced by HSBC's <a href=\"https://www.cnbc.com/2023/11/08/hsbc-to-launch-custody-services-for-tokenized-securities.html\" target=\"_blank\" rel=\"noopener nofollow\">launch</a> of custody services for regulated securities on Nov. 8. </p><p>HSBC's Zhu Kuang Lee has noted the increasing demand for custody and fund administration of digital assets from asset managers and owners. HSBC's press release indicates that the custody service will complement its HSBC Orion platform for issuing digital assets and a recently introduced tokenized gold offering. It's also worth mentioning that HSBC manages approximately $3 trillion in assets globally.</p><h2>Professional traders’ increased demand for LINK token</h2><p>Despite the promising future prospects, traders are questioning whether there have been substantial institutional inflows into Chainlink to support the 26% rally in just six days. Unfortunately, there is no foolproof metric to gauge this, but Grayscale's Chainlink Trust (GLNK) presents an optimistic perspective, despite its relatively modest $3.9 million in assets under management. </p><p>This over-the-counter instrument is traded through regular stock market brokers, making it accessible to asset managers who cannot directly invest in cryptocurrencies. Notably, GLNK's price is trading at a 320% premium compared to the proportional underlying LINK token holdings held by the fund, indicating robust buying demand.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/0d376de5-eec7-4f31-8dac-0122ed4fbe9d.png\"  /><figcaption style=\"text-align: center;\"><em>Grayscale Chainlink Trust (GLNK) premium vs. LINK. Source: Coinglass</em></figcaption></figure><p>Further fueling Chainlink's impressive gains is the listing of LINK on the HashKey exchange, a licensed trading platform catering to professional investors in Hong Kong. Although it launched in August 2023, the exchange is affiliated with the same group behind HashKey Capital, a prominent digital asset venture investment firm founded in 2015.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/hsbc-ripple-metaco-security-token-custody\">HSBC taps Ripple’s Metaco to launch security token custody</a></em></strong></p><p>From an on-chain metrics perspective, Chainlink's price surge is supported by increased network activity. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/5f90cf93-818f-4524-ae45-84a28f79dcaf.png\"  /><figcaption style=\"text-align: center;\"><em>Chainlink 1-day transaction count. Source: Messari/Coin Metrics</em></figcaption></figure><p>Notably, the most recent peak occurred on Nov. 7, 2022, <a href=\"https://cointelegraph.com/news/ftx-addresses-user-withdrawal-complaints-amid-major-token-movement\">coinciding with issues at the now-defunct FTX exchange</a>. Excluding this specific instance, the current two-day average of 7,700 daily Chainlink transactions is the highest since June 2021.</p><p>While some valid criticisms have been raised <a href=\"https://cointelegraph.com/news/chainlink-garners-criticism-after-quiet-change-multisig\">regarding Chainlink's excessive centralization</a>, its oracle dominance remains unchallenged. Consequently, any tailwind for the RWA market should likely have a positive impact on LINK's price, paving the way for further price hikes above $14.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-08T21:30:09.000Z",
    "title": "Bitcoin’s climb above $35,000 followed by surprisingly measured market",
    "url": "https://cryptoslate.com/bitcoins-climb-above-35000-followed-by-surprisingly-measured-market/",
    "description": "<p>Options are pivotal in gauging market expectations, allowing traders to secure the right to buy (call options) or sell (put options) Bitcoin at a predetermined price. The open interest &#8211; the sum of all active option contracts &#8211; and the ratio between puts and calls can reflect the market&#8217;s sentiment and conviction. At the same [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoins-climb-above-35000-followed-by-surprisingly-measured-market/\">Bitcoin’s climb above $35,000 followed by surprisingly measured market</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-08T21:36:46.000Z",
    "title": "Former NYSE President’s Firm in the Running to Acquire Bankrupt Crypto Exchange FTX",
    "url": "https://www.cryptopolitan.com/former-nyse-presidents-firm-in-the-running-to-acquire-ftx/",
    "description": "Amid the ongoing saga of FTX&#8217;s bankruptcy, a fresh chapter begins as potential buyers line up to infuse new life into the defunct crypto exchange. Leading the charge is a group headed by Tom Farley, the former NYSE president, whose firm Bullish Global is one of the three bidders vying for the acquisition, according to ... <a title=\"Former NYSE President&#8217;s Firm in the Running to Acquire Bankrupt Crypto Exchange FTX\" class=\"read-more\" href=\"https://www.cryptopolitan.com/former-nyse-presidents-firm-in-the-running-to-acquire-ftx/\" aria-label=\"More on Former NYSE President&#8217;s Firm in the Running to Acquire Bankrupt Crypto Exchange FTX\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-08T21:20:48.000Z",
    "title": "SEC Chair Gary Gensler warns of widespread crypto scams amid FTX fallout",
    "url": "https://www.cryptopolitan.com/sec-chair-gary-gensler-warns-of-widespread-crypto-scams-amid-ftx-fallout/",
    "description": "Securities and Exchange Commission (SEC) Chair Gary Gensler flagged the prevalence of fraudulent activity within the cryptocurrency sector. This caution comes amid high-profile legal proceedings and increased regulatory scrutiny on digital assets. During DC Fintech Week, Gary Gensler emphasized that the issues plaguing the cryptocurrency market extend beyond individual cases. &#8220;It&#8217;s not just about one ... <a title=\"SEC Chair Gary Gensler warns of widespread crypto scams amid FTX fallout\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-chair-gary-gensler-warns-of-widespread-crypto-scams-amid-ftx-fallout/\" aria-label=\"More on SEC Chair Gary Gensler warns of widespread crypto scams amid FTX fallout\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-08T21:22:01.000Z",
    "title": "CEHV partner suggests uncertain times ahead amid Genesis shutdown ",
    "url": "https://crypto.news/cehv-partner-suggests-uncertain-times-ahead-amid-genesis-shutdown/",
    "description": "With many analysts speculating the outcomes of the Spot Bitcoin ETF race, partner at CEHV, Adam Cochran, shares his perspective in a Nov. 8 post on X."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-08T21:18:39.000Z",
    "title": "NEAR and Polygon partner to innovate on zero-knowledge proofs",
    "url": "https://crypto.news/near-and-polygon-partner-to-innovate-on-zero-knowledge-proofs/",
    "description": "NEAR Foundation partners with Polygon Labs to develop zkWASM, a cutting-edge zero-knowledge solution enhancing interoperability and security for WASM chains."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-08T21:40:44.000Z",
    "title": "Ripple Introduces Ripple Payments: Pioneering Cross-Border Payment Evolution",
    "url": "https://www.crypto-news-flash.com/ripple-introduces-ripple-payments-pioneering-cross-border-payment-evolution/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-introduces-ripple-payments-pioneering-cross-border-payment-evolution",
    "description": "<img width=\"1000\" height=\"668\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Ripple.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Ripple-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Ripple-768x513.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Ripple-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Blockchain payments firm Ripple Labs has launched Ripple Payments. This product is the next frontier in the evolution of its cross-border capabilities. Ripple Labs Inc., a pioneer in enterprise blockchain and crypto solutions, has unveiled the latest evolution of its cross-border payment solution, now known as Ripple Payments. This groundbreaking development empowers businesses to harness [...]"
  }
]