[
  {
    "source": "CoinDesk",
    "date": "2023-09-15T19:52:38.000Z",
    "title": "DOJ Slams Sam Bankman-Fried’s ‘Intrusive’ Proposed Jury Questions ",
    "url": "https://www.coindesk.com/policy/2023/09/15/doj-slams-sam-bankman-frieds-intrusive-proposed-jury-questions/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Federal prosecutors are criticizing void dire questions proposed by Sam Bankman-Fried's defense team."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-15T19:58:07.000Z",
    "title": "Google Gemini Poised to Take On AI Titans OpenAI and Microsoft",
    "url": "https://decrypt.co/197378/google-gemini-poised-to-take-on-ai-titans-openai-and-microsoft",
    "description": "Google has reportedly started testing its most advanced AI model to date, Gemini, which it says has impressive multimodal capabilities."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-15T19:41:06.000Z",
    "title": "London Design Museum Lets Visitors Test Iconic Runway Looks via AR",
    "url": "https://decrypt.co/197360/london-design-museum-lets-visitors-test-iconic-runway-looks-ar",
    "description": "An augmented reality experience developed by Snapchat maker Snap is part of the museum's new \"Rebel: 30 Years of London Fashion\" exhibit."
  },
  {
    "source": "BTCManager",
    "date": "2023-09-15T20:00:20.000Z",
    "title": "Hong Kong regulator warns on crypto firms mislabeled as ‘banks’",
    "url": "https://crypto.news/hong-kong-regulator-warns-on-crypto-firms-mislabeled-as-banks/",
    "description": "The Hong Kong Monetary Authority has cautioned the public against crypto firms that describe themselves as banks or offer products termed as deposits. On Sept. 15, the Hong Kong Monetary Authority (HKMA) issued a public statement expressing concern over crypto&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-15T19:53:11.000Z",
    "title": "Former Deutsche Bank employer pleads guilty to crypto fraud",
    "url": "https://crypto.news/former-deutsche-bank-employer-pleads-guilty-to-crypto-fraud/",
    "description": "Rashawn Russell admits wrongdoing after falsely promising investors &#8216;assured profits&#8217; for their crypto investments.  Rashawn Russell, a former investment banking professional at Deutsche Bank, is preparing to enter a guilty plea on charges of cryptocurrency fraud, according to new court&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-15T20:00:44.000Z",
    "title": "Holesky Testnet Takes Flight On Merge Anniversary Amidst Ethereum 30-Day Slump",
    "url": "https://www.newsbtc.com/news/ethereum/holesky-testnet-takes-flight-on-merge-anniversary-amidst-ethereum-30-day-slump/",
    "description": "One year has passed since the Ethereum (ETH) Merge, which marked the integration of Ethereum&#8217;s proof-of-stake (PoS) Beacon Chain with the Ethereum Mainnet.  This significant milestone facilitated the transition of the Ethereum blockchain from the legacy proof-of-work (PoW) system to a PoS model, giving rise to Ethereum 2.0. The completion of the Merge on September 15, 2022, brought about a major shift in Ethereum&#8217;s energy consumption, with an expected reduction of 99.95%. Additionally, this transition opened up new possibilities for scaling the Ethereum ecosystem. The merge involved migrating the entire blockchain to new PoS validator nodes, which require participants to stake or lock up 32 Ether (ETH) to participate in the network. Importantly, this transition did not impact Ether tokens held by investors, and the operations of Ethereum-based applications remained unchanged. As Ethereum celebrated the first anniversary of The Merge, it introduced its latest testnet called Holesky. Related Reading: Artist Stages Crypto Protest In Front Of US SEC With “Rug Pull” Exhibit The Future Of Ethereum Development And Testing? Initially known as Holli, the Holesky testnet is designed to enhance the testing environment on Ethereum. Drawing inspiration from a vibrant neighborhood in Prague, Czech Republic, this new testnet offers various improvements over its predecessor, Goerli.  According to a blog post from the software development firm Tatum, Holesky is set to replace Goerli as the primary testnet for staking, infrastructure, and protocol development. For testing decentralized applications, smart contracts, and other Ethereum Virtual Machine (EVM)-related functions, the Sepolia testnet remains the preferred choice. Holesky, on the other hand, serves as Ethereum&#8217;s merged-from-genesis public testnet, mirroring mainnet functionalities and enabling precise evaluations through thorough staking trials, infrastructure assessments, and direct protocol developer testing. To ensure rigorous testing, Holesky aims to have twice as many active validators as the main Ethereum network.  The network starts with a solid foundation of 1 million validators, encouraging teams to run a substantial number of validators, with each team handling around 100,000 validators. These measures contribute to the comprehensive evaluation of the testnet and intended functionality. According to Tatum’s blog post, by introducing Holesky and refining inflation mechanisms based on the Sepolia testnet, Ethereum continues to evolve and improve its protocols.  One Year After The Merge In a recent post on X (Formerly Twitter), the self-proclaimed Ethereum Educator, who goes by the pseudonym &#8220;Sassal.eth,&#8221; highlighted some notable statistics on the first anniversary of The Merge.  One significant achievement for Ethereum since the Merge is burning 980,000 ETH tokens, resulting in a permanent reduction of Ethereum&#8217;s total supply. Burning ETH involves removing tokens from circulation, contributing to potential scarcity and value.  Additionally, the Ethereum 2.0 network has seen a significant 11.6 million ETH being staked, which involves locking up ETH as collateral to participate in the proof-of-stake consensus mechanism. Moreover, according to Sassal, adding 362,000 new validators has strengthened the Ethereum network. Validators are crucial in proposing and validating new blocks, ensuring the network&#8217;s security and overall robustness.  Related Reading: Dogecoin Price Prediction for 2023, 2024, 2025, 2030 &#38; Beyond On the other hand, Ethereum&#8217;s native token, ETH, has experienced a tumultuous journey in terms of its price performance since the beginning of the year. Despite reaching an annual high of $2,144 on April 16, ETH has been impacted by the overall market trend, resulting in significant losses across various time frames. Currently, ETH is trading at $1,619, representing a 1% decline in the past 24 hours. Similarly, over the past seven days, the token has recorded a decrease of 0.9%.  Looking at the fourteen and 30-day time frames, ETH has experienced declines of 1% and 11.3%, respectively, underscoring the prevailing downward trend for the token&#8217;s value.  However, it is worth noting that since the occurrence of The Merge, ETH has witnessed a moderate rise of 7.6% year to date, according to Coingecko data. Featured image from iStock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-15T20:00:22.000Z",
    "title": "US Commodities Regulator Shouldn’t Launch Enforcement Actions Against DeFi Protocols, Says Coinbase CEO",
    "url": "https://dailyhodl.com/2023/09/15/us-commodities-regulator-shouldnt-launch-enforcement-actions-against-defi-protocols-says-coinbase-ceo/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/us-launch-actions-defi.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/us-launch-actions-defi.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/us-launch-actions-defi.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/us-launch-actions-defi.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/us-launch-actions-defi.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/us-launch-actions-defi.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/us-launch-actions-defi.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Coinbase CEO Brian Armstrong says the U.S. Commodity Futures Trading Commission (CFTC) shouldn&#8217;t be issuing warnings against decentralized finance (DeFi) protocols. Last week, the CFTC announced that it charged DeFi protocols ZeroEx, Opyn and Deridex for offering illegal derivatives trading. The regulator says it also ordered the three firms to pay monetary penalties and to cease and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/15/us-commodities-regulator-shouldnt-launch-enforcement-actions-against-defi-protocols-says-coinbase-ceo/\">US Commodities Regulator Shouldn’t Launch Enforcement Actions Against DeFi Protocols, Says Coinbase CEO</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-15T19:55:57.000Z",
    "title": "Crypto Trader Shares Bitcoin Halving ‘Cheatsheet’, Breaks Down the Latest Litecoin Price Action",
    "url": "https://dailyhodl.com/2023/09/15/crypto-trader-shares-bitcoin-halving-cheatsheet-breaks-down-the-latest-litecoin-price-action/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/10/altcoin-bitcoin-surge-2.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/10/altcoin-bitcoin-surge-2.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/10/altcoin-bitcoin-surge-2.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/10/altcoin-bitcoin-surge-2.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/10/altcoin-bitcoin-surge-2.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/10/altcoin-bitcoin-surge-2.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/10/altcoin-bitcoin-surge-2.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is sharing what he calls a &#8220;cheatsheet&#8221; for reading Bitcoin (BTC) price movements as the next halving approaches. Pseudonymous trader Rekt Capital shares a graph with his 351,800 followers on the social media platform X that suggests BTC&#8217;s current prices are within the expected pre-halving range. &#8220;The Bitcoin Halving Cheatsheet.&#8221; [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/15/crypto-trader-shares-bitcoin-halving-cheatsheet-breaks-down-the-latest-litecoin-price-action/\">Crypto Trader Shares Bitcoin Halving ‘Cheatsheet’, Breaks Down the Latest Litecoin Price Action</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]