[
  {
    "source": "Crypto Daily",
    "date": "2024-03-23T17:35:16.000Z",
    "title": "Wish You'd Invested in PEPE, BOME, Shiba INU, Floki? 2024's Gem Is Your Chance to Shine",
    "url": "https://cryptodaily.co.uk/2024/03/wish-youd-invested-in-pepe-bome-shiba-inu-floki-2024s-gem-is-your-chance-to-shine",
    "description": "Ever find yourself wishing you had jumped on the bandwagon early with PEPE, BOME, Shiba INU, or Floki? Well, get ready to turn that regret into triumph because 2024 has brought forth a new gem that's ready to shine brighter than all the rest."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-23T17:28:27.000Z",
    "title": "Uniswap (UNI) and Litecoin (LTC) Followers Embrace the Warmth of Koala Coin (KLC) Expecting a Snuggly Surge",
    "url": "https://cryptodaily.co.uk/2024/03/uniswap-uni-and-litecoin-ltc-followers-embrace-the-warmth-of-koala-coin-klc-expecting-a-snuggly-surge",
    "description": "With over 500 new cryptocurrencies launched in 2024 alone, the presale of Koala Coin (KLC) is sparking a fuzzy frenzy among Uniswap (UNI) and Litecoin (LTC) enthusiasts."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-23T17:21:53.000Z",
    "title": "Uniswap UNI) and Filecoin (FIL) Stakeholders See Pushd as the Catalyst for an Online Shopping Revolution",
    "url": "https://cryptodaily.co.uk/2024/03/uniswap-uni-and-filecoin-fil-stakeholders-see-pushd-as-the-catalyst-for-an-online-shopping-revolution",
    "description": "You don't need to look far to find success stories in the crypto space. There are numerous examples even in recent times that support the idea that massive gains can be made in the crypto market. Then why have some investors failed to see returns on their investments?"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-23T17:16:04.000Z",
    "title": "Trump Inu (TRUMPINU) Is Now Available for Trading on LBank Exchange",
    "url": "https://cryptodaily.co.uk/2024/03/trump-inu-trumpinu-is-now-available-for-trading-on-lbank-exchange",
    "description": "LBank Exchange Will List Trump Inu (TRUMPINU) on March 22, 2024"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-23T17:19:00.000Z",
    "title": "Uniswap Price Prediction 2024-2033: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2024-2033 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-23T17:21:47.000Z",
    "title": "Rebel Satoshi’s new token shines amid upswing on Avalanche, Aptos",
    "url": "https://crypto.news/rebel-satoshis-new-token-shines-amid-upswing-on-avalanche-aptos/",
    "description": "In 2024, Avalanche and Aptos have seen impressive gains of 39% and 61% respectively, with experts predicting continued growth, while Rebel Satoshi's RECQ emerges as a top investment. #partnercontent"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-23T17:30:11.000Z",
    "title": "March Sees Nearly $1 Billion In Ethereum Netflow To Centralized Exchanges – What’s Happening?",
    "url": "https://www.newsbtc.com/news/ethereum/march-sees-nearly-1-billion-in-ethereum-netflow-to-centralized-exchanges-whats-happening/",
    "description": "The price of Ethereum has not exactly lived up to its promise as the month has gone on, despite a stellar start to the month. While this bearish pressure has been widespread in the general cryptocurrency market, regulation uncertainty has been an additional concern for ETH, igniting a negative sentiment around the “king of altcoins.” Interestingly, the latest on-chain revelation shows a substantial amount of Ethereum has made its way to exchanges so far in March, suggesting that investors might be losing confidence in the long-term promise of the cryptocurrency. Are Investors Losing Confidence In Ethereum? According to data from CryptoQuant, more than $913 million has been recorded in net ETH transfers to centralized exchanges so far in March. This on-chain information was revealed via a quicktake post on the data analytics platform. This net fund movement represents the largest volume of Ethereum transferred to centralized exchanges in a single month since June 2022. Even though March is still a week from being over, this exchange inflow appears to be a complete deviation from the pattern observed over the past few months. Chart showing total monthly netflow of ETH on centralized exchanges &#124; Sources: CryptoQuant Related Reading: Dogecoin Whales Go On Massive Buying Spree, Here’s How Much They’ve Bought As shown in the chart above, October 2023 was the last time cryptocurrency exchanges witnessed a positive net flow. It is worth noting that there was significant movement of Ethereum tokens out of the centralized platforms in subsequent months up until this month. Meanwhile, a separate data point that supports the massive exodus of ETH to centralized exchanges has come to light. Popular crypto analyst Ali Martinez revealed on X nearly 420,000 Ethereum tokens (equivalent to $1.47 billion) have been transferred to cryptocurrency exchanges in the past three weeks. The flow of large amounts of cryptocurrency to centralized exchanges is often considered a bearish sign, as it can be an indication that investors may be willing to sell their assets. Ultimately, this can put downward pressure on the cryptocurrency’s price. Substantial fund movements to trading platforms could also represent a shift in investor sentiment. It could be a sign that investors are losing faith in a particular asset (ETH, in this case). Moreover, the recent regulatory headwind surrounding Ethereum specifically accentuates this hypothesis.  According to the latest report, the United States Securities and Exchange Commission is considering a probe to classify the ETH token as a security. ETH Price As of this writing, the Ethereum token is valued at $3,343, reflecting a 4% price decline over the past /4 hours. According to data from CoinGecko, ETH is down by 11% in the past week. Related Reading: Bernstein Analysts Says Bitcoin Will Reach A New ATH By Year End, Here’s The Target Ethereum loses the $3,400 level again on the daily timeframe &#124; Source: ETHUSDT chart on TradingView Featured image from Unsplash, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-23T17:33:22.000Z",
    "title": "Retik Finance (RETIK) Gathers Momentum With Unexpected Virtual DeFi Debit Cards Release, Everything You Need To Know",
    "url": "https://www.crypto-news-flash.com/retik-finance-retik-gathers-momentum-with-unexpected-virtual-defi-debit-cards-release-everything-you-need-to-know/?utm_source=rss&utm_medium=rss&utm_campaign=retik-finance-retik-gathers-momentum-with-unexpected-virtual-defi-debit-cards-release-everything-you-need-to-know",
    "description": "<img width=\"1200\" height=\"675\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-23T202321.034.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-23T202321.034.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-23T202321.034-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-23T202321.034-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-23T202321.034-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-23T202321.034-450x253.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Retik Finance has recently surged into the spotlight as a formidable competitor to Solana, propelled by its unexpected release of Virtual DeFi Debit Cards. This groundbreaking move has garnered significant attention within the cryptocurrency community, raising questions about Retik Finance&#8217;s potential to challenge Solana&#8217;s dominance in the market. Let us delve into the details of [...]"
  }
]