[
  {
    "source": "Decrypt",
    "date": "2023-10-04T19:51:09.000Z",
    "title": "U.S. Government Debt Grows by $275 Billion in One Day",
    "url": "https://decrypt.co/200179/national-debt-33-trillion-275-billion-in-one-day",
    "description": "Analysts look at Bitcoin's deflationary prospects amid surging debt levels, which raise concerns about the nation's ability to fund essential services."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-04T19:59:46.000Z",
    "title": "Cocoa broker testifies to Bitcoin holdings on FTX in Sam Bankman-Fried trial",
    "url": "https://cointelegraph.com/news/first-witness-sam-bankman-fried-trial",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/af9fa75d-85b7-47e2-85bd-b59f7efa4804.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>London-based cocoa broker Marc-Antoine Julliard responded to questions from prosecutors on crypto he held on FTX in November 2022.</p>\n                    <p><p>The prosecuting attorneys in the criminal case against former FTX CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried</a>, also known as SBF, have started to call witnesses.</p><p>According to an Oct. 4 X (formerly Twitter) thread by Inner City Press, the Assistant United States Attorneys <a href=\"https://twitter.com/innercitypress/status/1709642281932722477\" target=\"_blank\" rel=\"noopener nofollow\">presented</a> testimony from a London-based cocoa broker named Marc-Antoine Julliard who used FTX for crypto trading. Julliard spoke on learning about the crypto exchange from a friend, seeing <a href=\"https://cointelegraph.com/news/tom-brady-and-other-celebrities-named-in-class-action-lawsuit-against-ftx\">advertisements for the firm by Gisele Bündchen</a>, and using the FTX mobile app for trading cryptocurrencies including Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>). </p><p>In testimony before the court, the cocoa broker said he had 4 Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) worth roughly $80,000 at the time he was unable to withdraw from FTX in November 2022, following a <a href=\"https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-removes-assets-are-fine-flood-from-twitter\">Twitter post from Bankman-Fried</a> that \"assets were fine\". SBF’s legal team reportedly asked Julliard whether he had had contact with FTX prior to his testimony, and the reasons behind his crypto investment.</p><p>Among the witnesses <a href=\"https://cointelegraph.com/news/ftx-execs-witnesses-sam-bankman-fried-criminal-trial\">expected to testify at trial</a> are former Alameda Research CEO Caroline Ellison, FTX co-founder Gary Wang, former FTX engineering director Nishad Singh, former FTX chief operating officer Constance Wang and SkyBridge Capital co-founder Anthony Scaramucci. It’s unclear whether Bankman-Fried intends to take the stand himself.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We decided to illustrate the lead-up to <a href=\"https://twitter.com/SBF_FTX?ref_src=twsrc%5Etfw\">@SBF_FTX</a>&#39;s trial. Here’s Bankman-Fried&#39;s life in the slammer. From mirror monologues to peanut butter banquets, the fall is real. <a href=\"https://t.co/v73IA6d5l2\">pic.twitter.com/v73IA6d5l2</a></p>&mdash; Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1709161775306850367?ref_src=twsrc%5Etfw\">October 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ftx-sbf-charges-valid-despite-no-crypto-laws-doj-says\"><strong><em>FTX-SBF charges valid despite lack of US crypto laws, DOJ says</em></strong></a></p><p>Judge Lewis Kaplan completed jury selection the morning of Oct. 4, whereupon defense lawyers and prosecutors began opening arguments in the criminal trial. Assistant U.S. Attorney <a href=\"https://cointelegraph.com/news/opening-arguments-sam-bankman-fried-trial\">claimed SBF had lied</a> to FTX users, lawmakers, and the public regarding the financial state of the company, as the former CEO’s defense team partly placed blame on Caroline Ellison.</p><p>Bankman-Fried faces 7 criminal charges related to the misuse of FTX customer funds in his first trial, for which he has pleaded not guilty. He will face 5 additional charges in a second trial scheduled for March 2024.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-04T20:07:05.000Z",
    "title": "Prosecutors: SBF masterminded the FTX mega-fraud",
    "url": "https://www.cryptopolitan.com/prosecutors-sbf-masterminded-ftx-mega-fraud/",
    "description": "Amid the glaring lights of Manhattan&#8217;s federal court, the fate of one of the once-celebrated figures in the cryptoverse, Sam Bankman-Fried, hangs in the balance. The trial, pulsating with charges of vast deceit and immense fraud, kickstarted with assertions that SBF didn&#8217;t just stand on the pinnacle of crypto-glory but ascended there via flagrant lies. ... <a title=\"Prosecutors: SBF masterminded the FTX mega-fraud\" class=\"read-more\" href=\"https://www.cryptopolitan.com/prosecutors-sbf-masterminded-ftx-mega-fraud/\" aria-label=\"More on Prosecutors: SBF masterminded the FTX mega-fraud\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-04T19:59:53.000Z",
    "title": "How Kevin McCarthy got kicked out of the White House",
    "url": "https://www.cryptopolitan.com/mccarthy-got-kicked-out-of-the-white-house/",
    "description": "Dissension filled the air in Washington as Kevin McCarthy, the once unyielding Republican Speaker of the U.S. House of Representatives, met an unprecedented downfall, marking a first in the annals of American politics. With his removal, Congress plunges into deeper uncertainty, teetering on the precipice of turmoil, underscoring the volatile nature of current American politics. ... <a title=\"How Kevin McCarthy got kicked out of the White House\" class=\"read-more\" href=\"https://www.cryptopolitan.com/mccarthy-got-kicked-out-of-the-white-house/\" aria-label=\"More on How Kevin McCarthy got kicked out of the White House\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-04T20:07:09.000Z",
    "title": "Flare partners with Avascan Block to launch Flarescan explorer",
    "url": "https://crypto.news/flare-partners-with-avascan-block-to-launch-flarescan-explorer/",
    "description": "Flare has partnered with Avascan Block Explorer to launch Flarescan, a blockchain explorer for the Flare ecosystem"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-04T20:00:04.000Z",
    "title": "Will Bitcoin Price Crash To $10,000? Bloomberg Expert Reveals When",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-crash-to-10000/",
    "description": "Many analysts have weighed on the potential trajectory of the flagship cryptocurrency, Bitcoin. This time, Bloomberg analyst Mike McGlone has highlighted the possibility of Bitcoin price declining further and when this could happen. Bitcoin Price Could Decline Further In a tweet on his X (formerly Twitter) platform, McGlone noted that Bitcoin risks declining to $10,000 (which could happen by year-end) as it continues to battle the $30,000 resistance level.  This resistance level has long been touted as the key to a sustained breakout in Bitcoin’s price. However, going by the analysis that McGlone shared, the odds seem to be against this happening.  Bitcoin has risen significantly in 2023, considering that the crypto asset traded at around $16,000 at the beginning of the year. But, McGlone warned that this may be a “short-covering rally.” As part of this analysis, he noted that liquidity in the Bitcoin ecosystem remained negative heading into the fourth quarter. This ultimately means there is more selling pressure than buying pressure, which could affect Bitcoin’s price.  Another factor is the rising interest rates. McGlone noted that Bitcoin gained prominence in a “zero interest-rate world” with greater financial freedom. But now, Bitcoin (alongside other cryptocurrencies) might continue to endure a hangover as “global rates continue to rise.”  Global inflation is said to be on the rise, and to curb it, authorities are raising interest rates, which could restrict spending and, by extension, the liquidity that goes into the crypto market.  Meanwhile, the analysis noted Bitcoin’s importance in the grand scheme of things. Bloomberg Intelligence drew a correlation between the FED fund futures and Bitcoin’s price. According to projections, Bitcoin needs to decline further before there can be a liquidity reversal in those funds.  While the Federal Reserve may not care about Bitcoin, he stated that Bitcoin’s “24/7-traded, leading indicator status could be gaining traction.” BTC could fall to $10,000 &#124; Source: X The Fate Of The Broader Crypto Market In another tweet, McGlone noted that cryptocurrencies “might be leaning into recession.” To drive home this point, he highlighted the relation between the crypto and stock market and stated that the latter could succumb to an “ebbing tide” suppose the stock market were to experience a “typical drawdown” due to a recession.  Despite the “broader on-and-of-again fluctuations,” this projection is said to be reflected in the “downward trajectory” of the Bloomberg Galaxy Crypto Index (BGCI) and Russell 2000 Index (RTY) from their all-time highs in 2022. Both markets have remained tepid and continue to consolidate as they anticipate a “catalyst” that could spark a price surge.  This analysis is similar to that of crypto analyst Nicholas Merten, who, while drawing out the direct relation between both markets, noted that if the stocks of big tech companies like Apple and Microsoft don’t start picking up, there could be a “really big problem” for the crypto market.  BTC price still holding above $27,000 &#124; Source: BTCUSD on Tradingview.com Featured image from Investor&#8217;s Business Daily, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-04T20:00:00.000Z",
    "title": "Bitcoin To ‘Roll Back Down’ if BTC Fails To Break Through This Critical Resistance Zone, Says Nicholas Merten",
    "url": "https://dailyhodl.com/2023/10/04/bitcoin-to-roll-back-down-if-btc-fails-to-break-through-this-critical-resistance-zone-says-nicholas-merten/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-roll-back-down.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-roll-back-down.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-roll-back-down.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-roll-back-down.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-roll-back-down.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-roll-back-down.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/bitcoin-roll-back-down.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto trader Nicholas Merten is detailing a key target that Bitcoin (BTC) must reach in order to confirm a bull market. Merten tells his 512,000 YouTube subscribers that Bitcoin is likely to undergo a steep correction if it fails to break above the range it has been trading in for about six months now. &#8220;If [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/04/bitcoin-to-roll-back-down-if-btc-fails-to-break-through-this-critical-resistance-zone-says-nicholas-merten/\">Bitcoin To ‘Roll Back Down’ if BTC Fails To Break Through This Critical Resistance Zone, Says Nicholas Merten</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-04T19:55:11.000Z",
    "title": "Arthur Hayes Says Bitcoin and Crypto Bull Market Will Resume Once One Catalyst Is Activated",
    "url": "https://dailyhodl.com/2023/10/04/arthur-hayes-says-bitcoin-and-crypto-bull-market-will-resume-once-one-catalyst-is-activated/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/BTC-Could-Nuke-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/BTC-Could-Nuke-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/BTC-Could-Nuke-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/BTC-Could-Nuke-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/BTC-Could-Nuke-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/BTC-Could-Nuke-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/BTC-Could-Nuke-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>BitMEX founder Arthur Hayes believes Bitcoin’s (BTC) bull market will reignite after one event plays out. Hayes tells his 395,700 followers on the social media platform X that the Federal Reserve will likely start printing money again, which will send Bitcoin soaring. One signal that the Fed will need to pivot and prop up the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/04/arthur-hayes-says-bitcoin-and-crypto-bull-market-will-resume-once-one-catalyst-is-activated/\">Arthur Hayes Says Bitcoin and Crypto Bull Market Will Resume Once One Catalyst Is Activated</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]