[
  {
    "source": "Cointelegraph",
    "date": "2023-10-02T20:21:46.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>A Kenyan parliamentary report on Worldcoin has expressed grave concerns about the iris-scanning project. Crypto asset manager Grayscale has filed an application with the U.S. SEC to convert its Ethereum Trust to a spot Ethereum ETF. Meanwhile, Bitcoin and Ethereum registered a sudden surge in line with \"Uptober\" — a month observed to be positive for crypto prices in the past.</p><h3>Kenyan committee calls for shutdown of Worldcoin</h3><p>A parliamentary committee in Kenya’s government wants Worldcoin to <a href=\"https://cointelegraph.com/news/kenya-parliamentary-committee-shutdown-worldcoin\">cease operations in the African country</a>.</p><p>According to a report from the Kenyan parliament, Worldcoin is collecting residents' personal data “in total disregard” of <a href=\"https://cointelegraph.com/news/worldcoin-kenya-suspends-local-activities-of-worldcoin\">a stop order in May</a>. The report said:</p><blockquote>“The registration of Kenyans by Worldcoin online App is still going on despite the pendency of a court order and other administrative directions halting the same in entirety.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/e4f1ffe4-2a75-4bb8-a983-b035888f4a9d.jpg\"  /><figcaption style=\"text-align: center;\"><em>Kenya's parliamentary report on Worldcoin.</em></figcaption></figure><p>However, the report also indicated that it was difficult to determine how many “orbs” Worldcoin operates in the country, or the devices the company uses to receive iris scans from users. In addition to expressing concerns over Worldcoin, the report called on the government to consider developing a comprehensive framework for digital assets. </p><h3>Grayscale submits SEC filing to convert Ethereum Trust to spot ETF</h3><p>Following the approval of the first Ether futures exchange-traded fund (ETF), Grayscale Investments is looking to convert its Grayscale Ethereum Trust to a spot Ether exchange-traded fund (ETF). </p><p>The New York Stock Exchange Arca filed for the conversion with the United States Securities and Exchange Commission (SEC) on Oct. 2. Grayscale’s existing trust invested in Ether futures contracts as an indirect means of exposure to ETH, but a spot ETF will invest in the underlying asset itself.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> <a href=\"https://twitter.com/Grayscale?ref_src=twsrc%5Etfw\">@Grayscale</a> has filed to convert Grayscale Ethereum Trust to a spot ETF. <a href=\"https://twitter.com/search?q=%24ETHE&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETHE</a><br><br>Thank you for your continued support -- our team is just getting started! <a href=\"https://t.co/3nNtfe4Nns\">https://t.co/3nNtfe4Nns</a></p>&mdash; Sonnenshein (@Sonnenshein) <a href=\"https://twitter.com/Sonnenshein/status/1708822298738737328?ref_src=twsrc%5Etfw\">October 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Grayscale CEO Michael Sonnenshein announced the move on X (formerly Twitter) and highlighted the firm’s intent to provide conventional investment products offering exposure to cryptocurrency assets:</p><blockquote>“As we file to convert ETHE to an ETF, the natural next step in the product’s evolution, we recognize this as an important moment to bring Ethereum even further into the U.S. regulatory perimeter.”</blockquote><p>At the time of writing, the Ethereum Trust is valued at $4.9 billion and accounts for around 2.5% of circulating ETH. Grayscale also reports that 250,000 investor accounts have exposure to the trust.</p><h3>Bitcoin, Ethereum surprises with sudden 15-minute price surge</h3><p>More than $70 million in crypto shorts<a href=\"https://cointelegraph.com/news/bitcoin-ethereum-price-pump-uptober-millions-short-liquidation\"> were suddenly liquidated</a> after a surprise jump in the price of Bitcoin (BTC) and Ether (ETH). </p><p>Bitcoin gained 3% in just 15 minutes to reach over $28,000, while the price of Ether also surged, gaining as much as 4.7% in a brief spike to $1,755.</p><p>The sudden jump has perplexed observers in the crypto community. Most have attributed it to “Uptober.” </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">the 200w and 200d MAs are right on top of each other providing resistance <br><br>would be great to see <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcoin</a> make a strong break above and flip to support this week <a href=\"https://t.co/AY2tNKW47t\">pic.twitter.com/AY2tNKW47t</a></p>&mdash; Alex Thorn (@intangiblecoins) <a href=\"https://twitter.com/intangiblecoins/status/1708621781286736243?ref_src=twsrc%5Etfw\">October 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Uptober is crypto parlance for October typically being a bullish month for the price action of Bitcoin and other cryptocurrencies. According to <a href=\"https://www.coinglass.com/today\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from CoinGlass, October has only produced negative monthly returns twice since 2013.</p><p>In a Oct. 2 note, Matrixport head of research Markus Thielen said a rally breaking above $28,000 could lift prices to $30,000 in the short term. </p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-02T20:18:21.000Z",
    "title": "Why is Ether (ETH) price up today?",
    "url": "https://cointelegraph.com/news/why-is-ethereum-eth-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-01/62a9e911-43a2-4cc4-92a1-f4819d8f0db5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ether price is up today as Ethereum futures ETF launches and other signs of institutional adoption boost investor sentiment.</p>\n                    <p><p>Ethereum's native token, Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) saw marginal gains on Oct. 2, driven by the anticipation of institutional investor inflow following the <a href=\"https://cointelegraph.com/news/van-eck-ethereum-strategy-etf-launches-cboe\">launch of an exchange-traded fund (ETF) linked to Ether futures</a> on traditional stock market exchanges. The adoption of the Ethereum network by traditional financial institutions for real-world tokenized assets (RWA) has also had a positive impact on investor sentiment.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/a704973d-4b1d-42cc-be87-036c156b7a7f.png\"  /><figcaption style=\"text-align: center;\"><em>Ether price index in USD, 12-hour. Source: TradingView</em></figcaption></figure><p>Between Oct. 1 and Oct. 2, Ether recorded gains of 1.1%, bringing its price close to the $1,700 resistance level for the first time in a month.</p><h2>Multiple Ethereum futures ETF instruments shift the narrative</h2><p>Eric Balhunas, a senior ETF analyst at Bloomberg, expressed disappointment with the initial trading performance of Ethereum futures instruments listed on Oct. 2 by VanEck, ProShares, Valkyrie and Bitwise in a post on the X social network (formerly Twitter).</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Pretty meh volume for the Ether Futures ETFs as a group, a little under $2m, about normal for a new ETF but vs <a href=\"https://twitter.com/search?q=%24BITO&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BITO</a> (which did $200m in first 15min) it is low. Tight race bt VanEck and ProShares in the single eth lane. <a href=\"https://t.co/F9AHtrVcVf\">pic.twitter.com/F9AHtrVcVf</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1708865693481836849?ref_src=twsrc%5Etfw\">October 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The data indicates that 64% of the trading volume in these futures instruments comes from ETFs that provide exposure to Bitcoin (BTC) and Ether futures. VanEck's products are listed on the Chicago Board Options Exchange (CBOE), while Proshares and Bitwise have chosen the New York Stock Exchange for their listings.</p><p>Despite the initial disappointment, Ethereum enthusiasts are pleased with the ETFs as they have created a fully regulated investment vehicle for institutional investors who previously lacked access to cryptocurrency markets.</p><h2>UBS picks the Ethereum network for its tokenization project</h2><p>On Oct. 2, Swiss bank UBS announced the launch of a live pilot for <a href=\"https://cointelegraph.com/news/ethereum-ubs-tokenize-money-market-fund-launch\">tokenized real-world assets (RWA) on the Ethereum</a> blockchain. This initiative, led by Singapore's central bank, involves UBS Asset Management issuing tokens representing shares of a money market fund.</p><p>This event further validates investor confidence in the Ethereum network's smart contract processing capabilities and security, which has contributed to the positive momentum in Ether's price. The growing use cases for Ethereum justify a higher valuation for its native token, as it is essential for conducting transactions on the network.</p><h2>Grayscale requests conversion of its Ethereum Trust (ETHE)</h2><p>Crypto asset manager Grayscale has submitted an application to the U.S. Securities and Exchange Commission (SEC) seeking approval to <a href=\"https://cointelegraph.com/news/grayscale-applies-to-convert-ethereum-trust-to-spot-etf\">transform its Ethereum Trust into a spot Ethereum ETF</a>. Grayscale's Ethereum Trust (ETHE) was initially launched in March 2019 and currently boasts a net asset value of $4.9 billion, equivalent to 2,981,563 ETH held within its structure.</p><p>Investment trusts, such as ETHE, are legally organized as companies and are categorized as \"closed-end funds.\" Consequently, the availability of shares is restricted, with their price largely determined by supply and demand dynamics. As a result, the creation of ETHE shares is not easily achievable, and there is no active redemption program in place. This situation often leads to significant price disparities compared to the underlying value represented by the ETH fractions held by the trust.</p><h2>Short liquidations push Ether’s price to $1,755</h2><p>Ethereum's price increase on Oct. 1 coincided with short liquidations totaling $23 million in Ether futures contracts, while only $2.4 million worth of long positions were liquidated during the same 12-hour period.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/c451641c-9f24-44bf-8376-e95580c3376f.png\"  /><figcaption style=\"text-align: center;\"><em>ETH total 12-hour liquidation chart, USD. Source: CoinGlass</em></figcaption></figure><p>Short sellers were forced to close their positions by purchasing futures contracts at any price, leading to a momentary spike to $1,755 on Oct. 1, marking the highest level in 45 days.</p><p>It's important to note that the subsequent correction to $1,680 on Oct. 2 triggered the liquidation of $10.8 million worth of long positions, contributing to the market volatility.</p><p>Ultimately, Ethereum bulls have reasons to feel more optimistic, as a new avenue for investment through traditional stock market brokers has emerged, along with the increasing potential for real-world asset tokenization on the Ethereum blockchain.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-02T20:20:48.000Z",
    "title": "Jamie Dimon praises AI tech, saying JP Morgan could use it in ‘every single process’",
    "url": "https://cryptoslate.com/jamie-dimon-praises-ai-tech-saying-jp-morgan-could-use-it-in-every-single-process/",
    "description": "<p>Jamie Dimon, the CEO of JP Morgan Chase, praised various applications for artificial intelligence (AI) in an interview with Bloomberg on Oct. 2. Dimon called AI a &#8220;living, breathing thing&#8221; that can adapt to multiple multiple areas. He said that JP Morgan could use AI in &#8220;every single process,&#8221; stating: &#8220;So errors, trading, hedging, research, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/jamie-dimon-praises-ai-tech-saying-jp-morgan-could-use-it-in-every-single-process/\">Jamie Dimon praises AI tech, saying JP Morgan could use it in &#8216;every single process&#8217;</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-02T20:37:17.000Z",
    "title": "Silk Road Founder  Marks 10 Years in Prison Amidst Calls for Clemency",
    "url": "https://www.cryptopolitan.com/silk-road-founder-marks-10-years-in-prison/",
    "description": "Ross Ulbricht, the founder of the now-defunct online black market Silk Road, marked a significant milestone &#8211; a full decade spent in prison. The 2013 sentencing by United States authorities handed him a double life sentence, along with an additional forty years, leaving no possibility of parole. In a recent message on a social platform, ... <a title=\"Silk Road Founder  Marks 10 Years in Prison Amidst Calls for Clemency\" class=\"read-more\" href=\"https://www.cryptopolitan.com/silk-road-founder-marks-10-years-in-prison/\" aria-label=\"More on Silk Road Founder  Marks 10 Years in Prison Amidst Calls for Clemency\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-02T20:24:08.000Z",
    "title": "CFTC Chair Highlights Crypto Enforcement Actions and Calls for Legislative Update",
    "url": "https://www.cryptopolitan.com/cftc-chair-on-crypto-legislative-update/",
    "description": "The Chairman of the United States Commodity Futures Trading Commission (CFTC), Rostin Behnam, delivered a keynote address at the Financial Industry Association Expo 2023 event in Chicago, shedding light on the agency&#8217;s substantial involvement in the crypto space. Behnam also emphasized the urgent need for updated legislation to accommodate the evolving financial landscape. In his ... <a title=\"CFTC Chair Highlights Crypto Enforcement Actions and Calls for Legislative Update\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cftc-chair-on-crypto-legislative-update/\" aria-label=\"More on CFTC Chair Highlights Crypto Enforcement Actions and Calls for Legislative Update\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-02T20:22:52.000Z",
    "title": "IMF drops major framework to tackle crypto risks – what you need to know",
    "url": "https://www.cryptopolitan.com/imf-drops-major-framework-to-tackle-crypto-risks/",
    "description": "In a move seen as critical for understanding the systemic implications of cryptocurrencies, the International Monetary Fund (IMF) has published a comprehensive paper. Titled &#8220;Assessing Macrofinancial Risks from Crypto Assets,&#8221; the document offers a structured framework. Aimed at policymakers and regulatory authorities, it is designed to assess and manage the potential risks emanating from the ... <a title=\"IMF drops major framework to tackle crypto risks – what you need to know\" class=\"read-more\" href=\"https://www.cryptopolitan.com/imf-drops-major-framework-to-tackle-crypto-risks/\" aria-label=\"More on IMF drops major framework to tackle crypto risks – what you need to know\">Read more</a>"
  }
]