[
  {
    "source": "Bitcoin.com",
    "date": "2023-11-24T04:30:39.000Z",
    "title": "Court Upholds Detention of Ex-FTX CEO Sam Bankman-Fried, Deeming Release Arguments ‘Unpersuasive’",
    "url": "https://news.bitcoin.com/court-upholds-detention-of-ex-ftx-ceo-sam-bankman-fried-deeming-release-arguments-unpersuasive/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/sbf6789-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/sbf6789-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/sbf6789-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/sbf6789-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/sbf6789-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/sbf6789-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/sbf6789-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/sbf6789.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />As Sam Bankman-Fried&#8217;s legal representatives gear up to appeal the ex-FTX chief&#8217;s recent verdict, they have requested the court for his provisional release from the Metropolitan Detention Center in Brooklyn, New York. Upon examination of Bankman-Fried’s claims, a clerk from the court of appeals deemed them &#8220;unpersuasive.&#8221; Bankman-Fried’s Attempt at Release Has Been Denied by [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-24T04:38:28.000Z",
    "title": "TokenFi Revolutionizes Crypto with No-Code Token Creation on Ethereum Goerli",
    "url": "https://www.cryptopolitan.com/tokenfi-revolutionizes-crypto-no-code-token/",
    "description": "TokenFi, a subsidiary of the well-known Floki Inu project, has recently made headlines in the cryptocurrency world with its groundbreaking service that simplifies the process of token creation. The innovative approach, which requires no coding skills, is set to transform the landscape of digital asset tokenization, making it more accessible to a wider audience. The ... <a title=\"TokenFi Revolutionizes Crypto with No-Code Token Creation on Ethereum Goerli\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tokenfi-revolutionizes-crypto-no-code-token/\" aria-label=\"More on TokenFi Revolutionizes Crypto with No-Code Token Creation on Ethereum Goerli\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-24T04:23:14.000Z",
    "title": "Jim Cramer comments on Bitcoin worry investors – What’s going on?!",
    "url": "https://www.cryptopolitan.com/jim-cramer-comments-on-btc-worry-investors/",
    "description": "If you have been in the trading space, whether crypto or stocks, then you know who Jim Cramer is. The market commentator almost never gets anything wrong. His mode of approach? He says what he does not mean. Traders always know to do the opposite of what Jim Cramer advices. Are we together up to ... <a title=\"Jim Cramer comments on Bitcoin worry investors &#8211; What&#8217;s going on?!\" class=\"read-more\" href=\"https://www.cryptopolitan.com/jim-cramer-comments-on-btc-worry-investors/\" aria-label=\"More on Jim Cramer comments on Bitcoin worry investors &#8211; What&#8217;s going on?!\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-24T04:24:52.000Z",
    "title": "UNI Price Prediction – After 25% Rally Uniswap Turned Attractive On Dips",
    "url": "https://www.newsbtc.com/analysis/uni/uni-price-prediction-uniswap-attractive-5-55/",
    "description": "UNI price rallied over 25% and climbed above $6.20. Uniswap is now consolidating gains and any dips might be attractive to the bulls in the near term. UNI started a fresh increase above the $5.20 and $6.00 resistance levels. The price is trading above $5.80 and the 100 simple moving average (4 hours). There was a break above a key declining channel with resistance near $5.25 on the 4-hour chart of the UNI/USD pair (data source from Kraken). The pair might correct lower, but the bulls could be active near the $5.60 and $5.55 levels. UNI Price Regains Strength After forming a support base above $4.80, UNI started a fresh surge. The bulls were able to push Uniswap’s price above the $5.25 and $5.30 resistance levels, outperforming Bitcoin and Ethereum. There was a break above a key declining channel with resistance near $5.25 on the 4-hour chart of the UNI/USD pair. The pair pumped over 25% and even climbed above $6.20. A new multi-week high was formed near $6.60 and the price is correcting lower. There was a move below the $6.25 level. Uniswap is now approaching the 23.6% Fib retracement level of the upward move from the $4.83 low to the $6.60 high. UNI is still trading above $5.80 and the 100 simple moving average (4 hours). If there is a fresh increase, the price might face resistance near the $6.40 level. The next key resistance is near the $6.60 level. A close above the $6.60 level could open the doors for more gains in the near term. Source: UNIUSD on TradingView.com The next key resistance could be near $6.88, above which the bulls are likely to aim a test of the $7.00 level. Any more gains might send UNI toward $7.20. Dips Supported in Uniswap? If UNI price fails to climb above $6.40 or $6.60, it could correct further lower. The first major support is near the $6.05 level. The next major support is near the $5.70 level. The mains support is near $5.55 or the 61.8% Fib retracement level of the upward move from the $4.83 low to the $6.60 high. A downside break below the $5.55 support might open the doors for a push toward $5.00. Technical Indicators 4-Hours MACD – The MACD for UNI/USD is losing momentum in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for UNI/USD is well above the 50 level. Major Support Levels – $6.05, $5.70 and $5.55. Major Resistance Levels – $6.40, $6.60 and $7.00."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-24T04:11:11.000Z",
    "title": "Ethereum Price Forms Bullish Pattern, Why ETH Could Extend Its Rally",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-bullish-pattern-2080/",
    "description": "Ethereum price surged above $2,050. ETH is now consolidating gains and might soon aim for another rally toward the $2,150 level. Ethereum is consolidating and facing resistance near the $2,080 zone. The price is trading above $2,030 and the 100-hourly Simple Moving Average. There is a short-term contracting triangle forming with resistance near $2,080 on the hourly chart of ETH/USD (data feed via Kraken). The pair could extend its rally if it clears the $2,080 and $2,090 resistance levels. Ethereum Price Holds Ground Ethereum price started a strong increase above the $2,000 resistance zone. ETH outperformed Bitcoin yesterday with a move above the $2,050 resistance zone. However, the bulls faced hurdles near the $2,080 and $2,090 levels. A high was formed near $2,092 and the price is now consolidating gains. There was a small correction below the $2,060 level. The price dipped below the 23.6% Fib retracement level of the upward wave from the $1,930 swing low to the $2,092 high. Ethereum is still well above $2,030 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $2,080 zone. There is also a short-term contracting triangle forming with resistance near $2,080 on the hourly chart of ETH/USD. Source: ETHUSD on TradingView.com The first key resistance is near the $2,090 level. A clear move above the $2,090 level could send the price toward the $2,150 resistance zone. The next resistance is near $2,200, above which the price could aim for a move toward the $2,250 level. Any more gains could start a wave toward the $2,320 level. Another Drop in ETH? If Ethereum fails to clear the $2,080 resistance, it could start a fresh decline. Initial support on the downside is near the $2,055 level and the triangle trend line. The next key support is $2,010 or the 50% Fib retracement level of the upward wave from the $1,930 swing low to the $2,092 high. The key support is now at $1,975. A downside break below the $1,975 support might trigger more losses. In the stated case, Ether could drop toward the $1,930 support zone in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $2,055 Major Resistance Level – $2,080"
  }
]