[
  {
    "source": "Decrypt",
    "date": "2023-10-10T19:02:08.000Z",
    "title": "'We Do Not Speak Your Language': Fashion Brands Signal Crypto Divide in Milan",
    "url": "https://decrypt.co/200896/we-do-not-speak-your-language-fashion-brands-signal-crypto-divide-milan",
    "description": "Milan Fashion Week included prominent examples of fashion giants embracing emerging tech, but also hesitance from some brands."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-10T18:41:46.000Z",
    "title": "$ADA: Lace Wallet 1.6 Unveils Enhanced Multi-Staking Features and User Experience Upgrades",
    "url": "https://www.cryptoglobe.com/latest/2023/10/ada-lace-wallet-1-6-unveils-enhanced-multi-staking-features-and-user-experience-upgrades/",
    "description": "Introduction Back in April 2023, Input Output Global (IOG), the company primarily responsible for Cardano’s research and development, launched Lace 1.0. This light wallet platform for the Cardano mainnet offered users a range of features, such as seamless transactions of various Cardano digital assets like $ADA, NFTs, and native tokens. Users could also stake $ADA, […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-10T19:05:16.000Z",
    "title": "Binance’s $1 billion cryptocurrency recovery fund only spent around $30 million",
    "url": "https://www.cryptopolitan.com/binances-1-billion-cryptocurrency-recovery-fund-only-spent-around-30-million/",
    "description": "Binance announced the launch of its Market Recovery Initiative (IRI) following the collapse of the FTX exchange and pledged to invest $1 billion to help struggling cryptocurrency projects with liquidity problems. However, new information suggests that the program needs to catch up to its projected deployment, with less than $30 million used to date, as ... <a title=\"Binance&#8217;s $1 billion cryptocurrency recovery fund only spent around $30 million\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binances-1-billion-cryptocurrency-recovery-fund-only-spent-around-30-million/\" aria-label=\"More on Binance&#8217;s $1 billion cryptocurrency recovery fund only spent around $30 million\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-10T19:00:28.000Z",
    "title": "Tether Continues To Flow Into Exchanges: Why This Is Bullish For Bitcoin",
    "url": "https://www.newsbtc.com/stablecoin/tether-flow-exchanges-why-bullish-bitcoin/",
    "description": "Tether (USDT) has continued to move into exchanges recently. Here&#8217;s why this can be a positive development for Bitcoin. Tether Supply On Exchanges Is Now Highest In 7 Months According to data from the on-chain analytics firm Santiment, $9.99 billion worth of USDT is now on exchanges. The indicator of relevance here is the &#8220;supply on exchanges,&#8221; which keeps track of the total amount of a cryptocurrency being stored in all centralized exchanges&#8217; wallets. The interpretation of this metric can differ depending on the type of asset that&#8217;s being discussed. In the case of Bitcoin, for example, the exchange reserve may be considered a measure of the potential selling pressure, as one of the reasons investors may deposit the coin is for selling-related purposes. Related Reading: $29,700 Could Be The Next Big Level To Claim For Bitcoin, Here’s Why Thus, the cryptocurrency&#8217;s supply on exchanges going up could be a sign that selling is increasing in the sector, and hence, the asset&#8217;s price may be heading towards a bearish outcome. In the context of the current discussion, BTC&#8217;s supply on exchanges isn&#8217;t the one of interest, but rather the metric for Tether is. USDT is a popular stablecoin (the largest one based on market cap) that always has its value pegged to the US Dollar. Here is a chart that shows the trend in the supply of exchanges for Tether over the past few years: Looks like the value of the metric has been going up in recent days &#124; Source: Santiment on X Usually, an investor may want to hold their capital as a stablecoin like USDT to keep it away from the volatility associated with other assets in the cryptocurrency sector. However, many such stablecoin holders use these assets as a temporary safe haven, as they eventually wish to return to the volatile market. When these investors finally find the time to jump back into cryptocurrencies like Bitcoin, they swap their USDT for them. These traders may use exchanges to make this shift, so a rise in the supply on exchanges of the stablecoin can be a sign that investors are looking to swap into volatile coins. Such buying using Tether can naturally cause a bullish effect on the prices of BTC and others. So, in this way, the exchange supply of the stablecoin can be considered the opposite of the metric for BTC. Related Reading: Bitcoin Makes Another Attempt At $28,000, Can Break Happen? The above graph shows that the indicator&#8217;s value has increased in the last few weeks. &#8220;The $9.99B worth of Tether sitting on exchanges is the highest level of buying power for crypto&#8217;s top stablecoin in approximately seven months,&#8221; notes Santiment. It should be kept in mind that the rise in the Tether supply on exchanges only implies an increase in the available dry powder. Whether Bitcoin would benefit from a boost depends on whether this dry powder is used to buy the asset or not. BTC Price Bitcoin has declined in the past couple of days as the asset now trades around the $27,600 level. BTC has recovered a bit from its lows from yesterday &#124; Source: BTCUSD on TradingView Featured image from DrawKit Illustrations on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-10T18:45:04.000Z",
    "title": "$7,000,000,000 in Illicit or High-Risk Funds Laundered Through Cross-Chain Protocols: Crypto Analytics Firm",
    "url": "https://dailyhodl.com/2023/10/10/7000000000-in-illicit-or-high-risk-funds-laundered-through-cross-chain-protocols-crypto-analytics-firm/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/hackers-phishing-beeple.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/hackers-phishing-beeple.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/hackers-phishing-beeple.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/hackers-phishing-beeple.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/hackers-phishing-beeple.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/hackers-phishing-beeple.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/hackers-phishing-beeple.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Blockchain research firm Elliptic says the amount of funds laundered through cross-chain and cross-asset services reached a ten-figure sum in July this year. In a new press release, Elliptic says that cross-chain crime is exceeding expectations after hitting the $7 billion level a couple of months ago, higher than the previously projected $6.5 billion figure [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/10/7000000000-in-illicit-or-high-risk-funds-laundered-through-cross-chain-protocols-crypto-analytics-firm/\">$7,000,000,000 in Illicit or High-Risk Funds Laundered Through Cross-Chain Protocols: Crypto Analytics Firm</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-10T18:41:13.000Z",
    "title": "Crypto Exchange Binance To List New Low-Cap Altcoin Project Built on Cosmos (ATOM)",
    "url": "https://dailyhodl.com/2023/10/10/crypto-exchange-binance-to-list-new-low-cap-altcoin-project-built-on-cosmos-atom/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/binance-nft-superstar-ronaldo.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/binance-nft-superstar-ronaldo.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/binance-nft-superstar-ronaldo.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/binance-nft-superstar-ronaldo.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/binance-nft-superstar-ronaldo.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/binance-nft-superstar-ronaldo.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/binance-nft-superstar-ronaldo.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The world&#8217;s largest crypto exchange by trading volume, Binance, is announcing plans to list a new altcoin built within the interoperable blockchain ecosystem Cosmos (ATOM). According to a new announcement, Binance is planning to list Neutron (NTRN), a project that aims to be a  &#8220;cross-chain smart-contracting platform.&#8221; As stated by Binance, &#8220;Neutron allows developers to easily [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/10/crypto-exchange-binance-to-list-new-low-cap-altcoin-project-built-on-cosmos-atom/\">Crypto Exchange Binance To List New Low-Cap Altcoin Project Built on Cosmos (ATOM)</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]