[
  {
    "source": "CoinDesk",
    "date": "2023-06-05T05:46:27.000Z",
    "title": "Atomic Wallet Users Hacked for $35M Worth of Bitcoin, Ether, Tether and Other Tokens",
    "url": "https://www.coindesk.com/tech/2023/06/05/atomic-wallet-users-hacked-for-35m-worth-of-bitcoin-ether-tether-and-other-tokens/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Atomic Wallet said Monday that “less than 1%” of its monthly active users were impacted in the weekend breach."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-05T05:48:33.000Z",
    "title": "Crypto lobbyists still fighting to axe 'unlawful' Tornado Cash sanctions",
    "url": "https://cointelegraph.com/news/blockchain-association-remove-tornado-cash-sanctions",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/8c4b4f98-5de2-46a5-a8d7-db7e635db3e6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The crypto industry advocacy group has placed its support behind Coin Center and its lawsuit against the U.S. Treasury over its Tornado Cash sanctions.</p>\n                    <p><p>The Blockchain Association and the DeFi Education Fund have become the latest industry advocates to file their support of Coin Center’s lawsuit against the United States Treasury over its “unlawful” <a href=\"https://cointelegraph.com/news/decentralization-meant-sanctions-couldn-t-pull-the-plug-on-tornado-cash-chainalysis\">sanctions aga Tornado Cash</a>.</p><p>On June 2, the two cryptocurrency industry advocacy groups filed a joint amicus <a href=\"https://theblockchainassociation.org/wp-content/uploads/2023/06/42-1.pdf\" target=\"_blank\" rel=\"noopener nofollow\">brief</a> in support of Coin Center, arguing that the U.S. sanctions against the crypto mixer Tornado Cash should be dropped.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ Today, my colleagues and I at <a href=\"https://twitter.com/BlockchainAssn?ref_src=twsrc%5Etfw\">@BlockchainAssn</a> and our partners at <a href=\"https://twitter.com/fund_defi?ref_src=twsrc%5Etfw\">@fund_defi</a> filed an amicus brief in support of <a href=\"https://twitter.com/coincenter?ref_src=twsrc%5Etfw\">@coincenter</a>&#39;s lawsuit against OFAC fighting against sanctions of the Tornado Cash software protocol.<br><br><a href=\"https://t.co/mSZW7nVDOb\">https://t.co/mSZW7nVDOb</a> <a href=\"https://t.co/Y4CxjJtBrq\">pic.twitter.com/Y4CxjJtBrq</a></p>&mdash; Marisa Tashman Coppel (@MTCoppel) <a href=\"https://twitter.com/MTCoppel/status/1664667432731004937?ref_src=twsrc%5Etfw\">June 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>They called the sanctions imposed by the Treasury’s Office of Foreign Assets Control (OFAC) “both unprecedented and unlawful,” and added:</p><blockquote>“OFAC’s sanctions are unlawful. OFAC lacks statutory authority to sanction software like Tornado Cash, and regardless, its decision lacks any factual predicate that could render the sanctions lawful.”</blockquote><p>The associations argued Tornado Cash is software and while OFAC has the legal authority to sanction people or property, it cannot sanction a decentralized protocol.</p><p>“The core Tornado Cash software is not and cannot be owned by anyone,” they argued and claimed OFAC “conjured” up a “person” so it had a basis to sanction the crypto mixer.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">5/ By sanctioning the Tornado Cash software protocol, OFAC infringes on the right to free speech and due process. <br><br>Americans who wish to engage in anonymous speech or association can no longer do so. <br><br>Nor did they have notice when they were blocked from accessing their assets.</p>&mdash; Marisa Tashman Coppel (@MTCoppel) <a href=\"https://twitter.com/MTCoppel/status/1664667438875549697?ref_src=twsrc%5Etfw\">June 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The brief admitted there was malicious use of the protocol for money laundering, mostly by <a href=\"https://cointelegraph.com/news/north-korea-and-criminals-are-using-defi-services-for-money-laundering-us-treasury\">North Korean-affiliated hackers</a>, but also pointed to the other less nefarious uses — namely to enhance privacy on the publicly viewable Ethereum blockchain.</p><p>The groups argued the sanctions should be declared unlawful and the enforcement of them should be legally prohibited by the courts.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/tornado-cash-governance-control-set-to-be-restored-as-token-votes-approve-proposal\"><strong><em>Tornado Cash governance control set to be restored as voters approve proposal</em></strong></a></p><p>In April, the two groups <a href=\"https://cointelegraph.com/news/blockchain-association-files-brief-in-tornado-cash-case\">similarly filed an amicus brief</a> in support of a nearly identical lawsuit brought by six individuals against the Treasury Department over its Tornado Cash sanctions.</p><p>The lawsuit, filed in September is <a href=\"https://cointelegraph.com/news/crypto-investors-backed-by-coinbase-sue-u-s-department-of-treasury-after-tornado-cash-sanctions\">backed by</a> the crypto exchange Coinbase who is similarly <a href=\"https://cointelegraph.com/news/coinbase-supports-new-court-action-to-remove-tornado-cash-ban\">wanting to remove the ban</a> on the mixer.</p><p>The Treasury, however, claimed such crypto mixers are a <a href=\"https://cointelegraph.com/news/us-treasury-sanctions-usdc-and-eth-addresses-connected-to-tornado-cash\">national security threat</a> and Tornado Cash repeatedly failed to create controls to stop money laundering.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/3-4-billion-bitcoin-popcorn-tin-silk-road-hacker/\"><strong><em>$3.4B of Bitcoin in a popcorn tin — The Silk Road hacker’s story</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-05T05:41:10.000Z",
    "title": "Google searches for ‘crypto’ fall to 2020 levels as BTC sentiment neutral",
    "url": "https://cointelegraph.com/news/google-search-crypto-fall-btc-sentiment-neutral",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/ef8a8ae4-7e1f-4b00-bff4-09e8ca7ea46f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>With a score of 17 out of 100, online interest in crypto has taken a big hit from its highest levels reached in May 2021.</p>\n                    <p><p>A two-month-long lull in cryptocurrency optimism has seen online search interest for “crypto” and other common cryptocurrency terms stumble down to late 2020 levels.</p><p>According to data from Google Trends, the term “crypto” currently has a score of 17, which is well off its reference point of 100 in May 2021. Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC)</a> and Ethereum have followed a similar downward trajectory. </p><p>However, search interest for these terms has been in a relatively consistent decline since May 2022, about a month after much of the Terra Luna ecosystem collapsed. A small spike in interest came in early November when the crypto exchange <a href=\"https://cointelegraph.com/news/ftx-bankruptcy-filing-speculates-over-1-million-creditors\">FTX collapsed.</a></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/7e476ec1-79f3-4389-9e2b-270406c995d0.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Search interest over time for the word \"crypto\" Source: Google Trends</em></figcaption></figure><p>The fall in interest comes as Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC)</a> has held steady around $28,000 for 10 weeks now — something which Galaxy Digital CEO <a href=\"https://cointelegraph.com/news/crypto-markets-flat-as-institutional-buying-slows-mike-novogratz\">Mike Novogratz recently described</a> as “lackadaisical,” due to a lack of “institutional excitement right now.”</p><p>Guy Turner, commonly known as “Coin Bureau Guy” suggested in a June 4 Twitter post that the fall in interest also coincides with <a href=\"https://cointelegraph.com/news/october-sees-owest-ever-daily-trading-volume-for-crypto-products-report\">lower trading volumes</a> on exchanges, which he claims to have reached a 32-month low last month: </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">&quot;Crypto&quot; search trends are at the lowest point they have been since December 2020. <br><br>This also corresponds to exchange volumes which were at 32 month lows this past May. <br><br>Apathy? <a href=\"https://t.co/UPOmhNGeDN\">pic.twitter.com/UPOmhNGeDN</a></p>&mdash; Coin Bureau (@coinbureau) <a href=\"https://twitter.com/coinbureau/status/1665327527420624898?ref_src=twsrc%5Etfw\">June 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><a href=\"https://alternative.me/crypto/fear-and-greed-index/\" target=\"_blank\" rel=\"noopener nofollow\">Alternative’s</a> Crypto Fear &amp; Greed Index tells a similar story too, with market sentiment hovering around its current score of 53 — in the “Neutral” zone — for nearly a month now.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/172dd8ed-cd90-41fc-ae47-3f00a8a26b07.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Fear &amp; Greed Index measuring changes in sentiment in the crypto market. Source: Alternative.me</em></figcaption></figure><p>Interest hasn’t dipped in every domain of crypto though.</p><p>Search volumes for “decentralized finance” and “defi” have managed to increase in 2023, while searches for “memecoin” reached a peak in early May.</p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/institutions-extremely-interested-in-crypto-etfs-but-buying-has-cooled-survey\"><strong>Institutions ‘extremely interested’ in crypto ETFs, but buying has cooled: Survey</strong></a></p><p>Nigeria currently holds the highest score for most crypto-related searches, while many of the lowest scores come from South American countries. </p><p>On the other hand, search interest for <a href=\"https://cointelegraph.com/news/ai-google-search-trend-all-time-high-bitcoin-peak\">artificial intelligence continues to skyrocket,</a> which many believe is the latest “tech fad.”</p><p><strong>Magazine: </strong><a href=\"https://cointelegraph.com/magazine/crypto-winter-can-take-toll-hodlers-mental-health/\"><strong>Crypto winter can take a toll on hodlers’ mental health</strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-05T06:04:53.000Z",
    "title": "Dusk Network rebrands to Dusk - Regulated and Decentralized Finance",
    "url": "https://cryptodaily.co.uk/2023/06/dusk-network-rebrands-to-dusk-regulated-and-decentralized-finance",
    "description": "<p>Rebranding marks the start of a new era with a focus on pilots and onboarding partners.</p>\n<p>Amsterdam-based fintech Dusk Network rebrands itself as Dusk. The company has matured over the last 5 years, and after focusing on research and development, it is now time to begin disclosing pilots and partnerships, and ramp up business adoption. The old brand was more associated with technological pioneering, while the new visual branding of Dusk has been designed to appeal to the financial industry without reneging the blockchain foundation.</p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\">After 5 years of research and development, Dusk Network rebrands into &lsquo;Dusk&rsquo;</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">Dusk shifts focus to pilots and onboarding partners</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">A more business-oriented approach and international expansion plans for adoption</li>\n</ul>\n<p>Dusk was created in 2018 with the ambition to use blockchain technology for financial empowerment and economic inclusion. The vision was to create a &lsquo;network&rsquo; - hence the name - where institutions would create instruments inexpensively, and users would harvest them directly. Neither vision nor ambition have changed, but it takes a lot of commitment and a mature legislative framework. In the past years, the focus was on research and development; how to provide the technology to realize all this? Groundbreaking research and codes were one of the results, with the launch of a first testnet in 2022.&nbsp;</p>\n<p></p>\nRegulated and Decentralized Finance\n<p>By dropping &lsquo;Network&rsquo; from the name, and adding the tagline &lsquo;Regulated and Decentralized Finance&rsquo;, the brand represents both its ambition and vision in a clearer way. The transition into a more mature company blends in seamlessly with three key pillars when it comes to realizing their ambitions; bringing real-world assets to people's wallets, compliance, and privacy. These three pillars underscore everything Dusk has been building and is the driving force behind all decisions made.&nbsp;</p>\n<p>These pillars are key for everyone to have access to real-world financial instruments and to exert complete control over that which they own. Without compliance, mass adoption remains a fantasy. This is why Dusk is such a strong proponent of Regulated Decentralized Finance (RegDeFi). Without compliance with well-made regulations, crypto can never leave the crypto sandbox.&nbsp;</p>\n\n<p>&ldquo;Dusk Network was founded in 2018 and in that time we&rsquo;ve worked tirelessly to create the technology to unite the worlds of crypto and real-world assets and to bring financial freedom and inclusion to everyone. With the rebranding of Dusk, it feels like we&rsquo;re entering a new era, moving forward as a scale-up and can finally trial our tech stack with the onboarding of pilots. Besides that, we focus on new partnerships and business development&rdquo;. - says Emanuele Francioni, founder &amp; CEO at Dusk.&nbsp;</p>\n\nOnboarding partnerships and embarking pilots\n<p>During an exclusive network and relationship dinner, a sneak peek of the new brand was revealed. It was part of an engaging moment of connection with partners, prospects and game-changers in the industry. During the event, Emanuele Francioni, founder and CEO of Dusk elaborated on recent business developments. Dusk made a strategic investment in the London-based startup OutDID, as part of the development of self-sovereign identity and to tie in with its own KYC products, Citadel and Shelter. All these will contribute to smarter use of and access to data, tying back to the three main pillars of Dusk. A partnership with NPEX, the licensed MTF exchange, to participate in the European Union Distributed Ledger Technology Regime (DLTR). Together with a top-tier financial institution, the aim is to make the first MTF for asset tokenization under this exemption. Also new upcoming partnerships with Mavryk (tokenized real estate), Cosimo X (already an investor), and IPwe (intellectual property-backed debt instruments) were mentioned.&nbsp; The new brand identity accelerates the more mature direction of the company, with a cadence of business development announcements coming up in the next months.&nbsp;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-05T06:00:14.000Z",
    "title": "Etherscan Launches Advanced Filter for Enhanced Ethereum Blockchain Exploration",
    "url": "https://news.bitcoin.com/etherscan-launches-advanced-filter-for-enhanced-ethereum-blockchain-exploration/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddf-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Etherscan Launches Advanced Filter for Enhanced Ethereum Blockchain Exploration\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddf-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddf-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddf-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddf-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddf-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddf-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddf.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On June 2, 2023, the Ethereum blockchain explorer and insights web portal, Etherscan, released a new feature that allows users to refine their transaction searches with filters. Onchain sleuths, researchers, and investigators can now narrow down the results in a single view using a variety of new filters. Etherscan Introduces Advanced Filtering Tool Users can [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-05T06:06:42.000Z",
    "title": "Piercing the Veil: TMS Network (TMSN)’s Potential Puts Cardano (ADA) and Aave (AAVE) to Shame",
    "url": "https://www.cryptopolitan.com/piercing-the-veil-tms-network-tmsns-potential-puts-cardano-ada-and-aave-aave-to-shame/",
    "description": "Are Cardano (ADA) and Aave (AAVE) falling short in the face of TMS Network&#8217;s (TMSN) groundbreaking advancements in its 4th presale phase? As the crypto market continues to evolve, TMSN shows great transformative potential and the ability to disrupt the status quo. Let’s look into the rise of TMS Network (TMSN), its innovative features, and ... <a title=\"Piercing the Veil: TMS Network (TMSN)&#8217;s Potential Puts Cardano (ADA) and Aave (AAVE) to Shame\" class=\"read-more\" href=\"https://www.cryptopolitan.com/piercing-the-veil-tms-network-tmsns-potential-puts-cardano-ada-and-aave-aave-to-shame/\" aria-label=\"More on Piercing the Veil: TMS Network (TMSN)&#8217;s Potential Puts Cardano (ADA) and Aave (AAVE) to Shame\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-05T06:01:32.000Z",
    "title": "Regulatory Storm Clears Path for Binance’s Future: Meet CEO Zhao’s Heir Apparent",
    "url": "https://www.cryptopolitan.com/regulatory-storm-binance-zhaos-heir-apparent/",
    "description": "Binance, the world&#8217;s leading cryptocurrency exchange, has been hit with a series of setbacks as regulatory scrutiny intensifies. Amidst these challenges, Richard Teng, a former civil servant-turned-crypto executive, has emerged as the frontrunner to assume the role of CEO if Changpeng &#8220;CZ&#8221; Zhao steps down. This article delves into the current state of affairs at ... <a title=\"Regulatory Storm Clears Path for Binance&#8217;s Future: Meet CEO Zhao&#8217;s Heir Apparent\" class=\"read-more\" href=\"https://www.cryptopolitan.com/regulatory-storm-binance-zhaos-heir-apparent/\" aria-label=\"More on Regulatory Storm Clears Path for Binance&#8217;s Future: Meet CEO Zhao&#8217;s Heir Apparent\">Read more</a>"
  }
]