[
  {
    "source": "NewsBTC",
    "date": "2023-06-23T03:00:34.000Z",
    "title": "Algorand Delivers Lightning-Fast Transaction Finality With Major Protocol Upgrade",
    "url": "https://www.newsbtc.com/algorand/algorand-delivers-lightning-fast-transaction-finality-with-major-protocol-upgrade/",
    "description": "Algorand (ALGO), the next-generation blockchain platform, has announced a major protocol upgrade that unleashes key new features for streamlining application development.  The protocol upgrade, now live on Mainnet, reduces block time to roughly 3.3 seconds while maintaining instant transaction finality. This represents a more than 10 percent increase in speed and reinforces Algorand&#8217;s position as a leading blockchain platform. Related Reading: Shiba Inu Becomes 14th Largest Cryptocurrency As Bull Rally Heats Up Algorand’s Latest Protocol Upgrade Sets New Standards Algorand&#8217;s ability to instantly finalize transactions and other performance enhancements empowers Algorand-based applications to deliver a user experience comparable to traditional Web2 applications while leveraging the security and decentralization inherent in blockchain technology.  The latest technical release incorporates valuable feedback from the developer community to ensure application development is faster, more accessible, and more cost-efficient. Some of the latest products and enhancements available to builders on Algorand include Simulate, a powerful simulator for smart contracts that allows developers to rigorously test, identify, and rectify any issues before deploying to Mainnet.  Simulate also enables highly versatile reading of blockchain data, offering developers a clear and customizable view of the blockchain.  The latest features for developers include group resource sharing for application calls, devmode timestamp control for testing Decentralized Applications (dApps), and new Algod endpoints for transaction group state updates. Conduit is another tool for flexible and lightweight data access. This technology enables developers to run their data solutions, accessing their specific data needs in a simple, flexible, and affordable manner.  With these new capabilities, builders can get higher quality dApps to market faster through customized data sets and faster and more efficient testing. In a statement, Paul Riegle, Chief Product Officer at Algorand, claimed: We are hyper-focused on Algorand providing the best tech for developers to engage with and end-users to experience. Through these new capabilities, builders can get higher quality dApps to market faster through customized data sets and faster and more efficient testing. Overall, the major protocol upgrade from Algorand represents an important step forward for the blockchain platform, offering faster transaction finality and key new features for streamlined application development.  With these new capabilities, Algorand is well-positioned to continue leading the way in the blockchain space and providing developers with the tools they need to build the next generation of decentralized applications. Algorand Upgrade Sparks Bull Run Hopes For ALGO According to the crypto investor and trader Zach Humphries, Layer 1 blockchains fiercely compete to attract developers and users to their ecosystems. Algorand has emerged as a strong contender with its latest protocol upgrade.  This upgrade has significantly improved the platform&#8217;s speed and efficiency, making it an attractive option for developers seeking a blockchain platform that can handle high traffic volumes. Compared to Ethereum, which dominates the market, Algorand&#8217;s speed and transaction costs are significantly better. Ethereum has been plagued by network congestion and high transaction fees, making it difficult for users and developers to take full advantage of the platform.  Algorand&#8217;s new protocol upgrade addresses these issues by reducing block time and making transactions faster and cheaper, thus providing a better user experience. Related Reading: Expert Analysis: IMF Documents And XC Platform Raise Concerns For XRP The positive news surrounding Algorand&#8217;s protocol upgrade has also had a bullish impact on the price of its native token, ALGO. While the token has experienced a significant downturn since reaching its annual high of $0.29858 in February, it has surged by 16% in the last seven days, reaching a current trading price of $0.12670. Despite the recent gains, ALGO still faces a resistance wall at $0.1520, which it needs to breach to continue its upward trend. If the token can overcome this resistance line, it could reach the $0.1751 and $0.20 price levels, which were lost during its downtrend. Featured image from Unsplash, chart from TradingView.com "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-23T02:52:43.000Z",
    "title": "Bitcoin Price Rally Pauses But Not Likely Over – Dips Turn Attractive",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-rally-pauses-30800/",
    "description": "Bitcoin price rallied toward $30,800 before the bears appeared. BTC is now correcting gains but dips could be attractive near the $28,800 zone. Bitcoin is currently correcting gains from the $30,800 zone. The price is trading above $29,500 and the 100 hourly Simple moving average. There was a break below a connecting bullish trend line with support near $30,050 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could correct lower but the bulls might be active near the $28,800 zone. Bitcoin Price Rally Fades Bitcoin price gained bullish momentum above the $29,500 resistance zone. BTC even broke the $30,000 resistance to move into a positive zone. However, it failed to extend its rally toward the $31,200 resistance. A high is formed near $30,794 and the price is now correcting lower. There was a move below the $30,250 level. The price traded below the 23.6% Fib retracement level of the upward move from the $28,661 swing low to the $30,794 high. Besides, there was a break below a connecting bullish trend line with support near $30,050 on the hourly chart of the BTC/USD pair. Bitcoin price is still trading above $29,500 and the 100 hourly Simple moving average. If the price remains stable above the $29,500 level, it could soon start a fresh increase. On the upside, the price is facing resistance near the $30,250 level. The next major resistance is near the $30,480 level. The main resistance is now forming near the $30,800 level. Source: BTCUSD on TradingView.com An upside break above the $30,800 resistance could start a fresh increase toward the $31,200 level. The next major resistance is near the $31,500 level, above which the price could rise toward the $32,000 resistance zone. Are Dips Limited in BTC? If Bitcoin’s price fails to clear the $30,480 resistance, it could continue to move down. Immediate support on the downside is near the $29,500 level. If there is a break below the $29,500 support, the price could see an extended downside correction. The next major support is near the $28,800 level or the 50% Fib retracement level of the upward move from the $28,661 swing low to the $30,794 high. Any more losses might send the price toward $28,200 in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is near the 50 level. Major Support Levels – $29,500, followed by $28,800. Major Resistance Levels – $30,250, $30,480, and $30,800."
  }
]