[
  {
    "source": "Decrypt",
    "date": "2024-04-01T21:05:35.000Z",
    "title": "Coinbase Ethereum Scaler Base Is Booming—And It's All Meme Coins, Of Course",
    "url": "https://decrypt.co/224341/coinbase-ethereum-scaler-base-booming-meme-coins",
    "description": "It's not just Solana: Meme coin traders are flocking to Ethereum scaling network Base, too, which is seeing surging activity as a result."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-04-01T20:47:46.000Z",
    "title": "Coinbase CFO believe Ethereum is unlikely to be classified as a security",
    "url": "https://cryptoslate.com/coinbase-cfo-believe-ethereum-is-unlikely-to-be-classified-as-a-security/",
    "description": "<p>Coinbase CFO Alesia Haas believes that &#8220;Ethereum (ETH) is not a security,&#8221; and regulators are unlikely to label it as such. Haas shared her view on the matter during an interview with Fortune and pointed to the fact that both the SEC and the CFTC have said the same thing in the past. The Coinbase [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/coinbase-cfo-believe-ethereum-is-unlikely-to-be-classified-as-a-security/\">Coinbase CFO believe Ethereum is unlikely to be classified as a security</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-01T21:08:08.000Z",
    "title": "Telegram Revolutionizes Monetization with Toncoin for Ad Purchases",
    "url": "https://www.cryptopolitan.com/telegram-enhances-toncoin-for-ad-purchases/",
    "description": "This weekend is marked by significant news about Telegram – the integration of Toncoin as a payment method. Now, advertisers will be able to use it to buy in-platform ads. This new step in the Telegram monetization strategy is part of its aspiration to create a comfortable environment for users and pay content creators for [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-01T21:03:23.000Z",
    "title": "Australia’s crypto sector set for a significant growth",
    "url": "https://www.cryptopolitan.com/australias-crypto-sector-significant-growth/",
    "description": "The cryptocurrency industry in Australia is currently at a very delicate point where regulators and lawmakers need to make decisions that will improve the sector. Kraken Australia CEO Jonathan Miller shared insights into this, among other things in the crypto market. Kraken Australia CEO shares insights into the crypto market Speaking at a recent interview, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-01T20:50:12.000Z",
    "title": "Prisma Finance hacker demands apology before returning stolen funds",
    "url": "https://www.cryptopolitan.com/prisma-finance-hacker-apology-stolen-funds/",
    "description": "Prisma Finance, a prominent player in the decentralized finance (DeFi) space, is currently navigating the aftermath of an $11.6 million exploit that occurred last week. This incident has left $540,000 in funds from certain accounts yet to revoke the smart contract responsible for the exploit. Prisma Finance hacker gives conditions to return funds Adding to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-01T20:49:58.000Z",
    "title": "Ripple CTO Dismisses Proposal to Donate Escrowed XRP Tokens",
    "url": "https://www.cryptopolitan.com/ripple-cto-dismisses-proposal-to-donate/",
    "description": "Regarding a decision made by Ripple executives on their Escrowed XRP token donation to the XRP Ledger Foundation (XRPL), the CTO, David Schwartz, criticized the infeasible effects of such a move. The plan was drawn with the consideration of Panos Mekras, the co-founder of Anodos Finance, who suggested the XRPLF may possess a better position [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-01T21:00:12.000Z",
    "title": "Bitcoin Halving Inches Closer With Less Than 2,900 Blocks Left",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-halving-2900-blocks/",
    "description": "The Bitcoin Halving is fast approaching, with less than 2,900 blocks left before miners’ rewards are cut in half. This event, projected to take place sometime in April, is significant as Bitcoin’s price could enjoy a parabolic move to the upside after it takes place.  Bitcoin Halving Set For April 19 Data from Coinwarz shows that the Bitcoin Halving is set to take place on April 19 at Block 840,000. This projection is based on Bitcoin’s current block time average, which means the Halving can come a little earlier or sometime after April 19. However, the main focus remains that miners’ supply will be cut in half.  Related Reading: Dogecoin Price Breaks New 3-Year High – Here Are Factors That Could Drive The Price To $1 The Halving event is a deflationary measure that Bitcoin’s founder, Satoshi Nakamoto, encoded in the flagship crypto and takes place after every 210,000 blocks. Three halving events have occurred since the Genesis block in 2009, when Bitcoin’s first block was mined. The first was on November 28, 2012, when miners’ rewards were cut from 50 BTC to 25 BTC. The next Halving event took place on July 9, 2016, cutting miners’ rewards to 12.5 BTC. The third one happened on May 11, 2020, reducing the reward to 6.25 BTC. Now, Miners’ rewards are set to be cut in half again, reducing them to 3.125 BTC. This reward is the amount of BTC miners receive for validating each block of new transactions on the blockchain. Although this event mainly affects miners, the crypto community closely monitors it due to the ripple effects it could have on the market. Bitcoin’s supply comes through these miners’ rewards, and a reduction in them usually drives Bitcoin’s value higher.  Bitcoin’s Performance After Each Halving The Halving has historically always led to a price appreciation for Bitcoin. Ninety days after the first Halving on November 28, 2012, Bitcoin’s price increased to $1,000 from $12 at the time of Halving. Subsequently, Bitcoin’s price saw a gain of over 8,000% one year after that Halving.  Source: MilkRoad This parabolic price surge also occurred after the second and third Halving events, with Bitcoin’s price rising from $650 and $8,821 (at the time of the Halving) to $2,506 and $56,612 (90 days after the Halving) in 2016 and 2020 respectively. Bitcoin also gained 284% and 559% one year after the event.  Related Reading: Panel Of Experts Reveal When The Cardano Price Will Reach $3 This time isn’t expected to be different as Bitcoin is again predicted to experience a massive move to the upside after April. This bullish sentiment is further strengthened by Bitcoin’s demand, which has continued to skyrocket in the face of a dwindling supply.  At the time of writing, Bitcoin is trading at around $70,400, up in the last 24 hours according to data from CoinMarketCap.  BTC price struggles ahead of halving &#124; Source: BTCUSD on Tradingview.com Featured image from 99Bitcoins, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-04-01T20:47:16.000Z",
    "title": "Analyzing Shiba Inu’s 2021 Bull Run Pattern: Is History Set to Repeat?",
    "url": "https://www.crypto-news-flash.com/analyzing-shiba-inus-2021-bull-run-pattern-is-history-set-to-repeat/?utm_source=rss&utm_medium=rss&utm_campaign=analyzing-shiba-inus-2021-bull-run-pattern-is-history-set-to-repeat",
    "description": "<img width=\"1200\" height=\"731\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Shiba-inu-wd.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Shiba-inu-wd.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Shiba-inu-wd-300x183.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Shiba-inu-wd-768x468.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Shiba-inu-wd-150x91.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/Shiba-inu-wd-450x274.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Renowned analysts like &#8216;Rekt Capital&#8217; and Xanrox suggest that Shiba Inu (SHIB) might replicate its remarkable 2021 bull run. March 2024 witnessed a remarkable surge in SHIB burn rate, with 15.64 billion tokens incinerated, marking a 2330% increase from the previous month. In March 2024, Shiba Inu surged above the $0.00004 threshold, marking a significant [...]"
  }
]