[
  {
    "source": "CoinDesk",
    "date": "2023-10-04T19:20:11.000Z",
    "title": "Poor Week for Ether Prompts Research Firm to Reverse Outlook, Advise Favoring Bitcoin Instead",
    "url": "https://www.coindesk.com/markets/2023/10/04/poor-week-for-ether-prompts-research-firm-to-reverse-outlook-advise-favoring-bitcoin-instead/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Ether's price dropped to its lowest price compared to bitcoin since July 2022 as the launch of futures-based ETH ETFs attracted meager interest from investors."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-04T19:14:21.000Z",
    "title": "Alameda Was ‘Business as Usual’ Before Collapse: Ex-Engineer",
    "url": "https://www.coindesk.com/business/2023/10/04/alameda-was-business-as-usual-before-collapse-ex-engineer/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Security and risk checks were “poor” at the company, but the implosion of the trading firm came as a surprise to insiders."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-04T19:25:13.000Z",
    "title": "Latest update — Former FTX CEO Sam Bankman-Fried trial [Day 2]",
    "url": "https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-updates",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/8c987bc0-629b-4bdf-bdc1-a38e679df2f9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The former FTX CEO faces seven counts of conspiracy and fraud. A New York court will decide his fate.</p>\n                    <p><p>Cointelegraph reporters are on the ground in New York for the trial of former FTX CEO Sam “SBF” Bankman-Fried. As the saga unfolds, check below for the latest updates.</p><h3>Oct. 4: DOJ and Bankman-Fried's defense state their arguments</h3><p>The first hours of Sam Bankman-Fried trial have offered a glimpse of the arguments the Department of Justice (DOJ) and his defense will bring to court in the coming weeks.</p><p>After a jury selection in the morning, both parties gave opening statements to the 12-person jury present in the court.</p><p>The DOJ took a tough stance against Bankman-Fried in its first statement, portraying the FTX founder as someone who deliberately lied to investors to enrich himself and expand his crypto empire.</p><p>According to the DOJ, Bankman-Fried lied to FTX customers and investors, using Alameda as a key partner to “steal customers' funds,” a phrase that was frequently used during the opening statements.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/1004794e-c2f7-4865-9c1b-39a97e4c06f2.jpg\"  /><figcaption style=\"text-align: center;\"><em>A sign outside Sam Bankman-Fried's trial location in New York. Source: Ana Paula Pereira/Cointelegraph</em></figcaption></figure><p>As per the trial preview, the DOJ will focus its arguments on allegations that Bankman-Fried misled customers, investors, and lenders regarding the safety of their funds while using Alameda to steal their money and influence politicians in Washington.</p><p>The defense, meanwhile, brought arguments about Bankman-Fried being a young entrepreneur who made business decisions that “didn’t work out.” The defense denied the existence of secret transactions between Alameda and FTX, or a backdoor used to steal customer funds. According to the previous arguments presented, all transactions were legitimate or made in good faith by Bankman-Fried during the crypto market downturn and the subsequent collapse of FTX in November 2022.</p><p>The defense also highlighted the role of Binance in the bank run that led to FTX’s collapse. Testimonies will continue throughout the day.</p><p>According to the defense, Bankman-Fried assumed FTX was allowed to loan funds to Alameda as part of a business relationship with the market maker, and there was no secret door for transactions between the companies.</p><p>Prosecutors also noted that Caroline Ellison, Gary Wang, and Nishad Singh will offer the jury insider details about Bankman-Fried’s role in FTX’s operations and alleged crimes. However, the defense pointed out that as part of the cooperation agreement with the government, they were supposed to give testimony against Bankman-Fried, raising doubts about their credibility.</p><p>The defense also downplayed the accusations against the nature of the relationship between FTX and Alameda, arguing that FTX margin traders were aware of the risks associated with transactions.</p><p>“There was no theft,” the defense claimed. “It's not a crime to be the CEO of a company that files for bankruptcy.”</p><h3>Oct. 3: SBF trial begins</h3><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/2a41313e-7417-40e7-99d5-fb2eee7cb785.jpg\"  /><figcaption style=\"text-align: center;\"><em>Bankman-Fried’s trial will take place in a Manhattan federal court. Source: Ana Paula Pereira/Cointelegraph</em></figcaption></figure><p>The trial of Sam Bankman-Fried began on Oct. 3 with jury selection. Bankman-Fried is charged with seven counts of conspiracy and fraud in connection with the collapse of FTX, the cryptocurrency exchange he co-founded. He <a href=\"https://cointelegraph.com/news/ftx-s-sam-bankman-fried-pleads-not-guilty-to-fraud-charges-report\">has pleaded not guilty</a> to all charges. The case is being heard by Judge Lewis Kaplan, who has presided over a long list of other high-profile cases, including ones involving detainees at Guantanamo Bay, the Gambino crime family, Prince Andrew and Donald Trump.</p><p>Bankman-Fried <a href=\"https://cointelegraph.com/news/judge-orders-sam-bankman-fried-bail-revoked-following-allegations-witness-intimidation\">was ordered to be jailed</a> on Aug. 11 after Kaplan found that his sharing of former Alameda Research CEO Caroline Ellison’s personal papers amounted to witness intimidation. Alameda Research was a trading house also founded by Bankman-Fried. Previously, he had <a href=\"https://cointelegraph.com/news/sbf-sent-home-after-his-parents-put-up-their-house-to-cover-his-astronomical-bail-bond\">been under house arrest</a> in his parents’ home in Stanford, California on a $250-million bond.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/gB1zBrqHPLw\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><h3>December: SBF arrested</h3><p>Bankman-Fried was arrested in the United States on his arrival from the Bahamas on Dec. 21, 2022. He had <a href=\"https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-arrested-and-in-custody-attorney-general\">been arrested in the Bahamas</a> on Dec. 12 after the U.S. government formally notified the country of charges the U.S. was filing against him. He declared his intention to fight extradition from the Caribbean nation but changed his mind after a week in Bahaman jail and <a href=\"https://cointelegraph.com/news/sam-bankman-fried-seeks-to-reverse-decision-on-contesting-extradition-report\">consented to extradition</a>.</p><p>Meanwhile, FTX co-founder Gary Wang and Alameda Research CEO (and reportedly sometime SBF girlfriend) Ellison <a href=\"https://cointelegraph.com/news/caroline-ellison-gary-wang-plead-guilty-to-fraud-charges\">agreed to plead guilty</a> in the burgeoning case.</p><h3>November: FTX collapses</h3><p>Bankman-Fried’s troubles began when reports emerged on Nov. 2 that Alameda Research had a large holding of FTX Token (<a href=\"https://cointelegraph.com/ftx-token-ftt-price-index\">FTT</a>), FTX’s utility token. That revelation led to questions about the relationship between the two entities. On Nov. 6, Changpeng Zhao, CEO of rival exchange Binance, announced that his exchange <a href=\"https://cointelegraph.com/news/binance-to-liquidate-its-entire-ftx-token-holdings-after-recent-revelations\">would liquidate its FTT</a> holdings, which were estimated to be worth $2.1 billion. Zhao turned down an offer tweeted by Ellison to buy Binance’s FTT.</p><p>A run <a href=\"https://cointelegraph.com/news/ftx-addresses-user-withdrawal-complaints-amid-major-token-movement\">began on FTX</a>. Bankman-Fried gave reassurances on Twitter (now X) that the exchange’s “assets are fine” and accused “a competitor” of spreading rumors. By Nov. 8, the price of FTT had <a href=\"https://cointelegraph.com/news/ftx-token-price-risks-30-plunge-as-a-23m-ftt-part-moves-to-binance\">fallen from $22</a> to $15.40.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">It’s only been one week since SBF’s notorious “FTX is fine. Assets are fine.” <a href=\"https://t.co/zKoILqquHF\">pic.twitter.com/zKoILqquHF</a></p>&mdash; Robert Smith (@BondHack) <a href=\"https://twitter.com/BondHack/status/1592250606747799552?ref_src=twsrc%5Etfw\">November 14, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Also on Nov. 8, Bankman-Fried announced on Twitter that he had <a href=\"https://cointelegraph.com/news/binance-ceo-announces-intent-to-acquire-ftx-to-help-cover-the-liquidity-crunch\">come to an agreement</a> with Zhao “on a strategic transaction.” He wrote, “Our teams are working on clearing out the withdrawal backlog as is. This will clear out liquidity crunches; all assets will be covered 1:1.”</p><p>On Nov. 9, Zhao announced that Binance <a href=\"https://cointelegraph.com/news/ftx-s-binance-rescue-deal-falls-apart-in-less-than-48-hours\">would not pursue the acquisition of FTX</a> after due diligence and more reports of mishandled funds. The price of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) <a href=\"https://cointelegraph.com/news/bitcoin-price-hits-multi-year-low-at-15-6k-analysts-expect-further-downside\">plummeted to $15,600</a>. The FTX and Alameda Research <a href=\"https://cointelegraph.com/news/alameda-s-research-and-ftx-ventures-websites-taken-down\">websites went dark</a> for a few hours. When the FTX website came back, it bore a warning against making deposits and was unable to process withdrawals.</p><p>On Nov. 10, Bankman-Fried <a href=\"https://cointelegraph.com/news/sam-bankman-fried-apologizes-over-ftx-liquidity-crisis-i-fucked-up-twice\">posted a 22-part Twitter thread</a> that began with “I’m sorry.” It was the first of a long string of public statements he made about the exchange’s fall. The following day, the entire staff of Alameda Research quit, and FTX, FTX US and Alameda Research <a href=\"https://cointelegraph.com/news/ftx-ftx-us-and-alameda-file-for-chapter-11-bankruptcy-in-us-sbf-resigns\">filed for bankruptcy in the United States</a>. Bankman-Fried resigned as FTX CEO and was replaced by John J. Ray III, who was best known for his role in the Enron bankruptcy.</p><h3>SBF and FTX before the fall</h3><p>At the beginning of 2022, FTX <a href=\"https://cointelegraph.com/news/ftx-exchange-breaks-32b-valuation-despite-crypto-winter-fears\">had a $32-billion valuation</a> and <a href=\"https://cointelegraph.com/news/ftx-revenue-reportedly-grew-1000-in-one-year-leaked-documents-reveal\">was thought to be in enviable financial condition</a>. Bankman-Fried was seen as a respected business leader by much of the crypto community and the world at large. He was photographed with political leaders and <a href=\"https://www.agriculture.senate.gov/imo/media/doc/Testimony_Bankman-Fried_0209202211.pdf\" target=\"_blank\" rel=\"noopener nofollow\">spoke</a> at congressional <a href=\"https://docs.house.gov/meetings/AG/AG00/20220512/114729/HHRG-117-AG00-Wstate-Bankman-FriedS-20220512.pdf\" target=\"_blank\" rel=\"noopener nofollow\">hearings</a>. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Maxine Waters is chairing the investigation into FTX <a href=\"https://t.co/oFMctH4rRh\">https://t.co/oFMctH4rRh</a> <a href=\"https://t.co/Ox6O5w4nOl\">pic.twitter.com/Ox6O5w4nOl</a></p>&mdash; Jordan Schachtel @ dossier.today (@JordanSchachtel) <a href=\"https://twitter.com/JordanSchachtel/status/1593289220755525632?ref_src=twsrc%5Etfw\">November 17, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>He had <a href=\"https://cointelegraph.com/magazine/sam-bankman-fried-the-crypto-whale-who-wants-to-give-billions-away/\">gained a reputation as a philanthropist</a>, pursuing a philosophy popular among academics known as “effective altruism.” Part of his implementation of that philosophy <a href=\"https://cointelegraph.com/news/sam-bankman-fried-could-spend-up-to-1b-in-2024-to-thwart-trump-comeback\">was political activism</a> in the form of financial support for candidates.</p><p>As the crypto winter set in, Bankman-Fried <a href=\"https://cointelegraph.com/news/sbf-and-alameda-step-in-to-prevent-crypto-collapse-contagion\">spoke of FTX and Alameda Research’s</a> “responsibility to seriously consider stepping in, even if it is at a loss to ourselves, to stem contagion.” The companies made a bid for Voyager Digital <a href=\"https://cointelegraph.com/news/voyager-rejects-alameda-buyout-offer-as-it-harms-customers\">that was rebuffed</a>.</p><p>FTX <a href=\"https://cointelegraph.com/news/ftx-and-visa-partner-to-permit-crypto-payments-in-40-countries\">made a deal with Visa</a> to introduce its own debit card in 40 countries.</p><p>Bankman-Fried, Ellison and other alumni of Jane Street Capital founded Alameda Research in 2017. Bankman-Fried went on to found FTX with Wang in 2019. Zhao was an early investor in the exchange.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-04T19:13:41.000Z",
    "title": "Google Assistant will soon incorporate Bard AI chat service",
    "url": "https://cointelegraph.com/news/google-assistant-soon-incorporate-bard-ai-chat-service",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/b93710d1-574a-45e6-b326-8d9d4c95f649.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Google announced that its browser-based AI program, Bard, will be used by Google Assistant devices soon.</p>\n                    <p><p>Google Assistant will begin incorporating Google’s artificial intelligence (AI) chat service, Bard, into its responses “soon,” according to an October 4 social media post from the development team.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Coming soon: <a href=\"https://twitter.com/hashtag/AssistantWithBard?src=hash&ref_src=twsrc%5Etfw\">#AssistantWithBard</a><br><br>We can’t wait to show you our vision to deliver the world’s most helpful personal assistant.<br><br>In the meantime, give Bard a try at <a href=\"https://t.co/5qtyBeWvge\">https://t.co/5qtyBeWvge</a>.<a href=\"https://twitter.com/hashtag/MadeByGoogle?src=hash&ref_src=twsrc%5Etfw\">#MadeByGoogle</a> <a href=\"https://twitter.com/hashtag/Pixel?src=hash&ref_src=twsrc%5Etfw\">#Pixel</a> <a href=\"https://t.co/GK55yY7qSP\">pic.twitter.com/GK55yY7qSP</a></p>— Made by Google (@madebygoogle) <a href=\"https://twitter.com/madebygoogle/status/1709583273943544249?ref_src=twsrc%5Etfw\">October 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Google Assistant is AI software used in Google Home devices such as the Nest Mini or Nest Hub. It’s also available on Android phones and tablets. Bard, on the other hand, is Google’s browser-based AI chat program that attempts to compete with OpenAI’s ChatGPT. </p><p>Bard is a newer AI program, and it can do many things that Google Assistant can't. For example, it can generate a cover letter for a resume, create computer code, write an essay, answer complex questions about history or math, and perform many other sophisticated actions based on user prompts. By contrast, Google Assistant can only give answers to very simple questions.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/explained/what-is-googles-bard-and-how-does-it-work\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/what-is-googles-bard-and-how-does-it-work/amp\"><strong>What is Google’s Bard, and how does it work?</strong></a></em></p><p>On the same day it made the announcement on social media, Google gave a presentation at its public event, Made by Google, describing the new upgrade. According to a report from ZDNet, Google said that Bard Assistant could <a href=\"https://www.zdnet.com/article/google-assistant-is-finally-getting-the-ai-upgrades-it-deserves-heres-whats-new/\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://www-zdnet-com.cdn.ampproject.org/c/s/www.zdnet.com/google-amp/article/google-assistant-is-finally-getting-the-ai-upgrades-it-deserves-heres-whats-new/\">access</a> a user’s email if given permission, allowing it to sort through the user’s email account and report on its contents. It will also be able to plan a vacation for the user, write documents using Google Docs, and compose SMS text messages.</p><p>The assistant will be able to accept images as input as well. For example, a user can upload an image and ask Google Bard Assistant to create a caption for it. Google did not give an exact date when it will be released but claimed that it's currently being tested.</p><p>Google has been aggressively releasing AI improvements to compete with OpenAI and Microsoft. It released Google Bard on May 10 in select countries. On July 14, it <a href=\"https://cointelegraph.com/news/google-s-bard-overcomes-eu-hurdles-expands-territories-and-capabilities\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/google-s-bard-overcomes-eu-hurdles-expands-territories-and-capabilities/amp\">expanded Bard access to EU member states</a>, despite the EU’s strict regulations on AI. Despite these accomplishments, Bard still has some kinks to work out, as Cointelegraph discovered in June that it <a href=\"https://cointelegraph.com/magazine/ai-travel-booking-bad-3-weird-uses-chatgpt-crypto-plugins/\">sometimes recommends hotels that don’t exist</a>.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-04T19:00:00.000Z",
    "title": "PayPal applies for NFT marketplace patent, Meta’s avatars impress: Nifty Newsletter",
    "url": "https://cointelegraph.com/news/nft-paypal-meta-artist-charity-metaverse-newsletter",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/45baf6b4-c254-49df-87a4-3c35806d75e2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>PayPal filed a patent application for a system that lets users transfer and purchase nonfungible tokens.</p>\n                    <p><p>In this week’s newsletter, read about how a <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible token (NFT)</a> artist raised money to support a cancer charity and why payments platform PayPal has filed a patent application for an NFT marketplace. Check out Meta’s new photorealistic metaverse avatars and, in other news, learn why Neal Stephenson’s metaverse blockchain project remains optimistic despite waning interest.</p><h2>NFT artist raises $140,000 for cancer support charity</h2><p>NFT artist Trevor Jones donated almost $140,000 to Maggie’s Edinburgh — an organization dedicated to cancer treatments — after raising funds from a Web3 event in France. The amount raised from the event will help 4,000 patients affected by cancer and those who need critical support. </p><p>According to Maggie’s Edinburgh, the funds raised by Jones will be the highest single donation from an art event in the organization’s history. The money collected will support services for cancer patients and their families.</p><p><a href=\"https://cointelegraph.com/news/nft-artist-cancer-support-140-k-charity\"><strong>Continue reading</strong></a></p><h2>PayPal applies for NFT marketplace patent for on- or off-chain asset trading</h2><p>Payment platform PayPal filed a patent application for an NFT transfer and purchase system. The patent application was filed at the United States Patent and Trademark Office in March and was made available publicly in September. </p><p>The patent described a system that lets users buy and sell NFTs through a service provider. While the provider was not mentioned, the document did mention Ethereum, suggesting that it may be based in the network. </p><p><a href=\"https://cointelegraph.com/news/paypal-nft-marketplace-patent-asset-trading\"><strong>Continue reading</strong></a></p><h2>The metaverse is real: Zuck’s “incredible” photorealistic tech wows Crypto Twitter</h2><p>As critics continue to declare the metaverse dead, Meta CEO Mark Zuckerberg showcased the company’s developments in the space in a podcast using photorealistic avatars in the metaverse. </p><p>Using Meta’s Quest 3 headsets and noise-canceling headphones, Zuckerberg and podcast host Lex Fridman engaged in an hour-long interview using metaverse avatars. The improvements got the attention of Crypto Twitter, with some comparing previous iterations of Zuckerberg’s metaverse with the present one, saying the “metaverse has upgraded.”</p><p><a href=\"https://cointelegraph.com/news/metaverse-podcast-lex-fridman-mark-zuckerberg-avatars-meta-codec\"><strong>Continue reading</strong></a></p><h2>Neal Stephenson’s blockchain project holds discovery month as metaverse hype wanes</h2><p>Metaverse blockchain project Lamina1 is holding an event called the Open Metaverse Discovery Month to let builders and creators experience the metaverse. The company believes that despite the lower interest in the metaverse, the concept will live as long as people are willing to spend time and money on it. </p><p>According to Lamina1 CEO Rebecca Barkin, the project was able to attract 50,000 builders despite the crypto winter and people writing eulogies for the metaverse. The executive remains optimistic that its founder, Neal Stephenson’s vision of the metaverse will challenge corporate greed and give more autonomy to creators. </p><p><a href=\"https://cointelegraph.com/news/metaverse-neal-stephenson-blockchain-project-discovery-month\"><strong>Continue reading</strong></a></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-01/43adc850-7dbd-4fa8-811b-9eb32b6c1983.jpg\"  alt=\"\"  title=\"PayPal applies for NFT marketplace patent, Meta&rsquo;s avatars impress: Nifty Newsletter\"  /></figure><p class=\"post-content__accent post-content__accent_big\"><a href=\"https://cointelegraph.com/podcasts/nft-steez\">CHECK OUT COINTELEGRAPH’S <em>NFT STEEZ</em> PODCAST</a></p><p><em>Thanks for reading this digest of the week’s most notable developments in the NFT space. Come again next Wednesday for more reports and insights into this actively evolving space.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-04T18:45:00.000Z",
    "title": "Hong Kong Stock Exchange launches settlement platform powered by smart contracts",
    "url": "https://cointelegraph.com/news/hong-kong-stock-exchange-launches-settlement-platform-powered-smart-contracts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/19dbac50-9e94-4137-9d6b-7518319448f2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Dubbed \"Synapse,\" the platform will accelerate trades placed by international investors for Mainland Chinese stocks. </p>\n                    <p><p>Hong Kong Exchanges and Clearing Limited (HKEX), the operator of The Stock Exchange of Hong Kong, Hong Kong Futures Exchange, and London Metal Exchange, is launching a novel equities settlement acceleration platform. Dubbed \"Synapse,\" the platform will utilize smart contracts in the DAML programming language to streamline post-trade flows and enhance operational efficiencies, according to the October 4 <a href=\"https://mondovisione.com/media-and-resources/news/hkex-launches-synapse-a-settlement-acceleration-platform-for-stock-connect/\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>. </p><p>Synapse will be deployed on Stock Connect, an HKEX channel that enables international investors to access more than 1,000 Mainland Chinese stocks through routing in Hong Kong. \"Average daily turnover of Northbound Stock Connect totalled RMB109.3 billion in the first half of 2023, up 5 per cent from a year earlier, and a 50 per cent increase from 2020 levels,\" developers wrote.</p><p>HKEX will be linked to Hong Kong's Depository Trust & Clearing Corporation (DTCC) through its Institutional Trade Processing (ITP) service, allowing for the central matching of cross-border transactions. Settlement instructions are then automatically generated and sent back to the Synapse platform, thus enhancing the trade confirmation workflow.</p><p>Under the silent nod of China's central government, Hong Kong has been rapidly transforming itself as a hub for Web3 firms with the launch of retail trading for licensed crypto exchanges in August. However, the largest Ponzi scheme in Hong Kong's history also occurred during this time, with an estimated $166 million worth of users' funds<a href=\"https://cointelegraph.com/magazine/jpex-staff-flee-token2049-scandal-mt-gox-decade-delay-dcs-singapore-asia-express/\"> embezzled by the JPEX crypto exchange</a>. The investigation is ongoing. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/china-dev-fined-salary-vpn-10m-ecny-airdrop-asia-express/\">China dev fined 3 yrs’ salary for VPN use, 10M e-CNY airdrop</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-04T19:30:34.000Z",
    "title": "Crypto Tycoon SBF in the Dock: Jury Selection Extended; Hearing Reveals Financial Carnage ",
    "url": "https://news.bitcoin.com/crypto-tycoon-sbf-in-the-dock-jury-selection-extended-hearing-reveals-financial-carnage/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/paint-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Crypto Tycoon SBF in the Dock: Jury Selection Extended; Hearing Reveals Financial Carnage\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/paint-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/paint-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/paint-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/paint-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/paint-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/paint-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/paint.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Sam Bankman-Fried (SBF), the disgraced co-founder of the now insolvent cryptocurrency exchange FTX, concluded his first day of trial involving jury selection and voir dire questioning. The process extended into Wednesday as U.S. District Judge Lewis Kaplan eliminated several potential jurors on Tuesday. Trial of FTX Co-Founder SBF Unveils Juror Crypto Losses on Day One [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-04T18:46:07.000Z",
    "title": "EU Central Banks to Announce Wholesale CBDC Plans in Weeks",
    "url": "https://www.cryptopolitan.com/eu-central-banks-to-announce-wholesale-cbdc/",
    "description": "The European Union (EU) is set to unveil its plans for a wholesale Central Bank Digital Currency (CBDC) within the next few weeks, according to François Villeroy de Galhau, the governor of France&#8217;s central bank. This initiative is aimed at modernizing how financial institutions settle securities and foreign exchange transactions, offering a glimpse into the ... <a title=\"EU Central Banks to Announce Wholesale CBDC Plans in Weeks\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eu-central-banks-to-announce-wholesale-cbdc/\" aria-label=\"More on EU Central Banks to Announce Wholesale CBDC Plans in Weeks\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-04T19:19:42.000Z",
    "title": "Blackbird announces the close of a $24M Series A financing round",
    "url": "https://crypto.news/blackbird-announces-the-close-of-a-24m-series-a-financing-round/",
    "description": "Blackbird, a loyalty and membership platform built for restaurants, announced the close of a Series A financing round led by Andreessen Horowitz’s crypto arm, a16z, according to a thread posted on X."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-04T19:00:40.000Z",
    "title": "FTX’s FTT Price Skyrockets 20%: Here’s Why the Rally Has Just Begun",
    "url": "https://www.newsbtc.com/ftx/ftxs-ftt-price-skyrockets-20-heres-why-the-rally-has-just-begun/",
    "description": "The FTT price has been challenging gravity and the overall trend in the crypto market for the past two weeks. A recent report hints at a potential bullish continuation based on this scenario and to the benefit of the FTX creditors. Related Reading: FTT Up By 21% Despite FTX Claims Portal Troubles As of this writing, the FTT price trades at $1.20, with sideways movement in the last 24 hours. The token recorded a 19% profit in the previous two weeks, while the last 30 days show a 15% increase. In the meantime, major cryptocurrencies have seen half of this price action over the same period. FTT Price On The Verge Of Massive Rally? The surge in the FTT price is supported by the current negotiations between Artificial Intelligence (AI) company Anthropic and the big tech sector. As our sister website Bitcoinist reported, the company received a $1.5 billion capital injection from Amazon. The big tech giant committed to increasing their investment by up to $4 billion via Amazon Web Services (AWS). The partners will work to develop AI solutions to compete with Google, Microsoft, Nvidia, and others. The AI company received support from failed crypto exchange FTX before its collapse in 2022. In that sense, if Anthropic can secure support from other big tech companies, the initial investment made by FTX will increase, allowing the new management to count on more assets and potentially repay creditors. A recent report from the Information claims that Anthropic is exploring further partnerships following its Amazon deal. The OpenAI competitor could receive support from Google. The big tech giant already bought a 10% stake in the startup at the same time as FTX. If this deal materializes, the company could increase its valuation from $4 billion to over $20 to $30 billion. Thus, FTX’s initial investment will increase by a significant amount. The negotiations between Anthropic and its potential partners have directly impacted the FTT price. The current manager has publicly emphasized his intention to re-launch the trading venue to repay its creditors. A successful sale of their stake in Anthropic could benefit FTX’s current management and give them enough capital to succeed. If this scenario materializes, the company’s native token is bound to extend its recent run and could potentially reclaim previously lost territory. Related Reading: FTT Token Surges 17% After FTX Confirms Rumors Of Relaunch The FTT price reached an all-time high above $60, meaning it has much room to grow if the company relaunches. Any news related to Anthropic or an FTX’s relaunch will positively affect the token. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-04T19:34:35.000Z",
    "title": "Shiba Inu’s Partner, Bad Idea (AI), Achieves Top Marks in Prestigious CertiK Audit",
    "url": "https://www.crypto-news-flash.com/shiba-inus-partner-bad-idea-ai-achieves-top-marks-in-prestigious-certik-audit/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-partner-bad-idea-ai-achieves-top-marks-in-prestigious-certik-audit",
    "description": "<img width=\"1280\" height=\"711\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/shiba-7513487_1280-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/shiba-7513487_1280-1.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/shiba-7513487_1280-1-300x167.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/shiba-7513487_1280-1-1024x569.jpg 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Shiba Inu&#8217;s partner, Bad Idea (AI) got a score of 80 in security after CertiK&#8217;s comprehensive audit. It recorded between 88-94 percent in other metrics including operational resilience, community trust, market stability, and governance strength. According to the latest report, Shiba Inu&#8217;s partner, Bad Idea (AI), has gone through the prestigious security audit of blockchain [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-04T19:24:03.000Z",
    "title": "Billion-Dollar Company Wemade and Chainlink Labs Join Forces to Redefine Web3 Gaming with Exclusive CCIP Integration",
    "url": "https://www.crypto-news-flash.com/billion-dollar-company-wemade-and-chainlink-labs-join-forces-to-redefine-web3-gaming-with-exclusive-ccip-integration-2/?utm_source=rss&utm_medium=rss&utm_campaign=billion-dollar-company-wemade-and-chainlink-labs-join-forces-to-redefine-web3-gaming-with-exclusive-ccip-integration-2",
    "description": "<img width=\"1200\" height=\"630\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Chainlink\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-300x158.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-1024x538.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-768x403.jpeg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-351x185.jpeg 351w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-24x13.jpeg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-36x19.jpeg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-48x25.jpeg 48w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Chainlink Labs and Wemade partner to transform Web3 gaming with Chainlink CCIP. Wemade selects Chainlink CCIP for its omnichain initiative, backed by the COURT consortium. In a significant development, Chainlink Labs and Wemade have joined hands to pioneer transformative changes in the Web3 gaming sphere. This strategic partnership enhances interoperability, security, and connectivity in the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-04T19:17:10.000Z",
    "title": "Polkadot Teams Up with 1,8 Trillion-Dollar Bank Mizuho Bank, Startale, and Cosmize to Promote Kuma Shochu Tradition Through Astar Network’s True NFTs",
    "url": "https://www.crypto-news-flash.com/polkadot-teams-up-with-18-trillion-dollar-bank-mizuho-bank-startale-and-cosmize-to-promote-kuma-shochu-tradition-through-astar-networks-true-nfts/?utm_source=rss&utm_medium=rss&utm_campaign=polkadot-teams-up-with-18-trillion-dollar-bank-mizuho-bank-startale-and-cosmize-to-promote-kuma-shochu-tradition-through-astar-networks-true-nfts",
    "description": "<img width=\"640\" height=\"426\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polkadot launches OpenGov, an open governance platform.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/Polkadot-104x69.jpg 104w\" sizes=\"(max-width: 640px) 100vw, 640px\" />The collaboration between the Cosmize social platform, Startale Labs Japan, Mizuho Bank, and Blue Lab will promote the Kuma Shochu alcohol product via NFTs built on top of Polkadot’s Astar Network. The project intends to issue three different NFTs including Base NFTs, Parts NFTs, and the True NFTs in a bid to engage the customers [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-04T19:25:00.000Z",
    "title": "XRP Price Soars as Legal Victory Ignites Bullish Momentum",
    "url": "https://coinedition.com/xrp-price-soars-as-legal-victory-ignites-bullish-momentum/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Uppercent to Feature in XRP Gold Coast Conference in March 2024\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/XRP-to-Higher-Levels-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Following a noteworthy legal development, XRP&#8217;s price is experiencing a significant surge, a promising sign for the cryptocurrency. This rise is not random as it&#8217;s backed by the New York District Judge Analisa Torres, who recently ruled favorably against the U.S. SEC&#8217;s appeal. Consequently, this latest move is seen by many as further solidifying XRP&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrp-price-soars-as-legal-victory-ignites-bullish-momentum/\">XRP Price Soars as Legal Victory Ignites Bullish Momentum</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-04T18:47:00.000Z",
    "title": "FTX Wallet Drainer Relentless: Bridges Another 5,624 ETH to BTC",
    "url": "https://coinedition.com/ftx-wallet-drainer-relentless-bridges-another-5624-eth-to-btc/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/FTX_Accounts_Drainer_is_dumping_ETH_for_renBTC_via_a_new_wallet.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FTX_Accounts_Drainer_is_dumping_ETH_for_renBTC_via_a_new_wallet\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/FTX_Accounts_Drainer_is_dumping_ETH_for_renBTC_via_a_new_wallet.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/FTX_Accounts_Drainer_is_dumping_ETH_for_renBTC_via_a_new_wallet-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/FTX_Accounts_Drainer_is_dumping_ETH_for_renBTC_via_a_new_wallet-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/FTX_Accounts_Drainer_is_dumping_ETH_for_renBTC_via_a_new_wallet-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/FTX_Accounts_Drainer_is_dumping_ETH_for_renBTC_via_a_new_wallet-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/FTX_Accounts_Drainer_is_dumping_ETH_for_renBTC_via_a_new_wallet-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>CertiK Alert, a platform that provides real-time alerts about crypto hacks, posted on October 4 that the FTX drainer bridged another 5,624 ETH to BTC. That follows a series of notifications about the recent resurfacing of the hacker who stole a significant amount of funds from the defunct FTX exchange. The recent alert comes after [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ftx-wallet-drainer-relentless-bridges-another-5624-eth-to-btc/\">FTX Wallet Drainer Relentless: Bridges Another 5,624 ETH to BTC</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-04T18:45:06.000Z",
    "title": "Bankrupt Digital Asset Lender Celsius Plans To Repay $2,000,000,000+ in Crypto to Creditors Before End of 2023",
    "url": "https://dailyhodl.com/2023/10/04/bankrupt-digital-asset-lender-celsius-plans-to-repay-2000000000-in-crypto-to-creditors-before-end-of-2023/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/plans-to-repay-end.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/plans-to-repay-end.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/plans-to-repay-end.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/plans-to-repay-end.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/plans-to-repay-end.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/plans-to-repay-end.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/plans-to-repay-end.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Bankrupt digital asset lender Celsius Network intends to start repaying creditors using billions of dollars in crypto assets before the end of the year. In a recent US bankruptcy court filing, Celsius has presented a restructuring plan that will generate funds for a new corporate spinoff, dubbed “NewCo,” and repay customers. Says the filing, “Notably, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/04/bankrupt-digital-asset-lender-celsius-plans-to-repay-2000000000-in-crypto-to-creditors-before-end-of-2023/\">Bankrupt Digital Asset Lender Celsius Plans To Repay $2,000,000,000+ in Crypto to Creditors Before End of 2023</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-04T18:41:27.000Z",
    "title": "Prosecutors Oppose Sam Bankman-Fried’s Bid To Use US Regulatory Framework To Fight Charges As Trial Enters Day 2",
    "url": "https://dailyhodl.com/2023/10/04/prosecutors-oppose-sam-bankman-frieds-bid-to-use-us-regulatory-framework-to-fight-charges-as-trial-enters-day-2/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/Defunct-Crypto-Exchange-FTX-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/Defunct-Crypto-Exchange-FTX-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/Defunct-Crypto-Exchange-FTX-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/Defunct-Crypto-Exchange-FTX-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/Defunct-Crypto-Exchange-FTX-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/Defunct-Crypto-Exchange-FTX-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/Defunct-Crypto-Exchange-FTX-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>New documents reveal prosecutors in Sam Bankman-Fried’s fraud trial are opposing his bid to use arguments about the US regulatory framework to combat his charges. In a new court filing, the government says the former FTX chief executive should not be able to argue that he’s innocent because FTX was &#8220;not regulated in the United [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/04/prosecutors-oppose-sam-bankman-frieds-bid-to-use-us-regulatory-framework-to-fight-charges-as-trial-enters-day-2/\">Prosecutors Oppose Sam Bankman-Fried’s Bid To Use US Regulatory Framework To Fight Charges As Trial Enters Day 2</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]