[
  {
    "source": "CoinDesk",
    "date": "2023-10-04T10:44:31.000Z",
    "title": "Protocol Village: Oasis Network Introduces Synthetic Version of ROSE Token",
    "url": "https://www.coindesk.com/tech/2023/10/02/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the week of Oct. 2-8, with live updates throughout."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-04T11:00:30.000Z",
    "title": "SEC Claims Coinbase ‘Cries Foul’ in Court Filing to Oppose Case Dismissal",
    "url": "https://decrypt.co/200079/sec-claims-coinbase-cries-foul-in-court-filing-to-oppose-case-dismissal",
    "description": "The U.S. securities regulator argued that the age-old Howey Test applies to certain crypto assets, giving it full authority."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-04T10:53:27.000Z",
    "title": "BIS, EU central banks building data platform to track crypto, DeFi flows ",
    "url": "https://cointelegraph.com/news/bis-eu-central-banks-building-data-platform-to-track-crypto-defi-flows",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/fd78cb3f-3851-447c-9698-2cd866987684.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Bank of International Settlements and a handful of European Central banks are building a system to track international flows of cryptocurrencies. </p>\n                    <p><p>The Bank of International Settlements (BIS) has developed a proof of concept (PoC) for a system tracking on-chain and off-chain transactions from cryptocurrency exchanges and public blockchains including Bitcoin.</p><p>Working with the Deutsche Bundesbank, De Nederlandsche Bank, European Central Bank and the Bank of France, BIS has announced a successful PoC called Project Atlas that aims to gauge the macroeconomic relevance of cryptocurrency markets and decentralized finance (DeFi) protocols.</p><p>The BIS Innovation Hub <a href=\"https://www.bis.org/publ/othp76.pdf\" target=\"_blank\" rel=\"noopener nofollow\">published</a> details of the concept which aims to provide insights, information and economic implications of the sector, citing a lack of transparency and potential risks to financial stability characterized by high-profile failings in the crypto-space like the Terra/LUNA algorithmic stablecoin collapse in 2022.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/6e635997-4c56-4719-8ca9-e36d30481660.png\"  /><figcaption style=\"text-align: center;\">Project Atlas's first proof of concept aims to track on-chain and off-chain data from public blockchains and cryptocurrency exchanges. Source: BIS Project Atlas</figcaption></figure><p>The project combines off-chain data from cryptocurrency exchanges with on-chain data from public blockchains gathered by nodes. The first iteration of the proof of concept saw Project Atlas tracking cryptocurrency flows across geographical locations.</p><p><a href=\"https://cointelegraph.com/news/ripple-joins-bis-cross-border-payments-task-force\"><strong><em>Related: Ripple joins BIS cross-border payments task force</em></strong></a></p><p>The initial approach uses transactions attributed to centralized exchanges in the Bitcoin network, along with the location of those exchanges as a proxy for cross-border capital flows. </p><p>The methodology notes that flows are likely lower-bound estimates of actual transaction volumes, given that the country location of exchanges is not easily discernible. Nevertheless Project Atlas’ initial pilot indicates that inter-exchange are “significant and substantial economically.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/6d5fba36-9f0b-4ab1-b6c1-08b887320e0f.png\"  /><figcaption style=\"text-align: center;\">The Project Atlas dashboard show on-chain transfers on the Bitcoin network as well as cross-exchange transactions. Source: BIS Project Atlas</figcaption></figure><p>In its current iteration, Project Atlas features a front end showcasing dashboards which visualise the results of data aggregation and analysis, including on-chain transfers as well as global movement of funds.</p><p>The PoC is set to provide an overnview of cross-border flows and will provide a means for Central Banks to evaluate the relative economic significance of the cryptocurrency ecosystem across different jurisdictions:</p><blockquote>“The data will allow flows to be analyzed structurally and the influence of price shocks, financial market developments and country characteristics on crypto flows to be investigated.”</blockquote><p>The project is set to continue incorporating more data sources to move into the next phase of development, while extracting and analyzing data from Ethereum network nodes is also in the pipeline as well as DeFi protocols.</p><p><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Magazine: Blockchain detectives: Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-04T10:58:37.000Z",
    "title": "Bitcoin moves up as stock market continues downturn",
    "url": "https://cryptodaily.co.uk/2023/10/bitcoin-moves-up-as-stock-market-continues-downturn",
    "description": "With the S&P 500 down another 1.3% on Wednesday, and the Nasdaq down 1.87%, Bitcoin is looking strong at the $27,600 resistance."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-04T11:00:37.000Z",
    "title": "Will XRP Price Defy A 50% Stock Market Crash? Analysts Share Predictions",
    "url": "https://www.newsbtc.com/analysis/xrp/will-xrp-price-defy-a-50-stock-market-crash/",
    "description": "The financial world is abuzz with speculations on the resilience of cryptocurrencies amidst potential global financial upheavals and a looming recession in the United States. XRP, with its unique standing, has become the centerpiece of these discussions, following a series of comments and analyses from renowned crypto analyst Egrag Crypto. XRP Price Amid A 50% Stock Price Crash On X (formerly Twitter), Egrag took a comprehensive look at the six-month chart of the XRP price, presenting two scenarios that couldn&#8217;t be more different: a crash to $0.017 and a rally to $27. The analyst emphasized XRP&#8217;s pioneering nature due to the remarkable degree of legal clarity it offers, setting it apart from other digital assets. &#8220;The current state of XRP offers a remarkable degree of legal clarity, making it a pioneering digital asset in terms of regulatory acknowledgment,&#8221; Egrag stated. This legal acknowledgment, combined with its designed role to simplify cross-border payment solutions, strengthens the case for XRP to potentially rise to a $27 price target, Egrag claims. But his analysis wasn&#8217;t purely optimistic. He alerted followers to looming shadows in the broader financial spectrum. Related Reading: Ripple CEO’s Tattoo Predicts XRP Price Surge? Here’s When It Will Hit The Moon A significant number of technical analysts have forecasted a drastic 40%-50% downturn in global equity and stock markets. Egrag pondered the implications of such a downturn on cryptocurrencies, particularly XRP. He shared the following chart and warned of a potential sharp XRP price crash: Under such circumstances, a measured move of 0.017c becomes a pertinent consideration. I find myself somewhat perplexed by the dichotomy presented by certain technical analysts who foresee a collapse in traditional markets while advocating for crypto to adhere to its four-year cycle. He further remarked that &#8220;it&#8217;s imperative to maintain a consistent and non-contradictory thesis when assessing these scenarios,&#8221; highlighting the inconsistency of predicting both a market collapse and a steady crypto four-year cycle. Community&#8217;s Mixed Responses Feedback on Egrag&#8217;s analysis was multifaceted. @300Mill300, a prominent voice in the crypto space, extrapolated from Egrag’s initial analysis and offered a chart that was bullish for XRP. He projected a rally to $1.15 by early 2024, followed by a brief retraction to $0.79, and a subsequent bullish surge to reach $1.40 by the close of 2024. However, the sentiment wasn&#8217;t unanimously optimistic. Rainmaker, a crypto aficionado with nearly a decade&#8217;s experience, struck a cautionary note. He predicted a pronounced &#8220;wash out&#8221; preceding each Bitcoin halving event, pushing the XRP price down, possibly to the mid $0.20s. Responding to this, Egrag showcased his balanced stance. While agreeing with Rainmaker about the potential drag of macroeconomic elements on XRP, he remained bullish about XRP&#8217;s intrinsic strengths. He noted, &#8220;I think the general macro will drag it down but other than that it is solid like a rock.&#8221; Stepping into the discussion, Analyst Ata Yurt had a different take. He expressed skepticism about XRP achieving the mentioned price points, stating, &#8220;At $0.017 there would be no sellers nor buyers&#8230; At $27, there will be no buyers either apart from a small group of FOMO orders, majority will FOMO in at $3 or $5 as those are the expected levels considering previous ATH.&#8221; Yurt proposed a more pragmatic approach, suggesting a blend of technical analysis and market psychology. He believes that the $5 mark for XRP is more attainable, urging the community to consider a linear chart for assessment. Related Reading: XRP Price Historical Data Suggests Substantial Q4 Rally Possible Egrag, not one to step back from a discussion, retorted with a thought-provoking question, &#8220;Good idea but what if the equity and stock markets crashed 40-50%? Then what?&#8221; Yurt countered by estimating the potential fall of Bitcoin in such a scenario, speculating that if Bitcoin were to lag behind and drop by 60%, XRP, in relation to BTC, might settle around the $0.22-$0.25 range, a figure he deemed more realistic than the prediction of Egrag at $0.017. The Bullish Case: XRP To $27? Egrag recently took to social media, highlighting a potential roadmap for XRP&#8217;s ambitious journey to $27 through his interpretation of the &#8220;XRP ATLAS LINE&#8221;. Egrag predicts a near-term positive momentum that could push XRP into the $1.3-$1.5 zone. However, the digital currency might not stay there long, as he anticipates a dip back to the $0.55 region, a crucial breakout retest. Once this phase passes, he sees a dynamic resurgence propelling XRP to its previous highs of $2.8-$3.0. But that&#8217;s not the ceiling. Egrag envisions a more aggressive leap into the $13-$15 bracket, although he also foresees a significant sell-off around this price point. His analysis then steers back to a reconnection with earlier levels around $2.8-$3.0 before finally culminating at the coveted $27 mark. At press time, XRP traded at $0.5327. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-04T10:46:01.000Z",
    "title": "Legal Plot Twist: Lawsuit Against Terraform Labs Dismissed Voluntarily",
    "url": "https://www.crypto-news-flash.com/legal-plot-twist-lawsuit-against-terraform-labs-dismissed-voluntarily/?utm_source=rss&utm_medium=rss&utm_campaign=legal-plot-twist-lawsuit-against-terraform-labs-dismissed-voluntarily",
    "description": "<img width=\"1280\" height=\"960\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/01/law-1063249_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"law lawsuit court\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/01/law-1063249_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2021/01/law-1063249_1280-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/01/law-1063249_1280-1024x768.jpg 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />The last Class Action lawsuit against Terraform Labs and Do Kwon has been dismissed. With no more Class Actions, the embattled firm now has only regional regulators to answer to. A September 28 filing shows that the litigation brought against Terraform Labs and its co-founder Do Kwon by bereaved UST holders, led by Nick Patterson, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-04T10:47:38.000Z",
    "title": "ADA Retraces After Testing 30-Day High, Indicators Signal Reversal",
    "url": "https://coinedition.com/ada-retraces-after-testing-30-day-high-indicators-signal-reversal/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/ADA-5.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/ADA-5.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/ADA-5-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/ADA-5-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/ADA-5-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/ADA-5-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/ADA-5-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/ADA-5-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/ADA-5-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/ADA-5-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/ADA-5-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/ADA-5-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/ADA-5-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/ADA-5-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/ADA-5-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/ADA-5-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/ADA-5-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Early in the day, bullish momentum in the Cardano (ADA) market was robust, but the resistance above the intra-day high of $0.2642 proved too hard to overcome. As a result, the price fell, but it regained support above the $0.2546 level. This level indicates that there is still a lot of buying interest in ADA, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ada-retraces-after-testing-30-day-high-indicators-signal-reversal/\">ADA Retraces After Testing 30-Day High, Indicators Signal Reversal</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]