[
  {
    "source": "CoinDesk",
    "date": "2023-07-25T07:58:44.000Z",
    "title": "Dogecoin Bumps 10% on X Payments Speculation, DOGE Futures Traders Lose $10M",
    "url": "https://www.coindesk.com/markets/2023/07/25/dogecoin-bumps-10-on-x-payments-speculation-doge-futures-traders-lose-10m/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto traders are buying up DOGE in hopes of the token playing a larger role on Twitter, which rebranded as “everything app” X on Monday."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-25T08:04:41.000Z",
    "title": "How rising interest costs impact government finances",
    "url": "https://cryptoslate.com/insights/how-rising-interest-costs-impact-government-finances/",
    "description": "<p>Quick Take According to the Founder of Equity Management Associates, Lawrence Lepard, in his EMA Q2 report, the escalating interest expense, rapidly nearing a run rate of $1 trillion, is a major cause of the expanding government deficit. These factors imply that the government&#8217;s interest payments are surpassing its expenditure on national defense, according to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/how-rising-interest-costs-impact-government-finances/\">How rising interest costs impact government finances</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T08:02:23.000Z",
    "title": "Bitcoin vs Ethereum: What is the top cryptocurrency?",
    "url": "https://www.cryptopolitan.com/bitcoin-vs-ethereum/",
    "description": "Cryptocurrencies have undeniably piqued the interest of investors. Bitcoin (BTC), the first of its kind, began trading in 2009, with its value initially less than a penny. Despite some volatility, its price has steadily climbed, reaching an all-time high of $68,990 in November 2021. Ether (ETH), the native token of the Ethereum network, made its ... <a title=\"Bitcoin vs Ethereum: What is the top cryptocurrency?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-vs-ethereum/\" aria-label=\"More on Bitcoin vs Ethereum: What is the top cryptocurrency?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T07:53:53.000Z",
    "title": "Five Times Crypto Detective ZachXBT Opened Investors’ Eyes ",
    "url": "https://www.cryptopolitan.com/crypto-detective-zachxbt-opened-investors/",
    "description": "Clear, reliable information is paramount in cryptocurrency&#8217;s dynamic and often opaque world. Enter ZachXBT, a renowned crypto detective who has made a name for himself by providing crucial insights and revealing hidden truths within the crypto market.&#160; From unearthing fraudulent schemes to identifying promising opportunities, ZachXBT&#8217;s work has consistently shed light on the complex intricacies ... <a title=\"Five Times Crypto Detective ZachXBT Opened Investors&#8217; Eyes \" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-detective-zachxbt-opened-investors/\" aria-label=\"More on Five Times Crypto Detective ZachXBT Opened Investors&#8217; Eyes \">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-25T08:03:32.000Z",
    "title": "WSJ: CZ was aware of wash trading at BinanceUS",
    "url": "https://crypto.news/wsj-cz-was-aware-of-wash-trading-at-binanceus/",
    "description": "The WSJ&#8217;s investigation reveals that Binance&#8217;s CEO Changpeng Zhao was aware of wash trading at the American branch launch and &#8220;directed&#8221; it. According to a report from the Wall Street Journal, in the first hour of Binance launching its American platform,&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-25T08:05:38.000Z",
    "title": "Bitcoin Witnesses Historic Whale Exodus: What You Need To Know",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-historic-whale-exodus-what-need-to-know/",
    "description": "Bitcoin whales are witnessing a historic exodus. @CryptoVizArt, a senior researcher at Glassnode has shed light on the significant shifts within the whale cohort in a new analysis. Bitcoin Whales&#8217; Impact: Unveiling The Numbers In a remarkable revelation, the research highlights the substantial impact of whales on recent market activity. According to the data, &#8220;34% of sell pressure in the last 30 day was from Binance whales.&#8221; These influential entities have been instrumental in shaping the recent market dynamics. Moreover, the research also highlights a trend in whale behavior: a noteworthy decline in the total balance of whale entities on exchanges. In the last 30 days, the report states, &#8220;Whale Flow to Exchanges witnessed the largest monthly balance decline in history, hitting -148,000 BTC/month.&#8221; This dramatic decline marks a significant shift within the whale cohort, raising intriguing questions about their motives and strategies. Related Reading: Bitcoin Price Hits Next Bearish Target But Bears Are Not Done Yet As the market witnessed the rally above $31,000, the influx of whale funds to exchanges surged remarkably. Glassnode’s data reveals that whale inflow volumes reached an impressive +16,300 BTC/day, signifying their active involvement in recent market movements. Notably, this whale dominance accounted for 41% of all exchange inflows, which is comparable to both the LUNA crash (39%) and the failure of FTX (33%). Throughout June and July, whale inflows have sustained an elevated inflow bias of between 4,000 to 6,500 BTC/day. Among all exchanges, Binance emerged as the primary destination for whale inflows. The report discloses that around 82% of whale-to-exchange flows were heading into Binance. In contrast, Coinbase accounted for 6.8%, and all other exchanges account for 11.2%. While the overall balance of whales may have declined, @CryptoVizArt&#8217;s analysis points to intriguing internal dynamics within the whale cohort. As some whales increased their balances, others experienced declines. This phenomenon led the researcher to introduce the concept of &#8216;Whale Reshuffling,&#8217; suggesting that not all whales follow the same strategy. Related Reading: Bitcoin Exodus: Exchange Balances Plummet To Lowest Levels Since 2018 The examination of the whale cohort over the last 30 days shows that whales with more than 100,000 BTC have recorded an increase of +6,000 BTC, whales with 10k-100k BTC have decreased their account balance by -49.0k BTC and whales with 1k-10k BTC have increased their account balance by +33.8k BTC. However, in aggregate, the whale group has seen just -8.7k BTC in net outflows. Remarkably, whale entities now account for only 46% of the total supply, down from 63% at the beginning of 2021. Since the early days of Bitcoin, a steady downward trend can be observed. Short-Term Holders: The Driving Force The research also sheds light on the dominance of short-term holders (STHs) among the whale entities. The data indicates that STHs represent a significant portion of recent trading activity, actively trading the market. This behavior is evident as market rallies and corrections lead to notable upticks in profit or loss among this group. Short-Term Holder (STH) Dominance across Exchange Inflows has exploded to 82%. This is drastically above the long-term range over the last five years (typically 55% to 65%). “From this, we can establish a case that much of the recent trading activity is driven by Whales active within the 2023 market and thus classified as STHs”, states the analyst. Each rally in 2023 has seen heightened profit taking. BTC whale transactions can therefore currently be a good indicator. However, special attention also needs to be paid to the STHs, which will eventually run out of bullets at some point. At press time, the BTC price stood at $29,203. Featured image from Fernando Gutierrez / Unsplash, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T07:54:20.000Z",
    "title": "Binance, CEO Changpeng Zhao, to Defend Against CFTC Complaint – Plans to File Motion for Dismissal",
    "url": "https://www.crypto-news-flash.com/binance-ceo-changpeng-zhao-to-defend-against-cftc-complaint-plans-to-file-motion-for-dismissal/?utm_source=rss&utm_medium=rss&utm_campaign=binance-ceo-changpeng-zhao-to-defend-against-cftc-complaint-plans-to-file-motion-for-dismissal",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Mark-Van-Scyoc-CFTC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Mark-Van-Scyoc-CFTC.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Mark-Van-Scyoc-CFTC-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Mark-Van-Scyoc-CFTC-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Mark-Van-Scyoc-CFTC-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Binance and its CEO, Changpeng Zhao, are planning to file a motion to dismiss the lawsuit brought by the U.S. Commodity Futures Trading Commission (CFTC). The CFTC had alleged that Binance operated a derivatives trading operation in the U.S. and intentionally violated U.S. laws. Legal Battle Unfolds: CFTC vs. Binance and Zhao Cryptocurrency exchange giant [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-25T07:48:07.000Z",
    "title": "Bitcoin and Altcoins Report – July Week 4",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/bitcoin-and-altcoins-report-july-week-4/",
    "description": "<p>Amid regulatory uncertainty surrounding Binance and China&#8217;s economic woes, Bitcoin is in the red. Bitcoin fell below $29,000 for the first time in over a month following reports from the Wall Street Journal stating that Binance CEO, CZ, indicated in a private conversation that the crypto exchange&#8217;s affiliates had engaged in wash trading several years [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/bitcoin-and-altcoins-report-july-week-4/\">Bitcoin and Altcoins Report – July Week 4</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]