[
  {
    "source": "CoinDesk",
    "date": "2023-06-14T09:41:55.000Z",
    "title": "Fed Preview: Bitcoin Market Skews Bearish as Analysts Anticipate 'Hawkish Rate-Hike Pause'",
    "url": "https://www.coindesk.com/markets/2023/06/14/fed-preview-bitcoin-market-skewed-bearish-as-analysts-anticipate-hawkish-rate-hike-pause/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Options market shows a bias for puts, or bearish bets, tied to bitcoin ahead of the pivotal Fed meeting."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-14T09:42:23.000Z",
    "title": "Ripple Legal Chief Calls for Investigation Into Former SEC Director Hinman",
    "url": "https://decrypt.co/144543/ripple-legal-chief-calls-investigation-former-sec-director-hinman",
    "description": "Any “serious discussion” about whether a token is a security should never again refer to Hinman’s speech, argued Ripple's legal chief."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-14T09:39:58.000Z",
    "title": "AMD reveals new AI chip challenging Nvidia’s dominance",
    "url": "https://cointelegraph.com/news/amd-reveals-new-a-i-chip-challenging-nvidia-s-dominance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/7c1f330a-757a-42bd-a5d2-ce768bc15a4b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>With its CDNA architecture and 192GB memory capacity, the MI300X by AMD accommodates larger AI models. </p>\n                    <p><p>Advanced Micro Devices Inc (AMD) on Tuesday, June 13, gave new details about an artificial intelligence (AI) chip that will challenge market leader Nvidia Corp.</p><p>The California-based AMD <a href=\"https://www.youtube.com/watch?v=l3pe_qx95E0\" target=\"_blank\" rel=\"noopener nofollow\">said</a> its most-advanced graphics processing unit (GPU) for AI, the MI300X, will start trickling out in the third quarter and be followed by mass production beginning in the fourth quarter. </p><p>AMD's announcement represents the most substantial challenge to Nvidia, which <a href=\"https://cointelegraph.com/news/nvidia-ai-chip-value-skyrockets-amid-ai-development-boom\">currently dominates the market</a> for AI chips with over 80% market share. GPUs are chips used by firms like OpenAI to build cutting-edge AI programs such as ChatGPT. They have parallel processing capabilities and are optimized for handling large amounts of data simultaneously, making them well-suited for tasks that require high-speed and efficient graphical processing.</p><p>AMD announced that its latest MI300X chip and CDNA architecture was specifically developed to cater to the demands of large language models and advanced AI models. With a maximum memory capacity of 192GB, the MI300X enables the accommodation of even larger AI models compared to other chips like Nvidia's H100 chip which supports a maximum of 120GB of memory.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/f9157012-e72d-485d-8478-23f0a4b5fea1.JPG\"  /><figcaption style=\"text-align: center;\"><em>AMD Chief Executive Lisa Su speaking at an event outlining AMD AI accelerator chip in San Francisco</em></figcaption></figure><p>AMD announced the Infinity Architecture, which combines eight M1300X accelerators into a single system, mirroring similar systems by Nvidia and Google that integrate eight or more GPUs for AI applications.</p><p>During the presentation to investors and analysts in San Francisco, AMD chief executive officer, Lisa Su highlighted that AI represents the company's \"most significant and strategically important long-term growth opportunity.\"</p><blockquote>\"We think about the data center AI accelerator [market] growing from something like $30 billion this year, at over 50% compound annual growth rate, to over $150 billion in 2027,\" </blockquote><p>If developers and server manufacturers adopt AMD's \"accelerator\" AI chips as alternatives to Nvidia's products, it could open up a significant untapped market for the chipmaker. AMD, renowned for its conventional computer processors, stands to benefit from this potential shift in demand.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ai-startup-by-ex-meta-and-google-researchers-raises-113m-in-seed-funding\"><strong><em>AI startup by ex-Meta and Google researchers raises $113M in seed funding</em></strong></a></p><p>Although AMD did not reveal specific pricing details, this action could potentially exert downward price pressure on Nvidia's GPUs, including models like the H100, which can carry price tags of $30,000 or higher. Reduced GPU prices have the potential to contribute to lowering the overall expenses associated with running resource-intensive generative AI applications.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-is-ai-a-threat-why-ai-advance/\"><strong><em>Is AI a nuke-level threat? Why AI fields all advance at once, dumb pic puns</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-14T10:06:57.000Z",
    "title": "Binance CEO denies selling Bitcoin amid market manipulation allegations",
    "url": "https://cryptoslate.com/binance-ceo-denies-selling-bitcoin-amid-market-manipulation-allegations/",
    "description": "<p>Binance CEO Changpeng &#8216;CZ&#8217; Zhao denied rumors that his exchange was selling Bitcoin to protect BNB&#8217;s price, according to a June 13 tweet. CZ tweeted that &#8220;Binance have not sold BTC or BNB,&#8221; adding that the exchange still holds &#8220;a bag&#8221; of bankrupt FTX&#8217;s FTT. Zhao&#8217;s statement responded to several market analysts who alleged that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-ceo-denies-selling-bitcoin-amid-market-manipulation-allegations/\">Binance CEO denies selling Bitcoin amid market manipulation allegations</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-14T10:01:57.000Z",
    "title": "A trend that is playing out to defend the BNB $220 liquidation level",
    "url": "https://cryptoslate.com/insights/a-trend-that-is-playing-out-to-defend-the-bnb-220-liquidation-level/",
    "description": "<p>Quick Take CryptoSlate reported that if the price of the token BNB were to fall past $220, this could create a $200 million liquidation. In the past month, BNB has dropped 20%, fell as low as $224, but is now back up around $247. Reports from the Twitter account Skew suggest that a trend has [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/a-trend-that-is-playing-out-to-defend-the-bnb-220-liquidation-level/\">A trend that is playing out to defend the BNB $220 liquidation level</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-14T09:45:00.000Z",
    "title": "Puma Launches Second Digital Experience With Black Station 2",
    "url": "https://cryptodaily.co.uk/2023/06/puma-launches-second-digital-experience-with-black-station-2",
    "description": "<p>German footwear giant Puma has launched its new 3D metaverse experience titled Black Station. The experience is for everyone, but Puma pass holders will be eligible for exclusive perks.</p>\n<p>Puma has called Black Station an experimental home for product drops, which will give unrestricted access to Puma Pass NFT holders.&nbsp;</p>\nExpanding On Initial Launch&nbsp;\n<p>Black Station is Puma&rsquo;s second foray into the world of Web3, following the launch of its first Web3 project, Black Station 1. Black Station 1 was launched in September during the New York Fashion Week as part of the Futrograde fashion show. According to the firm, the latest Web3 experience from the brand can be explored by everyone. However, only users that possess RB tokens airdropped to Puma Pass holders can purchase a digital &ldquo;Rulebreaker&rdquo; sneaker and claim two digital wearables. A developer working on the program stated,&nbsp;</p>\n\n<p>&ldquo;If you do not own an RB token, there is still so much to explore. Unkai, our city in the clouds, and Unter, our exhilarating club below, both are filled with mysteries to explore and collect.&rdquo;</p>\n\n<p>RB token holders can burn the token on Black Station between the 13th and 20th of June and gain access to product drops in the metaverse. The Black Station roadmap also details several general events and NFT drops scheduled for later this year. Furthermore, events scheduled for 2024 are also in the pipeline.&nbsp;</p>\nAn Immersive Environment&nbsp;\n<p>Black Station allows users to access a highly immersive environment created in collaboration with Unreal Engine. Users can shop for limited-edition digital and physical sneakers. The second edition of Black Station builds on this, expanding into two more digital worlds, each having a unique sneaker tied to it. Head of emerging marketing tech and Web3 at Puma, Ivan Dashkov, stated,&nbsp;</p>\n\n<p>&ldquo;As we move forward into this second launch, we want to target a broader audience and let anyone come in, experience it and play with it. We&rsquo;ll iterate from there and continue to broaden our approach.&rdquo;</p>\n\n<p>Users can access the world through blackstation.puma.com and walk to a Puma elevator. From there, users can choose to go to the Unkai, inspired by Shibuya, or to Unter, inspired by Berlin&rsquo;s nightlife. Users in Unkai can float between Lego-like blocks in the sky. It also features the Super Puma mascot and giant Puma shoes. In Unter, users can experience an underground red-lit cave and follow neon green footsteps into a Puma rave room or see a giant Fast-RB Puma shoe. Additionally, there are also hidden easter eggs. Dashkov added,</p>\n\n<p>&ldquo;The two spaces are fun because they&rsquo;re so different. There are also a couple of easter eggs we&rsquo;ve hidden throughout the space related to our other NFT project, Super Puma PFP, in both the visuals and the story.&rdquo;&nbsp;</p>\n\n<p>The launch comes as other competitors such as Nike released its first ever drop on the .Swoosh Web3 community platform. The collection, called &ldquo;Our Force 1&rdquo; pays homage to the legendary Nike Air Force 1 sneakers which were launched 41 years ago.</p>\nSticking With Ethereum&nbsp;\n<p>The experience will remain open until the 23rd of June. Additionally, Puma had stated that it was also exploring the possibility of alternative chains. However, it eventually decided to stay with Ethereum. It was reported back in February 2022 that Puma had registered an Ethereum Name Service domain. It also changed its Twitter name to Puma.eth. The company had also invested in several feline-inspired NFTs such as Gutter Cat Gang, CatBlox, Lazy Lions, and Cool Cats NFT.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T10:04:22.000Z",
    "title": "Monero Price Prediction 2023-2032: Should You Buy XMR Now?",
    "url": "https://www.cryptopolitan.com/monero-price-prediction/",
    "description": "Monero Price Prediction 2023-2032 This Monero Price Prediction will cover details about Monero, applications, price history, and factors affecting the native currency. There are plenty of things to consider before moving on to the Monero (XMR) price prediction. How much is Monero worth? Today&#8217;s Monero price is $136.83 USD with a 24-hour trading volume of $70,033,433 ... <a title=\"Monero Price Prediction 2023-2032: Should You Buy XMR Now?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/monero-price-prediction/\" aria-label=\"More on Monero Price Prediction 2023-2032: Should You Buy XMR Now?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-14T09:44:16.000Z",
    "title": "Lido DAO (LDO) Leaves A Lot To Be Desired With Recent Decline; Uwerx (WERX) Presale Sees Green",
    "url": "https://www.cryptopolitan.com/lido-dao-ldo-leaves-a-lot-to-be-desired-with-recent-decline-uwerx-werx-presale-sees-green/",
    "description": "Lido DAO (LDO) has not been faring as greatly as it used to in the cryptocurrency market. The token is on a steady decline, thus discouraging interested investors from putting their money in.&#160; Uwerx, on the other hand, has had nothing but good news for crypto investors. This article discusses the fate that appears to ... <a title=\"Lido DAO (LDO) Leaves A Lot To Be Desired With Recent Decline; Uwerx (WERX) Presale Sees Green\" class=\"read-more\" href=\"https://www.cryptopolitan.com/lido-dao-ldo-leaves-a-lot-to-be-desired-with-recent-decline-uwerx-werx-presale-sees-green/\" aria-label=\"More on Lido DAO (LDO) Leaves A Lot To Be Desired With Recent Decline; Uwerx (WERX) Presale Sees Green\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-14T10:04:08.000Z",
    "title": "Tether Shuffles The Deck: 750 Million USDT Shifted From Tron To Ethereum",
    "url": "https://www.newsbtc.com/news/tether-shuffles-the-deck-750-million-usdt-shifted-from-tron-to-ethereum/",
    "description": "The company behind the issue of USDT stablecoin, Tether Holdings, has announced that it will work with a third-party exchange to convert 750 million USDT from Tron to Ethereum ERC20 via a chain swap. With a current market valuation of $83.37 billion, USDT is by far the most valuable stablecoin in existence. Stablecoin use has soared over the last few years, and Tether has been working hard to diversify its reserve holdings in response to the growing need for trust in the network. Related Reading: XRP Smothered In Red Despite Massive Whale Accumulation, Hinman Docs Release To maintain the liquidity of the stablecoin, cryptocurrency exchange Binance said through Twitter on Monday that it will arrange a swap of 750 million Tether-Tron token pairs for Tether-Ether. Tether has assured that the overall supply of USDT will not increase or decrease as a result of this. After 12pm UTC today, #Binance will be swapping 750M USDT-TRX for USDT-ETH directly with the Tether team to ensure stablecoin liquidity across all chains for our users. If you see any significant movements of USDT from our wallets today, that&#8217;s why. Funds are SAFU. — Binance (@binance) June 12, 2023 Tether Locks On 1:1 USD Anchor Tether, the most popular stablecoin, strives to keep a one-to-one exchange rate with the US dollar (USD) at all times. This token swap will involve Tron, the ninth largest cryptocurrency by market cap at $6.3 billion, and Ether, the second largest cryptocurrency by market cap at $210 billion, after Bitcoin. By exchanging bitcoin from one blockchain to another, or &#8220;swapping chains,&#8221; investors can get access to all of the blockchains that back the digital money they possess. Their digital assets can be used on other blockchains that support them. Related Reading: Solana Price Plunges Below March Low – Could It Drop Further? The move to rebalance the liquidity base of USDT on Ethereum by shifting from the region of surplus to the region of scarcity remains the most reasonable explanation of the various theories being put forward as to why the USDT is being switched. Meanwhile, the heightened regulatory scrutiny of Binance has been detrimental to the exchange, prompting this strategic shift. Binance is now engaged in litigation with the US Securities and Exchange Commission, highlighting the importance of taking preventative action in light of the current regulatory environment. ETH market cap currently at $210 billion. Chart: TradingView.com Restocking The Ethereum Network Inventory Binance, its CEO Changpeng Zhao, and Binance.US were all named in a lawsuit brought by the SEC last week. Binance has been accused of engaging in alleged deceptive activities, manipulating trading volumes, diverting user funds, and keeping the identity of those in control of the company in the United States a secret. Tether re-minted $1 billion in USDT on the Ethereum blockchain on Monday, prompting the swap. Tether&#8217;s CTO Paolo Ardoino tweeted that the recent $1 billion mint was part of the company&#8217;s effort to restock its Ethereum Network storage. In a related development, as of March, both the Tron Foundation and its creator, Justin Sun, were hit with fraud charges by the SEC. As a result, Binance USA announced that it will be pulling the digital asset token tron from its exchange. At the time of writing, Ether (ETH was trading at $1,744, down 6.33% in the last seven days, data from crypto market tracker CoinMarkeCap shows. Tether (USDT), on the other hand, is painted in red, and trading at $0.99. Source: CoinMarketCap Featured image from The Cryptonomist"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-14T09:41:21.000Z",
    "title": "Ethereum: Unsealed SEC Documents Show Concerns Over Bill Hinman’s ‘Ether is not a Security Statement",
    "url": "https://www.crypto-news-flash.com/ethereum-unsealed-sec-documents-show-concerns-over-bill-hinmans-ether-is-not-a-security-statement/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-unsealed-sec-documents-show-concerns-over-bill-hinmans-ether-is-not-a-security-statement",
    "description": "The Ripple vs SEC legal battle takes a new turn after William H. Hinman&#8217;s document was unsealed. Ethereum co-founder Vitalik Buterin is suspected to have influenced Hinman. The lawsuit filed by SEC against Ripple Labs in December 2020 is still ongoing but has taken a dramatic turn in the past few days. Throughout the legal [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-14T10:03:47.000Z",
    "title": "DOGE Gains Momentum In a Tight Trading Range Despite Recent Crash",
    "url": "https://coinedition.com/doge-gains-momentum-in-a-tight-trading-range-despite-recent-crash/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Dogecoins_open_interest_decline_alongside_the_decline_of_its_price-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Dogecoins_open_interest_decline_alongside_the_decline_of_its_price-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Dogecoins_open_interest_decline_alongside_the_decline_of_its_price-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Dogecoins_open_interest_decline_alongside_the_decline_of_its_price.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In the last 30 days, Dogecoin (DOGE) has lost 11% of its value, mainly due to the widespread volatility that hit the market. As a result, the meme’s price sunk to a yearly low of $0.059 on June 10. However, the respite in the market helped the coin back up above $0.6 While DOGE has [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/doge-gains-momentum-in-a-tight-trading-range-despite-recent-crash/\">DOGE Gains Momentum In a Tight Trading Range Despite Recent Crash</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]