[
  {
    "source": "CoinDesk",
    "date": "2023-08-11T19:25:09.000Z",
    "title": "Is Friend.tech a Friend or Foe? A Dive Into the New Social App Driving Millions in Trading Volume",
    "url": "https://www.coindesk.com/web3/2023/08/11/is-friendtech-a-friend-or-foe-a-dive-into-the-new-social-app-driving-millions-in-trading-volume/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The new social app has driven over 4,400 ETH ($8.1 million) in trading volume in less than 24 hours since its launch, far surpassing OpenSea’s in the same time frame. But with its mysterious origins, lack of privacy policy and lagging network, it raises some red flags."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-11T19:18:06.000Z",
    "title": "Sam Bankman-Fried Jailed Ahead of Trial",
    "url": "https://www.coindesk.com/policy/2023/08/11/sam-bankman-fried-jailed-ahead-of-trial/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "FTX founder Sam Bankman-Fried has been remanded into custody ahead of his October trial on multiple financial crime charges after a federal judge revoked his release on bond."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-11T19:28:16.000Z",
    "title": "Sam Bankman-Fried Is Going to Jail, Judge Revokes Bail Over Witness Tampering",
    "url": "https://decrypt.co/152210/sam-bankman-fried-going-to-jail-judge-revokes-bail",
    "description": "Disgraced FTX CEO Sam Bankman-Fried's bail has been revoked. He will be detained in jail until the start of his criminal trial in October."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-11T19:30:00.000Z",
    "title": "US gov’t debt downgraded — Huge news for Bitcoin?",
    "url": "https://cointelegraph.com/news/us-govt-debt-downgraded-huge-news-for-bitcoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/dce92948-7d24-4d5b-b0e4-32218d780c2b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cointelegraph analyst and writer Marcel Pechman explains why the downgrading of U.S. government debt will negatively impact the price of Bitcoin over the next few months.</p>\n                    <p><p>On this week’s episode of <em>Macro Markets</em>, Cointelegraph analyst and writer Marcel Pechman explores the United States debt downgrade by Fitch Ratings. According to Pechman, this change signaled diminished confidence in the U.S. government’s ability to handle its fiscal responsibilities.</p><p>The downgrade nudged investors into a cautious stance, leading many to move their money out of assets such as stocks, silver, oil and long-term bonds. Instead, they turned to cash and short-term instruments, which are perceived as safer options in uncertain times.</p><p>Interestingly, the cost of insuring U.S. sovereign debt against default — as indicated by credit default swaps — has largely remained stable post-downgrade. According to Pechman, a potential reason is that U.S. Treasurys are considered one of the safest investments globally because the U.S. government backs them.</p><p>Consequently, Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is under pressure from the U.S. government’s debt downgrade. The initial flight to liquidity often overlooks the benefits of decentralized assets during early market turbulence.</p><p>Pechman believes that those models cannot calculate what happens to liquidity, or more specifically, the order book depth. For instance, what are the consequences if the U.S. government withholds the yield of its debt held by China?</p><p>Pechman also discusses the latest European Union bank stress test showing three institutions “falling short.” The European Banking Authority said the test included 70 banks, representing about 75% of banking assets in the EU.</p><p>Pechman explains that everyone knew how risky Credit Suisse and Silicon Valley Bank were, but no one expected the investors’ confidence in those institutions to erode so quickly. Consequently, it seems to be a matter of appearance, regardless of the liquidity conditions.</p><p><em>Macro Markets</em> runs exclusively on the new <a href=\"https://www.youtube.com/@cointelegraphmarketresearch\" target=\"_blank\" rel=\"noopener nofollow\">Cointelegraph Markets &amp; Research YouTube channel</a>, so make sure to like and subscribe today!</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/YPkXLhfwJB8\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-11T19:23:22.000Z",
    "title": "Judge orders Sam Bankman-Fried's bail revoked following allegations of witness intimidation: Report",
    "url": "https://cointelegraph.com/news/judge-orders-sam-bankman-fried-bail-revoked-following-allegations-witness-intimidation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/301e49da-bd7f-4f55-9512-65711a0aa072.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Judge Lewis Kaplan reportedly cited SBF's alleged attempts to influence or intimidate witnesses in the criminal case including a former FTX US general counsel and Caroline Ellison.</p>\n                    <p><p>A federal judge has reportedly revoked former FTX CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried</a>’s bail following the release of information to New York Times reporters in an alleged attempt to intimidate witnesses.</p><p>According to reports of individuals present at an Aug. 11 hearing in United States District Court for the Southern District of New York, Judge Lewis Kaplan <a href=\"https://twitter.com/innercitypress/status/1690061503645229056\" target=\"_blank\" rel=\"noopener nofollow\">ordered</a> Bankman-Fried's bail revoked, suggesting he will be held in prison through the end of his trials for fraud related to his activities at FTX. Prosecutors had been pushing for the revocation of SBF’s $250-million bail which had kept him out of custody since his arraignment in December 2022.</p><p>Judge Kaplan reportedly said that Bankman-Fried’s interviews with New York Times reporters resulted in sharing information with the likely intention “to hurt and frighten” former Alameda Research CEO Caroline Ellison, his former colleague and girlfriend. Bankman-Fried’s legal team <a href=\"https://cointelegraph.com/news/sam-bankman-fried-legal-team-turns-over-docs-related-nyt-story-requests-sealed\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sam-bankman-fried-legal-team-turns-over-docs-related-nyt-story-requests-sealed/amp\">confirmed he had provided</a> the reporters with some of the published information, which led to Judge Kaplan imposing a gag order preventing extrajudicial statements related to the criminal case.</p><p>Assistant U.S. Attorney Danielle Sassoon reportedly cited SBF’s violations of previous bail conditions, which included a <a href=\"https://cointelegraph.com/news/us-prosecutors-seek-to-ban-sbf-from-signal-after-alleged-witness-contact\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-prosecutors-seek-to-ban-sbf-from-signal-after-alleged-witness-contact/amp\">message on the Signal app</a> to FTX US general counsel Ryne Miller in January, using a Virtual Private Network for his internet activity, and releasing information to reporters aimed at intimidating Ellison. She added that Putnam County Correctional Facility was prepared to offer Bankman-Fried a laptop should the judge order him remanded, but also suggested home detention with restrictions on Google Drive was an option. </p><p>“In view of the evidence, my conclusion is that there is probable cause to believe that the defendant has attempted to tamper with witnesses at least twice,” said Kaplan, listing additional violations. “All things considered I am going to revoke bail.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">SBF just arrived to court - a judge could send him to jail this afternoon over witness tampering. Here’s a primer ahead of the hearing: <a href=\"https://t.co/7xA205agrD\" data-amp=\"https://t-co.cdn.ampproject.org/c/s/t.co/7xA205agrD\">https://t.co/7xA205agrD</a>  w/ <a href=\"https://twitter.com/DawnGiel?ref_src=twsrc%5Etfw\">@DawnGiel</a> <a href=\"https://t.co/tb29du8WGY\">https://t.co/tb29du8WGY</a> <a href=\"https://t.co/shdjrbPeTG\">pic.twitter.com/shdjrbPeTG</a></p>— MacKenzie Sigalos (@KenzieSigalos) <a href=\"https://twitter.com/KenzieSigalos/status/1690045272678707210?ref_src=twsrc%5Etfw\">August 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Sassoon reportedly argued SBF had allegedly asked witnesses to delete certain messages and documents. Bankman-Fried’s attorney Mark Cohen reportedly pressed the judge to allow SBF to continue his bail conditions, citing the need to coordinate with the legal team, and added any allegations of witness intimidation were a matter for his October trial. </p><p>“Just because the defendant was more subtle than a mobster doesn't mean it's okay [...] it's enough for the court to conclude detention is appropriate if he's unlikely to abide by his bail conditions,” reportedly said Sassoon. “He is intent on interfering with the integrity of the trial.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/was-sam-bankman-fried-behind-another-scam-project\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/was-sam-bankman-fried-behind-another-scam-project/amp\"><strong><em>Was Sam Bankman-Fried behind a scam project?</em></strong></a></p><p>Inner City Press <a href=\"https://twitter.com/innercitypress/status/1690047810798833664\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> Bankman-Fried’s parents may have been present at the hearing. SBF has largely been confined to their California home when not traveling to New York for court proceedings.</p><p>Bankman-Fried faces 12 criminal charges spread across two trials scheduled to begin in October 2023 and March 2024. Though prosecutors announced in July they planned to drop a charge concerning violations of campaign finance due to the conditions of an extradition agreement with the Bahamas, they said on Aug. 8 they will still <a href=\"https://cointelegraph.com/news/prosecutors-consider-sam-bankman-fried-alleged-campaign-finance-scheme-trial\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/prosecutors-consider-sam-bankman-fried-alleged-campaign-finance-scheme-trial/amp\">consider the alleged scheme</a> as part of a wire fraud charge.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-11T19:30:51.000Z",
    "title": "Spot Bitcoin ETF Applications Face More Delays",
    "url": "https://news.bitcoin.com/spot-bitcoin-etf-applications-face-more-delays/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/ark-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Spot Bitcoin ETF Applications Face More Delays\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/ark-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ark-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ark-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ark-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ark-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ark-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ark.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.S. Securities and Exchange Commission (SEC) on Friday asked for additional public feedback on a proposal to list a spot bitcoin exchange-traded fund (ETF), likely delaying any decision on the high-profile applications. SEC Seeks Public Opinion on Spot Bitcoin ETF The SEC put out a 34-page request for comment on the Ark Invest and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T19:15:31.000Z",
    "title": "How Generative AI Contract Terms Can Protect Business Interests and Intellectual Property",
    "url": "https://www.cryptopolitan.com/navigating-generative-ai-contract-terms/",
    "description": "Generative AI, a groundbreaking technology, holds the potential to revolutionize content creation, accelerate development, and streamline tasks for companies. However, as with any powerful tool, it comes with both opportunities and risks. In this article, we delve into the crucial contractual aspects that require consideration when dealing with providers of generative AI tools. The focus ... <a title=\"How Generative AI Contract Terms Can Protect Business Interests and Intellectual Property\" class=\"read-more\" href=\"https://www.cryptopolitan.com/navigating-generative-ai-contract-terms/\" aria-label=\"More on How Generative AI Contract Terms Can Protect Business Interests and Intellectual Property\">Read more</a>"
  }
]