[
  {
    "source": "Cointelegraph",
    "date": "2024-03-07T01:53:00.000Z",
    "title": " FTX, Alameda reaches ‘in principle’ settlement with BlockFi, paying $874M  ",
    "url": "https://cointelegraph.com/news/ftx-alameda-in-principle-settlement-blockfi",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvZDlhNDdiYWQtMzQ0NS00Y2I5LTlhZTctN2ZjZGFmOWI3ODFjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The bankrupt crypto companies have resolved their disputes for nearly $1 billion, which could lead to full recovery for BlockFi’s customers.</p>\n                    <p><p>Bankrupt crypto firms BlockFi and FTX have reached an “in principle” agreement to settle their disputes, with FTX agreeing to pay up to $874.5 million to BlockFi and drop its claims against the f, <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.njb.1094078/gov.uscourts.njb.1094078.2172.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to a March 6 court filing.</p><p>Terms of the settlement are subject to approval by U.S. Bankruptcy Judge John Dorsey in Wilmington, Delaware.</p><p>The settlement would resolve BlockFi’s claims against FTX, totaling approximately a billion dollars, and will also see FTX waive \"millions of dollars of avoidance claims and other counterclaims\" against BlockFi.</p><p><a href=\"https://cointelegraph.com/news/ftx-alameda-in-principle-settlement-blockfi\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-07T01:58:00.000Z",
    "title": "Altcoins Surge to Outperform Bitcoin as Crypto Market Adds $800 Billion in a Month",
    "url": "https://www.cryptoglobe.com/latest/2024/03/altcoins-surge-to-outperform-bitcoin-as-crypto-market-adds-800-billion-in-a-month/",
    "description": "Cryptocurrencies with lower market capitalizations are surging after the flagship cryptocurrency Bitcoin ($BTC) briefly hit a new all-time high before correcting, as investors bet that these “altcoins” are poised to replicate the digital asset’s recent success. An index tracking the bottom half of the top 100 cryptocurrencies, the MarketVecto Digital Assets 100 Index (MVDA), has risen […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-07T02:00:05.000Z",
    "title": "Ethereum Plans For Dencun Upgrade: Is This The End Of Roll-Ups?",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-dencun-upgrade-end-of-roll-ups/",
    "description": "Ye Zhang, the co-founder of Scroll, a layer-2 project using zero-knowledge proof, is cautiously optimistic about the upcoming Dencun upgrade. In a post on X, Zhang pointed out Dencun&#8217;s potential benefits, particularly the low transaction fees. However, in the same post, the co-founder highlighted the likely challenges it could present for existing layer-2 scaling solutions using roll-ups. Dencun Introduces EIP-4844 In Ethereum: What It Means Ethereum developers plan to implement Dencun in mid-March. Implementing the Ethereum Improvement Proposal (EIP)-4844 is a big part of this hard fork. With this execution, the proposal will introduce a new &#8220;blob-carrying transaction&#8221; feature.  What&#8217;s unique about these transactions is that they allow users to cheaply attach blobs, which are large amounts of data, compared to traditional Ethereum transactions.  Related Reading: Shiba Inu Whale Shifts 1.25 Trillion SHIB Amid Market Volatility, Here’s The Destination Based on observations from the Goerli testnet, Zhang anticipates blobs to be 3-5 times cheaper than traditional call data on Ethereum. Accordingly, the vast difference means innovative developers can come up with blob-inscriptions. These inscriptions will effectively compete with layer-2 solutions like Arbitrum or Optimism leveraging roll-ups.  This possibility cannot be discounted because, in essence, EIP-4844 aims to reduce layer-2 transactions through blob transactions. Effectively, the proposal means the foundation of Blob inscriptions.  This solution takes a different approach but could take on roll-up platforms if widely adopted. It will be the case if users transacting large chunks of data realize the advantage of going the blob inscription route. Even so, roll-ups will carry distinct advantages over blob inscriptions. A notable one is the superior scalability of roll-ups. These solutions can inherently process more transactions every second. Additionally, they are secure since they inherit security from the Ethereum mainnet. ETH Prices Steady Above $3,800 Still, until after Dencun is implemented, the impact of EIP-4844 will be thoroughly measured. Overall, the Ethereum and layer-2 communities are ecstatic for the upgrade, expecting it to thrust ETH even higher in the current bull run. Ethereum is trading above $3,800. It has been up by double digits in the past week, and experts are predicting even more gains in the days ahead. Related Reading: Analyst Cites Key Indicators That Signal Bitcoin Correction In the medium term, bulls target $5,000, around the all-time high. Amid the boom in ETH and crypto prices, interest in Ethereum layer-2 solutions continues to expand. The latest L2Beat data shows that Arbitrum, Optimism, and other alternatives manage over $36 billion. Arbitrum, enjoying its first-move advantage, manages nearly $16 billion. Feature image from Shutterstock, chart from TradingView"
  }
]