[
  {
    "source": "CoinDesk",
    "date": "2023-07-05T19:25:50.000Z",
    "title": "Centralization Comes to DeFi as Group Behind MIM, SPELL Tokens Mull Legal Shakeup",
    "url": "https://www.coindesk.com/business/2023/07/05/centralization-comes-to-defi-as-group-behind-mim-spell-tokens-mull-legal-shakeup/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A project leader called for adding lawyers, jurisdictions and trustees for Abracadabra DAO, the entity overseeing Magic Internet Money (MIM) and SPELL tokens."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T19:13:22.000Z",
    "title": "CEX crypto trading hits $2.7T in June amid SEC lawsuits, BlackRock Bitcoin ETF filing",
    "url": "https://cointelegraph.com/news/cex-crypto-trading-hits-2-7t-june-amid-sec-lawsuits-blackrock-etf-filing",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/4e422a4e-c2ba-4710-a23e-f1f04c934493.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The first increase in trading volume in months was driven by market volatility following the SEC's lawsuits against Binance and Coinbase, as well as improving sentiment via BlackRock's ETF filing. </p>\n                    <p><p>The combined spot and derivatives trading volume on centralized exchanges (CEXs) climbed 14.2% in June to $2.71 trillion, according to CCData's monthly exchange report. Binance, Binance.US, and Coinbase all saw their market share decline in the past month.</p><p>As per the report, the first rise in trading volume in three months was backed by <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-filing-coinbase-surveillance-partner\">BlackRock's exchange-traded fund (ETF) filing</a> and regulators' complaints against crypto exchanges Binance and Coinbase in the United States. </p><p>Binance <a href=\"https://cointelegraph.com/news/binance-net-outflows-on-ethereum-blockchain-after-sec-lawsui-nansen\">saw a surge in withdrawals</a> following the Securities and Exchange Commission (SEC) lawsuit on June 5. As a result, its market share dropped the most among CEXs, by 1.40% to 41.6%, while Binance.US saw a marginal share decline of 0.86% to 0.36%. Coinbase's market share declined the least among the major exchanges, sliding by 0.08% to 5.36%. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/77fb3e2d-83f9-4cc6-b1e7-3a57a1b7aad0.png\"  /><figcaption style=\"text-align: center;\"><em>Change in market share among major crypto exchanges in June 2023. Source: CCData.</em></figcaption></figure><p>While the SEC lawsuits triggered volatility across markets, BlackRock's filing for a spot Bitcoin ETF reportedly boosted investors' sentiment, with spot trading activity increasing by 16.4% to $575 billion in June. Despite the growth, spot trading volumes on CEXs remain historically low, with April to June representing the lowest quarterly volumes since 2019. </p><p>June also saw derivatives trading volume rise 13.7% to $2.13 trillion, the first increase in three months. Binance was the leading venue for derivatives crypto trading, with volume topping $1.21 trillion in June, followed by OKX exchange with $416 billion, up 44.9% in activity. </p><p>Bitcoin futures volume spiked on the CME exchange, reaching $37.9 billion, a 28.6% increase, the highest volume traded on the derivatives exchange since November 2021. Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) futures trading volume grew to $8.91 billion, a 9.93% increase in the month.</p><p>\"The increase in BTC futures volume over the last couple of months highlights the heightened trading activity by institutional entities as the markets speculate over the SEC’s decision on the multiple spot Bitcoin ETFs filings,\" notes the report. </p><p><a href=\"https://cointelegraph.com/magazine/ordinals-turned-bitcoin-into-a-worse-version-of-ethereum-can-we-fix-it/\"><strong><em>Magazine: Ordinals turned Bitcoin into a worse version of Ethereum — Can we fix it?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T19:31:15.000Z",
    "title": "Bitget announces the launch of its dual-coin crypto loans",
    "url": "https://www.cryptopolitan.com/bitget-announces-the-launch-of-crypto-loan/",
    "description": "Singapore-based derivatives trading platform Bitget is set to launch a cryptocurrency lending program that allows users to stake their coins in exchange for loans in different digital assets. The platform aims to cater to borrowers who are dissatisfied with traditional lenders and provide them with the opportunity to expand their investment portfolios beyond their current ... <a title=\"Bitget announces the launch of its dual-coin crypto loans\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitget-announces-the-launch-of-crypto-loan/\" aria-label=\"More on Bitget announces the launch of its dual-coin crypto loans\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T19:29:36.000Z",
    "title": "Shiba Inu Milestones: Fun Way for People to Participate in DeFi",
    "url": "https://www.cryptopolitan.com/shiba-inu-milestones/",
    "description": "Shiba Inu is a cryptocurrency that was created with the goal of creating a fun and accessible way for people to participate in the world of decentralized finance. At its core, Shiba Inu milestones showcase the community-driven projects that have captured the hearts of many crypto enthusiasts around the world. Since its launch, Shiba Inu ... <a title=\"Shiba Inu Milestones: Fun Way for People to Participate in DeFi\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-milestones/\" aria-label=\"More on Shiba Inu Milestones: Fun Way for People to Participate in DeFi\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T19:22:51.000Z",
    "title": "UK parliament advances bill to seize illicit cryptocurrencies",
    "url": "https://www.cryptopolitan.com/uk-parliament-seize-illicit-cryptocurrencies/",
    "description": "Lawmakers in the upper house of the UK Parliament are making progress with a bill aimed at expanding authorities’ powers to combat the use of cryptocurrencies for illicit purposes. The Economic Crime and Corporate Transparency Bill, introduced in September 2022, underwent its third reading in the House of Lords on July 4. During this reading, ... <a title=\"UK parliament advances bill to seize illicit cryptocurrencies\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uk-parliament-seize-illicit-cryptocurrencies/\" aria-label=\"More on UK parliament advances bill to seize illicit cryptocurrencies\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T19:22:43.000Z",
    "title": "Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices considering investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand&#8217;s price prediction from 2023 to 2032, its expected minimum price, and what it brings. For ... <a title=\"Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T19:18:20.000Z",
    "title": "HSBC’s quantum-safe network shakes up UK banking",
    "url": "https://www.cryptopolitan.com/hsbcs-quantum-safe-network-shakes-up-banking/",
    "description": "From the misty avenues of London, a remarkable technological evolution is taking shape in the world of finance. As the city&#8217;s double-decker buses and black cabs proceed with their routine buzz, an extraordinary narrative unfolds at the headquarters of HSBC. This tale is one of financial institutions stepping into the quantum era, spearheaded by HSBC&#8217;s ... <a title=\"HSBC&#8217;s quantum-safe network shakes up UK banking\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hsbcs-quantum-safe-network-shakes-up-banking/\" aria-label=\"More on HSBC&#8217;s quantum-safe network shakes up UK banking\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T19:13:27.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T19:12:39.000Z",
    "title": "Crypto Twitter views on Google decline due to rate limit",
    "url": "https://www.cryptopolitan.com/crypto-twitter-views-on-google-decline/",
    "description": "Twitter’s implementation of new rate limits has had a significant effect on the indexing and display of crypto Twitter’s tweets on Google’s search engine, resulting in a reduced reach of information shared on the microblogging site. Recent reports from Search Engine Land, an industry outlet focused on web search, reveal that Google Search has witnessed ... <a title=\"Crypto Twitter views on Google decline due to rate limit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-twitter-views-on-google-decline/\" aria-label=\"More on Crypto Twitter views on Google decline due to rate limit\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-05T19:35:23.000Z",
    "title": "BITCOIN PRICE ANALYSIS & PREDICTION (July 5) – BTC Faces $30k Level Again, Will it Crack This Time?",
    "url": "https://nulltx.com/bitcoin-price-analysis-prediction-july-5-btc-faces-30k-level-again-will-it-crack-this-time/",
    "description": "Bitcoin is currently down with a 2% drop in the last 24 hours. It lost $31k today and now diving towards $30k with serious sell pressure. However, its mid-term bullish remains intact on the higher timeframe.  Just a few weeks ago, Bitcoin bounced off crucial support as expected and regained momentum following a 25% rally [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-05T19:30:00.000Z",
    "title": "Pepe Coin (PEPE) Still Has Impact In The Memecoin World, Alex The Doge (ALEX) Changing What It Means To Be A Memecoin",
    "url": "https://nulltx.com/pepe-coin-pepe-still-has-impact-in-the-memecoin-world-alex-the-doge-alex-changing-what-it-means-to-be-a-memecoin/",
    "description": "In the world of memecoins, there are two names that have been making waves recently: Pepe Coin (PEPE) and Alex The Doge (ALEX). While Pepe Coin (PEPE) has been a talked-about token for some time, Alex The Doge (ALEX) is a new player in the market that aims to challenge the dominance of Dogecoin (DOGE). [&#8230;]"
  }
]