[
  {
    "source": "Cointelegraph",
    "date": "2023-06-22T23:30:47.000Z",
    "title": "FTX seeks to claw $700M from Bankman Fried friends and affiliated funds",
    "url": "https://cointelegraph.com/news/ftx-claw-700-million-sam-bankman-fried-friend-investment-firm",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/f61f839a-291f-4b92-b40c-16f819a29dbd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>After a Hollywood dinner party, hundreds of millions of dollars of “avoidable” transfers were sent from Alameda to investment firm K5 Global, the suit alleges.</p>\n                    <p><p>FTX has filed a lawsuit in the United States Bankruptcy Court for the District of Delaware against some of the investment firms it had ties to before its collapse. The suit, filed June 22, contained 16 counts and seeks over $700 million from the defendants.</p><p>The lawsuit filing named K5 Global – an incubator and investment company, Mount Olympus Capital and SGN Albany Capital, as well as affiliated entities and K5 Global co-owners Michael Kives and Bryan Baum, as defendants. Kives is a <a href=\"https://nypost.com/2022/12/01/hollywood-insider-and-clinton-ally-could-lose-300m-in-ftx-debacle-insiders/\" target=\"_blank\" rel=\"noopener nofollow\">former</a> agent for the CAA talent agency and former aide to Hilary Clinton. The suit noted the then-CEO of FTX Sam Bankman-Fried (SBF) attended a social event hosted by Kives in 2022:</p><blockquote>“True to Kives’s reputation as a high-profile ‘super-networker,’ the attendees at the dinner party included a former Presidential candidate, top actors and musicians, reality TV stars and multiple billionaires.”</blockquote><p>Subsequently, the suit alleged, FTX-affiliated crypto trading firm Alameda Research transferred $700 million to Kives, Baum and K5 Global, but they constructed the deals as coming from shell companies SGN Albany and Mount Olympus Capital. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/ftx-bankruptcy-very-expensive-heres-why-says-auditor\">FTX bankruptcy will be ‘very expensive’ but for a reason: Auditor</a></em></strong></p><p>The suit seeks the return of funds transferred from Alameda Research that ended up in SGN Albany Capital and funds transferred from Kives, Baum and SGN Albany Capital to Mount Olympus Capital. </p><p>The transfers were described as being carried out “without receiving equivalent value” and, crucially, as avoidable. In U.S. bankruptcy law, an avoidable transaction is one that can be reversed under the Bankruptcy Code or other laws.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">FTX moves to claw back $800 million from K5 Global, Olympus Capital, SGN Albany et al.<br><br>Defendants are further accused of aiding and abetting SBF, dishonest assistance and unjust enrichment. <a href=\"https://t.co/IPcDEtuFxL\">pic.twitter.com/IPcDEtuFxL</a></p>&mdash; FTX 2.0 Coalition (@AFTXcreditor) <a href=\"https://twitter.com/AFTXcreditor/status/1671933063385825313?ref_src=twsrc%5Etfw\">June 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Kives, Baum and SBF also developed close personal ties, with Baum even having his own bedroom in the FTX executives’ Bahamas residence, the suit said. After the FTX collapse, “Kives and Baum worked behind the scenes with Bankman-Fried on a strategy to find someone to bail out the FTX Group (and to protect their golden goose).”</p><p>Nine of the counts in the suit concerned fund transfers. Kives and Buam were personally charged with aiding and abetting breach of fiduciary duty and dishonest assistance, and SGN Albany Capital was charged with unjust enrichment. </p><p>Cointelegraph reached out to K5 Global for comment but did not receive an immediate response.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\">Can you trust crypto exchanges after the collapse of FTX?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T23:33:24.000Z",
    "title": "Token Swap vs Token Migration: Distinct Meanings and Implications in the Cryptocurrency Industry",
    "url": "https://www.cryptopolitan.com/token-swaps-vs-token-migration/",
    "description": "The cryptocurrency industry is driven by a constant pursuit of innovation and streamlining the management, storage, and utilization of digital assets. Through these efforts, the complexities that were once inherent in the crypto space have been effectively eliminated, leading to significant enhancements in user experience.&#160; While the terms &#8220;token swap&#8221; and &#8220;token migration&#8221; are often ... <a title=\"Token Swap vs Token Migration: Distinct Meanings and Implications in the Cryptocurrency Industry\" class=\"read-more\" href=\"https://www.cryptopolitan.com/token-swaps-vs-token-migration/\" aria-label=\"More on Token Swap vs Token Migration: Distinct Meanings and Implications in the Cryptocurrency Industry\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T23:13:37.000Z",
    "title": "A Complete Guide to Bull Flag Patterns For Crypto Trading Fun",
    "url": "https://www.cryptopolitan.com/a-complete-guide-to-bull-flag-patterns/",
    "description": "Traders and investors are always on the lookout for reliable signals and patterns that can guide their decision-making. One such pattern that has gained significant popularity among technical analysts is the bull flag pattern. Understanding this pattern can provide valuable insights into market trends and help identify potentially profitable opportunities. We will explore various chart ... <a title=\"A Complete Guide to Bull Flag Patterns For Crypto Trading Fun\" class=\"read-more\" href=\"https://www.cryptopolitan.com/a-complete-guide-to-bull-flag-patterns/\" aria-label=\"More on A Complete Guide to Bull Flag Patterns For Crypto Trading Fun\">Read more</a>"
  }
]