[
  {
    "source": "CryptoGlobe",
    "date": "2024-01-12T08:27:11.000Z",
    "title": "Historic Trading Frenzy: U.S. Spot Bitcoin ETFs Surge with $4.6 Billion Trading Volume on Launch Day",
    "url": "https://www.cryptoglobe.com/latest/2024/01/historic-trading-frenzy-u-s-spot-bitcoin-etfs-surge-with-4-6-billion-trading-volume-on-launch-day/",
    "description": "On 11 January 2024, Reuters reported significant trading activity in the newly approved U.S.-listed Bitcoin exchange-traded funds (ETFs), with $4.6 billion worth of shares traded as of Thursday afternoon, according to LSEG data. This surge in trading came a day after the U.S. Securities and Exchange Commission (SEC) approved these landmark products, marking a potential […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-12T08:33:10.000Z",
    "title": "US Startup Funding Takes a Nosedive, Plunging 30% to $171 Billion in 2023 Despite AI Surge",
    "url": "https://www.cryptopolitan.com/us-startup-funding-takes-a-nosedive-ai-surge/",
    "description": "In a stark turn of events for the US startup ecosystem, funding took a nosedive, plummeting 30% to $171 billion in 2023, as revealed by recent PitchBook data. This downturn comes amid the backdrop of an AI frenzy that gripped investors throughout the year, driven in part by the spotlight on OpenAI&#8217;s ChatGPT and a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-12T08:23:59.000Z",
    "title": "Wiki Finance Expo Hong Kong 2024 Is Coming in May!",
    "url": "https://www.cryptopolitan.com/wiki-finance-expo-hong-kong-2024-is-coming-in-may/",
    "description": "Regulation, Forex, Crypto, Web 3.0, NFTs, Metaverse, ESG, AI Will Be in Focus. Taking place on May 17, 2024, Wiki Finance Expo Hong Kong 2024 is one of the largest and most influential fintech and digital finance events in Asia in 2024. Participation is completely free. The event ticket includes admission to sky100 observation deck [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-12T08:23:48.000Z",
    "title": "Solana-based MEV bot nets $1.7M profit in questionable trade",
    "url": "https://www.cryptopolitan.com/solana-based-mev-bot-nets-1-7m-profit/",
    "description": "A Solana-based maximum extractable value (MEV) bot recently made headlines by raking a staggering $1.7 million from a questionable trade. The trade-in question involved a trader purchasing a substantial amount of the memecoin Dogwifhat (WIF) in what was deemed the &#8220;most inefficient way possible.&#8221; MEV bots, automated programs that scan blockchain networks for profitable trading [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-12T08:15:10.000Z",
    "title": "Over 30% of blockchain games are now abandoned, data shows",
    "url": "https://crypto.news/over-30-of-blockchain-games-are-now-abandoned-data-shows/",
    "description": "Out of more than 1,300 blockchain games that have been announced since 2021, over 400 are now discontinued or canned. According to data compiled by BlockchainGamer.biz, out of a total of 1,318 blockchain-based games that have been in circulation since&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-12T08:14:02.000Z",
    "title": "Do Kwon seeks US court approval to delay Terra trial until mid-March",
    "url": "https://crypto.news/do-kwon-seeks-us-court-approval-to-delay-terra-trial-until-mid-march/",
    "description": "Do Kwon, ex-CEO of Terra, is seeking to delay the SEC trial against him and his former company so he can attend the trial. Kwon&#8217;s legal team has officially asked a US court to defer the trial, citing uncertainties about&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-12T08:30:54.000Z",
    "title": "Bitcoin Price Stalls At $46,000 Despite Record ETF Day: Here’s Why",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-stalls-record-etf-day-heres-why/",
    "description": "Despite a groundbreaking day in the US with the largest Exchange-Traded Fund (ETF) launch for a single asset, the Bitcoin price remained stagnant, hovering around the $46,000 mark. This development has raised questions within the community, particularly in light of the extraordinary trading volume and participation seen in the ETF market. Record-Breaking ETF Launch On its first trading day, Bitcoin ETFs saw unprecedented activity. The total volume reached $4.6 billion, distributed among major players such as Grayscale ($2.3 billion), BlackRock ($1 billion), Fidelity ($700 million), ARK 21Shares ($288 million), and Bitwise ($125 million). This event marked over 700,000 individual trades. Nate Geraci, President of the ETF Store and co-founder of the ETF Institute, remarked, “GBTC had the largest ETF launch by trading volume ever with $2.3 billion… iShares Bitcoin ETF (IBIT) had the 5th largest launch with $1 billion. GBTC obviously had built-in liquidity, but it&#8217;s still a record. IBIT&#8217;s performance is impressive given it launched the same day as 10 other competitors.” Bloomberg’s ETF expert Eric Balchunas added, “All told, there were 700,000 individual trades today in and out of the 11 spot ETFs. For context, that is double the number of trades for QQQ (although it sees much bigger $ volume because bigger fish use it). So, there was a lot more grassroots action (versus big seed buys) than I expected, which is good.” Bitcoin Price Cannot Maintain Its Gains Despite these impressive figures, the Bitcoin price struggled to surpass the $50,000 threshold. Although BTC briefly touched $49,000, it failed to maintain these gains, dipping to as low as $45,700. At press time, the price settled around $46,000. Related Reading: Is Bitcoin Near Top Yet? What Glassnode’s Price Multiplier Model Says Dan Ripoll, managing director at Swan Bitcoin, argued almost everyone expected Bitcoin to either rip, or to sell off on the ETF news, but neither happened. So what’s behind the muted price response? Ripoll argues that compliance departments at brokerage firms often take &#8220;weeks to several months to add new products to their internal &#8216;approved products list&#8217; for advisors to sell.&#8221; Moreover, the expert explained that several large broker-dealers like Vanguard, UBS, Citi and Merrill Lynch have either restricted or disallowed their retail clients to buy any spot Bitcoin ETFs. Related Reading: PlanB’s Triple Bitcoin Forecast: A Pre-Halving Surge, Post-ETF Rally, And Monumental Peak Ahead A significant point of discussion was Vanguard’s decision to block its customers from buying into the new BTC Spot ETFs, citing that these products “don’t fit with Vanguard’s investment philosophy.” This move by the world’s second-largest asset manager, behind BlackRock, further complicates the landscape for Bitcoin ETF adoption. &#8220;There may be other brokers who blocked these sales as well for ideological reasons. They don’t believe in Bitcoin. I didn’t expect this at all. They’ll lose customers quickly with this strategy,&#8221; Ripoll stated. Rotation Plays And GBTC Selling Besides that there are reports of investors rotating out of Bitcoin ETF proxies, like BITO and mining stocks, to redeploy capital into better proxies, such as the new spot ETFs. This shift might have mildly suppressed ETF inflows and could take months to fully materialize. It is also interesting to note that Grayscale accounted for half of yesterday&#8217;s trading volume, much of which could have been sell orders. In the run-up to the spot ETF approval, GBTC was a popular bet among speculators who had taken advantage of the discount of over 40% at times in the hope that this would close with the ETF launch. This is exactly what happened, with GBTC only trading at around -1% yesterday. Thus, most of the GBTC trading was probably selling. This is supported by the fact that there is probably no point for investors to hold the GBTC with its enormous 1.5% yearly fee when other spot Bitcoin ETF issuers offer 0.25%. Fred Krueger, a crypto expert, stated, &#8220;GBTC volume must be 90% sales. Some of that went into IBIT.&#8221; BitMEX Research commented, “The GBTC volume could be mostly selling and outflow. It has been trading at a discount for almost all the trading day, so not likely to be buying.” In summary, the lack of a significant Bitcoin price surge, despite the record ETF day, can be attributed to a combination of factors including GBTC selling, compliance delays, brokerage restrictions, fund rotations, and ideological stances by major financial institutions. At press time, BTC traded at $45,893. Featured image created with DALL·E, chart from TradingView.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-12T08:26:42.000Z",
    "title": "Top 6 Cosmos Gems With 50-100x Potential — Part 1",
    "url": "https://www.altcoinbuzz.io/reviews/top-6-cosmos-gems-with-50-100x-potential-part-1/",
    "description": "<p>The Cosmos ecosystem is on fire right now. Almost all Cosmos projects have already seen good upward price moves. Moreover, there were also some great airdrops. For example, Celestia (TIA) which started at $2 and now sits at $15.6. $DYM and $SAGA are airdropping soon. Black Panther has its $BLACK token coming, and so on. [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/reviews/top-6-cosmos-gems-with-50-100x-potential-part-1/\">Top 6 Cosmos Gems With 50-100x Potential — Part 1</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-12T08:11:54.000Z",
    "title": "Spot Bitcoin ETFs Trading Debut: $4.6B Traded, 700K Transactions",
    "url": "https://coinedition.com/spot-bitcoin-etfs-trading-debut-4-6b-traded-700k-transactions/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Institutional-Giants-Prepare-Bitcoin-ETF.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Institutional Giants Prepare Bitcoin ETF\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Institutional-Giants-Prepare-Bitcoin-ETF.png 730w, https://coinedition.com/wp-content/uploads/2023/08/Institutional-Giants-Prepare-Bitcoin-ETF-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/08/Institutional-Giants-Prepare-Bitcoin-ETF-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/08/Institutional-Giants-Prepare-Bitcoin-ETF-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/08/Institutional-Giants-Prepare-Bitcoin-ETF-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/08/Institutional-Giants-Prepare-Bitcoin-ETF-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/08/Institutional-Giants-Prepare-Bitcoin-ETF-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/08/Institutional-Giants-Prepare-Bitcoin-ETF-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/08/Institutional-Giants-Prepare-Bitcoin-ETF-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/08/Institutional-Giants-Prepare-Bitcoin-ETF-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/08/Institutional-Giants-Prepare-Bitcoin-ETF-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/08/Institutional-Giants-Prepare-Bitcoin-ETF-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/08/Institutional-Giants-Prepare-Bitcoin-ETF-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/08/Institutional-Giants-Prepare-Bitcoin-ETF-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/08/Institutional-Giants-Prepare-Bitcoin-ETF-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/08/Institutional-Giants-Prepare-Bitcoin-ETF-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a historic first, U.S. exchanges witnessed a trading frenzy as the first-ever spot Bitcoin ETFs began trading. Over $4.6 billion in trading volume, representing over 700,000 individual transactions, swept across the market, marking a watershed moment for both the crypto and traditional financial worlds. Among the 11 ETF issuers, Grayscale&#8217;s dominance was undeniable. Its [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/spot-bitcoin-etfs-trading-debut-4-6b-traded-700k-transactions/\">Spot Bitcoin ETFs Trading Debut: $4.6B Traded, 700K Transactions</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]