[
  {
    "source": "Cointelegraph",
    "date": "2024-01-24T11:44:12.000Z",
    "title": " Nexo seeks $3B in damages from Bulgaria over dropped investigation ",
    "url": "https://cointelegraph.com/news/nexo-seeks-3b-damages-bulgaria-dropped-investigation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMjY5ZTQwNTctNjAwMy00ZjYxLThiYTAtZDNlNWMwMDAxMzc0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Nexo alleges the company suffered reputational damage while its shareholders lost significant value due to the abandoned criminal investigation. </p>\n                    <p><p>Cryptocurrency lending platform Nexo is looking to claim $3 billion in damages from the Bulgarian government following failed criminal investigations.</p><p>Nexo outlined the details of its $3 billion arbitration claim against the Republic of Bulgaria in direct correspondence with Cointelegraph on Jan. 24. It has submitted a claim through the World Bank’s International Centre for Settlement of Investment Disputes (ICSID) based in Washington in the United States.</p><p>As previously <a href=\"https://cointelegraph.com/news/bulgaria-prosecutors-drop-case-nexo\">reported</a>, Bulgarian prosecutors dropped its case against Nexo in December 2023, concluding that there was no evidence of crimes commited by four Bulgarian nationals charged following a raid of Nexo’s offices at the beginning of the year.</p><p><a href=\"https://cointelegraph.com/news/nexo-seeks-3b-damages-bulgaria-dropped-investigation\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-24T12:06:26.000Z",
    "title": "Bitwise CIO says Bitcoin’s dip driven by ETF overenthusiasm, not Grayscale outflows",
    "url": "https://cryptoslate.com/bitwise-cio-says-bitcoins-dip-driven-by-etf-overenthusiasm-not-grayscale-outflows/",
    "description": "<p>Bitwise chief investment officer Matt Hougan attributed the recent decline in the crypto market to overinflated expectations regarding the potential impact of the newly launched Bitcoin exchange-traded funds (ETFs). In a Jan. 23 post on X (formerly Twitter), Hougan explained that the current market sell-off is driven by what he terms an &#8220;ETF Expectations-led&#8221; phenomenon. [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitwise-cio-says-bitcoins-dip-driven-by-etf-overenthusiasm-not-grayscale-outflows/\">Bitwise CIO says Bitcoin&#8217;s dip driven by ETF overenthusiasm, not Grayscale outflows</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-24T11:39:58.000Z",
    "title": "Bitcoin ETFs see minor net outflows of $100 million as BlackRock acquires 4,080 more Bitcoin",
    "url": "https://cryptoslate.com/insights/bitcoin-etfs-see-minor-net-outflows-of-100-million-as-blackrock-acquires-4080-more-bitcoin/",
    "description": "<p>Bitcoin ETFs in the U.S. saw inflows of around $409 million yesterday as BlackRock recorded a purchase of roughly $160 million Bitcoin by adding a further 4,080 coins to its balance. Data shared by Bloomberg analyst James Seyffart last night, Jan. 23, revealed $515 million in outflows for Grayscale with $249 million inflow from the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoin-etfs-see-minor-net-outflows-of-100-million-as-blackrock-acquires-4080-more-bitcoin/\">Bitcoin ETFs see minor net outflows of $100 million as BlackRock acquires 4,080 more Bitcoin</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-24T11:43:37.000Z",
    "title": "Altcoins react quickly to bitcoin bounce",
    "url": "https://cryptodaily.co.uk/2024/01/altcoins-react-quickly-to-bitcoin-bounce",
    "description": "Bitcoin has bounced after losing as much as 7% over Monday and Tuesday. This relief bounce has also released the altcoins from their chains, and right now the crypto market is looking a whole lot rosier. But will it last?"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T12:07:17.000Z",
    "title": "Crypto craze sweeps Europe! Binance survey reveals sky-high confidence among residents",
    "url": "https://www.cryptopolitan.com/binance-survey-reveals-crypto-confidence-in-europe/",
    "description": "As traditional financial paradigms continue to be challenged, a recent survey conducted by Binance, one of the world&#8217;s leading crypto exchanges, has uncovered a remarkable surge in confidence among European residents regarding the future of digital assets.&#160; The findings from the survey are based on a total of 10,498 respondents. The survey took place on [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T12:04:05.000Z",
    "title": "Deutsche Bank survey reveals split views on Bitcoin’s future",
    "url": "https://www.cryptopolitan.com/deutsche-bank-survey-reveals-view-on-bitcoin/",
    "description": "A recent survey conducted by Deutsche Bank Research has unveiled a range of forecasts for Bitcoin&#8217;s value by the end of 2024, highlighting the mixed sentiments among investors and analysts in the cryptocurrency market. The survey, conducted in January 2024, has revealed a lack of consensus on the future direction of Bitcoin’s price. Varied expectations [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T12:00:00.000Z",
    "title": "Ethereum (ETH) and Pandoshi (PAMBO) Poised to Ignite the Upcoming Bull Run",
    "url": "https://www.cryptopolitan.com/ethereum-eth-and-pandoshi-pambo-poised-to-ignite-the-upcoming-bull-run/",
    "description": "The cryptocurrency is bubbling with anticipation of the next Bull Run. While no one is sure when it will start, everyone feels it is just a few months away or soon. Investors are looking forward to it and trying to find tokens that could ignite it. Thus far, Ethereum (ETH) and Pandoshi (PAMBO) have emerged [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-24T11:59:22.000Z",
    "title": "Treasury expands sanctions against Gaza-based crypto exchanges",
    "url": "https://crypto.news/treasury-expands-sanctions-against-gaza-based-crypto-exchanges/",
    "description": "The U.S. Department of the Treasury’s Office of Foreign Assets Control (OFAC) has implemented a fifth set of sanctions on Hamas since the October 7 terrorist attack on Israel. In a press release on Jan. 22, the U.S. Treasury Department&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-24T11:47:12.000Z",
    "title": "Nexo seeks $3b from Bulgarian authorities over aborted investigation",
    "url": "https://crypto.news/nexo-seeks-3b-from-bulgarian-authorities-over-aborted-investigation/",
    "description": "Cryptocurrency lender Nexo is demanding $3 billion in damages from Bulgarian authorities. According to Reuters, Nexo wants to recover $3 billion in connection with a stalled criminal investigation derailing its plans for a U.S. stock market listing and a soccer&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-24T12:00:07.000Z",
    "title": "Bitcoin Goes To The Doctor: 5 Key Metrics For BTC In 2024",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-goes-to-the-doctor-5-key-metrics-for-btc-in-2024/",
    "description": "The Bitcoin network and its underlying assets have evolved since its launch in 2009, and keeping up with the changes and updates can be challenging. In a post, financial strategist Lyn Alden broke down five key metrics to help BTC investors assess the network&#8217;s current state.    Related Reading: Bitcoin Price Drops Sub $39,000 – 3 Key Reasons Beyond Price: A Look At The Bitcoin Network Vitality As Lyn Alden suggests, a deeper dive into the Bitcoin network is essential for any investor. This approach offers a more nuanced understanding of Bitcoin&#8217;s status, moving past the &#8220;superficialities of price fluctuations&#8221; to gauge its true potential and challenges. Alden claims that price may not capture the complete story but remains a critical signal of adoption and market positioning. Bitcoin competes not just with other cryptocurrencies but also with traditional assets like gold and fiat currencies. Its fluctuating price reflects its relative youth and volatility compared to more established currencies. However, its fixed supply of 21 million Bitcoin provides an alternative to the constantly inflated supply of fiat currencies, such as the US dollar. The analyst stated: The Bitcoin network itself might be serving as a heartbeat of clockwork order in a world of chaos, but price is nonetheless a measure of its adoption. Bitcoin has consistently shown an upward trend, historically making it one of the best-performing assets, as seen in the chart below. The uptrend in the BTC price shows that the project has successfully operated as an alternative to traditional forms of money. A key aspect to consider is liquidity – how much daily trading volume occurs and how much transaction value is circulated on-chain. High liquidity indicates a robust, widely used network. On the latter, Alden pointed out: (&#8230;) now that bitcoin has billions of dollars of trading volume, there are trillion-dollar pools of capital that can’t put meaningful percentages into it; it’s still too small and illiquid for them. If they start putting a few hundred million dollars or a couple billions of dollars per day into it, that’s enough to tilt the supply/demand toward the buy side and seriously inflect the price upward. Since inception, the Bitcoin ecosystem has had to achieve certain levels of liquidity before it even gets on the radar of bigger pools of capital. It’s like leveling up. The narrative surrounding Bitcoin is ever-evolving. It&#8217;s been viewed as both a payment method and a savings tool, reflecting its multifaceted utility. The balance between these functions – being able to execute transactions globally while serving as a reliable store of value – is vital. The growing number of conversion points, where Bitcoin can be exchanged for goods, services, or fiat currencies, plays a crucial role in its adoption and practical use. Bitcoin&#8217;s fundamental value proposition lies in its security and decentralization. The network must remain resilient against attacks and maintain its decentralized nature to continue being a credible and valuable digital asset. Despite facing technical challenges and bugs in its history, Bitcoin has demonstrated remarkable robustness, maintaining 100% uptime since 2013. What About The Bitcoin User? As Bitcoin evolves, so does the ease of its use. Developing user-friendly hardware wallets, improved software interfaces, and increased Bitcoin ATMs have significantly enhanced the user experience. This evolution is critical for Bitcoin’s wider adoption beyond tech-savvy individuals to the general public. On this key metric, Alden points to the progress in BTC hardware wallets, which allow people to store their private keys while maintaining the usability of their coins. Setting up a BTC wallet is becoming easier and will likely continue moving in that direction. The legal landscape surrounding Bitcoin varies significantly across different jurisdictions. While some governments have embraced it, others remain skeptical. However, Bitcoin&#8217;s global nature offers a kind of resilience to localized regulatory challenges. Its decentralized nature makes it a formidable entity to regulate or ban effectively. In conclusion, while challenges in miner decentralization and user experience persist, the overall trend is positive. Alden believes the network continues to grow in liquidity, technical robustness, and global acceptance. Related Reading: Bitcoin Long Positions Surge On Bitfinex: Whales Add 4,230 BTC, Signaling Potential Price Reversal For investors and enthusiasts alike, Bitcoin remains a &#8220;dynamic and promising field, ripe with opportunities for growth and innovation.&#8221; As Alden points out, Bitcoin’s open-source nature invites continuous refinement and enhancement, making it a &#8220;resilient and adaptive digital asset.&#8221; Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-24T12:00:14.000Z",
    "title": "Memecoins Drop by Over 20% as $BTC Stumbles; $GFOX Presale Keeps Upward Momentum",
    "url": "https://www.crypto-news-flash.com/memecoins-drop-by-over-20-as-btc-stumbles-gfox-presale-keeps-upward-momentum/?utm_source=rss&utm_medium=rss&utm_campaign=memecoins-drop-by-over-20-as-btc-stumbles-gfox-presale-keeps-upward-momentum",
    "description": "<img width=\"512\" height=\"512\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-24T090213.345.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-24T090213.345.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-24T090213.345-300x300.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-24T090213.345-150x150.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-24T090213.345-450x450.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-24T090213.345-24x24.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-24T090213.345-48x48.jpg 48w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-24T090213.345-96x96.jpg 96w\" sizes=\"(max-width: 512px) 100vw, 512px\" />FTX has come back from the grave to upset markets once more, selling huge volumes of its $GBTC shares. Other investors who have been locked in Grayscale’s Bitcoin Trust are similarly taking advantage of the conversion to exit their positions. More than $2 billion worth of $GBTC has been sold since the approval. These outflows [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-24T11:54:59.000Z",
    "title": "BlackRock Swerves Away from XRP ETF Launch Amidst Ongoing SEC vs. Ripple Battle",
    "url": "https://www.crypto-news-flash.com/blackrock-swerves-away-from-xrp-etf-launch-amidst-ongoing-sec-vs-ripple-battle/?utm_source=rss&utm_medium=rss&utm_campaign=blackrock-swerves-away-from-xrp-etf-launch-amidst-ongoing-sec-vs-ripple-battle",
    "description": "<img width=\"1792\" height=\"1024\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-15-12.07.58-An-abstract-representation-of-BlackRock-holding-a-significant-amount-of-Bitcoin-symbolized-by-a-large-imposing-building-or-entity-labeled-BlackRock.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-15-12.07.58-An-abstract-representation-of-BlackRock-holding-a-significant-amount-of-Bitcoin-symbolized-by-a-large-imposing-building-or-entity-labeled-BlackRock.png 1792w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-15-12.07.58-An-abstract-representation-of-BlackRock-holding-a-significant-amount-of-Bitcoin-symbolized-by-a-large-imposing-building-or-entity-labeled-BlackRock-300x171.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-15-12.07.58-An-abstract-representation-of-BlackRock-holding-a-significant-amount-of-Bitcoin-symbolized-by-a-large-imposing-building-or-entity-labeled-BlackRock-1200x686.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-15-12.07.58-An-abstract-representation-of-BlackRock-holding-a-significant-amount-of-Bitcoin-symbolized-by-a-large-imposing-building-or-entity-labeled-BlackRock-768x439.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-15-12.07.58-An-abstract-representation-of-BlackRock-holding-a-significant-amount-of-Bitcoin-symbolized-by-a-large-imposing-building-or-entity-labeled-BlackRock-1536x878.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-15-12.07.58-An-abstract-representation-of-BlackRock-holding-a-significant-amount-of-Bitcoin-symbolized-by-a-large-imposing-building-or-entity-labeled-BlackRock-150x86.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-15-12.07.58-An-abstract-representation-of-BlackRock-holding-a-significant-amount-of-Bitcoin-symbolized-by-a-large-imposing-building-or-entity-labeled-BlackRock-450x257.png 450w\" sizes=\"(max-width: 1792px) 100vw, 1792px\" />Global investment giant BlackRock opts out of launching a Ripple XRP ETF due to uncertain regulations and Ripple&#8217;s ongoing SEC lawsuit. Ripple CEO Brad Garlinghouse criticizes SEC Chair Gary Gensler, adding to tensions between the crypto industry and regulators. BlackRock, one of the largest asset managers globally, has made it clear through statements from its [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-24T12:09:06.000Z",
    "title": "Top 7 Coins With 10-100X Potential in Q1- 2024 Part – 2 ",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-7-coins-with-10-100x-potential-in-q1-2024-part-2/",
    "description": "<p>This is the second part of our 2-part series about the top 7 coins with 10-100X potential in Q1. This also sees a renewed interest in IDOs and their coins. So, we&#8217;re taking a closer look at the next 3 coins with a 10-100x potential. 1) Devomon (EVO) With Devomon we&#8217;re back to blockchain gaming. The [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-7-coins-with-10-100x-potential-in-q1-2024-part-2/\">Top 7 Coins With 10-100X Potential in Q1- 2024 Part &#8211; 2 </a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-24T12:03:25.000Z",
    "title": "BYDFi Lists 4 New ZK, DePin, and Gaming Protocols",
    "url": "https://www.altcoinbuzz.io/product-release/bydfi-lists-4-new-zk-depin-and-gaming-protocols/",
    "description": "<p>BYDFi keeps building a strong foundation for its exchange. This includes regular listings of new protocols. Their latest listings cover various crypto verticals. Diversity is key. This new round brings a zk Rollup, DePIN, and blockchain gaming protocols to the table. So, here are the 4 new protocols on BYDFi. Let&#8217;s dive in. Manta Network [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/product-release/bydfi-lists-4-new-zk-depin-and-gaming-protocols/\">BYDFi Lists 4 New ZK, DePin, and Gaming Protocols</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-24T11:48:12.000Z",
    "title": "LUKSO’s The Vault: Auto-Compounding Staking Rewards for $LYX",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/luksos-the-vault-auto-compounding-staking-rewards-for-lyx/",
    "description": "<p>This new feature allows users to stake their $LYX directly from their Universal Profile or wallet. &#8220;The Vault&#8221; simplifies the staking process, eliminating the need for complicated procedures and intermediaries. Let&#8217;s explore more about this important feature Seamless $LYX Rewards Await Users can now stake their $LYX with ease, directly from their Universal Profile or [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/luksos-the-vault-auto-compounding-staking-rewards-for-lyx/\">LUKSO&#8217;s The Vault: Auto-Compounding Staking Rewards for $LYX</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]