[
  {
    "source": "Cointelegraph",
    "date": "2024-03-08T12:21:23.000Z",
    "title": " Ethena becomes highest earning DApp in crypto ",
    "url": "https://cointelegraph.com/news/ethena-highest-earning-dapp-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvOGM1ZWFmYjMtZjJmYS00NzI3LWI2YWItMWM0YzAxYmNlOTQwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ethena’s USDe yield is currently offering over 67% APY for investors.</p>\n                    <p><p data-ct-non-breakable=\"true\">Ethena has become the highest-earning decentralized application (DApp) after breaching $6.8 million in daily cumulative revenue over the past week, according to a March 8 X post by Seraphim Czecker, head of growth at Ethena Labs.</p><p>The only two blockchains that surpassed Ethena’s revenue were Tron, with $38.6 million, and Ethereum, with a $182.5 million daily cumulative revenue over the past seven days.</p><p>Ethena currently offers a 67.2% yield on its USDe synthetic dollar to over 350,000 users, according to its <a href=\"https://www.ethena.fi/\" target=\"_blank\" rel=\"noopener nofollow\">homepage</a>. The market cap of Ethena’s USDe rose 43% over the past week and 409% over the past month, to $840 million, according to DefiLlama <a href=\"https://defillama.com/stablecoin/ethena-usde\" target=\"_blank\" rel=\"noopener nofollow\">data</a>.</p><p><a href=\"https://cointelegraph.com/news/ethena-highest-earning-dapp-crypto\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-08T12:10:15.000Z",
    "title": "High volatility drives spot Bitcoin volume to $26 billion",
    "url": "https://cryptoslate.com/insights/high-volatility-drives-spot-bitcoin-volume-to-26-billion/",
    "description": "<p>Quick Take Recent Glassnode&#8217;s data captures intriguing shifts in Bitcoin&#8217;s spot volume, tracking the aggregate trading volume of Bitcoin against USD-based currencies, both fiat and stablecoin, across various exchanges. On March 5, there was a surge in spot volume to $26 billion across all exchanges, a pinnacle not reached since the SVB collapse in March [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/high-volatility-drives-spot-bitcoin-volume-to-26-billion/\">High volatility drives spot Bitcoin volume to $26 billion</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-08T12:18:36.000Z",
    "title": "Dog wif hat (WIF), Pepe (PEPE), and Bonk (BONK) ride the next crazy crypto wave",
    "url": "https://cryptodaily.co.uk/2024/03/dog-wif-hat-wif-pepe-pepe-and-bonk-bonk-ride-the-next-crazy-crypto-wave",
    "description": "Memecoins are making the most of bitcoin’s current strength. When bitcoin and the crypto market are having success, memecoins ride the crest of the wave. $WIF, $PEPE, and $BONK are leading the charge."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-08T12:30:03.000Z",
    "title": "Australian Crypto Love: Value of Digital Assets Held in Super Funds Surges Past $650 Million",
    "url": "https://news.bitcoin.com/australian-crypto-love-value-of-digital-assets-held-in-super-funds-surges-past-650-million/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_1875737677-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Australian Crypto Love: Value of Digital Assets Held in Super Funds Surges Past $650 Million\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_1875737677-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_1875737677-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_1875737677-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_1875737677-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_1875737677-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_1875737677-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/shutterstock_1875737677.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In just three years, Australian self-managed super funds saw the value of their respective crypto asset holdings rise from just over $159 million to over $650 million. According to an executive with a local crypto exchange, many Australians are seeking to &#x201C;allocate at least a percentage of their retirement funds to cryptocurrencies.&#x201D; Crypto Assets Held [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-08T12:20:42.000Z",
    "title": "France Leads with AI Surveillance for Olympics",
    "url": "https://www.cryptopolitan.com/france-leads-with-ai-for-olympics/",
    "description": "France recently conducted a successful trial run of Artificial Intelligence-driven video surveillance technology during a Depeche Mode concert.&#160; The exercise served as a litmus test for the forthcoming Olympic Games, showcasing the efficacy of the AI-powered surveillance system.&#160; The trial&#8217;s success underscores the nation&#8217;s commitment to leveraging advanced technology to bolster security measures during large-scale [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-08T12:19:01.000Z",
    "title": "Why Community Engagement is Important in the Metaverse",
    "url": "https://www.cryptopolitan.com/why-community-engagement-is-important-in-the-metaverse/",
    "description": "In the last few years, the Metaverse has become a buzzword. It has been capturing the attention of futurists, engineers, gamers, content creators, and professionals from nearly every industry. After all, it seemingly promises infinite possibilities for entertainment, retail, commerce, education, social interaction, and more.&#160; It is due to this rising interest that the Metaverse [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-08T12:17:58.000Z",
    "title": "Exclusive: Insider Predicts BEFE Coin Will Soar to $1 in 2024?",
    "url": "https://www.cryptopolitan.com/exclusive-insider-predicts-befe-coin-will-soar-to-1-in-2024/",
    "description": "BEFE Token in the meme token’s segment, is aspiring to revamp the reputation of cryptocurrency with its unique approaches and shows incredible rising potential. Being in the middle of this clutter of derivative coins such as Doggy, SHIBFloki, and PEPE, BEFE hands us the torch of the absolute meme coins’ tribe. Unlike its previous ancestors, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-08T12:17:55.000Z",
    "title": "Crypto Whales Loading Up on Bitgert Coin – Is a Price Surge Imminent?",
    "url": "https://www.cryptopolitan.com/crypto-whales-loading-up-on-bitgert-coin-is-a-price-surge-imminent/",
    "description": "Crypto whales or in simple words investors who look for potential projects and hodl a big chunk of it to protect their funds from inflation and meanwhile enjoy compounding. Being big whales in the digital ocean, these investors have the potential to influence the price of any crypto coin with bulk buy and sell. Recently, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-08T12:12:16.000Z",
    "title": "FOMO Alert: Altcoins Primed to Surpass Meme Tokens’ Rally Next Week",
    "url": "https://www.cryptopolitan.com/fomo-alert-altcoins-primed-to-surpass-meme-tokens-rally-next-week/",
    "description": "Following Bitcoin&#8217;s recent ascent to a record high of $69,324, the crypto market has undergone a notable correction, with meme coins particularly bearing the brunt of the losses. This downturn has, however, paved the way for a discernible shift in investor sentiment, with liquidity increasingly flowing towards altcoins that boast solid fundamentals. In this changing [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-08T12:11:08.000Z",
    "title": "Shiba Inu’s Substantial Growth Indicates the Kickoff – Top Cryptos for the Bull Run",
    "url": "https://www.cryptopolitan.com/shiba-inus-substantial-growth-indicates-the-kickoff-top-cryptos-for-the-bull-run/",
    "description": "The cryptocurrency market recently surged, led by meme coins like Shiba Inu (SHIB), which saw a remarkable 385% price increase. Shiba Inu (SHIB) introduced SHIB Names, similar to Ethereum Name Service, allowing users to attach recognizable labels to wallet addresses, simplifying DeFi interactions. Despite a 30% price drop, SHIB Names&#8217; launch boosted speculative trading, with [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-08T12:24:23.000Z",
    "title": "AI Crypto Tokens Like Render, WorldCoin Are ‘Overvalued’: Coinbase Research",
    "url": "https://www.newsbtc.com/news/ai-crypto-render-worldcoin-overvalued-coinbase/",
    "description": "In their report, &#8220;Crypto&#8217;s AI Mirage,&#8221; Coinbase Research has issued a nuanced examination of the intersection between artificial intelligence (AI) and crypto, revealing a landscape fraught with overvaluation and speculative fervor. David Han, an Institutional Research Analyst at Coinbase, spearheads this analysis, providing a critical lens through which the future of AI crypto tokens is scrutinized. AI Crypto Tokens Lack &#8216;Persistent Demand Drivers&#8217; At the heart of the report is the assertion that the crypto-AI domain, despite its rapid expansion and the enthrallment it enjoys from investors and the public alike, confronts substantial obstacles that might thwart its adoption in the foreseeable future. &#8220;AI tokens have been buoyed by the broader crypto and AI markets but may lack persistent demand drivers in the short to medium term,&#8221; Han states, underscoring the precarious foundation on which these tokens&#8217; valuations might rest. One of the report&#8217;s pivotal insights is the critique of decentralization as a standalone merit for AI products within the crypto sphere. &#8220;We generally think that decentralization is an insufficient competitive advantage for an AI product on its own – it must reach feature parity with centralized counterparts in certain other key areas as well,&#8221; the report elaborates. This perspective challenges the prevailing narrative that decentralization inherently confers superiority, arguing instead for a balanced approach that considers other critical factors for success. Related Reading: Fetch.AI (FET) Price Gains Another 15% Following This Big News The analysis further articulates a &#8220;contrarian view&#8221; on the value potential of many AI tokens, suggesting that the market&#8217;s exuberance may be misaligned with the actual prospects of these ventures. &#8220;Our view is that the value potential for many AI tokens may be overstated&#8230; and that many AI tokens may lack sustainable demand side drivers in the short to medium term,&#8221; Han explains. This cautionary stance is informed by the rapid evolution of AI technology, which poses a double-edged sword—while advancing the field, it also raises the barrier for crypto-based innovations to disrupt existing markets. Delving into the categorization of AI and crypto intersections, the report differentiates between AI applications that enhance the crypto industry and those aimed at disrupting traditional AI pipelines through decentralized methods. It acknowledges the clear benefits and potential for long-term promise in the former category. In contrast, it casts doubt on the latter&#8217;s value proposition, highlighting the formidable challenges posed by market competition and regulatory hurdles. Just Speculative Gambles? Despite these challenges, the report notes a paradox where AI tokens have outperformed benchmarks such as bitcoin, ether, and even major AI equities like Nvidia and Microsoft since the fourth quarter of 2023. &#8220;AI tokens generally benefit from strong associated performance in both the broader crypto market as well as related AI news headlines,&#8221; the report observes, suggesting that these tokens can act as proxies for AI progress, albeit potentially detached from their actual utility or adoption metrics. However, the speculative nature of this market is not lost on Coinbase Research, which warns of the risks associated with memetic speculation absent clear adoption forecasts. &#8220;A lack of clear adoption forecasting and metrics have enabled a wide range of memetic speculation which may not be long-term sustainable,&#8221; Han remarks, highlighting the precarious balance between price and utility in the AI token market. Related Reading: Crypto Analyst Unveils Top AI Trend And Coins This Bull Run In its concluding remarks, the report emphasizes the need for a judicious approach to navigating the crypto-AI landscape. It cautions against overreliance on decentralization as a panacea and advocates for a realistic appraisal of the challenges and opportunities that lie ahead. &#8220;Crypto’s role in AI does not exist in a vacuum&#8230; Thus, supplanting centralized providers purely for the sake of &#8216;decentralization&#8217; is insufficient,&#8221; the report concludes, advocating for a more nuanced and critical examination of how crypto can genuinely contribute to the AI domain. Render And WorldCoin Under The Microscope WorldCoin emerges as a case study in the report, illustrating how AI tokens&#8217; valuations can be significantly influenced by market headlines and promotional activities, often detached from tangible developments within the project itself. &#8220;The fully diluted valuation of Worldcoin sits at $80B – similar to that of OpenAI’s $86B February 16 valuation&#8230;,&#8221; Han notes, pointing to the speculative dynamics that can inflate valuations irrespective of underlying fundamentals. He details that WorldCoin is perhaps the clearest example of AI tokens tracking AI market headlines. &#8220;It released its World ID 2.0 upgrade on December 13, 2023 that went mostly unnoticed, yet made a 50% move upwards following Sam Altman’s promotion of Worldcoin on December 15,&#8221; Han remarked, adding that &#8220;OpenAI’s Sora release on February 15, 2024 led to a nearly threefold gain in price despite no related announcements on Worldcoin’s Twitter or blog.&#8221; Regarding Render Network (RNDR), Han highlights that the decentralized computing (DeComp) sector of the crypto economy is meant to be an alternative to the centralized cloud computing model. He argues that crypto projects such as Render and Akash have benefited from the GPU supply crunch. However, he questions the long-term viability: For networks [like Render and Akash] where compute pricing can change based on supply and demand variations, it is unclear to us where persistent, usage-driven demand to native tokens will ultimately arise if supply-side growth outpaces that on the demand side. We think it’s likely that such tokenomic models may need to be revisited in the future. At press time, RNDR traded at $9.925. Featured image from iStock, chart from tradingView.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-08T12:34:43.000Z",
    "title": "Injective Launches inEVM: Revolutionizing dApp Development",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/injective-launches-inevm-revolutionizing-dapp-development/",
    "description": "<p>This initiative enables Ethereum developers to build dApps faster with lower fees. It also allows for exceptional composability between WASM and EVM environments. Let&#8217;s discover more about inEVM. Unlocking New Possibilities in dApp Development inEVM aims to extend the Ethereum ecosystem and will allow for the creation of more sophisticated, efficient, and cost-effective dApps. This [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/injective-launches-inevm-revolutionizing-dapp-development/\">Injective Launches inEVM: Revolutionizing dApp Development</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-08T12:23:49.000Z",
    "title": "Solana (SOL) Price Prediction 2024-2030: Will SOL Price Hit $250 Soon?",
    "url": "https://coinedition.com/solana-sol-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Solana-SOL-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Solana-(SOL)-Price-Prediction 2022\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Solana-SOL-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Solana-SOL-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Solana-SOL-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Solana-SOL-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Solana-SOL-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Aside from Bitcoin (BTC) and Ethereum (ETH), there are other digital currencies worth considering for people looking to diversify their portfolios and get experience with new cryptocurrencies, Solana (SOL) is one of them. Solana is an open-source, public blockchain that facilitates the use of smart contracts, decentralized applications (dApps), and NFTs (non-fungible tokens). The SOL [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/solana-sol-price-prediction/\">Solana (SOL) Price Prediction 2024-2030: Will SOL Price Hit $250 Soon?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-08T12:20:00.000Z",
    "title": "SEI Rallies on Coinbase Futures Listing News: Next Stop $1.50?",
    "url": "https://coinedition.com/sei-rallies-on-coinbase-futures-listing-news-next-stop-1-50/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SEI Rallies on Coinbase Futures Listing News: Next Stop $1.50?\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Price-Prediction-3-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Coinbase to support SEI futures, boosting investor interest ahead of March 14. SEI surges 13%, eyeing $1 mark amid rising network activity and NFT expansion. SEI&#8217;s MACD is positive, but the flattening histogram hints at a potential momentum shift. Sei (SEI) has witnessed a 13% increase in its price within the last 24 hours. Despite [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/sei-rallies-on-coinbase-futures-listing-news-next-stop-1-50/\">SEI Rallies on Coinbase Futures Listing News: Next Stop $1.50?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]