[
  {
    "source": "NewsBTC",
    "date": "2023-11-20T17:00:04.000Z",
    "title": "Shiba Inu Burn Rate Crashes 98.79% With Less Than 1 Million tokens Burned",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-burn-rate-98-79/",
    "description": "The majority of cryptocurrencies have started to turn green in terms of their price movement, which has led to Shiba Inu seeing gains of 2% over the past 24 hours. In spite of the modest increase in price, the SHIB burn rate seems to have taken a massive nosedive.  According to the official SHIB burn tracker, Shibbburn, only 983,884 SHIB tokens were burned in the last 24 hours, representing a decline of over 99% from the previous day. A significant reduction of this kind in the burn rate is guaranteed to raise concerns from investors on the likelihood of downward pressure on SHIB&#8217;s price in the short term.  SHIB Burn Rate Plummets 98.79% The primary purpose of the Shiba Inu burning is to reduce the amount of SHIB tokens in circulation, hence fostering scarcity and subsequently driving up the value of SHIB tokens in circulation. SHIB tokens are burned sporadically, with some days witnessing more token burn than others. For example, the first SHIB burn on Shiba Inu&#8217;s layer-2 solution Shibarium amounted to 97 Million SHIB tokens. Related Reading: Argentina Welcomes First Pro-Bitcoin President, BTC Price Surges Above $37,000 According to the Shibburn website, a total of 983,884 SHIB tokens were burnt in the past 24 hours in three transactions, with the most being 42,850 SHIB tokens transferred to an inactive wallet. This figure translates to a 98.79% decrease in the number of tokens burned, a significant decline compared to the prior days. Source: Shibburn To put this into perspective, a total of 81.26 million SHIB tokens were burnt yesterday, and more than 49.76 million SHIB tokens were burnt two days ago. Implications For Shiba Inu Investors SHIB tokens can be burnt by any investor by sending tokens to any of the three SHIB burn addresses. According to the Shiba Inu community&#8217;s marketing lead, SHIB burns are a community effort. Data from the Shibburn website shows that more than 410 trillion SHIB tokens have been burnt from the initial supply.  Related Reading: Crypto Analyst Predicts XRP Price Will Reach $1.35 As These Metrics Heat Up This trend of the reduction in SHIB burn rate seems to have been going on for a while, as interest seems to be waning since the burn seems to have no effect on the price. As records from Shibburn show, October saw a decline of 37.12% in SHIB burns when compared to September. The burn rate performance slowed down throughout the month, despite the cryptocurrency&#8217;s price spiking more than 17% from its October bottom. SHIB is currently trading at $0.000008687, still up by 23.75% in the past 30 days. SHIB&#8217;s journey to $1 seems bleak at the moment, considering there are more than 589 trillion SHIB in circulation. SHIB burns will have to play an important part before the cryptocurrency can reach the $1 mark as they will help to decrease the total supply. SHIB price at $0.00000868 &#124; Source: SHIBUSD On Tradingview.com Featured image from CoinGecko, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-20T17:02:55.000Z",
    "title": "Pepe Coin Rockets as Devs Inject 400 Billion PEPE Tokens into Binance",
    "url": "https://www.crypto-news-flash.com/pepe-coin-rockets-as-devs-inject-400-billion-pepe-tokens-into-binance/?utm_source=rss&utm_medium=rss&utm_campaign=pepe-coin-rockets-as-devs-inject-400-billion-pepe-tokens-into-binance",
    "description": "<img width=\"990\" height=\"1146\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Screenshot-2023-10-26-at-11.15.57.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Screenshot-2023-10-26-at-11.15.57.png 990w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Screenshot-2023-10-26-at-11.15.57-259x300.png 259w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Screenshot-2023-10-26-at-11.15.57-885x1024.png 885w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/Screenshot-2023-10-26-at-11.15.57-768x889.png 768w\" sizes=\"(max-width: 990px) 100vw, 990px\" />Pepe Coin experienced a spike in prices as the project developers deposited billions of PEPE into Binance. The tokens were sent to Binance-earn to reward users amid the Free Pepe Day Campaign. Pepe Coin (PEPE) is up by nearly 5 percent in the last 24 hours. The spike follows a large deposit on Binance by [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-20T17:00:24.000Z",
    "title": "Bitcoin Steadies at $36K Despite Major Sell-Off; InQubeta’s Bullish Trajectory Excites Investors",
    "url": "https://www.crypto-news-flash.com/bitcoin-steadies-at-36k-despite-major-sell-off-inqubetas-bullish-trajectory-excites-investors/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-steadies-at-36k-despite-major-sell-off-inqubetas-bullish-trajectory-excites-investors",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-74.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-74.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-74-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-74-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Bitcoin has recently gone through a wild up-and-down trajectory and is now holding stеady at $36,000 in spitе of a large markеt sеll-off. Meanwhile, investors have become increasingly intеrеstеd in InQubеta&#8217;s bullish trajеctory, which has excited and inspired the crypto community and placed it among the best cryptocurrеncy options. This article examines the intriguing relationship [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-20T16:56:19.000Z",
    "title": "Alchemy Pay Partners with Stellar (XLM): A Game-Changer for Crypto Accessibility",
    "url": "https://www.crypto-news-flash.com/alchemy-pay-partners-with-stellar-xlm-a-game-changer-for-crypto-accessibility/?utm_source=rss&utm_medium=rss&utm_campaign=alchemy-pay-partners-with-stellar-xlm-a-game-changer-for-crypto-accessibility",
    "description": "<img width=\"1280\" height=\"850\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Instant Payments\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-1024x680.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-768x510.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />It&#8217;s now possible for any company building on the Stellar blockchain to use Alchemy Pay for their on and off-ramp needs after the latter joined one of the largest blockchain networks. Users will access some of the lowest fees when making crypto-fiat conversions through the platform&#8217;s APIs and plugins, further strengthening the Stellar ecosystem. One [...]"
  }
]