[
  {
    "source": "Cointelegraph",
    "date": "2023-06-19T13:01:00.000Z",
    "title": "Slow Food: Kenny Schachter reflects on blockchain art’s past, present and future",
    "url": "https://cointelegraph.com/news/slow-food-kenny-schachter-reflects-on-blockchain-art-s-past-present-and-future",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/3b604024-5167-48fc-b9bf-0af555629162.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>NFTs might never boom at quite the same pitch they once did. With his first solo show in 25 years, Kenny Schachter sought to demonstrate how that’s a good thing.</p>\n                    <p><p>With crypto in a state of turbulent flux, a demographic of nonfungible token (NFT) detractors in the fine art world might feel trigger-happy to, at last, declare the industry down for the count. </p><p>Meanwhile, artist, critic, dealer, educator and outspoken NFT proponent Kenny Schachter is celebrating the conclusion of <a href=\"https://the-nft-gallery.io/pages/slow-food\" target=\"_blank\" rel=\"noopener nofollow\">Slow Food</a> — his first New York City art exhibition in 25 years — at The NFT Gallery on Manhattan’s Lower East Side, fresh off the heels of <a href=\"https://www.designboom.com/art/kenny-schachter-traditional-digital-art-worlds-nft-art-day-zrh-interview-06-06-2023/\" target=\"_blank\" rel=\"noopener nofollow\">headlining</a> NFT Art Day ZRH in Zurich, Switzerland, coinciding with the iconic annual Art Basel art fair, less than 50 miles away. </p><p>In June 2022, Schachter had just <a href=\"https://nagel-draxler.de/exhibition/art-basel/\" target=\"_blank\" rel=\"noopener nofollow\">presented</a> the first-ever NFT booth wall at Art Basel with Galerie Nagle Draxler, expanding the acceptance of NFTs just before profile pictures became the face of their demise. Soon after, Schachter was spotted among the art world elite in Hydra, Greece, <a href=\"https://www.pacegallery.com/journal/jeff-koons-moon-phases/\" target=\"_blank\" rel=\"noopener nofollow\">celebrating</a> zeitgeist sculptor Jeff Koon’s first token drop with Pace Gallery.</p><p>Schachter told Cointelegraph that while his commitment to the intersection of blockchain and art hasn’t faltered since then, “it’s hardened.” The contentious art-world rabble rouser hails from a working-class Long Island, New York family. He studied philosophy, then law — worked in fashion and on the stock market floor — all before stepping foot in his first art gallery in his late 20s or making his name as an art market reporter. Schachter became an artist before the millennium turned, exhibiting his first computer animation in 1993 and producing digital prints as the decade ensued. </p><p>“As far as I’m concerned, I’m involved in art,” Schachter said. “That’s all I care about, more than pretty much everything, except for perhaps my kids.” Rather than encapsulating Schachter’s full oeuvre, Slow Food, which closed on June 17, focused on the artist’s most recent blockchain forays: a collaborative, evolving rumination titled Open Book, his new blockchain-based game <em>Pop Principle</em>, and a sculpture about the insidious trend of dinosaur bones being sold through art auction houses. An NFT accompanied each artwork — underpinning them all.</p><h2>Riding out the booms and busts</h2><p>When Schachter caught wind of NFTs in 2020, he brushed them off as another form of money before recognizing solutions for difficulties dogging his practice — wrapped in a blockchain bow. </p><p>Of course, digital art had long languished in the absence of a practical means to sell and trade it. A number of galleries offering digital artworks in their booths at Art Basel as of 2022 still handed the pieces off after purchase as a file on a flash drive, authenticated based on file size. </p><p>Even before NFTs, digital art had been pigeonholed in the manner of other mediums, like performance. Although NFTs gained fame only once artists started making big money, Schachter saw a greater chance to expand his audience beyond the narrow-minded art world.</p><p>Several standalone artworks complemented Schachter’s larger projects across Slow Food, like “NFT Gimmicks,” a two-part piece including a fine art print that immortalized a snide tweet Schacter made in reply to Dot Pigeon’s April announcement that the artist was quitting NFTs due to rampant speculation — alongside the actual balaclava Schachter is seen wearing in the post.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/2334170b-1f47-4c30-9dcb-7acd0738231e.jpeg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>“NFT Gimmicks” artwork on view in Slow Food. Source: Vittoria Benzine</em></figcaption></figure><p>“First of all, he’s made millions, probably, off his NFTs,” Schachter told Cointelegraph of Pigeon’s headline-making move. “If I sell an NFT, whether it was $5 or $25,000, that’s a social contract between me and the collector. I have an obligation to support what I’ve done.” He noted that Crypto Mutts, a profile picture collection Schachter founded to mock Bored Ape Yacht Club, will likely end up in his will, to ensure the project survives after he’s not around to maintain it.</p><p>Money is nice, but Schachter swears up and down it’s not driving him — he recently opted to forego royalties from resales. Instead, the artist emphasized that his faith relies on <a href=\"https://cointelegraph.com/news/building-communities-and-ensuring-nft-success-insights-for-artists\">the community that NFTs build around his practice</a> and the connections the space lends itself to. </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/hinman-docs-xrp-sec\">The Hinman docs: Implications for XRP, SEC credibility and more</a></em></strong></p><p>The artist had to learn fast about blockchain in his efforts to get involved. He initiated a virtual mentorship with an avid NFT collector and Google executive based in Singapore. “Every two or three weeks, I would sit there like a child with a pen and a paper,” Schacter recalled of their sessions. “I ended up making an artist out of him, putting him in an NFT show I curated at Nagle Draxler in Cologne in 2021.”</p><p>Similarly, Schachter’s more far-reaching projects across “Slow Food” require people to make them function. Open Book began last summer while he was co-authoring <em>The NFT Book</em>. Inspired by the social media responses he got for input while helping pen the book, Schachter curated 20 disparate artists to contribute stances on NFTs — some positive, some critical — for Open Book. Those quotes oscillated on screens across Slow Food, with some from Schachter himself. The show allocated a room where guests could contribute before it goes live on NFT market Async Market this month.</p><p>Schachter calls the project “a book that doesn’t have an ending, nor a middle for that matter. But there’s a beginning. It tells a story of a field radically transforming in real time.”</p><h2>Playing further</h2><p>His blockchain game, <em>Pop Principle</em>, runs on the high-end digital art streaming service and collecting source Daata. It took shape in early 2022. Originally titled <em>Digital Duel: Crypto vs Canvas</em>, the game’s new iteration pits teams of vocal NFT supporters and detractors from the fine art world — artists, writers, curators, dealers and influencers — all against each other. </p><p>Each round of <em>Pop Principle</em> will introduce new teams with new characters on either side, all available to mint in open editions. Collectors mint as many of their favorite characters as they can afford to in order to support that figure and their team. Whichever team gets the most mints wins, but the real crown goes toward whichever collector holds the most copies of the winning character — that collector gets a unique Schachter sculpture in real life. To celebrate <em>Pop Principle’s</em> inaugural round, which closed June 17, the top 50 holders all received an airdropped NFT. </p><p>“The concept changed from a battle to a reflection of the fact that life — in art and beyond — has been reduced to a popularity contest,” Schachter said, “measured by likes, followers and money.” While there’s no role-playing or hand-to-hand combat, it was fun to watch art dealer Larry Gagosian, whose gallery some regard as the art world’s evil empire, lob stacks of bills at opponents like famed artists Refik Anandol and Beeple, in a montage on view at Slow Food.Sculptures of this round’s protagonists punctuated the show — Beeple greeted visitors, while teammates Anandol and Nigerian artist Osinachi conversed with the round’s sole neutral party, curator Hans Ulrich Obrist, near the show’s rear. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/dd1beea6-700f-4eb5-b04a-364e97b316fd.jpeg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">Osinachi, Obrist and Anandol sculptures at the back of Slow Food. Source: Vittoria Benzine</figcaption></figure><p>The figures all had big eyes, attention to detail and a real sense of life. They felt like Schachter’s distinct take on the infamous artist KAWS’s signature style, although artists are notoriously crabby about being compared with each other. Schachter’s go-to fabricator in China brought his digital designs to freestanding, 3D existence.</p><p>Perhaps surprisingly, David Hockney hasn’t yet factored into <em>Pop Principle</em>. In 2021, Hockney, the highest-valued painter alive, <a href=\"https://decrypt.co/63917/artist-of-worlds-most-expensive-painting-nfts-are-for-crooks-and-swindlers\" target=\"_blank\" rel=\"noopener nofollow\">called</a> NFTs “silly little things” for “crooks and swindlers.” </p><p>However, Hockney’s recent series of iPad drawings — the subject of a hyped Pace Gallery exhibition in Chelsea, Manhattan, in winter 2022 — would likely benefit from blockchain elements. </p><p>“Would you rather own a $100,000 outputted photograph,” Schachter asked, “or would you rather own the high res file from which he made it, in which case you could make a tapestry, you could make a painting in China for $100, you can make a photograph or a lightbox or projection or keep it on your phone, do whatever you want?” </p><p>That’s precisely how “Missionary Position,” a tapestry featured in Slow Food depicting Mother Theresa in a robe adorned with Ethereum insignias, came to be. Schachter got in touch with an Albanian artisan through his network, who wove his digital design into an art object.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/782a7cd4-4acd-4460-a774-2f78e03711aa.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">“Missionary Position: ETH (tapestry version)” from Slow Food. Source: Kenny Schachter</figcaption></figure><h2>Fine art recoils — even from practical applications</h2><p>NFT art might never boom at quite the same pitch it once did. Schachter says that’s a good thing. It could benefit the space by taking the focus off the very behaviors from the traditional art and finance spheres that NFT proponents claim they’re trying to buck — placing the focus back on the possibilities. Blockchain offers many practical applications relevant to fine art beyond just hype, revenue, new audiences and new understandings of art as an idea rather than an object. </p><p>For example, it can create an irrevocable record of provenance, which could foster a little more transparency about how many — and maybe whose — hands an artwork has passed through. </p><p>Why, then, are some art industry figureheads raring to dance on the blockchain’s grave?</p><p>“The art world is like a smelly dog pissing on a tree,” Schachter said. “When they see another dog coming by, the first thing they want to do is piss on the piss that the other dog just did. When the art world sees a new means, a new technology, they see platforms that fully function without their input, they get very defensive and very territorial.” </p><blockquote>“Art is a zero-sum game, generally speaking, where one person or entity succeeds at the expense of another.” </blockquote><p>More money for Nifty Gateway means less money for galleries — unless they’re creating new audiences. But art is ephemeral, relational. Prices are based on previous prices, and acclaim comes from proximity to superstars. There’s a lot at stake in the ruse that these emperors are clothed.</p><p>“When I found out about the art world, the first impression I had was people swinging from the chandelier, drinking absinthe and going to orgies,” he said. “Boy, was I in for a slap in the face.”</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/opinion-republican-crypto-maxis-democrat-anti-crypto-army-mchenry-warren/\">Opinion: GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’</a></em></strong></p><p>No matter, though. Schachter’s pressing forward. “Slow Food,” he said, was a dry run for his debut solo museum exhibition at the Francisco Carolinum in Linz, Austria, opening in September. </p><p>“Nobody offered me a fucking show when I was in the art world for 30 years,” Schachter balked. “I got offered a show and had success in the NFT space. In the art world, success affirms success. By any means necessary, will I pursue my interest and my goals.”</p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-19T12:43:32.000Z",
    "title": "Binance’s UK subsidiary withdraws FCA registration as European exodus continues",
    "url": "https://cryptoslate.com/binances-uk-subsidiary-withdraws-fca-registration-as-european-exodus-continues/",
    "description": "<p>Binance said in a June 19 email shared with CryptoSlate that the exchange&#8217;s United Kingdom subsidiary, Binance Markets Limited (BML), has canceled its registration with the country&#8217;s Financial Conduct Authority (FCA). Binance has no authorized entity in the UK According to the spokesperson, BML held various FCA permissions for activities it never carried out or [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binances-uk-subsidiary-withdraws-fca-registration-as-european-exodus-continues/\">Binance&#8217;s UK subsidiary withdraws FCA registration as European exodus continues</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-19T13:08:21.000Z",
    "title": "Millions in USDT paid for unlocking stolen iPhones as Apple refuses to act",
    "url": "https://crypto.news/millions-in-usdt-paid-for-unlocking-stolen-iphones-as-apple-refuses-to-act/",
    "description": "The cryptocurrency tether (USDT) is used for hundreds of millions of dollars worth of transactions for illicit lost and stolen iPhone unlocking services. Apple appears to have taken little action despite being alerted to the ongoing security breach in their&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-19T12:44:53.000Z",
    "title": "Ethereum’s zkSync Era reaches $500m in TVL",
    "url": "https://crypto.news/ethereums-zksync-era-reaches-500m-in-tvl/",
    "description": "Ethereum&#8217;s Layer 2 scaling solution, zkSync Era, sees its total value locked (TVL) exceed $500 million as increased scalability continues to attract significant capital investment. In decentralized finance (DeFi), the balance of power constantly ebbs and flows with the rise&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-19T12:50:25.000Z",
    "title": "US Politician Cheers Shiba Inu Price Surge, But Trend Reversal Still Pending",
    "url": "https://www.newsbtc.com/shiba-inu/us-politician-shiba-inu-price-trend-reversal-pending/",
    "description": "Shannon Bray, a gubernatorial candidate in North Carolina next year, has again expressed his love for the meme coin Shiba Inu (SHIB). On Sunday, Bray shared his delight over SHIB&#8217;s price increase last week (+8.3%). Bray encouraged the SHIB army to keep up the positive momentum and called for further action. He also urged SHIB enthusiasts to tweet about Shiba Inu throughout the day to generate ongoing excitement. Via Twitter, he wrote: Ok #shibarmy, let&#8217;s continue the lil pump from today. Tweet $shib and #SHIB all day! Build some excitement. After all, thank goodness we aren&#8217;t PEPE. They&#8217;ll never be on Robinhood. Today Bray followed up with a partial apology to PEPE holders: &#8220;Sorry $pepe holders. Didn&#8217;t mean any offence.&#8221; However, he justified his statement and explained that he does not expect Robinhood to host any other community token in the near future. &#8220;Therefore #shib has a huge advantage on market recovery. $shib is on just about every exchange. I&#8217;m hoping y&#8217;all [PEPE] pump as well,&#8221; the North Carolina gubernatorial candidate wrote. Related Reading: Shiba Inu (SHIB) Burn Rate Suffers 87% Decline In Single Week Bray already caused a stir last week when he announced via Twitter that he will buy Shiba Inu (SHIB) with his next paycheck. According to Bray, &#8220;nothing else will ever regain the traction&#8221; that Shiba Inu has accumulated. Furthermore, Bray believes that people who have left the SHIB community will return because of Robinhood&#8217;s presence. Trend Reversal For Shiba Inu Price Remains Pending Despite all the excitement about SHIB&#8217;s recent rally, it should be pointed out that the price is still in a bearish trend. A look at the 1-day chart shows that SHIB has been stuck in a descending trend channel since the local high of $0.00001588 on February 4 this year. Over the past more than four months, Shiba Inu has failed to write higher highs while the price has written lower lows. SHIB is thus stuck in a descending trend channel. At the current price of $0.00000715, SHIB is trading in the mid-range of the trend channel. For now, it is important to break this level to start a push to the upper end. The following two scenarios are conceivable: If the Shiba Inu bulls manage to break through the mid-range, the 23.6% Fibonacci retracement level at $0.00000834 comes into focus. It is likely that SHIB will first experience a retracement before the price level can be penetrated. Related Reading: Shiba Inu (SHIB) Positive Social Sentiment Sparks Bullish Speculation The Fibonacci retracement level may then also meet the upper end of the trend channel. This point in time would be crucial to initiate an uptrend. Then, all eyes would be on a new local high above $0.00000930. In a second scenario, SHIB fails to break above the mid-range of the descending trend channel. In this case, SHIB could sweep the low at $0.000006 again. If the price also breaks below this level, Shiba Inu investors should prepare for a downside price discovery. Back to the bullish case: if SHIB manages to break out of the descending trend channel in the coming weeks, the following target prices would be of significance: $0.0000098 (38.2% Fibonacci), $0.00001095 (50% Fibonacci) and $0.00001212 (61.8% Fibonacci). Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-19T13:00:27.000Z",
    "title": "3 Tokens Under $1 to create Massive Wealth for Holders in 2023: Dogecoin (DOGE), Shiba Inu (SHIB), Alex The Doge (ALEX)",
    "url": "https://www.crypto-news-flash.com/3-tokens-under-1-to-create-massive-wealth-for-holders-in-2023-dogecoin-doge-shiba-inu-shib-alex-the-doge-alex/?utm_source=rss&utm_medium=rss&utm_campaign=3-tokens-under-1-to-create-massive-wealth-for-holders-in-2023-dogecoin-doge-shiba-inu-shib-alex-the-doge-alex",
    "description": "It’s no secret that cryptocurrency investments have made many individuals incredibly wealthy. But, you don&#8217;t need to have thousands to invest &#8211; there are numerous promising tokens under $1 that offer potential for substantial returns. This article highlights three such tokens that have been making headlines in 2023: Dogecoin (DOGE), Shiba Inu (SHIB), and Alex [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-19T12:46:26.000Z",
    "title": "Prometheum Founder Predicts SEC Victory in Ripple Lawsuit: Will XRP Price Skyrocket?",
    "url": "https://www.crypto-news-flash.com/prometheum-founder-predicts-sec-victory-in-ripple-lawsuit-will-xrp-price-skyrocket/?utm_source=rss&utm_medium=rss&utm_campaign=prometheum-founder-predicts-sec-victory-in-ripple-lawsuit-will-xrp-price-skyrocket",
    "description": "Prometheum&#8217;s Aaron Kaplan compares the Ripple vs SEC case to LBRY vs SEC, predicting a victory for the Commission.  The Ripple community members as well as Attorney John Deaton question his knowledge about the case and label SEC&#8217;s argument as &#8220;erroneous&#8221;.  The Ripple vs SEC lawsuit is nearing its final ruling with both parties confident [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-19T12:55:00.000Z",
    "title": "LunarCrush Unveils Its Top Coins by One-week Altrank",
    "url": "https://coinedition.com/lunarcrush-unveils-its-top-coins-by-one-week-altrank/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Here_are_the_top_10_coins_by_LunarCrush_Galaxy_Score™_over_the_past-2-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Here_are_the_top_10_coins_by_LunarCrush_Galaxy_Score™_over_the_past-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Here_are_the_top_10_coins_by_LunarCrush_Galaxy_Score™_over_the_past-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Here_are_the_top_10_coins_by_LunarCrush_Galaxy_Score™_over_the_past-2-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Here_are_the_top_10_coins_by_LunarCrush_Galaxy_Score™_over_the_past-2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Here_are_the_top_10_coins_by_LunarCrush_Galaxy_Score™_over_the_past-2-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Here_are_the_top_10_coins_by_LunarCrush_Galaxy_Score™_over_the_past-2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Here_are_the_top_10_coins_by_LunarCrush_Galaxy_Score™_over_the_past-2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Here_are_the_top_10_coins_by_LunarCrush_Galaxy_Score™_over_the_past-2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Here_are_the_top_10_coins_by_LunarCrush_Galaxy_Score™_over_the_past-2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Here_are_the_top_10_coins_by_LunarCrush_Galaxy_Score™_over_the_past-2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Here_are_the_top_10_coins_by_LunarCrush_Galaxy_Score™_over_the_past-2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Here_are_the_top_10_coins_by_LunarCrush_Galaxy_Score™_over_the_past-2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Here_are_the_top_10_coins_by_LunarCrush_Galaxy_Score™_over_the_past-2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Here_are_the_top_10_coins_by_LunarCrush_Galaxy_Score™_over_the_past-2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Here_are_the_top_10_coins_by_LunarCrush_Galaxy_Score™_over_the_past-2-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/06/Here_are_the_top_10_coins_by_LunarCrush_Galaxy_Score™_over_the_past-2.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>LunarCrush, a crypto-enthusiast platform, has revealed its top ten coins by one-week Altrank. This metric combines market and social activity to comprehensively assess a cryptocurrency&#8217;s performance. In particular, Fantom (FTM), a rising star in the crypto market, has experienced a 4.66% increase in trading volume, reaching $63 million. With a market capitalization of $740 million [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/lunarcrush-unveils-its-top-coins-by-one-week-altrank/\">LunarCrush Unveils Its Top Coins by One-week Altrank</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]