[
  {
    "source": "Cryptopolitan",
    "date": "2024-04-06T07:57:22.000Z",
    "title": "China’s AI Threatens Election Integrity in India, US, and South Korea",
    "url": "https://www.cryptopolitan.com/chinas-ai-threatens-election-integrity/",
    "description": "With the development of AI technologies, AI is being used unethically in election filters as a threat from election influence pointed out. Microsoft forewarned that China was all set to tinker with the upcoming elections in India, the U.S., and South Korea and that they were eager to employ the help of AI-generated content. This [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-06T08:00:31.000Z",
    "title": "Cardano Price In Turmoil: Can Whales Drive ADA’s Resurrection From Recent Dump?",
    "url": "https://www.newsbtc.com/news/cardano/cardano-price-in-turmoil-can-whales-drive-adas-resurrection-from-recent-dump/",
    "description": "The Cardano price has been facing a significant amount of bearish pressure over the past week, declining by more than 12%. This recent fall coincides with a broader crypto market downturn, with other major altcoins suffering huge losses over the past week. Specifically, Cardano&#8217;s price decline has been largely linked to the recent sell-off of all ADA holdings by the Grayscale Digital Large Cap Fund (GDLC). On Thursday, April 4, the fund disclosed its decision to rebalance its portfolio by liquidating its Cardano assets (about 1.6% of the entire holdings). Registering such a negative start to April after an underwhelming performance in March doesn&#8217;t do well to dispel the increasing concerns of investors. Moreover, the latest on-chain data suggests that the Cardano price might continue to succumb to the bearish pressure. Analyst Predicts ADA Price Slump As Whale Activity Slows Down Popular crypto pundit Ali Martinez has shared a post on X that Cardano whales have been making fewer moves in the market in recent days. This revelation is based on Santiment’s Whale Transaction Count metric, which tracks the number of ADA transactions worth more than $1 million. Related Reading: Bitcoin Short-Term Holders Go On 1.2 Million BTC Buying Spree, Is Retail Finally Here? Whales refer to entities or individuals that own significant amounts of a particular cryptocurrency (Cardano, in this case). They are often viewed as key players in the market, as their buying or selling activities can have a significant impact on the Cardano price, leading to speculation and potential market shifts. According to Martinez, the on-chain data shows that there has been a noticeable dip in the activity of Cardano whales, suggesting a possible decline in significant ADA transactions. In an almost vertical move, the whale transaction count dropped from around 400 daily transactions at the beginning of last week to 200 daily transactions by Friday, April 5. Chart showing ADA whale transaction count, whale holdings, and price &#124; Source: Ali_charts/X The crypto analyst mentioned that the recent downturn in whale activity could be a signal for “further price consolidation” or an imminent decline in the Cardano price. A loss of substantial buying activity from large investors can cause the cryptocurrency to succumb to bearish pressure, especially from small traders looking to take some profit. Indeed, the Cardano token has made a positive start to the year, reaching a high of $0.8 in early March. However, the altcoin has been on a downward trend since hitting the 2024 peak &#8211; collapsing under the pressure of Bitcoin’s price decline. Cardano Price At A Glance As of this writing, the Cardano price stands at around $0.577, reflecting a 1% decline in the past 24 hours. Related Reading: Solana Primed For Takeoff? Expert Analysis Points To Buying Opportunity Cardano price hovers around $0.58 on the daily timeframe &#124; Source: ADAUSDT chart on TradingView Featured image from iStock, chart from TradingView"
  }
]