[
  {
    "source": "Crypto Daily",
    "date": "2023-08-10T20:29:54.000Z",
    "title": "France Amends Registration Requirements for Crypto Firms",
    "url": "https://cryptodaily.co.uk/2023/08/france-amends-registration-requirements-for-crypto-firms",
    "description": "<p>The French financial regulator announced amendments to its registration requirements for digital asset service providers as it prepares for MiCA&rsquo;s implementation. </p>\n<p>France&rsquo;s Autorit&eacute; des march&eacute;s financiers (AMF) announced it would introduce &ldquo;enhanced&rdquo; requirements for crypto firms as it prepared for the implementation of the EU&rsquo;s landmark Markets in Crypto Assets (MiCA) regulatory framework.</p>\nAmendments to Align with MiCA\n<p>The AMF has amended its registration requirements for digital asset service providers (DASPs) to better align with the EU&rsquo;s upcoming regulatory framework. The regulator said its &ldquo;enhanced&rdquo; requirements will take effect on January 1, 2024.</p>\n<p>In its announcement, the AMF said the changes have two objectives:</p>\n\n<p>&ldquo;to incorporate into the General Regulation and its policy the provisions applicable to DASPs subject to &ldquo;enhanced&rdquo; registration. This regime will become mandatory from January 1, 2024, for new players wishing to provide the four services subject to mandatory registration;&rdquo;</p>\n\n<p>and</p>\n\n<p>&ldquo;align the requirements for DASPs licence with those for European authorisation for crypto-asset service providers (CASPs) under the MiCA Regulation, and allow a fast track procedure to be implemented towards CASP authorisation.&rdquo;</p>\n\n<p>France already has a relatively comprehensive licensing regime for crypto firms and is implementing changes to its regulation to comply with MiCA which will take effect within the next 12 &ndash; 18 months.</p>\nEU Signs MiCA Into Law\n<p>The European Union announced in May that it formally signed MiCA into law. MiCA has been in the works for a long time and will introduce a comprehensive framework for licensing and regulating crypto businesses operating within the EU.</p>\n<p>France has been one of the most welcoming countries for regulating the crypto sector. The governor of the Bank of France called for a stricter and more comprehensive licensing regime for crypto companies after 2022&rsquo;s market turmoil.</p>\n<p>Recognising the need for heightened regulatory scrutiny, the French National Assembly voted on new measures for crypto regulation, including a new set of compliance frameworks for new crypto firms seeking registration in France.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T20:35:05.000Z",
    "title": "Global crypto regulation takes a different turn in Q2 2023",
    "url": "https://www.cryptopolitan.com/crypto-regulation-takes-a-turn-in-q2-2023/",
    "description": "Just when investors thought they had the crypto rulebook figured out, Q2 2023 swoops in with a plot twist even the most seasoned regulators didn&#8217;t see coming. It&#8217;s as if crypto regulation entities such as the SEC decided to trade its traditional playbook for a pair of roller skates – unexpected, a bit wobbly, but ... <a title=\"Global crypto regulation takes a different turn in Q2 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-regulation-takes-a-turn-in-q2-2023/\" aria-label=\"More on Global crypto regulation takes a different turn in Q2 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T20:34:51.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain‘s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T20:20:12.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-10T20:31:42.000Z",
    "title": "Coinbase invests in Rocket Pool, RPL rises 8%",
    "url": "https://crypto.news/coinbase-invests-in-rocket-pool-rpl-rises-8/",
    "description": "Coinbase Ventures, the investment wing of the cryptocurrency exchange, Coinbase, has invested in the liquid staking platform, Rocket Pool"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-10T20:15:09.000Z",
    "title": "Binance US failed to produce accounting statements despite extension",
    "url": "https://crypto.news/binance-us-failed-to-produce-accounting-statements-despite-extension/",
    "description": "Binance US, following a court order to provide accounting statements, cited complexity as the reason for an extension; however, they have not yet supplied the requested statements"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-10T20:39:00.000Z",
    "title": "Analysts Identify Bitcoin Whales to be Behind the Recent Rally",
    "url": "https://coinedition.com/analysts-identify-bitcoin-whales-to-be-behind-the-recent-rally/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to Buffinton of the Altcoin Buzz YouTube channel, multiple analysts identified Bitcoin whales to be behind the recent price surge. He quoted Material Indicators, a crypto market data service provider, that identified Purple Whales’ decision to convert a $20 million Bitcoin bid ladder into market orders as the trigger to the recent price rally. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/analysts-identify-bitcoin-whales-to-be-behind-the-recent-rally/\">Analysts Identify Bitcoin Whales to be Behind the Recent Rally</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]