[
  {
    "source": "Cointelegraph",
    "date": "2024-01-02T13:56:21.000Z",
    "title": " Grayscale’s latest spot Bitcoin ETF amendment omits authorized participants  ",
    "url": "https://cointelegraph.com/news/grayscale-latest-bitcoin-etf-amendment-omits-authorized-participants",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYmZhNTJkYmUtOWUxOS00Mzc3LTg3MDItOGVkY2VhM2RhNzNlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Grayscale filed its latest amended spot Bitcoin ETF application with the SEC but left out details of authorized participants permitted to create and redeem shares.</p>\n                    <p><p>Cryptocurrency asset manager Grayscale has <a href=\"https://www.sec.gov/Archives/edgar/data/1588489/000119312523306046/d118708ds3a.htm\" target=\"_blank\" rel=\"noopener nofollow\">filed an amended</a> Bitcoin exchange-traded fund (ETF) application without listing authorized participant details.</p><p>Bloomberg’s senior ETF analyst Eric Balchunas flagged the amended filing on X (formerly Twitter), noting that the company had clarified that authorized participants in its proposed ETF could only pay and receive cash for shares.</p><p>Balchunas commented further, indicating that it was unclear why Grayscale had deliberately omitted its authorized participants while other firms had clarified these details.</p><p><a href=\"https://cointelegraph.com/news/grayscale-latest-bitcoin-etf-amendment-omits-authorized-participants\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-02T13:45:08.000Z",
    "title": "Salus Publishes 2023 Web3 Security Landscape Report",
    "url": "https://cryptodaily.co.uk/2024/01/salus-publishes-2023-web3-security-landscape-report",
    "description": "Salus's 22023 Web3 Security Landscape Report highlights more than $1.7 billion in losses due to access control problems, phishing, flash loan attacks, and reentrance."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-02T13:46:13.000Z",
    "title": "Mickey Mouse’s Evolution and Copyright Status: A Clear Distinction",
    "url": "https://www.cryptopolitan.com/mickey-mouses-evolution-and-copyright-status/",
    "description": "In a significant development at the beginning of this year, Mickey Mouse&#8217;s early rendition of the iconic Steamboat Willie has entered the public domain. However, it&#8217;s crucial to note that this doesn&#8217;t mean Disney&#8217;s modern interpretations of the beloved character are up for grabs. Public domain entry of Steamboat Willie Mickey Mouse At the turn [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-02T13:46:01.000Z",
    "title": "Jeremy Hogan shares essential tax guidance for crypto holders ",
    "url": "https://www.cryptopolitan.com/jeremy-hogan-shares-essential-tax-guidance/",
    "description": "Jeremy Hogan, a prominent legal expert in the XRP community, recently highlighted the tax implications of cryptocurrency trading, specifically addressing the strategies many digital currency investors employ. In a series of posts on a popular social media platform, Hogan highlighted the vital differences between short-term and long-term capital gains taxes and how these can impact [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-02T13:45:19.000Z",
    "title": "Web3 Projects Face Substantial $2.02 Billion Losses In 2023 Due To Security Breaches",
    "url": "https://nulltx.com/web3-projects-face-substantial-2-02-billion-losses-in-2023-due-to-security-breaches/",
    "description": "The escalating risks to the security of web3 have become significant concerns for the future of this decentralized internet paradigm. Beyond the financial implications, the losses incurred from hacking attempts on web3 and smart contracts have cast doubts on the dependability of this emerging technology.  Globally, the perception of web3 [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-02T13:52:26.000Z",
    "title": "The token that lived: how Solana project rose from the ashes",
    "url": "https://crypto.news/the-token-that-lived-how-solana-project-rose-from-the-ashes/",
    "description": "Solana (SOL) showed the best performance among the top 10 digital assets by capitalization. What caused this rapid growth following a significant decline?"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-02T13:46:53.000Z",
    "title": "The Graph and Injective Protocol rally, YPRED looks bullish",
    "url": "https://crypto.news/the-graph-and-injective-protocol-rally-ypred-looks-bullish/",
    "description": "The Graph (GRT) and Injective Protocol (INJ)  are firm. Meanwhile, a new AI project yPredict is nearing the end of its presale with $300K left to raise"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-02T14:00:33.000Z",
    "title": "Crypto Analyst Predicts XRP Price Breakout To $22.39, Here’s When",
    "url": "https://www.newsbtc.com/xrp-news/crypto-analyst-xrp-price-breakout-heres-when/",
    "description": "The XRP price has been languishing in a protracted consolidation phase recently. Yet, a recently presented technical forecast by chart specialist Egrag Crypto suggests an impending shift in this trend may be on the horizon. The 5-day XRP/USD chart shared by Egrag suggests a potential price breakout, with a long-term price target above $22. Egrag&#8217;s commentary is vivid and emphatic: &#8220;XRP: IT IS BREWING: The chart for XRP is tightening up like a pressure cooker ready to blow! An eruption seems inevitable, and the anticipation is rising faster than ever. XRP Army STAY STEADY, The pressure is mounting, and it looks like something massive is about to break loose!&#8221; XRP Price Breakout Is Brewing &#8211; Here&#8217;s When The chart features a symmetrical triangle pattern. This pattern in technical analysis often represents a consolidation period preceding a breakout. Since early 2017, the XRP price has been fluctuating within these converging trend lines, suggesting a tightening range that typically precedes significant price movements. Related Reading: XRP Price Poised To Hit $20,000: Chad Steingraber Theory Outlines How Moreover, Egrag Crypto points to a number of Fibonacci retracement levels. According to the chart, these levels are poised to act as key resistance points. The most immediate level to watch is the 0.5 Fibonacci level at approximately $0.7579, followed by the 0.618 level at around $1.1150. The chart indicates a bullish scenario where the price could break past these levels, aiming for a target at $1.9704, corresponding to the 1 Fibonacci level. Egrag also presents two possible scenarios for the price breakout from the symmetrical triangle. In the first scenario, he anticipates the XRP price could break out of the pattern around February 10, requiring a breach above the 0.5 Fibonacci retracement level. This move would pave the way for targeting the $1.1150 level, expecting strong resistance there and a subsequent retest of the breakout level, potentially setting up for a parabolic rise into 2025. Related Reading: XRP Price Surge: Crypto Analyst Predicts Various Bullish Scenarios In The Coming Days Alternatively, Egrag suggests a scenario where the XRP price initially declines towards the lower trend line. If the support holds, the price could ascend towards the upper trend line, with a breakout expected around July 4, 2024, at the 0.5 Fibonacci level. Following this, the 0.702 Fibonacci level at $1.1150 would act as a local high before a retest of the breakout from the symmetrical triangle occurs, potentially establishing the conditions for a massive bull run. In both scenarios, the medium-term target would be the 2021 high at $1.9704, followed by the $3.7148 level, corresponding to the all-time high of XRP. In price discovery mode, the 1.618 and 2.272 Fibonacci extension levels are identified by Egrag as long-term goals, standing at $6.41 and $22.39, respectively. At press time, XRP traded at $0.6335. On the daily chart, the 0.382 Fib retracement level at $0.6379 is currently the most important resistance to overcome in order to build up new momentum. Featured image from iStock, chart from TradingView.com"
  }
]