[
  {
    "source": "Cointelegraph",
    "date": "2023-08-11T10:59:01.000Z",
    "title": "Bitcoin trader reveals 'important' BTC price zone as bulls hold $29.3K",
    "url": "https://cointelegraph.com/news/bitcoin-trader-btc-price-zone-bulls-hold-29-k",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/30fa3866-acc1-49fa-b4c1-c0595c1a6f46.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin traders continue to battle for control of a rangebound market — but some nearby BTC price levels are more significant than others.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) faces a new battleground as bulls and bears fight for control of a sideways market, one popular trader says.</p><p>In part of his <a href=\"https://twitter.com/DaanCrypto/status/1689923709287411712/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">latest X analysis</a> on Aug. 11, Daan Crypto Trades flagged a key level to reclaim as BTC price support.</p><h2>\"Strongly contested\" BTC price zone set for a grilling</h2><p>With BTC price breakouts continually failing, both Bitcoin bulls and bears are caught in a “strongly contested” range, Daan Crypto Trades summarized.</p><p>This is the culmination of various trips <a href=\"https://cointelegraph.com/news/bitcoin-august-high-warning-longs-chasing-btc-price\">above and below current spot price</a>, making the midpoint the level to watch next.</p><p>The status quo has essentially remained the same since mid-June — $28,500 as fundamental support, $31,800 as resistance.</p><p>Gaining control of the area around $29,700 is thus an essential move if bulls are to build the necessary momentum to change the landscape for good.</p><p>“Pretty clear that the $29.5-29.7K region is an area that's strongly contested by the bulls and bears,” Daan Crypto Trades wrote. </p><blockquote>“It's an important area to keep watching.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/4ad8204a-1dfd-4670-ba85-9782f5204895.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Daan Crypto Trades/X</em></figcaption></figure><p>An accompanying chart showed BTC/USD nonetheless fighting to return above the range low, with little significant historical support lines between $28,500 and $29,500.</p><p>The analysis thus ties in with <a href=\"https://cointelegraph.com/news/bitcoin-volume-lowest-early-2021-25k\">other perspectives from recent weeks</a>, these likewise focusing on $28,500 or slightly lower as a downside target.</p><h2>Bitcoin traders fight it out on exchanges</h2><p>Focusing on short-term BTC price events, meanwhile, fellow trader Skew highlighted just how frenetic the mid-$29,000 zone currently is for Bitcoin.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-price-prediction-october-100k-2026-analysis\">Bitcoin risks 15% dip by October, but $100K is due in 2026 — Analysis</a></em></strong></p><p>Exchange trades showed large-volume bids absorbing sellside pressure on Aug. 11.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> <br>and now they&#39;re puking the bag lol <a href=\"https://t.co/XkGxu5OsEf\">https://t.co/XkGxu5OsEf</a> <a href=\"https://t.co/fpqf5PmzIC\">pic.twitter.com/fpqf5PmzIC</a></p>&mdash; Skew Δ (@52kskew) <a href=\"https://twitter.com/52kskew/status/1689929684937740288?ref_src=twsrc%5Etfw\">August 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Continuing, Skew <a href=\"https://twitter.com/52kskew/status/1689947691579797504/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">described</a> spot price action on 4-hour timeframes as “weak” despite holding above various exponential moving averages (EMAs).</p><p>“Tight price compression here, likely a 5% + price reaction is coming from here,” he added.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/b45877e0-ee70-4f1e-8d49-07fe5d403a39.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Skew/X</em></figcaption></figure><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\">Deposit risk: What do crypto exchanges really do with your money?</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-11T10:39:33.000Z",
    "title": "Visa explores crypto gas fees payments through cards ",
    "url": "https://cointelegraph.com/news/visa-card-crypto-blockchain-gas-fees-payment",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/a7509e37-fd04-4381-a15e-ee294e6f8507.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Visa’s innovative solution employs Ethereum’s ERC-4337 standard and the “Paymaster” smart contract, enabling off-chain gas fee settlement.</p>\n                    <p><p>In a potential transformative move for users, Visa, the payments solution provider, is testing an innovative solution enabling <a href=\"https://cointelegraph.com/explained/transaction-fees-explained\">on-chain gas fees</a> to be paid using a Visa card.</p><p>Mustafa Bedawala, a product manager at Visa, <a href=\"https://usa.visa.com/solutions/crypto/paying-blockchain-gas-fees-with-card.html\" target=\"_blank\" rel=\"noopener nofollow\">presented</a> the report, <a href=\"https://twitter.com/digitalmustafa/status/1689741716084215809\" target=\"_blank\" rel=\"noopener nofollow\">highlighting</a> an observed challenge with <a href=\"https://cointelegraph.com/explained/crypto-wallets-explained#:~:text=They%20can%20be%20used%20to,you%20can%20spend%20your%20money.\">cryptocurrency wallets</a>; the ongoing requirement to oversee Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) balances for covering gas fees.</p><p>The standard Ethereum procedure involves users acquiring ETH from an exchange or on-ramp service and then transferring it to their wallets to cater to variable gas fees. This continuous adjustment of gas prices frequently leads to users either overspending or having insufficient ETH, introducing intricacies and challenges.</p><p>Visa’s innovative solution employs <a href=\"https://www.makeuseof.com/what-is-ethereum-erc-4337/#:~:text=In%20essence%2C%20ERC%2D4337%20brings,having%20to%20trust%20a%20bank.\" target=\"_blank\" rel=\"noopener nofollow\">Ethereum’s ERC-4337</a> standard and the “Paymaster” <a href=\"https://cointelegraph.com/learn/what-are-smart-contracts-a-beginners-guide-to-automated-agreements#:~:text=Smart%20contracts%20are%20contracts%20that,making%20them%20immutable%20and%20irreversible.\">smart contract</a>, enabling off-chain gas fee settlement. The process involves the user triggering an Ethereum transaction via wallet, sent to the paymaster. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/91cd77d6-e0cd-4e23-8757-f37f5561d879.JPG\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Image illustrating steps involved in paying gas fees with Visa card via Paymaster. Source: Visa</em></figcaption></figure><p>The web service computes the gas fee and charges Visa using Cybersource. Subsequently, a <a href=\"https://cointelegraph.com/news/what-are-digital-signatures\">digital signature</a> is provided and momentarily validated, then attached by the wallet before being sent to Ethereum. Paymaster verifies the signature and covers the gas fee.</p><p>This sequence of steps allows the user to directly pay gas fees with their Visa card off-chain, eliminating the need for users to hold ETH merely for paying fees. </p><p>According to the publication, Visa has trialed this concept on the Ethereum Goerli testnet, utilizing available <a href=\"https://cointelegraph.com/news/the-importance-of-open-source-in-computer-science-and-software-development\">open-source tools</a>, such as Stackup’s userop.js library. The trial transactions effectively covered fees through the Paymaster, bypassing the requirement for ETH.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/3-reasons-why-ethereum-price-is-still-pinned-below-1900\"><strong><em>3 reasons why Ether price is still pinned below $1,900</em></strong></a></p><p>Notably, this concept has the potential to reduce friction for blockchain users and allows the user to directly pay gas fees with their Visa card off-chain, eliminating the need for users to hold ETH merely for paying fees. </p><p>The report also suggested wider ramifications, highlighting the potential for merchants or decentralized applications to utilize the Paymaster framework to improve customer interactions, facilitating gas fee payments using Visa cards. This innovation may also create opportunities for current wallet and Paymaster providers to introduce options for Visa card-based gas fee payments.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-11T10:55:16.000Z",
    "title": "Fed warns banks over doing business with PayPal new stablecoin",
    "url": "https://cryptodaily.co.uk/2023/08/fed-warns-banks-over-doing-business-with-paypal-new-stablecoin",
    "description": "<p>The US financial regulators&rsquo; attack on all things crypto continues as the Federal Reserve issues a new announcement obliging banks to jump through extremely exacting requirements in order to do business with crypto entities.</p>\n<p>Referring to its recently established &ldquo;novel activities supervision program&rdquo;, the Federal Reserve&rsquo;s latest supervisory letter states that any&nbsp; banks wishing to do business in &ldquo;dollar tokens&rdquo; must obtain a written supervisory non-objection from the Fed before doing anything in line with this sort of activity.</p>\n<p>This latest regulatory pronouncement might well have been inspired after seeing PayPal roll out its PYUSD stablecoin which seeks to become a bridge between fiat and Web3 for merchants and consumers alike.&nbsp;</p>\n<p>This particular innovation for the dollar and crypto may have been seen as a step too far by US financial authorities, given the size of PayPal and its huge financial clout and influence.</p>\n<p>The new strictures put in place by the Fed will make doing business in PayPal&rsquo;s stablecoin extremely challenging and demanding, requiring any bank to \"identify, measure, monitor and control the risks of its activities,\".</p>\n<p>The Fed will then weigh up the risks for money laundering, substantial short term redemptions, and cybersecurity risks among others.</p>\n<p>Obliging all companies wanting to do such business to follow such an exacting and arduous process is likely to put a real damper on the use of PayPal&rsquo;s PYUSD stablecoin and has led to some volatility in PayPal&rsquo;s stock price.</p>\n<p>It&rsquo;s not just the Fed that is acting in such a manner either. The FDIC and the OCC, both very weighty financial agencies, have also put rules into place that crypto companies, and the businesses looking to interact with them, are likely to find burdensome and difficult to comply with.</p>\nOpinion\n<p>The financial agencies should act to give adequate protections to businesses and consumers from the issues that can arise from such groundbreaking financial innovations in the crypto sector, but instead they are acting as kingmakers in order to favour the banking industry from which they come.</p>\n<p>Crypto came into being as a creative and innovative industry that favours speed, security and privacy, and puts the consumer first. However, cumbersome and pro-bank regulations are pulling crypto companies down to the same level as their lumbering banking competitors.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T10:49:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past month, BNB, and the entire crypto market have once again lost momentum. BNB prices have dropped by 6.46% since touching $260 in July 2023. What does the future hold for Binance Coin? How much is BNB worth? The current Binance coin price is ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-08-11T10:49:09.000Z",
    "title": "ARK Bitcoin ETF News Expected Tomorrow: Approval And Rejection Implications",
    "url": "https://nulltx.com/ark-bitcoin-etf-news-expected-tomorrow-approval-and-rejection-implications/",
    "description": "The imminent Bitcoin ETF news has garnered significant attention, with market participants anticipating a delay, which may already be factored into Bitcoin&#8217;s current price. However, if the SEC unexpectedly approves or rejects the ARK ETF, the repercussions could be substantial. ARK ETF Approval In the event of approval, the ARK ETF could trigger a surge [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-11T11:05:46.000Z",
    "title": "Cardano (ADA) Tests Psychological Support – What’s The Next Move?",
    "url": "https://www.newsbtc.com/all/cardano-tests-psychological-support/",
    "description": "Cardano (ADA) recently made waves as it brushed against the critical $0.30 resistance level. The significance of such resistance levels in the world of cryptocurrencies cannot be underestimated, as they often mark crucial junctures in the price trajectory of digital assets. Resistance levels serve as key markers on the price charts, indicating levels at which an asset faces heightened selling pressure. These levels are points where a substantial number of traders historically have chosen to sell their holdings, causing the price to temporarily stall or reverse its upward trajectory. Such zones are closely monitored by market participants and analysts alike, as they offer insights into the sentiments and actions of traders.  A successful breach of a resistance level often signifies a potential continuation of the upward trend, while a failure to overcome this obstacle may lead to a period of consolidation or even a reversal. Cardano Recent Performance And Market Landscape As of the latest data from CoinGecko, Cardano (ADA) stands at a price of approximately $0.300341, reflecting a 1.5% decline over the past 24 hours. However, the past seven days have seen a modest 0.9% surge, indicating a relatively stable performance. Related Reading: Turbulent AVAX Price Trends And Fading Trading Activity – What To Expect Notably, ADA&#8217;s recent touch of the $0.30 resistance level has sparked interest among traders and investors, highlighting the psychological significance of this price point. People believe in the long-term potential of #Cardano. According to Morning Consult, people sold $ADA (and Solana) the least often over the past month. Only 22% of holders. $BTC was sold by 46% and $ETH by 33% of holders. pic.twitter.com/UVGDrEasJ0 — Cardanians &#124; stake with CRDN3 (@Cardanians_io) August 11, 2023 Interestingly, ADA&#8217;s current reversal mode should not be seen as an unequivocal bearish signal. The broader crypto market is exhibiting signs of recovery, with several major cryptocurrencies showing renewed potential. Moreover, the absence of intense selling pressure suggests that the recent resistance encounter might not translate into an extended downturn. Sideways Trading In The Near Future Despite the intriguing movement around the $0.30 resistance level, it is plausible that ADA might engage in ongoing sideways trading within the wide range of $0.29 to $0.31, according to a recent price analysis. This is a typical pattern observed in the cryptocurrency market, especially during periods of uncertainty. Such a scenario could persist until the end of the month, with traders cautiously navigating the price fluctuations. Cardano market cap currently at $10.3 billion. Chart: TradingView.com Cardano&#8217;s journey to the $0.30 resistance level is a captivating development in the crypto world. While ADA currently grapples with a reversal mode, the overall market sentiment leans towards recovery. Related Reading: XRP Price: Breaking This Key Resistance Could Propel Crypto To $21 By 2025 – Analyst Understanding the dynamics of resistance levels and their implications is crucial for traders aiming to decipher ADA&#8217;s future price action. As the month unfolds, all eyes will remain on ADA and the wider crypto market to discern whether the sideways trading will give way to a more definitive trend. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from CryptoGlobe"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-11T11:00:37.000Z",
    "title": "As Ethereum and Dogecoin Lose Steam, This Coin Captures Investors’ Attention With Stellar Performance!",
    "url": "https://www.crypto-news-flash.com/as-ethereum-and-dogecoin-lose-steam-this-coin-captures-investors-attention-with-stellar-performance/?utm_source=rss&utm_medium=rss&utm_campaign=as-ethereum-and-dogecoin-lose-steam-this-coin-captures-investors-attention-with-stellar-performance",
    "description": "<img width=\"512\" height=\"301\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-5.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-5.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-5-300x176.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ethereum (ETH), the second most capitalized crypto asset, has been on a downward streak affecting Dogecoin (DOGE) and other coins. On the other hand, VC Spectra (SPCT) has gained significant profits and attention from investors in its presale stage. Why is VC Spectra (SPCT) performing well as popular assets flail? Let’s get to the answers. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-11T10:46:09.000Z",
    "title": "Gemini Relists XRP Trading and Expands Support to XRP Ledger (XRPL), Price Glitch Shows XRP Going for $50",
    "url": "https://www.crypto-news-flash.com/gemini-relists-xrp-trading-and-expands-support-to-xrp-ledger-xrpl-price-glitch-shows-xrp-going-for-50/?utm_source=rss&utm_medium=rss&utm_campaign=gemini-relists-xrp-trading-and-expands-support-to-xrp-ledger-xrpl-price-glitch-shows-xrp-going-for-50",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Travis-Wolfe-Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple XRP\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Travis-Wolfe-Ripple.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Travis-Wolfe-Ripple-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Travis-Wolfe-Ripple-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Travis-Wolfe-Ripple-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Gemini relists XRP on its platform while mocking the SEC and Chairman Gary Gensler in a teaser video. Amid some glitch on Gemini, the XRP price was trading at $50 within hours of listing. On Thursday, August 10, crypto exchange Gemini ended the wait by relisting Ripple&#8217;s XRP cryptocurrency on its platform. Currently, Gemini offers [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-11T10:58:48.000Z",
    "title": "Gemini Glitch Propels XRP to $50, Causes Widespread Confusion",
    "url": "https://coinedition.com/gemini-glitch-propels-xrp-to-50-causes-widespread-confusion/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/@Gemini-has-officially-started-offering-XRP-on-its-platform.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/@Gemini-has-officially-started-offering-XRP-on-its-platform.png 730w, https://coinedition.com/wp-content/uploads/2023/08/@Gemini-has-officially-started-offering-XRP-on-its-platform-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/08/@Gemini-has-officially-started-offering-XRP-on-its-platform-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/08/@Gemini-has-officially-started-offering-XRP-on-its-platform-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/08/@Gemini-has-officially-started-offering-XRP-on-its-platform-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/08/@Gemini-has-officially-started-offering-XRP-on-its-platform-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/08/@Gemini-has-officially-started-offering-XRP-on-its-platform-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/08/@Gemini-has-officially-started-offering-XRP-on-its-platform-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/08/@Gemini-has-officially-started-offering-XRP-on-its-platform-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/08/@Gemini-has-officially-started-offering-XRP-on-its-platform-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/08/@Gemini-has-officially-started-offering-XRP-on-its-platform-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/08/@Gemini-has-officially-started-offering-XRP-on-its-platform-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/08/@Gemini-has-officially-started-offering-XRP-on-its-platform-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/08/@Gemini-has-officially-started-offering-XRP-on-its-platform-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/08/@Gemini-has-officially-started-offering-XRP-on-its-platform-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/08/@Gemini-has-officially-started-offering-XRP-on-its-platform-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Gemini is the latest in exchanges scurrying to relist XRP. However, hours after it was reinstated onto the platform, a technical glitch caused the XRP price to temporarily read $50 instead of its actual value. Twitter users were quick to screenshot and share the debacle, peddling their own theories on what happened. Some users claim [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/gemini-glitch-propels-xrp-to-50-causes-widespread-confusion/\">Gemini Glitch Propels XRP to $50, Causes Widespread Confusion</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]