[
  {
    "source": "Cointelegraph",
    "date": "2023-09-14T19:48:03.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Crypto lender Genesis has announced that it will wind down its crypto trading services. Coinbase CEO Brian Armstrong says regulators should stop taking action against DeFi protocols, and that the De-Fi should take the cases to court, in order to set a precedent. Meanwhile, Three Arrows Capital founders  Kyle Davies and Su Zhu have been handed a nine-year prohibition by the Monetary Authority of Singapore.</p><p>Digital Currency Group (DCG) subsidiary Genesis announced on Sept. 14 that it would <a href=\"https://cointelegraph.com/news/genesis-winding-down-crypto-trading-services\">wind down its crypto trading services</a>.</p><p>According to a company spokesperson, Genesis will “voluntarily and for business reasons” halt its spot and derivative crypto trading services through its British Virgin Islands unit.</p><p>The move came shortly after Genesis Global Trading — another DCG-affiliated firm — confirmed it would <a href=\"https://cointelegraph.com/news/us-based-genesis-global-trading-will-eliminate-crypto-spot-trading-service\">eliminate crypto spot trading services</a> beginning Sept. 18. It, too, said the closure was “voluntarily and for business reasons.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Genesis Global Trading, an affiliate of Barry Silbert’s Digital Currency Group, will wind down its crypto spot trading service as of Sept. 18 for “business reasons” <a href=\"https://t.co/tMIvk1ubcG\">https://t.co/tMIvk1ubcG</a></p>&mdash; Bloomberg (@business) <a href=\"https://twitter.com/business/status/1699128795628711977?ref_src=twsrc%5Etfw\">September 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>DCG entities have made headlines for all the wrong reasons since the onset of crypto winter in 2022. Genesis blamed its <a href=\"https://cointelegraph.com/news/3ac-a-10b-hedge-fund-gone-bust-with-founders-on-the-run\">collapse on Three Arrows Capital</a>, the failed hedge fund headed by Kyle Davies and Su Zhu, and the downfall of FTX.</p><p>DCG is also the parent company of Grayscale Investments, which recently scored an important victory in its <a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\">pursuit of a spot Bitcoin ETF</a>.</p><h3>DCG-affiliated Genesis to wind down crypto trading</h3><h3>Coinbase CEO champions DeFi, calls for court action to set legal precedent</h3><p>Coinbase CEO Brian Armstrong has expressed his endorsement of decentralized finance (DeFi) protocols. In a recent social media post, Armstrong urged DeFi protocols to consider legal proceedings in court to set a precedent, as the legal system has consistently demonstrated its dedication to upholding the rule of law. The current approach is mainly pushing a crucial industry toward overseas jurisdictions, he said.</p><p>According to his post on X (formerly Twitter), the United States Commodities and Futures Trading Commission should avoid taking enforcement actions against DeFi protocols, as they do not function as conventional financial service businesses, and it’s questionable whether the Commodity Exchange Act is even applicable to them.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The CFTC should not be creating enforcement actions against decentralized (DeFi) protocols. These are not financial service businesses, and it’s highly unlikely the Commodity Exchange Act even applies to them.<br><br>My hope is these DeFi protocols take these cases to court to…</p>&mdash; Brian Armstrong ️ (@brian_armstrong) <a href=\"https://twitter.com/brian_armstrong/status/1702043655928955139?ref_src=twsrc%5Etfw\">September 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In the previous week, the U.S. CFTC took action against three DeFi companies for engaging in alleged unauthorized trading of cryptocurrency derivatives. According to the regulator, these platforms enabled the illicit trading of crypto derivatives without the necessary registration.</p><p>In addition to Armstrong, certain legislators have also shown their support for DeFi protocols. CFTC Commissioner Summer Mersinger underscored the importance of the CFTC concentrating on establishing transparent regulations for DeFi rather than swiftly resorting to enforcement measures. She voiced her apprehension that the commission appears to be leaning toward enforcement actions, whereas she believes that engaging with the public and setting clear guidelines should be the primary focus.</p><p>The U.S. CFTC recently achieved a legal triumph in a case against Ooki DAO for operating an illicit trading platform and contravening other regulatory guidelines. In June 2023, a federal judge similarly ruled in favor of the CFTC, resulting in the closure of Ooki DAO and the imposition of a fine exceeding $600,000.</p><p>In recent months, cryptocurrency companies have encountered increased scrutiny from U.S. regulatory authorities. Notably, regulatory bodies such as the U.S. Securities and Exchange Commission have initiated investigations into major players, such as Coinbase and Binance.</p><h3>Singapore’s central bank slugs Three Arrows founders with 9-year ban</h3><p>Singapore’s central bank has <a href=\"https://cointelegraph.com/news/singapore-central-bank-bans-three-arrows-capital-founders\">issued nine-year prohibition</a> orders to Kyle Davies and Su Zhu over alleged violations of the country's securities laws at their co-founded crypto hedge fund Three Arrows Capital (3AC).</p><p>In a Sept. 14 <a href=\"https://www.sgpc.gov.sg/api/file/getfile/MAS%20Media%20Release%20-%20MAS%20issues%20Prohibition%20Orders%20against%20Three%20Arrows%20Capital%20Zhu%20Su%20and%20Kyle%20Livingston%20Davies.pdf?path=/sgpcmedia/media_releases/mas/press_release/P-20230914-1/attachment/MAS%20Media%20Release%20-%20MAS%20issues%20Prohibition%20Orders%20against%20Three%20Arrows%20Capital%20Zhu%20Su%20and%20Kyle%20Livingston%20Davies.pdf\" target=\"_blank\" rel=\"noopener nofollow\">statement</a>, the Monetary Authority of Singapore (MAS) said Zhu and Davies are banned from regulated activities during the prohibition period that started Sept. 13.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/a616fc87-ad68-442a-bac1-9bfb204a6d70.PNG\"  /><figcaption style=\"text-align: center;\"><em>Highlighted excerpt of MAS' reasoning for the prohibition orders against Zhu and Davies. Source: MAS</em></figcaption></figure><p>They also won’t be permitted to manage, act as a director, or be a substantial shareholder of any capital market services business in Singapore.</p><p>In its decision to bar the pair, MAS said it found further securities law violations when it undertook further investigations into the bankrupt 3AC and its co-founders.</p><p>3AC was wiped out in last year's crypto market crash triggered by the Terra ecosystem collapse which saw its leveraged crypto positions expose it to billions in loan defaults.</p><p>Last June — amid widely reported insolvency and a day before <a href=\"https://cointelegraph.com/news/3ac-a-10b-hedge-fund-gone-bust-with-founders-on-the-run\">3AC filed for bankruptcy</a> — MAS <a href=\"https://cointelegraph.com/news/singapore-reprimands-3ac-for-providing-false-information\">reprimanded the hedge fund</a> over providing it with false information, not telling the watchdog about Zhu's and Davies directorship changes and exceeding the legal assets under management threshold.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-14T19:55:34.000Z",
    "title": "Genesis to halt all trading services by Sept. 21",
    "url": "https://cryptoslate.com/genesis-to-halt-all-trading-services-by-sept-21/",
    "description": "<p>Genesis will soon close all of its services, according to a Sept. 14 report. A Genesis spokesperson was on record saying: &#8220;Genesis has decided to stop offering digital asset spot and derivatives trading through GGC International, Ltd. (GGCI)&#8230;With this termination of services from GGCI, Genesis no longer offers trading services through any of its business [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/genesis-to-halt-all-trading-services-by-sept-21/\">Genesis to halt all trading services by Sept. 21</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-14T20:00:48.000Z",
    "title": "Paul Krugman: ‘The War on Inflation Is Pretty Much Won’ – Claims ‘Remarkable Disinflation’ Occurred",
    "url": "https://news.bitcoin.com/paul-krugman-the-war-on-inflation-is-pretty-much-won-claims-remarkable-disinflation-occurred/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/ddkrug-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Paul Krugman: &#039;The War on Inflation Is Pretty Much Won&#039; – Claims &#039;Remarkable Disinflation&#039; Occurred\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/ddkrug-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/ddkrug-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/ddkrug-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/ddkrug-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/ddkrug-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/ddkrug-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/ddkrug.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Wednesday, Nobel Prize-winning economist Paul Krugman provided a brief analysis of the current economic landscape in the United States. Krugman asserted that the nation has experienced “remarkable disinflation.” According to him, the available data paints a compelling picture, suggesting that the “war on inflation has been pretty much won — without a recession.” Krugman [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-14T20:08:02.000Z",
    "title": "Banana Gun relaunches on Uniswap v2",
    "url": "https://crypto.news/banana-gun-relaunches-on-uniswap-v2/",
    "description": "Banana Gun, a Telegram bot, has relaunched its BANANA token on Uniswap"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-14T19:54:30.000Z",
    "title": "Ripple expands Liquidity Hubs to Brazil and Australia",
    "url": "https://crypto.news/ripple-expands-liquidity-hubs-to-brazil-and-australia/",
    "description": "Ripple is expanding its Liquidity Hubs to Brazil and Australia to address liquidity management challenges in enterprise crypto adoption"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-14T20:00:07.000Z",
    "title": "Bitcoin Surges To $26,700, But Will This Rise Last?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-surges-to-26700-but-will-this-rise-last/",
    "description": "Bitcoin has observed a surge towards the $26,700 level in the past day. Here&#8217;s what on-chain data says regarding whether this rise would stay. Bitcoin Has Broken The $26,700 Level During The Past Day After a long run of stagnation around and below the $26,000 level, Bitcoin finally seems to be making a steady run above it, as the cryptocurrency has now breached the $26,700 mark. Looks like BTC has observed an increase over the past few days &#124; Source: BTCUSD on TradingView With this latest rise, BTC is up about 4% during the past week, making the coin the best performer among the top 10 assets by market cap in the sector. After seeing so many fragile attempts at recovery in recent weeks, though, Bitcoin investors might be doubtful whether this rise is here to stay. Related Reading: Bitcoin Net Taker Volume Turns Highly Positive, Bullish Sign? On-chain data might provide some hints about this. First, here are how the support and resistance levels look like from an on-chain perspective, according to data from the market intelligence platform IntoTheBlock: The concentration of holders at the different price levels &#124; Source: IntoTheBlock Generally, investors tend to buy more at their cost basis (the price at which they bought their coins) whenever the price dips back to their cost basis from above. As they had been in profits before this dip, they may believe that the price would rise shortly and that their cost basis could be a profitable entry point for further accumulation. On the other hand, investors in loss might look forward to the price reaching their cost basis to sell and exit. This can provide resistance to the asset if many investors have the same cost basis as the price it&#8217;s trying to test from below. In the above infographic, the various price levels and the investor concentrations at them are displayed. When IntoTheBlock posted it, the price had been trading at $26,100. Related Reading: Bitcoin Wallet Activity Touches 5-Month High, Will BTC Price Follow? The cryptocurrency is currently mowing through the $26,100 to $26,900 range, which holds the cost basis of a decent amount of investors. Should the asset&#8217;s attempts fail, though, the $25,300 to $26,100 range should provide plenty of support, as it currently has a thick concentration of holders. Bitcoin Exchange Inflows Have Occurred Throughout The Last Month However, one sign that may be concerning for the asset is that the whales have been making significant deposits to exchanges during the past month, as analyst James V. Straten has pointed out. The value of the metric seems to have been above zero for most of this period &#124; Source: @jimmyvs24 on X The above chart shows the data for the Bitcoin exchange netflows only for transfers worth at least $10 million. This graph shows that the metric has mostly had a positive value throughout the past month, meaning that large entities like the whales have been constantly moving coins into these platforms. As one of the main reasons these investors may transfer to exchanges is for selling purposes, this could indicate that these holders have been preparing for a selloff. It remains to be seen whether these Bitcoin whale exchange inflows would lead to this short-lived rise or if the market would bash through the selling pressure. Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-14T20:00:00.000Z",
    "title": "Fashion Brand Diesel Joins DressX to Launch Collection On Meta",
    "url": "https://coinedition.com/fashion-brand-diesel-joins-dressx-to-launch-collection-on-meta/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/Metas-Metaverse-Gets-Mocked-by-Hundreds-of-People-Online.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Fashion Brand Diesel Joins DressX to Launch Collection On Meta\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/Metas-Metaverse-Gets-Mocked-by-Hundreds-of-People-Online.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/Metas-Metaverse-Gets-Mocked-by-Hundreds-of-People-Online-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/Metas-Metaverse-Gets-Mocked-by-Hundreds-of-People-Online-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/Metas-Metaverse-Gets-Mocked-by-Hundreds-of-People-Online-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/Metas-Metaverse-Gets-Mocked-by-Hundreds-of-People-Online-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Fashion brand Diesel has partnered with DressX to launch a virtual collection on Metaverse. Dress X and Diesel both become part of Meta Avatars Store’s exclusive digital fashion lineage. Diesel’s board member, Stefano Rosso, revealed plans to launch more digital collectibles in the future. Fashion brand Diesel has reportedly partnered with Metaverse fashion house DressX [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/fashion-brand-diesel-joins-dressx-to-launch-collection-on-meta/\">Fashion Brand Diesel Joins DressX to Launch Collection On Meta</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-14T20:00:06.000Z",
    "title": "Brad Garlinghouse Says Ripple Will Get 80% of New Hires From Outside the United States",
    "url": "https://dailyhodl.com/2023/09/14/brad-garlinghouse-says-ripple-will-get-80-of-new-hires-from-outside-the-united-states/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/ripple-ceo-outside-us.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/ripple-ceo-outside-us.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/ripple-ceo-outside-us.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/ripple-ceo-outside-us.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/ripple-ceo-outside-us.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/ripple-ceo-outside-us.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/ripple-ceo-outside-us.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Ripple CEO Brad Garlinghouse says the blockchain-based payments company is seeing more expansive growth outside of the US because of the country’s restrictive stance on crypto. In a new interview on Bloomberg Daybreak: Asia, Garlinghouse says the majority of Ripple’s open positions will be filled by people in countries more accommodative to the crypto industry. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/14/brad-garlinghouse-says-ripple-will-get-80-of-new-hires-from-outside-the-united-states/\">Brad Garlinghouse Says Ripple Will Get 80% of New Hires From Outside the United States</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-14T19:55:00.000Z",
    "title": "Crypto Analyst Dives Into FTX Bankruptcy Development, Offers Words of Encouragement to Traders",
    "url": "https://dailyhodl.com/2023/09/14/crypto-analyst-dives-into-ftx-bankruptcy-development-offers-words-of-encouragement-to-traders/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/Media-Complicit-in-FTX-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/Media-Complicit-in-FTX-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/Media-Complicit-in-FTX-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/Media-Complicit-in-FTX-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/Media-Complicit-in-FTX-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/Media-Complicit-in-FTX-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/Media-Complicit-in-FTX-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is breaking down the latest developments in the FTX bankruptcy and their implications for the broader markets. Crypto trader Michaël van de Poppe tells his 666,900 followers on the social media platform X that FTX&#8217;s approval to sell $3.4 billion in crypto assets, approximately a third of which is Solana (SOL), combined [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/14/crypto-analyst-dives-into-ftx-bankruptcy-development-offers-words-of-encouragement-to-traders/\">Crypto Analyst Dives Into FTX Bankruptcy Development, Offers Words of Encouragement to Traders</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]