[
  {
    "source": "Decrypt",
    "date": "2023-07-11T00:02:39.000Z",
    "title": "Grayscale Cries Foul Over SEC Approval of a Different Kind of Bitcoin ETF",
    "url": "https://decrypt.co/148009/grayscale-protests-sec-approval-leveraged-bitcoin-futures-not-spot-etf",
    "description": "The company says the difference between a leveraged Bitcoin future ETF and a spot Bitcoin ETF isn’t enough to stonewall the latter."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-10T23:40:14.000Z",
    "title": "Netflix Taps AI To Push Visual Effects Beyond the Green Screen",
    "url": "https://decrypt.co/147986/netflix-ai-green-screen-magenta-visual-effects-movies",
    "description": "Why go for a green screen when there’s an AI-powered magenta option?"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-10T23:51:00.000Z",
    "title": "Pink, Pussy, Venom, Inferno — Drainers coming for a crypto wallet near you",
    "url": "https://cointelegraph.com/news/cypto-drainers-pink-pussy-venom-and-inferno-steal-millions",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/27a68ae9-b886-4362-828a-7e17045715b3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Crypto wallet drainers, or sweepers, are malicious smart contracts that can quickly empty a crypto wallet of its funds and are a standard tool for phishing scammers.</p>\n                    <p><p>Four major crypto drainers have emerged to fill the vacuum left by the notorious wallet sweeper Monkey Drainer, with thousands of victims targeted and millions in crypto stolen already this year. </p><p>The crypto drainers — called Pink Drainer, Inferno Drainer, Pussy Drainer, and Venom Drainer — have together stolen $66.4 million in total since around the start of 2023 according to Dune <a href=\"https://dune.com/scamsniffer\" target=\"_blank\" rel=\"noopener nofollow\">dashboards</a> complied by Web3 anti-scam platform Scam Sniffer.</p><p>Venom Drainer has <a href=\"https://dune.com/scamsniffer/venom-drainer-stats\" target=\"_blank\" rel=\"noopener nofollow\">stolen</a> nearly $27.5 million since February, the most out of the group. <a href=\"https://cointelegraph.com/news/inferno-drainer-scam-as-a-service-has-stolen-5-9m-since-march-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/inferno-drainer-scam-as-a-service-has-stolen-5-9m-since-march-report/amp\">Inferno Drainer is second</a> with over $21.2 million <a href=\"https://dune.com/scamsniffer/inferno-drainer\" target=\"_blank\" rel=\"noopener nofollow\">stolen</a> since January but has three times the number of victims at nearly 45,800.</p><p>Pussy Drainer and Pink Drainer together have been used to steal from over 6,000 victims with $17.5 million in funds pilfered across the two. Monkey Drainer was estimated to have stolen about $13 million worth of digital assets in total during its reign.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/40d29f3e-7726-4da3-964c-d53f82f6360f.png\"><figcaption style=\"text-align: center;\"><em>Venom Drainer’s stats show the service has stolen, on average, around $1,800 worth from each victim. Source: Dune</em></figcaption></figure><p>Crypto drainers work by having the victim unknowingly agree to a malicious transaction in their crypto wallet that allows a smart contract to transfer out a portion of assets or the entire contents of the wallet, depending on the transaction that was signed.</p><p>Scam Sniffer told Cointelegraph that most crypto drainers are rented out to groups undertaking phishing scams and the drainer takes a percentage cut of the loot.</p><p>Many operate on this pricing model but some have an additional access fee. Blockchain security firm CertiK explained that Inferno — like many other drainers — “has a 20% commission” while Venom has “introduced an initial $1,000 fee” for first-time users.</p><p>Scam Sniffer said some draining services advertise “add-ons” such as including malicious signature requests that emulate popular nonfungible token (NFT) marketplaces such as Blur and X2Y2.</p><p>“In the NFT space, there are a lot of protocols that use unreadable signatures like Seaport, Blur and X2Y2,” Scam Sniffer explained. “If the victims have assets on Blur, the drainers could launch particular malicious signatures to steal NFTs approved to trade on Blur.” </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">3/ Blur's bulk listing requires users to sign a Root, which is unreadable for users. this Root is the Merkle Tree Root generated by multiple Order hash. <a href=\"https://t.co/RxAsJp0Urv\">pic.twitter.com/RxAsJp0Urv</a></p>— Scam Sniffer (@realScamSniffer) <a href=\"https://twitter.com/realScamSniffer/status/1673363566043484160?ref_src=twsrc%5Etfw\">June 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Not all drainers are around forever though. According to Scam Sniffer, once the person or people behind a drainer steal a certain amount of funds, they will announce they’re quitting — likely an attempt at staving off law enforcement.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-scams-rise-of-artificial-intelligence\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-scams-rise-of-artificial-intelligence/amp\"><strong><em>Crypto scams are going to ramp up with the rise of AI</em></strong></a></p><p>However, it added as one crypto drainer leaves another takes its place “because it’s profitable! [...] And no one has been arrested so far.”</p><p>The are currently multiple crypto-draining services making the rounds on Telegram. CertiK shared images with Cointelegraph showing other drainers named Angel, Spawn, Whale and Atomic.</p><p>In March, the crypto-draining service Monkey Drainer <a href=\"https://cointelegraph.com/news/notorious-monkey-drainer-crypto-scammer-says-they-re-shutting-down\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/notorious-monkey-drainer-crypto-scammer-says-they-re-shutting-down/amp\">announced they were</a> “shutting down” saying it was “time to move on to something better.”</p><p>The person behind Monkey Drainer pointed their “fellow cyber-gangsters” to Venom, touting it as a “flawless” service.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\"><strong><em>Should you ‘orange pill’ children? The case for Bitcoin kids books</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-11T00:00:33.000Z",
    "title": "Central Banks Reduce US Dollar Holdings, Plan to Increase Chinese Yuan Exposure, Study Shows",
    "url": "https://news.bitcoin.com/central-banks-reduce-us-dollar-holdings-plan-to-increase-chinese-yuan-exposure-study-shows/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/dollar-vs-yuan-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Central Banks Reduce US Dollar Holdings, Plan to Boost Chinese Yuan Exposure, Study Shows\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/dollar-vs-yuan-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/dollar-vs-yuan-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/dollar-vs-yuan-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/dollar-vs-yuan-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/dollar-vs-yuan-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/dollar-vs-yuan-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/dollar-vs-yuan.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A study by a $1.5 trillion asset management firm has revealed that central banks are reducing their U.S. dollar holdings while seeking to increase Chinese yuan holdings. &#8220;Central banks are diversifying currency holdings, stirred by geopolitical uncertainties and attractive opportunities in emerging markets,&#8221; the study shows. ’Central Banks Are Diversifying Currency Holdings’ Invesco, an asset [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-11T00:08:17.000Z",
    "title": "PancakeSwap aims to enhance platform availability with Google Cloud integration",
    "url": "https://crypto.news/pancakeswap-aims-to-enhance-platform-availability-with-google-cloud-integration/",
    "description": "PancakeSwap (CAKE) partners with Google Cloud to achieve high availability and faster operations. Since then, CAKE has hit the fourth spot on top gainers today with a 3.8% price increase in the last 24 hours. Prioritizing continuous availability PancakeSwap, a&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-11T00:00:13.000Z",
    "title": "Bitcoin Inscriptions Cool Off, Transactions Heat Up: What’s Next For The Market?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-inscriptions-cool-off-transactions-heat-up-whats-next-for-the-market/",
    "description": "Bitcoin (BTC) has been consolidating below the mid-point of the 2021-22 cycle at $30,000, with some on-chain activity metrics cooling off while others, such as money transfer volumes, are picking up. This suggests positive momentum and growing adoption for the asset, according to a recent report from Glassnode. Bitcoin Metrics Suggest A Wild Ride Ahead The report highlights that BTC&#8217;s recovery in 2023 has been remarkably robust in terms of price performance and network utilization, indicating strong underlying demand for the asset.  Active address momentum is climbing again, indicating a healthy network and growing adoption of Bitcoin. The balance of supply held in profit vs. loss has reached an equilibrium point, synonymous with the several months-long &#8216;re-accumulation period&#8217; in past cycles. Related Reading: Analyst: Expect Altcoin Season After Bitcoin Halves In 2024 Moreover, the report suggests that BTC volumes being transferred are starting to pick up meaningfully. BTC changing hands, lifting 75% off the FTX lows, now reaching $4.2 billion per day in total settlement. This is a positive sign for the Bitcoin network, indicating a return toward the dominance of BTC monetary transfers. The report also provides a chart demonstrating a significant supply cluster between $15,000 and $30,000, indicating that many coins changed hands over the last 12 months. Conversely, just 25% of the supply was acquired at prices above $30,000, held by buyers from the 2021-22 cycle.  Furthermore, the Long and Short-Term heuristic shows that a sizeable volume of long-term holders (LTH) supply was acquired between $15,000 and $25,000 and remains unspent, despite prices reaching $31,000. Additionally, almost all coins with an acquisition price above $30,000 are held by LTHs, who are likely to create resistance should the market rally higher. Moreover, the report further highlights that the price range between $20,000 and $30,000 has seen expanding accumulation since February, despite regulatory pressure in the US. This supply distribution is quite &#8216;bottom-heavy,&#8217; suggesting a relatively firm foundation of investor holdings exists below $30,000. BTC’s Independence From Altcoins On The Rise Bitcoin&#8217;s correlation with altcoins has declined in the first half of 2023, according to a report by Kaiko, a cryptocurrency market data provider.  The report shows that altcoins have been hit hard by rising regulatory uncertainty in the US, with several exchanges delisting major altcoins over the past few weeks. In contrast, Bitcoin has shown resilience, attracting institutional inflows and benefiting from regulatory clarity around its status as a commodity. Related Reading: Arkham’s New Crypto Intel Trading Platform: A Game Changer For Traders? The report highlights that Bitcoin&#8217;s correlation with other major cryptocurrencies, such as Ethereum, Litecoin, and Bitcoin Cash, has declined significantly since last year.  The decline in correlation is a sign that Bitcoin is becoming less influenced by the movements of other cryptocurrencies, indicating that it is starting to establish itself as a more independent asset. XRP saw the strongest decrease in correlation, which is linked to the token&#8217;s rising volatility as the outcome of the SEC vs. Ripple lawsuit edges closer. The report indicates that XRP&#8217;s volatility has increased significantly in recent months, leading to a sharp decline in its correlation with other cryptocurrencies. The report suggests that Bitcoin&#8217;s resilience in the face of regulatory uncertainty is largely due to its status as a commodity, which has been confirmed by regulatory bodies such as the Commodity and Futures Trading Commission (CFTC).  On BTC&#8217;s one-day chart, the largest cryptocurrency in the market is currently trading at $30,500, reflecting a 0.9% increase over the past 24 hours. Featured image from Unsplash, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-11T00:04:20.000Z",
    "title": "BRICS Planning To Replace US Dollar With New Trading Currency Backed by Gold: Report",
    "url": "https://dailyhodl.com/2023/07/10/brics-planning-to-replace-us-dollar-with-new-trading-currency-backed-by-gold-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/dollar-brics-currency.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/dollar-brics-currency.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/dollar-brics-currency.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/dollar-brics-currency.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/dollar-brics-currency.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/dollar-brics-currency.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/dollar-brics-currency.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An economic alliance of nations known as BRICS is reportedly preparing to introduce a new currency that&#8217;s designed to dethrone the US dollar. According to RT, the new trading currency of BRICS will be backed by gold, a standard that used to define the US dollar over 100 years ago. The currency is set to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/10/brics-planning-to-replace-us-dollar-with-new-trading-currency-backed-by-gold-report/\">BRICS Planning To Replace US Dollar With New Trading Currency Backed by Gold: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-11T00:00:30.000Z",
    "title": "Crypto Analyst Predicts Further Rallies for Avalanche, Updates Forecast on Litecoin and One Additional Altcoin",
    "url": "https://dailyhodl.com/2023/07/10/crypto-analyst-predicts-further-rallies-for-avalanche-updates-forecast-on-litecoin-and-one-additional-altcoin/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/can-avax-do-50.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/can-avax-do-50.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/can-avax-do-50.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/can-avax-do-50.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/can-avax-do-50.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/can-avax-do-50.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/can-avax-do-50.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto strategist believes that Ethereum (ETH) challenger Avalanche (AVAX) is gearing up for a move to the upside. Trader Michaël van de Poppe tells his 660,000 Twitter followers that AVAX looks bullish after briefly moving above resistance at $14. According to Van de Poppe, Avalanche looks poised for a cooldown period before [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/10/crypto-analyst-predicts-further-rallies-for-avalanche-updates-forecast-on-litecoin-and-one-additional-altcoin/\">Crypto Analyst Predicts Further Rallies for Avalanche, Updates Forecast on Litecoin and One Additional Altcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]