[
  {
    "source": "Decrypt",
    "date": "2024-02-22T22:51:54.000Z",
    "title": "Coinbase, a16z Take SEC to Court Over 'Unlawful' Crypto Overreach",
    "url": "https://decrypt.co/218567/coinbase-a16z-take-sec-court-unlawful-crypto-overreach",
    "description": "A coalition of crypto giants including Coinbase and Andreessen Horowitz filed suit against the SEC in Texas, seeking regulatory clarity."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-22T23:03:44.000Z",
    "title": "WorldCoin up 170% weekly to all time-high following OpenAI Sora breakthrough",
    "url": "https://cryptoslate.com/worldcoin-up-170-weekly-to-all-time-high-following-openai-sora-breakthrough/",
    "description": "<p>WorldCoin (WLD) reached a new all-time high of $8.98 on Feb. 22, following significant weekly price gains, according to CryptoSlate data. The token has retreated slightly to $8.69 as of press time. The current price represents 30% gains over 24 hours, 168% over seven days, and 303% over 30 days. WLD&#8217;s $1.16 billion market capitalization [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/worldcoin-up-170-weekly-to-all-time-high-following-openai-sora-breakthrough/\">WorldCoin up 170% weekly to all time-high following OpenAI Sora breakthrough</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-22T23:00:20.000Z",
    "title": "The Polygon Vesting Contract Is Officially Empty, Will This Send MATIC Price To $3?",
    "url": "https://www.newsbtc.com/matic/polygon-vesting-matic-price-3/",
    "description": "Like many other crypto projects, the native token of the Polygon network, MATIC, was launched with some portion of the supply vested for the team over a period of time. In the case of Polygon, the vesting was for five years, and since 2019, there have been periodic token unlocks. However, the unlocks, which have often been a deterrent for investors, are now over, as the last batch was just released to the team. Polygon Last Unlock Goes To Team On Wednesday, February 21, the Polygon Foundation received the very last portion of their vested tokens from the vesting contract. In total, 273,304,816 million MATIC tokens valued at $260 million were released to the Foundation’s wallet. Related Reading: Bitcoin Fisher Transform Reaches Critical Level Not Seen Since 2021, What This Means This unlock marks the very last unlock that the Foundation will receive, meaning that almost all of the available supply of MATIC is now in circulation. The latest unclog brings the circulating supply of the cryptocurrency to 9,618,318,574 out of its 10,000,000,000 maximum supply. As a result of this, the market cap of Polygon is sitting just above $9.14 billion with a fully diluted valuation (FDV) of approximately $5 billion. The entirety of the MATIC supply has been unlocked, which means that there will be no more tokens being brought into circulation. This is a huge milestone for the project, whose investors have waited years for the vested tokens to finally run out. Polygon trending below $1 &#124; Source: MATICUSDT on Tradingview.com How Will This Affect The MATIC Price? The fact that the entirety of the MATIC supply is now in circulation is bullish for the digital asset, especially in the long term. Inflation is a factor that tends to drive investors away and keep them from holding their coins due to the fear of more tokens coming into circulation, causing supply to exceed demand. Related Reading: Finance Expert Drops Grim Prediction For US Economy, Says Bitcoin Is The ‘Parachute’ Now that the entirety of the supply is now in circulation, it gives the MATIC price a chance to enter into price discovery. However, there is still some concern about when the Polygon Foundation might start selling their coins as the entirety of the unlocked tokens still sit in the Foundation’s wallet. If they do decide to sell, though, it is likely that the foundation would do so through OTC (over-the-counter) deals to minimize the impact of such a sale on the token price. As a result, the MATIC price might not suffer much. At the time of writing, the MATIC token is trading at $0.95 with a 24-hour increase of 1.11%. Although its performance has been far from encouraging, the token is sitting only 67% below its 2021 all-time high of $2.92. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Admiral Markets, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-22T23:01:26.000Z",
    "title": "NFT Platform Launches Classic Nintendo 64 Emulator on Bitcoin Blockchain Using BTC Ordinals",
    "url": "https://dailyhodl.com/2024/02/22/nft-platform-launches-classic-nintendo-64-emulator-on-bitcoin-blockchain-using-btc-ordinals/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/02/gamestop-partners-with-nft.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/02/gamestop-partners-with-nft.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/02/gamestop-partners-with-nft.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/02/gamestop-partners-with-nft.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/02/gamestop-partners-with-nft.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/02/gamestop-partners-with-nft.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/02/gamestop-partners-with-nft.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A non-fungible token (NFT) platform is launching a classic Nintendo emulator on Bitcoin (BTC) using BTC ordinals. In a new announcement, NFT platform Pizza Ninjas says it has successfully launched an N64 emulator on the crypto king using ordinals, which inscribe data on satoshis, the smallest unit of BTC. Emulators allow gamers to play video [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/22/nft-platform-launches-classic-nintendo-64-emulator-on-bitcoin-blockchain-using-btc-ordinals/\">NFT Platform Launches Classic Nintendo 64 Emulator on Bitcoin Blockchain Using BTC Ordinals</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]