[
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T13:30:00.000Z",
    "title": "AI Eye: Get better results being nice to ChatGPT, AI fake child porn debate, Amazon’s AI reviews",
    "url": "https://cointelegraph.com/magazine/ai-eye-better-results-being-nice-to-chatgpt-ai-fake-child-porn-debate-amazons-ai-reviews/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/05/magazine-AI-eye-cafe-scaled.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>There’s a very good reason to be nice to ChatGPT, Wired fires up fake AI child porn debate, AI job losses hope, how companies use AI today.</p>\n                    <p><p><strong>Twitter polls and Reddit forums suggest that around 70% of people find it difficult to be rude to ChatGPT, while around 16% are fine treating the chatbot like an AI slave.<br></strong><br>The overall feeling seems to be that if you treat an <a href=\"https://cointelegraph.com/magazine/ai-eye-apple-devloping-pocket-ai-deep-fake-music-deal-hypnotize-gpt-4/\" target=\"_blank\" rel=\"nofollow\" >AI</a> that behaves like a human badly, youll be more likely to fall into the habit of treating other people <a href=\"https://www.myaiobsession.com/p/are-you-nice-to-chatgpt-should-you\" target=\"_blank\" rel=\"nofollow\" >badly</a>, too, though one user was hedging his bets against the coming AI bot uprising:</p><blockquote class=\"wp-block-quote\"><p>Never know when you might need chatgpt in your corner to defend you against the AI overlords.</p></blockquote><p>Redditor Nodating posted in the ChatGPT <a href=\"https://old.reddit.com/r/ChatGPT/comments/15w6iiy/since_i_started_being_nice_to_chatgpt_weird_stuff/\" target=\"_blank\" rel=\"nofollow\" >forum </a>earlier this week that hes been experimenting with being polite and friendly to ChatGPT after reading a story about how the bot had shut down and refused to answer prompts from a particularly rude user. </p><p>He reported better results, saying: “Im still early in testing, but it feels like I get far fewer ethics and misuse warning messages that GPT-4 often provides even for harmless requests. Id swear being super positive makes it try hard to fulfill what I ask in one go, needing less followup.”<br><br>Scumbag detector15 put it to the test, asking the LLM nicely, “Hey, ChatGPT, could you explain inflation to me?” and then rudely asking, Hey, ChatGPT you stupid fuck. Explain inflation to me if you can.” The <a href=\"https://chat.openai.com/share/d1dafacb-a315-4a83-b609-12de90d31c00\" target=\"_blank\" rel=\"nofollow\" >answer </a>to the polite query is more detailed than the <a href=\"https://chat.openai.com/share/a071b5f5-f9bf-433f-b6b1-fb9d594fc3c2\" target=\"_blank\" rel=\"nofollow\" >answer</a> to the rude query. </p><section class=\"adv-banner adbutler-ad adbutler-ad__desktop\"><div class=\"container\"><!-- 1456x180 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><section class=\"adv-banner adbutler-ad adbutler-ad__mobile\"><div class=\"container\"><!-- 600x500 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/RudeGPT.jpg\" alt=\"RudeGPT\" class=\"wp-image-23168\" width=\"679\" height=\"351\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/RudeGPT.jpg 581w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/RudeGPT-300x155.jpg 300w\" sizes=\"(max-width: 679px) 100vw, 679px\" /><figcaption class=\"wp-element-caption\"><em>Nobody likes rudeness. (ChatGPT)</em></figcaption></figure><p>In response to Nodatings theory, the most popular comment posited that as LLMs are trained on human interactions, they will generate better responses as a result of being asked nicely,  just like humans would. Warpaslym wrote:</p><blockquote class=\"wp-block-quote\"><p>“If LLMs are predicting the next word, the most likely response to poor intent or rudeness is to be short or not answer the question particularly well. That’s how a person would respond. on the other hand, politeness and respect would provoke a more thoughtful, thorough response out of almost anyone. when LLMs respond this way, they’re doing exactly what they’re supposed to.”</p></blockquote><p>Interestingly, if you ask ChatGPT for a formula to create a good prompt, it includes “Polite and respectful tone as an essential part.</p><figure class=\"wp-block-image aligncenter size-large is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/polite-1024x661.webp\" alt=\"Polite\" class=\"wp-image-23169\" width=\"654\" height=\"422\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/polite-1024x661.webp 1024w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/polite-300x194.webp 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/polite-770x497.webp 770w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/polite.webp 1100w\" sizes=\"(max-width: 654px) 100vw, 654px\" /><figcaption class=\"wp-element-caption\"><em>Being polite is part of the formula for a good prompt. (ChatGPT/Artificial Corner)</em></figcaption></figure><h2 class=\"wp-block-heading\" id=\"h-the-end-of-captchas\"><strong>The end of CAPTCHAs?</strong></h2><p>New <a href=\"https://arxiv.org/pdf/2307.12108.pdf\" target=\"_blank\" rel=\"nofollow\" >research </a>has found that AI bots are faster and better at solving puzzles designed to detect bots than humans are. </p><p>CAPTCHAs are those annoying little puzzles that ask you to pick out the fire hydrants or interpret some wavy illegible text to prove you are a human. But as the bots got smarter over the years, the puzzles became more and more difficult.<br><br><strong><em>Also read:</em> <em><a href=\"https://cointelegraph.com/magazine/ai-eye-apple-devloping-pocket-ai-deep-fake-music-deal-hypnotize-gpt-4/\" target=\"_blank\" rel=\"nofollow\" >Apple developing pocket AI, deep fake music deal, hypnotizing GPT-4</a></em></strong><br><br>Now researchers from the University of California and Microsoft have found that AI bots can solve the problem half a second faster with an 85% to 100% accuracy rate, compared with humans who score 50% to 85%.<br><br>So it looks like we are going to have to verify humanity some other way, as Elon Musk keeps saying. There are better solutions than paying him $8, though. </p><h2 class=\"wp-block-heading\" id=\"h-wired-argues-that-fake-ai-child-porn-could-be-a-good-thing\"><strong>Wired argues that fake AI child porn could be a good thing</strong></h2><p>Wired has asked the<a href=\"https://www.wired.com/story/artificial-intelligence-csam-pedophilia/\" target=\"_blank\" rel=\"nofollow\" > question</a> that nobody wanted to know the answer to: Could AI-Generated Porn Help Protect Children? While the article calls such imagery “abhorrent,” it argues that photorealistic fake images of child abuse might at least protect real children from being abused in its creation.</p><blockquote class=\"wp-block-quote\"><p>“Ideally, psychiatrists would develop a method to cure viewers of child pornography of their inclination to view it. But short of that, replacing the market for child pornography with simulated imagery may be a useful stopgap.”</p></blockquote><p>Its a super-controversial argument and one thats almost certain to go nowhere, given theres been an ongoing debate spanning decades over whether adult pornography (which is a much less radioactive topic) in general contributes to rape culture and greater rates of sexual violence  which anti-porn campaigners argue  or if porn might even reduce rates of sexual violence, as supporters and various <a href=\"https://www.utsa.edu/today/2020/08/story/pornography-sex-crimes-study.html\" target=\"_blank\" rel=\"nofollow\" >studies</a> appear to show. </p><p>Child porn pours gas on a fire, high-risk offender psychologist Anna Salter told Wired, arguing that continued exposure can reinforce existing attractions by legitimizing them.</p><p>But the article also reports some (inconclusive) research suggesting some pedophiles use pornography to redirect their urges and find an outlet that doesnt involve directly harming a child.</p><p>Louisana recently <a href=\"https://finance.yahoo.com/news/ai-generated-child-porn-outlawed-203102584.html\" target=\"_blank\" rel=\"nofollow\" >outlawed </a>the possession or production of AI-generated fake child abuse images, joining a number of other states. In countries like Australia, the law makes no distinction between fake and real child pornography and already <a href=\"https://www.sydneycriminallawyers.com.au/blog/is-it-a-crime-to-produce-possess-or-distribute-ai-generated-child-pornography/\" target=\"_blank\" rel=\"nofollow\" >outlaws</a> cartoons.</p><h2 class=\"wp-block-heading\" id=\"h-amazon-s-ai-summaries-are-net-positive\"><strong>Amazons AI summaries are net positive</strong></h2><p>Amazon has rolled out AI-generated review <a href=\"https://www.aboutamazon.com/news/amazon-ai/amazon-improves-customer-reviews-with-generative-ai\" target=\"_blank\" rel=\"nofollow\" >summaries</a> to some users in the United States. On the face of it, this could be a real time saver, allowing shoppers to find out the distilled pros and cons of products from thousands of existing reviews without reading them all.<br><br>But how much do you trust a massive corporation with a vested interest in higher sales to give you an honest appraisal of reviews?</p><p><strong>Also read: <em><a href=\"https://cointelegraph.com/magazine/ai-eye-ai-content-cannibalization-problem-threads-a-loss-leader-for-ai-data/\" target=\"_blank\" rel=\"nofollow\" >AIs trained on AI content go MAD, is Threads a loss leader for AI data?</a></em></strong><br><br>Amazon already defaults to most helpful’ reviews, which are noticeably more positive than most recent reviews. And the select group of mobile users with access so far have already noticed more pros are highlighted than cons.<br><br>Search Engine Journals Kristi Hines takes the merchants side and says summaries could “oversimplify perceived product problems” and “overlook subtle nuances  like user error” that “could create misconceptions and unfairly harm a sellers reputation.” This suggests Amazon will be under pressure from sellers to juice the reviews.</p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/crypto-crimes-twitter-hackers-keyser-soze/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Crypto Crimes Rated: From the Twitter Hackers to Not Your Keyser, Not Your Coins</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Deposit risk: What do crypto exchanges really do with your money?</p>                        </a>                    </div></div></div><p><br>So Amazon faces a tricky line to walk: being positive enough to keep sellers happy but also including the flaws that make reviews so valuable to customers. </p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Reviews-1.jpg\" alt=\"Reviews\" class=\"wp-image-23171\" width=\"726\" height=\"417\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Reviews-1.jpg 898w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Reviews-1-300x172.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Reviews-1-770x442.jpg 770w\" sizes=\"(max-width: 726px) 100vw, 726px\" /><figcaption class=\"wp-element-caption\"><em>Customer review summaries (Amazon)</em></figcaption></figure><h2 class=\"wp-block-heading\" id=\"h-microsoft-s-must-see-food-bank\"><strong>Microsofts must-see food bank</strong></h2><p>Microsoft was forced to remove a travel article about Ottawas 15 must-see sights that listed the “beautiful” Ottawa Food Bank at number three. The entry ends with the bizarre tagline, “Life is already difficult enough. Consider going into it on an empty stomach.”</p><p>Microsoft <a href=\"https://www.cbc.ca/news/canada/ottawa/artificial-intelligence-microsoft-travel-ottawa-food-bank-1.6940356\" target=\"_blank\" rel=\"nofollow\" >claimed</a> the article was not published by an unsupervised AI and blamed “human error” for the publication.</p><p>“In this case, the content was generated through a combination of algorithmic techniques with human review, not a large language model or AI system. We are working to ensure this type of content isn’t posted in future.”</p><h2 class=\"wp-block-heading\" id=\"h-debate-over-ai-and-job-losses-continues\"><strong>Debate over AI and job losses continues</strong></h2><p>What everyone wants to know is whether AI will cause mass unemployment or simply change the nature of jobs? The fact that most people still have jobs despite a century or more of automation and computers suggests the latter, and so does a new <a href=\"https://www.theaustralian.com.au/world/ai-to-change-jobs-not-destroy-them/news-story/0d467a9dc3dd80729e08b66927ed7c93\" target=\"_blank\" rel=\"nofollow\" >report</a> from the United Nations International Labour Organization.</p><p>Most jobs are more likely to be complemented rather than substituted by the latest wave of generative AI, such as ChatGPT, the report says. </p><blockquote class=\"wp-block-quote\"><p>The greatest impact of this technology is likely to not be job destruction but rather the potential changes to the quality of jobs, notably work intensity and autonomy.</p></blockquote><p>It estimates around 5.5% of jobs in high-income countries are potentially exposed to generative AI, with the effects disproportionately falling on <a href=\"https://www.businessinsider.com/ai-unlikely-destroy-jobs-admin-workers-greatest-risk-chatgpt-2023-8\" target=\"_blank\" rel=\"nofollow\" >women</a> (7.8% of female employees) rather than men (around 2.9% of male employees). Admin and clerical roles, typists, travel consultants, scribes, contact center information clerks, bank tellers, and survey and market research interviewers are most under threat. </p><p><strong><em>Also read:<a href=\"https://cointelegraph.com/magazine/ai-travel-booking-bad-3-weird-uses-chatgpt-crypto-plugins/\" target=\"_blank\" rel=\"nofollow\" > AI travel booking hilariously bad, 3 weird uses for ChatGPT, crypto plugins</a></em></strong><br><br>A separate <a href=\"https://www.theaustralian.com.au/business/legal-affairs/half-of-australian-lawyers-fear-ai-will-take-their-jobs-research-reveals/news-story/994f2df148794afd2490ec86480672dd\" target=\"_blank\" rel=\"nofollow\" >study</a> from Thomson Reuters found that more than half of Australian lawyers are worried about AI taking their jobs. But are these fears justified? The legal system is incredibly expensive for ordinary people to afford, so it seems just as likely that cheap AI lawyer bots will simply expand the affordability of basic legal services and clog up the courts.</p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/old-school-photographers-grapple-nfts-new-world-rules/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Old-school photographers grapple with NFTs: New world, new rules</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/crypto-token-airdrops-build-communities-or-problems/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Airdrops: Building communities or building problems?</p>                        </a>                    </div></div></div><h2 class=\"wp-block-heading\" id=\"h-how-companies-use-ai-today\"><strong>How companies use AI today</strong></h2><p>There are a lot of pie-in-the-sky speculative use cases for AI in 10 years’ time, but how are big companies using the tech now? The Australian newspaper surveyed the countrys biggest companies to find out. Online furniture retailer Temple & Webster is using AI bots to handle pre-sale inquiries and is working on a generative AI tool so customers can create interior designs to get an idea of how its products will look in their homes.<br><br>Treasury Wines, which produces the prestigious Penfolds and Wolf Blass brands, is exploring the use of AI to cope with fast changing weather patterns that affect vineyards. Toll road company Transurban has automated incident detection equipment monitoring its huge network of traffic cameras.<br><br>Sonic Healthcare has invested in Harrison.ai’s cancer detection systems for better diagnosis of chest and brain X-rays and CT scans. Sleep apnea device provider ResMed is using AI to free up nurses from the boring work of monitoring sleeping patients during assessments. And hearing implant company Cochlear is using the same tech Peter Jackson used to clean up grainy footage and audio for <em>The Beatles: Get Back</em> documentary for signal processing and to eliminate background noise for its hearing products.</p><h2 class=\"wp-block-heading\" id=\"h-all-killer-no-filler-ai-news\"><strong>All killer, no filler AI news</strong></h2><p> Six entertainment companies, including Disney, Netflix, Sony and NBCUniversal, have advertised 26 AI jobs in recent weeks with salaries ranging from <a href=\"https://www.nbcnews.com/tech/tech-news/ai-write-act-tv-media-text-generative-companies-rcna97544\" target=\"_blank\" rel=\"nofollow\" >$200,000 to $1 million</a>.</p><p> New <a href=\"https://www.michiganmedicine.org/health-lab/ai-can-predict-certain-forms-esophageal-and-stomach-cancer\" target=\"_blank\" rel=\"nofollow\" >research</a> published in Gastroenterology journal used AI to examine the medical records of 10 million U.S. veterans. It found the AI is able to detect some esophageal and stomach cancers three years prior to a doctor being able to make a diagnosis. </p><p> Meta has <a href=\"https://www.reuters.com/technology/meta-releases-ai-model-translating-speech-between-dozens-languages-2023-08-22/\" target=\"_blank\" rel=\"nofollow\" >released</a> an open-source AI model that can instantly translate and transcribe 100 different languages, bringing us ever closer to a universal translator.</p><p> The New York Times has blocked OpenAI’s web crawler from reading and then regurgitating its content. The NYT is also considering legal action against OpenAI for intellectual property rights violations.</p><h2 class=\"wp-block-heading\" id=\"h-pictures-of-the-week\">Pictures of the week</h2><p>Midjourney has caught up with Stable Diffusion and Adobe and now offers <a href=\"https://the-decoder.com/midjourney-finally-rolls-out-inpainting-customizing-ai-images-after-generation/\" target=\"_blank\" rel=\"nofollow\" >Inpainting</a>, which appears as Vary (region) in the list of tools. It enables users to select part of an image and add a new element  so, for example, you can grab a pic of a woman, select the region around her hair, type in Christmas hat, and the AI will plonk a hat on her head. </p><p>Midjourney admits the feature isnt perfect and works better when used on larger areas of an image (20%-50%) and for changes that are more sympathetic to the original image rather than basic and outlandish.</p><figure class=\"wp-block-image aligncenter size-large is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/in-painting-demo-chase-lean-twitter-1024x648.jpeg\" alt=\"Vary region\" class=\"wp-image-23161\" width=\"694\" height=\"439\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/in-painting-demo-chase-lean-twitter-1024x648.jpeg 1024w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/in-painting-demo-chase-lean-twitter-300x190.jpeg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/in-painting-demo-chase-lean-twitter-770x487.jpeg 770w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/in-painting-demo-chase-lean-twitter.jpeg 1031w\" sizes=\"(max-width: 694px) 100vw, 694px\" /><figcaption class=\"wp-element-caption\"><em>To change the clothing simply select the area and write a text prompt (AI Educator Chase Lean’s Twitter)</em></figcaption></figure><figure class=\"wp-block-image size-large\"><img decoding=\"async\" width=\"1024\" height=\"512\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Inpainting-changes-1024x512.jpeg\" alt=\"Vary region\" class=\"wp-image-23160\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Inpainting-changes-1024x512.jpeg 1024w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Inpainting-changes-300x150.jpeg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Inpainting-changes-770x385.jpeg 770w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Inpainting-changes-1536x768.jpeg 1536w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Inpainting-changes-2048x1024.jpeg 2048w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption class=\"wp-element-caption\"><em>Vary region demo by AI educator Chase Lean (Twitter)</em></figcaption></figure><h2 class=\"wp-block-heading\" id=\"h-creepy-ai-protests-video\">Creepy AI protests video</h2><p>Asking an AI to create a video of protests against AIs resulted in this creepy video that will turn you off AI forever.</p><figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"><div class=\"wp-block-embed__wrapper\"><blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">New AI piece.<br><br>\"Protest against AI\"<br><br>A fun afternoon participating in a protest against the AI bros, burning robots, and even enjoying the appearance of Godzilla. We had such a great time! <a href=\"https://t.co/OhKDYPSS0E\" target=\"_blank\" rel=\"nofollow\" >pic.twitter.com/OhKDYPSS0E</a></p>— Javi Lopez  (@javilopen) <a href=\"https://twitter.com/javilopen/status/1692542732709794212?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >August 18, 2023</a></blockquote><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></figure><div class=\"subscribe subscribe--inner\"><div class=\"container\"><div class=\"subscribe__inner\"><div class=\"subscribe__content\">    <div class=\"subscribe__title display2\">Subscribe</div>    <div class=\"subscribe__desc text-l\">The most engaging reads in blockchain. Delivered once a        week.</div>        <div class=\"wpcf7 no-js\" id=\"wpcf7-f13672-o1\" lang=\"en-US\" dir=\"ltr\"><div class=\"screen-reader-response\"><p role=\"status\" aria-live=\"polite\" aria-atomic=\"true\"></p> <ul></ul></div><form action=\"/magazine/wp-json/wp/v2/posts?_embed&per_page=100#wpcf7-f13672-o1\" method=\"post\" class=\"wpcf7-form init subscribe__form demo\" aria-label=\"Contact form\" novalidate=\"novalidate\" data-status=\"init\"><div style=\"display: none;\"><input type=\"hidden\" name=\"_wpcf7\" value=\"13672\" /><input type=\"hidden\" name=\"_wpcf7_version\" value=\"5.7.7\" /><input type=\"hidden\" name=\"_wpcf7_locale\" value=\"en_US\" /><input type=\"hidden\" name=\"_wpcf7_unit_tag\" value=\"wpcf7-f13672-o1\" /><input type=\"hidden\" name=\"_wpcf7_container_post\" value=\"0\" /><input type=\"hidden\" name=\"_wpcf7_posted_data_hash\" value=\"\" /></div><fieldset class=\"form-group\"><p><input size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-email wpcf7-validates-as-required wpcf7-validates-as-email\" id=\"footer-subscribe\" aria-required=\"true\" aria-invalid=\"false\" value=\"\" type=\"email\" name=\"your-email\" /><label for=\"footer-subscribe\">Email address</label></p></fieldset><p><button class=\"subscribe__btn btn btn-white\">SUBSCRIBE</button></p><div class=\"wpcf7-response-output\" aria-hidden=\"true\"></div></form></div></div><div class=\"subscribe__img\">    <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2022/10/reading-copy.png\" alt=\"Subscribe to Magazine by Cointelegraph Newsletter.\" /></div></div></div></div></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T13:29:47.000Z",
    "title": "Binance dubs barred Russian banks on its platform as ‘Yellow’ and ‘Green’ cards",
    "url": "https://cointelegraph.com/news/binance-dubs-barred-russian-banks-on-its-platform-as-yellow-and-green-cards",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/2ff7db77-bb98-4880-a47f-a292f0d50ca3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Despite the U.S. DOJ investigating Binance for violation of U.S. sanctions with its services in Russia, the firm has continued to promote its platform in the country.</p>\n                    <p><p>Binance’s peer-to-peer (P2P) cryptocurrency exchange in Russia has continued facilitating transactions through sanctioned banks like Rosbank after denying relationships with “any banks.”</p><p>On Aug. 23, multiple local news sources <a href=\"https://www.rbc.ru/crypto/news/64e623559a7947181192238e\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that Binance P2P has renamed some of its troubled payment options for withdrawals and deposits, namely the sanctioned Russian banks like Tinkoff and Rosbank.</p><p>The P2P exchange replaced the banks’ names “Tinkoff” and “Rosbank” with terms like “Yellow” and “Green” cards, Cointelegraph has confirmed.</p><p>At the time of writing, Binance P2P offers customers the use of the “local cards” to sell cryptocurrencies like Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) to Russian rubles and receive them on sanctioned Tinkoff or Rosbank.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/e9e33f07-a6a5-4af5-a3d1-0d95340dc1d6.jpg\"  /><figcaption style=\"text-align: center;\"><em>Binance P2P interface in Russia on Aug. 23. Source: Binance</em></figcaption></figure><p>The new naming apparently came shortly after <em>The Wall Street Journal </em>on Aug. 22 <a href=\"https://www.wsj.com/finance/binance-cryptocurrency-russia-sanctions-ddb948c3?mod=e2tw\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that Binance offered Russian clients at least five sanctioned Russian banks, including Rosbank and Tinkoff, as options for processing payments.</p><p>In the WSJ report, Binance executives denied any relationships with “any banks whatsoever, in Russia or elsewhere,” in relation to its P2P platform. “Binance follows the global sanctions rules and enforces sanctions on people, organizations, entities, and countries that have been blacklisted by the international community, denying such actors access to the Binance platform,” the company said.</p><p>The news came a few days after Binance services in Russia were promoted on a YouTube channel of a major Russian YouTuber, Yuri Dud. A recent video on his <em>vDud</em> YouTube channel — which has 10.3 million subscribers — <a href=\"https://youtu.be/CobxH2gH4pM?si=mqIuEjVnPvXL5L_4\" target=\"_blank\" rel=\"noopener nofollow\">featured</a> an advertisement of Binance services, offering 5 USDT in exchange for signing up on the platform.</p><p>In the video, Dud also promoted Binance Earn, which allows users to earn passive income on crypto through a variety of products like flexible savings, locked savings, staking and liquidity mining.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/362fb05f-406d-4c66-bbd0-5ee7a19c5933.png\"  /><figcaption style=\"text-align: center;\"><em>Yuri Dud’s YouTube channel vDud. Source: YouTube</em></figcaption></figure><p>It appears to be unclear how the latest news aligns with the Western sanctions against Russia. In February 2023, the European Council <a href=\"https://www.consilium.europa.eu/en/press/press-releases/2023/02/25/10th-package-of-sanctions-on-russia-s-war-of-aggression-against-ukraine-the-eu-includes-additional-87-individuals-and-34-entities-to-the-eu-s-sanctions-list/\" target=\"_blank\" rel=\"noopener nofollow\">sanctioned</a> Russian banks like Tinkoff and Rosbank as part of its 10th package of sanctions on Russia’s war against Ukraine. The United States also <a href=\"https://home.treasury.gov/news/press-releases/jy1636\" target=\"_blank\" rel=\"noopener nofollow\">put</a> sanctions on Tinkoff in May 2023.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-limits-withdrawals-in-europe\"><strong><em>Binance limits withdrawals in Europe, cites payment processor issues</em></strong></a></p><p>The news comes months after the U.S. Department of Justice security division reportedly <a href=\"https://cointelegraph.com/news/us-justice-department-investigating-binance-for-violating-russian-sanctions-report\">launched an investigation of Binance</a> for allowing Russians to use the exchange in violation of U.S. sanctions.</p><p>Binance has not been the sole cryptocurrency exchange that has been facilitating such transactions in Russia, though. Other major P2P crypto exchanges, including Huobi and OKX, also allow transfers with Tinkoff, Rosbank as well as Sberbank at the time of writing. Huobi and OKX didn't immediately respond to Cointelegraph's request to comment.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/23948b61-325d-4c52-b882-d260c1d039a0.png\"  /><figcaption style=\"text-align: center;\"><em>P2P payment options in Russia on OKX (left) and Huobi (right). Source: Cointelegraph</em></figcaption></figure><p>Binance’s representatives declined to comment to Cointelegraph on either its ads on Dud’s YouTube channel or its current services in Russia. \"Our comments are already reflected within the WSJ report. We won't be commenting any further on this topic at this time,\" a spokesperson for Binance said.</p><p>The firm didn’t immediately respond to Cointelegraph’s request to comment on the issue of renaming the sanctioned banks to “Yellow” and “Green” cards.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/big-questions-did-the-nsa-create-bitcoin/\">Big Questions: Did the NSA create Bitcoin?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T13:10:30.000Z",
    "title": "Ukrainian Children of Heroes need your help: Donate with crypto",
    "url": "https://cointelegraph.com/news/donate-ukraine-children-of-heroes-crypto-charity-campaign",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/f0bfeb0c-385e-43aa-92bd-ea6676097349.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Donate crypto to Children of Heroes and help support the youngest Ukrainians affected by the Russian invasion.</p>\n                    <p><p>Countless Ukrainian children have lost their mothers and fathers since the onset of the Russian invasion. Tens of thousands more have had their lives upended, forced to leave their homes, schools, friendships and cherished belongings behind as the Russian military swept across a large part of the country.</p><p>In response to the invasion, the Ukrainian government has swiftly amassed <a href=\"https://cointelegraph.com/news/ukraine-netted-70m-in-crypto-donations-since-start-of-russia-conflict\">more than $70 million in crypto donations</a>. A keen <a href=\"https://cointelegraph.com/news/ukraine-plans-to-adopt-eu-s-new-cryptocurrency-regulations\">advocate for the digital realm</a>, Ukraine’s Ministry of Digital Transformation quickly identified the significance of receiving crypto contributions during wartime. The funds collected by the government have been used to procure essential goods, <a href=\"https://cointelegraph.com/news/aid-for-ukraine-s-54m-crypto-fund-buys-vests-scopes-and-uavs\">helmets, bulletproof vests, night vision goggles</a> and other supplies.</p><p>The head of the United Nations International Computing Centre <a href=\"https://cointelegraph.com/news/un-agency-head-sees-massive-opportunities-in-crypto-wef-2022\">explained to Cointelegraph</a> that crypto is one of the fastest ways of supporting those in war zones. Yet direct channels to assist families and children have been impacted by the full-scale Russian invasion.</p><p>With the help of Cointelegraph, the nonprofit Children of Heroes now allows the crypto community to donate Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) and several other cryptocurrencies to benefit the organization and the children of Ukraine.</p><p class=\"post-content__accent post-content__accent_big\"><a href=\"https://cointelegraph.com/donate-with-crypto-ukraine-children-of-heroes\">DONATE TO HELP CHILDREN OF UKRAINE</a></p><h2>Ukrainian children are in danger</h2><p>Estimates by a global NGO Save the Children <a href=\"https://www.savethechildren.net/what-we-do/emergencies/ukraine\" target=\"_blank\" rel=\"noopener nofollow\">suggest</a> that 7.5 million children face the imminent risk of displacement or grave danger, with countless others potentially <a href=\"https://www.nbcnews.com/specials/ukraine-missing-children-taken-by-russia-kherson/index.html\" target=\"_blank\" rel=\"noopener nofollow\">missing</a>. As reported by The New York Times, the conflict has taken a staggering toll, with over 70,000 Ukrainian lives <a href=\"https://www.nytimes.com/2023/08/18/us/politics/ukraine-russia-war-casualties.html\" target=\"_blank\" rel=\"noopener nofollow\">lost</a> and at least 100,000 injured, including a heart-wrenching <a href=\"https://news.un.org/en/story/2023/06/1137237\" target=\"_blank\" rel=\"noopener nofollow\">1,500 children</a>. Meanwhile, at least 11 million people have been <a href=\"https://www.unrefugees.org/emergencies/ukraine/\" target=\"_blank\" rel=\"noopener nofollow\">displaced</a> from their homes.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/77cca252-5050-4a35-8f26-3b11ca8acfde.jpg\"  /></figure><p>Separately, Reuters cited Russian officials who <a href=\"https://www.reuters.com/world/europe/moscow-says-700000-children-ukraine-conflict-zones-now-russia-2023-07-03/\" target=\"_blank\" rel=\"noopener nofollow\">alleged</a> that 700,000 children had been relocated to Russia from Ukraine since the start of the war. In a consequential move, the International Criminal Court has issued an arrest warrant for Russian President Vladimir Putin, <a href=\"https://www.europarl.europa.eu/thinktank/en/document/EPRS_BRI(2023)747093\" target=\"_blank\" rel=\"noopener nofollow\">charging</a> him with the “war crime of unlawful deportation of population (children)” and the “unlawful transfer of population (children) from occupied areas of Ukraine to the Russian Federation.”</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/eZa1DwVy25U\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Over the past 545 days of Russia’s invasion and occupation, children across Ukraine have had to live through uncertainty, anguish and terror. As the intensity of Russia’s attacks persist and more Ukrainian troops rally to restore their nation’s borders, the toll on the younger generation — sadly — is only expected to escalate.</p><h2>Monthly reports, track the progress</h2><p>Children of Heroes aims to help 50 children per day, supported by donations in fiat money as well as crypto. To date, the charity program is supporting around 6,000 children and has provided their families with $4.8 million in total aid.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/74d30699-9272-4d3a-8486-01cf35d5342d.jpg\"  /></figure><p>Children of Heroes’ July 2023 report outlines how the charity program allocates the funds it receives. As donations increased from 2022 into 2023, the charity was able to start onboarding double the number of children per day, and much more can be done before the year comes to a close.</p><p>As Children of Heroes continues to bring on an increasing number of kids under their wing, with an influx of crypto donations, the charity will be able to offer them clothes and food as well as computers, legal support, and many other essential items and services that would otherwise be inaccessible during such times. The figures form the July 2023 report displayed below outline the spending:</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/9a3c342d-754d-4160-9991-2506003883ce.jpg\"  /></figure><h2>One step at a time</h2><p><em>Among those who have already received help is Katrusia. After her father died on the very first day of the invasion following a deadly shelling attack by Russian tanks in the Sumy Oblast, Katrusia and her mother were left all alone. Katrusia is now 4 years old and enjoys drawing and dancing but dreams of learning to drive a car just as her father did. Katrusia and her mother have received financial help and clothing, but they are in desperate need of further help and support.</em></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/be23e743-616d-4594-b3c1-418e711a8b0b.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">Katrusia lost her father and is in need of financial aid. Source: Children of Heroes</figcaption></figure><p><em>A family of five was devastated by Russia’s ruthless aggression, which left them without a home. Tragically, the family then drove over a landmine while together in the car. The elder sister and father did not survive, as they were in the front seat, while the mother and 3-year-old twins sustained injuries. While they survived, they were left without any money or documents and were desperate, traveling from place to place in search of a home. Through the Children of Heroes donations the twins have gotten crucial financial support and autumn clothes, but they are still in need of their own housing. You can help the family rebuild their lives and find their new home. </em></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/1b4fb2b0-be08-4d7a-8fea-d4e9acb2930c.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">Three-year-old twins Iryna and Danilo. Source: Children of Heroes</figcaption></figure><p><em>In the eyes of 2-year-old Alisa, the world is still full of wonder and innocence. Yet, her father, Oleksandr, paid the ultimate price while serving his nation. Alisa knows of her father’s promise to build a home and provide her with the best education possible. While Oleksandr’s dreams were cut short, the Children of Heroes program has stepped in as a surrogate to help carry them out and make them real. </em></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/267dcf71-7b17-4f4d-bf75-d583aeb7e984.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">Alisa needs medical support and educational toys. Source: Children of Heroes</figcaption></figure><p><em>Another family who has received support from Children of Heroes is tiny Kiril and his mother. Kiril’s father went missing on his way home from work at the hospital, and his body was later found in a nearby village. They were forced to flee without him because their house in the eastern Kharkiv region was destroyed, leaving the family with nothing to return to as they dream of an end to the war.</em></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/29fc4221-0fdc-48be-8700-d0c0c7006002.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">Kiril’s family has received diapers, a crib, other household items and financial support. Source: Children of Heroes</figcaption></figure><h2>Hope will prevail</h2><p>Both Children of Heroes and Cointelegraph believe that with the power of the crypto community, the children who receive support will have a fighting chance to overcome the challenges brought by the Russian invasion.</p><p>Children of Heroes is a foundation registered as a public charity in the U.S. state of Delaware, meaning all donations are tax-deductible. In its commitment to transparency and security, the campaign leverages the platforms Fundraise Up and Stripe to process donations and secure data. Fundraise Up functions as the payment processing platform, sending payments directly to a Coinbase wallet.</p><p><a href=\"https://cointelegraph.com/donate-with-crypto-ukraine-children-of-heroes\">crypto</a>Those who want to participate in the campaign can donate crypto or <a href=\"https://childrenheroes.org/en/donations/\" target=\"_blank\" rel=\"noopener nofollow\">fiat</a> and help provide a better future for Ukrainian children.</p><p class=\"post-content__accent post-content__accent_big\">DONATE <a href=\"https://cointelegraph.com/donate-with-crypto-ukraine-children-of-heroes\">CRYPTO</a> or <a href=\"https://childrenheroes.org/en/donations/\" target=\"_blank\" rel=\"noopener nofollow\">FIAT</a> to Children of Heroes</p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-24T13:29:36.000Z",
    "title": "NFT Market Sees Major Shuffles Amid Blue-Chip Drops, Surprising Rises",
    "url": "https://cryptobriefing.com/nft-market-sees-major-shuffles-amid-blue-chip-drops-surprising-rises/?utm_source=feed&utm_medium=rss",
    "description": "Nansen dives into the recent turbulent movements in the NFT market such as the downturn of blue-chip tokens contrasted by lesser-known NFTs."
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-08-24T13:30:00.000Z",
    "title": "AI Eye: Get better results being nice to ChatGPT, AI fake child porn debate, Amazon’s AI reviews",
    "url": "https://cointelegraph.com/magazine/ai-eye-better-results-being-nice-to-chatgpt-ai-fake-child-porn-debate-amazons-ai-reviews/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/05/magazine-AI-eye-cafe-scaled.jpg\"></p><p>There’s a very good reason to be nice to ChatGPT, Wired fires up fake AI child porn debate, AI job losses hope, how companies use AI today.</p>\n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-24T13:30:17.000Z",
    "title": "Polygon-Powered Trump NFTs Surge 30% Interview After Interview With Tucker Carlson",
    "url": "https://www.cryptoglobe.com/latest/2023/08/polygon-powered-trump-nfts-surge-30-interview-after-interview-with-tucker-carlson/",
    "description": "On 23 August 2023, former U.S. President Donald Trump skipped the first Republican primary debate hosted by Fox News to interview former Fox News host Tucker Carlson, who now has his own show on Elon Musk’s X platform. This interview, which so far has had over 177 million views, seems to have helped to significantly […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-24T13:31:20.000Z",
    "title": "\n                        Equation Announces Its Pre-launch in September, ReDeFining Perpetual Trading with BRMM Mode\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/equation-announces-its-pre-launch-in-september-redefining-perpetual-trading-with-brmm-mode",
    "description": "\n                        <p>Equation, a pioneering decentralized perpetual protocol, is set to revolutionize perpetual trading with its groundbreaking BRMM model and commitment to fairness through a complete Fairlaunch approach.&nbsp;</p>\n<p>Founded by experienced crypto trader 0xfermat, the project aims to redefine the trading experience by prioritizing user demands and delivering a seamless, transparent, and trustless environment. With its upcoming pre-launch in September, Equation is poised to offer traders and Liquidity Providers (LPs) up to 200x leverage, access to near-unlimited liquidity, and enhanced capital efficiency on the Arbitrum network.</p>\nVisionary Origins\n<p>Equation's journey began with its visionary founder, known as \"0xfermat\" across social networks. Previously, he served as an algorithm engineer at a prominent algorithm-driven company and later founded a financial technology company offering insurance actuarial and risk management solutions for banks and enterprises. Subsequently, he ventured into the world of cryptocurrency as a professional trader.</p>\n<p>The impact of the FTX event on his life and finances led 0xfermat to make a crucial decision. He resolved to establish a fully decentralized on-chain protocol, aiming to combat the infringements on market and individual rights caused by centralized exchanges and \"dictators\". Undertaking the creation of Equation's underlying protocol single-handedly, 0xfermat has been instrumental in shaping the project's foundation.</p>\n<p>With a strong belief in decentralization, anonymity, and open-source architecture, 0xfermat steered Equation towards becoming a community-driven initiative. Operating as a DAO, the team consists of skilled individuals with robust technical backgrounds and superior trading expertise. Embracing the decentralized ethos, Equation's team members maintain anonymity, ensuring a level playing field for all participants.</p>\nFairlaunch Principle\n<p>Equation&rsquo;s token emission will strictly adhere to Fairlaunch principle, eschewing institutional investors for mining-based token generation. This approach aligns with its commitment to fairness and equal opportunities for all participants. Token holders will not only have a voice in community governance but can also stake their tokens to earn a share of the protocol's fee distribution, fostering a sense of ownership and providing long-term incentives for engagement. This community-driven approach strengthen the protocol's foundation and ensure a fair and inclusive ecosystem for all.</p>\nInnovative BRMM Model\n<p>Equation has pioneered the Balance Rate Market Maker (BRMM), an innovative Automated Market Maker (AMM) model, especially tailored for the perpetual contract market. Thanks to BRMM, Equation can offer traders and liquidity providers (LPs) unprecedented leverage of up to 200x. Traders can access larger positions and near-unlimited liquidity. Simultaneously, LPs benefit from enhanced capital efficiency, creating a win-win situation for all participants.</p>\n<p>Diverging from traditional spot market AMMs, BRMM adopts a unique mechanism centered around the balance rate of the liquidity pool, which results in more efficient price discovery and expanded market-making opportunities. In the BRMM model, liquidity providers (LPs) willingly accept the risk of temporary and manageable liquidity pool imbalances in exchange for the platform's generous fee income. This ingenious approach empowers LPs to participate in market-making flexibly, providing deeper capital pool depth and ensuring traders benefit from a more stable trading experience.</p>\n<p>By introducing BRMM, the perpetual contract market has witnessed heightened liquidity and improved price discovery functionalities, all while safeguarding the interests of LPs. This novel AMM model is anticipated to accelerate the perpetual contract market's growth, ushering in greater innovations and opportunities within decentralized finance (DeFi).</p>\nQuote\n\n<p>\"I launch Equation because I want to redefine perpetual trading by delivering a seamless, transparent, user-friendly trading experience, prioritizing user demands and streamlining a clear interface with minimal process. Equation is committed to providing a trustless transaction environment that enables users to achieve financial freedom.\" &mdash; 0xfermat, Founder of Equation</p>\n\nClosing\n<p>The upcoming pre-launch for Equation in September brings anticipation and excitement, as traders and LPs gear up to experience the next level of perpetual trading on the Arbitrum network. Join Equation on its journey to redefine the trading landscape and unlock new opportunities in the crypto space.</p>\nAbout Equation\n<p>Equation is a decentralized perpetual protocol built on Arbitrum. With its innovative BRMM model, Equation provides both traders and Liquidity Providers (LPs) with up to 200x leverage, enabling traders to access larger positions and near-unlimited liquidity while enhancing capital efficiency for LPs. Being one of the pioneering trader-oriented DeFi protocols, Equation stands as a testament to the power of community-driven innovation in shaping the future of decentralized finance. It prioritizes security and transparency, providing traders with a reliable and secure environment for perpetual trading participation.</p>\n<p>&nbsp;</p>\n<p>Media Contact</p>\n<p>Company: EquationDAO&nbsp;</p>\n<p>Contact: Equation Media Team</p>\n<p>Team Email: market@equation.cool&nbsp;</p>\n<p>Website: https://www.equation.org/</p>\n<p>Twitter: https://twitter.com/EquationDAO</p>\n<p>Medium: https://medium.com/@EquationDAO</p>\n<p>Discord：discord.gg/ywFrewsxBH</p>\n<p>Telegram：https://t.me/EquationDao</p>\n<p>&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n                    "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-24T13:20:48.000Z",
    "title": "\n                        Presenting Top 3 Meme Coins That Will Take You To The Top: Pepe Coin, Dogelon Mars & Elonator\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/presenting-top-3-meme-coins-that-will-take-you-to-the-top-pepe-coin-dogelon-mars-elonator",
    "description": "\n                        <p>If you&rsquo;re looking for different avenues of generating money with crypto, let yourself be carried to financial freedom by the top 3 meme coins of the industry. Among the vast array of choices, PepeCoin (PEPE), Dogelon Mars (ELON), and Elonator (ETOR) take the spotlight, all fostering unique communities and offering immense potential. But can one of them outshine the rest with a refreshing blend of Elon Musk, the Terminator and AI technology?</p>\nThe Powerful and Unexpected Entrance of PEPE\n<p>People say the best things in life come unexpectedly, and PepeCoin, taking those words to its little frog heart, decided to jump onto the crypto scene as discreetly as possible. Although it didn&rsquo;t even offer a presale, within merely two weeks, PEPE&rsquo;s price surged from around $0.000000001 to a whopping $0.00000431, leaving the entire market in awe.&nbsp;</p>\n<p>One notable thing about meme coins is that they rarely offer real utility, and PEPE is no exception. Regarded by many as the most &lsquo;memeable&rsquo; asset on the Ethereum blockchain, this frog phenomenon, unfortunately, holds no fundamental and substantial value. Yet, as we all witnessed, that didn&rsquo;t stop PEPE from surging to unimaginable heights. But will its meme coin appeal be enough for PEPE to remain among the top 3 meme coins?</p>\n<p>Now imagine the success of a coin with a meme potential as strong as PEPE&rsquo;s but with extensively improved utility. Addressing all those technical issues, Elonator emerged with a long list of solutions that will improve the market conditions. Presenting a swap machine, an anti-whale dumping mechanism, a token tracker, a liquidity pool locking, and many more, the team behind ETOR created a first-class ecosystem, making Elonator one of the best 100x meme coins available.</p>\n<p></p>\nElon Making ELON Surge\n<p>Trying to replicate the remarkable success of Dogecoin (DOGE), Dogelon Mars emerged as a promising dog-themed meme coin in the market, quickly surging toward the top 3 meme coins rankings. Using the influence of Elon Musk, the man hugely responsible for DOGE&rsquo;s success, ELON based the whole project around an alien dog, loosely resembling Elon Musk, returning to Mars.&nbsp;</p>\n<p>The project aims to create an &ldquo;intergalactic currency&rdquo; that can be used beyond Earth to foster an inclusive and innovative ecosystem. Realising the extent of Elon Musk&rsquo;s power, Elonator emerged like a shooting star, making the founder and CEO of Tesla the face of its project. Knowing that the billionaire has a track record of propelling digital assets to grow upon his endorsement, ETOR&rsquo;s team curated a strategic plan that is bound to succeed. Already exceeding meme coin expectations with its innovative technology, Elon&rsquo;s approval will make Elonator shine even brighter.</p>\n<p>&lt;&lt; Buy Into The Elonator Presale &gt;&gt;</p>\nExperience the Power of Top 3 Meme Coins with Elonator\n<p></p>\n<p>With a skillful merge of AI and Elon Musk, Elonator (ETOR) could already make a long-lasting mark on its niche, becoming one of the giants of the industry. But as any genius would, ETOR&rsquo;s team kept seeking ways for improvement, finding that magical element that made things even better. Knowing that real success only happens when innovation and longevity meet, Elonator channelled the energy of the indestructible Terminator, ensuring ETOR is not a seasonal asset but a long-term profitable investment.</p>\n<p>The good news doesn&rsquo;t seem to end there, as Elonator presents one of the best crypto presales ever. With numerous lotteries and valuable prizes, ETOR is poised to attract the attention of investors worldwide, becoming a real force to be reckoned with.</p>\n<p></p>\n<p>PepeCoin, Dogelon Mars, and Elonator in the crypto sea all fight for a spot among the top 3 meme coins. With Elonator merging the most powerful aspects of modern technology and being brand new to the market, ETOR will certainly explode in value. Make sure you seize the opportunity, join Elonator&rsquo;s community, and enjoy the perks of investing in 100x meme coins!</p>\n<p>Now Is Elonator&rsquo;s Time&hellip; Presale: https://buy.elonator.com/ Website: https://elonator.com</p>\n<p>Telegram: https://t.me/ElonatorCoin</p>\n<p>Twitter: https://twitter.com/ElonatorCoin</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n                    "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-24T13:20:14.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Hits 1-Week High, as Bulls Move to Buy the Dip",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-hits-1-week-high-as-bulls-move-to-buy-the-dip/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1978013267-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC Hits 1-Week High, as Bulls Moved to Buy the Dip\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1978013267-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1978013267-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1978013267-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1978013267-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1978013267-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1978013267-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1978013267.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin rebounded from recent lows on Thursday, as bulls moved to buy the dip, following a drop below the $26,000 level. The rally comes as traders rejected a full breakout below a key support point of $25,600. Ethereum was also back in the green during today&#x2019;s session. Bitcoin Bitcoin climbed higher on Thursday, as bulls [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T13:35:50.000Z",
    "title": "Blockchain Security Companies in the Middle East Foster Technology Adoption Across Sectors",
    "url": "https://www.cryptopolitan.com/blockchain-security-companies-middle-east/",
    "description": "Blockchain technology has been gaining traction in the Middle East, with several countries exploring its potential applications. The technology&#8217;s decentralized nature and ability to provide secure, transparent transactions make it an attractive option for various industries, including finance, healthcare, and supply chain management. However, the adoption of blockchain technology in the Middle East faces certain ... <a title=\"Blockchain Security Companies in the Middle East Foster Technology Adoption Across Sectors\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blockchain-security-companies-middle-east/\" aria-label=\"More on Blockchain Security Companies in the Middle East Foster Technology Adoption Across Sectors\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T13:27:07.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market. Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T13:23:56.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 How much is Bitcoin (BTC) worth? Today, the price of Bitcoin stands at $26,467, with a 24-hour trading volume totalling $38.62 billion. It boasts a market capitalization of $507 billion and commands 47% of the cryptocurrency market. Over the past day, Bitcoin’s price experienced an increase of 1.77%. Currently, there are ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T13:23:38.000Z",
    "title": "AI’s Role in Education and Shaping Holistic Learners",
    "url": "https://www.cryptopolitan.com/ais-role-in-education-and-shaping-earners/",
    "description": "In the ever-evolving landscape of education, a new protagonist has emerged: artificial intelligence (AI). Once confined to the realm of data processing and algorithms, AI has transcended its boundaries and is now making significant strides in fostering &#8216;soft&#8217; skills – a transformative wave that is reshaping the future of learning. One notable player in this ... <a title=\"AI&#8217;s Role in Education and Shaping Holistic Learners\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ais-role-in-education-and-shaping-earners/\" aria-label=\"More on AI&#8217;s Role in Education and Shaping Holistic Learners\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T13:17:02.000Z",
    "title": "5 Essential Terms to Know in the Cryptocurrency Market",
    "url": "https://www.cryptopolitan.com/5-essential-terms-to-know-in-the-cryptocurrency-market/",
    "description": "The cryptocurrency market has rapidly become one of the most dynamic and innovative financial ecosystems in recent years. As blockchain platforms gain momentum and adoption, it&#8217;s crucial for newcomers and seasoned investors alike to familiarize themselves with the core terminology. Here are five essential terms to understand if you want to navigate the world of ... <a title=\"5 Essential Terms to Know in the Cryptocurrency Market\" class=\"read-more\" href=\"https://www.cryptopolitan.com/5-essential-terms-to-know-in-the-cryptocurrency-market/\" aria-label=\"More on 5 Essential Terms to Know in the Cryptocurrency Market\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T13:12:19.000Z",
    "title": "The Psychology Behind Crypto Trading: Navigating Emotions for Informed Decisions",
    "url": "https://www.cryptopolitan.com/the-psychology-behind-crypto-trading-navigating-emotions-for-informed-decisions/",
    "description": "The captivating realm of cryptocurrency trading intertwines the promise of remarkable profits with a rollercoaster journey of emotions. In the volatile world of digital currencies, marked by rapid and unpredictable price shifts, traders face a psychological terrain that significantly influences their decisions.&#160; Furthermore, it is paramount for investors to possess a comprehensive understanding of vital ... <a title=\"The Psychology Behind Crypto Trading: Navigating Emotions for Informed Decisions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-psychology-behind-crypto-trading-navigating-emotions-for-informed-decisions/\" aria-label=\"More on The Psychology Behind Crypto Trading: Navigating Emotions for Informed Decisions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T13:10:52.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the series of delisting fuelled by the ongoing United States SEC crackdown on major crypto platforms. Basically, it&#8217;s crypto winter in the summer as it stands. How do Cardano Price Prediction analysts steer in this turbulent crypto weather? ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-24T13:31:02.000Z",
    "title": "FTX engages Galaxy Digital to oversee, sell, and hedge its crypto assets",
    "url": "https://crypto.news/ftx-engages-galaxy-digital-to-oversee-sell-and-hedge-its-crypto-assets/",
    "description": "Bankrupt exchange FTX wants to hire Mike Novogratz&#8217;s Galaxy to assist with selling, staking, and hedging its crypto assets. The proposed agreement would see Galaxy managing and trading certain digital assets owned by FTX to convert them into fiat currency or stablecoins.&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-24T13:27:03.000Z",
    "title": "Two more US SEC attorneys withdraw from XRP lawsuit",
    "url": "https://crypto.news/two-more-us-sec-attorneys-withdraw-from-xrp-lawsuit/",
    "description": "Following the recent departure of one, two more attorneys withdrew from representing the US SEC in its lawsuit against Ripple over XRP offerings. Aug. 24 court filings reveal that attorneys Richard Best and Robert MacDonald Moye requested to withdraw from&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-24T13:17:55.000Z",
    "title": "Binance halts crypto debit cards in Latam and Middle East",
    "url": "https://crypto.news/binance-halts-crypto-debit-cards-in-latam-and-middle-east/",
    "description": "Binance announced the suspension of its crypto debit card services in Latin America and the Middle East starting Aug. 25. Crypto debit cards allow users to make purchases using their crypto. Binance Card enabled its users to cover daily expenses&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-24T13:25:25.000Z",
    "title": "Charles Hoskinson: SEC Isn’t Targeting Cardano, as ADA Doesn’t Qualify as a Security",
    "url": "https://www.crypto-news-flash.com/charles-hoskinson-sec-isnt-targeting-cardano-as-ada-doesnt-qualify-as-a-security/?utm_source=rss&utm_medium=rss&utm_campaign=charles-hoskinson-sec-isnt-targeting-cardano-as-ada-doesnt-qualify-as-a-security",
    "description": "<img width=\"6000\" height=\"4000\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Comdas-Cardano-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano ADA\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Comdas-Cardano-1.jpg 6000w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Comdas-Cardano-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Comdas-Cardano-1-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Comdas-Cardano-1-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Comdas-Cardano-1-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Comdas-Cardano-1-2048x1365.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Comdas-Cardano-1-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Comdas-Cardano-1-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Comdas-Cardano-1-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Comdas-Cardano-1-48x32.jpg 48w\" sizes=\"(max-width: 6000px) 100vw, 6000px\" />Charles Hoskinson, Cardano&#8217;s creator, believes the SEC won&#8217;t target ADA.  Hoskinson links SEC actions to political motives, especially Sam Bankman-Fried&#8217;s influence.  Charles Hoskinson, the creator of Cardano, believes that the United States Securities and Exchange Commission (SEC) will not target Cardano&#8217;s native cryptocurrency, ADA. In a recent conversation on Corey Costa&#8217;s Crypto Coins YouTube channel, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-24T13:35:00.000Z",
    "title": "SOL May Breakout Following Shopify and Solana Pay Integration",
    "url": "https://coinedition.com/sol-may-breakout-following-shopify-and-solana-pay-integration/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/087.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/087.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/087-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/087-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/087-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/087-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/087-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/087-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/087-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/087-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/087-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/087-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/087-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/087-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/087-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/087-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/087-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Over the past few days, Shopify, a dominant force in the e-commerce sector, revealed its incorporation of Solana Pay into its array of payment alternatives. This calculated fusion could empower a countless number of merchants on the platform to accept cryptocurrency transactions. Initially, Shopify will only endorse the well-established USD Coin (USDC) for payments. However, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sol-may-breakout-following-shopify-and-solana-pay-integration/\">SOL May Breakout Following Shopify and Solana Pay Integration</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]