[
  {
    "source": "CoinDesk",
    "date": "2023-06-08T08:21:35.000Z",
    "title": "Crypto Exchange Bittrex’s Customer-Repayment Plan Faces U.S. Government Objection",
    "url": "https://www.coindesk.com/policy/2023/06/08/crypto-exchange-bittrexs-customer-repayment-plan-faces-us-government-objection/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "If successful, it wouldn’t be the first time the state has scuppered a crypto bankruptcy proposal."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-08T08:20:54.000Z",
    "title": "DeFi Unfazed by SEC's Classification of Tokens as Securities",
    "url": "https://www.coindesk.com/markets/2023/06/08/defi-unfazed-by-secs-classification-of-tokens-as-securities/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "These forces will likely only drive “more financial activity to DeFi,” one trader said."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T08:23:26.000Z",
    "title": "EU watchdog targets crypto ads on Instagram, Youtube, TikTok, Twitter",
    "url": "https://cointelegraph.com/news/eu-watchdog-targets-crypto-ads-on-instagram-youtube-tiktok-twitter",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/696743b6-6217-4f3e-9be5-3ed12b91f846.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The largest European consumer rights group alleges crypto marketers in popular social networks the misleading promotion and thus exposing consumers to serious harm.</p>\n                    <p><p>The largest European consumer rights group alleges crypto marketers in popular social networks the misleading promotion and thus exposing consumers to serious harm. A certain complaint was filed with the European Commission. </p><p>On June 8, the European Consumer Organisation (BEUC) <a href=\"https://www.beuc.eu/sites/default/files/publications/BEUC-X-2023-073_Hype_or_harm_The_great_social_media_crypto_con.pdf\" target=\"_blank\" rel=\"noopener nofollow\">published</a> a report ‘Hype or harm? The great social media crypto con.’ In a 20-page document, BEUC states that consumers are not fully aware of the risks associated with crypto. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today BEUC &amp; consumer groups in 8 countries are taking action against TikTok, Instagram, Twitter &amp; YouTube for facilitating the misleading promotion of crypto assets on social media . We&#39;ve filed a complaint with <a href=\"https://twitter.com/EU_Commission?ref_src=twsrc%5Etfw\">@EU_Commission</a> and consumer authorities: <a href=\"https://t.co/b6NYsBl4VM\">https://t.co/b6NYsBl4VM</a> <a href=\"https://t.co/w5iLMy4h1i\">pic.twitter.com/w5iLMy4h1i</a></p>&mdash; The Consumer Voice (@beuc) <a href=\"https://twitter.com/beuc/status/1666705623247880192?ref_src=twsrc%5Etfw\">June 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The report draws examples from Instagram, Youtube, Twitter and TikTok, calling them “key players” in crypto advertising. In a case with Facebook, it notes that crypto ads skirt rules, forbidding the promotion of non-licensed financial platforms. The announcement <a href=\"https://twitter.com/beuc/status/1666706926586023937\" target=\"_blank\" rel=\"noopener nofollow\">stated</a>:</p><blockquote>\"TikTok, Instagram, Twitter &amp; YouTube are responsible for allowing misleading advertisements of crypto to multiply through ads &amp; influencers. This is an unfair commercial practice, exposing consumers to serious harm (loss of significant amounts of money).\"</blockquote><p>With Twitter, the report nods at Elon Musk’s move to instate Doge, a mascot for Dogecoin, despite the platforms’ own prohibition of any crypto ad. BEUC also mentions so-called “finfluencers” as “an important source of information” for a younger audience. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/eu-officials-want-all-ai-generated-content-labeled\"><strong><em>EU officials want all AI-generated content to be labeled</em></strong></a></p><p>Despite the single national regulators' efforts to combat misleading promotion, the problem still lacks a complex approach. According to the report, there is already a legal base to take EU-level measures — an Unfair Commercial Practices Directive (UCPD), and there is a body to lead the enforcement — an EU Consumer Protection Cooperation Network (CPC Network): </p><blockquote>“The problem continues to be addressed at national level mainly while it would require a common approach by the CPC Network acting collectively on the basis of the UCPD and targeting the platforms used for the promotion of crypto assets and related services.”</blockquote><p>The report calls for the CPC-Network to request that social media platforms implement stricter conditions in their advertising policies, include in their Terms of Use a prohibition for influencers to promote crypto products and submit reports to the European Commission about the effectiveness of the measures put in place. </p><p>Meanwhile, in France, the Senate <a href=\"https://cointelegraph.com/news/french-senate-proposal-would-allow-influencers-to-promote-cryptocurrency\">approved an amendment</a> allowing registered crypto companies to hire social media influencers for advertising and promotional purposes.</p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\"><strong><em>Bitcoin is on a collision course with ‘Net Zero’ promises</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-08T08:22:02.000Z",
    "title": "TRON MainNet Celebrates Fifth Anniversary and Stands Now as the Preferred Global Blockchain",
    "url": "https://cryptodaily.co.uk/2023/06/tron-mainnet-celebrates-fifth-anniversary-and-stands-now-as-the-preferred-global-blockchain",
    "description": "<p>Geneva, Switzerland, June 8th, 2023, Chainwire</p><p>It&rsquo;s been five years since the day in late May 2018 when the TRON MainNet emerged. The layer one blockchain can now authentically be labeled as the public chain of choice, with the most daily active users, the most daily transactions, and the largest circulation of the stablecoin USDT. Impressing the industry with one achievement after another, it has grown into the global leader among all public chains. As the number of comparable chains and competitive options has exponentially increased, TRON continues to stand out with its second-to-none performance, scalability, and security, attracting masses of developers and users worldwide.&nbsp;</p><p>Following TRON's anniversary, on June 1, Hong Kong's Securities and Futures Commission (SFC) began accepting applications for crypto trading platform licenses. As a top-tier public chain, TRON has promised full support for Hong Kong's Web3 ambitions to become a crypto hub of the world.&nbsp;</p><p>TRON was founded by H.E. Justin Sun in 2017, and its MainNet went live on May 31, 2018. Five years into the launch of its MainNet, TRON now has over 165M users worldwide and has processed more than 5.7B transactions. According to DeFiLlama, it also outshines the pack with a TVL (Total Value Locked) second only to Ethereum.</p><p>TRON has established a robust commerce infrastructure via partnerships across the industry. It has become the global stablecoin highway for USDT, USDC, TUSD, USDJ, and USDD.</p><p>According to the data on Tether's website, the supply of TRC20-USDT has exceeded 46.1B, now 10B more than the Ethereum-native ERC20-USDT, accounting for 60% of USDT's total supply.</p><p>Powered by a secure, cost-effective, and efficient underlying blockchain, the TRC-20 protocol launched by TRON has become the go-to choice among on-chain users. In addition, TRON has developed a well-rounded ecosystem covering the hotly contested fields in the sector, including DeFi, NFT, GameFi, stablecoins, the metaverse, cross-chain solutions, and DIDs, with the commitment of a group of active developers.</p><p>TRON aims to elevate its on-chain stablecoin market cap to $100B in 2023 and strives to become the preferred choice for stablecoin users around the world.</p><p>In October 2022, TRON was designated as the national blockchain for the Commonwealth of Dominica, and seven TRON-based utility tokens were granted statutory status as authorized digital currencies for use in everyday commerce there. This collaboration blazed a trail for blockchain projects to explore technology application and development with sovereign nations.&nbsp;</p><p>The next five years look to be as exciting as the previous five. The TRON DAO team is confident they work hard to delve deeper into blockchain tech development by welcoming more and more projects and protocols into the ecosystem to #BUIDLtheFUTURE on TRON. An essential player in propelling the global digital economy forward, TRON strives to empower decentralized commerce and community for every person on the planet.&nbsp;</p><p></p><p>About TRON DAO</p><p>TRON DAO is a community-governed DAO dedicated to accelerating the decentralization of the internet via blockchain technology and dApps.</p><p>Founded in September 2017 by H.E. Justin Sun, the TRON network has continued to deliver impressive achievements since MainNet launch in May 2018. July 2018 also marked the ecosystem integration of BitTorrent, a pioneer in decentralized Web3 services boasting over 100 million monthly active users. The TRON network has gained incredible traction in recent years. As of June 2023, it has over 165.1 million total user accounts on the blockchain, more than 5.79 billion total transactions, and over $12.0 billion in total value locked (TVL), as reported on TRONSCAN.&nbsp;</p><p>In addition, TRON hosts the largest circulating supply of USD Tether (USDT) stablecoin across the globe, overtaking USDT on Ethereum since April 2021. The TRON network completed full decentralization in December 2021 and is now a community-governed DAO. Most recently in October 2022, TRON was designated as the national blockchain for the Commonwealth of Dominica, which marks the first time a major public blockchain partnered with a sovereign nation to develop its national blockchain infrastructure. On top of the government&rsquo;s endorsement to issue Dominica Coin (&ldquo;DMC&rdquo;), a blockchain-based fan token to help promote Dominica&rsquo;s global fanfare, seven existing TRON-based tokens - TRX, BTT, NFT, JST, USDD, USDT, TUSD, have been granted statutory status as authorized digital currency and medium of exchange in the country.</p><p></p><p>TRONNetwork | TRONDAO | Twitter | YouTube | Telegram | Discord | Reddit | GitHub | Medium | Forum</p><p></p>ContactHayward Wongpress@tron.network"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T08:29:28.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the runoff on the FTX cryptocurrency exchange and the failed attempt of a takeover by Binance. The entire fiasco started after Binance’s CZ expressed doubts about the integrity of Almeda research, a trading affiliate of FTX. The tweet ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T08:21:40.000Z",
    "title": "TRON MainNet Celebrates Fifth Anniversary and Stands Now as the Preferred Global Blockchain",
    "url": "https://www.cryptopolitan.com/tron-mainnet-celebrates-fifth-anniversary-and-stands-now-as-the-preferred-global-blockchain/",
    "description": "Geneva, Switzerland, June 8th, 2023, Chainwire It’s been five years since the day in late May 2018 when the TRON MainNet emerged. The layer one blockchain can now authentically be labeled as the public chain of choice, with the most daily active users, the most daily transactions, and the largest circulation of the stablecoin USDT. ... <a title=\"TRON MainNet Celebrates Fifth Anniversary and Stands Now as the Preferred Global Blockchain\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-mainnet-celebrates-fifth-anniversary-and-stands-now-as-the-preferred-global-blockchain/\" aria-label=\"More on TRON MainNet Celebrates Fifth Anniversary and Stands Now as the Preferred Global Blockchain\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T08:10:03.000Z",
    "title": "Binance CEO’s offshore trading accounts received billions in customer funds, US SEC declares",
    "url": "https://www.cryptopolitan.com/binance-ceos-offshore-trading-accounts-received-billions-in-customer-funds-us-sec-declares/",
    "description": "The US Securities and Exchange Commission (SEC) has alleged that Binance CEO Changpeng Zhao, popularly known as CZ, and Guangying &#8216;Helina&#8217; Chen, Binance&#8217;s back office and financial manager, received billions of dollars of customer funds. According to new court documents filed by the SEC yesterday, the funds were funneled through an intermediary holding company called ... <a title=\"Binance CEO&#8217;s offshore trading accounts received billions in customer funds, US SEC declares\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-ceos-offshore-trading-accounts-received-billions-in-customer-funds-us-sec-declares/\" aria-label=\"More on Binance CEO&#8217;s offshore trading accounts received billions in customer funds, US SEC declares\">Read more</a>"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-08T08:34:19.000Z",
    "title": "HOTTEST Crypto Gaming Gem on Solana!",
    "url": "https://www.altcoinbuzz.io/blockchain-gaming/hottest-crypto-gaming-gem-on-solana/",
    "description": "<p>Web3 games are no Fun! Yes, have earning potential, and compelling rewards but, they are yet to have the winning formula that turned Web2 gaming into a massive $202 billion industry.  But it seems I have finally come across a Web3 game that has all the secret sauces. Built by Web2 gaming experts with 100 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/blockchain-gaming/hottest-crypto-gaming-gem-on-solana/\">HOTTEST Crypto Gaming Gem on Solana!</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]