[
  {
    "source": "CoinDesk",
    "date": "2023-06-01T15:55:27.000Z",
    "title": "As Multichain Wobbles, Some Fantom-Based DeFi Projects Flee Bridged Tokens",
    "url": "https://www.coindesk.com/business/2023/06/01/as-multichain-wobbles-some-fantom-based-defi-projects-flee-bridged-tokens/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The actions showcase how Multichain’s faltering infrastructure and AWOL CEO are sending shockwaves through Fantom, the blockchain most heavily dependent on Multichain’s bridges."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-01T15:50:32.000Z",
    "title": "GameStop Teams Up with The Telos Foundation to Grow Web3 Gaming Strategy",
    "url": "https://www.coindesk.com/web3/2023/06/01/gamestop-teams-up-with-the-telos-foundation-to-grow-web3-gaming-strategy/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The leading game retailer will distribute Telos-based games on its forthcoming Web3 gaming launchpad, GameStop Playr."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-01T15:59:49.000Z",
    "title": "Why is Litecoin price up today?",
    "url": "https://cointelegraph.com/news/why-is-litecoin-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-03/41b86269-3174-43a2-9dc8-a579feb96cb8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Litecoin price is up today, as the growth in unique addresses throughout the month of May, continues into June.</p>\n                    <p><p>Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) emerged as one of the best-performing cryptocurrencies on June 1 as the market's attention shifted to its strong network growth in recent months.</p><p>The LTC price jumped 3% to an intraday high of around $95. In comparison, its top-rivaling assets, Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), dropped 2.25% and 1.75%, respectively, thus registering a rare decoupling between the markets.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/3103945e-70c0-4db9-9f6f-dc7ce7ab3650.png\"  /><figcaption style=\"text-align: center;\"><em>LTC/USD daily price chart vs. BTC/USD and ETH/USD. Source: TradingView</em></figcaption></figure><h2>Litecoin unique addresses jump in May, shatterin previous records</h2><p>The recent Litecoin market gains appeared two days after IntoTheBlock's favorable tweet about the token.</p><p>In the <a href=\"https://twitter.com/intotheblock/status/1663472029050306560\" target=\"_blank\" rel=\"noopener nofollow\">tweet</a>, the blockchain analytics platform highlighted historically strong growth in Litecoin's non-zero addresses. Notably, the count reached nearly 8.5 million on May 22 from around 7.09 million at the beginning of April.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/70399b26-b51e-4c3f-8335-144718fab4c2.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Litecoin non-zero addresses count. Source: IntoTheBlock </em></figcaption></figure><p>The growth may have resulted from existing Litecoin holders distributing their coins across newly-created wallets. In addition, it may have come due to the arrival of new Litecoin users, which suggests a rise in buying demand for LTC tokens.</p><p>Meanwhile, the total number of unique Litecoin addresses grew in May from 184.66 million to 196.84 million, the strongest monthly rise on record.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/20252bd9-e178-4bb7-9d07-bfeb56f8c553.png\"  /><figcaption style=\"text-align: center;\"><em>Litecoin: number of addresses. Source: Glassnode</em></figcaption></figure><p>The rise in Litecoin's network activity <a href=\"https://cointelegraph.com/news/ordinals-sends-ltc-and-doge-network-activity-surging-for-3-straight-weeks\">coincided</a> with its foray into the nonfungible token (NFT) sector with a new token standard called LTC-20. Furthermore, growing upside speculation in the days leading up to <a href=\"https://cointelegraph.com/news/litecoin-price-poised-for-700-gains-vs-bitcoin-says-charlie-lee\">Litecoin's halving</a> in August may have also boosted the LTC address count.</p><h2>Is $100 Litecoin next?</h2><p>Litecoin's intraday jump has brought its price near a short-term resistance range of around $93 to $96, which has capped its upside attempts since April.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/dff9f825-d094-4f2a-89e9-a5a63b051a6c.png\"  /><figcaption style=\"text-align: center;\"><em>LTC/USD daily price chart. Source: TradingView</em></figcaption></figure><p>A decisive move above the $93 to $96 area could have LTC price eye $100 as its next upside target. Conversely, a pullback from the range could mean a run-down toward Litecoin's short-term ascending trendline support,  which coincides with its 50-day exponential moving average (the red wave) near $89. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/litecoin-price-poised-for-700-gains-vs-bitcoin-says-charlie-lee\">Litecoin price poised for 700% gains vs. Bitcoin, says Charlie Lee</a></em></strong></p><p>Looking long-term, Litecoin sees a run-up toward $250, partly due to a classic bullish reversal formation and the other due to growing euphoria around its halving, a pattern <a href=\"https://twitter.com/DavidOnCrypto_/status/1664177202437447681\" target=\"_blank\" rel=\"noopener nofollow\">observed in the chart below</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/0171d48a-8bce-4fb5-9d13-036c70ae71b8.jpeg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>LTC/USD weekly price chart. Source: TradingView</em></figcaption></figure><p>Another analyst operating under the alias 'Doctor Profit' <a href=\"https://twitter.com/DrProfitCrypto/status/1658788633254457345\" target=\"_blank\" rel=\"noopener nofollow\">expects</a> the LTC price to rise on halving FOMO, but until $150. He added:</p><blockquote>\"My plan is to sell in mid June, one month before halving.\"</blockquote><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-01T16:07:11.000Z",
    "title": "Bitfarms sold 90% of its Bitcoin mined in May",
    "url": "https://cryptoslate.com/bitfarms-sold-90-of-its-mined-bitcoin-in-may/",
    "description": "<p>Bitcoin (BTC) miner Bitfarms sold 414 BTC, representing 90.19%, of its mined 459 BTC in May, according to a June 1 statement. According to the statement, the miner generated $11.3 million from the sold assets, reducing its debt by $1.8 million, leaving a balance of $17.4 million as of May 31. BTC production When Bitfarms [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitfarms-sold-90-of-its-mined-bitcoin-in-may/\">Bitfarms sold 90% of its Bitcoin mined in May</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-01T15:57:43.000Z",
    "title": "Binance Is Reportedly Conducting Large Scale Layoffs",
    "url": "https://cryptodaily.co.uk/2023/06/binance-is-reportedly-conducting-large-scale-layoffs",
    "description": "<p>Reports emerged on Wednesday that crypto exchange Binance is undertaking sizable layoffs.&nbsp;</p>\n<p>On Wednesday, a report by independent journalist Colin Wu claimed Binance, the world&rsquo;s largest crypto exchange by trading volume, may have cut its staff by as much as 20%.</p>\n\n<p dir=\"ltr\" lang=\"en\">SCOOP: According to multiple sources who confirmed to WuBlockchain, Binance has started layoffs, and the proportion is still uncertain. The total number of Binance employees is about 8,000, market rumors that the proportion of layoffs in June was about 20%. As of press time,&hellip;</p>\n&mdash; Wu Blockchain (@WuBlockchain) May 31, 2023\n<p>\n\n</p>\n<p>Patrick Hillmann, Binance&rsquo;s Chief Communication Officer, clarified the matter via a Twitter thread.</p>\n<p>Hillmann said the exchange is not cutting 20% of its employees as a cost-cutting measure but said it would &ldquo;streamline&rdquo; after experiencing exponential growth over the past five years.</p>\n\n<p dir=\"ltr\" lang=\"en\">Let me provide some additional clarity via 🧵. Binance is not cutting 20% of employees as a cost-cutting measure. @binance experienced true exponential growth these past 5 years &mdash; and grew its staff accordingly. This was a historic operational challenge to overcome. https://t.co/Awmh8PdT8j</p>\n&mdash; Patrick Hillmann (@PRHillmann) May 31, 2023\n<p>\n\n</p>\n<p>The exchange has faced unprecedented regulatory action in recent months and has seen a decline in market share, The Block reports. However, the company said in March that it is not planning layoffs but would grow its headcount even further. Binance CEO, Changpeng Zhao, said at the time it planned to expand its staff by between 15% and 30%.</p>\nBinance CEO Clarifies\n<p>In response to the report, Zhao took to Twitter to explain the situation. The company&rsquo;s CEO wrote Wu&rsquo;s claims off as FUD, saying the exchange has a &ldquo;bottom out&rdquo; program where it continually greets employees it deems &ldquo;not strong fits with the company.&rdquo; Zhao further noted that many of these are &ldquo;great people or high performers, but may not fit our unique culture/situation.&rdquo; &nbsp;</p>\n\n<p dir=\"ltr\" lang=\"en\">4. Another day, another FUD. On rumors of layoffs.Binance has a \"bottom out\" (we should probably rename it to something else) program. We constantly say goodbye to people who are not strong fits with the company. Many of them are great people or high performers, but may not fit&hellip; https://t.co/YGnZILzd5C</p>\n&mdash; CZ 🔶 Binance (@cz_binance) May 31, 2023\n<p>\n\n</p>\n<p>Zhao reiterated that the company is still appointing new employees.</p>\nBinance Creates Japanese Trading Platform\n<p>Despite a declining market share, the exchange does not appear to be slowing operations. Most recently, Binance announced the launch of a fully compliant crypto trading platform for Japanese residents.</p>\n<p>As part of the transition to Binance Japan, the company said it would discontinue its crypto services for Japanese residents through its global platform by November 30. &nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-01T15:57:26.000Z",
    "title": "Devour & Alterverse Partner to Bring the World's First Web3 Food Ordering Marketplace to the Metaverse",
    "url": "https://cryptodaily.co.uk/2023/06/devour-alterverse-partner-to-bring-the-worlds-first-web3-food-ordering-marketplace-to-the-metaverse",
    "description": "<p>Phoenix, AZ, June 1st, 2023, Chainwire</p><p>Devour, a pioneering restaurant engagement technology company, is thrilled to announce its strategic partnership with AlterVerse, an innovative force in the gaming industry. The collaboration aims to revolutionize the restaurant and gaming experience by expanding DevourGO, Devour's web3 enabled guest engagement platform, to the upcoming release of AlterVerse's Sky City gaming Metaverse.</p><p>DevourGO has emerged as a prominent player in token-gating food ordering experiences. It is gaining swift recognition for its innovative approach, which allows users to unlock these experiences by utilizing their digital assets and the native token, DevourPAY ($DPAY), for payments and exclusive rewards on the platform. With this new partnership, DevourGO will extend its offering to include real world food delivery orders coming from storefronts within AlterVerse&rsquo;s stunning photorealistic metaverse, Sky City. The integration with AlterVerse will allow DevourGO to unlock a whole new level of immersive restaurant experiences for customers and restaurant brands.</p><p>The visionary AlterVerse team, backed by notable entities such as Binance Labs, Polygon Ventures, and Gate.io Labs, is actively building a vibrant global community of gaming enthusiasts. With Sky City, built on Unreal Engine 5, AlterVerse offers an extensive range of experiences that go beyond traditional gaming. Users can play countless games and challenges, design their own homes, engage in high stakes competition, and shop at many restaurants and retail shops in the central hub. The metaverse is blockchain-driven allowing users to create, own and sell in-game creations in support of its fun-first gaming mantra.</p><p>As part of this partnership, Devour will integrate its DevourGO order platform into Sky City, enabling users to seamlessly order food and beverages from participating restaurants within the virtual realm. As the partnership evolves,&nbsp;players will not only receive real world food, but their avatars will gain valuable increases in their hunger and thirst meters, which players need to maintain in order to progress in the game. Because the Alterverse community is Global, players will be able to seamlessly order from restaurants local to their physical location.</p><p>\"We are thrilled to partner with Alterverse and expand the reach of DevourGO to the exciting world of AlterVerse's Sky City metaverse,\" said Shelly Rupel, CEO at Devour. \"This collaboration represents a significant step forward in enhancing guest engagement for restaurant brands. By combining the immersive experiences of Alterverse with the convenience and efficiency of DevourGO, we are enabling restaurant guests to seamlessly order, dine, and engage in an entirely new way.&rdquo; </p><p>As the release of AlterVerse's Sky City approaches, Devour and AlterVerse will work closely to ensure a seamless integration of DevourGO with the metaverse. Restaurant brands will have the opportunity to leverage the combined power of Devour's technology and AlterVerse's immersive gaming environment to create unforgettable guest experiences and maximize their reach in the gaming community.</p><p>About Devour</p><p>Devour Inc is a next-gen restaurant engagement technology company dedicated to transforming the way restaurants connect with their guests. Their DevourGO platform utilizes web3 technology to provide community-focused delivery and pick-up ordering services for restaurant brands of all sizes, with on-premise ordering, reservations, and more digital guest engagement solutions coming soon. Included in the Devour ecosystem is DevourPAY $DPAY (https://devour.io/devourpay), the native utility token of the platform, and The Industry Pass (https://devour.io/theindustry), offering exclusive perks and benefits to its community members.&nbsp;</p><p>More information can be found at https://devour.io</p><p>About AlterVerse</p><p>AlterVerse is a pioneering force in the gaming industry, creating a four-phase metaverse intricately built on Unreal Engine 5. Their upcoming Sky City gaming metaverse offers users the ability to play mini-games and adventures, fly a &lsquo;Copter over the shrouded planet, race a Violator around the Sky City track, and monetize their in-game creations within an expansive, interconnected ecosystem. The metaverse is powered by blockchain technology, VR compatible, and provides players with opportunities for both immersive gameplay and financial reward.</p><p>More information can be found at https://www.alterverse.com</p><p>Disclaimer: This press release is for informational purposes only. The information does not constitute investment advice or an offer to invest.</p>ContactCEOShelly RupelDevour Incshelly@devour.io"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-01T15:45:00.000Z",
    "title": "Bitcoin Price Analysis:  7.1% Weaker in May - 2 June 2023",
    "url": "https://cryptodaily.co.uk/2023/06/bitcoin-price-analysis-seven-point-one-per-cent-weaker-in-may-2-june-2023",
    "description": "<p>BTC/USD Off 7.1% in May:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 2 June 2023</p>\n<p>Bitcoin (BTC/USD) extended recent weakness early in the Asian session as the pair traded below the 27000 figure following an acute move lower from the 27360.31 area that was reversed around the 26615 area.&nbsp; Stops were elected below the 26744.31 area, a downside price objective associated with selling pressure that intensified around the 27875 area.&nbsp; Large Stops were recently elected below the 27477.07 area during the depreciation, representing the 38.2% retracement of the recent appreciating range from 25864.35 to 28473.93.&nbsp; Downside price objectives linked to the 28057.23 and 27875 levels include the 26526, 26335, and 25675 areas.&nbsp; Stops are cited below the 26422 level.&nbsp; BTC/USD depreciated approximately 7.1% in May and has appreciated approximately 64.5% year-to-date.</p>\n<p>Additional downside price objectives include the 25474, 25442, 24705, 24440, 23208, and 22769 levels.&nbsp; Following recent price activity, areas of technical resistance and potential selling pressure include the 29048, 29143, and 29813 levels.&nbsp; Upside retracement levels in recent depreciating ranges include the 28700, 28741, 28868, 29243, 29299, and 29284 levels.&nbsp; Above the market, upside price objectives include the 30420.74, 31237.11, 31477.37, 32501.23, 32556.73, 32989.19, 34583.96, 34658.69, 35222.66, 37765.28, and 38403.97 levels.&nbsp; &nbsp;Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 200-bar MA (4-hourly)&nbsp;and&nbsp;above the&nbsp;100-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bullishly indicating above the 100-bar MA (hourly) and above the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 27011.61 and the&nbsp;200-bar MA&nbsp;(Hourly) at 26988.19.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;25604.51/ 24440.41/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is Bearishly below MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bullishly above MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-01T16:00:34.000Z",
    "title": "Biggest Movers: LTC Breaks Out of Key Resistance Level After Gaining 6%",
    "url": "https://news.bitcoin.com/biggest-movers-ltc-breaks-out-of-key-resistance-level-after-gaining-6/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1999728344-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers: LTC Breaks Out of Key Resistance Level After Gaining 6%\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1999728344-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1999728344-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1999728344-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1999728344-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1999728344-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1999728344-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1999728344.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Litecoin rose by as much as 6% in today&#x2019;s session, as the token climbed past a key resistance level on Thursday. The move came following several attempts over several weeks, with bulls finally breaking through. Polygon was also higher, ending a recent losing streak. Litecoin (LTC) Litecoin (LTC) was one of Thursday&#x2019;s notable gainers, as [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T16:01:15.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The $2Million bet by ex-CTO of Coinbase has been the subject of much discussion and debate in the crypto world. At the heart of the controversy is Srinivasan’s prediction that Bitcoin will reach $1 million per coin within just 90 days. This Bitcoin Price Prediction intends to shed light on the ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T15:54:30.000Z",
    "title": "Devour & Alterverse Partner to Bring the World’s First Web3 Food Ordering Marketplace to the Metaverse",
    "url": "https://www.cryptopolitan.com/devour-alterverse-partner-to-bring-the-worlds-first-web3-food-ordering-marketplace-to-the-metaverse/",
    "description": "Phoenix, AZ, June 1st, 2023, Chainwire Devour, a pioneering restaurant engagement technology company, is thrilled to announce its strategic partnership with AlterVerse, an innovative force in the gaming industry. The collaboration aims to revolutionize the restaurant and gaming experience by expanding DevourGO, Devour&#8217;s web3 enabled guest engagement platform, to the upcoming release of AlterVerse&#8217;s Sky ... <a title=\"Devour &#38; Alterverse Partner to Bring the World&#8217;s First Web3 Food Ordering Marketplace to the Metaverse\" class=\"read-more\" href=\"https://www.cryptopolitan.com/devour-alterverse-partner-to-bring-the-worlds-first-web3-food-ordering-marketplace-to-the-metaverse/\" aria-label=\"More on Devour &#38; Alterverse Partner to Bring the World&#8217;s First Web3 Food Ordering Marketplace to the Metaverse\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-01T16:00:11.000Z",
    "title": "Massive Token Unlock: Ripple Releases One Billion XRP From Escrow",
    "url": "https://www.newsbtc.com/news/ripple/massive-token-unlock-ripple-releases-one-billion-xrp-from-escrow/",
    "description": "Ripple, the blockchain company behind the XRP, has released 1 billion XRP tokens from its escrow. The firm previously locked the coins in the escrow system to ensure the XRP ecosystem and market stability. Ripple’s Monthly Unlock Of 1 Billion XRP Tokens According to data from the on-chain analytics firm Whale Alert, Ripple Labs unlocked 1 billion XRP tokens on June 1, corresponding with its unlocking schedule. Whale Alert captured the three transactions that completed Ripple’s token unlock plans. Related Reading: Bitcoin Wealth Is Transferring From Old To New Hands, Why This Is Positive Firstly, Ripple unlocked 300 million XRP tokens worth over $154.58 million in the current crypto market prices. The second transaction involved the release of 200 million XRP tokens from Ripple’s escrow worth $103.19 million. And in the last transaction, Ripple unlocked 500 million XRP coins from its escrow system worth over $257.99 million. A Brief On Ripple Escrow System Ripple developed the escrow system for locking XRP tokens in 2017. The firm locked 55 billion XRP in a “series of escrows” on the ledger, making up 55% of the token supply.  Each escrow contains 1 billion XRP, which the blockchain firm plans to unlock monthly over 55 months.  According to XRPL.org, the aim is to provide predictability to the token supply. As such,  the ledger mechanics are enforced by consensus to enable the release of 1 billion tokens at the scheduled time.  The blockchain company releases the token periodically in a controlled method. This serves as a measure of maintaining stability in the XRP market. The latest unlock of XRP is part of Ripple’s vision of satisfying investors’ demands and supporting the growing XRP ecosystem. Related Reading: Bitcoin Price Takes Hit – Upsides Turn Attractive To Sellers Also, the firm ensures that all unused XRP tokens are moved back to the escrow system, which helps extend the runway for the rest of the tokens to be unlocked.  XRP Price Action The latest release of XRP tokens has not impacted the price of XRP in the market. At the time of writing, XRP price trades at $0.5080, indicating a surge of 0.1% over the past 24 hours. Data from CoinMarketCap shows that XRP saw more than a 15% increase over the past 7 days. On May 31, the crypto on-chain analytics firm, Santiment reported XRP as the top trending crypto asset. Also, the number sixth-ranked crypto by market cap witnessed over a 22% rise in value within the past 19 days.  Santiment also disclosed that address activity on the XRP network reached a historic high, and crowd optimism hit the highest social volume. The XRP crowd optimism could be connected to the ongoing Ripple vs. SEC lawsuit, which many expect Ripple to win."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T15:57:56.000Z",
    "title": "Devour & Alterverse Partner to Bring the World’s First Web3 Food Ordering Marketplace to the Metaverse",
    "url": "https://www.crypto-news-flash.com/devour-alterverse-partner-to-bring-the-worlds-first-web3-food-ordering-marketplace-to-the-metaverse/?utm_source=rss&utm_medium=rss&utm_campaign=devour-alterverse-partner-to-bring-the-worlds-first-web3-food-ordering-marketplace-to-the-metaverse",
    "description": "<p>Phoenix, AZ, June 1st, 2023, Chainwire Devour, a pioneering restaurant engagement technology company, is thrilled to announce its strategic partnership with AlterVerse, an innovative force in the gaming industry. The collaboration aims to revolutionize the restaurant and gaming experience by expanding DevourGO, Devour&#8217;s web3 enabled guest engagement platform, to the upcoming release of AlterVerse&#8217;s Sky [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/devour-alterverse-partner-to-bring-the-worlds-first-web3-food-ordering-marketplace-to-the-metaverse/\">Devour &amp; Alterverse Partner to Bring the World&#8217;s First Web3 Food Ordering Marketplace to the Metaverse</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-01T15:45:00.000Z",
    "title": "Whale Recently Deposited 20M LINA to Binance, Potential Selloff?",
    "url": "https://coinedition.com/whale-recently-deposited-20m-lina-to-binance-potential-selloff/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Linear-Finance-LINA-Gained-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Whale Recently Deposited 20M LINA to Binance, Potential Selloff?\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Linear-Finance-LINA-Gained-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Linear-Finance-LINA-Gained-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Linear-Finance-LINA-Gained-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Linear-Finance-LINA-Gained-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Linear-Finance-LINA-Gained-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/04/Linear-Finance-LINA-Gained.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In a tweet published this morning, the blockchain tracking firm Lookonchain shared that Jump Trading recently made a large Linear Finance (LINA) deposit to Binance. According to the post, Jump Trading sent 20 million LINA, estimated to be worth $451K, to Binance earlier today. The firm added to their tweet by noting that Jump Trading [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/whale-recently-deposited-20m-lina-to-binance-potential-selloff/\">Whale Recently Deposited 20M LINA to Binance, Potential Selloff?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]