[
  {
    "source": "Decrypt",
    "date": "2023-07-07T20:45:15.000Z",
    "title": "Gotta Go Slow: 'Sonic' Creator Sega Rethinking Crypto Games, Won't Use Major IP",
    "url": "https://decrypt.co/147687/gotta-go-slow-sonic-creator-sega-rethinking-crypto-games-wont-use-major-ip",
    "description": "Sega co-COO Shuji Utsumi says the gaming giant is pulling back on blockchain plans, calling play-to-earn games \"boring.\""
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-07T21:00:00.000Z",
    "title": "Open-source advocates launch OP Stack testnet to fund public goods",
    "url": "https://cointelegraph.com/news/open-source-advocates-launch-op-stack-testnet-to-fund-public-goods",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/61d2485c-9aad-4108-8b3a-4d5826934b72.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Public Goods Network from Gitcoin promises to redirect most net sequencer fees into public goods, instead of giving them to token holders or developers.</p>\n                    <p><p>Layer-2 blockchain Public Goods Network launched a testnet on July 7, promising to spend “the vast majority of net sequencer fees” on public goods instead of paying them out to the development team or token holders, according to an announcement from the network’s developers. In economics, a “public good” is a good that cannot be produced for profit because it is difficult to exclude non-payers from its consumption.</p><p>The new network was <a href=\"https://twitter.com/pgn_eth/status/1676972199423668228\" target=\"_blank\" rel=\"noopener nofollow\">developed</a> by the same team that created Gitcoin, a project that seeks to raise funds for open-source projects. Public Goods Network is being built using the OP Stack, meaning that it can become part of the proposed “Superchain” that <a href=\"https://cointelegraph.com/news/optimism-successfully-completes-bedrock-hard-fork-reducing-deposit-times-layer-1-fees\">will include</a> Optimism and Base networks.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Okay Devs,<br><br>Overjoyed to announce <a href=\"https://twitter.com/pgn_eth?ref_src=twsrc%5Etfw\">@pgn_eth</a>, a community-led L2 focused on sustainable funding for public goods<br><br>Check this out if you&#39;re building anything related to public goods, because I have testnet Eth for you<br><br>⬇️⬇️⬇️ <a href=\"https://t.co/b0mdS1Symw\">https://t.co/b0mdS1Symw</a></p>&mdash; zakk.eth (is on a quest ) (@0xZakk) <a href=\"https://twitter.com/0xZakk/status/1676993280578338816?ref_src=twsrc%5Etfw\">July 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to the project's documents, Public Goods Network <a href=\"https://docs.publicgoods.network/about\" target=\"_blank\" rel=\"noopener nofollow\">will</a> be an Optimistic layer-2 rollup of Ethereum. This type of network generally uses a profit-making centralized sequencer to batch transactions and periodically submit them to Ethereum.</p><p>The Gitcoin team says their new network will reinvest “the vast majority” of this profit into public goods projects. In their view, this is necessary to prevent venture capital firms and others who are motivated by “rent seeking” from capturing the value provided by layer-2s:</p><blockquote>“Rather than fill blockspace for other organizations who may be captured by VCs, or other rent seeking motivations, we believe we should fill our own blockspace such that we can reallocate those funds to further the Alliance’s objective of growing and funding public goods.”</blockquote><p>Gitcoin claims that the sequencer fees will not go directly to them. Instead, it will go to an “alliance” being formed based on a “newly defined governance model.” In a Twitter thread accompanying the announcement, the team said the network’s long-term goal is to allow projects to be funded directly by sequencer fees, without a middleman, <a href=\"https://twitter.com/pgn_eth/status/1676972205526368262\" target=\"_blank\" rel=\"noopener nofollow\">using</a> the EIP-6969 standard.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/coinbase-s-base-network-publishes-path-to-mainnet-outlining-roadmap\"><strong>Coinbase’s Base network publishes ‘path to mainnet’ outlining roadmap</strong></a></em></p><p>The current Public Goods network is connected to the Ethereum Sepolia network through an official bridge, allowing developers to test out apps using funds from Sepolia’s various faucets.</p><p>Gitcoin originally rose to prominence by <a href=\"https://cointelegraph.com/explained/quadratic-funding-the-future-of-crowdfunding-explained\">using quadratic funding</a> to provide grants for open-source projects and other public goods. Gitcoin’s head of impact, Azeem Khan, <a href=\"https://cointelegraph.com/press-releases/head-of-impact-at-gitcoin-azeem-khan-joins-foresight-ventures-advisory-board\">joined the advisory board</a> for crypto fund Foresight Ventures in June.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-07T20:56:59.000Z",
    "title": "3 reasons why Bitcoin's price is primed to hold the $30,000 level as support",
    "url": "https://cointelegraph.com/news/3-reasons-why-bitcoin-s-price-is-primed-to-hold-the-30-000-level-as-support",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/26d827a5-96f0-4262-b72d-bdf33febff0e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin price has been showing weakness near the $30,000 level, but multiple data points highlight the fact that bears remain at a disadvantage. </p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price gave back some of its recent gains this week, but multiple data points suggest that $30,000 should hold as support going forward.</p><p>Bitcoin remained within a narrow 4.3% range for the 15 days leading up to July 7. Despite the proximity of the $29,895 to $31,165 range, investors' sentiment was significantly impacted by an unsuccessful attempt to break above $31,400 on July 6.</p><p>Trader’s tendency to overreact to short-term price movements rather than Bitcoin's year-to-date gains of 82% could be part of the reason for the short-term correction This same rationale applies to the events related to other cryptocurrencies.</p><p>At the front of investors' minds are questions about whether the recent price gains were solely driven by multiple <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-filing-coinbase-surveillance-partner\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/blackrock-spot-bitcoin-etf-filing-coinbase-surveillance-partner/amp\">spot Bitcoin exchange-traded fund (ETF) requests</a>.</p><p>Other pressing developments include Binance’s chief strategy officer, Patrick Hillmann, and other top<a href=\"https://cointelegraph.com/news/binance-cso-patrick-hillmann-departs-us-resignations-doj\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-cso-patrick-hillmann-departs-us-resignations-doj/amp\"> compliance officers reportedly leaving the exchange</a> on July 6 over CEO Changpeng Zhao’s response to the U.S. Justice Department’s investigation. On June 29 he crypto exchange also informed users that its euro banking payment gateway would cease services by September,<a href=\"https://cointelegraph.com/news/binance-loses-support-of-euro-banking-partnerhttps://cointelegraph.com/news/binance-loses-support-of-euro-banking-partner\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-loses-support-of-euro-banking-partnerhttps://cointelegraph.com/news/binance-loses-support-of-euro-banking-partner/amp\"> potentially halting deposits and withdrawals</a> via SEPA bank transfer.</p><p>In the same week, the U.S. Treasury curve reached its deepest inversion since 1981 on July 3, reflecting the 2-year note's 4.94% yield compared to the 10-year trading at 3.86%, the opposite of what is expected from longer-term bonds. The phenomenon is closely watched by investors as it has preceded past recessions.</p><p>All of these events are likely having some impact on Bitcoin price and investor sentiment, both topics which we will explore in greater depth below.</p><h2>Traders show strength in margin, options and futures markets</h2><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/1ced6ac0-004b-471b-9338-21cc81eb59d4.png\"><figcaption style=\"text-align: center;\"><em>OKX stablecoin/BTC margin lending ratio. Source: OKX</em></figcaption></figure><p>The OKX margin lending indicator based on the stablecoin/BTC ratio has steadily increased from 20x favoring longs on July 1 to the current 29x ratio on July 7, indicating growing confidence among traders using margin lending. However, it remains within a neutral-to-bullish range below the historical 30x threshold associated with excessive optimism.</p><p>Besides leaving room for further long leverage, the indicator shows no signs of potential stress on margin markets in case of a sudden Bitcoin price correction.</p><h2>Traders aren’t buying protective puts or increasing their shorts</h2><p>Traders can also gauge the market’s sentiment by measuring whether more activity is going through call (buy) options or put (sell) options. A 0.70 put-to-call ratio indicates that put option open interest lags the more bullish calls and is, therefore, bullish. In contrast, a 1.40 indicator favors put options, which can be deemed bearish.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/caa7238d-f412-4676-b43b-fcf6dc36b8d5.png\"><figcaption style=\"text-align: center;\"><em>BTC options volume put-to-call ratio. Source: Laevitas</em></figcaption></figure><p>The put-to-call ratio for Bitcoin options volume has remained below 1.0 for the past three days, suggesting a higher preference for neutral-to-bullish call options. The important thing here is, despite Bitcoin price briefly correcting to $29,750 on July 7, there was not a significant surge in demand for protective put options.</p><p>The top traders’ long-to-short net ratio excludes externalities that might have solely impacted the options markets. There are occasional methodological discrepancies between different exchanges, so viewers should monitor changes instead of absolute figures.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/b9929eb5-7282-4f1a-8418-b1ca3f3daed2.png\"><figcaption style=\"text-align: center;\"><em>Exchange's top traders long-to-short ratio. Source: Coinglass</em></figcaption></figure><p>The long-to-short ratio for OKX's top traders increased from 0.52 on July 3 to 1.68 on July 7, indicating strong demand for leveraged long positions despite Bitcoin's failure to break above $31,000. At Binance, the indicator declined from 1.52 on July 3 to 1.39 on July 7, remaining above its 1.33 average for the previous 30 days, which suggests a neutral reading.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-mining-stocks-outperform-btc-in-2023-but-on-chain-data-points-to-a-potential-stall\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-mining-stocks-outperform-btc-in-2023-but-on-chain-data-points-to-a-potential-stall/amp\"><strong><em>Bitcoin mining stocks outperform BTC in 2023, but on-chain data points to a potential stall</em></strong></a></p><h2>Bears will have a tough time given the markets’ expectation of a ETF approval potential</h2><p>Natalie Brunell, an award-winning TV journalist, podcast host, and educator in the Bitcoin space, spoke to Cointelegraph on how<a href=\"https://cointelegraph.com/news/why-a-bitcoin-etf-approval-would-be-a-big-deal\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/why-a-bitcoin-etf-approval-would-be-a-big-deal/amp\"> crypto is now being taken more seriously</a> as an asset class by institutional investors, as evident by the multiple Bitcoin ETF filings, including some of the world’s largest asset fund managers.</p><p>Speaking on Fox Business on July 5, Larry Fink, the CEO of BlackRock, also said that<a href=\"https://cointelegraph.com/news/bitcoin-international-asset-black-rock-ceo-bullish-remarks\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-international-asset-black-rock-ceo-bullish-remarks/amp\"> Bitcoin’s role was largely \"digitizing gold,\"</a> suggesting U.S. regulators consider how a spot-based ETF could democratize finance. Fink suggested that investors could turn to Bitcoin as a hedge against inflation or the devaluation of certain currencies.</p><p>So, in a more birds-eye-view, those questioning whether Bitcoin is poised for a correction after a rally fueled by ETF hype, the resilience of traders’ bullish conviction and lack of excessive optimism observed in the BTC margin, need to relax. </p><p>Bitcoin options, and futures markets indicate that challenging times are ahead for Bitcoin bears and those expecting a sharp price correction solely due to regulatory and recessionary concerns.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-07T20:43:35.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting the Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Bitcoin Ordinal trading volume increased 2834% in Q2 to $210.7 million by the end of June. Ethereum co-founder Vitalik Buterin says \"builder culture\" has returned to Bitcoin with the advent of Bitcoin Ordinals and BRC-20. Analysts at JPMorgan Chase have thrown cold water on the notion that a spot Bitcoin exchange-traded fund (ETF) in the United States will have a meaningful impact on price. Here's what happened in crypto today.</p><h2>Spot Bitcoin ETF won't be a game changer in the United States — JPMorgan</h2><p>Investors banking on a massive bull run following the approval of a U.S. spot Bitcoin ETF will be disappointed, <a href=\"https://cointelegraph.com/news/etf-approval-may-boost-bitcoin-liquidity-but-wont-be-game-changer-jp-morgan\">according to analysts at JPMorgan</a>. To understand why, we can look at spot Bitcoin ETF markets in Canada and Europe. These funds have \"attracted little investor interest\" over the past two years and have failed \"to benefit from investor outflows from gold ETFs,\" said JPMorgan managing director Nikolaos Panigirtzoglou.</p><p>The U.S. Securities and Exchange Commission is currently entertaining several spot Bitcoin ETF applications, including one from BlackRock that has stoked investors' anticipation about a possible approval. That's because BlackRock has filed 550 ETF applications and has only been rejected once. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> is an International Asset. - Larry Fink, BlackRock CEO <a href=\"https://t.co/WIVKITXYPj\">pic.twitter.com/WIVKITXYPj</a></p>&mdash; Michael Saylor⚡️ (@saylor) <a href=\"https://twitter.com/saylor/status/1676687611379826688?ref_src=twsrc%5Etfw\">July 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Bitcoin Ordinals volume hits $210M in Q2</h2><p>The creation of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) Ordinals inscriptions on the Bitcoin blockchain has led to over $210 million in trading volume, Cointelegraph independently verified the latest quarterly report from DappRadar. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/4e967800-67e6-4e09-bbfa-6cb087112a16.png\"  /></figure><p>Near the end of May 2023, Bitcoin surpassed Solana to become the second-most popular nonfungible token (NFT) blockchain, leaving the preeminent cryptocurrency blockchain only behind Ethereum in NFT trading volumes.</p><p>Bitcoin Ordinal trading volume increased from $7.18 million in the first quarter of the year to $210.7 million by the end of June. DappRadar pins the quarterly increase at 2834%.</p><h3>Vitalik Buterin praises Bitcoin Ordinals for reviving 'builder culture' </h3><p>Ethereum co-founder Vitalik Buterin has given props to the advent of Bitcoin Ordinals for bringing back the “organic return of builder culture” to the Bitcoin ecosystem during a Twitter Space on July 7.</p><p>Buterin praised Ordinals and the BRC-20 token standard which he sees as a rejection of “stagnant” politics in the Bitcoin ecosystem.</p><blockquote>“Ordinals are starting to bring back a culture of actually doing things. It feels like there's real pushback to the laser-eye movement, which is good.\"</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Vitalik Buterin: I definitely see signs of hope now that we have Ordinals that are starting to kind of bring back the culture of actually doing things.<br><br>Sound on. <a href=\"https://t.co/5rZCBk0v6D\">pic.twitter.com/5rZCBk0v6D</a></p>&mdash; Paulo (@TycoonPal) <a href=\"https://twitter.com/TycoonPal/status/1677051653244043264?ref_src=twsrc%5Etfw\">July 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T20:56:27.000Z",
    "title": "FBI investigates Kraken co-founder for alleged hacking",
    "url": "https://www.cryptopolitan.com/fbi-investigates-co-founder-alleged-hacking/",
    "description": "The United States Federal Bureau of Investigations (FBI) searched the home belonging to Jesse Powell, co-founder of cryptocurrency exchange Kraken, in March. The search was part of an investigation into allegations that Powell had hacked and cyber-stalked a nonprofit arts group. The FBI raided Powell’s home in March According to sources familiar with the matter, ... <a title=\"FBI investigates Kraken co-founder for alleged hacking\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fbi-investigates-co-founder-alleged-hacking/\" aria-label=\"More on FBI investigates Kraken co-founder for alleged hacking\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T20:55:38.000Z",
    "title": "Filecoin Price Prediction 2023-2032: What’s the future for FIL?",
    "url": "https://www.cryptopolitan.com/filecoin-price-prediction/",
    "description": "Filecoin Price Prediction 2023-2032 How much is Filecoin (FIL) worth? The live Filecoin price today is $4.41 with a 24-hour trading volume of $104,788,726. Filecoin is up 0.96% in the last 24 hours. The current CoinMarketCap ranking is #30, with a live market cap of $1,916,130,978. It has a circulating supply of 434,509,323 FIL coins ... <a title=\"Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/filecoin-price-prediction/\" aria-label=\"More on Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T20:54:04.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T20:39:59.000Z",
    "title": "Ark Invest says institutional investors are still showing bullish signs",
    "url": "https://www.cryptopolitan.com/ark-invest-says-investors-bullish-signs/",
    "description": "Institutional investors and long-term Bitcoin holders are displaying signs of heightened bullishness, as indicated by several key indicators reaching new highs, according to a report by ARK Invest. The latest issue of The Bitcoin Monthly, described as an “earnings report” that provides insights into on-chain activity, reveals that the balance of Bitcoin held on over-the-counter ... <a title=\"Ark Invest says institutional investors are still showing bullish signs\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ark-invest-says-investors-bullish-signs/\" aria-label=\"More on Ark Invest says institutional investors are still showing bullish signs\">Read more</a>"
  }
]