[
  {
    "source": "CoinDesk",
    "date": "2023-07-10T20:59:18.000Z",
    "title": "Crypto Startup Arkham Has Apparently Been Doxxing Users for Months",
    "url": "https://www.coindesk.com/business/2023/07/10/crypto-startup-arkham-has-apparently-been-doxxing-privacy-obsessed-users-for-months/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The company had already angered the crypto community Monday with a service that unmasks anonymous crypto users. Then came allegations it used an easy-to-decipher method for hiding customers’ email addresses."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-10T20:38:05.000Z",
    "title": "ApeCoin Crashes to All-Time Low as Bored Ape Yacht Club NFT Prices Sink",
    "url": "https://decrypt.co/147982/apecoin-crashes-all-time-low-bored-ape-yacht-club-nft-prices-sink",
    "description": "The Ethereum token linked to Yuga Labs' Bored Ape Yacht Club collection has now fallen nearly 93% from its peak price."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-10T20:53:57.000Z",
    "title": "Arcadia Finance hacker used reentrancy exploit, team demands return of funds",
    "url": "https://cointelegraph.com/news/arcadia-finance-hacker-used-reentrancy-exploit-team-demands-return-of-funds",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/53d30175-f0f6-4924-adb5-bb2fb76338c1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In a post-mortem report, Arcadia Finance developers said an attacker stole funds by liquidating a vault before it could perform a health check, interrupting the app's normal flow of operations.</p>\n                    <p><p>The Arcadia Finance attacker used a reentrancy exploit to drain $455,000 from the decentralized finance (DeFi) protocol, according to a July 10 post-mortem report <a href=\"https://arcadiafinance.medium.com/post-mortem-72e9d24a79b0\" target=\"_blank\" rel=\"noopener nofollow\">issued</a> by the app’s development team. A “reentrancy exploit” is a bug that allows an attacker to “re-enter” a contract or interrupt it during a multi-step process, preventing the process from being completed correctly.</p><p>The team has sent a message to the attacker demanding the return of funds within 24 hours and threatening police action if they fail to comply.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Post Mortem of ongoing situation, providing a technical overview and sharing more information on next steps.<a href=\"https://t.co/NPNbbSzKBQ\">https://t.co/NPNbbSzKBQ</a></p>&mdash; Arcadia Finance (@ArcadiaFi) <a href=\"https://twitter.com/ArcadiaFi/status/1678446942446034946?ref_src=twsrc%5Etfw\">July 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Arcadia Finance was <a href=\"https://cointelegraph.com/news/arcadia-finance-hacked-on-ethereum-and-optimism-for-455k\">exploited on the morning of July 10</a> and drained of $455,000 worth of crypto. A preliminary report from blockchain security firm Peckshield stated that the attacker had used a “lack of untrusted input validation” in the app’s contracts to drain the funds. The Arcadia team had denied this, stating that Peckshield’s analysis was mistaken. However, the team did not explain what they thought the cause was at the time.</p><p>The new Arcadia report stated that the app’s \"liquidateVault()\" function did not contain a reentrancy check. This allowed the attacker to call the function before a health check had been completed but after the attacker had withdrawn funds. As a result, the attacker could borrow funds and not pay them back, draining them from the protocol.</p><p>The team has now paused the contracts and is working on a patch to close the loophole.</p><p>The attacker first took a flash loan from Aave for $20,672 worth of US Dollar Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) and deposited it into an Arcadia vault. Next, they used this vault collateral to borrow $103,210 USDC from an Arcadia liquidity pool. This was accomplished through a \"doActionWithLeverage()\" function that allows users to borrow funds only if their account can remain healthy by the end of the block. </p><p>The attacker deposited the $103,210 into the vault, bringing the total funds to $123,882. They then withdrew all funds, leaving the vault with no assets and $103,210 in debt.</p><p>Theoretically, this should have caused all actions to revert, as withdrawing the funds should have caused the account to fail a health check. However, the attacker used a malicious contract to call liquidateVault() before the health check could commence. The vault was liquidated, eliminating all of its debts. As a result, it was left with zero assets and zero liabilities, allowing it to pass the health check.</p><p>Since the account passed the health check after all transactions were concluded, none of the transactions reverted, and the pool was drained of $103,210. The attacker paid back the loan from Aave within the same block. They repeated this exploit multiple times, draining a total of $455,000 from pools on Optimism and Ethereum.</p><p>In its report, Arcadia's team pushed back against claims that the exploit was caused by untrusted input, stating that this alleged vulnerability was not “the core issue” in the attack.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/circle-tether-freezes-over-65m-in-assets-transferred-from-multichain\"><strong>Circle, Tether freezes over $65M in assets transferred from Multichain</strong></a></em></p><p>The Arcadia team <a href=\"https://optimistic.etherscan.io/tx/0xc598bf554a738ebeec234930e4bffe1c7a4266a1bbbdfae63b6951e448a17fc5\" target=\"_blank\" rel=\"noopener nofollow\">posted</a> a message to the attacker using the input data field of an Optimism transaction, stating:</p><blockquote>“We understand you are involved with Arcadia Finance’s exploit. We're actively working with security experts and law enforcement. Your TC deposits and withdrawals on BNB were a bit too fast, it's hard to hide your identity online these days. We will escalate this with law enforcement in absence of any funds being returned within the next 24 hours.”</blockquote><p>In its report, Arcadia claimed it had found some promising leads for tracking down the attacker. “Besides obtaining addresses linked to centralized exchanges, we also uncovered links to previous exploits of other protocols,” they said. “The team is investigating both on-chain and off-chain data to the fullest extent and has multiple leads.”</p><p>Exploits and scams have been a continuing problem in the DeFi space in 2023. A July 5 report from Certik stated that over $300 million was <a href=\"https://cointelegraph.com/news/crypto-hacks-and-exploits-snatch-over-300m-in-q2-2023-report\">lost due to exploits</a> in the second quarter of the year.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-10T20:21:40.000Z",
    "title": "US lawmakers allege CCP connection in calling for SEC, DOJ investigation of Prometheum",
    "url": "https://cointelegraph.com/news/us-lawmakers-allege-ccp-connection-sec-doj-investigation-prometheum",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/683b6b50-eb20-4d8c-9bec-5bec26a306cb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Republican members of Congress stepped up their allegations of Prometheum’s ties to the Chinese Community Party, claiming potentially false or misleading statements to the SEC.</p>\n                    <p><p>Six members of the United States Congress have called on the U.S. Securities and Exchange Commission (SEC) and Department of Justice to investigate Prometheum, claiming the firm has ties to the Chinese Communist Party. </p><p>In a July 10 letter, Alabama Sen. Tommy Tuberville and five members of the House of Representatives <a href=\"https://www.tuberville.senate.gov/wp-content/uploads/DOJ-SEC-Oversight-Letter-re-Prometheum-July-202311.pdf\" target=\"_blank\" rel=\"noopener nofollow\">alleged</a> Prometheum co-CEO Aaron Kaplan may have provided false testimony at a June 13 <a href=\"https://cointelegraph.com/news/who-is-prometheum-what-testify-congress-about-crypto-sec\">hearing on regulatory clarity</a> in the crypto space. The U.S. lawmakers claimed Prometheum was connected to investors with “with ties\" to the Chinese Community Party: Shanghai Wanxiang Blockchain and HashKey Digital Asset Group.</p><p>According to Tuberville and the Representatives, Kaplan’s testimony before Congress suggested Prometheum had been developed independently of Wanxiang and HashKey, allegedly contradicting information the firm had provided in SEC filings. The lawmakers called on SEC Chair Gary Gensler and Attorney General Merrick Garland to look into the matter.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">.<a href=\"https://twitter.com/SenTuberville?ref_src=twsrc%5Etfw\">@SenTuberville</a> op-ed: It’s past time for the DOJ and the SEC to investigate Prometheum’s ties to China<a href=\"https://t.co/57yMDtMt7V\">https://t.co/57yMDtMt7V</a></p>&mdash; 1819 News (@1819News) <a href=\"https://twitter.com/1819News/status/1678396170735894530?ref_src=twsrc%5Etfw\">July 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blockchain-association-requests-prometheum-info-from-sec\"><strong><em>Blockchain Assoc. requests info on Prometheum over ‘suspicious’ approval</em></strong></a></p><p>Many lawmakers within the Republican party — which includes the six members who signed onto the July 10 letter — have often <a href=\"https://cointelegraph.com/news/republican-lawmakers-introduce-bill-targeting-china-s-cbdc-on-sanctions-privacy\">invoked concerns about affiliations</a> with China-based entities or the country’s government in considering regulation or laws on digital assets. Former Sen. Pat Toomey and Minnesota Rep. Tom Emmer <a href=\"https://cointelegraph.com/news/us-lawmakers-issue-warnings-about-digital-yuan-as-winter-olympics-kicks-off\">both issued warnings</a> on using China’s digital yuan at the Beijing 2022 Winter Olympics.</p><p>Cointelegraph reached out to Aaron Kaplan for comment but did not receive a response at the time of publication. However, a June 23 Wall Street Journal op-ed by Aaron Kaplan and co-CEO Benjamin Kaplan <a href=\"https://www.wsj.com/articles/prometheum-digital-asset-crypto-china-wanxiang-tuberville-eab5629b\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> Tuberville’s concerns on Prometheum’s alleged ties to China were “without merit” and relied on “out-of-date information.”</p><p>“We formally terminated all co-development work and strategic relationships with Wanxiang and its affiliates on Oct. 21, 2021,” said the co-CEOs. “Prometheum has severed all intellectual property and technology ties to Wanxiang, giving it and its affiliates no access to any information that could expose the U.S. or its citizens to risk.”</p><p>The Prometheum co-CEO said the firm left the U.S.-based crypto advocacy group Chamber of Digital Commerce in early 2023. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-10T20:00:00.000Z",
    "title": "From Thailand to South Africa, regulators tighten their grip on crypto: Law Decoded, July 3–10",
    "url": "https://cointelegraph.com/news/from-thailand-to-south-africa-regulators-tighten-their-grip-on-crypto-law-decoded-july-3-10",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/d8689d9c-2813-4f46-9fee-3665de4970de.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>South Africa’s financial regulator has announced that all crypto exchanges in the country must obtain licenses by the end of 2023.</p>\n                    <p><p>Last week saw more rules and regulations emerge regarding digital assets. Thailand’s Securities and Exchange Commission issued new rules requiring digital asset service providers to <a href=\"https://cointelegraph.com/news/crypto-thai-sec-bans-the-use-of-customer-crypto-assets-for-lending-and-investment\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-thai-sec-bans-the-use-of-customer-crypto-assets-for-lending-and-investment/amp\">warn customers of risks</a> associated with cryptocurrency trading. The warning message must be clearly visible, and before customers can use the service, the business operator must arrange for the users to give consent and acknowledge the risks. Apart from a trading risks disclaimer, the new guidelines prohibit service providers from using customers’ funds for lending or investment.</p><p>The Monetary Authority of Singapore announced new requirements for crypto service providers to <a href=\"https://cointelegraph.com/news/singapore-to-require-crypto-firms-to-put-user-assets-into-trusts-by-year-end\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/singapore-to-require-crypto-firms-to-put-user-assets-into-trusts-by-year-end/amp\">hold customer assets in a statutory trust</a> by the end of 2023.“This will mitigate the risk of loss or misuse of customers’ assets, and facilitate the recovery of customers’ assets in the event of a DPT [digital payment token] service provider’s insolvency,” the authority says.</p><p>South Africa’s financial regulator, the Financial Sector Conduct Authority, has announced that all crypto exchanges in the country must <a href=\"https://cointelegraph.com/news/crypto-exchange-licences-south-africa-by-year-end\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-exchange-licences-south-africa-by-year-end/amp\">obtain licenses by the end of 2023</a>. If crypto exchanges continue to operate without a license after the deadline, the regulator intends to take “enforcement action,” which may involve fines or the closure of noncompliant firms. </p><p>In Belarus, the Ministry of Foreign Affairs is working on legal amendments <a href=\"https://cointelegraph.com/news/belarus-wants-to-ban-p2p-cryptocurrency-transactions\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/belarus-wants-to-ban-p2p-cryptocurrency-transactions/amp\">prohibiting peer-to-peer (P2P) transactions</a> in cryptocurrencies like Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). The ministry argued that crypto P2P services are “in demand among fraudsters who cash out and convert stolen funds and transfer money to organizers or participants in criminal schemes.”</p><h3>Binance Australia offices were reportedly searched by the local regulator</h3><p>The Australian Securities and Investments Commission conducted searches at Binance Australia locations. The investigation was part of an ongoing probe of Binance’s now-defunct Australian derivatives business. Binance’s representative did not confirm or deny to Cointelegraph whether the company’s offices were searched or whether the company was aware of a local probe. “We are cooperating with local authorities, and Binance is focused on meeting local regulatory standards in order to serve our users in Australia in a fully compliant manner,” a spokesperson for Binance Australia told Cointelegraph.</p><p><a href=\"https://cointelegraph.com/news/binance-australia-offices-reportedly-searched-by-local-regulator\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-australia-offices-reportedly-searched-by-local-regulator/amp\"><strong>Continue reading</strong></a><strong> </strong></p><h3>Denmark orders Saxo Bank to erase cryptocurrency holdings</h3><p>Financial regulators in Denmark are coming after cryptocurrency service providers, declaring that local banks cannot hold cryptocurrency to hedge against trading risks. The Danish Financial Supervisory Authority (DFSA) officially ordered local investment bank Saxo Bank to dispose of its own holdings in crypto. According to the DFSA, Saxo Bank offers its customers the opportunity to trade a number of cryptocurrency products through its platform. The firm also offers several crypto-linked exchange-traded funds and exchange-traded notes, the regulator said, adding that “it is possible to speculate on crypto assets.”</p><p><a href=\"https://cointelegraph.com/news/denmark-orders-saxo-bank-to-erase-cryptocurrency-holdings\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/denmark-orders-saxo-bank-to-erase-cryptocurrency-holdings/amp\"><strong>Continue reading</strong></a></p><h3>Twitter receives money transmitter licenses in three U.S. states</h3><p>Twitter Payments, a subsidiary of Elon Musk’s Twitter social network, appears to have received its first money transmitter licenses after Michigan, New Hampshire and Missouri approved the company’s applications. A money transmitter license allows a company to provide transfer services or payment instruments. This differs from a license to conduct sales in that it’s meant to offer consumer protections for businesses that facilitate the transmission of money from one party to another, not just the purchase of products and services.</p><p>It remains unclear at this time exactly what offerings will be on tap if and when Twitter Payments eventually rolls out. The company applied for licenses in all 50 United States states, and there’s no clear timeline for the approval process. </p><p><a href=\"https://cointelegraph.com/news/twitter-receives-money-transmitter-licenses-three-us-states\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/twitter-receives-money-transmitter-licenses-three-us-states/amp\"><strong>Continue reading</strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-10T19:50:00.000Z",
    "title": "Connext founder proposes ‘Sovereign Bridged Token’ standard after Multichain incident",
    "url": "https://cointelegraph.com/news/connext-founder-proposes-sovereign-bridged-token-standard-after-multichain-incident",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/eda9fbfd-d5cb-41b9-95d1-ee84c7943455.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>EIP-7281 will allow token issuers to list official bridges and limit the rate at which they can mint tokens, potentially limiting losses from bridge hacks.</p>\n                    <p><p>An Ethereum Improvement Proposal (EIP) made on July 7 seeks to standardize how tokens are bridged between networks. The “Sovereign Bridged Token” standard, or EIP-7281, allows token issuers to <a href=\"https://ethereum-magicians.org/t/erc-7281-sovereign-bridged-tokens/14979\" target=\"_blank\" rel=\"noopener nofollow\">create</a> canonical bridges across multiple networks.</p><p>The proposal was co-authored by Arjun Bhuptani, founder of the Connext bridging protocol. In a July 7 social media post, Bhuptani <a href=\"https://twitter.com/arjunbhuptani/status/1677363289964306432\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> the protocol would help prevent issues like the July 6 Multichain incident, which some experts <a href=\"https://cointelegraph.com/news/multichain-mpc-bridge-sees-millions-in-outflows-exploit-feared\">have described as a hack</a>.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today&#39;s <a href=\"https://twitter.com/MultichainOrg?ref_src=twsrc%5Etfw\">@MultichainOrg</a> hack is a sad reminder of the systemic risks tokens face from bridges.<br><br>We believe these risks stem from a single underlying problem:<br><br>✨Token Sovereignty✨<br><br>We&#39;re proposing ERC-7281 (aka xERC20) - an open standard to fix this.<a href=\"https://t.co/k9Vyd55Eb5\">https://t.co/k9Vyd55Eb5</a><br><br>1/x</p>&mdash; Arjun | ERC-7281 arc  (@arjunbhuptani) <a href=\"https://twitter.com/arjunbhuptani/status/1677363289964306432?ref_src=twsrc%5Etfw\">July 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to the proposal’s discussion page, it allows token issuers to designate a list of canonical bridges. Only bridges added to this list could mint an official version of the issuer’s token. Issuers can also limit the number of tokens a bridge is allowed to mint. These parameters can be changed at virtually any time by the issuer.</p><p>In Bhuptani’s view, this proposal will ensure that “ownership of tokens is shifted away from bridges (canonical or 3rd party) into the hands of token issuers themselves” and will limit losses if a bridge’s security comes into question:</p><blockquote>“In the event of a hack or vulnerability for a given bridge (e.g. today’s Multichain hack), issuer risk is capped to the rate limit of that bridge and issuers can seamlessly delist a bridge without needing to go through a painful and time-intensive migration process with users.”</blockquote><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/30b-stolen-from-crypto-ecosystem-since-2012-report\"><strong>$30B stolen from crypto ecosystem since 2012: Report</strong></a></em></p><p>Bhuptani said the proposal would also help prevent user experience problems in decentralized finance, as all bridges will issue the same official token. Over time, this will eliminate the need for multiple versions of the same token, he claimed.</p><p>Stablecoin issuer Circle has already created the Cross-Chain Transfer Protocol (CCTP) to <a href=\"https://cointelegraph.com/news/circle-launches-cross-chain-usdc-transfer-protocol-for-ethereum-avalanche\">list official bridges</a> for its token, USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>). EIP-7281 intends to implement the basic concept behind CCTP but also tries to <a href=\"https://github.com/ethereum/EIPs/pull/7281/files\" target=\"_blank\" rel=\"noopener nofollow\">make</a> this solution apply “more broadly to all tokens,” according to the proposal’s notes.</p><p>Both Circle and Tether have <a href=\"https://cointelegraph.com/news/circle-tether-freezes-over-65m-in-assets-transferred-from-multichain\">blacklisted some of the addresses</a> used in the Multichain incident, preventing $65 million worth of USDC and Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) from being moved out of these addresses.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-10T20:57:15.000Z",
    "title": "Grayscale challenges SEC’s decision on leveraged Bitcoin ETF as GBTC discount narrows",
    "url": "https://cryptoslate.com/grayscale-challenges-secs-decision-on-leveraged-bitcoin-etf-as-gbtc-discount-narrows/",
    "description": "<p>Crypto asset manager Grayscale has questioned the U.S. Securities and Exchange Commission&#8217;s decision to approve a leveraged Bitcoin (BTC) exchange-traded fund (ETF) in a June 10 letter. The firm&#8217;s Bitcoin Trust (GBTC) also narrowed to its lowest point since May 2022, according to ycharts data, GBTC discount narrows GBTC&#8217;s discount to its net asset value [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/grayscale-challenges-secs-decision-on-leveraged-bitcoin-etf-as-gbtc-discount-narrows/\">Grayscale challenges SEC&#8217;s decision on leveraged Bitcoin ETF as GBTC discount narrows</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-10T20:00:31.000Z",
    "title": "Matrixport’s Year-End 2024 Prediction: Bitcoin to Reach $125,000 as Strong Performance Fuels Bullish Sentiment",
    "url": "https://news.bitcoin.com/matrixports-year-end-2024-prediction-bitcoin-to-reach-125000-as-strong-performance-fuels-bullish-sentiment/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/moon-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Matrixport&#039;s Year-End 2024 Prediction: Bitcoin to Reach $125,000 as Strong Performance Fuels Bullish Sentiment\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/moon-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/moon-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/moon-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/moon-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/moon-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/moon-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/moon.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />While bitcoin has shown strong performance in the first half of 2023, Markus Thielen, the head of research at crypto firm Matrixport, released a prediction on July 5, 2023, stating that bitcoin (BTC) will reach $125,000 by the end of 2024. Thielen&#x2019;s forecast is based on a signal indicating the conclusion of the bear market, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T21:08:59.000Z",
    "title": "HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?",
    "url": "https://www.cryptopolitan.com/hbar-price-prediction/",
    "description": "HBAR Price Prediction 2023-2032 Hedera Hashgraph is a trending cryptocurrency focused on providing a sustainable, enterprise-grade blockchain.&#160; The asset has been performing extremely well recently, prompting investors everywhere to search for a Hedera Hashgraph price prediction. So that is a heads-up in crypto winter despite the doom which tends to pull everyone else connected to ... <a title=\"HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hbar-price-prediction/\" aria-label=\"More on HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T20:19:55.000Z",
    "title": "Filecoin Price Prediction 2023-2032: What’s the future for FIL?",
    "url": "https://www.cryptopolitan.com/filecoin-price-prediction/",
    "description": "Filecoin Price Prediction 2023-2032 How much is Filecoin (FIL) worth? The live Filecoin price today is $4.35 USD with a 24-hour trading volume of $105,079,254. Filecoin is down 0.04% in the last 24 hours. The current CoinMarketCap ranking is #30, with a live market cap of $1,890,304,662 USD. It has a circulating supply of 434,784,968 ... <a title=\"Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/filecoin-price-prediction/\" aria-label=\"More on Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T19:51:31.000Z",
    "title": "Social Media sentiment holds the key to Crypto profits – study",
    "url": "https://www.cryptopolitan.com/social-media-sentiment-vs-crypto-profits/",
    "description": "A recent study conducted by researchers at Pennsylvania State University delved into the relationship between social media, attitudes, emotions, and the cryptocurrency market. The findings of their analysis may challenge conventional wisdom regarding similar trends in other financial markets. The research paper highlighted the significant role that social media platforms play in cryptocurrency adoption and ... <a title=\"Social Media sentiment holds the key to Crypto profits &#8211; study\" class=\"read-more\" href=\"https://www.cryptopolitan.com/social-media-sentiment-vs-crypto-profits/\" aria-label=\"More on Social Media sentiment holds the key to Crypto profits &#8211; study\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-10T21:00:24.000Z",
    "title": "Revolutionary InQubeta (QUBE) is Outperforming Monero (XMR) and Filecoin (FIL)",
    "url": "https://nulltx.com/revolutionary-inqubeta-qube-is-outperforming-monero-xmr-and-filecoin-fil/",
    "description": "InQubeta (QUBE) is an innovative force in the crypto market, poised to revolutionize the way AI startups raise funds and engage with investors. With its unique approach, InQubeta is outperforming established players like Monero (XMR) and Filecoin (FIL). Let&#8217;s explore how this innovative concept is reshaping the investment landscape and surpassing the competition. InQubeta&#8217;s Vision [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-10T19:44:05.000Z",
    "title": "Tradecurve price prediction for July: bitdao and huobi token remain bearish",
    "url": "https://crypto.news/tradecurve-price-prediction-for-july-bitdao-and-huobi-token-remain-bearish/",
    "description": "This article delves into the recent performance of BitDAO, Huobi Token facing bearish pressure, and provides predictions for the price of Tradecurve in July"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-10T21:00:28.000Z",
    "title": "More People Talking About XRP, Will Bulls Break Above $0.60?",
    "url": "https://www.newsbtc.com/news/ripple/more-people-talking-about-xrp-will-bulls-break-above-0-60/",
    "description": "On-chain data compiled by Santiment, an analytics platform, shows that more people are discussing XRP, the native token of the XRP Ledger (XRPL), per statistics captured on July 10. In their assessment, the spike in social chatter, translating to higher social dominance, will most likely draw demand for the crypto asset that has recently been under selling pressure but firm. The rise in XRP&#8217;s social dominance is the highest since May, suggesting that market sentiment could change. Despite this increment, XRP prices are relatively muted, stable on the last trading day, but unable to break above $0.50, a psychological reaction level.  XRP Social Dominance Rising, Will Prices Rally? Over the past few weeks, Santiment data shows that XRP&#8217;s social volume drawn from social media activity has been relatively low. This could be due to several factors, the main one being the lack of significant updates on the legal dispute between Ripple and the U.S. Securities and Exchange Commission (SEC). Related Reading: Shiba Inu (SHIB) Breakout Alert: Potential 30% Rally Looming Beyond the lawsuit pitting the blockchain company and the regulator who has been, in recent days, cracking the whip on crypto firms, crypto prices have been soft, and XRP has been no exception. To illustrate, although the coin is firm, bulls failed to push prices above the $0.58 level. Presently, XRP is down roughly 20% from H1 2023 highs. Primary support is at around $0.45, marking June 2023 lows. Comparing the current surge in social dominance to previous instances in May, Santiment draws attention to the correlation between increased social activity and XRP price expansions. When XRP&#8217;s social dominance peaked at 7.4% in May, prices, the analytics platform observed, rose in lock-step.  Meanwhile, when XRP&#8217;s social dominance decreased in May, its price also fell. Therefore, while the social dominance of XRP is firm in early July, it remains to be seen whether bulls will flow back and pump prices higher toward the $0.60 liquidation line. Bullish Signals According to Santiment, rising XRP social dominance in the current environment when prices are weak could signal that bulls may offer support in upcoming sessions. In turn, this may inject optimism and momentum considering the recent fear, uncertainty, and doubt (FUD) in crypto primarily due to the SEC&#8217;s lawsuits against two of the world&#8217;s most popular cryptocurrency exchanges, Binance and Coinbase, in June. Related Reading: XRP FUD Spikes, Will This Trigger A Price Reversal? The SEC alleges that among other coins, ADA, the native currency of Cardano, and ALGO, the token priming the Algorand ecosystem, are unregistered securities. At the same time, in December 2020, the regulator filed a lawsuit claiming that Ripple, the blockchain company, raised billions using XRP.  Feature image from Canva, chart from TradingView"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-10T20:00:20.000Z",
    "title": "PancakeSwap And Google Cloud Join Forces: Altcoin Price Rises",
    "url": "https://www.newsbtc.com/analysis/cake/pancakeswap-and-google-cloud-join-forces-altcoin-price-rises/",
    "description": "PancakeSwap (CAKE), a decentralized trading platform, has partnered with Google Cloud to ensure the availability and reliability of its infrastructure.  As the demand for decentralized finance (DeFi) grows, PancakeSwap aims to offer users a user-friendly platform to trade their assets without intermediaries.  PancakeSwap And Google Cloud Collaboration Moreover, PancakeSwap leverages Google Kubernetes Engine to scale its nodes quickly and accurately predict traffic spikes with the help of the PreditKube solution from Dysnix. Dysnix&#8217;s PreditKube solution helped PancakeSwap accurately predict traffic spikes and automate the up-and-down scaling of blockchain nodes ahead of time to manage the anticipated traffic surge. This approach ensured that PancakeSwap&#8217;s infrastructure could handle a fluctuating number of requests with high scalability, maintaining an uptime of 99.99%. Related Reading: Arkham’s New Crypto Intel Trading Platform: A Game Changer For Traders? Dysnix says their PreditKube solution accurately predicts more than 90% of traffic spikes on PancakeSwap. By automating the up-and-down scaling of nodes, PancakeSwap managed the anticipated traffic surge and reduced its infrastructure costs by more than 30%.  One of the critical challenges for any trading platform is ensuring the security of smart contracts. PancakeSwap works with various audit firms to identify potential loopholes and leverages Cloud Armor to filter sensitive data.  With its smart contracts secured, PancakeSwap aims to expand its services by adding more chains and exploring non-fungible tokens (NFTs). Moreover, to improve users&#8217; trading experience, PancakeSwap plans to leverage BigQuery to manage and analyze historical blockchain data. By simplifying complex data, PancakeSwap aims to make blockchain trading accessible to everyone.  With Google Cloud&#8217;s fully managed services, PancakeSwap&#8217;s engineers can focus on developing new features and improving the user experience rather than dealing with infrastructure issues. Chef Jojo, Technical Lead at PancakeSwap, stated: At one point, we had more than one billion requests on the BNB Chain, but this is changing all the time due to the BNB network changes, among other variables. With Google Kubernetes Engine, we can quickly scale up when there are many requests. Google Cloud Boosts CAKE Token Value PancakeSwap&#8217;s native token, CAKE, has seen a 3.9% increase in value within the last 24 hours following the announcement of its partnership with Google Cloud.  Currently, CAKE is trading at $1.517 after being range-bound between $1.454 and $1.481 for the past four days. The partnership with Google Cloud has provided the much-needed momentum for CAKE to break out of this range and continue its upward trend. However, CAKE is now facing a significant resistance level at $1.525, which has not been surpassed since July 6th.  On the other hand,  PancakeSwap&#8217;s market cap (circulating) is currently at $327.94 million, representing a decline of 1.10% in the past 24 hours. Meanwhile, its fully diluted market cap stands at $1.13 billion, representing a decline of 5.73%. According to data from Token Terminal, PancakeSwap&#8217;s revenue for the past 30 days is at $1.41 million, marking a decrease of 31.55% from the previous period. Similarly, its annualized revenue is $17.11 million, representing a decrease of 39.79%. Related Reading: US Presidential Candidate Robert F. Kennedy Jr Called Out For Lying About Bitcoin Investment Furthermore, Token Terminal highlights that PancakeSwap&#8217;s total value locked (TVL) is currently at $1.22 billion, representing a decline of 4.73% in the past 24 hours. On the other hand, the platform&#8217;s trading volume (annualized) is at $48.50 billion, indicating a decrease of 25.66% from the previous period. Data also shows that PancakeSwap&#8217;s P/S ratio (fully diluted) is at 64.25x, representing an increase of 38.0%. Meanwhile, its P/F ratio (fully diluted) stands at 21.71x, indicating an increase of 38.8%. Featured image from Unsplash, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-10T20:00:05.000Z",
    "title": "Bank for International Settlements Says DeFi To Act As Starting Point for CBDC Security Systems",
    "url": "https://dailyhodl.com/2023/07/10/bank-for-international-settlements-says-defi-to-act-as-starting-point-for-cbdc-security-systems/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/Rally-for-One-DeFi.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/Rally-for-One-DeFi.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/Rally-for-One-DeFi.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/Rally-for-One-DeFi.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/Rally-for-One-DeFi.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/Rally-for-One-DeFi.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/Rally-for-One-DeFi.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The Bank for International Settlements (BIS) says that decentralized finance (DeFi) could help write the blueprints for the security of future central bank digital currencies (CBDCs). In a new report, the BIS says that CBDCs are now being built using the same technology that powers DeFi to detect what could possibly go wrong for a CBDC [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/10/bank-for-international-settlements-says-defi-to-act-as-starting-point-for-cbdc-security-systems/\">Bank for International Settlements Says DeFi To Act As Starting Point for CBDC Security Systems</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-10T19:55:02.000Z",
    "title": "‘Big Move is Coming’ – Crypto Analyst Reveals Forecast for Bitcoin As BTC Consolidates at $30,000",
    "url": "https://dailyhodl.com/2023/07/10/big-move-is-coming-crypto-analyst-reveals-forecast-for-bitcoin-as-btc-consolidates-at-30000/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/End-of-BTC-Bear.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/End-of-BTC-Bear.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/End-of-BTC-Bear.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/End-of-BTC-Bear.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/End-of-BTC-Bear.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/End-of-BTC-Bear.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/End-of-BTC-Bear.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst says that Bitcoin (BTC) is likely in the middle of a long consolidation process which will ultimately lead to a big move to the upside. Pseudonymous trader Altcoin Sherpa tells his 196,100 Twitter followers that it could be about eight months before the next Bitcoin bull run. &#8220;Wanted to take [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/10/big-move-is-coming-crypto-analyst-reveals-forecast-for-bitcoin-as-btc-consolidates-at-30000/\">‘Big Move is Coming’ – Crypto Analyst Reveals Forecast for Bitcoin As BTC Consolidates at $30,000</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]