[
  {
    "source": "Cointelegraph",
    "date": "2023-06-27T23:30:05.000Z",
    "title": "Bitcoin price surge will come from retail, not institutions: Fireblocks CEO",
    "url": "https://cointelegraph.com/news/bitcoin-btc-price-surge-driven-retail-fireblocks-ceo",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/f2847942-d2d8-4efa-b12d-07b3733261cf.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Michael Shaulov believes that while recent Bitcoin ETF filings could see new institutional money flow to Bitcoin, that in itself didn't drive previous price surges.</p>\n                    <p><p>While an approved BlackRock spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund (ETF) will funnel new institutional money to Bitcoin, it's going to be the retail investors that ultimately drive any significant price surges, according to Michael Shaulov, the CEO and co-founder of institutional custody platform Fireblocks.</p><p>On June 15, investment colossus <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-new-sec-filings-wisdomtree-invesco\">BlackRock filed for a spot Bitcoin </a>ETF, leading to other financial firms filing their own, along with Bitcoin's price reaching its highest levels in a year.</p><p>However, while many are hopeful that institutional involvement in crypto will further rocket prices, Shaulov notes that may not necessarily happen.</p><p>\"When institutions come in to participate in the market and they're doing it in a quiet way, they're able to do it almost without moving the price,\" Shaulov told Cointelegraph during the Australian Blockchain Week.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/9ef35607-c7c4-4c3e-8fba-9e39cc2bd2fa.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Michael Shaulov speaking to Cointelegraph Editor Felix Ng at Australian Blockchain Week. </em></figcaption></figure><p>According to Shaulov, mid-2020 was another time that saw \"massive inflows\" of institutional money, but prices didn’t really appreciate until retail investors <a href=\"https://cointelegraph.com/news/3-ways-this-bitcoin-bull-run-is-different-than-late-2020\">frenzied over crypto assets later</a> in the year.</p><blockquote>“Even though there were massive inflows, those institutions were sophisticated enough to acquire [BTC] slowly and use algorithms that won’t drive up the market.\"</blockquote><p>Instead, “50% increases [came] from retail […] because they’re participating in a way that’s less sophisticated and moves the price dramatically,\" he explained.</p><p>That being said, Shaulov noted that the “physics of Bitcoin” — mainly its finite supply — means that any mass buy-up of Bitcoin should end up moving the needle.</p><blockquote>“It’ll definitely be easier for some institutions that are currently not participating in the market to add Bitcoin to their allocation.”</blockquote><h3>Why Bitcoin?</h3><p>Interestingly, Shaulov — who founded Fireblocks in 2018, believes that the narrative over Bitcoin is still \"playing out\" for these institutions.</p><p> Shaulov said that today, there are numerous Bitcoin-based narratives still at play: Is it a hedge against inflation? Is it a public reserve currency? Is that a hedge against government financial misdealings?</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">You work for it.<br><br>They just print it and laugh about it.<br><br>Why would you be played like that?<a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> fixes this. <a href=\"https://t.co/omVxsB9zCV\">pic.twitter.com/omVxsB9zCV</a></p>&mdash; Daniel Prince (@PrinceySOV) <a href=\"https://twitter.com/PrinceySOV/status/1673417033944547328?ref_src=twsrc%5Etfw\">June 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Shaulov said that personally, he believes Bitcoin is the “ultimate insurance asset.” </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/fireblocks-vp-big-names-won-t-go-back-after-discovering-crypto-payments-potential\"><strong><em>Fireblocks VP: Big names won’t go back after discovering crypto payments’ potential</em></strong></a></p><p>“It has all it has the properties [of something] for when everything gets worse. It is an asset that is disconnected from the government. It's an asset that can be digitally native, it's an asset that can be moved easily.”</p><p>“It doesn't matter if at one point it’s worth $15,000, $20,000 or $60,000. You just need to have enough of it in that variance, in order to survive a period,” he said. </p><p><strong><em>Opinion: </em></strong><a href=\"https://cointelegraph.com/magazine/opinion-republican-crypto-maxis-democrat-anti-crypto-army-mchenry-warren/\"><strong><em>GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-06-27T23:11:00.000Z",
    "title": "Exploring the expansive ecosystem of EVM-compatible chains",
    "url": "https://crypto.news/exploring-the-expansive-ecosystem-of-evm-compatible-chains/",
    "description": "The rise of blockchain technology has transformed the way we approach transparency, security, and decentralization in digital interactions.  Yet, in this dynamic landscape, as the technology evolves, certain challenges have emerged, particularly in the context of the Ethereum (ETH) blockchain&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-27T23:30:28.000Z",
    "title": "Nevada FID Files Petition To Take Control Of Troubled Prime Trust",
    "url": "https://www.newsbtc.com/news/nevada-fid-files-petition-to-take-control-of-troubled-prime-trust/",
    "description": "The Nevada Department of Business and Industry&#8217;s Financial Institutions Division (FID) has taken action against Prime Trust, LLC. This US-based financial institution specializes in custody and settlement services for digital assets.  The FID has alleged that Prime Trust has violated Nevada regulations and has a shortfall in customer funds, which has deteriorated to a critically deficient level. As a result, the FID has filed a petition to place Prime Trust into receivership. This means that a court-appointed receiver will take control of the company&#8217;s assets and operations to protect the interests of creditors and other stakeholders. Prime Trust Accused Of Using Customer Assets To Buy Back Crypto The allegations against Prime Trust are significant, with the FID claiming that the firm lost access to legacy wallets in 2021 and used customer assets to buy back crypto.  Prime Trust reportedly owes its customers $85,670,000 in fiat currency but only has $2,904,000, while it owes $69,509,000 in digital currency but only has $68,648,000. The receivership of Prime Trust could potentially have significant implications for the firm&#8217;s customers. If the court grants the petition filed by the Nevada FID, a receiver will be appointed to take control of the firm&#8217;s assets and operations. Related Reading: PEPE Coin Shines Among Top Gainers, Tallies 78% In Last Week During the receivership, the receiver will manage and administer Prime Trust&#8217;s assets and liabilities. This could include selling off assets to pay off creditors, negotiating with customers to resolve outstanding issues, and taking other actions to wind down the firm&#8217;s operations. For customers of Prime Trust, the receivership could lead to delays and disruptions in accessing their accounts and assets held by the firm. The receiver may need to freeze or restrict customer accounts while they assess the firm&#8217;s financial position and develop a plan for winding down its operations. Customers who have assets held by Prime Trust may also face the risk of loss if the firm&#8217;s assets are insufficient to cover its liabilities. While the receiver will work to maximize the recovery of funds for creditors, the outcome of the receivership is uncertain, and customers may not receive the full value of their assets. The petition to place Prime Trust into receivership will be subject to a hearing, where the court will determine whether the firm should be placed into receivership and whether a receiver should be appointed.  The Majority Of Prime Trust&#8217;s Digital Currency Holdings Tied To AUDIO The news of Prime Trust&#8217;s receivership filing has sent shockwaves through the digital asset community, particularly for investors in AUDIO. According to Connor, Director at Coinbase, 88% of the digital currency held by Prime Trust is AUDIO, the native token of the Audius music streaming platform. This news could trouble AUDIO investors, as the receivership process could result in significant losses for those holding the token.  While the receiver will work to maximize the recovery of funds for creditors and stakeholders, the outcome is uncertain, and investors may not receive the full value of their AUDIO holdings. Related Reading: BLUR Up By 11% Following This Announcement The situation is especially concerning, given the recent volatility in the digital asset markets. AUDIO has experienced significant price swings over the past months, and investors may be hesitant to hold a token that is so heavily concentrated in the hands of a single custodian. At the time of writing, the value of AUDIO stands at $0.1853. This represents a 1.7% decrease in value over the last 24 hours. The token&#8217;s price has remained relatively stable following the news of Prime Trust&#8217;s receivership filing. Featured image from Unsplash, chart from TradingView.com "
  }
]