[
  {
    "source": "NewsBTC",
    "date": "2023-11-22T04:58:53.000Z",
    "title": "MATIC Price Prediction: Polygon Turned Sell On Rallies In Short-Term",
    "url": "https://www.newsbtc.com/analysis/matic-analysis/matic-price-prediction-polygon-down-0-728/",
    "description": "MATIC price is down over 10% after the SEC’s lawsuit against Kraken mentioned MATIC as security. Polygon is under pressure and might struggle to recover. MATIC price started a fresh decline from the $0.98 resistance against the US dollar. The price is trading below $0.80 and the 100 simple moving average (4 hours). There is a key bearish trend line forming with resistance near $0.788 on the 4-hour chart of the MATIC/USD pair (data source from Kraken). The pair could continue to decline if it stays below the $0.800 resistance zone. Polygon Price Takes Hit After a decent increase, Polygon’s price struggled to clear the $1.00 resistance. MATIC formed a high near $0.9829 and recently started a steady decline, underperforming Bitcoin and Ethereum. There was a drop below the $0.920 and $0.850 support levels. The bears even pushed the price below the $0.820 support and the 100 simple moving average (4 hours). Finally, it tested the $0.728 support. A low has formed near $0728 and the price is now consolidating losses. MATIC is trading below $0.80 and the 100 simple moving average (4 hours). There is also a key bearish trend line forming with resistance near $0.788 on the 4-hour chart of the MATIC/USD pair. Immediate resistance is near the $0.785 level or the trend line. It is near the 23.6% Fib retracement level of the recent decline from the $0.9829 swing high to the $0.7285 low. The first major resistance is near the $0.800 level. If there is an upside break above the $0.800 resistance level, the price could continue to rise. Source: MATICUSD on TradingView.com The next major resistance is near $0.855 or the 50% Fib retracement level of the recent decline from the $0.9829 swing high to the $0.7285 low. A clear move above the $0.855 resistance could start a steady increase. In the stated case, the price could even attempt a move toward the $0.920 level or $0.950. More Losses in MATIC? If MATIC’s price fails to rise above the $0.800 resistance level, it could continue to move down. Immediate support on the downside is near the $0.7285 level. The main support is near the $0.700 level. A downside break below the $0.700 level could open the doors for a fresh decline toward $0.650. The next major support is near the $0.618 level. Technical Indicators 4 hours MACD – The MACD for MATIC/USD is gaining momentum in the bearish zone. 4 hours RSI (Relative Strength Index) – The RSI for MATIC/USD is now below the 50 level. Major Support Levels – $0.728 and $0.700. Major Resistance Levels – $0.785, $0.800, and $0.855."
  }
]