[
  {
    "source": "Cointelegraph",
    "date": "2023-08-30T01:00:00.000Z",
    "title": "SEBA Bank secures in-principle nod for crypto services in Hong Kong",
    "url": "https://cointelegraph.com/news/seba-bank-hong-kong-crypto-licence-in-principle-approval",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/bdc9df13-6a61-4e7a-827c-183475a88fdb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>SEBA Hong Kong’s approval joins a flurry of regulated crypto activity that’s taken place over the past month.</p>\n                    <p><p>The Hong Kong arm of crypto-friendly Swiss bank SEBA Bank has received in-principle approval from the Hong Kong Securities and Futures Commission (SFC) allowing it to deal in virtual assets.</p><p>On Aug. 30, SEBA Hong Kong said its in-principle approved license would allow it to operate with crypto products such as over-the-counter derivatives, advise on virtual assets and conduct asset management for discretionary accounts in virtual assets.</p><p>Speaking to Cointelegraph the Asia-Pacific CEO of SEBA Hong Kong Amy Yu said Hong Kong provides enormous potential due to the SFC’s virtual asset <a href=\"https://cointelegraph.com/learn/an-overview-of-the-cryptocurrency-regulations-in-asia\">regulatory framework</a> and the city’s legal system.</p><p>Yu added while China has a crypto trading ban, Hong Kong is “well-positioned to tap into the Chinese market when it opens up” as its in a strategic location in being close to the mainland, while also being a Special Administrative Region of China.</p><blockquote>“Hong Kong may once again serve as a gateway to China, delivering the significant potential of cryptocurrencies and blockchain technology.”</blockquote><p>On its decision to pursue a local license, Yu said SEBA received inquiries from crypto companies who had “difficulty in accessing and managing their digital assets holdings via traditional providers” along with interest from private wealth and family offices.</p><p>In Switzerland, SEBA Bank offers both traditional banking and crypto services such as trading, staking, lending and custody.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/hong-kong-financial-secretary-bullish-web3-blockchain\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/hong-kong-financial-secretary-bullish-web3-blockchain/amp\"><strong><em>‘Breakthrough growth’ will be driven by Web3: Hong Kong financial secretary</em></strong></a></p><p>SEBA’s approval in principle comes amid a flurry of regulated crypto activity in Hong Kong.</p><p>Crypto exchange HashKey — the first exchange in Hong Kong to get regulatory clearance — was reported <a href=\"https://cointelegraph.com/news/bitcoin-ether-hashkey-start-bitcoin-and-ether-hong-kong-aug-28\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-ether-hashkey-start-bitcoin-and-ether-hong-kong-aug-28/amp\">to begin offering</a> retail trading in Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) on Aug. 28.</p><p>Its peer trading platform OSL also received the SFC’s approval to offer retail trading. HashKey and OSL are currently <a href=\"https://cointelegraph.com/news/crypto-hong-kong-debuts-retail-crypto-trading-with-hash-key-exchange\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-hong-kong-debuts-retail-crypto-trading-with-hash-key-exchange/amp\">the only two</a> fully licensed exchanges in Hong Kong.</p><p>That may soon change as on Aug. 11 the Hong Kong Virtual Asset Exchange (HKVAX) was <a href=\"https://cointelegraph.com/news/hong-kong-regulator-hkvax-in-principle-approval\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/hong-kong-regulator-hkvax-in-principle-approval/amp\">given in-principle approval</a> from the SFC to operate a crypto trading platform.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/chinas-risky-bitcoin-court-decision-is-huobi-in-trouble-or-not-asia-express/\"><strong><em>Asia Express: China’s risky Bitcoin court decision, is Huobi in trouble or not?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-30T00:56:37.000Z",
    "title": "Elon Musk’s X moves closer to crypto payments with new state license",
    "url": "https://cointelegraph.com/news/x-twitter-crypto-payments-rhode-island-licence",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/996a8121-f6f2-4a8c-acc1-1535d57da249.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Regulators from Rhode Island have approved X’s application for a currency transmitter license. </p>\n                    <p><p>Rhode Island’s regulators have granted X (Twitter) a currency transmitter license marking a step forward for the company’s foray into the financial services sector. </p><p>The license is legally required for companies conducting financial activities on behalf of users related to sending and receiving money — a definition that includes both fiat and crypto assets. The approval will allow for X to custody, transfer and exchange digital currencies.  </p><p>X’s Rhode Island Currency Transmitter License was approved on Aug. 28 <a href=\"https://www.nmlsconsumeraccess.org/EntityDetails.aspx/COMPANY/2404946\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to the Nationwide Multi-State Licensing System (NMLS).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/3e2a0651-24d3-4ad8-8863-aefab2fc239b.png\"  /><figcaption style=\"text-align: center;\"><em>X has a total of seven money and currency transmitter licenses. Source: NMLS</em></figcaption></figure><p>The move marks an important step forward in <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/elon-musk-and-crypto-twitter\">Elon Musk’s</a> push for X to become an “everything app” — which would include crypto and fiat payments.</p><p>While sources have suggested that X's upcoming payments feature will initially only offer support for fiat currencies, Musk has <a href=\"https://cointelegraph.com/news/elon-musk-wants-twitter-payments-system-built-with-crypto-in-mind\">reportedly instructed developers</a> at X to build the platform’s payments system in such a way that crypto functionality can be added in the future. </p><p>The approval comes <a href=\"https://cointelegraph.com/news/twitter-receives-money-transmitter-licenses-three-us-states\">nearly two months after X secured</a> money transmitter licenses in Michigan, Missouri and New Hampshire which were all approved on July 5. X’s latest license marks a total of seven American states it’s secured transmitter licenses in.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/elon-musk-endorses-pro-crypto-presidential-republican-candidate\"><strong><em>Elon Musk praises pro-crypto Republican presidential candidate</em></strong></a></p><p>It remains unclear exactly what financial offerings will be made available if and when X rolls out payment features.</p><p><a href=\"https://cointelegraph.com/news/elon-musk-wants-twitter-payments-system-built-with-crypto-in-mind\">People familiar with the company’s plans</a> have indicated X will initially offer fiat currency transaction services similar to PayPal — which Musk co-founded — with room for future crypto integration.</p><p><strong><em>Deposit risk: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-30T01:00:46.000Z",
    "title": "Navigating Bitcoin’s sideways trend with realized loss momentum",
    "url": "https://cryptoslate.com/navigating-bitcoins-sideways-trend-with-realized-loss-momentum/",
    "description": "<p>The crypto market witnessed a tumultuous sell-off, pushing Bitcoin&#8217;s price to $25,000. While the price has slightly recovered in the past week, stabilizing around $25,900 over the weekend, it remains in a precarious position. Several on-chain metrics suggest that Bitcoin might be trapped in a phase of sideways movement in the upcoming weeks. One such [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/navigating-bitcoins-sideways-trend-with-realized-loss-momentum/\">Navigating Bitcoin’s sideways trend with realized loss momentum</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  }
]