[
  {
    "source": "CryptoGlobe",
    "date": "2024-02-29T08:57:33.000Z",
    "title": "Rotation From Bitcoin and Ethereum Into Solana Is Next Hot Trade, Predicts CNBC’s Brian Kelly",
    "url": "https://www.cryptoglobe.com/latest/2024/02/rotation-from-bitcoin-and-ethereum-into-solana-is-next-hot-trade-predicts-cnbcs-brian-kelly/",
    "description": "Brian Kelly is a financial analyst and television personality known for his expertise in cryptocurrencies and blockchain technology. He is the founder and CEO of BKCM LLC, an investment firm focused on digital currencies. Kelly is also a frequent contributor to CNBC, where he provides analysis and commentary on financial markets, with a particular focus […]\n"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-29T09:08:36.000Z",
    "title": "Institutions choose ETH over BTC and SOL, GFOX also being considered",
    "url": "https://crypto.news/institutions-choose-eth-over-btc-and-sol-gfox-also-being-considered/",
    "description": "Institutions are opting for Ethereum over Solana and Bitcoin. Galaxy Fox, a meme coin, is also being explored"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-29T08:53:21.000Z",
    "title": "Kyrgyz crypto exchange Four Dragons reportedly suffers $100m hack",
    "url": "https://crypto.news/kyrgyz-crypto-exchange-four-dragons-reportedly-suffers-100m-hack/",
    "description": "Crypto exchange Four Dragons says it had suffered a breach of its security system, resulting in &#8216;significant funds being withdrawn.&#8217; Kyrgyzstan-based crypto exchange Four Dragons revealed on its website that it fell victim to a hacker attack on Feb. 22,&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-29T08:49:43.000Z",
    "title": "Solana holds $100 support as VeChain retraces; experts bullish on Rebel Satoshi",
    "url": "https://crypto.news/solana-holds-100-support-as-vechain-retraces-experts-bullish-on-rebel-satoshi/",
    "description": "Solana and VeChain investors are actively looking at the Rebel Satoshi presale"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-29T08:49:35.000Z",
    "title": "SEC reveals Terraform Labs’ ‘suspicious’ $166m payment",
    "url": "https://crypto.news/sec-reveals-terraform-labs-suspicious-166m-payment/",
    "description": "The U.S. Securities and Exchange Commission (SEC) revealed suspicious movements of Terraform Labs&#8217; funds. According to Reuters, the SEC discovered a payment of $166 million to the company&#8217;s lawyers from Terraform Labs. The exact date of the regulator&#8217;s statement is&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-29T08:46:29.000Z",
    "title": "HSBC Hong Kong to allow investments into virtual assets in 2024",
    "url": "https://crypto.news/hsbc-hong-kong-to-allow-investments-into-virtual-assets-in-2024/",
    "description": "HSBC&#8217;s Hong Kong investments head, Sami Abouzahr, says asset tokenization is one of the top priorities for the bank for this year. HSBC Hong Kong is set to double down on asset tokenization as part of the bank&#8217;s development strategy&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-29T08:43:53.000Z",
    "title": "Shido token dives over 90% after Ethereum staking contract exploit",
    "url": "https://crypto.news/shido-token-dives-over-90-after-ethereum-staking-contract-exploit/",
    "description": "A security breach on the layer-1 blockchain Shido has led to a dramatic drop in its token value, plunging by over 90% within a mere half-hour period. The incident occurred after an exploit was detected, with blockchain security firm PeckShield&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-29T09:00:41.000Z",
    "title": "Where Are We In This Bitcoin Cycle? Galaxy Lead Researcher Answers",
    "url": "https://www.newsbtc.com/news/bitcoin/where-are-we-in-this-bitcoin-cycle/",
    "description": "In a comprehensive analysis shared via X (formerly Twitter), Alex Thorn, the Head of Firmwide Research at Galaxy, delved into the intricacies of the current Bitcoin market cycle, answering the question &#8220;Where Are We In This Bitcoin Cycle?&#8221; As Bitcoin trades robustly around $62,000, with a notable spike to $64.000 yesterday, the crypto landscape is witnessing unprecedented dynamics, marked by a surge in ETF inflows, strategic acquisitions by corporate entities, and a palpable shift in investor sentiment towards digital assets. Thorn emphasized how different this cycle is: Effectively, the bull runs of 2017 and 2020 hadn’t yet begun at this stage in Bitcoin’s supply schedule. 52 days before 2nd Halving (9-JUL-16) BTCUSD $455.22 (-59.86% from ATH) 52 days before 3rd Halving (11-MAY-20) BTCUSD $6,174 (-68.56% from ATH) 52 days before 4th Halving (20-APR-24) BTCUSD $59,330 (-12.16% from ATH) Why This Bitcoin Cycle Is Different Central to his analysis is the record-breaking influx of capital into spot Bitcoin ETFs, with Thorn highlighting, &#8220;The BTC ETFs took in a whopping net $576m of BTC yesterday (Tuesday Feb. 27), with BlackRock alone seeing $520m of inflows, its largest ever day.&#8221; This significant movement of funds not only underscores the growing institutional interest in Bitcoin but also marks a pivotal moment in the cryptocurrency&#8217;s journey towards mainstream financial recognition. Related Reading: Analyst Labels Bitcoin Rally Strongest Pre-Bull Cycle Yet A key aspect of Thorn&#8217;s analysis is the unwavering strength of Bitcoin&#8217;s long-term holder base, which he estimates to hold about 75% of the total BTC supply. &#8220;Long-term holders are still mostly holding strong,&#8221; Thorn notes, emphasizing the community&#8217;s resilience and faith in Bitcoin&#8217;s long-term value proposition. This demographic, characterized by their &#8216;diamond hands&#8217;, plays a crucial role in stabilizing the market and buffering against the volatility that often defines the crypto space. Thorn further elaborates on the analytical tools and metrics that provide insight into Bitcoin&#8217;s market behavior. He introduces the MVRV Z-Score, a novel approach to understanding the cyclicality of Bitcoin&#8217;s price action by comparing its market value to its realized value. This metric offers a window into the perceived overvaluation or undervaluation of Bitcoin at any given point. Currently, the MVRV Z-Score is close to 2, while previous cycle tops saw the metric spike to 8 (in 2021) or even above 12 (in prior halving cycles). Addressing the speculation around the acceleration of the Bitcoin cycle, Thorn firmly dispels concerns that the market is prematurely peaking. He argues against the notion that we are &#8220;speedrunning the &#8216;cycle'&#8221;, instead asserting that the advent of Bitcoin ETFs in the United States represents a transformative shift with far-reaching implications. &#8220;This time is different,&#8221; Thorn asserts, pointing to the ETFs&#8217; disruption of traditional Bitcoin price cycles and their impact on investor behavior and intra-crypto dynamics. The Spot Bitcoin ETF Effect Thorn underscored the transformative impact of Bitcoin ETFs, positing that we are merely at the beginning of a significant shift in how Bitcoin is accessed and invested in, particularly by the institutional sector. &#8220;Despite incredible volumes and flows, there’s plenty of reason to believe that the Bitcoin ETF story is still just getting started,&#8221; he stated, pointing to the untapped potential within the wealth management sector. In their October 2023 report titled “Sizing the Market for the Bitcoin ETF,” Galaxy laid out a compelling case for the future growth of Bitcoin ETFs. The report highlights that wealth managers and financial advisors represent the primary net new accessible market for these vehicles, offering a previously unavailable avenue for allocating client capital to BTC exposure. The magnitude of this untapped market is substantial. According to Galaxy&#8217;s research, there is approximately $40 trillion of assets under management (AUM) across banks and broker/dealers that has yet to activate access to spot BTC ETFs. This includes $27.1 trillion managed by broker-dealers, $11.9 trillion by banks, and $9.3 trillion by registered investment advisors, cumulating to a total US Wealth Management AUM of $48.3 trillion as of October 2023. This data underscores the vast potential for Bitcoin ETFs to penetrate deeper into the financial ecosystem, catalyzing a new wave of investment flows into Bitcoin. Related Reading: Expert Predicts Bitcoin At $750,000 As Fidelity Advises 1-3% Allocation Thorn further speculated on the upcoming April round of post-ETF-launch 13F filings, suggesting that these filings might reveal significant Bitcoin allocations by some of the largest names in the investment world. &#8220;In April, we will also get the first round of post-ETF-launch 13F filings, and (I’m just guessing here…) we are likely to see some huge names have allocated to Bitcoin,&#8221; Thorn anticipated. This development, he argues, could create a feedback loop where new platforms and investments drive higher prices, which in turn attracts more investment. The implications of this feedback loop are profound. As more wealth management platforms begin to offer access to Bitcoin ETFs, the influx of new capital could significantly impact BTC&#8217;s price dynamics, liquidity, and overall market structure. This transition represents a key moment in the maturation of Bitcoin as an asset class, moving from a speculative investment to a staple in diversified portfolios managed by financial advisors and wealth managers. We Are Still Early Thorn&#8217;s optimism extends beyond the immediate market indicators to the broader implications of Bitcoin&#8217;s integration into the financial mainstream. He anticipates a new all-time high for Bitcoin in the near term, fueled by a combination of factors including the ETFs&#8217; momentum, increasing acceptance of BTC as a legitimate asset class, and the anticipatory buzz surrounding the upcoming halving event. &#8220;All this is to say, my answer to that burning question – where are we in the cycle? – is that we haven’t even begun to reach the heights this is likely to go,&#8221; he concludes. Thorn&#8217;s analysis culminates in a bullish forecast for Bitcoin. As the community stands on the cusp of the fourth BTC halving, Thorn&#8217;s insights offer a compelling vision of a market poised for unprecedented growth, driven by a confluence of technological innovation, regulatory evolution, and shifting global economic currents. &#8220;Bitcoin is prime time now, and while it might be hard to believe, things are just starting to get exciting,&#8221; Thorn declares, capturing the essence of a market at the threshold of a new era. At press time, BTC traded at $62,065. Featured image created with DALL·E, chart from TradingView.com"
  }
]