[
  {
    "source": "Cointelegraph",
    "date": "2023-09-27T01:49:21.000Z",
    "title": "Sam Bankman-Fried's political donations can be surfaced in trial, rules judge",
    "url": "https://cointelegraph.com/news/sam-bankman-fried-political-donations-allowed-upcoming-trial",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/f384c110-de39-481e-a823-3c864f4c03b8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Despite campaign finance charges being dropped in July, the prosecution has been granted permission to present evidence of Bankman-Fried’s political donations in his upcoming fraud trial.</p>\n                    <p><p>Prosecutors from the United States Department of Justice will be allowed to surface the details of Sam Bankman-Fried’s political donations as the evidence is directly relevant to his fraud charges, ruled U.S. District Judge Lewis Kaplan.</p><p>The decision was part of a series of rulings made by Kaplan in a 16-page pretrial <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590939/gov.uscourts.nysd.590939.289.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">order</a> on Sept. 26, where he cleared up which evidence would be admissible in court during the FTX founders’ fraud trial, currently scheduled to begin on Oct. 3. </p><p>Federal prosecutors <a href=\"https://cointelegraph.com/news/sbf-prosecutors-reportedly-dig-into-donations-made-to-top-us-democrats\">initially charged Bankman-Fried with conspiring</a> to break United States campaign finance laws, as well as seven other fraud and conspiracy charges — however, later dropped the charges as part of an extradition agreement with the Bahamas. </p><blockquote>\"Evidence that the defendant spent FTX customer funds on political contributions is direct evidence of the wire fraud scheme because it is relevant to establishing the defendant's motive and allegedly fraudulent intent.”</blockquote><p>In addition to allowing discussion of Bankman-Fried’s campaign donations, Kaplan also approved the prosecution’s motion to bring forward evidence that details Bankman-Fried’s alleged role in the creation of the FTX Token (<a href=\"https://cointelegraph.com/ftx-token-ftt-price-index\">FTT</a>), and the ways in which he allegedly directed Alameda Research and its then-CEO Caroline Ellison to manipulate the price of the token. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/8112947c-e9ff-47f7-8634-d52895c072a0.png\"  /><figcaption style=\"text-align: center;\"><em>Judge Kaplan’s ruling on Bankman-Fried’s political donation evidence. Source: CourtListener</em></figcaption></figure><p>\"The alleged manipulation of the cryptocurrency tokens, which resulted in an alleged manipulation of Alameda’s balance sheet, was an act 'done in furtherance of the alleged conspiracy' and therefore is considered 'part of the very act charged,’” wrote Kaplan.</p><p>“Moreover, defendant’s alleged directive to Ms. Ellison to manipulate the price of FTT is direct evidence of their “relationship of mutual trust.” The probative value of this evidence outweighs any risk of unfair prejudice. It is admissible,” Kaplan concluded. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-frieds-lawyer-renews-request-for-temporary-release-from-jail\"><strong><em>Sam Bankman-Fried’s lawyer renews request for temporary release from jail</em></strong></a></p><p>While Kaplan approved many submissions of evidence for the DOJ, he also approved Bankman-Fried’s lawyers to question government witnesses about their recreational drug use, as long as they provided prior notice to the court. </p><p>Government witnesses include Caroline Ellison, former FTX engineer Nishad Singh and FTX co-founder Gary Wang.</p><p>Kaplan also denied the DoJ's motions to block the defense from cross-examining witnesses on certain “privileged” issues. Additionally, he ruled that Bankman-Fried would not be able to discuss any details of his pre-trial detention, family background, wealth, or age before a jury. </p><p><strong><em>Big Questions: </em></strong><a href=\"https://cointelegraph.com/magazine/big-questions-crypto-deaths/\"><strong><em>What’s with all the crypto deaths? </em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-27T02:00:50.000Z",
    "title": "Mastermind Behind Massive Crypto Ponzi Scheme AirBit Club Receives 12-Year Prison Sentence",
    "url": "https://www.newsbtc.com/news/mastermind-behind-massive-crypto-ponzi-scheme-airbit-club-receives-12-year-prison-sentence/",
    "description": "In a landmark verdict, Pablo Renato Rodriguez, the co-founder of AirBit Club, has been sentenced to 12 years in prison by US District Judge George B. Daniels.  According to the US Department of Justice (DOJ), Rodriguez, along with his co-conspirators, masterminded a sprawling global pyramid scheme that defrauded investors of millions of dollars through false promises of cryptocurrency trading and mining profits. Related Reading: XRP Ledger Developer Xumm Reveals “Infrastructure Overhaul,” More Than An Upgrade? AirBit Co-Founder Convicted For $100 Million Crypto Fraud Per the DOJ’s investigations, the elaborate scheme involved luring unsuspecting and often inexperienced investors into purchasing AirBit Club memberships with the guarantee of substantial returns.  However, instead of engaging in legitimate cryptocurrency activities, Rodriguez and his cohorts allegedly diverted the funds for personal gain while employing an intricate money laundering operation to conceal their ill-gotten profits. Rodriguez&#8217;s co-defendants, Gutemberg Dos Santos, Scott Hughes, Cecilia Millan, and Karina Chairez, have already pleaded guilty and await sentencing. The court has also ordered the forfeiture of the fraudulent proceeds, which include a staggering $100 million worth of assets, such as US currency, Bitcoin (BTC), and real estate. Describing Rodriguez&#8217;s actions as a flagrant exploitation of cryptocurrency for fraudulent purposes, US Attorney Damian Williams emphasized the importance of this case in deterring potential fraudsters from making false promises of lucrative cryptocurrency investments. Troubling Pattern Of Fraudulent Ventures According to court documents, Rodriguez and Dos Santos founded AirBit Club in 2015 and “aggressively” marketed it as a multilevel marketing club operating in the cryptocurrency industry.  The duo reportedly organized extravagant expos and presentations worldwide, enticing victims to invest in cash and providing them access to an online portal showcasing false investment returns.  As early as 2016, victims who attempted to withdraw funds encountered excuses, delays, and exorbitant hidden fees. The scheme&#8217;s architects, including Rodriguez, spent the defrauded money on luxury items, financed more expos to attract additional victims, and siphoned funds through a network of domestic and foreign bank accounts.  Related Reading: Bitcoin Spot Trading Volume Hit Six-Year Low – Is Investor Confidence Rising? According to the DOJ, Rodriguez&#8217;s attorney trust account, managed by Scott Hughes, played a crucial role in concealing the illicit proceeds of the AirBit Club scheme. Before AirBit Club, Rodriguez and Dos Santos were involved in another pyramid investment scheme called Vizinova, which led to a legal battle with the US Securities and Exchange Commission (SEC).  Hughes, an attorney representing Rodriguez and Dos Santos in the Vizinova case, later assisted them in perpetrating the AirBit Club fraud by removing negative information about both schemes from the internet. With Rodriguez&#8217;s sentencing, justice has been served to one of the key figures responsible for defrauding countless victims through AirBit Club. Featured image from Shutterstock, chart from TradingView.com "
  }
]