[
  {
    "source": "CoinDesk",
    "date": "2023-07-03T12:27:28.000Z",
    "title": "First Mover Americas: Traders Place Big Bets on Ether for Second Half of 2023 ",
    "url": "https://www.coindesk.com/markets/2023/07/03/first-mover-americas-fidelity-joins-the-rush-for-spot-bitcoin-etf/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for July 3, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-03T12:22:20.000Z",
    "title": "Singapore to require crypto firms to put user assets into trusts by year-end",
    "url": "https://cointelegraph.com/news/singapore-to-require-crypto-firms-to-put-user-assets-into-trusts-by-year-end",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/6581b428-cb9b-4d6e-9d00-c0481acb7239.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>MAS is also working to restrict crypto service providers from facilitating lending or staking for retail customers, but not for institutional ones.</p>\n                    <p><p>Singapore’s central bank is introducing new measures to improve investor protection and market integrity in the cryptocurrency industry.</p><p>On July 3, the Monetary Authority of Singapore (MAS) <a href=\"https://www.mas.gov.sg/news/media-releases/2023/mas-publishes-investor-protection-measures-for-digital-payment-token-services\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> new requirements for crypto service providers to hold customer assets into a statutory trust by year-end.</p><p>“This will mitigate the risk of loss or misuse of customers’ assets, and facilitate the recovery of customers’ assets in the event of a DPT service provider’s insolvency,” the regulator said.</p><p>The new custody measures follow a public consultation on regulatory measures to reduce risks to consumers from crypto trading which was <a href=\"https://www.mas.gov.sg/news/media-releases/2022/mas-proposes-measures-to-reduce-risks-to-consumers-from-cryptocurrency-trading-and-enhance-standards-of-stablecoin-related-activities\" target=\"_blank\" rel=\"noopener nofollow\">launched</a> in October 2022. According to the MAS, the consultation received “significant interest” from a wide range of respondents.</p><p>In the official response to the public consultation, Singapore’s central bank <a href=\"https://www.mas.gov.sg/-/media/mas/news-and-publications/consultation-papers/2022-proposed-regulatory-measures-for-dpt-services/response-to-public-consultation-on-proposed-regulatory-measures-for-dpt-services-part-1.pdf\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> that the majority of respondents agreed that digital payment token service providers (DPTSPs) should be allowed to deposit user assets in the same trust account as the assets of its other users.</p><p>“However, a few respondents disagreed, suggesting that DPTSPs should be required to segregate each customer’s assets from other customers’ assets in separate blockchain addresses,” the MAS wrote. According to the respondents, individual custody segregation could provide customers with greater transparency by allowing them to identify and verify their own holdings.</p><p>Apart from custody requirements, the MAS also required crypto companies to conduct daily reconciliation of customer assets and keep proper books and records. DPTSPs are also required to maintain access and operational controls to customers’ DPTs in Singapore and ensure that the custody function is operationally independent from other business units.</p><p>Additionally, the regulator is also working on a proposal to restrict crypto service providers from facilitating lending or staking of their retail customers’ DPTs. For institutional and accredited investors, however, DPT providers may continue to facilitate such activities.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/three-arrows-liquidators-recoup-losses-from-founders\"><strong><em>3AC liquidators look to recoup $1.3B from founders</em></strong></a></p><p>The MAS added that some respondents suggested allowing crypto firms to offer lending and staking with the condition of retail customer’s consent and risk disclosures. “Others advocated a ban on these high risk and speculative activities,” the regulator noted, adding:</p><blockquote>“MAS will monitor market developments and consumer risk awareness as these evolve, and will take steps to ensure that our measures remain balanced and appropriate.”</blockquote><p>The latest investor protection-related regulatory developments in Singapore aim to address <a href=\"https://cointelegraph.com/news/ftx-collapse-drives-curiosity-around-sam-bankman-fried-google-data-shows\">industry implosions like FTX</a>, which led to customers losing millions of dollars. Additionally, the crypto lending crisis in 2022 significantly impacted firms in Singapore, with major local firms like Three Arrows Capital and Hodlnaut <a href=\"https://cointelegraph.com/news/3ac-a-10b-hedge-fund-gone-bust-with-founders-on-the-run\">going bankrupt amid the bear market</a>.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\"><strong><em>How smart people invest in dumb memecoins — 3-point plan for success</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-03T12:10:13.000Z",
    "title": "Solana Labs Co-Founder Explores Ethereum as a Layer 2 Solution for Solana",
    "url": "https://www.cryptoglobe.com/latest/2023/07/solana-labs-co-founder-explores-ethereum-as-a-layer-2-solution-for-solana/",
    "description": "On 2 July 203, Anatoly Yakovenko, the co-founder of Solana Labs, delved into the intriguing possibility of Ethereum functioning as a Layer 2 (L2) solution for Solana. Layer 2 solutions are bridge protocols that provide one-way security, and Yakovenko believes that Ethereum could potentially offer this for Solana. Yakovenko outlined — via a series of […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T12:28:17.000Z",
    "title": "Solana, co-founder, explores Ethereum’s potential as layer-2 solution for SOL",
    "url": "https://www.cryptopolitan.com/solana-co-founder-explores-ethereums-potential-as-layer-2-solution-for-sol/",
    "description": "Solana Labs&#8217; co-founder, Anatoly Yakovenko, recently sparked discussions with his intriguing proposal about Ethereum&#8217;s potential as a layer-2 (L2) solution for the Solana blockchain. This amalgamation of two prominent platforms brings forth a range of advantages and disadvantages, captivating the attention of experts and enthusiasts. In this article, we delve into Yakovenko&#8217;s ideas and explore ... <a title=\"Solana, co-founder, explores Ethereum&#8217;s potential as layer-2 solution for SOL\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-co-founder-explores-ethereums-potential-as-layer-2-solution-for-sol/\" aria-label=\"More on Solana, co-founder, explores Ethereum&#8217;s potential as layer-2 solution for SOL\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T12:17:16.000Z",
    "title": "Golteum: The Ultimate Choice for Unrivaled Transparency and Security",
    "url": "https://www.cryptopolitan.com/golteum-the-ultimate-choice-for-unrivaled-transparency-and-security/",
    "description": "In the ever-changing world of decentralized finance (DeFi), new platforms are constantly emerging, offering unique value propositions and transforming the way we trade and invest. While tokens like Polygon and Bitcoin Cash have made significant contributions to the crypto world, Golteum is the undisputed choice for investors looking for a cutting-edge multi-asset Web3 platform.&#160; Golteum&#8217;s ... <a title=\"Golteum: The Ultimate Choice for Unrivaled Transparency and Security\" class=\"read-more\" href=\"https://www.cryptopolitan.com/golteum-the-ultimate-choice-for-unrivaled-transparency-and-security/\" aria-label=\"More on Golteum: The Ultimate Choice for Unrivaled Transparency and Security\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-03T12:34:20.000Z",
    "title": "Golteum (GLTM) Token Presale Captures Attention of Hedera (HBAR) and Shiba Inu (SHIB) Investors",
    "url": "https://nulltx.com/golteum-gltm-token-presale-captures-attention-of-hedera-hbar-and-shiba-inu-shib-investors/",
    "description": "As the cryptocurrency market gets more and more competitive, investors are always on alert, searching for the next big life-changing opportunity. The crypto world also does not fall short in this regard. Every day, newer projects surface offering greater sustainability and innovation. One of such is Golteum (GLTM). Golteum has rapidly gained a good reputation [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-03T12:28:26.000Z",
    "title": "Tradecurve Amazes Investors With 80% ROI, Can Hedera Keep Up?",
    "url": "https://nulltx.com/tradecurve-amazes-investors-with-80-roi-can-hedera-keep-up/",
    "description": "The cryptocurrency industry is renowned for its unpredictability and volatility. In recent movements, while Hedera has been showing negative indicators, Tradecurve has astonished investors with an impressive 80% gains. We will explore the factors contributing to Hedera&#8217;s negative performance and the reasons behind Tradecurve&#8217;s remarkable success. &#62;&#62;BUY TCRV TOKENS NOW&#60;&#60; Summary: Hedera shows red charts [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-03T12:16:56.000Z",
    "title": "Rise of the Phoenix: TMS Network (TMSN) Reborn from Ashes of Stellar (XLM) and Solana (SOL)",
    "url": "https://nulltx.com/rise-of-the-phoenix-tms-network-tmsn-reborn-from-ashes-of-stellar-xlm-and-solana-sol/",
    "description": "One of the most prominent fintech innovations of the twenty-first century is Blockchain technology. With innovations now and then, newer tokens like TMS Network (TMSN) have steered ahead of competitors like Stellar (XLM) and Solana (SOL) with an impressive 3,900 jump even before its 4th presale stage is over! Here’s how TMS Network (TMSN) compares [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-03T12:30:27.000Z",
    "title": "Bitcoin Sharks & Whales Show Strong Buying, Rally To Continue In July?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-sharks-whales-strong-buying-rally-continue-july/",
    "description": "On-chain data shows that Bitcoin sharks and whales have continued to accumulate recently, something that could help the rally go parabolic this month. Bitcoin Sharks &#38; Whales Have Continued To Add To Their Holdings According to data from the on-chain analytics firm Santiment, BTC sharks and whales have participated in further buying during the past two weeks. The relevant indicator here is the &#8220;Supply Distribution,&#8221; which tells us about the total amount of Bitcoin that each address group is holding in the market right now. The addresses are divided into these address groups based on the total number of coins they are carrying in their balances right now. The 1-10 coins group, for instance, includes all investors holding between 1 and 10 BTC currently. In the context of the current discussion, the cohorts of interest are the &#8220;sharks&#8221; and &#8220;whales.&#8221; These are investors who generally hold sizeable sums in their wallets, and their combined coin range may be defined as 10-10,000 coins. Due to the high amounts that these holders may carry in their wallets, they can have some influence on the market. Naturally, as the whales are the larger of the two groups, they carry significantly more power in the sector. As the movements of these holders can cause noticeable effects on the market, it can be worth keeping an eye on their behaviors. The Supply Distribution of this coin range can provide hints related to exactly that. Now, here is a chart that shows how the supply of these investors has changed during the last few months: The value of the metric seems to have been going up in recent days &#124; Source: Santiment on Twitter As displayed in the above graph, the Bitcoin Supply Distribution for the 10-10,000 coins group had seen some decline earlier in the year but had bottomed out in the middle of April. Around the same time as the whales finishing up their selling, the asset&#8217;s price had hit a local top and had observed a drop over the next couple of months. While this decline had taken place, though, these sharks and whales had started growing their holdings once again, suggesting that they had been buying the dips. Related Reading: Institutional Investors Flock To Bitcoin: Are We Witnessing A Paradigm Shift? Later on, when the cryptocurrency had failed to show any signs of a resurgence, the supply of these investors had hit a standstill, implying that these investors had become hesitant to buy more. Following the bottom in June, however, and the subsequent emergence of news related to new ETF launches, these sharks and whales began to show some strong accumulation. In the past seven weeks, these investors have loaded up 154,500 BTC, a good chunk of which has come during the past couple of weeks alone. The indicator&#8217;s value has now reached 13 million BTC, implying that the Bitcoin sharks and whales now hold 67% of the total circulating supply. Related Reading: Bitcoin Price Holds Strong As The Bulls Aim New High Above $32K These humongous investors continuing to show strong overall accumulation through this new leg of the rally can be a positive sign for things to come this month. BTC Price At the time of writing, Bitcoin is trading around $30,600, up 1% in the last week. Looks like the asset has been mostly moving sideways in the last few days &#124; Source: BTCUSD on TradingView Featured image from Sebastian Pena Lambarri on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-03T12:19:59.000Z",
    "title": "Why This Is the Last Chance to Enter the Crypto Rally?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/why-this-is-the-last-chance-to-enter-the-crypto-rally/",
    "description": "<p>US-SEC regulation scenario, the big funds filling ETFs, the Riiple-SEC lawsuit, and the beginning of the bull run. These are very important topics that are coming to an end or important phases.  Let&#8217;s discover how these topics are probably creating the last chance to be part of the crypto rally to buy cryptos at a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/why-this-is-the-last-chance-to-enter-the-crypto-rally/\">Why This Is the Last Chance to Enter the Crypto Rally?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-03T12:37:52.000Z",
    "title": "Crypto Analyst Names Altcoins to Buy With High Growth Potential",
    "url": "https://coinedition.com/crypto-analyst-names-altcoins-to-buy-with-high-growth-potential/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Crypto-Trader-Named-The-5-Altcoins.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Altcoins In The Red As Market Tries To Recover From FTX Drama\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Crypto-Trader-Named-The-5-Altcoins.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Crypto-Trader-Named-The-5-Altcoins-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Crypto-Trader-Named-The-5-Altcoins-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Crypto-Trader-Named-The-5-Altcoins-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Crypto-Trader-Named-The-5-Altcoins-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto analyst Tom who hosts the crypto YouTube channel, Cryptobusy, has highlighted Internet Computer token (ICP), Conflux (CFX), Cardano (ADA), and Polygon (MATIC) as the crypto tokens to buy in July 2023. In a video uploaded on YouTube, Tom explained his reasons for choosing these coins for potential gains. Internet Computer Protocol (ICP) The ICP [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-analyst-names-altcoins-to-buy-with-high-growth-potential/\">Crypto Analyst Names Altcoins to Buy With High Growth Potential</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-07-03T12:30:15.000Z",
    "title": "Bitfinex Alpha | Bitcoin Bulls and Bears Fight It Out as Economic Outlook Looks Complex",
    "url": "https://blog.bitfinex.com/bitfinex-alpha/bitfinex-alpha-bitcoin-bulls-and-bears-fight-it-out-as-economic-outlook-looks-complex/",
    "description": "<p>The economy remains resilient, which means rates will continue to rise In an intriguing turn of events, the US manufacturing sector is charting a rebound, reporting surging orders driven by strong demand for transportation equipment. Great news for the economy! But is it? The longer-term...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/bitfinex-alpha/bitfinex-alpha-bitcoin-bulls-and-bears-fight-it-out-as-economic-outlook-looks-complex/\">Bitfinex Alpha | Bitcoin Bulls and Bears Fight It Out as Economic Outlook Looks Complex</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]