[
  {
    "source": "Cointelegraph",
    "date": "2023-09-12T18:00:00.000Z",
    "title": "NYU law professors argue ‘personal growth bets’ using smart contracts should be legal",
    "url": "https://cointelegraph.com/news/nyu-law-professors-argue-blockchain-personal-growth-bets-smart-contracts-legal",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/b7cef3fb-8f16-4036-94a1-d5e93826da35.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The duo’s paper says self-contracts can help you quit smoking or lose weight, but incentives such as putting a bomb in your skull would surely test the limits of the law.</p>\n                    <p><p>New York University School of Law professors Max Raskin and Jack Millman recently published a paper in the Journal on Emerging Technologies discussing the legalities surrounding the use of blockchain-based smart contracts for the purpose of ‘personal growth bets.’ </p><p>According to the duo, personal growth bets are single-party contracts that a person would engage in with themselves. The purpose of these contracts would generally be for the purpose of self improvement — to either start or stop a certain act during a given period of time or by a certain date. </p><p>The researchers use the notions of quitting smoking or losing weight to <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4562481\" target=\"_blank\" rel=\"noopener nofollow\">describe</a> the concept. Per their paper:</p><blockquote>“For example, a rough outline of such a bet would be: if Max does not lose 10 pounds over the next six months, he must pay Jack $1,000. Whereas, if he does lose the weight, Jack must buy Max a steak dinner.”</blockquote><p>The core argument of the paper, according to the researchers, is that incentives can have a positive impact on a person’s ability to succeed at difficult personal undertakings. However, without accountability, such incentives are less likely to work. </p><p>“Smart contracts can,” according to the authors, “serve the roles of enforcer and monitor, allowing an aspirant to effectively bind his future self without the need to involve another person.”</p><p>Raskin and Millman propose a scheme where a smart contract is conceived on the blockchain using “contractware,” hardware used to measure or monitor the conditions of the bet, to enforce compliance with the contract’s terms. </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/TzdgwHX2xTs\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>In the case of quitting smoking, the researchers give the example of a person who places $10,000 in a smart contract that requires them to remain smoke free for 30 days in order to reobtain the funds. In the event of failure, the funds could, for example, be sent to a predefined charity of the user’s choice.</p><p>In order to enforce the terms of the “bet,” the researchers envision a system wherein a user would confirm compliance through the use of a carbon monoxide breathalyzer — a gadget that can detect cigarette smoke on breath in much the same way as an alcohol breathalyzer determines blood alcohol level. </p><p>If the user missed a designated check-in or failed a breathalyzer test, the terms of the smart contract would execute autonomously and, thus, the user’s stake would be forfeit. </p><p>While the concept is relatively straightforward, the legalities surrounding self-contracts and their enforceability are somewhat nebulous. The researchers claim there should be no legal impedance preventing someone from tying up their own financial resources in a scheme to bet on oneself and, provided the terms are given legal “consideration,” such a contract should ostensibly be legally binding. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/eu-data-act-smart-contract-kill-switch-brings-uncertainty\"><strong><em>EU Data Act smart contract ‘kill switch’ brings uncertainty</em></strong></a></p><p>“There is no law against an individual giving his money away,” write the researchers. However, they go on to point out that there should be limits to what one can use as a stake, especially when considering the autonomous nature of smart contracts.</p><p>The paper also considers the hypothetical case of an investor “willing to install a bomb in his skull” in order to demonstrate their willingness to pay back a loan “such that it would explode if he missed a payment or tried to remove it.”</p><p>According to the research, this would be deemed a form of “strong” smart contract — as its terms contain an “infinitely high cost of revocation to the debtor.” However the paper also indicates such a contract “likely” wouldn’t be legal as a self-contract due to the “many laws against suicide and promoting suicide.”</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-12T17:49:35.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Franklin Templeton has become the latest financial institution to file for a spot Bitcoin exchange-traded fund (ETF). Former Celsius CEO Alex Mashinsky, currently on bail facing multiple charges of criminal fraud and market manipulation, has filed a motion seeking the dismissal of the FTC case against him. Meanwhile, Ethereum co-founder Vitalik Buterin has confirmed the hacking of his X (Twitter) account over the weekend was caused by a \"SIM-swap attack,\" a technique used by hackers to gain control of a victim’s mobile phone number.</p><h3>Franklin Templeton joins Bitcoin ETF race</h3><p>Multi-trillion-dollar asset manager Franklin Templeton has <a href=\"https://cointelegraph.com/news/franklin-templeton-files-bitcoin-spot-etf\">filed for a spot Bitcoin ETF</a>, upping the ante on the Securities and Exchange Commission (SEC) to finally approve a spot BTC product. </p><p>The S-1 registration was officially filed on Sept. 12 and came mere weeks after the SEC <a href=\"https://cointelegraph.com/news/sec-delays-decision-on-wisdomtree-s-spot-bitcoin-etf\">delayed its ruling</a> on several filings from BlackRock, WisdomTree, Fidelity, VanEck and Bitwise.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcoin</a> Spot ETF applications:<br>- BlackRock ($10T AUM)<br>- Fidelity ($4.5T)<br>- Franklin Templeton ($1.5T)<br>- Invesco Galaxy ($1.5T)<br>- WisdomTree ($87B)<br>- VanEck ($61B)<br>- GlobalX ($40B)<br>- ARK Invest ($14B)<br>- Bitwise ($1B)<br>- Valkyrie ($1B)<br><br>Total: $17.7T<br><br>Probably nothing…</p>&mdash; Bitcoin for Freedom (@BTC_for_Freedom) <a href=\"https://twitter.com/BTC_for_Freedom/status/1701605941450510762?ref_src=twsrc%5Etfw\">September 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to the application, Franklin Templeton would structure the fund as a trust, with Coinbase serving as BTC custodian and Bank of New York Mellon as cash custodian and administrator. The fund’s shares would trade on the Cboe BZX Exchange. </p><p>The SEC has until Oct. 16 to reach a decision or request more time in the review process. </p><p>A spot ETF is considered by many to be the gold standard for onboarding institutional investors into Bitcoin. Until now, the SEC has only approved futures-linked products. Its rejection of spot applications is tied to concerns about market manipulation, according to the regulator. </p><h3>Former Celsius CEO Mashinsky seeks dismissal of FTC case</h3><p>Alex Mashinsky, founder and former CEO of now-bankrupt crypto lender Celsius, filed a new motion in court seeking the dismissal of the United States Federal Trade Commission case against him “in its entirety.”</p><p>The legal counsel for the former Celsius boss argued that the allegations against their client do not support the claim that he knowingly made a misstatement to “fraudulently obtain customer information from a financial institution.” According to the lawyers, the accusations do not meet the standards for a claim under the Gramm-Leach-Bliley Act. This 1999 law requires knowingly making false claims to collect customer information fraudulently from a financial institution.</p><p>Additionally, the lawyers claimed that because Mashinsky resigned from his position as CEO of Celsius on Sept. 27, 2023, the complaint cannot prove that he “is violating” or “is about to violate” the law.</p><p>The FTC issued a $4.7-billion fine against bankrupt crypto lender Celsius Network in July and filed a lawsuit against the Celsius founder along with Celsius’ co-founders, Shlomi Daniel Leon and Hanoch “Nuke” Goldstein. Mashinsky’s legal team was also representing Goldstein.</p><p>His lawyers claimed that the FTC seems to be basing its case against Goldstein solely on the fact that he retweeted a blog post by Celsius. According to Goldstein, this behavior is being misconstrued as a sign of complicity or participation in the alleged misconduct.</p><p>Celsius was one of the largest crypto-lending platforms, headed by Mashinsky, before it imploded in 2022. The founder resigned as CEO in September later the same year, and by the end of 2022, the United States Justice Department had indicted the former CEO on multiple charges of criminal fraud. Mashinsky has pleaded not guilty to multiple charges filed against him and is out on bail on a $40-million bond.</p><h3>Vitalik Buterin says SIM swap led to his X account being taken over</h3><p>Ethereum co-founder Vitalik Buterin has confirmed that the recent hack of his X (Twitter) account was the result of a SIM-swap attack.</p><p>A SIM-swap or simjacking attack is a technique used by hackers to gain control of a victim’s mobile phone number. With control of the number, scammers can use two-factor authentication (2FA) to access social media, bank, and crypto accounts.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Confirmed sim swap for Vitalik. Pretty disappointing, there&#39;s no excuse to have sms based 2fa in this day and age. <a href=\"https://t.co/1pMZgxM7ca\">pic.twitter.com/1pMZgxM7ca</a></p>&mdash; quit (,) (@0xQuit) <a href=\"https://twitter.com/0xQuit/status/1701371270036902166?ref_src=twsrc%5Etfw\">September 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On Sept. 9, Buterin’s X account was <a href=\"https://cointelegraph.com/news/ethereum-vitalik-buterin-x-hackers-drain\">taken over by scammers</a> who posted a fake NFT giveaway prompting users to click a malicious link which resulted in victims collectively losing over $691,000.</p><p>Speaking on the decentralized social media network Farcaster on Sept. 12, Buterin <a href=\"https://warpcast.com/vitalik.eth/0x8ea2d0\" target=\"_blank\" rel=\"noopener nofollow\">said</a> that he has finally recovered his T-Mobile account after the hacker managed to gain control of it via a SIM swap attack.</p><p>“Yes, it was a SIM swap, meaning that someone socially-engineered T-mobile itself to take over my phone number.”</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-12T17:43:01.000Z",
    "title": "Crypto giant Ripple safeguards Fortress Trust amid security breach",
    "url": "https://www.cryptopolitan.com/crypto-giant-ripple-safeguards-fortress-trust-amid-security-breach/",
    "description": "In a swift and decisive move, leading crypto payments business Ripple (XRP) has stepped in to mitigate the fallout from a recent security incident that left clients of Fortress Trust in a state of vulnerability. The incident, which Fortress attributed to a compromised third-party vendor&#8217;s cloud tool, initially raised concerns about the safety of client ... <a title=\"Crypto giant Ripple safeguards Fortress Trust amid security breach\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-giant-ripple-safeguards-fortress-trust-amid-security-breach/\" aria-label=\"More on Crypto giant Ripple safeguards Fortress Trust amid security breach\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-12T18:00:07.000Z",
    "title": "Analyst Points Out Why End Of 2023 Will Not Be Great For XRP Price",
    "url": "https://www.newsbtc.com/analysis/xrp/2023-xrp-price/",
    "description": "The XRP price enjoyed a significant rise following Judge Analisa Torres’s ruling in favor of Ripple against the US Securities and Exchange Commission (SEC). However, a crypto analyst has explained why the token is unlikely to enjoy such a similar trajectory till the year runs out. XRP Price To End 2023 On A Low In a tweet shared on his X (formerly Twitter) platform, Jungle, a prominent figure in the XRP community, stated that he doesn’t “believe the end of 2023 will be great for XRP.” However, it is not only XRP that he believes will end on a low as, according to him, “crypto in general” will not enjoy so much success in the remaining months of this year. Related Reading: Crypto CEO Bags Record-Breaking Prison Sentence For $2 Billion Theft Jungle’s belief stems from the fact that many consumers are currently experiencing financial difficulty, so they might not be looking to invest in cryptocurrencies. He also mentioned the fact that the Federal Reserve keeps hiking interest rates in a bid to keep inflation down. This move ultimately curbs consumer spending, with many only focusing on what they consider necessary. He projects that the financial market will take more hits before the year runs out and states that crypto “will not be immune from the pain.” According to him, now doesn’t feel like a “great time for growth,” further dampening the hopes of anyone who might have had a positive outlook for the crypto market for the remaining months of this year. Jungle’s comment comes at a time when the crypto market is experiencing low trading volume across the board, which suggests that traders aren’t actively participating in the market. One reason could be that they have little or nothing to invest in the market, so they would rather stay out for now.  Token price returns to pre-judgment levels &#124; Source: XRPUSD on Tradingview.com Light At The End Of The Tunnel Jungle, however, mentioned that there are positives to look forward to for XRP and the crypto market in general. He noted that Judge Torres’ ruling, alongside a stablecoin on XRPL and an AMM capability, will spark significant growth for the ripple ecosystem.  He has also singled out certain factors and events that could drive up the crypto market&#8217;s value in the coming year. One of these events is the SEC approving the pending ETF applications by certain traditional financial institutions. An approval from the SEC will see institutions like BlackRock, Fidelity, and ARK Invest onboard a new class of investors to the crypto industry.  Related Reading: Remember That Guy That Lost A Flashdrive With 8,000 BTC? Here’s What He’s Up To Now The Bitcoin Halving coming up in the first half of 2024 is another event that Jungle has predicted will help drive up the crypto market&#8217;s value. Bitcoin and other cryptocurrencies&#8217; value is expected to rise significantly once the Halving occurs. Co-founder of Delphi Digital Kevin Kelly had previously noted that Bitcoin’s Halving was a key metric in determining when the next bull run would happen as he noted then that the last two halvings occurred 18 months after BTC bottomed and 7 months before it broke to a new all-time high (ATH).  Featured image from Admiral Markets, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-12T18:00:23.000Z",
    "title": "Are Gala and Apecoin going to zero? Prices Plummet as New AI Startup Shoots Towards $3 Million.",
    "url": "https://www.crypto-news-flash.com/are-gala-and-apecoin-going-to-zero-prices-plummet-as-new-ai-startup-shoots-towards-3-million/?utm_source=rss&utm_medium=rss&utm_campaign=are-gala-and-apecoin-going-to-zero-prices-plummet-as-new-ai-startup-shoots-towards-3-million",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2-1-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As the altcoin markets continue to experience a downturn, many investors&#8217; questions echo loudly: Are Gala ($GALA) and ApeCoin ($APE) destined for obscurity, with their prices spiraling towards zero? Recent market developments have sent shockwaves through the crypto community as these once-promising tokens faced severe price declines. Amid the uncertainty, a new star has emerged [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-12T17:45:00.000Z",
    "title": "Mantle Announces Ondo Finance Token As RWA Showcase Partner",
    "url": "https://coinedition.com/mantle-announces-ondo-finance-token-as-rwa-showcase-partner/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/CBDC-4-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Mantle Announces Ondo Finance Token As RWA Showcase Partner\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/CBDC-4-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/CBDC-4-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/CBDC-4-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/CBDC-4-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/CBDC-4-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/CBDC-4-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Earlier today, the Mantle Network published a blog announcing Ondo Finance’s USD Yield, $USDY as a showcase partner for Real World Assets (RWA). On Twitter, Mantle celebrated unlocking user access to U.S. Treasury yield directly via their Mantle wallets. According to Mantle, RWAs offer the “greatest potential to bring significant benefits for users.” Hence, serves [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/mantle-announces-ondo-finance-token-as-rwa-showcase-partner/\">Mantle Announces Ondo Finance Token As RWA Showcase Partner</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-12T18:05:53.000Z",
    "title": "Bitcoin (BTC) Forming Classic Breakdown Pattern, Says Crypto Analyst – Here’s His Downside Target",
    "url": "https://dailyhodl.com/2023/09/12/bitcoin-btc-forming-classic-breakdown-pattern-says-crypto-analyst-heres-his-downside-target/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/BTC-for-a-Bullish.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/BTC-for-a-Bullish.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/BTC-for-a-Bullish.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/BTC-for-a-Bullish.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/BTC-for-a-Bullish.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/BTC-for-a-Bullish.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/BTC-for-a-Bullish.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Widely followed crypto analyst Rekt Capital says that Bitcoin (BTC) is completing a classic technical pattern that hints at lower prices to come. The analyst tells his 351,000 followers on the social media platform X that BTC has almost printed a full double top pattern after being exhausted near the $30,000 range. Rekt said well [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/12/bitcoin-btc-forming-classic-breakdown-pattern-says-crypto-analyst-heres-his-downside-target/\">Bitcoin (BTC) Forming Classic Breakdown Pattern, Says Crypto Analyst – Here’s His Downside Target</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]