[
  {
    "source": "Decrypt",
    "date": "2023-07-17T12:01:06.000Z",
    "title": "$5 Million Token Grant Will Fuel ‘Decentralized AI’ Development",
    "url": "https://decrypt.co/148808/icp-internet-computer-dfinity-grants-decentralized-ai-deai",
    "description": "Projects can receive up to $100,000 in ICP tokens to build artificial intelligence tools using the Internet Computer Protocol."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-17T11:45:31.000Z",
    "title": "Binance completes Bitcoin Lightning Network integration",
    "url": "https://cryptoslate.com/binance-completes-bitcoin-lightning-network-integration/",
    "description": "<p>Crypto exchange Binance has completed the integration of Bitcoin (BTC) Lightning Network (LN) for deposits and withdrawals activities, according to a July 17 statement. LN is a &#8220;layer 2&#8221; payment protocol built on Bitcoin. The protocol enables faster, cheaper transactions between nodes and aims to solve BTC scalability issues, thereby improving user experience and potentially [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-completes-bitcoin-lightning-network-integration/\">Binance completes Bitcoin Lightning Network integration</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-17T11:47:00.000Z",
    "title": "Bitcoin Lightning Network Now Live On Binance",
    "url": "https://cryptodaily.co.uk/2023/07/bitcoin-lightning-network-now-live-on-binance",
    "description": "<p>Binance has successfully integrated Bitcoin Lightning Network on its platform for faster BTC withdrawals and deposits.&nbsp;</p>\nBinance Integrates Bitcoin Lightning Network\n<p>Binance, one of the leading cryptocurrency exchanges, has achieved a significant milestone by successfully integrating the Bitcoin Lightning Network on its platform. Around the end of June, the company had announced its decision to integrate the Bitcoin Lightning Network to scale up its BTC transaction.&nbsp;</p>\n<p>Earlier today, the Binance team put out a statement on its website, announcing the successful integration and providing all the details users would need to access these transactions. Binance users will now be able to now conduct BTC deposits and withdrawals on the Lightning Network, opening up new possibilities for faster and more cost-effective transactions.</p>\nHow Does Lightning Network Work?\n<p>The Bitcoin Lightning Network serves as a layer-two scaling solution that operates on top of the Bitcoin blockchain. Its primary objective is to enhance transaction speed, reduce fees, and address scalability concerns. By creating off-chain transaction channels, the Lightning Network facilitates near-instantaneous and economically viable transactions for users.</p>\n<p>With the completion of the integration, Binance users can locate their designated Bitcoin deposit addresses specifically tailored for the Lightning Network. These unique deposit addresses can be found on the platform's Deposit Crypto page.&nbsp;&nbsp;</p>\nLightning Network Advantages\n<p>The Bitcoin Lightning Network offers several advantages over traditional on-chain transactions, primarily by alleviating congestion on the Bitcoin blockchain and enabling a higher number of transactions per second. By moving most transactions off-chain, the Lightning Network significantly enhances the scalability of the Bitcoin network.</p>\n<p>Because Lightning Network transactions do not require confirmation by miners, it is conducive to near-instantaneous payment settlements. Users can enjoy the convenience of transactions being processed within seconds or even milliseconds, further enhancing the user experience.</p>\n<p>Furthermore, transactions on the Bitcoin Lightning Network typically incur lower fees than those executed directly on the Bitcoin network. This cost reduction makes microtransactions economically viable and encourages broader adoption across various use cases.</p>\n<p>In addition to its speed and cost advantages, the Lightning Network provides enhanced privacy protection. By not revealing individual transaction details on the blockchain, the Lightning Network safeguards users' privacy, ensuring a secure and confidential transaction environment.</p>\n<p>This move from Binance underscores its commitment to embracing innovative solutions that enhance cryptocurrency functionality and usability. By leveraging the Lightning Network's advantages, Binance aims to improve the efficiency and speed of Bitcoin transactions, thereby offering users a more streamlined trading experience.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice. </p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T11:51:42.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? As of today, the price of WazirX (WRX) stands at $0.109. It has a 24-hour trading volume of $2.36M and a market capitalization of $40.54M, with a market dominance of 0.00%. Over the past 24 hours, the WRX price has experienced an increase of 8.5%. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-17T11:45:13.000Z",
    "title": "Binance launches Arkham token sale, launch price to be 10X higher",
    "url": "https://crypto.news/binance-launches-arkham-token-sale-launch-price-to-be-10x-higher/",
    "description": "Binance has announced the launch of the arkham (ARKM) token sale on its launchpad. The sale will have mechanisms to protect investors from volatility"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-17T11:45:53.000Z",
    "title": "How to Find the Next Profitable Whale",
    "url": "https://www.altcoinbuzz.io/top-article/how-to-find-the-next-profitable-whale/",
    "description": "<p>Making crazy gains and losses is part of being in the crypto market. But, smart crypto enthusiasts have found some tools to increase their chances of success by a large margin. And one such tool involves tracking and finding out what whales are buying. In this article, you will discover more about crypto whales. Let&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/top-article/how-to-find-the-next-profitable-whale/\">How to Find the Next Profitable Whale</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-17T11:45:36.000Z",
    "title": "Fantom (FTM) Founder Andre Cronje Says Multichain Hack Was a ‘Big Blow’ to Ethereum Rival’s Ecosystem",
    "url": "https://dailyhodl.com/2023/07/17/fantom-ftm-founder-andre-cronje-says-multichain-hack-was-a-big-blow-to-ethereum-rivals-ecosystem/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/Updates-Outlook-on-Fantom-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/Updates-Outlook-on-Fantom-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/Updates-Outlook-on-Fantom-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/Updates-Outlook-on-Fantom-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/Updates-Outlook-on-Fantom-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/Updates-Outlook-on-Fantom-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/Updates-Outlook-on-Fantom-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Fantom (FTM) creator Andre Cronje says that the recent exploit of cross-chain bridge Multichain was a massive setback for the Ethereum (ETH) rival. Writing in the community&#8217;s forum, Cronje says that the Fantom team was misled about the true security level of Multichain. Cronje also says that he and his team plan to seek solutions [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/17/fantom-ftm-founder-andre-cronje-says-multichain-hack-was-a-big-blow-to-ethereum-rivals-ecosystem/\">Fantom (FTM) Founder Andre Cronje Says Multichain Hack Was a ‘Big Blow’ to Ethereum Rival’s Ecosystem</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-07-17T12:03:10.000Z",
    "title": "Bitfinex Alpha | Bitcoin Miners Make Hay while the Sun Shines, but Are Hedging Their Bets Too",
    "url": "https://blog.bitfinex.com/bitfinex-alpha/bitfinex-alpha-bitcoin-miners-make-hay-while-the-sun-shines-but-are-hedging-their-bets-too/",
    "description": "<p>Despite the relief with which markets greeted last week’s Consumer Price Index (CPI) print, the US economic picture is still quite mixed. While there are indications of improvement, such as increased small business optimism, challenges persist, including inflationary pressures in the housing sector and cautious...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/bitfinex-alpha/bitfinex-alpha-bitcoin-miners-make-hay-while-the-sun-shines-but-are-hedging-their-bets-too/\">Bitfinex Alpha | Bitcoin Miners Make Hay while the Sun Shines, but Are Hedging Their Bets Too</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]