[
  {
    "source": "CoinDesk",
    "date": "2023-05-30T15:32:32.000Z",
    "title": "FTX Examiner Appointment Referred to Court of Appeals by District Judge",
    "url": "https://www.coindesk.com/policy/2023/05/30/ftx-examiner-appointment-referred-to-court-of-appeals-by-district-judge/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. government is pushing to have an independent inquiry into the crypto exchange despite concerns over cost"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-30T15:22:06.000Z",
    "title": "Bitcoin price rejects at $28K as analysts eye CME futures gap dip",
    "url": "https://cointelegraph.com/news/bitcoin-price-rejects-at-28k-as-analysts-eye-cme-futures-gap-dip",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/f243284f-7e44-4b89-bfb6-359b48921356.jpeg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC price action sees weakness a day from the May monthly close, with Bitcoin analysts closely monitoring bid liquidity.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) fell into the May 30 Wall Street open as the return of United States equities failed to boost performance.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/e04464be-26fa-4776-a92d-844cba79da9b.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour candle chart on Bitstamp. Source: TradingView</em></figcaption></figure><h2>Bitcoin pauses into monthly close</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.142027444.742658523.1640948929-762064149.1640948929\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> showed BTC/USD heading to $27,700, having briefly spiked above the $28,000 mark.</p><p>The pair encountered resistance below its local highs from around the weekly close, and stocks also treaded water after the opening bell.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-erodes-4-gains-as-btc-price-downside-targets-stretch-to-23k\">Excitement</a> around a possible deal to raise the U.S. debt ceiling, which had boosted crypto previously, also cooled as market participants waited for its first test in Congress.</p><p>“Bitcoin has been having a hard time reclaiming the weekend high,” monitoring resource Material Indicators <a href=\"https://twitter.com/MI_Algos/status/1663555077246967808/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">summarized</a> in part of analysis on the day. </p><blockquote>“With the Monthly candle close approaching tomorrow, bulls and bears are fighting to control the momentum.”</blockquote><p>An accompanying chart of the BTC/USD on Binance showed strengthening bid liquidity in the active trading range.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/8f03c5a2-ef3b-4ccc-a470-73505a9b352b.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD order book data for Binance. Source: Material Indicators/ Twitter</em></figcaption></figure><p>Popular trader Daan Crypto Trades suggested that that liquidity represented genuine interest in BTC, rather than forming part of an order book “spoof.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> $22M+ Spot Buy Wall still sitting between $27.4-27.5K. <br><br>Some of the bids got filled yesterday already.<br><br>Looks to be genuine orders that want to get filled. <a href=\"https://t.co/IjgMrnss8M\">pic.twitter.com/IjgMrnss8M</a></p>&mdash; Daan Crypto Trades (@DaanCrypto) <a href=\"https://twitter.com/DaanCrypto/status/1663556540312453121?ref_src=twsrc%5Etfw\">May 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Fellow trader Jelle was also optimistic, offering May 31 as a potentially good date for bulls.</p><p>“Quite liking how Bitcoin shapes up here. Still holding the key support, and looks like we're building a little hidden bullish divergence here,” part of Twitter commentary <a href=\"https://twitter.com/CryptoJelleNL/status/1663559312613187585\" target=\"_blank\" rel=\"noopener nofollow\">stated</a>.</p><p>Additional posts included coverage of a potential triple breakout for Bitcoin when it comes to market structures.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> is at the cusp of breaking out from three different bullish patterns.<br><br>Just a little bit higher, before these all confirm a move higher.<br><br>Who&#39;s ready? <a href=\"https://t.co/8yZnTnn6xx\">pic.twitter.com/8yZnTnn6xx</a></p>&mdash; Jelle (@CryptoJelleNL) <a href=\"https://twitter.com/CryptoJelleNL/status/1663440434100666368?ref_src=twsrc%5Etfw\">May 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>CME gap looms large</h2><p>On the radar meanwhile was the looming gap in CME futures markets and Bitcoin's potential to \"fill\" it next.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/mining-difficulty-passes-50-trillion-5-things-bitcoin-this-week\">Mining difficulty passes 50 trillion — 5 things to know in Bitcoin this week</a></em></strong></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/5ce03cc3-41c7-4e6f-8a51-dcd7ee7545d6.png\"  /><figcaption style=\"text-align: center;\"><em>CME Bitcoin futures 1-hour candle chart. Source: TradingView</em></figcaption></figure><p>The weekend's upside left a blank space on the futures chart between $26,900 and $27,850, providing a potential short-term downside target for spot price.</p><p>Popular trader Justin Bennett included that scenario in part of the day's price analysis, suggesting rangebound behavior would continue.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Nice bounce from <a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> so far, exactly as explained in Monday&#39;s blog post. <br><br>This is your range for now. Get above $28,250 and we likely see a liquidity grab toward $29k and $30k. <br><br>But if $27,500 fails, expect the CME gap to fill.<a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> <a href=\"https://t.co/kFabrgykZH\">https://t.co/kFabrgykZH</a> <a href=\"https://t.co/U5BnJgzvzm\">pic.twitter.com/U5BnJgzvzm</a></p>&mdash; Justin Bennett (@JustinBennettFX) <a href=\"https://twitter.com/JustinBennettFX/status/1663544559308259332?ref_src=twsrc%5Etfw\">May 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Fellow trader Mikybull Crypto meanwhile took the opportunity to present a summary of other unfilled CME gaps for the year.</p><p>\"Note: gaps don't get filled immediately but they're not to be neglected,\" he argued.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/a0d9884f-5393-4c61-b80f-4d817384aa77.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin futures chart with gaps shown. Source: Mikybull Crypto/ Twitter</em></figcaption></figure><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ai-eye-traders-chatgpt-stock-picks-ai-dice-adobe-firefly/\">AI Eye: 25K traders bet on ChatGPT’s stock picks, AI sucks at dice throws, and more</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-30T15:29:28.000Z",
    "title": "OKX sends bankrupt Alameda $8.3M in crypto assets",
    "url": "https://cryptoslate.com/okx-sends-bankrupt-alameda-8-3m-in-crypto-assets/",
    "description": "<p>OKX sent $8.3 million in different crypto assets to Alameda Research over the past seven days, according to the Arkham Intelligence dashboard. The transfers, which happened in multiple transactions on May 29, saw the exchange send between $60,000 &#8211; $1.4 million worth of different cryptocurrencies to the bankrupt crypto firm. According to the dashboard, some [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/okx-sends-bankrupt-alameda-8-3m-in-crypto-assets/\">OKX sends bankrupt Alameda $8.3M in crypto assets</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-30T15:30:00.000Z",
    "title": "Can Uwerx’s (WERX) Imminent Alpha Platform Propel It to Greater Heights?",
    "url": "https://cryptodaily.co.uk/2023/05/can-uwerxs-werx-imminent-alpha-platform-propel-it-to-greater-heights",
    "description": "<p>Amidst the ever-evolving crypto landscape, Uwerx is a shining contender, poised to ascend to greater heights with its imminent Alpha platform.</p>\n<p>With a compelling blend of cutting-edge features, user-centric design, and an unwavering commitment to excellence, Uwerx stands out as a formidable option for investors seeking a dynamic and rewarding venture.</p>\n<p>Let's look at the factors that make Uwerx's Alpha platform a potential game-changer in the market.</p>\n<p class=\"s7\">Uwerx's (WERX) Alpha Platform Launch: Redefining the Digital Currency Landscape</p>\n<p>Don't miss the unique opportunity that Uwerx presents in 2023 and beyond. With the already partially unveiled Alpha Version and the Beta version just over the horizon, this is a remarkable opportunity for investors to participate in a platform with remarkable potential.</p>\n<p>Uwerx is gearing up to redefine the landscape with a series of significant updates. These exciting developments showcase Uwerx's unwavering commitment to innovation and its dedication to meeting the evolving needs of its users.</p>\n<p>One of the standout updates is the platform's plan to renounce contracts upon its launch on centralized exchanges while reducing taxes to zero. This bold move sets the stage for a more seamless and user-friendly experience, making Uwerx an attractive option for cryptocurrency enthusiasts.</p>\n<p>The value of WERX is forecasted to rise from $0.0315 to $0.041 on Friday, June 2nd at 15:00 UTC. With the added advantage of a bonus on orders set to decrease from 20% to 15%, now is the optimum time to seize the opportunity and enhance your investment portfolio.</p>\n<p class=\"s7\">Uwerx (WERX) Paves the Way for a New Era of Freelancers</p>\n<p>Uwerx is on a mission to redefine the freelancing industry and revolutionize how independent professionals worldwide work. With its forward-thinking mindset and innovative approach, Uwerx introduces a range of groundbreaking features that promise to usher in a new era of freelancing.</p>\n<p>Breaking away from the constraints of traditional freelance platforms, Uwerx offers an intuitive and user-friendly experience. It empowers freelancers to create profiles showcasing expertise and quickly setting competitive rates. This feature gives freelancers the tools to excel and outshine their competition.</p>\n<p>Uwerx is committed to providing a secure and transparent experience for its users. It offers a transaction fee of only 1%, significantly boosting profitability for freelancers and clients. This approach fosters a mutually beneficial relationship, ensuring both parties are satisfied with the results.</p>\n<p>Apart from its fundamental features, Uwerx also offers cutting-edge collaboration tools that facilitate seamless communication and workflow management. This streamlined approach enables freelancers and clients to work together efficiently, ensuring the success of every project.</p>\n<p>Additionally, Uwerx's dispute settlement system and comprehensive copyright protection measures instill trust and reliability within the platform's community, fostering a safe and secure environment where creativity and innovation can thrive.</p>\n<p class=\"s7\">Presale Success and Exciting Milestones: Uwerx's (WERX) Journey towards a Thriving Community</p>\n<p>Uwerx has introduced a game-changing feature, the Uwerx Vault, revolutionizing how users interact with their WERX tokens. This innovative concept allows users to store their tokens securely while earning rewards based on platform variables. Like staking, the Uwerx Vault offers users additional incentives, enhancing engagement and deepening their involvement with the platform.</p>\n<p>Benefit from the current WERX price at $0.0315 and avail a handsome 20% purchase bonus. Why wait for the price to rise when you can act now and enjoy better returns?</p>\n<p>Tap into the exciting journey that Uwerx is about to undertake. Follow the links below for more information and make your decisive move today. Remember, the best investors don&rsquo;t wait for chances, they create them. Don't just observe the growth, be a part of it.</p>\n<p>Uwerx has seen an impressive surge in demand, resulting in significant changes to its token allocation. These adjustments highlight Uwerx's commitment to delivering an excellent user experience and responding to the evolving needs of its community.</p>\n<p>Uwerx's commitment to security and reliability is reinforced by thorough audits conducted by esteemed entities such as SolidProof and InterFi Network. Additionally, the platform ensures long-term stability by locking liquidity for an impressive 25 years before the end of the Presale, providing users with confidence in the platform's sustainability.</p>\n<p>Uwerx's growing recognition is evident through its listings on prominent platforms like CoinSniper, with plans underway for its listing on Uniswap by August 1st. Surpassing the milestone of 5,000 users further highlights the platform's rapid expansion and the strength of its community.</p>\n<p>The recent Twitter poll demonstrated that Uwerx actively seeks user feedback and input. The poll revealed an overwhelming 98.2% vote in favor of a Test Airdrop to be conducted towards the end of the Presale, allowing users to experience the platform's features firsthand.</p>\n<p>Additionally, the team intends to speed up token locking based on the 82.8% of user votes, reinforcing the platform's commitment to providing enhanced security measures.</p>\n<p>Join the Uwerx presale today at stage 5!</p>\n<p class=\"s12\">Presale: invest.uwerx.network</p>\n<p class=\"s12\">Telegram: https://t.me/uwerx_network</p>\n<p class=\"s12\">Twitter: https://twitter.com/uwerx_network</p>\n<p class=\"s12\">Website: https://www.uwerx.network/</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n<p>&nbsp;</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-30T15:15:00.000Z",
    "title": "Bitcoin Price Analysis:  A Very Volatile May - 31 May 2023",
    "url": "https://cryptodaily.co.uk/2023/05/bitcoin-price-analysis-a-very-volatile-may-31-may-2023",
    "description": "<p>BTC/USD Concluding a Volatile Month:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 31 May 2023</p>\n<p>Bitcoin (BTC/USD) experienced elevated volatility early in the Asian session as the pair orbited the 28000 figure after reaching the 28057.23 level, representing a test of the 50% retracement of the recent depreciating range from 28473.93 to 27681.99.&nbsp;&nbsp; Stops were elected below the 27825.33 area during a pullback, right around the 61.8% retracement of the recent appreciating range from 27681.99 to 28057.23.&nbsp; &nbsp;Following recent price activity, areas of technical resistance and potential selling pressure include the 29048, 29143, and 29813 levels.&nbsp; Upside retracement levels in recent depreciating ranges include the 28700, 28741, 28868, 29243, 29299, and 29284 levels. &nbsp;Above the market, upside price objectives include the 30420.74, 31237.11, 31477.37, 32501.23, 32556.73, 32989.19, 34583.96, 34658.69, 35222.66, 37765.28, and 38403.97 levels.&nbsp;</p>\n<p>Some recent technical support emerged around the 200-bar, 4-hourly simple moving average.&nbsp; Technical buying pressure has recently been steady around the 26641 area, a downside price objective also linked to the 27678.73 area.&nbsp; Downside price objectives associated with the 28334.75 and 27647.82 levels include the 25604.43 and 25124.80 levels.&nbsp; Additional downside price objectives include the 25474, 25442, 24705, 24440, 23208, and 22769 levels.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bullishly indicating above the 100-bar MA (hourly) and above the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;200-bar MA&nbsp;(4-hourly) at 27714.83 and the&nbsp;50-bar MA&nbsp;(Hourly) at 27443.73.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;25604.51/ 24440.41/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-30T15:30:17.000Z",
    "title": "Biggest Movers: XRP Hits 6-Week High, SOL Collides With Key Resistance Level",
    "url": "https://news.bitcoin.com/biggest-movers-xrp-hits-6-week-high-sol-collides-with-key-resistance-level/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1991776319-2-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1991776319-2-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1991776319-2-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1991776319-2-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1991776319-2-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1991776319-2-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1991776319-2-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_1991776319-2.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />XRP rallied to a six-week high in today&#x2019;s session, as the token extended a recent bull run to a sixth day. Prices have risen by as much as 10% in that period, with the latest surge sending the cryptocurrency above $0.50. Solana was also higher, hitting a multi-week high of its own. XRP XRP, formerly [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T15:38:43.000Z",
    "title": "Solana Price Down 5.87%: TRON and Tradecurve Are Better Bets for Profits in May",
    "url": "https://www.cryptopolitan.com/solana-price-down-5-87-tron-and-tradecurve-are-better-bets-for-profits-in-may/",
    "description": "While Solana (SOL) and TRON (TRX) bears seem to be winning their battles, Tradecurve (TCRV) is headed in a positive direction. It has quickly drawn market attention as a new crypto contender forecasted to deliver 50x during its presale and 100x upon its launch. Investors have shown significant interest in Tradecurve, and it’s for a ... <a title=\"Solana Price Down 5.87%: TRON and Tradecurve Are Better Bets for Profits in May\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-down-5-87-tron-and-tradecurve-are-better-bets-for-profits-in-may/\" aria-label=\"More on Solana Price Down 5.87%: TRON and Tradecurve Are Better Bets for Profits in May\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T15:37:36.000Z",
    "title": "U.S. and EU have meeting about China, AI, and trades",
    "url": "https://www.cryptopolitan.com/us-eu-have-meeting-about-china-ai-and-trades/",
    "description": "In the heart of Sweden, the freezing Arctic air buzzed with the warmth of diplomatic dialogue as high-ranking officials from the United States and the European Union congregated to discuss a broad range of issues. From trade complaints lingering from the Trump administration to the advent of artificial intelligence (AI) and the looming economic giant ... <a title=\"U.S. and EU have meeting about China, AI, and trades\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-eu-have-meeting-about-china-ai-and-trades/\" aria-label=\"More on U.S. and EU have meeting about China, AI, and trades\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T15:31:48.000Z",
    "title": "Quant (QNT) and InQubeta (QUBE) Are Gaining Traction Thanks To Increasing Institutional Interest In Crypto",
    "url": "https://www.cryptopolitan.com/quant-qnt-and-inqubeta-qube-are-gaining-traction-thanks-to-increasing-institutional-interest-in-crypto/",
    "description": "The cryptocurrency market has witnessed a remarkable surge in institutional interest as traditional financial institutions and major corporations recognize the potential of digital assets. This increasing acceptance and adoption of cryptocurrencies have contributed to the growing traction of projects like Quant (QNT) and InQubeta (QUBE).&#160; We delve into how the rising institutional interest in crypto ... <a title=\"Quant (QNT) and InQubeta (QUBE) Are Gaining Traction Thanks To Increasing Institutional Interest In Crypto\" class=\"read-more\" href=\"https://www.cryptopolitan.com/quant-qnt-and-inqubeta-qube-are-gaining-traction-thanks-to-increasing-institutional-interest-in-crypto/\" aria-label=\"More on Quant (QNT) and InQubeta (QUBE) Are Gaining Traction Thanks To Increasing Institutional Interest In Crypto\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T15:29:40.000Z",
    "title": "TMS Network (TMSN) Gains $6M Throne, Solana (SOL) and Polygon (MATIC) Prospects Stay Dim",
    "url": "https://www.cryptopolitan.com/tms-network-tmsn-gains-6m-throne-solana-sol-and-polygon-matic-prospects-stay-dim/",
    "description": "It’s safe to say that crypto bull runs are back in fashion in 2023, illustrated beautifully by the recent $6M gains of newcomer TMS Network (TMSN). The decentralized investment platform has significantly disrupted the investment market, bringing decentralized and traditional investors alike together within a unified space.  Unfortunately, this does not look positive for Solana ... <a title=\"TMS Network (TMSN) Gains $6M Throne, Solana (SOL) and Polygon (MATIC) Prospects Stay Dim\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tms-network-tmsn-gains-6m-throne-solana-sol-and-polygon-matic-prospects-stay-dim/\" aria-label=\"More on TMS Network (TMSN) Gains $6M Throne, Solana (SOL) and Polygon (MATIC) Prospects Stay Dim\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T15:27:22.000Z",
    "title": "Which cryptocurrency To Add To Your Portfolio: Polkadot (DOT), Uwerx (WERX), Or TRON (TRX)",
    "url": "https://www.cryptopolitan.com/which-cryptocurrency-to-add-to-your-portfolio-polkadot-dot-uwerx-werx-or-tron-trx/",
    "description": "Your portfolio may be diversified by putting money into cryptocurrencies, and it is usually preferable to purchase inexpensive coins with solid fundamentals. Coins like Polkadot (DOT) and TRON (TRX) may have once ruled the crypto sector.&#160; However, a new project in Stage 2 of its presale &#8211; Uwerx, could be the next big thing. In ... <a title=\"Which cryptocurrency To Add To Your Portfolio: Polkadot (DOT), Uwerx (WERX), Or TRON (TRX)\" class=\"read-more\" href=\"https://www.cryptopolitan.com/which-cryptocurrency-to-add-to-your-portfolio-polkadot-dot-uwerx-werx-or-tron-trx/\" aria-label=\"More on Which cryptocurrency To Add To Your Portfolio: Polkadot (DOT), Uwerx (WERX), Or TRON (TRX)\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T15:27:16.000Z",
    "title": "Analysts In Favor Of Uwerx (WERX) As Toncoin (TON) And Shiba Inu (SHIB) Decline",
    "url": "https://www.cryptopolitan.com/analysts-in-favor-of-uwerx-werx-as-toncoin-ton-and-shiba-inu-shib-decline/",
    "description": "The cryptocurrency industry provides a lot of investment options for everyday investors. As time passes, new initiatives like Uwerx are starting to become fan favorites, as Toncoin (TON) and Shiba Inu (SHIB) are slowly losing their ground. In this article, we will look closely at each of these coins and see what analysts believe their ... <a title=\"Analysts In Favor Of Uwerx (WERX) As Toncoin (TON) And Shiba Inu (SHIB) Decline\" class=\"read-more\" href=\"https://www.cryptopolitan.com/analysts-in-favor-of-uwerx-werx-as-toncoin-ton-and-shiba-inu-shib-decline/\" aria-label=\"More on Analysts In Favor Of Uwerx (WERX) As Toncoin (TON) And Shiba Inu (SHIB) Decline\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T15:23:43.000Z",
    "title": "DWF Labs Commits Seven-Figure Investment to Outer Ring MMO: A New Era of Gaming Begins",
    "url": "https://www.cryptopolitan.com/dwf-labs-commits-seven-figure-investment-to-outer-ring-mmo-a-new-era-of-gaming-begins/",
    "description": "DWF Labs Commits Seven-Figure Investment to Outer Ring MMO: A New Era of Gaming Begins In an exciting development, DWF Labs has pledged long-term financial support to the Outer Ring MMO, injecting a substantial seven-figure investment. This strategic funding infusion will accelerate the development of their groundbreaking video game and propel the growth of their ... <a title=\"DWF Labs Commits Seven-Figure Investment to Outer Ring MMO: A New Era of Gaming Begins\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dwf-labs-commits-seven-figure-investment-to-outer-ring-mmo-a-new-era-of-gaming-begins/\" aria-label=\"More on DWF Labs Commits Seven-Figure Investment to Outer Ring MMO: A New Era of Gaming Begins\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T15:16:37.000Z",
    "title": "MetaZone Secures Funding to Expand the World’s First Tokenized App Platform for the Metaverse",
    "url": "https://www.cryptopolitan.com/metazone-secures-funding-to-expand-the-worlds-first-tokenized-app-platform-for-the-metaverse/",
    "description": "Singapore, Singapore, May 30th, 2023, Chainwire MetaZone announced today the completion of its US$3 million seed round co-led by metaverse industry leaders, Sfermion and CMT Digital, to expand their tokenized app platform pioneering the META, (Metaverse Enabled Tokenized Application). Top web3 funds Tess Ventures, IOSG Ventures,IVC (Infinity Ventures Crypto), Polygon Studios, MHC Digital, and LucidBlue ... <a title=\"MetaZone Secures Funding to Expand the World’s First Tokenized App Platform for the Metaverse\" class=\"read-more\" href=\"https://www.cryptopolitan.com/metazone-secures-funding-to-expand-the-worlds-first-tokenized-app-platform-for-the-metaverse/\" aria-label=\"More on MetaZone Secures Funding to Expand the World’s First Tokenized App Platform for the Metaverse\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T15:16:17.000Z",
    "title": "Silicon Valley Bank England will get a new name",
    "url": "https://www.cryptopolitan.com/silicon-valley-bank-england-get-a-new-name/",
    "description": "As the winds of change blow across the financial landscape, Silicon Valley Bank&#8217;s UK branch is poised to assume a new identity. The transformation is expected to be formalized in the coming month, with the once-innovative powerhouse transitioning into HSBC Innovation Banking, a move likely to stir excitement and speculation in equal measure. From Silicon ... <a title=\"Silicon Valley Bank England will get a new name\" class=\"read-more\" href=\"https://www.cryptopolitan.com/silicon-valley-bank-england-get-a-new-name/\" aria-label=\"More on Silicon Valley Bank England will get a new name\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-30T15:30:01.000Z",
    "title": "Binance restarts TORN deposits on ETH and BNB blockchains",
    "url": "https://crypto.news/binance-restarts-torn-deposits-on-eth-and-bnb-blockchains/",
    "description": "On May 20, 2023, Binance made an announcement on Twitter that “Due to circumstances surrounding the protocol, Binance will temporarily pause $TORN deposits until further notice.”"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-30T15:30:54.000Z",
    "title": "NFT Market Update: Major Collections Suffer Price Slump in 2023",
    "url": "https://www.newsbtc.com/nft-market/nft-market-update-major-collections-suffer-price-slump-in-2023/",
    "description": "The non-fungible token (NFT) industry has become a trending digital asset sector. The sector gained significant traction from investors worldwide over the past two years. Even during the extended bearish market of 2022, the industry thrived, gaining more sales volume than in 2021. However, the trend seems to be changing, with many collections recording important losses in 2023.  Top NFT Collections In 2022 Lose Their Value in Ether In 2022, the NFT industry sales volumes rose to impressive heights surpassing the records of 2021. However, most of these popular NFTs lost their value in Ether this 2023. Related Reading: Pepecoin Eyes Rebound As It Finds Support In Strong Algorithm Data Score A crypto analyst, HashBastards NFTs, took to Twitter to list some of the top NFT collections in 2022 that have lost massively this year.  These NFTs include Invisible Friends, Doodles, Goblintown, Moonbirds, and others. According to the post, these NFTs have lost over 95% of their value in Ether this 2023. The community-centered collection, Doodles, shows a significant loss between 2022 and 2023. The NFT collections floor price dropped from 23 ETH to 2.3 ETH, indicating a decline of over 90%.  Data from the popular NFT marketplace, OpenSea, confirms that the Doodles&#8217; floor price is currently at 2.0089 ETH, worth $3,828.92 based on the current market price.  Other NFTs, Invisible Friends fell from 8 ETH to 1.15 ETH; Moonbirds now stands at 2 ETH, dropping from its 2022 value of 32 ETH, while Goblintown declined from 6 ETH to 0.26 ETH.  NFTs Are Drawing More Attention Amid Declining Prices NFTGo released its quarterly report tagged &#8216;2023 Q1 NFT Market Analysis: An Insider Look&#8217;. The report noted that the bearish crypto market trend toward the end of 2022 impacted the NFT space. Subsequently, blue-chip NFT collections plummeted by more than 40% of their value. The Blue Chip Index declined from its year high of 12,394 ETH in July 2022 to 7,446 ETH in 2023. However, despite the drastic drop in the value of NFT collections, some investors see the price decline as the right opportunity to accumulate. At the same time, some think it is over for the sector.  NFTGo data indicated that these holders grew by 90% over the past 12 months. According to the data, while sellers surged 32%, buyers dropped 30%. Related Reading: Floki Inu: Does Meme Coin Have What It Takes To Re-Enter Top 100 Spot? Also, new investors are still moving into this space. Peter Schiff, a crypto skeptic, rolled out an NFT project on the Bitcoin blockchain through Ordinals on May 27. The collection sale will pass through a two-staged auction between June 2 and June 9. The collection, known as &#8216;Golden Triumph,&#8217; represents a human hand with a bar of gold. Featured image from Pixabay and chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-30T15:22:47.000Z",
    "title": "MetaZone Secures Funding to Expand the World’s First Tokenized App Platform for the Metaverse",
    "url": "https://www.crypto-news-flash.com/metazone-secures-funding-to-expand-the-worlds-first-tokenized-app-platform-for-the-metaverse/?utm_source=rss&utm_medium=rss&utm_campaign=metazone-secures-funding-to-expand-the-worlds-first-tokenized-app-platform-for-the-metaverse",
    "description": "<p>Singapore, Singapore, May 30th, 2023, Chainwire MetaZone announced today the completion of its US$3 million seed round co-led by metaverse industry leaders, Sfermion and CMT Digital, to expand their tokenized app platform pioneering the META, (Metaverse Enabled Tokenized Application). Top web3 funds Tess Ventures, IOSG Ventures,IVC (Infinity Ventures Crypto), Polygon Studios, MHC Digital, and LucidBlue [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/metazone-secures-funding-to-expand-the-worlds-first-tokenized-app-platform-for-the-metaverse/\">MetaZone Secures Funding to Expand the World’s First Tokenized App Platform for the Metaverse</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-30T15:30:00.000Z",
    "title": "RBI Plans to Expand CBDC Pilot in India, Enhance Use Cases in 2023-24",
    "url": "https://coinedition.com/rbi-plans-to-expand-cbdc-pilot-in-india-enhance-use-cases-in-2023-24/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/RBI_Plans_to_Expand_CBDC_Pilot_and_Enhance_Use_Cases_in_2023_24-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"RBI\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/RBI_Plans_to_Expand_CBDC_Pilot_and_Enhance_Use_Cases_in_2023_24-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/RBI_Plans_to_Expand_CBDC_Pilot_and_Enhance_Use_Cases_in_2023_24-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/RBI_Plans_to_Expand_CBDC_Pilot_and_Enhance_Use_Cases_in_2023_24-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/RBI_Plans_to_Expand_CBDC_Pilot_and_Enhance_Use_Cases_in_2023_24-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/RBI_Plans_to_Expand_CBDC_Pilot_and_Enhance_Use_Cases_in_2023_24-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/RBI_Plans_to_Expand_CBDC_Pilot_and_Enhance_Use_Cases_in_2023_24.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In a bid to embrace the digital transformation of the financial industry, the Reserve Bank of India (RBI) is making noteworthy progress with its pilot program for Central Bank Digital Currency (CBDC). The central bank has recently announced its plans to expand the ongoing pilots in CBDC-Retail and CBDC-Wholesale, incorporating various use cases and features [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/rbi-plans-to-expand-cbdc-pilot-in-india-enhance-use-cases-in-2023-24/\">RBI Plans to Expand CBDC Pilot in India, Enhance Use Cases in 2023-24</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-30T15:10:00.000Z",
    "title": "Bulls Rally LDO Price to a 7-Day High, Will Bullish Momentum Persist?",
    "url": "https://coinedition.com/bulls-rally-ldo-price-to-a-7-day-high-will-bullish-momentum-persist/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Bulls_Rally_LDO_Price_to_a_7_Day_High_Will_Bullish_Momentum_Persist-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"LDO\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Bulls_Rally_LDO_Price_to_a_7_Day_High_Will_Bullish_Momentum_Persist-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Bulls_Rally_LDO_Price_to_a_7_Day_High_Will_Bullish_Momentum_Persist-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Bulls_Rally_LDO_Price_to_a_7_Day_High_Will_Bullish_Momentum_Persist-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Bulls_Rally_LDO_Price_to_a_7_Day_High_Will_Bullish_Momentum_Persist-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Bulls_Rally_LDO_Price_to_a_7_Day_High_Will_Bullish_Momentum_Persist-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Bulls_Rally_LDO_Price_to_a_7_Day_High_Will_Bullish_Momentum_Persist.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Bulls in the Lido DAO (LDO) market resisted negative pressure early by establishing support at the intra-day low of $2.09. Consequently, the LDO price rose to a 24-hour high of $2.24 (7-day high) before facing resistance. At press time, LDO is trading at $2.21, a 4.42% increase over its previous close. During the upturn, LDO&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bulls-rally-ldo-price-to-a-7-day-high-will-bullish-momentum-persist/\">Bulls Rally LDO Price to a 7-Day High, Will Bullish Momentum Persist?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]