[
  {
    "source": "CoinDesk",
    "date": "2023-05-29T12:20:18.000Z",
    "title": "Dogecoin Chart Pattern Suggests Volatility Explosion Ahead",
    "url": "https://www.coindesk.com/markets/2023/05/29/dogecoin-chart-pattern-suggests-volatility-explosion-ahead/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A technical analysis indicator called Bollinger bandwidth suggests dogecoin's unusual calm could soon end with a pronounced move in either direction."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-29T12:15:55.000Z",
    "title": "Bitcoin’s leap above $28k triggers $130 million in crypto liquidations",
    "url": "https://cryptoslate.com/bitcoins-leap-above-28k-triggers-130-million-in-crypto-liquidations/",
    "description": "<p>Bitcoin&#8217;s (BTC) brief climb above $28,000 during the early trading hours of today led to liquidations of roughly $130 million in positions held on the crypto market. According to Coinglass data, the flagship digital asset saw $55 million in liquidations for traders who held positions in it in the last 24 hours. Roughly $130 million [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoins-leap-above-28k-triggers-130-million-in-crypto-liquidations/\">Bitcoin’s leap above $28k triggers $130 million in crypto liquidations</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-29T12:15:00.000Z",
    "title": "Can Tradecurve Surpass Polygon (MATIC) And Chainlink (LINK) In The Coming Years?",
    "url": "https://cryptodaily.co.uk/2023/05/can-tradecurve-surpass-polygon-matic-and-chainlink-link-in-the-coming-years",
    "description": "<p>Well-established crypto projects have become sluggish in terms of growth. Therefore, investors are looking for young projects, like Tradecurve, which are setting new records.&nbsp;</p>\n<p>Although Polygon (MATIC) and Chainlink (LINK) have worked on improving their ecosystem, their value has been in the red zone. Therefore, holders of MATIC and LINK have started to shed their tokens to add TCRV to their investment portfolio.</p>\n<p>&gt;&gt;Register For The Tradecurve Presale&lt;&lt;</p>\n<p>Polygon (MATIC) Joins Hands With De.Fi</p>\n<p>To protect its ecosystems from issues like smart contract vulnerabilities, phishing, blind signing, and others, Polygon (MATIC) has collaborated with De.Fi. Under this partnership, Polygon (MATIC) will integrate De.Fi&rsquo;s antivirus into its ecosystem.&nbsp;</p>\n<p>The antivirus will include tools like De.Fi Shield, which will scan smart contract approvals, and downloaded files in the Polygon (MATIC) ecosystem. It will also enable Polygon (MATIC) users to assess the security of non-fungible tokens, or staking vaults.&nbsp;</p>\n<p>The price of Polygon (MATIC) has responded positively to the news. Polygon (MATIC) has risen by more than 1% on the weekly price chart. Currently, Polygon (MATIC) is available to trade at $0.86.</p>\n<p></p>\n<p>Coinbase Cloud Joins Chainlink (LINK)</p>\n<p>Chainlink&rsquo;s (LINK) ecosystem has been expanding, and Coinbase Cloud is a new player to join it. Chainlink (LINK) has been working on improving its network efficiency to attract more users.&nbsp;</p>\n<p>This is necessary as Chainlink (LINK) has been plummeting on the price charts for quite some time. The market value of Chainlink has dropped by 11% in the past month, and LINK is currently trading at $6.30.&nbsp;</p>\n<p>According to the recent announcement by Chainlink (LINK), Coinbase Cloud will become a node operator on its system. Under this collaboration, Coinbase Cloud will use its infrastructure to strengthen the security of Chainlink&rsquo;s (LINK) oracle network. Chainlink (LINK) has big names on its roster of node operators, including Associated Press, Deutsche Telekom, and Swisscom.</p>\n<p></p>\n<p>Tradecurve Wins Market Trust With Its Growth Potential</p>\n<p>Currently, there are about 600 crypto exchanges, and the number of users is expected to increase from 420 million (2022) to more than 994 million by 2027. Thus, crypto exchanges can witness a surge in their adoption over the coming years. But one platform that is set to attract the most number of traders is the newly launched Tradecurve.</p>\n<p>Earlier, traders had to create multiple accounts on different platforms to trade derivatives. However, on Tradecurve, users can trade cryptocurrencies, indices, Forex, CFDs, Options, and other derivatives with a single account. Therefore, it is destined to become one of the top three global trading exchanges.</p>\n<p>Besides, existing trading exchanges, such as Binance and Bittrex have been caught up in intense legal scrutiny. Hence, traders are opting for Tradecurve for a safe and stable trading experience. TCRV will power the ecosystem, and its holders will get bonuses, discounts, and exclusive rewards. They can also earn rewards by staking their tokens to the platform&rsquo;s liquidity pool, which will be locked for two years.</p>\n<p>The platform is moving towards raising $20 million during the presale phase, which is significantly higher than the ICO of Binance. A TCRV token is currently available for $0.015, and is expected to soar by 50x during the presale.</p>\n<p>For more information about TCRV presale tokens:</p>\n<p>Click Here For Website</p>\n<p>Click Here To Buy TCRV Presale Tokens</p>\n<p>Follow Us Twitter</p>\n<p>Join Our Community on Telegram</p>\n<p>&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-29T12:15:00.000Z",
    "title": "Sparklo (SPRK) Dominates the Crypto Market, Bullish Spree for Polygon (MATIC) And Avalanche (AVAX)",
    "url": "https://cryptodaily.co.uk/2023/05/sparklo-sprk-dominates-the-crypto-market-bullish-spree-for-polygon-matic-and-avalanche-avax",
    "description": "<p>In what is looking like an upturn in the crypto market, some notable tokens have begun rallying in price. Some of such tokens are polygon (MATIC) and Avalanche (AVAX).</p>\n<p>More notably, Sparklo has also consolidated its position in the crypto market recently, prompting analysts to advise investors to prioritize Sparklo ahead of Polygon (MATIC) and Avalanche (AVAX) as it is a more viable investment option with more room for growth.</p>\n<p>Sparklo (SPRK) takes the market by storm&nbsp;</p>\n<p>Only a few ardent investors may claim not to know about the waves and high potential that Sparklo has shown in the crypto market since its presale was announced weeks ago. This is following a sustained and steady momentum that Sparklo has, which is prompting more investors to join the project. Ahead of its imminent launch, Sparklo is geared to become the first innovative blockchain investment platform where members can buy, sell or own solid mineral assets like Silver, Gold and Platinum. These assets can be traded using fractionalized NFTs as a representation of the assets.</p>\n<p>Also, traders can buy the SPRK token now that it is at a relatively low but ever-growing price value. At the price of only $0.026 per SPRK token, investors can buy the Sparklo token and position themselves for the exponential growth that the token will undergo in the near future. Interestingly, a 50% bonus is up for grabs when investors make a substantial purchase of the SPRK tokens. The project is already in the second phase of the presale and the bonus will end soon.&nbsp;</p>\n<p>Interfi Network has backed the Sparklo project by passing its audit at pre-launch. Moreso, investors are assured of the safety of their assets as liquidity will be locked for 100 years thereby preventing an event of a rug pull. We believe that Sparklo is a promising investment opportunity that you should check out below.</p>\n<p>&gt;&gt;&gt;&gt; BUY TOKENS &lt;&lt;&lt;</p>\n<p>positive price action for Polygon (MATIC)&nbsp;</p>\n<p>Polygon (MATIC) is an Ethereum-based platform for scaling and infrastructure development of multiple types of applications. Within the last 24 hours, Polygon (MATIC) saw a significant +3.73% upturn in price value. This pegs the price of Polygon (MATIC) at $0.88 as of press time.&nbsp;</p>\n<p>In recent news, Mangrove, a decentralized exchange (DEX) will be launching on the Polygon (MATIC) network by June. This move will see an addition of an innovative DeFi tool to the Polygon (MATIC) network and further strengthen the network in the world of blockchain transactions. Although Polygon (MATIC) is making a giant stride, we recommend that you invest in a more stable project like Sparklo, which experts have predicted that its value will rise by more than 2000% this year.&nbsp;</p>\n<p>Avalanche (AVAX) announces the introduction of an AI-powered blockchain</p>\n<p>Avalanche (AVAX) is a layer one and decentralized blockchain that validates transactions using smart contracts. Recently, the co-founder of the Avalanche (AVAX) network, Emin G&uuml;n Siree announced at the Avalanche (AVAX) Summit II 2023 that the network is proposing a blockchain that will be powered by AI. Emin also highlighted that the AI would make use of Generative Pretrained Transformers (GPTs) to read and parse smart contracts.</p>\n<p>In the crypto market, the Avalanche (AVAX) token saw a +3.63% increase in price value within the last 24 hours. As a result, the price of Avalanche (AVAX) is $14.80 currently. The positive price action of Avalanche (AVAX) may be related to the recent announcement of introducing AI into the Avalanche network.&nbsp;</p>\n<p>Find out more about the Sparklo presale:</p>\n<p>Buy Presale: https://invest.sparklo.finance</p>\n<p>Website: https://sparklo.finance</p>\n<p>Twitter: https://twitter.com/sparklo_finance</p>\n<p>Telegram: https://t.me/sparklofinance</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-29T12:38:34.000Z",
    "title": "US prosecutors gather evidence including code and millions of pages of emails against FTX boss",
    "url": "https://crypto.news/us-prosecutors-gather-evidence-including-code-and-millions-of-pages-of-emails-against-ftx-boss/",
    "description": "Prosecutors in the United States building a case against former FTX CEO, Sam Bankman-fried (SBF), have reportedly gathered a trove of relevant evidence that includes code snippets and emails"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-29T12:22:11.000Z",
    "title": "NASDAQ congratulates Ripple on Metaco’s acquisition, fuels IPO rumors",
    "url": "https://crypto.news/nasdaq-congratulates-ripple-on-metacos-acquisition-fuels-ipo-rumors/",
    "description": "NASDAQ has congratulated Ripple, the blockchain payments company, following its acquisition of Metaco, a Swiss-based crypto custody platform"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-29T12:30:51.000Z",
    "title": "Bitcoin Shows Recovery: Did This Historical Line Act As Support Again?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-shows-recovery-did-historical-line-act-support/",
    "description": "Bitcoin on-chain data suggests a historical support line may have helped the coin once again as the asset has recovered toward $28,000 today. Bitcoin Short-Term Holder Cost Basis May Still Be Active As Support According to data from the on-chain analytics firm Glassnode, the BTC price approached the cost basis of the short-term holders recently. The relevant indicator here is the &#8220;realized price,&#8221; which is a metric derived from the &#8220;realized cap.&#8221; The realized cap refers to a capitalization model for Bitcoin that says that the value of each coin in the circulating supply is not the current spot price, but the price at which it was last transacted on the blockchain. In this way, the model accounts for the price at which each investor acquired their coins. That is, their &#8220;cost basis.&#8221; When the realized cap is divided by the number of coins in circulation (to find a sort of average value), the aforementioned realized price emerges. Related Reading: Bitcoin Exchange Inflows Mostly Coming From Loss Holders, Weak Hands Exiting? This realized price signifies the average value at which each holder in the market bought their coins. The metric can also be defined for only partial segments of the market, like the &#8220;short-term holders&#8221; (STHs), in which case, the indicator will tell us about the average cost basis among this group only. The STHs are all those investors who bought their coins less than 155 days ago. The BTC holders outside this group are termed the &#8220;long-term holders&#8221; (LTHs). Now, here is a chart that shows the trend in the Bitcoin realized price for the STHs over the past couple of years: The value of the metric seems to have been climbing in recent days &#124; Source: Glassnode on Twitter In the above graph, Glassnode has marked the various instances where the Bitcoin STH realized price has apparently interacted with the spot price of the asset. Back when the 2021 bull run topped out in November, the cryptocurrency&#8217;s value dropped below this indicator, signaling a change of trend. From this point on, as the bear market took over, the STH cost basis started providing resistance to the asset. Back in January of this year, though, the price finally managed to break through this resistance as the rally began to take place. Related Reading: Bitcoin Bulls Push BTC Back Up To $28K Amid Surging Address Activity This break lead to another change in the wider trend, as the line seemingly turned into support for the asset. However, this isn&#8217;t an unusual pattern, as bullish periods have historically observed the metric helping the price. Recently, Bitcoin found some struggle, as the price plunged towards the $26,000 level. The consolidation near this level meant that the price was fast approaching the STH realized price, which was slowly going up. When Glassnode posted the chart yesterday, it described this current state as a &#8220;decision point&#8221; for the market. According to the analytics firm, a successful retest here would be a sign of strength in the bullish trend, while failure would imply weakness. Over the past day, Bitcoin has enjoyed a rebound, with the price briefly breaking above the $28,000 level. But it may perhaps not be a coincidence that the uplift has come right as the price was nearing a retest of this historical level. Naturally, a sustained move away from the STH realized price now would confirm that the level is still active as support, a sign that would be positive for the rally&#8217;s sustainability. BTC Price At the time of writing, Bitcoin is trading around $27,900, up 4% in the last week. BTC has surged in the past day &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-29T12:37:50.000Z",
    "title": "Explosive Price Surge for Sparklo (SPRK) as Apecoin (APE), EOS (EOS) Sees Varying Price Actions",
    "url": "https://coinedition.com/explosive-price-surge-for-sparklo-sprk-as-apecoin-ape-eos-eos-sees-varying-price-actions/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Sparklo-maintains-growth-despite-the-crypto-market-downturn-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Sparklo-maintains-growth-despite-the-crypto-market-downturn-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Sparklo-maintains-growth-despite-the-crypto-market-downturn-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Sparklo-maintains-growth-despite-the-crypto-market-downturn-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Sparklo-maintains-growth-despite-the-crypto-market-downturn-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Sparklo-maintains-growth-despite-the-crypto-market-downturn-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Sparklo-maintains-growth-despite-the-crypto-market-downturn.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Sparklo has been in hot form since announcing its presale phase. While the first presale phase is over, the ongoing second phase of presale has seen huge attractions as more investors join the project. Meanwhile, ApeCoin (APE) crabs and EOS (EOS) experience price slumps as crypto market is volatile. Sparklo (SPRK) attracts investors as it [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/explosive-price-surge-for-sparklo-sprk-as-apecoin-ape-eos-eos-sees-varying-price-actions/\">Explosive Price Surge for Sparklo (SPRK) as Apecoin (APE), EOS (EOS) Sees Varying Price Actions</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-29T12:22:36.000Z",
    "title": "Dogecoin (DOGE) Price Prediction: What to Expect in the Next 48 Hours",
    "url": "https://coinedition.com/dogecoin-doge-price-prediction-what-to-expect-in-the-next-48-hours/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Doge-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Doge-Price-Prediction-What-To-Expect-in-the-Next-48-Hours\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Doge-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Doge-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Doge-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Doge-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Doge-Price-Prediction-What-To-Expect-in-the-Next-48-Hours-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/04/Doge-Price-Prediction-What-To-Expect-in-the-Next-48-Hours.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Based on data released by the wallet tracker Whale Alert, anonymous wallets have been involved in transferring slightly over 200 million DOGE coins among themselves within the past 24 hours. The tracker identified four transactions, each carrying 50 million and 57 million DOGE, resulting in a total movement of 214.8 million Dogecoins. Notably, one of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/dogecoin-doge-price-prediction-what-to-expect-in-the-next-48-hours/\">Dogecoin (DOGE) Price Prediction: What to Expect in the Next 48 Hours</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]