[
  {
    "source": "Decrypt",
    "date": "2023-08-24T09:35:42.000Z",
    "title": "Germany Ramps Up AI Investments Amid Global Race for Innovation",
    "url": "https://decrypt.co/153592/germany-ramps-up-ai-investments-amid-global-race-for-innovation",
    "description": "The German government has significantly boosted AI research funding, signaling its ambition to remain a key player in the global tech arena."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-24T09:29:54.000Z",
    "title": "FTX Estate Wants to Hedge Bitcoin, Ethereum With Mike Novogratz's Galaxy Digital",
    "url": "https://decrypt.co/153591/ftx-estate-wants-start-staking-ethereum-with-mike-novogratz",
    "description": "FTX wants to also sell and stake some of its crypto, hedging the company from “extreme and unpredictable price movements,” says a new filing."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-24T09:30:44.000Z",
    "title": "NVIDIA doubles down on generative AI amid reducing gaming, crypto focus",
    "url": "https://cryptoslate.com/nvidia-doubles-down-on-generative-ai-amid-reducing-gaming-crypto-focus/",
    "description": "<p>Nvidia made no mention of cryptocurrency or crypto mining chips and minimal references to gaming in its latest earnings call released on Aug. 23, as AI dominated the narrative around growth drivers and new offerings. Based on the frequency and context of mentions, the transcript indicates a greater emphasis on AI than gaming, Nvidia&#8217;s core [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/nvidia-doubles-down-on-generative-ai-amid-reducing-gaming-crypto-focus/\">NVIDIA doubles down on generative AI amid reducing gaming, crypto focus</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-24T09:34:26.000Z",
    "title": "Tether’s Plan B Teams Up with FC Lugano: The Future of Crypto in Swiss Football",
    "url": "https://cryptobriefing.com/tethers-plan-b-teams-up-with-fc-lugano-the-future-of-crypto-in-swiss-football/?utm_source=feed&utm_medium=rss",
    "description": "FC Lugano starts sponsorship from Plan B, a Tether and Lugano partnership, aiming to push cryptocurrency integration in football."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-24T09:15:00.000Z",
    "title": "\n                        API3 Launches Managed Data Feed Services on Polygon zkEVM\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/api3-launches-managed-data-feed-services-on-polygon-zkevm",
    "description": "\n                        <p class=\"md-end-block md-p\">Blockchain oracle provider API3 has announced that it is launching a new data feed service suite for Polygon zkEVM, designed from a new push oracle solution that's centered around first-party architecture.</p>\n<p class=\"md-end-block md-p\">According to a press release shared to CryptoDaily by API3, the new solution allows DeFi protocols that currently use push oracles on other EVM (Ethereum Virtual Machine) chains to seamlessly migrate to Polygon zkEVM, hence functioning as both an onboarding and integration solution.</p>\n<p class=\"md-end-block md-p\">Polygon zkEVM, which has built its reputation around the utilization of zero-knowledge proofs and EVM equivalence, has taken a strategic step by incorporating managed decentralized data feeds (dAPIs) from the API3 Market. The rise of such a managed data feed service highlights the sustained DeFi appetite, a sector where the Total Value Locked (TVL) reportedly spans tens of billions.</p>\nThe API3 Model\n<p class=\"md-end-block md-p\">API3's model contrasts with traditional third-party oracle mechanisms, focusing instead on a first-party architecture. The novel approach of sourcing data directly and (in a manner that is) cryptographicallyy-backed pushes the boundaries of data transparency in the space.</p>\n<p class=\"md-end-block md-p\">API3's push oracle solution potentially offers remedies to such issues, advocating for a comprehensive, transparent, and possibly more efficient data sourcing model. The key differentiation (it appears) is with how API3 emphasizes first-party oracles, ensuring data is sourced directly, with increased traceability and data integrity.</p>\n<p class=\"md-end-block md-p\">With DeFi's dynamic evolution, the integration and management of oracle services via a DAO become increasingly relevant. Platforms like QuickSwap Perps, Dovish, and MantisSwap have pivoted to embrace dAPIs, signifying a recognition of the potential security and operational advantages these decentralized data feeds might bring. Tropykus, which has roots in AAVE V2, rapidly embraced dAPIs for its framework and subsequently debuted on Polygon zkEVM. Such an integration showcases the flexibility and potential benefits of dAPIs for emerging platforms. </p>\n<p class=\"md-end-block md-p\">Jack Melnick, Head of DeFi BD at Polygon Labs, provided insights on this alliance:</p>\n\n<p class=\"md-end-block md-p\">\"It's very exciting to see API3 deploying on Polygon zkEVM, enhancing the DeFi ecosystem with an innovative push oracle solution. The integration of managed dAPIs with Polygon's scalable infrastructure marks a significant step towards a more transparent and secure future for decentralized finance.\"</p>\n\n<p class=\"md-end-block md-p\">API3's Market space also helps provide an avenue for developers to interact with dAPIs, a potential game-changer in how dApps leverage real-time market data. This collaboration might signal an industry shift, emphasizing more secure, transparent, and efficient data management methods.</p>\nSome Comparisons\n<p class=\"md-end-block md-p\">In comparison to alternatives like Chainlink and Pyth, which have been noted for their relatively high fees and questions around transparency, API3&rsquo;s dAPI stands out. It offers builders an opportunity to tap into decentralized data feeds from multiple sources, all facilitated by first-party oracle nodes integrated with native-chain aggregation. This not only positions API3 distinctly in the market but also sets a potential new standard for oracle transparency and efficiency.</p>\n<p class=\"md-end-block md-p md-focus\">This new Managed dAPI service addresses several operational challenges developers face, such as the complexities of gas management, rourtine maintenance, and continuous monitoring. The service is not just a conceptual offering; it's already in operation. Developers on the Polygon zkEVM platform, who previously relied on self-funded data feeds, can now seamlessly integrate aggregated data streams directly from other eminent data providers. </p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T09:26:42.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.1033, accompanied by a 24-hour trading volume of $61.59 million. The market capitalization stands at $49.13 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 2.15% decrease. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T09:22:19.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T09:18:02.000Z",
    "title": "Shiba Inu (SHIB) & Polygon (MATIC) Dip: VC Spectra (SPCT) Emerges as the Crypto to Watch!",
    "url": "https://www.cryptopolitan.com/shiba-inu-shib-polygon-matic-dip-vc-spectra-spct-emerges-as-the-crypto-to-watch/",
    "description": "The new Shibarium has generated much excitement for Shiba Inu (SHIB). On the other hand, Polygon (MATIC) is emerging as a dominant player in gaming and NFTs of late. Despite this progress, both projects have dipped in value, setting the stage for gems like VC Spectra (SPCT). This alternative decentralized finance platform plans to make ... <a title=\"Shiba Inu (SHIB) &#38; Polygon (MATIC) Dip: VC Spectra (SPCT) Emerges as the Crypto to Watch!\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-shib-polygon-matic-dip-vc-spectra-spct-emerges-as-the-crypto-to-watch/\" aria-label=\"More on Shiba Inu (SHIB) &#38; Polygon (MATIC) Dip: VC Spectra (SPCT) Emerges as the Crypto to Watch!\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-08-24T09:10:04.000Z",
    "title": "Top Recent Crypto News To Watch Out For This Month",
    "url": "https://nulltx.com/top-recent-crypto-news-to-watch-out-for-this-month/",
    "description": "The cryptocurrency market is constantly evolving, and it can be difficult to keep up with the latest news and developments. However, there are a few key pieces of news that traders and investors should be aware of particularly this period, as they could have a notable impact on the market. The SEC Charges Two Alleged [&#8230;]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-24T09:37:10.000Z",
    "title": "4 Ultra HIGH POTENTIAL Altcoins for Crypto BULL RUN",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/4-ultra-high-potential-altcoins-for-crypto-bull-run/",
    "description": "<p>Being early is a recurring theme in crypto. If you get in early with a project, you may reap the benefits once the token starts to explode. Right, since that&#8217;s the moment we&#8217;re all waiting for. But, before we get there, you need to find that great entry point. That&#8217;s the early part! My research team and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/4-ultra-high-potential-altcoins-for-crypto-bull-run/\">4 Ultra HIGH POTENTIAL Altcoins for Crypto BULL RUN</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-24T09:15:21.000Z",
    "title": "Analyst Issues Dire Bitcoin Warning, Says BTC Could Plunge Below 2022 Lows – Here Are His Targets",
    "url": "https://dailyhodl.com/2023/08/24/analyst-issues-dire-bitcoin-warning-says-btc-could-plunge-below-2022-lows-here-are-his-targets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Plunge-Below-2022-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Plunge-Below-2022-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Plunge-Below-2022-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Plunge-Below-2022-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Plunge-Below-2022-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Plunge-Below-2022-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Plunge-Below-2022-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto analyst Justin Bennett is warning that Bitcoin (BTC) could revisit a level in the lower teens last reached in 2020. Bennett tells his 111,500 followers on the social media platform X that Bitcoin could plunge by nearly 50% from its current price. Using a chart showing that the flagship crypto asset has fallen out [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/24/analyst-issues-dire-bitcoin-warning-says-btc-could-plunge-below-2022-lows-here-are-his-targets/\">Analyst Issues Dire Bitcoin Warning, Says BTC Could Plunge Below 2022 Lows – Here Are His Targets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]