[
  {
    "source": "CoinDesk",
    "date": "2023-10-13T21:07:22.000Z",
    "title": "SEC Reportedly Decides Not to Appeal Its Bitcoin ETF Court Loss Against Grayscale",
    "url": "https://www.coindesk.com/policy/2023/10/13/sec-reportedly-decides-not-to-appeal-its-bitcoin-etf-court-loss-against-grayscale/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The decision, reported by Reuters, boosts the odds that Grayscale Investments will be able to turn its Grayscale Bitcoin Trust (GBTC) into a more investor-friendly ETF."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-13T21:13:49.000Z",
    "title": "Ripple’s Win Over SEC Gave XRP a Massive Boost—That’s All Gone Now",
    "url": "https://decrypt.co/201463/xrp-boost-from-ripple-sec-court-win-gone-now",
    "description": "XRP boomed in July following a federal judge's ruling. It has since crashed back down again. "
  },
  {
    "source": "Decrypt",
    "date": "2023-10-13T20:57:07.000Z",
    "title": "Microsoft Now Owns 'Call of Duty' Maker Activision Blizzard—What Happens Next?",
    "url": "https://decrypt.co/201465/microsoft-owns-call-of-duty-publisher-activision-blizzard-what-happens-next",
    "description": "Xbox maker Microsoft just acquired Call of Duty, Diablo, Candy Crush, and Overwatch. What does it mean for players and the games they love?"
  },
  {
    "source": "Decrypt",
    "date": "2023-10-13T20:33:13.000Z",
    "title": "Google Adds AI Features to Search and Browsing May Never Be the Same",
    "url": "https://decrypt.co/201468/google-ai-features-search-browsing",
    "description": "With tech giants racing to capitalize on generative AI, Google is infusing Search with creative new capabilities."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-13T20:30:36.000Z",
    "title": "What Happens If the SEC Doesn't Appeal Grayscale Bitcoin ETF Ruling?",
    "url": "https://decrypt.co/201464/what-happens-if-sec-doesnt-appeal-grayscale-bitcoin-etf-ruling",
    "description": "The SEC shows no signs of fighting back against its court loss to Grayscale. "
  },
  {
    "source": "Decrypt",
    "date": "2023-10-13T19:47:14.000Z",
    "title": "Ethereum, Solana and XRP Lead Losses in Rough Week for Crypto Market",
    "url": "https://decrypt.co/201453/ethereum-solana-xrp-rough-week-for-crypto",
    "description": "This is the lowest price Ethereum has traded at in the past seven months."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-13T19:13:35.000Z",
    "title": "There's a Film Festival Happening in Minecraft Right Now",
    "url": "https://decrypt.co/201433/film-festival-happening-minecraft-right-now",
    "description": "Looking to catch some independent cinema? You might be surprised at the locale—this festival is running inside a Minecraft game world. Here's why."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-13T20:35:52.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>The biggest acquisition in gaming history could have important implications for the Web3 and crypto gaming communities. Meanwhile, the firm behind USDT (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) appointed chief technology officer Paolo Ardoino as its new CEO, and a secret recording from a meeting involving former Alameda CEO Caroline Ellison has revealed a number of insights into what occurred in the days and weeks leading up to the FTX crisis. </p><h2>Microsoft’s Activision buy may see more metaverse in the office and crypto in gaming</h2><p>Microsoft’s recently finalized buyout of Activision Blizzard — the largest acquisition in gaming history — could prove to be the catalyst for an uptick in cryptocurrency in gaming and the expansion of the metaverse for the office. </p><p>The Redmond behemoth’s Xbox division was never really meant to be a profitable arm of the Microsoft corporation, and the $68.7 billion acquisition of Activision Blizzard demonstrates the company’s intent to bet on long-term synergy between its gaming, software and enterprise verticals. </p><p>The principal players in the buyout — Microsoft CEO Satya Nadella, Xbox boss Phil Spencer and former Activision Blizzard CEO Bobby Kotick (who will stay until the end of 2023 to help with the turnover) — have all, at one time or another, expressed fervent interest in exploring the metaverse space.</p><p> And if leaked internal documents are to be believed, both companies (prior to the buyout) had explored the crypto gaming space and, at least at the drawing board stage, developed potential plans. </p><p>Together, these notions indicate that <a href=\"https://cointelegraph.com/news/microsoft-activision-buy-metaverse-office-crypto-gaming\">both Web3 and crypto could have a bright future under the massive umbrella of Microsoft/Xbox</a> — now the third-largest gaming outfit in the world, trailing only Tencent and Sony. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today is a good day to play. We officially welcome Activision Blizzard King to Team Xbox. Together, we’ll create stories and experiences that bring players together, in a culture empowering everyone to do their best work and celebrate diverse perspectives. <a href=\"https://t.co/KBCESknYYh\">https://t.co/KBCESknYYh</a> <a href=\"https://t.co/jTHOeH48Wx\">https://t.co/jTHOeH48Wx</a></p>&mdash; Phil Spencer (@XboxP3) <a href=\"https://twitter.com/XboxP3/status/1712816031423729991?ref_src=twsrc%5Etfw\">October 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>Tether stablecoin firm appoints CTO Paolo Ardoino as CEO</h3><p>Tether, the issuer of the world’s largest stablecoin by market capitalization, is replacing its CEO as the company works to expand its areas of focus.</p><p>Ardoino, who has been serving as Tether’s chief technology officer since 2017, will become the new CEO of the firm in December 2023, Tether announced on Oct. 13.</p><p>He will replace Jean-Louis van der Velde, who will transition to an advisory role for Tether while retaining his position as CEO of Tether’s sister company, Bitfinex. Ardoino will continue in his roles as chief technology officer for Bitfinex and chief strategy officer for the Bitcoin layer-2 solution Holepunch.</p><p>Ardoino will also “continue to oversee the technology department for the time being” at Tether, a spokesperson for the firm told Cointelegraph.</p><p>Tether said the change in leadership reflects the company’s commitment to actively exploring new business operations, including peer-to-peer communications, renewable energy, resilient data storage and Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) mining.</p><p>As Ardoino has been leading Tether’s expansion strategy over the last couple of years, the transition should be seen as a “natural progression,” a representative of the firm told Cointelegraph.</p><h3>Secret Alameda recording reveals moment staff learned about FTX deposits</h3><p>A 75-minute <a href=\"https://cointelegraph.com/news/secret-recording-caroline-ellison-alameda-sbf-trial\">secretly recorded audio clip</a> of Ellison has revealed the exact moment 15 former Alameda Research staff found out the hedge fund was “borrowing” user funds from FTX. </p><p>The full-length recording, obtained by Cointelegraph, provides fresh insights into the palpable tension felt by Ellison and Alameda staff <a href=\"https://cointelegraph.com/news/ftx-collapse-the-crypto-industry-s-lehman-brothers-moment#:~:text=Eric%20Chen%2C%20CEO%20and%20co,liabilities%20far%20exceeded%20their%20assets.\">in the lead-up to FTX’s collapse</a>.</p><p>“Alameda was kind of borrowing a bunch of money via open-term loans and using that to make various illiquid investments,” said Ellison during an all-hands meeting in Hong Kong on Nov. 9, 2022.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Judge Kaplan: This is for prior consistent statement.<br>AUSA: Who recorded the all-hands meeting?<br>Drappi: Rick Best. He had started at Alameda three days before this. He gave me the recording.<br>AUSA: Here&#39;s a CD, have you reviewed it?<br>Drappi: Yes. It&#39;s audio clips.</p>&mdash; Inner City Press (@innercitypress) <a href=\"https://twitter.com/innercitypress/status/1712557725702570422?ref_src=twsrc%5Etfw\">October 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“So, like a bunch of FTX and FTX US equity. [...] Most of Alameda’s loans got called in in order to meet those recalls,” she added. </p><blockquote>“We ended up like borrowing a bunch of funds from FTX, which led to FTX having a shortfall in user funds.”</blockquote><p>“[FTX] basically always allowed Alameda to borrow users’ funds,” she added, speaking to the 15 or so staff in the meeting.</p><p>Select segments of the audio recording of the meeting were also played before the court on the eighth day of Sam Bankman-Fried’s criminal trial on Oct. 12, which was part of witness testimony from Christian Drappi, a former software engineer at Alameda. </p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-13T19:49:40.000Z",
    "title": "Microsoft’s Activision buy may see more metaverse in the office and crypto in gaming ",
    "url": "https://cointelegraph.com/news/microsoft-activision-buy-metaverse-office-crypto-gaming",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/d0f944e1-b7cd-4154-95ad-b0a38ff79ae8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>More signs say the acquisition will boost metaverse applications in business than in gaming as CEO Nadella talks about productivity and metaverse enthusiast Kotick leaves Activision. </p>\n                    <p><p>A lot was said about the metaverse when the Microsoft deal to acquire Activision Blizzard was announced in January 2022. The attention was mainly on business communications rather than gaming. If public statements and leaked documents are any guide, the Activision deal could promise more for the future of crypto than the metaverse. </p><p>The metaverse had high visibility in Microsoft’s announcement of its deal for Activision in January 2002. “This acquisition will accelerate the growth in Microsoft’s gaming business […] and will provide building blocks for the metaverse,” the company <a href=\"https://news.microsoft.com/2022/01/18/microsoft-to-acquire-activision-blizzard-to-bring-the-joy-and-community-of-gaming-to-everyone-across-every-device/\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in the first paragraph. A few paragraphs later, Microsoft CEO Satya Nadella said, “Gaming […] will play a key role in the development of metaverse platforms.”</p><p>Nadella elaborated on his vision for metaverse development in an interview the following month, <a href=\"https://www.ft.com/content/7d2a185c-7ab1-4fb2-80ca-aaa1fa7267ba\" target=\"_blank\" rel=\"noopener nofollow\">telling</a> the Financial Times:</p><blockquote>“We are building, quite frankly, metaverse applications, if I could call them that. Or experiences in business applications, in productivity tools, and meetings and games — all three on a common platform.” </blockquote><p>Nadella’s emphasis on work is telling. He listed four things and referred to them as “all three” — apparently, “meetings and games” count as one. Microsoft’s metaverse platform, Mesh, which began previews this month, is positioned as a complement to its Teams business communications platform. </p><p>Mesh contains a gaming component too. While promising “you will transform your two-dimensional (2D) meeting into a 3D immersive experience,” it added:</p><blockquote>“Play built-in interactive games for team bonding within immersive spaces. To get started, you can see a few designated areas to roast marshmallows, throw beanbags, answer fun icebreaker questions, and more.”</blockquote><p>The metaverse went unmentioned in the Microsoft Gaming statements at the <a href=\"https://news.xbox.com/en-us/2022/01/18/welcoming-activision-blizzard-to-microsoft-gaming/?ocid=Evergreen_soc_omc_xbo_tw_Photo_lrn_1.18.1\" target=\"_blank\" rel=\"noopener nofollow\">beginning</a> and <a href=\"https://news.xbox.com/en-us/2023/10/13/xbox-activision-blizzard/\" target=\"_blank\" rel=\"noopener nofollow\">completion</a> of the deal on Oct. 13, and Microsoft Gaming CEO Phil Spencer made it clear later in 2022 that his enthusiasm for it was weaker. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/ftc-opposes-microsoft-s-metaverse-focused-activision-blizzard-purchase\">FTC opposes Microsoft’s metaverse-focused Activision Blizzard purchase</a></em></strong></p><p>Spencer questioned <a href=\"https://cointelegraph.com/news/xbox-boss-keen-on-metaverse-but-cautious-about-play-to-earn-games\">what the metaverse even is</a> in an interview with Bloomberg in August. “My view on Metaverse is that gamers have been in the Metaverse for 30 years,” he said. He said little about the Web3 metaverse except that he was “cautious” about play-to-earn. He was later <a href=\"https://www.pcgamer.com/xbox-boss-phil-spencer-says-the-metaverse-is-like-a-poorly-built-videogame/\" target=\"_blank\" rel=\"noopener nofollow\">quoted</a> as calling the metaverse “a poorly built videogame” and saying, “Building a metaverse that looks like a meeting room, I just find that’s not where I want to spend most of my time.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today is a good day to play. We officially welcome Activision Blizzard King to Team Xbox. Together, we’ll create stories and experiences that bring players together, in a culture empowering everyone to do their best work and celebrate diverse perspectives. <a href=\"https://t.co/KBCESknYYh\">https://t.co/KBCESknYYh</a> <a href=\"https://t.co/jTHOeH48Wx\">https://t.co/jTHOeH48Wx</a></p>&mdash; Phil Spencer (@XboxP3) <a href=\"https://twitter.com/XboxP3/status/1712816031423729991?ref_src=twsrc%5Etfw\">October 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Activision CEO Bobby Kotick is enthusiastic about the metaverse. He <a href=\"https://www.gamespot.com/articles/activision-blizzard-ceo-says-a-ready-player-one-like-metaverse-is-coming/1100-6490762/\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in 2021, “We’re going to get to a place where that original vision that Neil Stephenson had in Snow Crash or what you see in [Ernest Cline’s] Ready Player One is going to start to materialize as something that is very real.\"</p><p>In an interview on CNBC on the day the Activision deal was announced, Kotick and Spencer <a href=\"https://www.cnbc.com/video/2022/01/18/activision-blizzard-ceo-bobby-kotick-metaverse-race-helped-prompt-microsoft-deal.html\" target=\"_blank\" rel=\"noopener nofollow\">appeared</a> together on CNBC. Kotick said, “We’re beginning to see what the metaverse will be like, and in that race for the metaverse, it started to become apparent that there were a variety of resources and talent that we needed,” Kotick said. Spencer did not mention the metaverse. </p><p>Kotick will remain with Activision through the end of the year. </p><p>Spencer may be more bullish on cryptocurrency, however. Leaked internal documents reportedly <a href=\"https://www.ccn.com/news/microsoft-crypto-wallets-xbox-boom-crypto-gaming/\" target=\"_blank\" rel=\"noopener nofollow\">revealed</a> that Microsoft planned to integrate crypto wallets into Xbox. Spencer <a href=\"https://twitter.com/XboxP3/status/1704233222752571842\" target=\"_blank\" rel=\"noopener nofollow\">downplayed</a> the leak, saying “so much has changed,” but did not deny any of the information. If the plans to incorporate crypto have not changed, they could potentially be expanded throughout the new Microsoft games holdings. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/minecraft-bans-bitcoin-play-earn-iphone-15-crypto-gaming-formulae-preview-web3-gamer/\">Minecraft bans Bitcoin P2E, iPhone 15 &amp; crypto gaming, Formula E: Web3 Gamer</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-13T19:30:00.000Z",
    "title": "Price analysis 10/13: BTC, ETH, BNB, XRP, SOL, ADA, DOGE, TON, DOT, MATIC",
    "url": "https://cointelegraph.com/news/price-analysis-10-13-btc-eth-bnb-xrp-sol-ada-doge-ton-dot-matic",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/44e5acb9-38bb-45c7-b18a-83ddad7ebf6b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin trades in a predictable range, but will the sideways price action tempt altcoin traders to open new positions?</p>\n                    <p><p>A trending move in an asset class attracts traders, while a dull price action drives investors to the sidelines. Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) has largely been stuck in a range for the past several months, which could be one of the reasons for the drop in spot volumes. Bloomberg reported on Oct. 11 that Coinbase’s <a href=\"https://cointelegraph.com/news/coinbase-trading-volume-declines\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/coinbase-trading-volume-declines/amp\">spot trading volume plunged 52%</a> in Q3 2023 compared to Q3 2022.</p><p>While the short-term remains uncertain, traders need to be watchful because long consolidations are generally followed by an explosive price action. The only problem is that it is difficult to predict the direction of breakout with certainty. Considering that the bulls have not allowed Bitcoin to dip back below $25,000 in the past few months, it increases the likelihood of an upside breakout.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/9e1d030b-0b40-44a1-b136-aef40cc4de3a.png\"><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>Investing legend Paul Tudor Jones said in a recent interview on CNBC that he is not bullish on the equities markets as he believes that an escalation in the Israel–Hamas conflict may bring about a risk-off sentiment. If that happens, it will be <a href=\"https://cointelegraph.com/news/inflation-and-war-impact-markets-paul-tudor-jones-says-i-love-bitcoin-and-gold\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/inflation-and-war-impact-markets-paul-tudor-jones-says-i-love-bitcoin-and-gold/amp\">bullish for gold and Bitcoin</a>, Jones added.</p><p>Wil bears sink Bitcoin below the immediate support and could that cause a further? Let’s analyze the charts of the top 10 cryptocurrencies to find out.</p><h2>Bitcoin price analysis</h2><p>Bitcoin sliced through the 20-day exponential moving average ($27,148) on Oct. 11 but the bears could not tug the price below the 50-day simple moving average ($26,634).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/047f5dca-3aa2-4b69-8080-0e68b13ee9f0.png\"><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bulls successfully defended the 50-day SMA on Oct. 11 and Oct. 12 but they are struggling to start a rebound. This suggests a lack of demand at higher levels. </p><p>The bears will next attempt to sink the price below the 50-day SMA and come out on top. If this level gives way, the BTC/USDT pair could retest the strong support at $26,000. This level is likely to witness aggressive buying by the bulls.</p><p>A rally above the 20-day EMA will be the first indication of strength. The pair could then climb to the stiff overhead resistance at $28,143. This is an important level to watch out for because a close above it could signal the start of a short-term up-move.</p><h2>Ether price analysis</h2><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) dipped to the critical support at $1,531 on Oct. 12 but a minor positive is that the bulls successfully held this level. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/66f5f824-5fec-4b3f-b24e-e2f6b9d99170.png\"><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AETHUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The RSI is showing signs of a positive divergence, indicating that the bearish momentum may be weakening. The bulls will try to push the price to the moving averages where the bears are again likely to mount a strong defense.</p><p>If the price turns down sharply from the 20-day EMA ($1,606), it will suggest that bears remain in command. The ETH/USDT pair could then crumble below $1,531 and start its descent word $1,368.</p><p>If bulls want to prevent the fall, they will have to kick the price above the moving averages. The pair may then climb to $1,746 where the bulls may again face strong selling by the bears.</p><h2>BNB price analysis</h2><p>BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/binance-coin-price-index\">BNB</a>) fell to the strong support at $203 but the long tail on the candlestick shows that the bulls are protecting the level with force.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/21fe99ca-7d0c-4598-a1bf-48cb8b8781a2.png\"><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABNBUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bulls will have to quickly thrust the price above the moving averages and the downtrend line to indicate that the bears may be losing their grip. The BNB/USDT pair could then start an up-move to $235 and later to $250.</p><p>On the contrary, if the price turns down from the moving averages, it will indicate that every minor rise is being sold into. A break below the $203 support will complete a descending triangle pattern, which could start a downward move to $183.</p><h2>XRP price analysis</h2><p>XRP (<a href=\"https://cointelegraph.com/xrp-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/xrp-price-index\">XRP</a>) fell below the uptrend line on Oct. 11, indicating that the bullish pressure is reducing. The drop suggests that the price will continue to oscillate between $0.41 and $0.56 for a while longer.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/dc9329bb-f06e-4723-b079-14b816beaa30.png\"><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AXRPUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>There is support at $0.46 but if it cracks, the XRP/USDT pair may tumble to the important level at $0.41. The bulls are expected to buy this dip aggressively, which could keep the range-bound action intact.</p><p>On the upside, a break and close above the moving averages will be the first sign of strength. The buyers will then make one more attempt to drive the price to the overhead resistance at $0.56. A break and close above this level will indicate the start of a new potential uptrend.</p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) slipped below the 20-day EMA ($21.72) on Oct. 12, indicating that the bears are maintaining their pressure.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/e85f07b8-8c8e-4cd8-bfbf-f3bc434ab7a5.png\"><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ASOLUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>Both moving averages have flattened out and the RSI is near the midpoint, indicating a balance between supply and demand. The bears will try to strengthen their position by dragging the price below the 50-day SMA ($20.44). If they do that, the SOL/USDT pair could slump to $17.33.</p><p>On the other hand, if the price turns up and rises above $22.50, it will tilt the short-term advantage in favor of the buyers. The pair could then rise to the neckline of the inverse head and shoulders pattern.</p><h2>Cardano price analysis</h2><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) has formed long tails on successive candlesticks since Oct. 9 but the bulls failed to start a recovery. This suggests a lack of demand at higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/2b5f6abd-d790-44be-be88-5392b8812511.png\"><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AADAUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The ADA/USDT pair is near the $0.24 support and the RSI is showing signs of a positive divergence. This suggests that the selling pressure is reducing and a relief rally is possible. The first stop on the upside is likely to be the moving averages. If this resistance is crossed, the pair may reach $0.27 and then $0.28.</p><p>Contrary to this assumption, if the price continues lower and skids below $0.24, it will indicate that the bears are in no mood to relent. That could clear the path for a fall to $0.22 and eventually to $0.20.</p><h2>Dogecoin price analysis</h2><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) has been trading below the $0.06 support since Oct. 9, suggesting that the markets have accepted the lower levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/b15d9fb6-e048-4391-86e9-cec71ba943d5.png\"><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ADOGEUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bears will try to sink the price to the vital support at $0.055. This level is likely to witness strong buying by the bulls. If the price rebounds off this level, the DOGE/USDT pair may consolidate between $0.055 and $0.06 for some time.</p><p>The downsloping moving averages and the RSI near the oversold zone indicate that bears have the upper hand. If bulls want to make a comeback, they will have to quickly propel the price above the moving averages. That could start a recovery to $0.07.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/why-is-bitcoin-price-stuck\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/why-is-bitcoin-price-stuck/amp\"><strong><em>Why is Bitcoin price stuck?</em></strong></a></p><h2>Toncoin price analysis</h2><p>Toncoin (TON) has been in a corrective phase for the past few days. Profit booking by the traders pulled the price below the 50-day SMA ($1.98) on Oct. 12.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/e06a3e59-e10e-49ba-933e-5cfea0878ca1.png\"><figcaption style=\"text-align: center;\"><em>TON/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ALTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bulls are trying to reclaim the level and push the price back above the moving averages over the next few days. If they manage to do that, it will indicate that the break below the 50-day SMA may have been a bear trap. That could open the doors for a possible rise to $2.31.</p><p>Instead, if the TON/USDT pair turns down from the moving averages, it will suggest that the sentiment has turned negative and every relief rally is being sold into. That will increase the risk of a fall to $1.60. </p><h2>Polkadot price analysis</h2><p>Polkadot (<a href=\"https://cointelegraph.com/polkadot-price-index\">DOT</a>) continued its decline in the past few days and reached near the target objective at $3.50 on Oct. 12. This level is likely to act as a solid support.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/7f9ed33e-8690-4da1-87ab-382a7c541787.png\"><figcaption style=\"text-align: center;\"><em>DOT/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ADOTUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>On the way up, the 20-day EMA ($3.95) is the key level to keep an eye on. If the price turns down from the 20-day EMA, it will signal that traders are selling on relief rallies. That could enhance the prospects of a drop below $3.50. </p><p>Contrarily, if bulls drive and sustain the price above the 20-day EMA, it will indicate that the markets have rejected the lower levels. That may trap the aggressive bears, resulting in a short squeeze toward the downtrend line.</p><h2>Polygon price analysis</h2><p>Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) continues to weaken toward the critical support at $0.49, indicating that the bulls are not risking a buy at higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/6ef03b7d-a4f2-4aea-b2ce-36ead05a0f6c.png\"><figcaption style=\"text-align: center;\"><em>MATIC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AMATICUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>In a range, traders generally buy near the support and sell close to the resistance. In this case, the bulls are likely to buy the dips to $0.49 with vigor. If the price turns up from this level with strength, the MATIC/USDT pair may reach the moving averages. </p><p>If the price turns down sharply from the moving averages, it will increase the likelihood of a break below $0.49. If that happens, the pair could plunge to $0.45. </p><p>On the contrary, a rally above the moving averages will signal that the range-bound action may extend for a few more days. </p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p>\n\n\n\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-13T19:25:00.000Z",
    "title": "European regulators assess DeFi risks, Uniswap launches Android wallet: Finance Redefined",
    "url": "https://cointelegraph.com/news/european-regulators-assess-defi-risks-uniswap-launches-android-wallet-finance-redefined",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/47e02b6a-7d01-449e-b9b8-b36bd7653100.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>EU securities regulators have their eyes on DeFi, and the top 100 DeFi tokens had mixed price action over the past week, with most trading in a tight range.</p>\n                    <p><p>Welcome to Finance Redefined, your weekly dose of essential <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> insights — a newsletter crafted to bring you the most significant developments from the past week.</p><p>In this week’s newsletter, European securities regulators have published a report on the DeFi ecosystem that lists the risks it poses to the European Union’s financial system — but also highlights the benefits of DeFi.</p><p>Uniswap has launched Android wallet beta on Google Play, with the app gaining popularity among desktop and Apple iOS users. DeFi platform Star Arena recovered 90% of stolen Avalance (<a href=\"https://cointelegraph.com/avalanche-price-index\">AVAX</a>) tokens after offering a $250,000 bounty, and Platypus Finance fell victim to another flash loan attack.</p><p>The top 100 DeFi tokens had a mixed week in terms of price action, with most of the tokens trading in the same range or slightly higher than the last week. The total value locked in DeFi protocols hit $45.67 billion.</p><h2>European regulator: DeFi comes with significant risks as well as benefits</h2><p>The European Securities and Markets Authority (ESMA) — the EU’s financial markets supervisory authority — released an article on DeFi and its risks to the EU market on Oct. 11. </p><p>In a 22-page report, the ESMA admits the promised benefits of DeFi, such as greater financial inclusion, the development of innovative financial products, and the enhancement of financial transactions’ speed, security and costs.</p><p><a href=\"https://cointelegraph.com/news/crypto-european-regulator-de-fi-significant-risks-benefits\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-european-regulator-de-fi-significant-risks-benefits/amp\"><strong>Continue reading</strong></a></p><h2>Uniswap launches Android wallet beta for Google Play</h2><p>Decentralized crypto exchange Uniswap launched a closed beta Android version of its mobile app on Oct. 12, according to a blog post from the app’s development team. Uniswap has previously only been available on PC and iOS mobile devices.</p><p>The new Android beta app allows users to select coins on different chains without switching networks. It automatically detects which network a coin is on and switches to that network without the user prompting it to. It can be used on Polygon, Arbitrum, Optimism, Base and BNB Chain currently, with more chain compatibility slated for the future.</p><p><a href=\"https://cointelegraph.com/news/uniswap-launches-android-wallet-beta-for-google-play\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/uniswap-launches-android-wallet-beta-for-google-play/amp\"><strong>Continue reading</strong></a></p><h2>Stars Arena recovers 90% of stolen funds after offering $257,000 bounty</h2><p>Web3 social media platform Stars Arena said it has recovered nearly all of the crypto stolen from an Oct. 7 exploit, minus a 10% bounty to the person responsible.</p><p>In an Oct. 11 X (formerly Twitter) post, <a href=\"https://cointelegraph.com/news/friend-tech-clone-stars-arena-drives-surge-avalanche-avax-token\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/friend-tech-clone-stars-arena-drives-surge-avalanche-avax-token/amp\">Stars Arena</a> said around 90% of the 266,000 AVAX exploited, at the time worth around $3 million, was returned after reaching an agreement to give a 27,610 AVAX bounty worth nearly $257,000 to the exploiter. The bounty also included compensation for 1,000 AVAX worth over $9,000, which the exploiter apparently lost on a bridge.</p><p><a href=\"https://cointelegraph.com/news/stars-arena-recovers-stolen-funds-after-offering-bounty-exploit\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/stars-arena-recovers-stolen-funds-after-offering-bounty-exploit/amp\"><strong>Continue reading</strong></a></p><h2>Platypus DeFi loses $2.2 million in another flash loan exploit</h2><p>DeFi protocol Platypus has lost over $2 million in assets after suffering another flash loan exploit on its platform. The protocol suspended all of its pools in response to the attack. </p><p>According to the blockchain security platform CertiK, the DeFi platform suffered three attacks, with $2.23 million taken across the exploits. On Oct. 12, the first attack took place, extracting $1.2 million from the platform. A second attack occurred hours later, stealing $575,000 worth of assets from the platform. Just a minute later, the third attack occurred, with $450,000 in assets lost.</p><p><a href=\"https://cointelegraph.com/news/platypus-flash-loan-exploit-defi\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/platypus-flash-loan-exploit-defi/amp\"><strong>Continue reading</strong></a></p><h2>Lido Finance discloses 20 slashing events due to validator config issues</h2><p>Ethereum staking protocol Lido Finance has disclosed its protocol saw 20 slashing events due to a series of infrastructure and signer configuration issues from validators operated by Launchnodes.</p><p>The incident occurred on Oct. 11 at about 3:30 pm UTC, according to Launchnodes. In an Oct. 11 post on X, Lido said Launchnodes’ validators nodes are now offline, and slashings have ceased while the root cause was being investigated.</p><p><a href=\"https://cointelegraph.com/news/lido-finance-launchnodes-validator-slashed\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/lido-finance-launchnodes-validator-slashed/amp\"><strong>Continue reading</strong></a></p><h2>DeFi market overview</h2><p>Data from <a href=\"https://pro.cointelegraph.com/users/sign_in?\">Cointelegraph Markets Pro</a> and TradingView shows that DeFi’s top 100 tokens by market capitalization had a mixed week, with most tokens trading in the green on weekly charts. The total value locked into DeFi protocols dropped to $45.67 billion.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/11c463dc-8285-4869-b4b7-82594b27cf17.png\"></figure><p>Thanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-13T21:20:07.000Z",
    "title": "Caroline Ellison’s plea deal provides extensive, but not total, immunity from future prosecutions",
    "url": "https://cryptoslate.com/caroline-ellisons-plea-deal-provides-extensive-but-not-total-immunity-from-future-prosecutions/",
    "description": "<p>A plea deal reached by Alameda and FTX associate Caroline Ellison in December provides insight on whether she will be prosecuted further. During testimony on Oct. 12, Ellison was questioned by the Assistant U.S. Attorney (AUSA) for the Southern District of New York. There, she stated that she had reached a cooperation agreement — that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/caroline-ellisons-plea-deal-provides-extensive-but-not-total-immunity-from-future-prosecutions/\">Caroline Ellison&#8217;s plea deal provides extensive, but not total, immunity from future prosecutions</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-13T20:20:18.000Z",
    "title": "‘I liked him; I trusted him’: Anthony Scaramucci describes being taken in by Sam Bankman-Fried",
    "url": "https://cryptoslate.com/i-liked-him-i-trusted-him-anthony-scaramucci-describes-being-taken-in-by-sam-bankman-fried/",
    "description": "<p>During an Oct. 13 CNBC interview, Anthony Scaramucci, the founder of SkyBridge Capital, detailed his perspectives on Sam Bankman-Fried, founder of FTX and a former business associate who now stands trial for fraud. Scaramucci provided insight into his early take on Bankman-Fried, which inspired trust and confidence over time. Immediately struck by his eccentricities and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/i-liked-him-i-trusted-him-anthony-scaramucci-describes-being-taken-in-by-sam-bankman-fried/\">&#8216;I liked him; I trusted him&#8217;: Anthony Scaramucci describes being taken in by Sam Bankman-Fried</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-10-13T21:25:24.000Z",
    "title": "Microsoft Fears Chinese Bitcoin Mines Near US Bases",
    "url": "https://cryptobriefing.com/microsoft-fears-chinese-bitcoin-mines/?utm_source=feed&utm_medium=rss",
    "description": "Microsoft sounds alarm on potential threats to national security from Chinese Bitcoin mining operation next to its data center."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-10-13T20:00:46.000Z",
    "title": "Bitcoin Spot ETF 90% Shot at Approval in January 2024: Bloomberg Analysts",
    "url": "https://cryptobriefing.com/bitcoin-etf-90-shot-approval-2024-bloomberg/?utm_source=feed&utm_medium=rss",
    "description": "Spot bitcoin ETF predicted to have 90% approval odds by January 2024 as SEC engages with sponsors, requests more details on proposed filings."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-10-13T19:28:19.000Z",
    "title": "Coinbase: IRS Seeks ‘Unlimited Tracking’ in Proposed Tax Rules",
    "url": "https://cryptobriefing.com/irs-seeks-unlimited-tracking-tax-rules/?utm_source=feed&utm_medium=rss",
    "description": "Coinbase warns proposed IRS tax rules allow unlimited tracking of Americans and overload agency with useless data on small transactions."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-13T20:30:33.000Z",
    "title": "Thorswap Resumes Service With 12 Countries Blacklisted and New Partnership to Curb Illegal Transfers",
    "url": "https://news.bitcoin.com/thorswap-resumes-service-with-12-countries-blacklisted-and-new-partnership-to-curb-illegal-transfers/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/thorswap-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Thorswap Resumes Service With 12 Countries Blacklisted and New Partnership to Curb Illegal Transfers\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/thorswap-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/thorswap-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/thorswap-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/thorswap-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/thorswap-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/thorswap-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/thorswap.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On October 6, 2023, Thorswap halted its services temporarily. However, the platform recently declared its return to full operation with some notable modifications. An array of approximately twelve countries are now barred from utilizing Thorswap, while the decentralized exchange (dex) platform&#8217;s operators disclosed a collaboration with an organization to introduce &#8220;some extra guardrails&#8221; aimed at [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T19:33:07.000Z",
    "title": "BoE’s governor teases nail-biting rate choices ahead",
    "url": "https://www.cryptopolitan.com/boe-teases-nail-biting-rate-choices-ahead/",
    "description": "Amid the unpredictable financial landscape, the Bank of England (BoE) continues its tantalizing dance with interest rates. With the world holding its collective breath, Governor Andrew Bailey recently hinted at the hair-thin margins that may determine future decisions. Walking the High Wire of Rate Decisions When one thinks of central banks, words like &#8220;daring&#8221; or ... <a title=\"BoE&#8217;s governor teases nail-biting rate choices ahead\" class=\"read-more\" href=\"https://www.cryptopolitan.com/boe-teases-nail-biting-rate-choices-ahead/\" aria-label=\"More on BoE&#8217;s governor teases nail-biting rate choices ahead\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T19:30:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T19:28:32.000Z",
    "title": "October sentiment turns negative as stock markets bleed red",
    "url": "https://www.cryptopolitan.com/october-turns-negative-stock-markets-bleed/",
    "description": "On Friday, Asian and European stock markets fell sharply, with China leading the way, as its September Consumer Price Index (CPI) showed no growth. According to market analysts, China&#8217;s dismal economic statistics may raise anxiety for the global economy. This October, consumer sentiment fell 7% as inflation fears gripped the psyche of American consumers. The ... <a title=\"October sentiment turns negative as stock markets bleed red\" class=\"read-more\" href=\"https://www.cryptopolitan.com/october-turns-negative-stock-markets-bleed/\" aria-label=\"More on October sentiment turns negative as stock markets bleed red\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-13T20:08:56.000Z",
    "title": "FTX founder Sam Bankman-Fried’s trial day 8: Recap ",
    "url": "https://crypto.news/ftx-founder-sam-bankman-frieds-trial-day-8-recap/",
    "description": "The second week of Sam Bankman-Fried’s criminal trial concluded with BlockFi CEO blaming FTX and Alameda for its bankruptcy. "
  },
  {
    "source": "BTCManager",
    "date": "2023-10-13T19:31:23.000Z",
    "title": "Madeira’s government announces an exclusive Bitcoin business hub",
    "url": "https://crypto.news/madeiras-government-announces-an-exclusive-bitcoin-business-hub/",
    "description": "Miguel Albuquerque, President of Madeira's Regional Government, has unveiled a dedicated Bitcoin business zone aimed at fostering technological innovation and global partnerships."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-13T21:00:09.000Z",
    "title": "Cardano (ADA) Addresses In Loss Rise Over 94%, Is It Time To Jump Ship?",
    "url": "https://www.newsbtc.com/news/cardano/cardano-ada-addresses-loss/",
    "description": "Cardano is down 45.6% from its yearly high of $0.4518 and is showing no signs of slowing down at the moment. Data has shown that at its current price, the majority of Cardano holders are losing money, further showing the state of the cryptocurrency&#8217;s price.  Cardano (ADA) addresses in loss is now over 94%, leaving many investors wondering if it&#8217;s time to cut their losses and move on.  Cardano (ADA) Addresses In Loss Rise Over 94% Cardano (ADA) is currently the 8th largest crypto by market cap, with a market cap of $8.65 billion. However, all metrics have pointed to the cryptocurrency losing stream and struggling to receive inflow from investors.  Related Reading: Crypto Analyst Breaks Down The Factors Behind The Bitcoin Price Decline For instance, ADA is down by 7.% in a 7-day time frame. Its trading volume has also fallen by 12.67% in the past 24 hours, showing a lack of interest in either buying or selling the cryptocurrency. Data from IntoTheBlock&#8217;s In/Out of the Money metric has shown the number of Cardano addresses in red is now at 94.15%. The metric, which shows the number of addresses making profits and losses at a cryptocurrency&#8217;s current price, shows that the number of Cardano addresses in loss is now over 4.19 million.  Many ADA investors bought in near the peak hype during its all-time high. Of the 4.19 million addresses in loss, 691,480 addresses bought between $1.59 to $2.97, and 608,590 addresses bought between $1.17 to $1.59. On the other hand, only 174,840 Cardano addresses representing 3.92% of the total addresses, are currently at a profit. Source: IntoTheBlock Whale transactions have also been quiet on Cardano&#8217;s blockchain in the past 24 hours. Another IntoTheBlock metric shows the number of transactions with a value of $100,000 or greater has been in a freefall since May.  Source: IntoTheBlock Is It Time To Jump Ship? The low profitability of ADA holders is probably surprising, given the Cardano blockchain&#8217;s popularity. According to recent data released by blockchain analytics firm Santiment, the Cardano network is still the most popular among developers.  Cardano developers have also been actively building and introducing exciting innovations to the blockchain and ecosystem. One example of these developments is the updates to its Lace wallet. Related Reading: What To Expect This Month For XRP Price According To Historical Data Cardano&#8217;s founder, Charles Hoskinson, recently dismissed rumors of issues within the blockchain. And as long as developers remain dedicated to improving the network, Cardano will continue to progress as one of the biggest cryptocurrencies.  For long-term believers in ADA, the current low price could actually be an opportunity to stock up in anticipation for the next crypto bull market.  ADA price maintains $0.24 support &#124; Source: ADAUSD on Tradingview.com Featured image from Zipmex, chart from Tradingview.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-13T20:00:04.000Z",
    "title": "Bitcoin Price Rally On The Horizon? BTC Spot ETFs May Get The Green Light Today",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-price-rally-on-the-horizon-btc-spot-etfs-may-get-the-green-light-today/",
    "description": "In what could be a pivotal day for the Bitcoin price, the last day for the US Securities and Exchange Commission (SEC) to appeal the Grayscale Bitcoin (BTC) spot Exchange-Traded Funds (ETF) decision is approaching, and the crypto community is eagerly awaiting the outcome. The implications of this decision are significant, as it could pave the way for the approval of several other spot Bitcoin ETFs.  Impending Approval Of All Proposed Bitcoin Spot ETFs?  According to crypto YouTuber Crypto Rover, if the SEC does not appeal the court&#8217;s ruling by the end of the day, it would potentially lose its ability to deny future applications, resulting in the likely approval of all proposed spot ETFs. The current list of applicants seeking approval includes prominent names such as Grayscale Bitcoin Trust, Ark/21 Shares Bitcoin Trust, Bitwise Bitcoin ETF Trust, BlackRock Bitcoin ETF Trust, VanEck Bitcoin Trust, WisdomTree Bitcoin Trust, Valkyrie Bitcoin Fund, Invesco Galaxy Bitcoin ETF, and Fidelity Wise Origin Bitcoin Trust. If all Bitcoin spot ETFs are approved, the move would mark a significant milestone in the mainstream adoption of cryptocurrencies.  Related Reading: Cardano, Solana, And Ethereum Under Heat, Data Points To More Trouble For Altcoins Accepting these financial instruments would provide investors with a regulated and easily accessible avenue to gain exposure to Bitcoin&#8217;s price movements without directly owning the underlying asset.  The approval would also vote for confidence in the cryptocurrency market, attracting institutional investors and potentially injecting fresh capital into the space. The approval of Bitcoin spot ETFs also can ignite a renewed sense of optimism and investor sentiment. The anticipation of such a development has already fueled speculation of a Bitcoin rally, with market participants eyeing a new annual high.  The thawing of the crypto winter and the approval of these ETFs could create a perfect storm for a Bitcoin price to surge, potentially breaching the $30,000 mark and beyond. Bitcoin Price Awaiting ETF Relief The largest cryptocurrency in the market is striving to reclaim the crucial $27,000 level, trading at $26,700. This level holds significant importance for bullish investors as it represents a key threshold to break the mid-term downtrend structure observed in BTC&#8217;s 1-day chart since its yearly high of $31,800 on July 13 Additionally, the failure of the Bitcoin price to hold its 200-day (yellow line) and 50-day (brown line) moving averages (MAs) as support lines is a cause for concern among bullish traders. These MAs, similar to the situation in March 2023, are currently converging. However, the potential approval of a BTC spot ETF could provide much-needed relief to Bitcoin&#8217;s price. Forming a complete rally would require overcoming various resistance levels in such a scenario. Related Reading: Failed Bullish Pattern Could Send Ethereum Sub-$1000 In the short term, Bitcoin&#8217;s price will likely face a significant obstacle at the $27,900 level, which was briefly surpassed on October 2nd. Furthermore, BTC encounters a 3-month resistance at $28,700, marking the final hurdle before reaching the $30,000 level, serving as another resistance line. Nevertheless, the community anxiously awaits the approval of BTC spot ETFs, hoping that it will bring a sense of relief and bullish momentum for investors and Bitcoin&#8217;s price.  Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-13T20:04:50.000Z",
    "title": "Polygon Pioneers Zero-Knowledge Proofs’ Transformation of Voting and Finance",
    "url": "https://www.crypto-news-flash.com/polygon-pioneers-zero-knowledge-proofs-transformation-of-voting-and-finance/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-pioneers-zero-knowledge-proofs-transformation-of-voting-and-finance",
    "description": "<img width=\"960\" height=\"540\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polygon\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg.jpg 960w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg-768x432.jpg 768w\" sizes=\"(max-width: 960px) 100vw, 960px\" />The latest report discloses that ZK-Proofs has several use cases and could be expanded to other fields.  However, there are challenges of inability to work in isolation in addition to usability, scalability, and computational complexity issues.  The popularity of Zero-Knowledge Proofs can never be questioned considering its increasing use in the crypto ecosystem. It is [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-13T19:30:03.000Z",
    "title": "Ripple’s XRP Gets a Boost: Fresh Grants for XRPL Development",
    "url": "https://www.crypto-news-flash.com/ripples-xrp-gets-a-boost-fresh-grants-for-xrpl-development/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-xrp-gets-a-boost-fresh-grants-for-xrpl-development",
    "description": "<img width=\"1000\" height=\"668\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Ripple.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Ripple.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Ripple-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Ripple-768x513.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Akarat-Phasura-Ripple-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The XRP Ledger (XRPL) community received a boost as &#8220;Wave Of Innovation,&#8221; a non-profit organization linked to the 2024 XRP Gold Coast conference, announced grants for XRPL developers. XRP&#8217;s recent price drop coincided with significant whale activity, as substantial XRP transfers were reported from anonymous wallets to major cryptocurrency exchanges. Amid the broader market sell-off, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-13T19:24:00.000Z",
    "title": "Binance’s KYC Policies Under Scrutiny After Hamas Accounts Suspended",
    "url": "https://coinedition.com/binances-kyc-policies-under-scrutiny-after-hamas-accounts-suspended/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance France Financial Report\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Binance-France-Financial-Report-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto analyst Adam Cochran sparked debate on X (previously Twitter) over Binance&#8217;s know-your-customer (KYC) policies after highlighting suspicious accounts. Replying to a post showing now-closed Binance accounts allegedly tied to the Palestinian Resistance Movement Hamas, Cochran asked how such accounts weren’t noticed if Binance has robust KYC. Some flagged names suggest Binance likely knew their [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binances-kyc-policies-under-scrutiny-after-hamas-accounts-suspended/\">Binance&#8217;s KYC Policies Under Scrutiny After Hamas Accounts Suspended</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-13T20:00:38.000Z",
    "title": "Whales Abruptly Move $749,000,000 in Bitcoin, Ethereum, XRP and Shiba Inu – Here’s Where the Crypto Is Heading",
    "url": "https://dailyhodl.com/2023/10/13/whales-abruptly-move-749000000-in-bitcoin-ethereum-xrp-and-shiba-inu-heres-where-the-crypto-is-heading/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/btc-massive-whale.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/btc-massive-whale.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/btc-massive-whale.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/btc-massive-whale.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/btc-massive-whale.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/btc-massive-whale.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/btc-massive-whale.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>New data reveals deep-pocketed crypto investors are suddenly shifting hundreds of millions of dollars worth of digital assets, including Bitcoin (BTC) and Ethereum (ETH). According to data from whale-tracking platform Whale Alert, $511 million worth of the top crypto asset by market cap just moved to the top US-based digital asset exchange Coinbase or an [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/13/whales-abruptly-move-749000000-in-bitcoin-ethereum-xrp-and-shiba-inu-heres-where-the-crypto-is-heading/\">Whales Abruptly Move $749,000,000 in Bitcoin, Ethereum, XRP and Shiba Inu – Here’s Where the Crypto Is Heading</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-13T19:55:00.000Z",
    "title": "Here’s What’s Next for Bitcoin If Past Patterns Are Prologue, According to Rekt Capital",
    "url": "https://dailyhodl.com/2023/10/13/heres-whats-next-for-bitcoin-if-past-patterns-are-prologue-according-to-rekt-capital/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Rally-Since-Dotcom-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Rally-Since-Dotcom-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Rally-Since-Dotcom-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Rally-Since-Dotcom-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Rally-Since-Dotcom-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Rally-Since-Dotcom-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Rally-Since-Dotcom-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is breaking down Bitcoin (BTC) by looking at its historical patterns. Pseudonymous crypto trader Rekt Capital tells his 359,500 followers on the social media platform X that if BTC repeats the pattern it displayed in 2019, it&#8217;s going to fall further before rebounding. &#8220;BTC&#8230; If history repeats&#8230;Green circle first. Then blue [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/13/heres-whats-next-for-bitcoin-if-past-patterns-are-prologue-according-to-rekt-capital/\">Here&#8217;s What&#8217;s Next for Bitcoin If Past Patterns Are Prologue, According to Rekt Capital</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-13T19:29:12.000Z",
    "title": "Upcoming Bitcoin Halving Unlikely To Be Bullish Catalyst, Says Crypto Analyst Nicholas Merten – Here’s Why",
    "url": "https://dailyhodl.com/2023/10/13/upcoming-bitcoin-halving-unlikely-to-be-a-bullish-catalyst-says-crypto-analyst-nicholas-merten-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/03/change-launch-bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/03/change-launch-bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/03/change-launch-bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/03/change-launch-bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/03/change-launch-bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/03/change-launch-bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/03/change-launch-bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto analyst Nicholas Merten believes Bitcoin’s (BTC) next halving will not ignite the renewed bull market that many traders and analysts expect. In a new video update, Merten tells his 512,000 YouTube subscribers that unlike many other analysts, he does not believe the BTC halving event in 2024 will spark a huge rally as past [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/13/upcoming-bitcoin-halving-unlikely-to-be-a-bullish-catalyst-says-crypto-analyst-nicholas-merten-heres-why/\">Upcoming Bitcoin Halving Unlikely To Be Bullish Catalyst, Says Crypto Analyst Nicholas Merten – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]