[
  {
    "source": "Decrypt",
    "date": "2023-06-18T13:11:58.000Z",
    "title": "'Cross the Ages' Is a Tough But Rewarding Fantasy Card Battler",
    "url": "https://decrypt.co/145012/cross-ages-tough-rewarding-fantasy-card-battler",
    "description": "REVIEW: Complex competitive game Cross the Ages lets you battle with decks of digital cards—and mint your favorites as NFTs, too."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-18T13:24:08.000Z",
    "title": "Binance CEO slams fraudulent entity in cease-and-desist letter amid Nigerian SEC battle",
    "url": "https://www.cryptopolitan.com/binance-ceo-slams-fraudulent-entity-in-cease-and-desist-letter-amid-nigerian-sec-battle/",
    "description": "Binance CEO, Changpeng Zhao, has taken a decisive stance against a fraudulent entity masquerading as Binance Nigeria Limited, revealing that a formal cease-and-desist letter has been dispatched. The move comes in response to the Nigerian Securities and Exchange Commission (SEC) issuing a circular on June 9, deeming Binance Nigeria Limited as an unlawful entity within ... <a title=\"Binance CEO slams fraudulent entity in cease-and-desist letter amid Nigerian SEC battle\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-ceo-slams-fraudulent-entity-in-cease-and-desist-letter-amid-nigerian-sec-battle/\" aria-label=\"More on Binance CEO slams fraudulent entity in cease-and-desist letter amid Nigerian SEC battle\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-18T13:23:19.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 BREAKING: Twitter to enable #crypto trading in partnership with eToro. Users searching using a $Cashtag symbol currently see live charts for a select few financial assets, like $LTC. Users will soon be able to click through to eToro &#38; have the option to invest in #Litecoin. Is Litecoin silver to Bitcoin&#8217;s ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-18T13:25:18.000Z",
    "title": "Aptos (APT) Gains 18% In The Last Week – Could A Market Reversal Finally Be On?",
    "url": "https://www.newsbtc.com/aptos-apt/aptos-apt-gains-18-in-the-last-week-could-a-market-reversal-finally-be-on/",
    "description": "Aptos (APT) has shown an impressive market performance in the last week gaining by 18.25% to emerge as one of the biggest weekly gainers on CoinMarketCap. This positive price movement is quite significant for many APT investors, as the APT market has been under bearish control for most of 2023. Related Reading: Polygon (MATIC) Witnesses High Volatility Amid Positive Developments Aptos’ Unimpressive 2023 Aptos began the year with a bang, surging by over 500% to hit its all-time high price of $18.58 on January 26. However, the prominent altcoin had since experienced a steady decline since then, with little insignificant price rises.  Due to such disappointing price movement, much concern has been over what was touted as “one of the most promising tokens of 2023”.  The Aptos project, which was launched back in October 2022, received a lot of hype coming into the crypto space.  Much of this interest was driven by the blockchain being an indirect product of the now-defunct Diem blockchain initiative. Aptos boasts various impressive features, including a unique programming language &#8211; Move &#8211; a parallel execution engine, low transaction costs, and high-level security features.  On June 10, APT was trading as low as $5.74, indicating a 69.11% decline from its ATH value in January. However, following its recent impressive performance, many investors wonder if the altcoin could actually be readying for market reversal. Based on data from CoinMarketCap, APT is trading at $7.05, with a 5.38% gain on the last day. The token’s daily trading volume has also moved by 125.76%, attaining a value of $274 million. Meanwhile, APT’s market cap is currently at $1 billion.  APT trading at $7.02 &#124; Source: APTUSD Chart On Tradingview.com Related Reading: Bitcoin Recovers Above Critical Level, Why Bulls Could Be Ready To Charge Is The Market Reversal On? As earlier stated, APT’s current bullish run led to much speculation among investors, with many hoping the token could soon return to the glorious heights seen at the beginning of the year.  This discourse is further fueled by various on-chain activities, an example of which is the gradual increase in daily user transactions on the Aptos network over the last few months.  According to data from aptscan.ai, an analytics tool native to the Aptos chain, the number of daily active daily transactions on the network moved from 75,806 on March 1 to 162,071 on June 16, yesterday.  Source: Aptscan.ai This continuous increase in adoption shows that many users have maintained their faith in the novel blockchain project despite the poor performance of its native asset.  According to popular price prediction site, Coincodex, the current investor sentiment around APT is neutral, with a Fear &#38; Greed index of 49, indicating the token may be a favorable investment at this point in time.  The team predicts APT to decline only by 0.86% in the next 5 days. They remain largely optimistic, backing an APT reversal as they project the token to hit a price of $15.32 in the next month.  However, note these predictions are not to be relied on as financial advice. All investors are admonished to do their due diligence before engaging the market.  Featured Image: Aptos Labs, Chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-18T13:30:01.000Z",
    "title": "Algorand (ALGD) with latest Meme Coin Player $HXPE Hollywood X PEPE Moonshot",
    "url": "https://www.crypto-news-flash.com/algorand-algd-with-latest-meme-coin-player-hxpe-hollywood-x-pepe-moonshot/?utm_source=rss&utm_medium=rss&utm_campaign=algorand-algd-with-latest-meme-coin-player-hxpe-hollywood-x-pepe-moonshot",
    "description": "The exhilarating world of cryptocurrency has been a veritable treasure chest of investment opportunities. In this high-stakes realm, meme coins like Hollywood X Pepe ($HXPE), Algorand (ALGD), The Sandbox (SAND), and Render (RNDR) have gained massive attention. However, our laser focus today is on one clear winner that&#8217;s creating seismic ripples &#8211; Hollywood X Pepe. [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-18T13:26:00.000Z",
    "title": "ADA Will Continue to Weaken Against BTC, Predicts Trader",
    "url": "https://coinedition.com/ada-will-continue-to-weaken-against-btc-predicts-trader/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Cardano_DEX_Volume_Reaches_ATH_Sparking_Investor_Interest_in_ADA-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Cardano_DEX_Volume_Reaches_ATH_Sparking_Investor_Interest_in_ADA-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Cardano_DEX_Volume_Reaches_ATH_Sparking_Investor_Interest_in_ADA-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Cardano_DEX_Volume_Reaches_ATH_Sparking_Investor_Interest_in_ADA-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Cardano_DEX_Volume_Reaches_ATH_Sparking_Investor_Interest_in_ADA-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Cardano_DEX_Volume_Reaches_ATH_Sparking_Investor_Interest_in_ADA-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Cardano_DEX_Volume_Reaches_ATH_Sparking_Investor_Interest_in_ADA.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In his latest crypto market analysis, crypto trader and analyst Benjamin Cowen predicted that altcoins will continue to “bleed” despite Bitcoin (BTC) standing strong. In particular, the trader believes that Cardano (ADA) may drop to as low as 400 satoshis on the ADA/BTC chart as the market enters the 3rd quarter of 2023. Cowen’s bearish [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ada-will-continue-to-weaken-against-btc-predicts-trader/\">ADA Will Continue to Weaken Against BTC, Predicts Trader</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]