[
  {
    "source": "Cointelegraph",
    "date": "2023-10-04T09:48:33.000Z",
    "title": "Bank of Korea to start CBDC infrastructure pilot ",
    "url": "https://cointelegraph.com/news/cbdc-bank-of-korea-to-start-infrastructure-pilot",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/049cd6c3-45c1-46e5-950e-db188571d3fb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The pilot will include private banks and public institutions, while the Bank for International Settlements (BIS) will support it with technical expertise.</p>\n                    <p><p>South Korea joins a growing number of nations researching central bank digital currencies (CBDCs). The Bank of Korea (BOK) will launch the pilot project, exploring the technical infrastructure for a digital currency. </p><p>The joint announcement of the CBDC pilot by the BOK, the Financial Services Commission (FSC), and the Financial Supervisory Service (FSS) was published on Oct.4. According to the document, the project will assess the viability of a future monetary system grounded on \"wholesale CBDCs.\"</p><p>The pilot will include private banks and public institutions, while the Bank for International Settlements (BIS) will support it with technical expertise. The BOK is going to test both retail and wholesale types of CBDC. Within the experimental framework of the latter, the banks will tokenize their deposits and circulate them in the network, monitored by the BOK, FSC and FSS. The live testing of the retail CBDC should begin right after the system setup in Q4 2024. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/crypto-makes-70-percent-south-korean-overseas-assets\"><strong><em>Crypto makes up 70% of South Korea’s reported overseas assets</em></strong></a></p><p>As it usually goes with the CBDC tests, the BOK notes that the exploring doesn’t equal the inevitable implementation. However, the First Deputy Governor of the FSS, Lee Myung-soon, called the pilot a step to the future monetary system:</p><blockquote>\"The BOK has persistently pursued technological research related to CBDC. This test, building upon past achievements, represents a significant step towards creating a prototype for the future monetary system.\"</blockquote><p>These words <a href=\"https://cointelegraph.com/news/cbdc-foundation-new-global-monetary-system-french-central-bank\">resonated with a statement</a> made by one of the chief executives of France’s Central Bank on Sept. 3. In his speech, Denis Beau, the first deputy governor at Banque de France, called the CBDC “the catalyst for improving cross-border payments by enabling the build-up of a new international monetary system.” </p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-04T09:44:52.000Z",
    "title": "FTX-SBF charges valid despite lack of US crypto laws, DOJ says",
    "url": "https://cointelegraph.com/news/ftx-sbf-charges-valid-despite-no-crypto-laws-doj-says",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/fc984364-3978-4157-8e26-c5f3d0890845.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sam Bankman-Fried’s counsel had argued that FTX was not located in the United States, and as SBF did follow regulatory obligations concerning FTX US, charges related to FTX international shouldn’t apply. </p>\n                    <p><p>The United States Department of Justice (DOJ) <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590940/gov.uscourts.nysd.590940.312.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> a motion in court on Oct. 4, claiming the lack of crypto regulations in the U.S. is no bar to the criminal charges made against former FTX CEO Sam Bankman-Fried (SBF).</p><p>The DOJ’s letter was filed in response to the defendant’s request for clarification and reconsideration of charges related to the misappropriation of funds in FTX. Lawyers for SBF argued that their client was “not guilty because FTX was not regulated in the United States, and he followed the rules concerning FTX US.”</p><p>The DOJ called this argument irrelevant, claiming that even though the existence of legislation may be necessary to prove a legal obligation, the lack of it does not affect whether the defendant’s victims committed money to him. The DOJ noted that the defendant’s claim about a lack of regulations related to customer funds usage is false as there are existing rules against it.</p><p>The DOJ further argued that the existing laws prohibit companies from stealing customer assets, and the defendant has been charged under the same. Furthermore, the defendant committed substantial misrepresentations to customers, as well as having stolen money from them. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/explained/sam-bankman-fried-jail-before-ftx-trial\"><strong><em>What has Sam Bankman-Fried been up to in jail?</em></strong></a></p><p>The DOJ argued that it is irrelevant to whether the defendant made substantial misstatements or omissions in the supposed “absence of clearly applicable laws or regulations.“ It cannot be proven that the wire fraud allegations are “actus reus,” meaning guilty act, regardless of whether there is regulation or not.</p><p>SBF is currently facing multiple charges of wire fraud and misappropriation of customer funds, among others. The former FTX CEO is currently <a href=\"https://cointelegraph.com/news/judge-orders-sam-bankman-fried-bail-revoked-following-allegations-witness-intimidation\">in jail for violating his bail conditions</a> and trying to influence potential witnesses. However, he has appealed — to no avail — several times to be released on bail before the trial commences. SBF’s legal team cited a lack of internet connectivity hindering his defense preparations, as well as no vegan meal options.</p><p>SBF <a href=\"https://cointelegraph.com/news/sam-bankman-fried-lawyers-appeal-decision-bail-first-amendment-issues\">faced his first day of jury trial</a> on Oct.3, with reports suggesting the trial could last as long as six weeks.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-10-04T10:02:52.000Z",
    "title": "CFTC chair wants defi regulated, says 70% of crypto assets are commodities",
    "url": "https://crypto.news/cftc-chair-wants-defi-to-be-regulated-says-70-of-crypto-assets-are-commodities/",
    "description": "The chair of the US Commodity Futures Trading Commission (CFTC) is advocating for stringent cryptocurrency regulations, particularly in the case of defi"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-04T09:51:32.000Z",
    "title": "Ethereum futures ETFs on CME begin with light trading volumes",
    "url": "https://crypto.news/ethereum-futures-etfs-on-cme-begin-with-light-trading-volumes/",
    "description": "Ethereum ETF futures on CME had a slow start, with trading below $2 million in the first 15 minutes, far less than Bitcoin ETF futures"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-04T09:56:28.000Z",
    "title": "Is Dogecoin On Life Support? Analyzing Its Recent Price Downturn",
    "url": "https://www.newsbtc.com/news/is-dogecoin-on-life-support-analyzing-its-recent-price-downturn/",
    "description": "Dogecoin (DOGE), the notoriously popular meme-inspired cryptocurrency, is facing a turbulent period that has left investors and enthusiasts pondering its fate. The central query echoing through the crypto community is a haunting one: Is Dogecoin destined for obscurity? The decline in Dogecoin&#8217;s value can be attributed to a confluence of factors, with the broader cryptocurrency market&#8217;s downturn chief among them. This overall slump has eroded confidence in the crypto sphere, and Dogecoin hasn&#8217;t been spared from the pessimism.  Over the past year, Dogecoin&#8217;s trajectory has been predominantly bearish, marked by occasional minor price surges that were unfortunately insufficient to counter the prevailing bearish sentiment. Related Reading: Shiba Inu Investors Beware: 425 Billion Tokens On The Move – Is It A Sell-Out? Market Downturn And Dogecoin&#8217;s Bearish Stint In a sobering turn of events, October witnessed Dogecoin&#8217;s price chart painting a bearish engulfing candlestick. This ominous pattern effectively wiped out gains from the previous period, signaling a somber outlook. Currently, DOGE is teetering slightly above the $0.060 horizontal threshold, reflecting the bearish undertones that have gripped the coin&#8217;s fortunes. The CoinGecko listing reports DOGE trading at $0.061033, marking a 1.6% decrease over the last 24 hours, and a modest 0.8% gain over the past seven days.  DOGE market cap currently at $8.6 billion. Chart: TradingView.com One indicator that underscores Dogecoin&#8217;s troubled waters is the Relative Strength Index (RSI). The RSI is a metric used to gauge the momentum of a cryptocurrency&#8217;s price movements. In this context, readings above 50 and an upward trend suggest that bulls hold the upper hand, while readings below 50 indicate the opposite—bearish sentiments are in play.  Unfortunately for Dogecoin enthusiasts, DOGE’s RSI recently faced rejection at the 50 mark and is on a downward trajectory, a telltale sign of a bearish trend in Dogecoin&#8217;s price. It&#8217;s worth noting, however, that amidst the gloom, an ascending support trendline in the RSI remains intact. This could hint at a glimmer of hope for Dogecoin, though the road ahead remains uncertain. DOGE price action in the last month. Source: Coingecko Global Market Worries Dogecoin&#8217;s struggles are not isolated; major cryptocurrencies across the board are grappling with similar challenges. A key concern that has gripped the market is the specter of higher interest rates potentially stalling the housing sector and pushing the global economy toward a recession. This has had a notable impact on the crypto landscape, resulting in a 3% decrease in the global cryptocurrency market capitalization, which currently stands at $1.07 trillion. Dogecoin&#8217;s recent slump has left many questioning its viability and future prospects. While the crypto market as a whole navigates choppy waters, Dogecoin finds itself caught in the undertow of uncertainty. Whether it can rise above these challenges and regain its former glory remains a question that only time will answer. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-04T09:48:21.000Z",
    "title": "How to Earn Crypto by Playing Games?",
    "url": "https://www.altcoinbuzz.io/reviews/blockchain-game-reviews/how-to-earn-crypto-by-playing-games/",
    "description": "<p>One of the most enjoyable and engaging methods is playing games that reward you with digital assets. In this article, we will explore how you can earn crypto by playing crypto games, the popular games you can start with, and the different coins you can accumulate through gaming. Popular Crypto Games Nowadays, there are a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/reviews/blockchain-game-reviews/how-to-earn-crypto-by-playing-games/\">How to Earn Crypto by Playing Games?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-04T10:07:14.000Z",
    "title": "Coin Edition Exclusive: In-Depth Interview with Laura K. Inamedinova – A Leading Voice Among Top 10 Women Entrepreneurs",
    "url": "https://coinedition.com/coin-edition-exclusive-in-depth-interview-with-laura-k-inamedinova-a-leading-voice-among-top-10-women-entrepreneurs/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/10/Interview-Laura-K.-Inamedinova.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/10/Interview-Laura-K.-Inamedinova.jpg 730w, https://coinedition.com/wp-content/uploads/2023/10/Interview-Laura-K.-Inamedinova-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/10/Interview-Laura-K.-Inamedinova-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/10/Interview-Laura-K.-Inamedinova-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/10/Interview-Laura-K.-Inamedinova-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/10/Interview-Laura-K.-Inamedinova-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/10/Interview-Laura-K.-Inamedinova-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/10/Interview-Laura-K.-Inamedinova-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/10/Interview-Laura-K.-Inamedinova-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/10/Interview-Laura-K.-Inamedinova-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/10/Interview-Laura-K.-Inamedinova-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/10/Interview-Laura-K.-Inamedinova-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/10/Interview-Laura-K.-Inamedinova-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/10/Interview-Laura-K.-Inamedinova-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/10/Interview-Laura-K.-Inamedinova-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/10/Interview-Laura-K.-Inamedinova-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Laura K. Inamedinova an award-winning entrepreneur and seasoned blockchain industry expert, brings her wealth of knowledge and experience to an exclusive in-depth interview with Coin Edition discussing an array of topics including blockchain, Web3, venture capital, marketing, and much more. 1. You&#8217;re very selective in choosing Web3 projects as an Agency Founder &#38; CEO. What [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coin-edition-exclusive-in-depth-interview-with-laura-k-inamedinova-a-leading-voice-among-top-10-women-entrepreneurs/\">Coin Edition Exclusive: In-Depth Interview with Laura K. Inamedinova – A Leading Voice Among Top 10 Women Entrepreneurs</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]