[
  {
    "source": "CryptoSlate",
    "date": "2023-08-12T14:00:53.000Z",
    "title": "Lightning network capacity decreases while number of channels grows",
    "url": "https://cryptoslate.com/lightning-network-capacity-decreases-while-number-of-channels-grows/",
    "description": "<p>The Lightning Network is a Layer-2 solution designed to address Bitcoin transactions&#8217; scalability and speed issues. It creates off-chain payment channels that allow users to conduct transactions almost instantly and at a fraction of the cost compared to traditional on-chain methods. By enabling multiple transactions to occur off-chain and only recording the final balance on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/lightning-network-capacity-decreases-while-number-of-channels-grows/\">Lightning network capacity decreases while number of channels grows</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-12T14:07:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-08-12T14:06:00.000Z",
    "title": "Terra Luna Classic Price Prediction Outperformed by this Bitcoin alternative",
    "url": "https://nulltx.com/terra-luna-classic-price-prediction-outperformed-by-this-bitcoin-alternative/",
    "description": "The cryptocurrency landscape is fast-paced, and various projects vie for attention and investor interest. While Terra Luna Classic&#8217;s price prediction might not be creating significant ripples in the market, there&#8217;s a new Bitcoin alternative capturing the spotlight with its potential to bring about substantial changes. Bitcoin Spark is generating buzz with its potential to outperform [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-12T13:50:54.000Z",
    "title": "US Bitcoin ETF Approval Could See North America’s ETF Volume Rise To 99.5%",
    "url": "https://www.newsbtc.com/news/bitcoin-etf-could-see-us-crypto-etf-volume-rise-to-99-5/",
    "description": "North America could see its share in the global trading volume for crypto-related exchange-traded funds (ETFs) grow even further if spot Bitcoin ETFs are approved in the United States, a Bloomberg analyst said. This comes after the US Securities and Exchange Commission (SEC) issued a delay letter regarding Ark Invest’s application for a spot Bitcoin ETF. In a widely-anticipated delay, the SEC is asking for new written comments on the spot Bitcoin application. Some of the issues raised by the commission include the suitability of Bitcoin as an underlying asset of an exchange-traded product, and the resistance of Bitcoin to price manipulation, amongst other things. The Ark Invest spot ETF, proposed by leading asset management firm ARK Invest in conjunction with Swiss-based 21Shares, would give investors indirect exposure to Bitcoin, the largest cryptocurrency in the market.  This recent setback has raised questions about the fate of the spot Bitcoin ETF applications of other asset management companies, including Blackrock, Valkyrie, WisdomTree, etc. Related Reading: Black Swan Author Warns Of Bitcoin Volume Slump As BTC Fails To Breach $30,000 North America&#8217;s Share Of Global ETF Trading Volume To Reach 99.5%? In the event that the spot Bitcoin ETF applications get greenlighted by the SEC, Bloomberg ETF analyst Eric Balchunas said that the North American region may see its percentage of the crypto ETF trading volumes reach 99.5%. According to his post on X (formerly Twitter), North America currently accounts for 97.67% of the total crypto ETF trading volume in the world. “If/when spot ETFs come out in the US this will likely go to like 99.5%,” Balchunas noted. In another post, the Bloomberg analyst disclosed that most of the best-performing equity ETFs in 2023 are crypto-related. At the top of this list is $WGMI, the Valkyrie Bitcoin Miners ETF, with a year-to-date return of 227%. This actively-managed fund invests in public companies in the Bitcoin mining industry, including Riot, Bitdeer, Cipher Mining, etc. Given the positive performance of these mining firms’ stocks, it is no surprise that investment products, like $WGMI, are doing well. Other top-performing crypto-related exchange-traded products on this list include the VanEck Digital Transformation ETF, with a YTD return of 182%; the Global X Blockchain ETF, which has returned 168% so far in 2023; and the Bitwise Crypto Industry Innovators ETF, also up by roughly 168% year to date. Pending Grayscale Lawsuit To Be Pivotal To Bitcoin ETF Approval In 2022, Grayscale Investments sued the SEC for rejecting the application to convert its flagship product, GBTC, into a spot Bitcoin ETF.  According to Nathan Geraci, president of the ETF Store, the final judgment in this lawsuit could prove pivotal in the race for Bitcoin exchange-traded fund.  Geraci commented on the delay of Ark Invest ETF:  It all comes down to the outcome of the Grayscale lawsuit &#38; SEC&#8217;s view of question #4 here (referring to the fourth subject the commission is seeking comments on). Related Reading: San Francisco’s SoFi Bank Reveals Significant Holdings In BTC, ETH, And DOGE Earlier in March, Grayscale argued against the commission, questioning the logic behind allowing Bitcoin futures ETFs while disapproving similar spot Bitcoin funds. Subsequently, the Grayscale legal team submitted a letter in July, urging the Securities and Exchange Commission to approve all eight applications for Bitcoin spot ETF. BTCUSDT trading at $29,418 &#124; Source: daily BTCUSDT chart on TradingView Featured image from iStock, chart from TradingView"
  }
]