[
  {
    "source": "Decrypt",
    "date": "2023-07-25T18:00:26.000Z",
    "title": "KuCoin Denies Layoffs, Says Cuts Are Result of 'Biannual Appraisal'",
    "url": "https://decrypt.co/149991/kucoin-denies-layoffs-says-cuts-are-result-of-biannual-appraisal",
    "description": "KuCoin’s clarification follows a claim that its new KYC policy is cutting into its profits."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-25T17:49:02.000Z",
    "title": "$BTC: UK Retailer Floors It By Adopting the Bitcoin Standard Following in the Steps of Michael Saylor’s MicroStrategy",
    "url": "https://www.cryptoglobe.com/latest/2023/07/btc-uk-retailer-floors-it-by-adopting-the-bitcoin-standard-following-in-the-steps-of-michael-saylors-microstrategy/",
    "description": "Flooring Hut, a UK-based online carpet and flooring retailer, has reportedly made the decision to adopt the Bitcoin standard. The company has purchased Bitcoin and added it to its balance sheet, following the lead of companies like Tesla, MicroStrategy, and Real Bedford. Flooring Hut, a UK-based company established in May 2015, operates as an online […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-25T18:00:00.000Z",
    "title": "Binance To Operate Back in Japan as PM Reaffirms Web3 Adoption",
    "url": "https://cryptodaily.co.uk/2023/07/binance-to-operate-back-in-japan-as-pm-reaffirms-web3-adoption",
    "description": "<p class=\"md-end-block md-p\">The world&rsquo;s premier crypto exchange platform is set to start operations for Japanese customers according to an announcement from CEO Changpeng Zhao in the WebX conference in Tokyo held today.</p>\n<p class=\"md-end-block md-p\">Last November 2022, Binance announced that it has acquired Japanese crypto exchange Sakura Exchange BitCoin (SEBC), an exchange registered in the Japan Financial Services Agency (JFSA). This move was the start of Binance&rsquo;s expansion to the country, and at the same signaled its commitment to work with regulators. Now, the exchange is all set to offer its full services to customers.</p>\n<p class=\"md-end-block md-p\">In the same event meanwhile, Japanese Prime Minister Fumio Kishida reaffirmed Japan&rsquo;s welcoming stance to Web3, calling it &ldquo;a new form of capitalism.&rdquo; Koichi Hagiuda, the Policy Research Council chairman of Japan&rsquo;s ruling Liberal Democratic Party (LDP), noted the party&rsquo;s ongoing efforts to create a regulatory framework for cryptocurrency in the country. </p>\n<p class=\"md-end-block md-p\">Japan has been slowly turning into a cryptocurrency hub in Asia. The LDP has recently announced a 30% tax break for companies issuing cryptocurrencies in order to improve conditions for the emerging sector. It has also published a whitepaper last March outlining the party&rsquo;s position on crypto and cursory plans of action. On top of this, Japanese firms unveiled a collaborative project to create the country&rsquo;s first metaverse infrastructure, designed to ease ordinary people into the world of digital assets. </p>\n<p class=\"md-end-block md-p\">Binance on the other hand has been looking for greener pastures as it is currently locked in a bitter legal battle with the United States Securities and Exchange Commission (SEC). Besides setting up shop in Japan, the exchange is eyeing a move to Dubai, another country noted for its pro-crypto policies. Asia looks to be the next big hub for cryptocurrency, as the U.S. attempts to crackdown on cryptocurrency exchanges.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T18:07:07.000Z",
    "title": "Binance Academy launches intermediate-level courses to boost Web3 education",
    "url": "https://www.cryptopolitan.com/binance-academy-launches-intermediate-level-courses-boost-web3-education/",
    "description": "Binance Academy, the educational arm of the world&#8217;s leading cryptocurrency exchange Binance, has announced the launch of its new intermediate online courses. Also, the rollout follows the successful debut of the beginner track in late 2022, which saw about 170,000 learners.  The intermediate track includes six comprehensive courses on blockchain, cryptocurrencies, DApps, DeFi, NFTs, and crypto ... <a title=\"Binance Academy launches intermediate-level courses to boost Web3 education\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-academy-launches-intermediate-level-courses-boost-web3-education/\" aria-label=\"More on Binance Academy launches intermediate-level courses to boost Web3 education\">Read more</a>"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-25T18:05:15.000Z",
    "title": "Quant Analyst PlanB Says Full Blown Bitcoin Bull Market Underway, Predicts BTC Overtakes Major Asset Classes",
    "url": "https://dailyhodl.com/2023/07/25/quant-analyst-planb-says-full-blown-bitcoin-bull-market-underway-predicts-btc-overtakes-major-asset-classes/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/all-signaling-end-bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/all-signaling-end-bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/all-signaling-end-bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/all-signaling-end-bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/all-signaling-end-bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/all-signaling-end-bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/all-signaling-end-bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Closely followed quant analyst PlanB says that Bitcoin (BTC) is now on its way to expanding by trillions of dollars to compete with some of the biggest asset classes. The pseudonymous analyst tells his 1.8 million Twitter followers that Bitcoin is now in the early stages of a bull market that may allow large players [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/25/quant-analyst-planb-says-full-blown-bitcoin-bull-market-underway-predicts-btc-overtakes-major-asset-classes/\">Quant Analyst PlanB Says Full Blown Bitcoin Bull Market Underway, Predicts BTC Overtakes Major Asset Classes</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]