[
  {
    "source": "CoinDesk",
    "date": "2023-10-18T10:46:32.000Z",
    "title": "EU Privacy Watchdog Takes Aim at ‘Excessive Centralization’ of Digital Euro",
    "url": "https://www.coindesk.com/policy/2023/10/18/eu-privacy-watchdog-takes-aim-at-excessive-centralization-of-digital-euro/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The central bank digital currency has met significant opposition from lawmakers worried over excessive state snooping"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-18T11:08:01.000Z",
    "title": "The Best Path to Web3 Mass Adoption Is Where Blockchain Is Critical, But Invisible",
    "url": "https://cryptodaily.co.uk/2023/10/the-best-path-to-web3-mass-adoption-is-where-blockchain-is-critical-but-invisible",
    "description": "With any new technology, there is a familiar pattern of adoption for those innovations that eventually become part of daily life.  This pattern is called Roger’s Innovation Adoption Curve."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-18T10:58:18.000Z",
    "title": "South African exchange VALR partners with Visa for crypto payments",
    "url": "https://cryptodaily.co.uk/2023/10/south-african-exchange-valr-partners-with-visa-for-crypto-payments",
    "description": "Crypto exchange VALR has announced a partnership with Visa that entails collaborating with the payments giant to open up crypto payments in South Africa as well as globally."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-18T10:50:04.000Z",
    "title": "How Web3 Can Revolutionize Booking and Refund Policies",
    "url": "https://cryptodaily.co.uk/2023/10/how-web3-can-revolutionize-booking-and-refund-policies",
    "description": "Web3 has caused those involved to view the world differently.  While they are standard foundations now, the thought of having a globally available, borderless and government-less currency would have been unthinkable just a short time ago."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T10:52:05.000Z",
    "title": "Fidelity’s Bitcoin ETF resubmission challenges SEC’s caution",
    "url": "https://www.cryptopolitan.com/fidelitys-bitcoin-etf-resubmission-challenges-secs-caution/",
    "description": "Fidelity Investments has resubmitted its application to the U.S. Securities and Exchange Commission (SEC) for the “Wise Origin Bitcoin Trust,” their anticipated Bitcoin spot ETF. This revised proposal comes as a response to the regulator&#8217;s earlier concerns. The essence of the Bitcoin ETF is straightforward. Investors can buy and sell fund shares that reflect Bitcoin&#8217;s ... <a title=\"Fidelity&#8217;s Bitcoin ETF resubmission challenges SEC&#8217;s caution\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fidelitys-bitcoin-etf-resubmission-challenges-secs-caution/\" aria-label=\"More on Fidelity&#8217;s Bitcoin ETF resubmission challenges SEC&#8217;s caution\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-18T11:00:35.000Z",
    "title": "Bitcoin Dominance Rises: Why Altcoin Buying May Need A Break",
    "url": "https://www.newsbtc.com/news/bitcoin-dominance-altcoin-buying-need-break/",
    "description": "In a recent trend evident on crypto charts, Bitcoin dominance is once again on the rise, prompting some traders and investors to rethink their strategies concerning altcoins. An in-depth analysis of the data, coupled with insights from prominent crypto analysts, unveils several compelling reasons to exercise caution when considering an altcoin purchase at this moment. Historical Precedence Bitcoin&#8217;s market dominance – its market cap relative to the entire cryptocurrency market – has historically been a leading indicator of market sentiment. If Bitcoin dominance is increasing, it means that sentiment toward altcoins is waning. In an analysis today, renowned analyst Rekt Capital has warned of this flashing signal, he shared the following chart and tweeted: BTC Dominance has left the &#8220;retest zone&#8221;. Now in the process of entering an uptrend continuation which could see BTC Dominance revisit the 58% mark for the first time in years. Over the past five months, the Bitcoin dominance saw a consolidation within the &#8216;retest zone&#8217; after it saw a 10%+ rise since the beginning of the year. BTC dominance pulled back as part of its retest which enabled altcoins to gain some momentum for a short period of time. But, like in mid-2018, BTC is now breaking above the resistance zone, suggesting that 58% could be the next target. Notably, BTC dominance peaked above 71% during the last run in 2021. Altcoin Liquidity Concerns When Bitcoin&#8217;s dominance rises, it often corresponds to reduced liquidity in the altcoin market. Reduced liquidity can lead to heightened volatility, with price swings potentially wiping out significant portions of invested capital. For investors with a risk-averse profile, such conditions might not be ideal. Related Reading: Bitcoin Thief’s Decade-Long Heist: Solving The Mystery Of The Stolen Silk Road BTC Moreover, recent interest appears to be concentrated primarily on Bitcoin. In times of capitulation and boredom, investors often seek the security and liquidity provided by Bitcoin over altcoins. A driving factor for this is that potential catalysts for the crypto market are Bitcoin-specific, like the halving and the potential approval of a spot ETF. As these events play out, Bitcoin will probably continue to outshine altcoins. More Insights From Top Crypto Analysts Joshua Lim, the former head of derivatives at Genesis Trading and former head of trading strategy at Galaxy Digital, recently weighed in on the ongoing tussle between Bitcoin and Ethereum. &#8220;ETH/BTC spot ratio is a major battleground right now,&#8221; Lim noted, adding that the rally in BTC/USD was effectively suppressing Ethereum. He highlighted a significant skew in options volume favoring Bitcoin over Ethereum, emphasizing Ethereum&#8217;s diminishing allocator interest (options volume skewed 5:1 towards BTC). Related Reading: Bitcoin Market Cap Could Rise By $1 Trillion After Spot ETFs Launch: CryptoQuant Meanwhile, Miles Deutscher, a well-regarded crypto analyst, offered a condensed perspective on the prevailing market sentiment. &#8220;We&#8217;re in the most difficult market phase&#8230; where time capitulation really starts to set in,&#8221; Deutscher remarked. He further cautioned retail participants who have been distancing themselves from the market, suggesting that this might be an inopportune moment to do so. Deutscher added, &#8220;Accept that BTC is likely to lead in the early stages of the bull run&#8230; it&#8217;s not wise to fade BTC during this period.&#8221; He recommended a &#8220;top-down approach to the market,&#8221; emphasizing a strategy that starts with the foundational assets, Bitcoin and Ethereum, before exploring other altcoins. At press time, BTC traded at $28,585. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-18T10:46:00.000Z",
    "title": "Kiyosaki Says Inflation Makes the Rich Richer",
    "url": "https://coinedition.com/kiyosaki-says-inflation-makes-the-rich-richer/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Robert-Kiyosaki-Believes-That-An-Economic-Tsunami-Is-Imminent.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Robert Kiyosaki Believes That An Economic Tsunami Is Imminent\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Robert-Kiyosaki-Believes-That-An-Economic-Tsunami-Is-Imminent.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Robert-Kiyosaki-Believes-That-An-Economic-Tsunami-Is-Imminent-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Robert-Kiyosaki-Believes-That-An-Economic-Tsunami-Is-Imminent-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Robert-Kiyosaki-Believes-That-An-Economic-Tsunami-Is-Imminent-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Robert-Kiyosaki-Believes-That-An-Economic-Tsunami-Is-Imminent-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Robert-Kiyosaki-Believes-That-An-Economic-Tsunami-Is-Imminent-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent tweet, the author of Rich Dad, Poor Dad, Robert Kiyosaki, claimed that inflation makes lower-income groups poorer while benefiting the wealthy. Kiyosaki states that inflation erodes the purchasing power of dollar savings held by the poor and middle class, who rely on these funds. Meanwhile, the rich are shielded by investing in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/kiyosaki-says-inflation-makes-the-rich-richer/\">Kiyosaki Says Inflation Makes the Rich Richer</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]