[
  {
    "source": "Cointelegraph",
    "date": "2023-12-21T04:52:11.000Z",
    "title": " Bitcoin isn’t dead: BTC obituaries fall to lowest level in a decade ",
    "url": "https://cointelegraph.com/news/bitcoin-is-dead-obituaries-fall-lowest-level-in-decade",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvZGQ5YjhiNGEtOTc4NC00ZTZmLWE1NzAtMWU5ZjE1NTk4MDA2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin may have finally stopped dying, at least in the eyes of mainstream media.</p>\n                    <p><p>Mainstream media has declared Bitcoin “dead” only seven times in 2023, its lowest frequency in ten years, according to a Bitcoin obituaries tracker.</p><p>The data <a href=\"https://99bitcoins.com/bitcoin-obituaries/\" target=\"_blank\" rel=\"noopener nofollow\">comes</a> from 99bitcoins’ BTC obituaries tracker, <a href=\"https://twitter.com/lopp/status/1737513379198050766\" target=\"_blank\" rel=\"noopener nofollow\">shared</a> by industry expert Jameson Lopp on Dec. 20 on Crypto X (Twitter). It found that Bitcoin has been declared “dead” 474 times since 2010. </p><p>However, the data shows there were only seven ‘deaths’ recorded in 2023 so far, with the most recent in when Bitcoin bull and billionaire tech investor Chamath Palihapitiya declared “Crypto is dead in America” during an April 22 episode of the <em>All-In</em> podcast.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-is-dead-obituaries-fall-lowest-level-in-decade\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-21T05:04:15.000Z",
    "title": "AI Continues to Reshape Industries and Society",
    "url": "https://www.cryptopolitan.com/ai-continues-to-reshape-industries/",
    "description": "Artificial Intelligence (AI) has emerged as a catalyst for transformative change across industries, reshaping our daily lives and propelling innovation to new heights. From healthcare to finance, transportation, and energy, AI is revolutionizing sectors in ways that were once thought impossible. This article shows the remarkable impact of AI, addressing its pivotal role in healthcare, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-21T04:39:56.000Z",
    "title": "Hong Kong’s Emergence as a Hub for Startups and AI Applications",
    "url": "https://www.cryptopolitan.com/hong-kongs-hub-startups-ai-applications/",
    "description": "In the wake of a harrowing week that included a typhoon and black rainstorm, the rescue of a missing student showcased the power of collaboration between humans and machines, particularly in the application of Information and Technology (I&#38;T) in Hong Kong. The Fire Services Department&#8217;s (FSD) use of geographic information and artificial intelligence (AI) to [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-21T04:40:28.000Z",
    "title": "Ethereum Price Struggles While Bitcoin Jumps – Why ETH Could Take Major Hit",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-struggles-bitcoin-jumps-2250/",
    "description": "Ethereum price is still struggling to climb again above $2,250 while Bitcoin broke $43,500. ETH is showing a few concerning signs and might take a major hit. Ethereum is struggling to gain pace for a move above the $2,250 resistance zone. The price is trading below $2,220 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support near $2,170 on the hourly chart of ETH/USD (data feed via Kraken). The pair could decline heavily if it stays below $2,250 for a long time. Ethereum Price Faces Hurdles Ethereum price made another attempt to clear the $2,250 and $2,265 resistance levels. However, ETH failed to settle above the $2,250 resistance. There are clearly more than two rejections noted near the $2,250 and $2,265 levels. On the other hand, Bitcoin gained pace for a move above the $43,500 resistance. This could be a warning sign for ETH bulls. The recent low was formed near $2,155 and the price is now consolidating. It is above the 23.6% Fib retracement level of the recent decline from the $2,265 swing high to the $2,155 low. There is also a key bullish trend line forming with support near $2,170 on the hourly chart of ETH/USD. Ethereum is now trading below $2,220 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $2,210 level. It is close to the 50% Fib retracement level of the recent decline from the $2,265 swing high to the $2,155 low. The next key resistance is near the $2,250 level or $2,265. A clear move above the $2,2650 zone could send the price toward the $2,320 level. Source: ETHUSD on TradingView.com The next resistance sits at $2,365. Any more gains could start a wave toward the $2,450 level, above which Ethereum might rally and test the $2,500 zone. More Losses in ETH? If Ethereum fails to clear the $2,250 resistance, it could start another decline. Initial support on the downside is near the $2,170 level and the trend line. The first key support could be the $2,120 zone. A downside break and a close below $2,120 might spark strong bearish moves. In the stated case, Ether could revisit the $2,000 support. Any more losses might send the price toward the $1,880 level in the coming sessions. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $2,170 Major Resistance Level – $2,250"
  }
]