[
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T15:43:33.000Z",
    "title": "Binance may have lied to US lawmakers, argue senators: Report ",
    "url": "https://cointelegraph.com/news/binance-may-have-lied-to-us-lawmakers-argue-senators-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/be3ed88c-f912-47bd-9ffb-4db0a929f130.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>U.S. Senators asked the Justice Department to investigate whether the crypto exchange made a false statement to Congress in a letter earlier this year.</p>\n                    <p><p>Binance may have misled lawmakers in the United States about its business dealings and relationship with its local unit in a letter sent in March, Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2023-06-08/binance-appears-to-have-lied-to-lawmakers-elizabeth-warren-says?sref=3REHEaVI#xj4y7vzkg\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> on June 8. </p><p>In a letter sent to United States Attorney General Merrick, senators Elizabeth Warren and Chris Van Hollen asked the Justice Department to investigate whether Binance made a false statement to Congress earlier this year. In a lawsuit filed on June 5, the Securities and Exchange Commission (SEC) alleged that <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">Binance's global entity and American unit</a> were commingled. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today we charged Binance Holdings Ltd. (Binance); U.S.-based affiliate, BAM Trading Services Inc., which, together with Binance, operates <a href=\"https://t.co/swcxioZKVP\">https://t.co/swcxioZKVP</a>; and their founder, Changpeng Zhao, with a variety of securities law violations.<a href=\"https://t.co/H1wgGgR5ir\">https://t.co/H1wgGgR5ir</a> <a href=\"https://t.co/IWTb7Et86H\">pic.twitter.com/IWTb7Et86H</a></p>&mdash; U.S. Securities and Exchange Commission (@SECGov) <a href=\"https://twitter.com/SECGov/status/1665779371108335618?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In March, three U.S. senators led by Elizabeth Warren <a href=\"https://cointelegraph.com/news/sen-elizabeth-warren-and-colleagues-demand-to-see-binance-s-balance-sheets\">sent a letter to Binance CEO</a> Changpeng “CZ” Zhao and Binance.US CEO Brian Shroder questioning the exchange's operations and requesting balance sheets. At that time, the senators alleged that Binance and its American arm attempted to evade local regulators, avoid sanctions, and facilitate money laundering.</p><p>Nearly three weeks later, Binance chief strategy officer Patrick Hillman <a href=\"https://cointelegraph.com/news/binance-s-response-to-u-s-senators-lacks-financials\">sent the requested documents to Congress</a> along with a 14-page letter diving into the exchange’s compliance history, recognizing previous mistakes and claiming the firm has built solid Know Your Customer and Anti-Money Laundering policies in the past years.</p><h3>Why does Binance.US independence matter?</h3><p>The independence of Binance.US from its global unity is critical for two reasons: regulatory jurisdiction and liability in the event of a failure, Syracuse University law professor Jack Graves told Cointelegraph.</p><p>\"If you don't keep them independent, then the U.S. regulators will go after Binance International and say we have jurisdiction because you are acting through the U.S. entity. And in fact, I think the SEC is looking at that,\" said Graves.</p><p>The second relevant aspect lies in the possibility of Binance.US going bankrupt. Graves noted that there is a basic principle that a corporation, and not its owners, are responsible for its debts. \"So, as long as Binance.US is fully independent, and it ends up in bankruptcy, Binance international is not obligated to pay the debts of Binance.US.\" </p><p>If the companies were commingling funds, the owners, which is Binance's global unit, would be responsible in the event of bankruptcy. \"That's why the corporate veil, in effect, provides limited liability for the owners. And a parent corporation, like Binance international, it's just like any other owner, it's protected. It's protected from liability, as long as those companies are truly independent,\" Graves continued, explaining that there may be exceptions.</p><p>On June 5, the companies issued separate responses to the SEC lawsuit. Binance's global unit claimed it had “actively cooperated with the SEC’s investigations and [...] Worked hard to answer their questions and address their concerns.\" The exchange also said: \"While we take the SEC’s allegations seriously, they should not be the subject of an SEC enforcement action, let alone on an emergency basis.”</p><p>Binance.US tweeted that the SEC’s claims are its “latest example of regulation by enforcement.” The suit “is baseless, and we intend to defend ourselves vigorously,” it continued.</p><p><a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\"><strong><em>Magazine: Tornado Cash 2.0 — The race to build safe and legal coin mixers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-08T15:53:38.000Z",
    "title": "Sui-based NemoSwap’s investors deny involvement in $3M seed round",
    "url": "https://cryptoslate.com/sui-based-nemoswaps-investors-deny-involvement-in-3m-seed-round/",
    "description": "<p>NemoSwap, a Sui-based decentralized exchange, misled the public about investors in its project as two investors named in its $3 million seed round have distanced themselves from the project. In a now-deleted statement, Nemoswap claimed it completed a funding round led by Node Venture. The DEX added that the round included nine other investors like [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sui-based-nemoswaps-investors-deny-involvement-in-3m-seed-round/\">Sui-based NemoSwap&#8217;s investors deny involvement in $3M seed round</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-08T15:58:03.000Z",
    "title": "Did SEC Gensler ask Binance for advisor job in 2019?",
    "url": "https://cryptodaily.co.uk/2023/06/did-sec-gensler-ask-binance-for-advisor-job-in-2019",
    "description": "<p>It is being alleged by Binance lawyers that Gary Gensler, current chairman of the SEC, offered his services to Binance as an advisor back in March 2019.</p>\nGensler and Binance\n<p>With Gary Gensler causing panic and mayhem in the crypto markets as he serves Binance and Coinbase with notice to sue them for alleged misdemeanours such as listing securities and failing to register with the SEC, it comes as quite some surprise to learn that he may have offered his services as an advisor to Binance four years earlier.</p>\n<p>It was reported by CNBC that Gensler had a series of conversations with Binance officials and CEO Changpeng Zhao himself in March of that year. It was alleged by Binance lawyers that Gensler was perfectly happy with discussing the role of an informal advisor for the crypto exchange.</p>\nGensler lauds Algorand\n<p>This was at a time when Gensler was teaching a blockchain course as a professor at MIT. Gensler appeared to be quite unperturbed with the crypto industry back then, and is on record as saying that most cryptocurrencies are not securities and lauded the technology of Algorand and its founder Silvio Micali, calling it &ldquo;great technology&rdquo;.</p>\n<p>Four years later, Gensler, now the chairman of the SEC, includes $ALGO, the native token of Algorand, as one of several &ldquo;securities&rdquo; that both Binance and Coinbase list on their exchanges.</p>\n<p>Given the alleged ties between Gensler, Zhao, and Binance, lawyers acting for Binance say that &ldquo;they&rsquo;d asked for his recusal from any actions regarding the company. They say they got no acknowledgement from SEC staff.&rdquo;</p>\nA 180 degree change of mind\n<p>Gensler&rsquo;s about face on crypto obviously happened once he landed the job as SEC chairman, and it does appear a little odd that he would have such a complete change of mind on the sector.</p>\n<p>It probably can&rsquo;t be argued that Gensler was a novice in financial affairs when he was said to be having discussions with Binance. By that time he had spent 18 years at Goldman Sachs as Head of Finance, had served as Assistant Secretary for Financial Markets for the US Treasury, and had completed a stint as Chairman of the CFTC.</p>\n<p>When Gensler levied all of the highly public enforcement actions against some of the most compliant companies in the crypto space, such as Kraken, Paxos, and Coinbase, he must have been fully aware of the consequences of such actions for the crypto market and for all the retail investors in these markets.</p>\nTasked with bringing crypto down?\n<p>The actions of the SEC chairman do appear to be designed to cause the maximum turbulence and damage to the crypto industry and must have caused investors to lose some part of their invested funds.</p>\n<p>Has Gensler been tasked with destroying the crypto industry in the US? Is this the plan of the Biden Administration? With the crypto industry perhaps being seen as a threat to the US banking system, this might well be a plausible assumption.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T15:52:48.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "The automatic release of new APT tokens into the open market is valued at over $50 million based on current prices. Cryptopolitan foresees risk factors moving from&#160;Bitcoin&#160;to Ethereum-specific risk factors with the increasing importance of market factors, providing evidence for a decoupling of on-chain and off-chain trading activity. So, it&#8217;s interesting to see how the ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T15:46:46.000Z",
    "title": "Senators want DoJ to probe into Binance’s Congress testimony",
    "url": "https://www.cryptopolitan.com/doj-to-probe-into-binance-congress-testimony/",
    "description": "Binance, the world&#8217;s leading cryptocurrency exchange, finds itself in hot water as U.S. Senators Elizabeth Warren and Chris Van Hollen have urged the Department of Justice (DoJ) to launch a probe into the platform&#8217;s Congressional testimony. The Senators believe that the exchange might have given misleading information to lawmakers earlier this year. This development, coupled ... <a title=\"Senators want DoJ to probe into Binance&#8217;s Congress testimony\" class=\"read-more\" href=\"https://www.cryptopolitan.com/doj-to-probe-into-binance-congress-testimony/\" aria-label=\"More on Senators want DoJ to probe into Binance&#8217;s Congress testimony\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T15:40:37.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-08T16:08:19.000Z",
    "title": "Money20/20 decrypts the future of digital payments",
    "url": "https://crypto.news/money20-20-decrypts-the-future-of-digital-payments/",
    "description": "The latest discussion from Money20/20, a leading fintech forum, brought together Myles Stephenson, Founder &#038; CEO of Modulr, Sendi Young, Europe &#038; UK Managing Director of Ripple, and David Birch, director of Consult Hyperion, to elucidate the matter further."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-08T15:59:38.000Z",
    "title": "European authorities investigate social media platforms over misleading crypto ads",
    "url": "https://crypto.news/european-authorities-investigate-social-media-platforms-over-misleading-crypto-ads/",
    "description": "Meta Platforms' Instagram, Alphabet's YouTube, TikTok, and Elon Musk’s Twitter may face regulatory action as the European consumer group BEUC has lodged a complaint with the European Commission."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-08T16:05:37.000Z",
    "title": "Bitcoin Bollinger Bands Herald Higher Volatility, What’s Next For BTC?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-bollinger-bands-herald-higher-volatility/",
    "description": "The Bitcoin price has shown a strong reaction after the lawsuits filed by the US Securities and Exchange Commission (SEC) against Binance and Coinbase, which may have surprised many. Generally, rising prices on negative news are a strong indication that the sell side is losing steam and a bottom is near. In the case of the Bitcoin price, however, there are still some anxieties hovering over the market at the moment that could mean another, possibly final, drop to the downside. For example, it is still not clear whether the U.S. Department of Justice (DOJ) will also take legal action against Binance and what impact this will have on Binance&#8217;s international business. Bullish Arguments Are Growing For Bitcoin Nevertheless, the bullish signals are mounting. As Glassnode co-founders Jan Happel and Yann Allemann write in their latest analysis, Bitcoin&#8217;s Bollinger bands pretty much reflect the current state. On the 1-day chart, BTC price remains within the accumulation zone, between the lower band and the 20-day moving average. Related Reading: Bitcoin Is Reportedly Trading At a $2k Premium on Binance.US &#8220;Which suggests that this is still a good entry point,&#8221; the co-founders of the leading on-chain analysis service say. At the same time, with reference to the chart below, the analysts warn that traders should be aware of widening bands that could herald impending higher volatility that could lead to abrupt moves. Looking at Bitcoin&#8217;s open interest, Allemann and Happel state that despite the strong reaction to the bad news, there is no clear direction for now: We believe that the price will continue to consolidate alongside open interest until we approach the FOMC and the market begins to position for the expected output. Remarkably, next week&#8217;s Fed meeting &#8211; on June 13-14 &#8211; will be the first in years without a clear consensus on the rate decision. Since the Fed started raising rates, there has been a clear consensus at every meeting. According to the CME FedWatch tool, futures show a 30% chance that rates will be raised and a 70% chance that they will not. The lack of clarity is also likely to lead to more volatility in the BTC price ahead of the decision. Related Reading: Bitcoin Retests Moving Average That Marked All Major Market Bottoms BTC recently retested the 200-week moving average (MA) at $25,306, but supply liquidity was somewhat thin here. In addition, if price goes down again, a retest of the 50-month MA at $25,898 would be very interesting, where liquidity and sentiment seem to be stronger. It is worth noting that BTC has already formed a double bottom at the 50-month MA. A triple bottom would be bullish. On the other hand, a loss of the 200-month MA would open the way to bearadise. In this respect, a few very important days await BTC in the coming week(s). A defense of the aforementioned price levels is of utmost importance. If defended, a journey to bull paradise could be next, but bulls need to turn the tables on the lower time frames. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-08T15:50:00.000Z",
    "title": "ETH’s Tumble Could Be a Serendipitous Event for Whales",
    "url": "https://coinedition.com/eths-tumble-could-be-a-serendipitous-event-for-whales/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/011-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/011-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/011-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/011.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Lookonchain, a Web3 data analysis platform reported that Cumberland, a crypto asset trading company, withdrew 8,250 ETH from Binance and 4,500ETH from Coinbase again. Concurrently, the Web3 data analysis platform also noticed that Cumberland withdrew another 20,000 ETH and 4,850 ETH earlier. So far, a total of 37,500 ETH has been withdrawn, which is worth [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/eths-tumble-could-be-a-serendipitous-event-for-whales/\">ETH’s Tumble Could Be a Serendipitous Event for Whales</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]