[
  {
    "source": "CoinDesk",
    "date": "2023-07-18T15:23:34.000Z",
    "title": "Messaging Platform Telegram Has Issued $270M in Bonds to Fund Growth",
    "url": "https://www.coindesk.com/business/2023/07/18/messaging-platform-telegram-has-issued-270m-in-bonds-to-fund-growth/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "\"I personally bought about a quarter of the new Telegram bonds,\" said Pavel Durov, the CEO of the popular but not-yet-profitable platform."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-18T15:21:09.000Z",
    "title": "Ripple Court Ruling Unlikely to Impact Celsius Wind-Up, Crypto Lender’s Counsel Says",
    "url": "https://www.coindesk.com/policy/2023/07/18/ripple-court-ruling-unlikely-to-impact-celsius-wind-up-crypto-lenders-counsel-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto securities ruling could impact pricing of CEL token but won’t affect restructuring plans, the counsel said."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-18T15:31:04.000Z",
    "title": "Coinbase CEO to Collaborate with House Democrats: Regulation Coming?",
    "url": "https://cryptobriefing.com/coinbase-collaborate-with-house-democrats/?utm_source=feed&utm_medium=rss",
    "description": "Is the United States coming closer to bridged regulation between regulators and industry leaders? Brian Armstrong, CEO of Coinbase, will convene privately with House Democrats this Wednesday, according to Democratic..."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-18T15:26:04.000Z",
    "title": "XRP: Crypto Analyst Thomas Kralow Justifies His $8-10 Medium to Long-Term Price Target",
    "url": "https://www.cryptoglobe.com/latest/2023/07/xrp-crypto-analyst-thomas-kralow-justifies-his-8-10-medium-to-long-term-price-target/",
    "description": "In a recent video, highly respected trader, educator, and crypto analyst Thomas Kralow provides a detailed analysis of XRP, justifying his medium to long-term price target of $8-$10. This blog post will provide a comprehensive summary of Kralow’s latest insights and predictions regarding XRP, in the wake of last week’s landmark ruling by Judge Analisa […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-18T15:30:40.000Z",
    "title": "Stock-to-Flow Analyst Plan B Predicts Bitcoin’s Price to Reach $40K-$50K at Halving",
    "url": "https://news.bitcoin.com/stock-to-flow-analyst-plan-b-predicts-bitcoins-price-to-reach-40k-50k-at-halving/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/planb-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Stock-to-Flow Analyst Plan B Predicts Bitcoin&#039;s Price to Reach $40K-$50K at Halving\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/planb-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/planb-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/planb-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/planb-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/planb-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/planb-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/planb.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In about nine months, expected near April 24, 2024, Bitcoin is set to experience its fourth block reward halving. Many supporters and market observers anticipate a price increase prior to the event. According to an anonymous market analyst known as Plan B, bitcoin&#x2019;s price could ascend to between $40,000 and $50,000 in the run-up to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T15:19:23.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-18T15:30:49.000Z",
    "title": "XRP Overtakes Bitcoin In Highest Weekly Trading Volume Following Legal Triumph",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-overtakes-bitcoin-in-highest-weekly-trading-volume-following-legal-triumph/",
    "description": "XRP, the native token of the Ripple network, has reportedly surpassed Bitcoin in trading volume on the weekly average. The digital asset, following a significant legal win last week, now claims 21% of all cryptocurrency trade volume over the last week. This achievement is just one of many in Ripple&#8217;s recent journey in the spotlight. Ripple&#8217;s presence in the news lately owes to a landmark court decision in its favor. The United States Securities and Exchange Commission (SEC) had initially taken legal action against the firm, accusing it of selling unregistered securities. However, a federal judge in New York has recently declared that XRP is only security when sold directly to institutional investors under specific written contracts. And when the token was sold to retail investors on crypto exchanges, it is not deemed a security. This verdict led to major cryptocurrency exchanges relisting XRP, causing a subsequent surge in demand and trading volume. Related Reading: XRP Holdings On Bitrue Exchange Surges By 300% Ripple Through The Market Last week&#8217;s court decision catalyzed a rally for XRP, as its price experienced an approximate 65% increase. The relisting on various platforms, following the victory in court, ignited significant interest in the token and pushed trading volumes to new heights. #XRP has surpassed #BTC as the highest volume asset 👀 Since last week&#8217;s court ruling, 21% of all crypto trade volume has been for XRP. pic.twitter.com/OLdTQrk1kO — Kaiko (@KaikoData) July 17, 2023 However, it is worth noting that XRP has experienced a 20% drop in value after reaching its recent peak. Yet, this has not seemed to have put a damper on the market sentiment for XRP. The recent spike in weekly trading volume highlights the increased interest and activity surrounding the token. Over the past 7 days, XRP has seen a surge of 59.4% in both its market cap and price. XRP market capitalization has spiked from a cap low of $25 billion earlier last week to as high as over $39 billion as of today. In addition, the asset&#8217;s price has also moved from as low as $0.47 earlier last week to trade above the $0.74 mark at the time of writing. The token&#8217;s present value translates to an increase of nearly 3% for the digital asset in the past 24 hours. Bitcoin&#8217;s Stumble Bitcoin, on the other hand, appears to have hit a stumbling block. Despite multiple attempts, Bitcoin has struggled to push past the $30,000 mark. Although Bitcoin remains a leading actor in the cryptocurrency market, XRP&#8217;s recent surge in weekly trading volume has momentarily eclipsed Bitcoin&#8217;s longstanding volume dominance. Related Reading: BTC Price Analysis: Why Is Bitcoin Down Today? Over the past 24 hours, Bitcoin has surpassed and also slipped below the $30,000 mark. Particularly, the largest asset by market capitalization currently has a 24-hour high of $30,290 and a 24-hour low of $29,792. This price action has shown how the asset has thrived to break above the $30,000 resistance. Meanwhile, in the past few days, BTC&#8217;s market cap has seen a decline of over $30 billion. The asset&#8217;s market cap has plunged from $591 billion seen last Tuesday to a valuation of approximately $579 billion, as of today. Featured image from Unsplash, Chart from TradingView"
  }
]