[
  {
    "source": "Cryptopolitan",
    "date": "2023-10-22T08:32:26.000Z",
    "title": "Harnessing AI to Promote Diversity on College Campuses",
    "url": "https://www.cryptopolitan.com/ai-to-promote-diversity-on-college-campuses/",
    "description": "In recent years, artificial intelligence (AI) has been making significant strides in various sectors, and higher education is no exception. A groundbreaking study by a PhD student at the University of Pennsylvania, Benjamin Lira Luttges, and a team of nine other researchers, demonstrates how AI can play a pivotal role in diversifying college campuses. The ... <a title=\"Harnessing AI to Promote Diversity on College Campuses\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-to-promote-diversity-on-college-campuses/\" aria-label=\"More on Harnessing AI to Promote Diversity on College Campuses\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-22T08:24:24.000Z",
    "title": "NVIDIA CEO Reacts to US Policies: China Ban Will Have an Impact, But Company Will Continue to Work With Chinese Customers",
    "url": "https://www.cryptopolitan.com/nvidia-ceo-reacts-to-us-policies-china-ban-will-have-an-impact-but-company-will-continue-to-work-with-chinese-customers/",
    "description": "NVIDIA, the global leader in graphics processing units (GPUs), is facing significant challenges as it navigates the ever-evolving landscape of US trade policies and export restrictions on AI chips to China. In a recent interview, CEO Jensen Huang expressed his concerns about the adverse effects of these new policies on NVIDIA&#8217;s presence in the mainland ... <a title=\"NVIDIA CEO Reacts to US Policies: China Ban Will Have an Impact, But Company Will Continue to Work With Chinese Customers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nvidia-ceo-reacts-to-us-policies-china-ban-will-have-an-impact-but-company-will-continue-to-work-with-chinese-customers/\" aria-label=\"More on NVIDIA CEO Reacts to US Policies: China Ban Will Have an Impact, But Company Will Continue to Work With Chinese Customers\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-22T08:21:37.000Z",
    "title": "Dorset Council to Pilot AI Socks for Enhanced Care in Care Homes",
    "url": "https://www.cryptopolitan.com/dorset-council-to-pilot-ai-socks-for-enhanced-care-in-care-homes/",
    "description": "Dorset Council is set to pioneer cutting-edge artificial intelligence (AI) technology in care homes to provide a higher level of support and comfort for individuals with dementia or autism. The groundbreaking initiative, part of the Dorset Integrated Care System, will introduce a revolutionary AI sock to detect distress signals and vital physiological data. These &#8220;Smart ... <a title=\"Dorset Council to Pilot AI Socks for Enhanced Care in Care Homes\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dorset-council-to-pilot-ai-socks-for-enhanced-care-in-care-homes/\" aria-label=\"More on Dorset Council to Pilot AI Socks for Enhanced Care in Care Homes\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-22T08:19:43.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 How much is MATIC worth? Today, the price of Polygon (MATIC) stands at $0.565, experiencing a 24-hour trading volume of $237 million. The cryptocurrency has a market capitalization of $5.2 billion and accounts for 0.41% of the market dominance. Over the past 24 hours, MATIC’s price has surged by 2.82%. Currently, ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-22T08:30:18.000Z",
    "title": "Bitcoin SV (BSV) Erects A Solid 64% Growth In Just A Week – What’s The Story?",
    "url": "https://www.newsbtc.com/news/bitcoin-sv-bsv-erects-a-solid-64-growth-in-just-a-week-whats-the-story/",
    "description": "Following its inclusion in Binance&#8217;s futures trading options, one of the top global cryptocurrency exchanges, Bitcoin SV (BSV) saw a significant 64% gain in value this week. After splitting out from Bitcoin Cash (BCH) in late 2018, BSV is now trading at $54.02, a significant increase from $34.08 just a week earlier. On Saturday, BSV reached a significant peak of over $58 on prominent spot markets. The last instance in which BSV was observed trading above $58 occurred in mid-September 2022. Since its notable surge on September 27th, the price of the crypto has experienced a substantial increase of more than 90%. The price of Bitcoin SV reached an all-time high of $491.64 during the previous bull run. However, the market crashed, sending the coin tumbling more than 95%. Following rumors of the adoption of a Bitcoin ETF, the price of BSV has begun to move bullishly and is currently trading at an 89.19% discount to its previous ATH. BSV price rally in the last week. Source: Coingecko Bitrue, a widely used centralized exchange platform, has recently included BSV in its USDT pair and initiated a promotional campaign offering a $1,000 welcome bonus. This exchange is notably favored by the XRP and Ripple communities. 🔥 New listing $BSV is coming to #Bitrue spot trading. 🔹 Deposit opened 🔹 BSV/USDT pair 🔹 Trading starts at 12:00 UTC, 19 October 🎁 New users can claim a welcome bonus of 1000 $USDT Details: https://t.co/o8eBXZrl9E pic.twitter.com/2O7qmZehVX — Bitrue (@BitrueOfficial) October 19, 2023 Related Reading: Solana On Fire With Over 34% Rally Within A Week – Details Bitcoin SV: Reclaiming Satoshi&#8217;s Vision With Larger Blocks Bitcoin SV (BSV), designed as a peer-to-peer electronic cash system, asserts that it embodies the original vision of Bitcoin&#8217;s creator, Satoshi Nakamoto, despite the controversial claim made by its creator, Australian computer scientist Craig Wright, who many in the crypto community dispute. BSV seeks to address the efficiency issues seen in Bitcoin (BTC) and Bitcoin Cash (BCH) by substantially increasing block size to minimize transaction fees. In the beginning of the year, BSV coin was trading in the range of $39.50 to $44.75 until March, after which it saw a decline and traded between $34.90 and $39.40 until May. This was followed by relatively minor fluctuations before another drop, where the price ranged from $29 to $34.90. BSV market cap at $1.07 billion on the weekly chart: TradingView.com In June, BSV reached an all-time low, but later gained momentum, surging and subsequently facing rejection around $56.47, resulting in a 50% drop. The coin then traded between $34.93 and $39.54 for a period, followed by another decline. Related Reading: Stacks (STX) Rockets 26% Higher In A Single Week: The Factors At Play BSV Price Surge Tied To SEC ETF Speculation, Intra-Community Disputes A sudden increase in the value of Bitcoin SV (BSV) has occurred recently, and some analysts have linked it to the possibility that the U.S. SEC may approve a spot Bitcoin ETF. Given the current disputes within the BSV community—Christen Ager-Hanssen, a well-known BSV supporter, resigned as CEO of nChain due to a disagreement with BSV leader Craig Wright—this demonstration is significant. In summary, the future trajectory of the BSV price is contingent upon the successful breach of the significant resistance level at $56.48 by bullish market forces. This breakthrough has the potential to entice fresh investors and then challenge the higher barrier level at $61.99. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from The Cryptonomist"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-22T08:30:41.000Z",
    "title": "Crypto Market Analysis: Ethereum (ETH), Kangamoon (KANG) and VeChain Showing Bullish Signs",
    "url": "https://www.crypto-news-flash.com/crypto-market-analysis-ethereum-eth-kangamoon-kang-and-vechain-showing-bullish-signs/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-market-analysis-ethereum-eth-kangamoon-kang-and-vechain-showing-bullish-signs",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-2023-10-22T100507.227.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-2023-10-22T100507.227.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-2023-10-22T100507.227-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Amid the current bearish market, notable tokens that have shown resilience and unwavering strength are Ethereum (ETH), VeChain (VET), and Kangamoon (KANG). On the one hand, Ethereum and VeChain have demonstrated strength in the face of recent fluctuations. On the other hand, Kangamoon, a new player in the crypto space, is experiencing a surge in [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-22T08:18:26.000Z",
    "title": "3 UNDER The RADAR Crypto Altcoins GROWING RAPIDLY!",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/3-under-the-radar-crypto-altcoins-growing-rapidly/",
    "description": "<p>Under the radar. That can be a couple of different things. It can mean undervalued or underappreciated. It can also mean it’s doing cool stuff but being ignored. And in today’s case, we have 3 altcoins going through one or more of these. There is a famous trading sentiment of sell when people are buying [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/3-under-the-radar-crypto-altcoins-growing-rapidly/\">3 UNDER The RADAR Crypto Altcoins GROWING RAPIDLY!</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]