[
  {
    "source": "CoinDesk",
    "date": "2023-07-25T14:28:57.000Z",
    "title": "Optimism Tokens Worth $36M to Be Unlocked on Sunday; OP Slides 3.5%",
    "url": "https://www.coindesk.com/business/2023/07/25/optimism-tokens-worth-36m-to-be-unlocked-on-sunday-op-slides-35/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Layer-2 blockchain Optimism is set to unlock $36 million worth of tokens on Sunday, and the anticipated increase in supply spurred a 3.5% slump in the blockchain's native token (OP) on Tuesday."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-25T14:30:00.000Z",
    "title": "Cosmos Hub (ATOM) Price Prediction: Investors Choose Uwerx (WERX) Over Gala (GALA)",
    "url": "https://cryptodaily.co.uk/2023/07/cosmos-hub-atom-price-prediction-investors-choose-uwerx-werx-over-gala-gala",
    "description": "<p class=\"s5\">Uwerx is a soon-to-launch blockchain-based freelance project that has quickly become the most sought-after project by investors. Since the start of its presale, Uwerx's innovative features have propelled it forward. </p>\n<p class=\"s5\">The project has continued to sell out fast at each presale, leading the developers to increase the token allocations to accommodate more users. </p>\n<p class=\"s5\">This article will examine Uwerx's success and highlight what analysts predict for Cosmos Hub (ATOM) and &nbsp;Gala (GALA). </p>\nCan Uwerx (WERX) Continue On Its Winning Path?\n<p class=\"s5\">Despite being only two months into its presale, Uwerx has recorded huge wins. These wins have attracted 5,546 signups, 1,620 Twitter followers, and 1,685 Telegram members to the project. Priced at just $0.041/WERX, Uwerx has become a great opportunity for investors to make massive profits in the coin market. </p>\n<p class=\"s5\">The project is gearing up to run a test airdrop which experts believe will further engage Uwerxholders. This test airdrop was voted for by 98.2% of the Uwerx community, and the Uwerx team considers it a means to ensure that users entered the correct Receiving Wallet addresses.</p>\n<p class=\"s5\">Uwerx's presale exceeded everyone's expectations, leading the Uwerx team to modify the project's token allocation. Uwerx now offers 57% of the 750 million total token supply, representing 427,500,000 tokens. The team also increased the project's launch price to $0.095 - $0.115. </p>\n<p class=\"s5\">Uwerx's presale success is primarily due to the agile methodology approach that its developers adopted. It allowed them to release Uwerx in stages while making improvements with time.</p>\n<p class=\"s5\">Committed to serving its community, the Uwerx team locked developers' liquidity for 25 years on June 7, 2023, following 82.8% of the Uwerx community voting for it.</p>\n<p class=\"s5\">Uwerx aims to revolutionize the freelance industry by offering decentralization and low transaction fees at a 1% rate compared to traditional freelance platforms. It will offer transparent pricing, innovative earning opportunities, collaborative tools, and faster transactions. These features have set Uwerx apart and positioned it as the best option in the ever-growing freelancing industry. </p>\n<p class=\"s5\">According to a 2022 Forbes survey, 80% of U.S. employees are attracted to freelancing. This suggests that the freelance market will receive an influx of new freelancers, and Uwerx aims to get a huge share of that market.</p>\n<p class=\"s5\">The Uwerx team also introduced a feature called the Uwerx Vault. This feature allows users to save WERX tokens for a desired period. </p>\n<p class=\"s5\">Additionally, Uwerx has already launched the Alpha Version of its platform, giving users access to some of its key features, including the Landing, Sign-up, Login, Forgot Password, Hiring Dashboard, Freelancer/Client Initiation, The Initial Step of Job Creation and Initial Step of Finding Talent, My Activity, and Job Creation Process pages. </p>\n<p class=\"s5\">The team has announced that they will be launching additional functionalities soon. This has caused excitement among users already anticipating the release of the platform's Beta version. Additionally, the latest news that the team will introduce referral bonuses soon has added to investors' excitement.</p>\n<p class=\"s5\">Uwerx urges users to share their suggestions and recommendations through the dedicated email address feedback@uwerx.network. This will enable users to contribute to enhancing the platform.</p>\nInvestors Are Unsure If Cosmos Hub (ATOM) Will Rise Again\n<p class=\"s5\">Since 2021, Cosmos Hub (ATOM) has been making considerable progress in the coin market. However, the project has been falling in the last one month. Cosmos Hub (ATOM) is trading at $10.21, representing a -21.51 decline in the past month. The story has been the same for the last seven days as Cosmos Hub (ATOM) declined by -6.79. </p>\n<p class=\"s5\">The main aim of Cosmos Hub (ATOM) is to facilitate faster, cheaper and more scalable transactions. The project focuses on sovereignty and sustainability and facilitates interoperability between blockchains. </p>\n<p class=\"s5\">Cosmos Hub (ATOM) recorded important partnerships last month, notably with Stride. This partnership with Stride saw Cosmos Hub (ATOM) taking home 15% of STRD inflationary staking rewards, 15% of transaction fees and 15% of MEV revenue. </p>\n<p class=\"s5\">As Cosmos Hub (ATOM) enters the second week of June, holders expect more partnerships which could drive the price of Cosmos Hub up. Analysts predict the project will trade at $19.31 by the second quarter of 2024. </p>\nHow Will Gala (GALA) Perform This Month\n<p class=\"s5\">Last month was an eventful one for Gala (GALA). The project released the second version of the GALA token, which brought in more investors. Gala (GALA) also partnered with BitkubAcademy to develop educational content in the Web 3.0 industry. They also conducted the V2 airdrop and burned almost 21 billion GALA (GALA) tokens worth more than $637 million. These moves put investors' minds at ease and renewed their trust in the Gala (GALA) project. </p>\n<p class=\"s5\">Also in May, Gala Games partnered with PokerGo to build a Web3 social poker game. Gala (GALA) holders believe this partnership will lead to more exposure for Gala (GALA). </p>\n<p class=\"s5\">Despite these developments, Gala (GALA) entered the month of June declining in price. The project decreased by -37.8% in the last month. Gala (GALA) trades at $0.028, representing a 4.82% increase in the past 24hrs. Analysts predict the project will reach $0.051 by the second quarter of 2024.</p>\n<p class=\"s5\">This prediction is very little compared to what analysts predict for Uwerx. They are convinced that Uwerx has what it takes to surpass $2.50 by January 2024. As such, many investors are rushing to buy WERX tokens for the low price of $0.05245. </p>\n<p class=\"s5\">Knowing that the project has undergone InterFi Network and SolidProof audits, investors are confident that their funds are safe.</p>\nYou can join the Uwerx presale and enjoy the 15% purchase bonus using the links below:\n<p class=\"s5\">Presale: invest.uwerx.network</p>\n<p class=\"s5\">Telegram: https://t.me/uwerx_network</p>\n<p class=\"s5\">Twitter: https://twitter.com/uwerx_network </p>\n<p class=\"s5\">Website: https://www.uwerx.network</p>\n<p class=\"s5\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-25T14:30:00.000Z",
    "title": "Neo (NEO) and Polkadot Look Bearish As Tradecurve’s Gets Massive Support From The Bulls",
    "url": "https://cryptodaily.co.uk/2023/07/neo-neo-and-polkadot-look-bearish-as-tradecurves-gets-massive-support-from-the-bulls",
    "description": "<p class=\"s6\">As the crypto market is evolving rapidly, investors are looking for stable projects for investments. The market value of Tradecurve (TCRV) is projected to soar by 80x in 2023. On the contrary, Neo (NEO) and Polkadot (DOT) are witnessing an erosion in their investor base. </p>\n<p class=\"s6\">Therefore, Tradecurve&rsquo;s presale has become a huge hit from the very first day of its launch due to its stable and growth-bound business roadmap.</p>\n<p>&gt;&gt;Register For The Tradecurve Presale&lt;&lt;</p>\nNeo (NEO) Launches Neo Compounder\n<p class=\"s6\">Neo (NEO) has recently taken measures to expand its universe, and protect its price from falling. The price of Neo (NEO) has been on a free fall for the last few weeks, and has plummeted by 10% in the past 7 days. As a result, the trading price of Neo (NEO) has come down to $10.82, which is about 95% below its peak price of $196.85. </p>\n<p class=\"s6\">To break this bearish momentum, Neo (NEO) recently announced that Neo Compounder has been made live. According to the project developers, Neo Compounder will auto-compound users&rsquo; GAS rewards into more NEO tokens. Analysts believe that this development will incentivize users to increase their activity on the Neo (NEO) network. </p>\n<p class=\"s6\">This, in turn, can help the Neo (NEO) network register a positive growth rate in the coming weeks. </p>\nPolkadot (DOT) Tops GitHub Commit Rankings\n<p class=\"s6\">Polkadot (DOT) recently bagged the top spot in GitHub commit rankings. According to data from Santiment, Polkadot was ranked first in the list of the top 20 fastest-developed crypto assets. The top position on the list indicates that the level of development activity on the Polkadot network has been higher than other blockchains. </p>\n<p class=\"s6\">As per experts, high development activity can boost investors&rsquo; confidence in the Polkadotnetwork, as it hints about an upcoming surge in the value of DOT tokens. In another event, the social network, MeWe, recently integrated with the Polkadot ecosystem. This can also increase the user base of Polkadot. Currently, Polkadot is trading at $5.91, after suffering a fall of 7% in the last week. </p>\n<p>&gt;&gt;Register For The Tradecurve Presale&lt;&lt;</p>\nTradecurve (TCRV) Eyes Big Jump During Presale\n<p class=\"s6\">The ecosystem and dominance of the crypto market are expanding at a fast pace. The number of crypto traders is expected to cross 994 million in the next four years. Tradecurve, a new Web3 platform, is tapping this huge market with an ingenious business roadmap and platform.</p>\n<p class=\"s6\">It is expected to emerge as one of the world&rsquo;s top three trading exchanges. It is a blockchain-based trading platform that enables users to access a wide range of assets, enjoy complete anonymity, and trade at lower fees.</p>\n<p class=\"s6\">The trading platforms currently available in the market are either dedicated to only cryptocurrencies (Huobi and KuCoin), or exclusively deal with the trade of conventional derivatives (TD Ameritrade). </p>\n<p class=\"s6\">But Tradecurve (TCRV) allows the trading of cryptocurrencies, stocks, Forex, commodities, ETFs, bonds, and more, on the same platform, and from a single account.</p>\n<p class=\"s6\">Its presale is currently live, and the price of TCRV tokens is set at $0.025 (up a huge 150% already). It is predicted to increase by 80x during the presale phase, and 100x after being listed on Uniswap and multiple CEXs.</p>\nFor more information about the Tradecurve (TCRV) presale:\n<p>Click Here For Website</p>\n<p>Click Here To Buy TCRV Presale Tokens</p>\n<p>Follow Us Twitter</p>\n<p>Join Our Community on Telegram</p>\n<p class=\"s6\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-25T14:30:00.000Z",
    "title": "Neither Litecoin (LTC) Nor Binance (BNB), Experts’ Favorite Is Tradecurve (TCRV)",
    "url": "https://cryptodaily.co.uk/2023/07/neither-litecoin-ltc-nor-binance-bnb-experts-favorite-is-tradecurve-tcrv",
    "description": "<p class=\"s5\">After the collapse of the FTX Exchange, and the bankruptcy of big banks like Silvergate Capital and Silicon Valley Bank, investors have become skeptical about most crypto projects, including Litecoin (LTC) and Binance (BNB). Hence, they have started to shift toward Tradecurve(TCRV), a new crypto project.</p>\n<p class=\"s5\">Investors in these projects have been on the losing side for quite a long time. Due to its novel features and huge growth potential, Tradecurve has been able to attract thousands of investors, who are looking at the project for long-term growth.</p>\n<p>&gt;&gt;Register For The Tradecurve Presale&lt;&lt;</p>\nLitecoin (LTC) Sees Increase In Trade Volume\n<p class=\"s5\">Litecoin (LTC) recently received positive support after the US regulators termed it a commodity. The development has come as a major relief for Litecoin, which is awaiting a halving event. It is also an encouraging development for the Litecoin community as the token is still 79% down from its peak price of $412.96.</p>\n<p class=\"s5\">Besides, Litecoin earlier launched its Litecoin Card Program across Europe to increase its adoption rate. This has benefited Litecoin as the number of transactions on the platform has seen an uptick in the past month. Subsequently, the price of Litecoin has witnessed a rise of 9% in the last month. Currently, Litecoin is changing hands at $86.22.</p>\n<p>&gt;&gt;Register For The Tradecurve Presale&lt;&lt;</p>\nBinance (BNB) Accused of Serious Irregularities\n<p class=\"s5\">The US Commodities Futures Trading Commission (CFTC) has filed a lawsuit against Binance(BNB) that could have serious repercussions on the world&rsquo;s largest cryptocurrency exchange. Binance has been falling on the price chart for the past many days. The trading price of Binancehas fallen by over 1% in the last week.</p>\n<p class=\"s5\">As a result, Binance is currently available to trade at $329.15. According to the lawsuit, Binancehas flouted many regulations, including those related to anti-money laundering and KYC. Along with Binance exchange, its CEO, Changpeng Zhao, has also been named in the lawsuit. Market analysts believe if the charges against Binance are proven, the exchange could cease to exist in the market.</p>\n<p>&gt;&gt;Register For The Tradecurve Presale&lt;&lt;</p>\nTradecurve (TCRV) Brings New Excitement to the Market\n<p class=\"s5\">There are nearly 600 cryptocurrency exchanges worldwide, but none of them are as inclusive as Tradecurve (TCRV), which is a new Web3 trading platform. It is an all-in-one platform that facilitates the trading of cryptocurrencies, OTC derivatives, stocks, bonds, CFDs, Forex, and other commodities, on a single interface.</p>\n<p class=\"s5\">Notably, the FX market is the world&rsquo;s largest single market with a daily trading volume of $7.5 trillion. Besides, revenue in the cryptocurrency market is projected to amount to $37.87 billion in 2023. Given such a massive market base, the project has become a favorite investment destination of market bulls.</p>\n<p class=\"s5\">Unlike existing crypto exchanges like Coinbase and Binance, which require users to be verified and disclose their personal data, Tradecurve helps people finalize trades without the KYC process. It ensures the anonymity and privacy of users using DeFi capabilities. </p>\n<p class=\"s5\">TCRV token holders will receive a range of benefits, such as discounts and staking rewards. The project has begun its presale with an initial price of $0.018. Market pundits forecast that TCRV&rsquo;s price is set to increase by80x by the end of the presale phase. </p>\n<p class=\"s5\">Moreover, if you lock your tokens now, you can bag a 100x profit by the end of 2023. Interestingly, Tradecurve&rsquo;s presale growth projections are significantly higher than that of Binance and Huobi. </p>\n<p class=\"s12\">To find more information about Tradecurve and the TCRV token, visit the links below:</p>\n<p class=\"s5\">Website: https://tradecurve.io/</p>\n<p class=\"s5\">Buy presale: https://app.tradecurve.io/sign-up</p>\n<p class=\"s5\">Twitter: https://twitter.com/Tradecurveapp</p>\n<p class=\"s5\">Telegram: https://t.me/tradecurve_official</p>\n<p class=\"s5\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-25T14:30:47.000Z",
    "title": "Rare 2010 Bitcoin Block Reward Stirs After 13 Years of Dormancy",
    "url": "https://news.bitcoin.com/rare-2010-bitcoin-block-reward-stirs-after-13-years-of-dormancy/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/2010-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/2010-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/2010-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/2010-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/2010-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/2010-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/2010-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/2010.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On July 24, 2023, a block reward from 2010 was transferred for the first time in 13 years, marking this month&#x2019;s first expenditure of dormant bitcoin from that year. So far this year, a total of nine such block rewards from the 2010 era have been spent, resulting in the transfer of 450 bitcoins. 2010 [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T14:36:52.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the series of delisting fuelled by the ongoing United States SEC crackdown on major crypto platforms. Basically, it&#8217;s crypto winter in the summer as it stands. How do Cardano Price Prediction analysts steer in this turbulent crypto weather? ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T14:15:07.000Z",
    "title": "NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?",
    "url": "https://www.cryptopolitan.com/near-price-prediction/",
    "description": "NEAR Price Prediction 2023-2032 Near Protocol (NEAR) is a blockchain platform with significant attention and partnerships within the cryptocurrency industry. Initially established by a small team in San Francisco, NEAR Protocol has rapidly expanded its influence and formed collaborations with industry giants. As a result, it has witnessed a consistent upward trajectory since its inception. ... <a title=\"NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-price-prediction/\" aria-label=\"More on NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-25T14:28:01.000Z",
    "title": "How Golden Cask Club (GCC) Could Be The Best Crypto To Invest In, Outpacing ApeCoin (APE) and Litecoin (LTC)",
    "url": "https://nulltx.com/how-golden-cask-club-gcc-could-be-the-best-crypto-to-invest-in-outpacing-apecoin-ape-and-litecoin-ltc/",
    "description": "As the world of cryptocurrencies continues to expand, investors are always on the lookout for the next big thing. With the launch of its presale, Golden Cask Club (GCC) has emerged as a unique investment opportunity that could outpace well-established cryptocurrencies like ApeCoin (APE) and Litecoin (LTC). Golden Cask Club’s (GCC) new cryptocurrency offers a [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-25T14:39:53.000Z",
    "title": "Whale buys PEPE coins worth $6.7m despite price decline   ",
    "url": "https://crypto.news/whale-buys-pepe-coins-worth-6-7m-despite-price-decline/",
    "description": "A crypto whale has purchased $6.7 million of PEPE in the last 38 hours. The win rate was 33%.  Crypto whales are taking advantage of the decline in Bitcoin (BTC) and other cryptocurrencies to execute large trades.  In the latest&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-25T14:27:14.000Z",
    "title": "Binance to launch Japanese crypto services in August",
    "url": "https://crypto.news/binance-to-launch-japanese-crypto-services-in-august/",
    "description": "Binance will re-enter the Japanese market for the first time since 2018 following its November 2022 acquisition of Sakura Exchange BitCoin. Crypto exchange titan Binance will launch fully compliant digital asset services for users in Japan by August after the&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-25T14:20:01.000Z",
    "title": "Ripple’s XRP almost doubled in 2023",
    "url": "https://crypto.news/ripples-xrp-almost-doubled-in-2023/",
    "description": "Ripple's XRP sales surge in 2023, reaching 2.22 billion XRP. A 37% increase compared to last year. Bullish sentiment and cautious concerns arise."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-25T14:33:56.000Z",
    "title": "Ripple’s XRP Sales Jump Significantly In 2023, But Is This Bearish For The Altcoin?",
    "url": "https://www.newsbtc.com/analysis/xrp/ripple-xrp-sales-jump-in-2023/",
    "description": "Ripple’s sales in 2023 have caused mixed feelings for members of the Ripple community, with many considering it bullish for the network while others see it as detrimental to XRP’s price action.  What Has Happened With Ripple’s Sales? Compared to 2022, Ripple sold 37% more XRP per month in 2023, and a recent tweet by Mr. Huber, an influencer in the XRP community, drew many’s attention to this development.  Related Reading: Elon Musk Incorporates Dogecoin Symbol In Twitter Bio, Triggering 5% Increase In Price &#8220;Ripple sold 2.22 billion XRP since 2023 started. That&#8217;s about 315 million per month. About 50% more than the usual 200 million in 2022. Now the crying is about to start. But I can reassure you. It is not XRP Tards who have bought these 2.2 billion XRP and XRP has outperformed anyway. No matter what you feel,&#8221; Huber said. It is important to mention that Mr. Huber initially made a mistake regarding the percentage increase in monthly sales from last year, which stands at 37% against the 50% he initially tweeted. He, however, quickly corrected it in a follow-up tweet. Despite this, 37% remains a lot, and these figures will undoubtedly raise eyebrows about what is going on with Ripple and how XRP’s price will react to these sales, whether it will bring about a massive rise in XRP’s price or a steady decline.  XRP’s circulation does justice to these claims, as the number of XRPs in circulation has grown exponentially. XRP’s circulating supply was 50.334 billion at the beginning of the year but now stands at 52.554 billion after Ripple&#8217;s sales and monthly escrow releases. That is an additional 2.2 billion XRPs put in circulation since January and a 4.4% increase, and the year is far from over.  In 2021, Ripple sold 2 billion XRPs, amounting to 166 million XRPs being sold on an average monthly basis. In 2022, it sold 2.75 billion XRPs, an average of 230 million tokens sold monthly.  XRP holding steady above $0.7 &#124; Source: XRPUSD on Tradingview.com In 2023, Ripple has sold 2.22 billion XRPs since the start of the year, amounting to an average of 315 million tokens sold monthly since January. That proves that Ripple has increased XRP sales massively since 2021. What Does This Mean For Ripple And Its Community? These figures could be both good and bad news for XRP and its community. On the positive side, it shows that there has been a greater demand for the token over the years, which signifies growth and wider adoption of the token.  This demand may mainly be coming from institutional investors, which could undoubtedly expand the use cases of XRP beyond the cryptocurrency space. While on the negative side, having so much XRP in circulation without a deflationary mechanism could reduce the token’s value. Related Reading: Binance Announces Listing Of Sam Altman’s Worldcoin, Opens Deposits For now, XRP’s price seems to be feeling the heat as the altcoin’s price is down 4.89% in the last 24 hours to trade at $0.688. Nevertheless, its daily volume is up 8.69%, pointing to a rise in trading activity.  Featured image from Analytics Insight, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T14:20:54.000Z",
    "title": "WorldCoin Distribution Raises Concerns As Crypto Founder Fails To Answer Questions “Because Of The Regulatory Uncertainty” In U.S",
    "url": "https://www.crypto-news-flash.com/worldcoin-distribution-raises-concerns-as-crypto-founder-fails-to-answer-questions-because-of-the-regulatory-uncertainty-in-u-s/?utm_source=rss&utm_medium=rss&utm_campaign=worldcoin-distribution-raises-concerns-as-crypto-founder-fails-to-answer-questions-because-of-the-regulatory-uncertainty-in-u-s",
    "description": "<img width=\"2560\" height=\"1707\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/coins-paper-money-and-globe-on-white-statistic-form-background-IMF-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/coins-paper-money-and-globe-on-white-statistic-form-background-IMF-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/coins-paper-money-and-globe-on-white-statistic-form-background-IMF-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/coins-paper-money-and-globe-on-white-statistic-form-background-IMF-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/coins-paper-money-and-globe-on-white-statistic-form-background-IMF-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/coins-paper-money-and-globe-on-white-statistic-form-background-IMF-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/coins-paper-money-and-globe-on-white-statistic-form-background-IMF-2048x1365.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/coins-paper-money-and-globe-on-white-statistic-form-background-IMF-104x69.jpg 104w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />WorldCoin&#8217;s Evasive Stance on Token Distribution Amidst Regulatory Uncertainty Sparks Concerns Attorney John Deaton Reacts to Worldcoin&#8217;s Refusal to Disclose Token Distribution Details Due to U.S. Regulatory Uncertainty WorldCoin&#8217;s highly anticipated distribution has raised serious concerns among investors and the crypto community. The Bankless host inquired about WLD&#8217;s token distribution specifics in an interview.  Alex [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-25T14:27:34.000Z",
    "title": "Hamster Racing, An Unconventional Crypto Phenomenon",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/hamster-racing-an-unconventional-crypto-phenomenon/",
    "description": "<p>Amidst the mainstream buzz of cryptocurrencies, a peculiar and unconventional trend has emerged &#8211; hamster racing. In this article, we&#8217;ll delve into the intriguing world of hamster racing, its origins, mechanics, and the risks it presents, along with an exploration of the potential pitfalls in the crypto industry. The Unlikely Phenomenon of Hamster Racing At [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/hamster-racing-an-unconventional-crypto-phenomenon/\">Hamster Racing, An Unconventional Crypto Phenomenon</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-25T14:30:38.000Z",
    "title": "Lawyer Predicts Ripple Victory in Case of SEC Appeal, Says Judges Hard Pressed To Contradict Historic Ruling",
    "url": "https://dailyhodl.com/2023/07/25/lawyer-predicts-ripple-victory-in-case-of-sec-appeal-says-judges-hard-pressed-to-contradict-historic-ruling/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Lawyer-Predicts-Ripple-Victory.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Lawyer-Predicts-Ripple-Victory.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Lawyer-Predicts-Ripple-Victory.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Lawyer-Predicts-Ripple-Victory.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Lawyer-Predicts-Ripple-Victory.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Lawyer-Predicts-Ripple-Victory.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Lawyer-Predicts-Ripple-Victory.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. Securities and Exchange Commission (SEC) will likely appeal the outcome of its lawsuit against Ripple, but that doesn&#8217;t concern pro-XRP lawyer John Deaton. Judge Analisa Torres sent shockwaves through the crypto ecosystem earlier this month when she ruled that Ripple’s automated, open-market sales of XRP, referred to as programmatic sales, did not constitute [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/25/lawyer-predicts-ripple-victory-in-case-of-sec-appeal-says-judges-hard-pressed-to-contradict-historic-ruling/\">Lawyer Predicts Ripple Victory in Case of SEC Appeal, Says Judges Hard Pressed To Contradict Historic Ruling</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]