[
  {
    "source": "CryptoSlate",
    "date": "2023-08-10T01:00:13.000Z",
    "title": "Rep. Maxine Waters criticizes PayPal’s stablecoin, demands regulation on par with financial institutions",
    "url": "https://cryptoslate.com/rep-maxine-waters-criticizes-paypals-stablecoin-demands-regulation-on-par-with-financial-institutions/",
    "description": "<p>Democratic U.S. Congresswoman and House Financial Services Committee Ranking Member Maxine Waters criticized PayPal&#8217;s stablecoin on Aug. 9. Waters said in a statement: &#8220;I am deeply concerned that PayPal has chosen to launch its own stablecoin while there is still no Federal framework for regulation, oversight, and enforcement of these assets.&#8221; She added that Federal [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/rep-maxine-waters-criticizes-paypals-stablecoin-demands-regulation-on-par-with-financial-institutions/\">Rep. Maxine Waters criticizes PayPal’s stablecoin, demands regulation on par with financial institutions</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-10T00:46:00.000Z",
    "title": "Crypto Influencer Compares Solana’s Price Action to Cardano’s in 2019 and Predicts a Major Turnaround",
    "url": "https://www.cryptoglobe.com/latest/2023/08/crypto-influencer-compares-solanas-price-action-to-cardanos-in-2019-and-predicts-a-major-turnaround/",
    "description": "Benjamin Cowen, a popular cryptocurrency influencer with a following of over 780,000 people on the Google-owned video-sharing platform YouTube, has recently shared insights ihis insight into the trajectory of Solana ($SOL), saying it could make a significant turnaround in a way similar to what Cardano ($ADA) did during the previous bear market. Drawing on past […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-10T01:00:33.000Z",
    "title": "SEC Seeks to Appeal Ripple-XRP Ruling — Requests Stay of Proceedings",
    "url": "https://news.bitcoin.com/sec-seeks-to-appeal-ripple-xrp-ruling-requests-stay-of-proceedings/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/sec-letter-of-intent-to-appeal-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SEC Seeks to Appeal Ripple-XRP Ruling — Requests Stay of Proceedings\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/sec-letter-of-intent-to-appeal-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sec-letter-of-intent-to-appeal-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sec-letter-of-intent-to-appeal-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sec-letter-of-intent-to-appeal-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sec-letter-of-intent-to-appeal-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sec-letter-of-intent-to-appeal-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sec-letter-of-intent-to-appeal.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.S. Securities and Exchange Commission (SEC) has sent a letter to District Judge Analisa Torres seeking permission to file an interlocutory appeal in the SEC v. Ripple case over XRP. In addition, the securities regulator&#x2019;s motion will &#x201C;seek to stay the district court proceedings.&#x201D; SEC Seeks to Appeal Ruling in Ripple-XRP Case The U.S. [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-10T01:00:47.000Z",
    "title": "Bitcoin Coinbase Premium Surges, Recovery Being Driven By US Investors?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-coinbase-premium-surges-recovery-us/",
    "description": "Data shows the Bitcoin Coinbase Premium Index has recently seen a surge, a sign that buying from US investors may contribute to the recovery. Bitcoin Coinbase Premium Index (7-Day SMA) Has Been Going Up Recently According to data shared by Julio Moreno, the Head of Research at CryptoQuant, the Coinbase Premium Index has been sharply trending up recently. The &#8220;Coinbase Premium Index&#8221; here refers to a metric that keeps track of the percentage difference between the Bitcoin price listed on Coinbase (USD pair) and that listed on Binance (USDT pair). This metric can help us know which platform&#8217;s user base is buying or selling more of the asset. For example, when the index&#8217;s value is greater than zero, it means that an extra amount of buying pressure has been present on Coinbase, which has pushed the asset&#8217;s price up on the platform (or just a lower amount of selling pressure than on Binance is there on Coinbase). Coinbase is known to be used more heavily by US-based investors (especially large institutional traders), while Binance&#8217;s traffic is spread around the globe. Thus, if more buying is happening on Coinbase, it can be a sign that the US-based investors are participating in more buying than the global traders. Related Reading: Bitcoin Miners Show Accumulation Again, Bullish Sign? Now, here is a chart that shows the trend in the 7-day Simple Moving Average (SMA) Bitcoin Coinbase Premium Index over the past couple of months: The 7-day value of the metric seems to have been rising in recent days &#124; Source: Julio Moreno on X As displayed in the above graph, the 7-day SMA Bitcoin Coinbase Premium Index has only been negative this month, implying that the global investors have either outpaced the US traders in accumulation or the Americans have been selling to a higher degree. Recently, however, as news has started to come out that the probability of the BTC spot ETFs being approved in the US is increasing, the indicator has turned around and is now heading up. The metric has sharply increased in the past day, suggesting that the US-based institutional traders may now be participating in some heavy buying. Related Reading: Litecoin Long-Term Holders Smartly Exited Before Halving, Data Shows During this same period, Bitcoin has observed a recovery rally in which the cryptocurrency&#8217;s price briefly managed to touch the $30,000 mark before falling back to the current levels. Naturally, the timing of the rally and the 7-day Coinbase Premium Index sharply going up could imply that the buying from the American holders are providing the fuel for the move. The Grayscale Bitcoin Trust (GBTC) Premium, a metric that checks for whether GBTC is trading at a premium or a discount, has also been trending up recently, implying that the discount on the fund is decreasing (although it&#8217;s not near the positive territory yet unlike the Coinbase Premium Index). Looks like the metric's value is becoming less negative &#124; Source: CryptoQuant GBTC is a fund that allows users to get indirect exposure to Bitcoin in a way that traditional investors would be more familiar with. Thus, this metric holds hints about the buying or selling activity in which the more conventional US institutional traders are currently participating. BTC Price At the time of writing, Bitcoin is trading around $29,800, up 1% in the last week. BTC has observed some uplift during the past day &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  }
]