[
  {
    "source": "CryptoSlate",
    "date": "2024-02-06T13:15:29.000Z",
    "title": "Binance’s delisting move sends Monero and Multichain values tumbling 20%",
    "url": "https://cryptoslate.com/binances-delisting-move-sends-monero-and-multichain-values-tumbling-20/",
    "description": "<p>Two digital assets, Monero&#8217;s XMR, and Multichain&#8217;s MULTI, saw a steep drop in value after Binance, the largest crypto exchange by trading volume, revealed that they would be delisted by Feb. 20. Earlier today, Feb. 6, Binance said XMR and MULTI, alongside other digital assets like Aragon (ANT) and Vai (VAI), would be delisted and removed [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/binances-delisting-move-sends-monero-and-multichain-values-tumbling-20/\">Binance&#8217;s delisting move sends Monero and Multichain values tumbling 20%</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-06T13:36:48.000Z",
    "title": "New Analysis Predicts Shocking Turn for Avalanche (AVAX) – Why Polkadot (DOT) Might Be Your Next Big Win?",
    "url": "https://cryptodaily.co.uk/2024/02/new-analysis-predicts-shocking-turn-for-avalanche-avax-why-polkadot-dot-might-be-your-next-big-win",
    "description": "Explore the latest insights on Avalanche (AVAX) and Polkadot (DOT) in our comprehensive analysis. Discover how these key cryptocurrencies navigate the volatile market, with AVAX facing a critical token release and DOT growing in its ecosystem. Stay informed on their technical outlooks, price forecasts, and the impact of broader market trends in this essential read for crypto enthusiasts."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-06T13:27:16.000Z",
    "title": "DeeStream’s (DST) Digital Dominance: Should Avalanche (AVAX) and Tron (TRX) Investors Switch?",
    "url": "https://cryptodaily.co.uk/2024/02/deestreams-dst-digital-dominance-should-avalanche-avax-and-tron-trx-investors-switch",
    "description": "The last two decades saw digital behemoths dominate the internet. They come from nowhere and overrun popular culture in the blink of an eye."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-06T13:17:44.000Z",
    "title": "Problem solving Kelexo (KLXO) is crypto's solution to lending says Ethereum Classic (ETC) & BNB (BNB) holders as they rush to buy in early",
    "url": "https://cryptodaily.co.uk/2024/02/problem-solving-kelexo-klxo-is-cryptos-solution-to-lending-says-ethereum-classic-etc-bnb-bnb-holders-as-they-rush-to-buy-in-early",
    "description": "Crypto investors are all about searching for the next gem that could boost their portfolio values to high heavens—and in 2024,"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-06T13:13:31.000Z",
    "title": "Portfolio Fund Stakes 33% of liquidity into Pushd (PUSHD) as Ethereum (ETH) & Polkadot (DOT) investors also get involved with Presale",
    "url": "https://cryptodaily.co.uk/2024/02/portfolio-fund-stakes-33-of-liquidity-into-pushd-pushd-as-ethereum-eth-polkadot-dot-investors-also-get-involved-with-presale",
    "description": "In cryptocurrency, strategic moves by portfolio funds can signal significant shifts in market sentiment. Recently, a notable development has emerged as a portfolio fund stakes 33% of its liquidity into Pushd (PUSHD), a pioneering decentralized online marketplace."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-06T13:19:17.000Z",
    "title": "Unexpected Leak Reveals Final Fantasy 7: Rebirth Demo Ahead of State of Play",
    "url": "https://www.cryptopolitan.com/final-fantasy-7-rebirth-demo/",
    "description": "In an unexpected turn of events, an accidental PlayStation Store upload has revealed a demo for the highly anticipated game Final Fantasy 7: Rebirth. This revelation comes from an upcoming State of Play presentation dedicated entirely to Square Enix&#8217;s upcoming RPG.&#160; The leaked trailer on the PlayStation Store provides a glimpse into what players can [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-06T13:13:57.000Z",
    "title": "Former insider drops bombshell: TerraUSD’s dark secrets revealed",
    "url": "https://www.cryptopolitan.com/terrausds-dark-secrets-revealed/",
    "description": "A former development team leader at Terraform Labs has provided critical testimony in a South Korean court, alleging that co-founders Do Kwon and Shin Hyun-seung knowingly promoted TerraUSD (UST) as a payment option despite being aware of its legal impossibility. The witness, identified as &#8220;Mr. Lee,&#8221; shared his insights during the trial of the two [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-06T13:10:53.000Z",
    "title": "Cybersecurity breach shakes XRP market: Ripple co-founder’s wallet hacked",
    "url": "https://www.cryptopolitan.com/cybersecurity-breach-shakes-xrp-market/",
    "description": "In a significant turn of events, the cryptocurrency market recently witnessed a substantial downturn in the trading of XRP tokens following a cybersecurity breach that affected Chris Larsen, co-founder of Ripple.&#160; Market analytics provider Kaiko unveiled data indicating a notable drop in the Cumulative Volume Delta (CVD) for XRP, reflecting a stark sell-off, primarily on [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-06T13:30:43.000Z",
    "title": "ARK Invest CEO Cathie Wood Believes Bitcoin Will Overtake Gold, Here’s Why",
    "url": "https://www.newsbtc.com/news/bitcoin/cathie-wood-bitcoin-gold/",
    "description": "ARK Invest Chief Executive Officer (CEO) and Chief Information Officer (CIO) Cathie Wood, has expressed her optimism about Bitcoin’s capabilities to potentially rise above gold, referring to the cryptocurrency as ‘the digital gold.’ Bitcoin Versus Gold Appearing in a recent interview on ARK Invest’s official YouTube channel, Wood and ARK Invest’s Chief Futurist, Brett Winton, delved into a lengthy discussion about Bitcoin’s historical and most recent price movements in relation to gold.  Related Reading: Crypto Analyst Says ADA Price Will Rise To $8, Here’s When Describing Bitcoin as both a “store of value” and a “risk off asset,” Wood emphasized the cryptocurrency’s notable rise, particularly when compared to gold. She shared a chart illustrating a Bitcoin to gold price ratio which revealed a robust and sustained upward trend for Bitcoin. This upward trajectory hints at the possibility of the cryptocurrency overtaking gold as a more valuable investment in the future.  Wood also discussed Bitcoin’s performance amid past economic crises. She highlighted a historical price pattern observed during the regional bank crisis in March 2023, noting that Bitcoin rose as high as 40% while the regional bank index, represented by KRE, was imploding.  Currently, the regional bank index is experiencing a similar crisis, and according to Wood, Bitcoin is following the same pattern by maintaining a steady ascent. She attributes this uptrend to the approval and introduction of 11 Spot Bitcoin ETFs into the cryptocurrency market.  As a result, Wood has categorized Bitcoin as a “flight to safety” investment asset, providing a space for individuals to store their funds against inflation and the effects of the economic crisis.    Spot Bitcoin ETFs Expected To Fuel Bitcoin Surge After the approval and launch of Spot Bitcoin ETFs on January 10, 2024, Bitcoin faced an unexpected decline, relinquishing a significant portion of the gains accumulated during the pre-approval excitement. The cryptocurrency dropped from a 2023 all-time high of over $45,000 to below $40,000.  Related Reading: Chainlink (LINK) Price Breaks Out Of Bullish Flag Pole, Here’s The Next Target Wood explained that Bitcoin’s descent after the introduction of ETFs resulted from intense anticipatory buying before the launch of ETFs, with a subsequent “sell on the news” event driven by opportunistic traders. Looking ahead, the ARK Invest CEO anticipates Bitcoin’s continued rise, propelled by the broader accessibility facilitated by Spot Bitcoin ETFs. She highlighted that Spot Bitcoin ETFs offered an easier and more inclusive avenue to access Bitcoin, attracting substantial inflows into the cryptocurrency as institutional investors actively participate in the market. BTC drops below $43,000 once again &#124; Source: BTCUSD on Tradingview.com Featured image from Seeking Alpha, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-06T13:17:03.000Z",
    "title": "Crypto Analyst Predicts Altcoin Surge and Chainlink Challenger’s Rally",
    "url": "https://www.crypto-news-flash.com/crypto-analyst-predicts-altcoin-surge-and-chainlink-challengers-rally/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-analyst-predicts-altcoin-surge-and-chainlink-challengers-rally",
    "description": "<img width=\"2133\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-LINK-logo-in-led-lights-with-dark-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-LINK-logo-in-led-lights-with-dark-background.jpg 2133w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-LINK-logo-in-led-lights-with-dark-background-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-LINK-logo-in-led-lights-with-dark-background-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-LINK-logo-in-led-lights-with-dark-background-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-LINK-logo-in-led-lights-with-dark-background-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-LINK-logo-in-led-lights-with-dark-background-2048x1152.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-LINK-logo-in-led-lights-with-dark-background-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-LINK-logo-in-led-lights-with-dark-background-450x253.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-LINK-logo-in-led-lights-with-dark-background-1200x675.jpg 1200w\" sizes=\"(max-width: 2133px) 100vw, 2133px\" />Bitcoin price is expected to consolidate between $38k and $49k before the upcoming halving, which will inevitably give rise to the altseason amid the ongoing crypto cash rotation. Popular crypto analyst Michaël van de Poppe is confident the altcoin market cap is well positioned to double in the coming weeks led by Chainlink (LINK) due [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-06T13:22:51.000Z",
    "title": "EigenLayer See Massive Surge in TVL. Here’s Why",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/eigenlayer-see-massive-surge-in-tvl-heres-why/",
    "description": "<p>EigenLayer’s Total Value Locked (TVL) surged by an impressive $1 billion hours after it temporarily took off its staking cap. The Ethereum-based protocol announced on Monday, February 5th, that it would remove the 200,000 Ether per-protocol staking cap until February 9th. Exploring the Reasons Behind EigenLayer&#8217;s TVL Boom The protocol explained that the move was [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/eigenlayer-see-massive-surge-in-tvl-heres-why/\">EigenLayer See Massive Surge in TVL. Here’s Why</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]