[
  {
    "source": "Decrypt",
    "date": "2024-03-27T23:55:39.000Z",
    "title": "Anthropic's Claude AI Overthrows ChatGPT on Chatbot Arena Leaderboard",
    "url": "https://decrypt.co/223787/anthropic-claude-ai-versus-openai-chatgpt-llm-arena-ranking",
    "description": "The rankings are based on blind ratings of chatbot response quality, and Open AI had been on top for nearly a year."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-27T23:58:18.000Z",
    "title": "Ethereum spot ETF could still be possible even if ETH is classified as a security: BlackRock CEO",
    "url": "https://cryptobriefing.com/ethereum-spot-etf-possibility-blackrock/",
    "description": "BlackRock CEO believes an Ethereum spot ETF could be viable even if the SEC wants to classify Ethereum as a security."
  },
  {
    "source": "NullTX",
    "date": "2024-03-28T00:00:18.000Z",
    "title": "BlockDAG Spearheads The Mobile Mining Revolution With X1 App Amid NEO & CAKE Crypto Price Fluctuations",
    "url": "https://nulltx.com/blockdag-spearheads-the-mobile-mining-revolution-with-x1-app-amid-neo-cake-crypto-price-fluctuations/",
    "description": "In the current landscape, where blockchain technology merges with artificial intelligence (AI) to create new opportunities, BlockDAG (BDAG) positions itself as a trailblazer with innovative crypto-mining advantages.  Amid the CAKE crypto price fluctuation and the buzz surrounding NEO crypto news, BlockDAG introduces a novel approach to generating substantial wealth for [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-28T00:00:44.000Z",
    "title": "Breaking Records: Mantle (MNT) Soars 40% In One Day To New All-Time Highs, Next Target Revealed",
    "url": "https://www.newsbtc.com/news/breaking-records-mantle-mnt-soars-40-in-one-day-to-new-all-time-highs-next-target-revealed/",
    "description": "Layer 2 (L2) blockchain Mantle (MNT) has demonstrated remarkable performance, surpassing most of the top 100 cryptocurrencies in the market. The token has surged by 40% in the past 24 hours, reaching a new all-time high (ATH) of $1.49.  Mantle Network&#8217;s Layer 2 Solution Mantle Network operates as an Ethereum Virtual Machine (EVM)-compatible L2 scaling solution to provide a deeper understanding of the protocol. It leverages Optimistic rollups to enable fast and cost-effective transactions.  The unique aspect of Mantle lies in its modular design, which combines Optimistic rollups with a separate data availability layer. Unlike traditional blockchains, Mantle&#8217;s approach involves handling the four key blockchain functions on different layers. Related Reading: Here’s Why The Cardano Price Is Struggling Below $0.7 Mantle&#8217;s transaction execution function occurs on its EVM-compatible execution settlement layer. Blocks are generated on the L2 execution layer by Mantle&#8217;s sequencer, which then submits state root data to the Ethereum mainnet.  This architecture significantly reduces transaction costs compared to the base layer and improves network efficiency by separating the layers. Additionally, the implementation of Optimistic rollups minimizes the overall load on nodes. MNT Surges As Staking Launches One of the potential catalysts behind the recent surge in MNT can be attributed to the introduction of MNT staking, as highlighted by crypto researcher Alex Wacy.  According to Wacy, the Mantle Rewards Station plays a key role in this staking initiative, offering rewards to MNT stakers from the Mantle Ecosystem. By participating in staking, users contribute to the network&#8217;s security and operations while also being incentivized through these rewards. The staking process begins with the Ethena event, where users receive mShards tokens. These tokens have value within the Mantle decentralized finance (DeFi) ecosystem, allowing users to perform various decentralized finance activities within the network. These activities may include trading, investing, or interacting with various DeFi protocols and applications built on top of Mantle. In particular, mShards can be traded within the Mantle decentralized application (dApp) ecosystem, allowing users to take advantage of potential market growth options. The ability to trade these tokens increases liquidity and fosters an active ecosystem within Mantle. In addition, the researcher notes that mShard token holders will soon be able to redeem for ENA, another token associated with the Mantle Ecosystem. This redemption process adds utility and value to mShards, further increasing their appeal to token holders. The issuance of Ethena shards for Epoch 2 will end on April 1, indicating a limited-time opportunity for users to acquire these shards through staking, which may have further increased interest in the blockchain ahead of the deadline from investors looking to capitalize on this opportunity.  Bullish Prospects Examining the figures, MNT has experienced a surge in trading volume, reaching $647,118,249 in the past 24 hours, signifying a substantial 141.40% increase compared to the previous day.  Related Reading: Will Bitcoin Break $74,000 Driven By TradFi FOMO? The market capitalization of the MNT token stands at $4,157,261,742, propelling it to the 33rd position on CoinGecko&#8217;s rankings. Over the past 7 days, Mantle (MNT) has outperformed the global cryptocurrency market, which has seen a 2.30% increase, and similar cryptocurrencies within the Ethereum ecosystem have risen by 12.70%. The MNT token has retraced to the $1.27 level, marking a 2% decline in price over the past hour. Despite the temporary setback, the token&#8217;s strong momentum suggests potential trading risks and opportunities. It is worth noting that the next identified support line for the token is at the $1.080 level. If this support level fails to hold, the token&#8217;s price could drop further, potentially reaching the $1 mark. The next significant resistance level would be at $0.94.  However, if the bullish momentum continues throughout the week, the token may target the $1.60 and $1.68 levels before potentially surging towards the $2 mark. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-28T00:00:23.000Z",
    "title": "Top Analyst Says Ethereum Rival Looks Turbo Bullish, Updates Outlook on Arbitrum and Solana-Based Memecoin",
    "url": "https://dailyhodl.com/2024/03/27/top-analyst-says-ethereum-rival-looks-turbo-bullish-updates-outlook-on-arbitrum-and-solana-based-memecoin/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/03/top-rival-turbo-and.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/03/top-rival-turbo-and.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/03/top-rival-turbo-and.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/03/top-rival-turbo-and.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/03/top-rival-turbo-and.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/03/top-rival-turbo-and.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/03/top-rival-turbo-and.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A top trader who accurately called Bitcoin&#8217;s (BTC) floor price during the 2018 bear market says one Ethereum (ETH) challenger looks extremely bullish. Pseudonymous analyst Bluntz tells his 251,100 followers on the social media platform X that he expects the native asset of the layer-1 protocol Near (NEAR) to rally to a level last seen [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/27/top-analyst-says-ethereum-rival-looks-turbo-bullish-updates-outlook-on-arbitrum-and-solana-based-memecoin/\">Top Analyst Says Ethereum Rival Looks Turbo Bullish, Updates Outlook on Arbitrum and Solana-Based Memecoin</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]