[
  {
    "source": "CryptoGlobe",
    "date": "2023-07-21T07:25:25.000Z",
    "title": "Coinbase Protocols Lead Forecasts 8 Billion People On-Chain in the Next Decade",
    "url": "https://www.cryptoglobe.com/latest/2023/07/coinbase-protocols-lead-forecasts-8-billion-people-on-chain-in-the-next-decade/",
    "description": "Coinbase’s protocols lead, Jesse Pollak, recently shared his optimistic outlook on the future of crypto adoption at the EthCC event in Paris. Pollak is responsible for Coinbase’s efforts regarding Base, the exchange’s Ethereum-focused layer-2 blockchain unveiled in February. He stated that the company’s goal with Base is to increase the number of things people can […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-21T07:30:28.000Z",
    "title": "Ethena Raises $6.5 Million to Develop an Ethereum-Based, Banking System Independent Stablecoin",
    "url": "https://news.bitcoin.com/ethena-raises-6-5-million-to-develop-an-ethereum-based-banking-system-independent-stablecoin/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1086276632-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Ethena Raises $6.5 Million to Develop an Ethereum-Based Banking System Independent Stablecoin\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1086276632-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1086276632-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1086276632-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1086276632-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1086276632-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1086276632-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1086276632.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Ethena, a protocol that seeks to build a banking system independent stablecoin, has announced that it has raised $6.5 million in its seed round. The round, led by Dragonfly, aims to help issue Ethena&#8217;s decentralized stablecoin product in Q3 2023, which was inspired by an article written by former Bitmex CEO Arthur Hayes. Stablecoin Protocol [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T07:38:58.000Z",
    "title": "Solana network achieves outstanding performance with 100% uptime in Q2",
    "url": "https://www.cryptopolitan.com/solanas-network-performance-improved-in-q2/",
    "description": "Solana Foundation has released its network performance report showing that it has had a 100% uptime since February, a major improvement compared to last year&#8217;s outages. The network was only down for approximately 19 hours in February. The foundation notes that it has improved the network in the first half of 2023, which they measured ... <a title=\"Solana network achieves outstanding performance with 100% uptime in Q2\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solanas-network-performance-improved-in-q2/\" aria-label=\"More on Solana network achieves outstanding performance with 100% uptime in Q2\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T07:35:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T07:32:11.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-21T07:20:07.000Z",
    "title": "Market Alert: Bitcoin Hash Ribbons Capitulation Triggers Cautionary Outlook",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-hash-ribbons-capitulation-cautionary-outlook/",
    "description": "Charles Edwards, the mastermind behind the Bitcoin Hash Ribbons signal and founder of Capriole Investments, has sounded the alarm. The renowned analyst warns that the Hash Ribbons capitulation signal just flashed, a phenomenon that has historically accompanied moments of distress for BTC miners. As outlined by Edwards, Bitcoin&#8217;s hash rate had experienced an astonishing and seemingly unsustainable 50% surge in 2023. However, this meteoric rise came to a sudden slowdown, which has led to the Hash Ribbons capitulation signal to appear. Via Twitter, Edwards emphasized that the signal is neither a clear sell signal nor a buy indicator. But it demands prudent risk management until a renewed price rally: We have a Hash Ribbon capitulation. AKA a slowing in Bitcoin&#8217;s Hash Rate growth after what has been an incredible (unsustainable) 50% increase in 2023. Hash Ribbons capitulation is not a sell signal, but it&#8217;s also not bullish. Risk management warranted until growth resumes. Market analyst Lukasz Wydra corroborates Edwards&#8217; stance, pointing out that the death cross of Bitcoin hash ribbons is a signal of a time of uncertainty. Wydra revealed that historically, there have been 14 similar events, each leading to diverse outcomes. Among these events, three resulted in rallies, six led to sideways movements, and five triggered declines. Related Reading: Bitcoin Bulls Rejoice: Blofin Forecasts $49,000 Price High With Potential Spot ETF Launch Wydra takes a statistical approach and reassures investors that, statistically speaking, the Hash Ribbons capitulation does not inflict significant harm on the market. In fact, he emphasizes that when the capitulation finally subsides, it will usher in a strong buying signal, one that has shown remarkable effectiveness in the past. The last time the Hash Ribbons capitulation signal appeared was at the end of November 2022. It was followed by a prolonged sideways trend for over a month until the buy signal flashed at the beginning of January. The result? Bitcoin embarked on a furious rally, etching a memorable start to the year. Why Bitcoin Hash Ribbons Are Such A Powerful Tool In simple terms, the Hash Ribbon indicator is designed to detect periods when BTC miners are facing distress and possible capitulation. These phases tend to coincide with major lows in the price of Bitcoin, making them attractive buying opportunities for astute investors. Related Reading: Bitcoin, XRP, &#38; Ethereum: Three Top Coins On Brink Of Golden Cross Miners play a crucial role in securing the Bitcoin network and processing transactions. During periods of rapid price surges followed by sharp pullbacks, some miners may find it financially challenging to continue their operations, leading them to power down their mining rigs. Charles Edwards elucidates that when miners capitulate, it might be the most potent buy signal observable in the Bitcoin market. However, the indicator does not claim to time the exact bottom of the price. Instead, it identifies periods when miners are turning off their rigs due to adverse market conditions, leading to drops in hash rates. These moments often correspond to macro bottoms in Bitcoin&#8217;s price, making them opportune moments to accumulate Bitcoin. At press time, BTC traded near the range lows at $29,863. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T07:30:41.000Z",
    "title": "Despite Crypto Hacks Shaking Q2 Markets, Chancer Presale Proves Relentless",
    "url": "https://www.crypto-news-flash.com/despite-crypto-hacks-shaking-q2-markets-chancer-presale-proves-relentless/?utm_source=rss&utm_medium=rss&utm_campaign=despite-crypto-hacks-shaking-q2-markets-chancer-presale-proves-relentless",
    "description": "<img width=\"982\" height=\"494\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Chancor-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Chancor-1.jpg 982w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Chancor-1-300x151.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Chancor-1-768x386.jpg 768w\" sizes=\"(max-width: 982px) 100vw, 982px\" />Crypto hacks have caused concern among sidelined investors, who suggest that the industry’s security problems are more than enough to dissuade people from using decentralized technologies. However, the markets continue to disagree with that analysis, and new projects such as Chancer perform strongly during their early investment stages. For now, the Chancer presale is still [...]"
  }
]