[
  {
    "source": "Cointelegraph",
    "date": "2023-10-31T02:56:16.000Z",
    "title": "Do Kwon and Terraform Labs ask judge to toss SEC’s lawsuit",
    "url": "http://cointelegraph.com/news/do-kwon-terraform-labs-request-sec-suit-dismiss-district-court",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/d78d8bd7-2936-4914-a8e9-0bcd84e6b0e0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Do Kwon, the co-founder now-collapsed Terraform ecosystem maintains he and his firm did not skirt U.S. securities laws.</p>\n                    <p><p>Terraform Labs co-founder Do Kwon has requested a United States district judge to reject the securities and fraud suit from the federal securities regulator, claiming it has failed to prove they did anything wrong.</p><p>In an Oct. 27 <a href=\"https://www.courtlistener.com/docket/66820843/100/securities-and-exchange-commission-v-terraform-labs-pte-ltd/\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> to a New York District Court, lawyers for <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/do-kwon\">Kwon</a> and Terraform argued its cryptocurrencies Terra Luna Classic (LUNC), TerraClassicUSD (USTC), Mirror Protocol (MIR) and its Mirrored Assets (mAssets) that <a href=\"https://cointelegraph.com/explained/crypto-synthetic-assets-explained\">reflect stocks on-chain</a> are not securities as the Securities and Exchange Commission alleged.</p><p>“After two years of investigation, the completion of a discovery period that resulted in the taking of more than 20 depositions, and the exchange of over two million pages of documents and data, the SEC is evidentiarily no closer to proving that the Defendants did anything wrong,” the lawyers wrote.</p><p>They added the “evidence does not exist to support many of the SEC’s claims” and asserted the regulator “knew some of its allegations were false” — in particular, an allegation that Kwon and Terraform secretly moved millions into Swiss bank accounts for their own gain.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/adcc1d04-39bf-4607-9dc4-8a481c70ea77.png\"  /><figcaption style=\"text-align: center;\"><em>Kwon’s lawyers claimed the SEC is trying to draw parallels between Terraform and FTX. Source: CourtListener</em></figcaption></figure><p>In its <a href=\"https://cointelegraph.com/news/sec-sues-do-kwon-and-terraform-labs-for-fraud\">suit against Kwon and Terraform</a> filed in February, the SEC claimed the pair sent 10,000 Bitcoin (BTC) to a Swiss financial institution and withdrew $100 million. It also claimed they committed fraud by “repeating false and misleading statements.”</p><p>“The SEC knew this allegation was false when it filed this case,” Kwon’s lawyers wrote. ”This is made even worse by the undisputed fact that TFL had no customers, and thus no customer funds.” </p><p>The $40 billion Terra ecosystem <a href=\"https://cointelegraph.com/news/breaking-terra-blockchain-officially-halted-following-luna-price-collapse\">collapsed in May 2022</a> after its USTC algorithmic stablecoin lost its U.S. dollar peg.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/terraform-co-founder-shin-blames-protocol-collapse-during-trial-south-korea\"><strong><em>Terraform co-founder Shin blames protocol for collapse during trial in S. Korea</em></strong></a></p><p>Kwon and Terraform also moved to exclude the opinion of the SEC’s experts including a report from Rutgers University economics professor Bruce Mizrach which they called “junk science.”</p><p>Judge Jed Rakoff, who oversees the case, denied Terraform’s <a href=\"https://cointelegraph.com/news/judge-denies-motion-dismiss-terraform-sec-case-reject-ripple-ruling\">earlier attempt</a> to toss the lawsuit.</p><p>Kwon is currently <a href=\"https://cointelegraph.com/news/do-kwon-sentenced-to-4-months-in-prison-in-montenegro-on-fake-passport-charges\">detained in Montenegro</a> and has previously asked the court to <a href=\"https://cointelegraph.com/news/do-kwon-sec-extradition-request-impossible-deposition-united-states\">reject the SEC’s motion</a> to extradite and interview him in the U.S.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-31T03:05:11.000Z",
    "title": "Global Experts Unite in a Call for Progress on an International AI Safety Treaty",
    "url": "https://www.cryptopolitan.com/experts-call-international-ai-safety-treaty/",
    "description": "In anticipation of the inaugural global summit on AI safety hosted by the UK on November 1 and 2, a coalition of top experts has made a groundbreaking move by urging the establishment of an international AI safety treaty. This collective effort, led by prominent figures such as Yoshua Bengio and Yi Zeng, aims to ... <a title=\"Global Experts Unite in a Call for Progress on an International AI Safety Treaty\" class=\"read-more\" href=\"https://www.cryptopolitan.com/experts-call-international-ai-safety-treaty/\" aria-label=\"More on Global Experts Unite in a Call for Progress on an International AI Safety Treaty\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-31T03:00:57.000Z",
    "title": "Analyst Predicts A Mega Bull Run If Bitcoin Breaks $36,000",
    "url": "https://www.newsbtc.com/bitcoin-news/analyst-predicts-a-mega-bull-run-if-bitcoin-breaks-36000/",
    "description": "Crypto and Bitcoin traders should prepare for another sharp leg up, especially if the coin breaks above the $35,750 to $36,000 resistance wall this week. According to an X user, Alex Thorn, the Head of Firmwide Research, the $250 zone between those prices is a crucial liquidation barrier that derivatives traders closely watch. If bulls have the upper hand and push above the upper limit of the belt, prices could rip higher this week primarily because of the resulting demand in the spot market. Is Bitcoin Ready For Another Rally? Thorn compares the current setup evolving in the Bitcoin chart to the events last week, which saw the coin explode. At spot rates, Bitcoin is stable but trending around 2023 highs, with buyers expecting more gains as market sentiment improves. Though most users are looking at the United States Securities and Exchange Commission (SEC) and the potential approval of a spot Bitcoin Exchange-Traded Fund (ETF) as a trigger for the next leg up, Thorn is closely tracking events in the Bitcoin trading scene, specifically, the derivatives market. In the analyst&#8217;s assessment, options traders will be the primary drivers of the next bull run.  Related Reading: Artificial Intelligence Crypto Boom: What’s Behind The Double-Digit Surge? Why $36,000 Is A Key Price Level To Watch Based on the analyst&#8217;s assessment, once Bitcoin breaks the $35,750 to $36,000 zone, &#8220;options dealers will need to buy $20m in spot BTC for every 1% upside move,&#8221; driving prices higher. The reason dealers have to buy or sell Bitcoin at the spot market depends on whether they are &#8220;short or long gamma.&#8221;  The objective, when this happens, is to stay &#8220;delta neutral.&#8221; The decision to buy at the spot market comes after a &#8220;gamma squeeze,&#8221; which, as Thorn notes, lifted prices last week. Technically, a gamma squeeze arises when there is a spike in call (or buy) options being purchased, forcing options dealers, most of whom are market makers, to buy the underlying asset, in this case, Bitcoin, to hedge their positions and stay &#8220;delta neutral.&#8221; Going by trends and the current setup, especially in the daily chart, this could happen. Related Reading: DOGE Breaks Free From Multi-year Descending Order, What’s Next? Looking at other metrics, Thorn noticed a divergence in supply held by speculators and long-term holders, opining that on-chain liquidity could be dwindling. However, on the bright side, the Z-Score ratio of market price to realized price shows that Bitcoin is in a &#8220;healthy&#8221; position. As of October 30, Bitcoin is within a bullish breakout formation, with traders bullish. Whether the uptrend remains depends on whether buyers follow through, pushing the coin above recent highs, away from the breakout level at around $32,000. Feature image from Canva, chart from TradingView"
  }
]