[
  {
    "source": "Crypto Daily",
    "date": "2023-05-26T07:54:48.000Z",
    "title": "Decentralized Social (DESO) Is Now Available on LBank Exchange",
    "url": "https://cryptodaily.co.uk/2023/05/decentralized-social-deso-is-now-available-on-lbank-exchange",
    "description": "<p>Road Town, BVI, May 26th, 2023, Chainwire</p><p>LBank Exchange, a global digital asset trading platform, listed Decentralized Social (DESO) on May 24, 2023. For all users of LBank Exchange, the DESO/USDT trading pair is officially available for trading.</p><p>Reimagining the world of social, DeSo is the first layer-1 blockchain built from the ground up to decentralize social media and scale storage-heavy apps to billions of users. Its native token Decentralized Social (DESO) was listed on LBank Exchange at 3:00 UTC on May 24, 2023, to further expand its global reach and help it achieve its vision.</p><p>Introducing DeSo</p><p>DeSo, short for \"decentralized social\", is a new layer-1 blockchain built from the ground up to decentralize social media for billions of users. It is empowering an internet that&rsquo;s creator-led, user-owned, and open to millions of developers around the world to build off one another.</p><p>Today, there&rsquo;s only a handful of big-tech companies that own and control all the information people consume online. DeSo puts the ownership back in the hands of users, not platforms. User&rsquo;s identity, profile, content, and social graph can now be owned by themselves in a completely censorship-resistant way.</p><p>The DeSo blockchain supports not only traditional social features like creating profiles and posts, but also novel blockchain-native features like social tokens (creator coins), tipping, and NFTs. These features unlock vast new categories of money-enabled products, from social NFT experiences to influencer stock markets. These features enable creators to more effectively monetize their content and connect with their followers on DeSo-powered apps.</p><p>In addition, developers can build in a gasless, permissionless, and transparent environment where everything is open and on-chain for ultimate accessibility and composability. DeSo is built to support storage-heavy or infinite-state applications, opening up a new world of non-financial-based web3 apps that weren&rsquo;t possible before. New users can signup to DeSo apps like Diamond and earn $DESO for simply posting and engaging with other users on the platform.</p><p>DeSo's biggest advantage lies in the fact that it is not a general-purpose blockchain. Instead, it supports a narrow set of social-oriented features that it implements on bare metal, using custom indexes that every node builds during consensus when it syncs from its peers. This allows the DeSo blockchain to reach highly-scalable storage capabilities that are unparalleled by any general-purpose blockchain. For instance, the cost of 1 GB of on-chain storage on DeSo is as low as 1 DeSo, whereas even the best existing smart contract infrastructures require millions ($1,000,000+) of dollars to achieve the same.</p><p>With DeSo, people can now imagine, build and experience the next generation of web3 social. In the same way, people have seen Bitcoin and Ethereum decentralize finance, DeSo is now enabling this for social.</p><p>Deso is coming off a series of remarkable launches including their MetaMask integration which makes it easy for Ethereum users to login to DeSo apps in just a few clicks. Additionally, they&rsquo;ve launched the groundbreaking MegaSwap, a anonymous no login cross-chain swapper for crypto, and OpenFund, which makes it easy for crypto projects to launch startups and get funded in just a few clicks.</p><p>Looking forward, they are gearing up for their transition to Revolution Proof-of-Stake, a monumental development that will enhance energy efficiency by 99% and establish DeSo as one of the most deflationary protocols in existence. Soon, you&rsquo;ll have the opportunity to stake your $DESO while earning rewards for securing the network. This innovative PoS mechanism enhances the schemes employed by Ethereum, Cosmos, Flow, and Solana, demonstrating DeSo&rsquo;s commitment to technological advancement.</p><p>Keep checking back as DeSo prepares even more announcements as they become a sovereign blockchain that enables anyone from anywhere in the world to launch decentralized, censorship-resistant apps that scale to billions of users!</p><p>About DESO Token</p><p>Decentralized Social (DESO) is the native token of DeSo ecosystem, which currently has 2M wallets and 85M transactions across 100+ applications built, resulting in $2B in transaction volume. Transactions on DeSo are virtually gasless, costing one-ten thousandth of a cent.</p><p>In addition, DeSo just announced a groundbreaking Proof-of-Stake mechanism called Revolution, leading to 99% more energy efficiency and becoming a far more deflationary protocol than has ever existed. Once completed, DeSo will inch closer to its final form, \"The Sovereign Internet,\" featuring a \"Decentralized Web,\" enabling developers to deploy censorship-resistant storage-intensive applications at scale from anywhere in the world.</p><p>DESO token was listed on LBank Exchange at 3:00 UTC on May 24, 2023, investors who are interested in DeSo can easily buy and sell it on LBank Exchange now. The listing of DESO token on LBank Exchange will undoubtedly help it further expand its business and draw more attention in the market.</p><p>Learn More about DESO Token:</p><p>Official Website | Twitter | YouTube | Telegram | Discord | Diamond | Explorer</p><p>About LBank</p><p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge growing platform that ensures the integrity of users' funds and aims to contribute to the global adoption of cryptocurrencies.</p><p>Start Trading Now: lbank.com</p><p>Community &amp; Social Media:&nbsp;&nbsp;Telegram l&nbsp;Twitter l&nbsp;Facebook l&nbsp;LinkedIn l&nbsp;Instagram l&nbsp;YouTube</p><p></p>ContactLBK Blockchain Co. Limitedmarketing@lbank.info"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-26T07:40:00.000Z",
    "title": "Fahrenheit To Acquire Celsius’ Assets After Successful Bid",
    "url": "https://cryptodaily.co.uk/2023/05/fahrenheit-to-acquire-celsius-assets-after-successful-bid",
    "description": "<p>According to court filings published on Thursday, Crypto Consortium Celsius has won the bid to acquire bankrupt crypto lender Celsius Network.&nbsp;</p>\n<p>The Fahrenheit consortium beat fellow bidder NovaWulf, with the Blockchain Recovery Investment Consortium shortlisted as a backup.&nbsp;</p>\nFahrenheit&rsquo;s Successful Bid&nbsp;\n<p>According to court filings, Celsius Network&rsquo;s assets were previously valued at $2 billion. Fahrenheit&rsquo;s winning consortium is backed by Arrington Capital, mining company US Bitcoin Corp, Steven Kokinos, Ravi Kaza, and Proof Group. With the bid secured, the consortium will acquire Celsius&rsquo;s staked cryptocurrencies, along with its institutional loan portfolio, mining unit, and additional alternative investments. Additionally, the consortium must pay a deposit of $10 million within three days to clinch the deal. Fahrenheit will also be required to provide the management team, capital, and technology to establish and operate the new regulatorily compliant public company.&nbsp;</p>\n<p>The deal will also see the newly formed company receive a significant amount of liquid cryptocurrency. This amount is speculated to be between $450 and $500 million. US Bitcoin Corp will also lead the construction of numerous Bitcoin mining facilities, including a 100-megawatt plant. In an announcement, Alan Carr and David Barse, members of the Special Committee of the Board, stated,&nbsp;</p>\n\n<p>&ldquo;We are very pleased that our competitive auction process produced a positive result for customers, including, most prominently, hundreds of millions of dollars in lower management fee savings and increased liquid cryptocurrency distributions to Celsius&rsquo; customers. We appreciate the robust interest that the Celsius platform has received from competing bidders and look forward to working with Fahrenheit to expedite the restructuring and distribute recoveries to creditors.&rdquo;</p>\n\n<p>They further added,&nbsp;</p>\n\n<p>&ldquo;The dynamic engagement in our auction provided us with excellent options for our exit from chapter 11. We are grateful for the collaboration of the Committee, and with our path now set, we are looking forward to enabling our customers to move forward from this process.&rdquo;&nbsp;</p>\n\nRegulatory Approval Awaited&nbsp;\n<p>While the bid has been accepted by Celsius and a committee of its creditors, it still requires regulatory approval before it can be finalized. Martin Glenn, the Bankruptcy Court Judge, had already warned of regulatory roadblocks that could hamper the acquisition of Celsius, similar to how it had scuppered a similar deal. For context, the Judge was referring to the agreement between Binance US and Voyager. After Federal officials opposed the deal, Binance US had to terminate its purchase of bankrupt crypto lender Voyager&rsquo;s $1 billion in assets. Binance cited an uncertain and hostile regulatory climate for scuppering the deal.&nbsp;</p>\nCelsius and BRIC\n<p>Celsius had filed for Chapter 11 bankruptcy in July 2022 after it emerged that the lender had a $1.2 billion hole in its balance sheet. Initially, digital asset investment firm Novawulf was announced as the winning bidder but eventually lost out. However, Celsius also announced that it had secured a backup bid from the Blockchain Recovery Investment Consortium (BRIC). The backup would act as a contingency plan should there be any hiccups. Celsius announced the backup bid on its Twitter handle, stating,&nbsp;</p>\n\n<p>&ldquo;Earlier today, the Celsius auction concluded, and Fahrenheit was selected as the winning bid. The BRIC bid was selected as the backup bid. The Committee appreciates the efforts of Celsius and all bidders for their efforts, which generated significant value for Celsius users. The Committee will share more info a lot about the winning bid and backup bid soon.&rdquo;</p>\n\n<p>In the event of BRIC having to step in, it would be required to establish a publicly traded mining business, giving Celsius creditors complete ownership of equity interests and a potential management contract with GlobalXDigital.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "NullTX",
    "date": "2023-05-26T08:00:37.000Z",
    "title": "Top 5 Quickest Startegies to Make Money in the Cryptocurrency Space",
    "url": "https://nulltx.com/top-5-quickest-startegies-to-make-money-in-the-cryptocurrency-space/",
    "description": "Investors looking for quick gains are drawn to the booming financial prospects in the cryptocurrency market. While it&#8217;s important to recognize the turbulence and risks that come with cryptocurrencies, there are several tactics that might result in quick gains. The top five quickest strategies to earn money in the cryptocurrency industry are examined in this [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-05-26T07:50:54.000Z",
    "title": "SingularityNET Price Analysis & Prediction (May 26) – AGIX Establishes Support After 60% Correction, Is The Bottom in?",
    "url": "https://nulltx.com/singularitynet-price-analysis-prediction-may-26-agix-establishes-support-after-60-correction-is-the-bottom-in/",
    "description": "Just today alone, SingularityNET price went up by 13% following a significant volume inflow in the past hours. It has formed a bullish pattern on the lower time frame, looking set for a rally. In the first quarter of the year, the price of AGIX rallied by over 1000% to $0.668. It encountered resistance and halted the [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-26T07:56:15.000Z",
    "title": "Polygon Aims for Trillion Dollar Gaming Future Market as Tokenized Securities on Ethereum, Matic, and Gnosis Reach $225M Market Cap – Report",
    "url": "https://www.crypto-news-flash.com/polygon-aims-for-trillion-dollar-gaming-future-market-as-tokenized-securities-on-ethereum-matic-and-gnosis-reach-225m-market-cap-report/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-aims-for-trillion-dollar-gaming-future-market-as-tokenized-securities-on-ethereum-matic-and-gnosis-reach-225m-market-cap-report",
    "description": "<p>Tokenization securities cross $200 million in market capitalization. Do-founder of Polygon betting big on the Web3 gaming industry.  The tokenization industry is building steam as adoption increases. According to recently published data, the value of the industry has recorded a notable upsurge in recent times. In the blockchain ecosystem, tokenization is a term that refers [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/polygon-aims-for-trillion-dollar-gaming-future-market-as-tokenized-securities-on-ethereum-matic-and-gnosis-reach-225m-market-cap-report/\">Polygon Aims for Trillion Dollar Gaming Future Market as Tokenized Securities on Ethereum, Matic, and Gnosis Reach $225M Market Cap &#8211; Report</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-26T07:54:31.000Z",
    "title": "Decentralized Social (DESO) Is Now Available on LBank Exchange",
    "url": "https://www.crypto-news-flash.com/decentralized-social-deso-is-now-available-on-lbank-exchange/?utm_source=rss&utm_medium=rss&utm_campaign=decentralized-social-deso-is-now-available-on-lbank-exchange",
    "description": "<p>Road Town, BVI, May 26th, 2023, Chainwire LBank Exchange, a global digital asset trading platform, listed Decentralized Social (DESO) on May 24, 2023. For all users of LBank Exchange, the DESO/USDT trading pair is officially available for trading. Reimagining the world of social, DeSo is the first layer-1 blockchain built from the ground up to [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/decentralized-social-deso-is-now-available-on-lbank-exchange/\">Decentralized Social (DESO) Is Now Available on LBank Exchange</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-26T07:47:54.000Z",
    "title": "Polygon Partners with ClubRare to Launch a Groundbreaking Social Commerce Platform for Collectors and Creators of Phygital Goods ",
    "url": "https://www.crypto-news-flash.com/polygon-partners-with-clubrare-to-launch-a-groundbreaking-social-commerce-platform-for-collectors-and-creators-of-phygital-goods/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-partners-with-clubrare-to-launch-a-groundbreaking-social-commerce-platform-for-collectors-and-creators-of-phygital-goods",
    "description": "<p>Polygon and ClubRare collaborate to build a platform for creators and collectors of Phygital goods. The price of Polygon (MATIC) has reacted with a 1.8 percent surge.  Renowned blockchain platform Polygon (MATIC) has sealed a partnership agreement with an innovative Web3 social e-commerce platform ClubRare to introduce a social commerce platform for collectors and creators [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/polygon-partners-with-clubrare-to-launch-a-groundbreaking-social-commerce-platform-for-collectors-and-creators-of-phygital-goods/\">Polygon Partners with ClubRare to Launch a Groundbreaking Social Commerce Platform for Collectors and Creators of Phygital Goods </a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-26T07:52:31.000Z",
    "title": "ARPA Price Prediction 2023-2030: Will ARPA Price Hit $0.2 Soon?",
    "url": "https://coinedition.com/arpa-price-prediction/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/ARPA-Price-Prediction-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"ARPA-Price-Prediction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/ARPA-Price-Prediction-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/ARPA-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/ARPA-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/ARPA-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/ARPA-Price-Prediction-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/ARPA-Price-Prediction.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>What is ARPA (ARPA)? ARPA Network (ARPA) is a decentralized secure computation network that aims to develop fair, secure, and privacy-preserving blockchain ecosystems. As such, they innovate cryptographic systems to make blockchains more versatile, reliable, and interlinked. ARPA threshold BLS signature network serves as the basis of a verifiable Random Number Generator (RNG), secure wallet, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/arpa-price-prediction/\">ARPA Price Prediction 2023-2030: Will ARPA Price Hit $0.2 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-26T07:51:28.000Z",
    "title": "Fracton Protocol Unveils hiBAKC, the Latest Fractional NFT on KuCoin",
    "url": "https://coinedition.com/fracton-protocol-unveils-hibakc-the-latest-fractional-nft-on-kucoin/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Fracton_Protocol_Unveils_hiBAKC_the_Latest_Fractional_NFT_on_KuCoin-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Fracton_Protocol_Unveils_hiBAKC_the_Latest_Fractional_NFT_on_KuCoin-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Fracton_Protocol_Unveils_hiBAKC_the_Latest_Fractional_NFT_on_KuCoin-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Fracton_Protocol_Unveils_hiBAKC_the_Latest_Fractional_NFT_on_KuCoin-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Fracton_Protocol_Unveils_hiBAKC_the_Latest_Fractional_NFT_on_KuCoin-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Fracton_Protocol_Unveils_hiBAKC_the_Latest_Fractional_NFT_on_KuCoin-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Fracton_Protocol_Unveils_hiBAKC_the_Latest_Fractional_NFT_on_KuCoin.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Fracton Protocol, in collaboration with KuCoin, has unveiled its latest addition to the list of fractionalized NFTs with the introduction of hiBAKC. hiBAKC has already made waves in the market, achieving an astounding 1,100% price surge on its very first day of listing. This new addition marks the first time a BAKC fractional token has [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/fracton-protocol-unveils-hibakc-the-latest-fractional-nft-on-kucoin/\">Fracton Protocol Unveils hiBAKC, the Latest Fractional NFT on KuCoin</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]