[
  {
    "source": "CryptoSlate",
    "date": "2023-12-09T18:49:18.000Z",
    "title": "EU set to adopt world’s first AI legislation that will ban facial recognition in public places",
    "url": "https://cryptoslate.com/eu-set-to-adopt-worlds-first-ai-legislation-that-will-ban-facial-recognition-in-public-places/",
    "description": "<p>The European Union (EU) is leading the race to regulate artificial intelligence (AI). Putting an end to three days of negotiations, the European Council and the European Parliament reached a provisional agreement earlier today on what&#8217;s set to become the world&#8217;s first comprehensive regulation of AI. Carme Artigas, the Spanish Secretary of State for digitalization [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/eu-set-to-adopt-worlds-first-ai-legislation-that-will-ban-facial-recognition-in-public-places/\">EU set to adopt world&#8217;s first AI legislation that will ban facial recognition in public places</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-09T18:30:05.000Z",
    "title": "Jack Dorsey’s Block Launches Bitkey: A New Self-Custody Bitcoin Wallet With No Seed Phrases",
    "url": "https://news.bitcoin.com/jack-dorseys-block-launches-bitkey-a-new-self-custody-bitcoin-wallet-with-no-seed-phrases/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/klopuyyuu-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Jack Dorsey&#039;s Block Launches Bitkey: A New Self-Custody Bitcoin Wallet With No Seed Phrases\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/klopuyyuu-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/klopuyyuu-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/klopuyyuu-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/klopuyyuu-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/klopuyyuu-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/klopuyyuu-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/klopuyyuu.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Block, Inc. has recently introduced Bitkey, its innovative self-custody bitcoin wallet, offering a unique approach to bitcoin management. Unlike traditional wallets which rely on passwords or seed phrases, Bitkey utilizes a distinctive 2-of-3 multi-signature mechanism for recovery. Bitkey Wallet Approach Ditches Traditional Seed Phrases Bitkey, conceived and built by Block, Inc. (formerly Square, Inc.), is [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-09T19:04:11.000Z",
    "title": "Tether announces new wallet-freezing policy to boost security—what you need to know",
    "url": "https://www.cryptopolitan.com/tether-announces-new-wallet-freezing-policy/",
    "description": "Tether, the company responsible for the largest stablecoin in the cryptocurrency market, has taken a proactive step in its security measures by announcing a new wallet-freezing policy today. This initiative, decided on December 1, 2023, aligns with the U.S. Office of Foreign Asset Controls (OFAC) regulations, particularly focusing on individuals on the Specially Designated Nationals ... <a title=\"Tether announces new wallet-freezing policy to boost security—what you need to know\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tether-announces-new-wallet-freezing-policy/\" aria-label=\"More on Tether announces new wallet-freezing policy to boost security—what you need to know\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-09T18:49:42.000Z",
    "title": "Bitcoin’s crypto market dominance is at risk – But why?",
    "url": "https://www.cryptopolitan.com/bitcoin-market-dominance-is-at-risk/",
    "description": "Bitcoin has long reigned supreme as the undisputed leader, serving as both the pioneer and benchmark for countless digital assets that followed. However, a growing chorus of voices within the crypto community suggests that Bitcoin&#8217;s once-unassailable market dominance is now facing unprecedented challenges.&#160; The question echoing across forums and trading desks alike is: why is ... <a title=\"Bitcoin&#8217;s crypto market dominance is at risk &#8211; But why?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-market-dominance-is-at-risk/\" aria-label=\"More on Bitcoin&#8217;s crypto market dominance is at risk &#8211; But why?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-09T18:27:00.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: ARB breaks key barrier",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the blockchain world anticipates developments, a third alternative has emerged: scaling solutions. These innovative applications operate on top of a blockchain’s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: ARB breaks key barrier\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: ARB breaks key barrier\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-09T18:12:19.000Z",
    "title": "Ethereum climbs in value despite stalled growth in user numbers",
    "url": "https://www.cryptopolitan.com/ethereum-climbs-value-stalled-growth-users/",
    "description": "In recent weeks, the cryptocurrency market has witnessed a significant resurgence, with Ethereum, the second-largest blockchain network by market capitalization, leading the charge. Ethereum&#8217;s price has soared to a 19-month high of $2,400, marking a remarkable recovery from the 2022 market downturn. This price increase comes when the total market capitalization of cryptocurrencies has expanded ... <a title=\"Ethereum climbs in value despite stalled growth in user numbers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-climbs-value-stalled-growth-users/\" aria-label=\"More on Ethereum climbs in value despite stalled growth in user numbers\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-09T18:09:58.000Z",
    "title": "Why is the Cardano price up today?",
    "url": "https://www.cryptopolitan.com/why-is-the-cardano-price-up-today/",
    "description": "Today&#8217;s surge in the Cardano price can be attributed to a combination of fundamental factors, market sentiment, and broader industry trends. Crypto markets are known for their volatility, and Cardano, with its unique features and active development, is no exception.&#160; Cardano’s price skyrockets As of this writing, Cardano (ADA) is trading at a price of ... <a title=\"Why is the Cardano price up today?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/why-is-the-cardano-price-up-today/\" aria-label=\"More on Why is the Cardano price up today?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-09T19:00:00.000Z",
    "title": "ChatGPT makes price predictions for ORDI, El Hippo, and Terra Luna Classic",
    "url": "https://crypto.news/chatgpt-makes-price-predictions-for-ordi-el-hippo-and-terra-luna-classic/",
    "description": "ChatGPT, an AI model, predicts the price of ORDI, El Hippo, and Terra Luna Classic"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-09T18:50:32.000Z",
    "title": "Crypto advocates blast 2024 US defense bill for nixing digital asset proposals: ‘A missed opportunity’",
    "url": "https://crypto.news/crypto-advocates-blast-defense-bill-nixing-proposals/",
    "description": "The latest U.S. defense bill has left out two crypto regulatory law proposals to cover the parameters surrounding money laundering and examining financial institutions"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-09T18:10:42.000Z",
    "title": "Bitcoin Bull Signal Returns: Exchange Supply Hits Lowest Level Since 2017",
    "url": "https://www.newsbtc.com/news/bitcoin-bull-signal-returns-exchange-supply-hits-lowest-level-since-2017/",
    "description": "On-chain data has revealed an increasing sentiment of holding Bitcoin among investors. Bitcoin has been on a roll since the start of the month, pushing its price to new yearly highs. At the same time, exchange data from CryptoQuant reveals that the crypto might be gearing up for a sustained bull run. According to the on-chain analytics platform, Bitcoin&#8217;s exchange supply, the amount available for purchase on exchanges, has dropped to its lowest levels since 2017  Related Reading: The BONK Bomb: Solana Meme Coin Gets Extra 200% Boost To Its 7,000% Value Appreciation Exchange Supply Drops To Lowest Level In Six Years The Bitcoin market is flashing a bull signal that correlates with anticipation of spot Bitcoin ETF applications. CryptoQuant&#8217;s exchange reserve chart demonstrates that the supply of Bitcoin has been steadily decreasing from centralized exchanges since 2020 when it reached a high of over 3.2 million BTC. The outflow was particularly aggravated in the last quarter of 2022, when the collapse of crypto exchange FTX led to panic and investors started to opt for self-custody in cold wallets. During this period, exchange reserves dropped from 2.512 million BTC to 2.158 million BTC in a month. https://x.com/cryptoquant_com/status/1733005131216744749?s=20  Lowest Supply of #Bitcoin in Six Years &#8220;We are in the 45th month of diminishing supply. For the first time, supply returned to 2017 levels. &#8221; by @1MrPapi Link 👇https://t.co/dY6QyFNit4 — CryptoQuant.com (@cryptoquant_com) December 8, 2023 Reserve on exchanges started to increase slowly in the early months of 2023, climbing back up to 2.240 million in May. However, things started to change in June, as filings by BlackRock and other investment companies for spot Bitcoin ETF trading in the US led to the start of a bullish sentiment.  Bitcoin slightly below the $44K level today. Chart: TradingView.com The reserve on centralized exchanges has been on a steady drop since then. At the time of writing, the exchange reserve has now crossed below 2 million BTC, a level it has yet to reach since December 2017. This metric&#8217;s six-year low is particularly interesting, considering Bitcoin&#8217;s total circulating supply has increased since 2017. Bitcoin&#8217;s total supply now stands at 19,564,812 BTC, a 16% increase from December 2017&#8217;s supply of 16.78 million BTC. Outlook For Bitcoin Price: Bull Signal? Although there are technically more bitcoins now available to go around, the increase in adoption is making it increasingly harder for traders to get a hold of the asset. Dropping exchange supply is a bullish signal for crypto assets and periods of low exchange supply have historically been associated with the beginning of significant Bitcoin bull runs. The last time Bitcoin had a drastic drop in exchange reserve was in 2020, and the crypto would later go on to reach its all-time high the year after. Related Reading: Ethereum Price Soars To Over $2,300 – Is $3,000 Next? Bitcoin is currently spearheading new inflows into the crypto industry, with Coinmarketcap&#8217;s Fear and Greed Index now pointing to an extreme greed of 82. The industry&#8217;s leading asset recently broke over $44,000 for the second time this week and is now up by 14% in a 7-day timeframe. Bitcoin is poised for extreme gains in 2024, and many analysts have predicted a price target above $100,000. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Freepik"
  }
]