[
  {
    "source": "Cointelegraph",
    "date": "2023-08-14T07:48:39.000Z",
    "title": "PayPal to roll out Cryptocurrencies Hub for select users",
    "url": "https://cointelegraph.com/news/paypal-cryptocurrencies-hub-launch",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/5c6c9b53-db1d-4aff-afc4-b55bfa85b014.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Cryptocurrencies Hub is key for PayPal to reinvent itself as a crypto-inclusive platform. The service will allow for the sale and purchase of cryptocurrencies among other functionalities.</p>\n                    <p><p>Payments giant PayPal, soon after launching the <a href=\"https://cointelegraph.com/news/paypal-launches-stablecoin-for-payment\">dollar-backed stablecoin PayPal USD</a> (PYUSD), updated its terms and conditions to introduce Cryptocurrencies Hub — a feature that allows users to hold and interact with Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and cryptocurrencies in their PayPal account.</p><p>The latest PayPal terms and conditions <a href=\"https://www.paypal.com/us/legalhub/cryptocurrencies-tnc#:~:text=If%20you%20establish%20and%20access,convert%20between%20PYUSD%20and%20another\" target=\"_blank\" rel=\"noopener nofollow\">detail</a> the prerequisites for crypto users interested in using the platform for cryptocurrencies. The Cryptocurrencies Hub is key for PayPal to reinvent itself as a crypto-inclusive platform. According to the company, the service will allow for the sale and purchase of cryptocurrencies. In addition, it will facilitate the payment for purchases via PayPal using the money stored after the sale of cryptocurrencies.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/1aa2a9c1-f044-4a77-9fdf-05b11bcdb454.png\"  /><figcaption style=\"text-align: center;\"><em>PayPal Cryptocurrenies Hub as explained in terms and conditions. Source: PayPal</em></figcaption></figure><p>The Cryptocurrencies Hub will also be crucial to convert between PYUSD and other crypto assets. PayPal further clarified:</p><blockquote>“Any balance in your Cryptocurrencies Hub represents your ownership of the amount of each Crypto Asset shown. You will not hold the digital Crypto Assets themselves in your Crypto Asset balance.”</blockquote><p>However, not all PayPal users will get to explore the new feature as the company will decide its access from person to person. For starters, to be eligible for Cryptocurrencies Hub, a PayPal user must have “a personal PayPal account and a Balance Account in good standing.” In addition, PayPal will also verify the required identifying information — which includes name, physical address, date of birth, and taxpayer identification number — provided by the users:</p><blockquote>“You can only use your Cryptocurrencies Hub as part of your Balance Account by accessing it through your personal PayPal account. If you are a Hawaii resident, we will not allow you to establish a Cryptocurrencies Hub at this time.”</blockquote><p>Upon rollout of the feature, Cryptocurrencies Hub will be directly linked to the users’ PayPal account and can be accessed using the existing credentials.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/paypal-s-crypto-holdings-increased-by-56-in-q1-2023-to-nearly-1b\"><strong><em>PayPal’s crypto holdings increased by 56% in Q1 2023 to nearly $1B</em></strong></a></p><p>The launch of PayPal USD divided the crypto community as contradicting speculations around its impact on crypto took center stage.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This is the Ethereum contract address for PayPal&#39;s stablecoin.<br><br>I can&#39;t believe i get to tweet that.<br><br>We&#39;ve come so far. <a href=\"https://t.co/S6kSqcV4ut\">pic.twitter.com/S6kSqcV4ut</a></p>&mdash; RYAN SΞAN ADAMS - rsa.eth (@RyanSAdams) <a href=\"https://twitter.com/RyanSAdams/status/1688588539003387907?ref_src=twsrc%5Etfw\">August 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>While many envision PYUSD to fast-track Ether’s (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) mainstream adoption, it could also spell trouble for decentralization and personal control of assets, warns the community. Several smart contract auditors highlighted that PYUSD’s smart contract contains “freezefunds” and “wipefrozenfunds” functions, which they claim are textbook examples of centralization attack vectors in Solidity contracts.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-14T07:54:16.000Z",
    "title": "SEC partisan divide could alter Bitcoin ETF approval odds, former SEC attorney predicted",
    "url": "https://cryptoslate.com/sec-partisan-divide-could-alter-bitcoin-etf-approval-odds-former-sec-attorney-predicted/",
    "description": "<p>According to former SEC attorney John Reed Stark the current SEC, under the chairmanship of Gary Gensler, is unlikely to approve a Bitcoin spot ETF application centering on significant regulatory concerns, including the ability to prevent fraud and protect investors. The SEC crypto divide. Interestingly, Stark believes the issue of crypto regulation has evolved into [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sec-partisan-divide-could-alter-bitcoin-etf-approval-odds-former-sec-attorney-predicted/\">SEC partisan divide could alter Bitcoin ETF approval odds, former SEC attorney predicted</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-14T07:55:42.000Z",
    "title": "Synesis One launches the world's first NLP AI data crowdsourcing application on Solana Mainnet",
    "url": "https://cryptodaily.co.uk/2023/08/synesis-one-launches-the-worlds-first-nlp-ai-data-crowdsourcing-application-on-solana-mainnet",
    "description": "<p>Zug, Switzerland, August 10th, 2023, Chainwire</p><p class=\"ql-align-justify\">Synesis One, the world&rsquo;s first AI data crowdsourcing platform on the Solana Blockchain, announced today the launch of its new Train2Earn App &lsquo;Workspace by Synesis&rsquo; on iOS, Android, Saga, and web browsers. The App allows anyone, anywhere in the world to train AI and earn rewards.</p>&ldquo;The Workspace App is a significant leap forward in our mission to provide high quality data to companies developing AI applications,&rdquo; said Paul Lee M.D., Cofounder and CEO of Synesis One. &ldquo;We designed the Synesis One platform to connect companies that need quality AI training data with digital workers who can generate the data quickly, and at competitive prices.&rdquo;<p class=\"ql-align-justify\">The need for high-quality data to train and refine AI models is growing at an exponential rate, as nearly every industry from financial services to health care is starting to integrate AI into their business processes. Without data, AI models are basically useless: they can't make connections or find patterns or make predictions. That&rsquo;s why humans are still needed to train AI systems.&nbsp;</p>&ldquo;We&rsquo;re a bit like Wikipedia,&rdquo; says Paul. &ldquo;Synesis One workers are contributing and refining data every day. But unlike Wikipedia, our contributors are paid for their contributions. That's why we call our business model Train2earn. They train AI and earn rewards.&rdquo;The applications for Synesis One are limitless. &ldquo;Train2Earn is the first enterprise-quality on-chain software where business logic is conducted entirely on blockchain,&rdquo; said Synesis One Head of Product and CTO David Saccon. &ldquo;This means the provenance of our crowdsourced data is fully traceable and auditable. We believe we are providing a critical component for a new type of open data supply chain to power AI applications.&rdquo;<p class=\"ql-align-justify\">In addition to crypto payments, the Train2Earn platform also uses the blockchain to enable a public voting process in which contributors reach consensus about the quality of the submitted data. The result is a web3 application that is secure, decentralized, and interoperable.</p><p class=\"ql-align-justify\">Synesis One&rsquo;s first client is Mind AI, which is building an advanced natural language reasoning engine. The Synesis One community is helping their team of computer scientists crowdsource the 'mental map' the engine needs to make sense of the world. By training the engine, contributors are also helping humanity achieve the goal of general artificial intelligence.&nbsp;</p><p class=\"ql-align-justify\">The Train2Earn mobile app is now available for download on the App Store, Google Play Store, and Saga phone App marketplace.</p><p class=\"ql-align-justify\">For more information about Synesis One and the Train2Earn mobile app, please visit www.synesis.one.</p><p>About Synesis One</p><p class=\"ql-align-justify\">Synesis One was founded in 2021 to crowdsource data needed to train a conversational reasoning engine for sister company Mind AI. The platform connects corporate clients in need of AI training data with crowdsourced human intelligence to provide it. The company raised $9.5 million to fund development of the platform and data ecosystem.</p><p>&nbsp;For more information: Website | Telegram&nbsp;| Twitter&nbsp;| Medium | Discord</p>ContactHead of GrowthIsaac BangSynesis Onehello@synesis.one"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T07:54:32.000Z",
    "title": "Shiba Inu’s Meteoric Rise: A Glimpse into the Shibarium Launch ",
    "url": "https://www.cryptopolitan.com/shiba-inus-a-glimpse-into-shibarium-launch/",
    "description": "The cryptocurrency world is no stranger to volatility, with new tokens emerging and old ones fading away. Yet, amidst this ever-changing landscape, Shiba Inu (SHIB) has managed to carve a niche for itself. Known for its meme-inspired beginnings, SHIB has transformed from a mere internet joke to a formidable player in the crypto arena. As ... <a title=\"Shiba Inu&#8217;s Meteoric Rise: A Glimpse into the Shibarium Launch \" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inus-a-glimpse-into-shibarium-launch/\" aria-label=\"More on Shiba Inu&#8217;s Meteoric Rise: A Glimpse into the Shibarium Launch \">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T07:49:39.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX (WRX) is $0.117, accompanied by a 24-hour trading volume of $61.59 million. The market capitalization stands at $49.13 million, and WazirX holds a market dominance of 0.00%. Over the past 24 hours, the WRX price has witnessed a 0.62% increase. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T07:47:05.000Z",
    "title": "Filecoin Price Prediction 2023-2032: What’s the future for FIL?",
    "url": "https://www.cryptopolitan.com/filecoin-price-prediction/",
    "description": "Filecoin Price Prediction 2023-2032 How much is Filecoin (FIL) worth? Today&#8217;s Filecoin price is $4.10, with a 24-hour trading volume of $101,148,403. Filecoin is down 0.53% in the last 24 hours. The current CoinMarketCap ranking is #30, with a market cap of $1,931,939,927. It has a circulating supply of 438,146,575 FIL coins, and the max. ... <a title=\"Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/filecoin-price-prediction/\" aria-label=\"More on Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-14T07:41:48.000Z",
    "title": "Grayscale CEO Advocates for Balanced Crypto Regulation to Foster Innovation",
    "url": "https://www.cryptopolitan.com/grayscale-ceo-balanced-crypto-regulation/",
    "description": "In a recent interview with Fox Business, Grayscale Investments CEO Michael Sonnenshein expressed concerns about the current regulatory approach of the U.S. Securities and Exchange Commission (SEC) towards the cryptocurrency industry. Sonnenshein emphasized the potential repercussions for the U.S. economy if the SEC persists in its piecemeal approach to crypto regulation. The SEC&#8217;s Enforcement Actions ... <a title=\"Grayscale CEO Advocates for Balanced Crypto Regulation to Foster Innovation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/grayscale-ceo-balanced-crypto-regulation/\" aria-label=\"More on Grayscale CEO Advocates for Balanced Crypto Regulation to Foster Innovation\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-08-14T07:54:01.000Z",
    "title": "Top 6 Trending Cryptocurrencies For Trading This Week: HBAR, BAKE, APE, LIT, BLZ, RUNE",
    "url": "https://nulltx.com/top-6-trending-cryptocurrencies-for-trading-this-week-hbar-bake-ape-lit-blz-rune/",
    "description": "LunarCrush, a social media analytics platform for crypto, has revealed the top trending cryptocurrencies for trading this week. The coins on the list have seen a significant increase in social media mentions and activity, which could indicate that they are poised for further price gains. The top trending coins for trading this week are: HBAR [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-14T07:43:41.000Z",
    "title": "THORChain (RUNE) gains 48% in one week",
    "url": "https://crypto.news/thorchain-rune-gains-48-in-one-week/",
    "description": "THORChain (RUNE) has been constantly losing value since April 2022 with a few hikes. The asset rose by 48% over the past seven days, reaching a key milestone of $1.42 on Aug. 13. According to data provided by Santiment, the&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-14T08:00:09.000Z",
    "title": "Goldman Foresees Q2 2024 Fed Rate Cut: A Boost For Bitcoin?",
    "url": "https://www.newsbtc.com/news/bitcoin/goldman-foresees-q2-2024-fed-rate-cut-boost-bitcoin/",
    "description": "In a recent note that has caught the attention of both traditional financial markets and the Bitcoin community, Goldman Sachs economists, including the renowned Jan Hatzius and David Mericle, have made a significant prediction regarding the Federal Reserve&#8217;s monetary policy. The note suggests that the Federal Reserve may commence a series of interest rate cuts by the end of June 2024. “The cuts in our forecast are driven by this desire to normalize the funds rate from a restrictive level once inflation is closer to target,” the Goldman economists wrote. This statement underscores the bank&#8217;s belief that the Federal Reserve&#8217;s current stance on interest rates may be too restrictive, especially if inflation rates continue to trend towards the central bank&#8217;s target. The note further elaborates: “Normalization is not a particularly urgent motivation for cutting, and for that reason we also see a significant risk that the FOMC will instead hold steady.” This cautious tone suggests that while Goldman Sachs is predicting a rate cut, they also acknowledge the unpredictability of the Federal Reserve&#8217;s decisions. Related Reading: US Bitcoin ETF Approval Could See North America’s ETF Volume Rise To 99.5% The recent data, which showed US inflation rising at a slower-than-expected rate of 3.2%, with the core consumer price index at a 4.7% annual pace, further complicates the picture. With the Fed&#8217;s benchmark rate currently set between 5.25% to 5.5%, Goldman Sachs expects it to stabilize around 3 to 3.25%. What Does This Mean For Bitcoin Price? Expectations of a rate cut from Goldman Sachs are in line with market expectations according to the CME FedWatch Tool. In May 2024, 68% already expect there to be at least a 25 basis point (bps) rate cut. However, it remains to be seen whether macro events will influence the Bitcoin price again. In the last few months, BTC increasingly decoupled from macro events while the stock market rallied towards all-time highs and stagnated around the $30,000 mark. Related Reading: Want A Bitcoin Spot ETF? Then Prove BTC Is Not Manipulated, Says SEC Interestingly, the timing could be very positive for the Bitcoin market. On the one hand, March 15, 2024 is the final deadline for spot Bitcoin ETF filings from BlackRock, Fidelity, Investco, VanEck, and WisdomTree; on the other hand, Bitcoin halving is coming up at the end of April (currently expected on April 26). The high expectations for these two events, coupled with a dovish monetary policy from the Federal Reserve, could be a massive catalyst for the Bitcoin price. At press time, BTC traded at $29,426 and saw another calm weekend amid the liquidity summer drought. Breaking above $29,550 is key to establish any bullish momentum to initiate another push towards $30,000. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-14T08:00:15.000Z",
    "title": "SUI and ApeCoin Face Downward Trend While Borroe ($ROE) Soars High in Presale",
    "url": "https://www.crypto-news-flash.com/sui-and-apecoin-face-downward-trend-while-borroe-roe-soars-high-in-presale/?utm_source=rss&utm_medium=rss&utm_campaign=sui-and-apecoin-face-downward-trend-while-borroe-roe-soars-high-in-presale",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-24.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-24.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-24-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-24-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-24-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-24-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Amid the recent volatility in the market, Sui (SUI) and Apecoin (APE) find themselves grappling with the formidable challenge of maintaining price stability. In the midst of these undulating shifts, a fresh luminary emerges on the horizon – Borroe ($ROE). As we delve deeper into the intricacies of these trends, we uncover the remarkable ascent [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-14T07:44:40.000Z",
    "title": "From White House to Ethereum: President Donald Trump Bets Big on ETH – Is Price Poised to Reach $2,500? Report",
    "url": "https://www.crypto-news-flash.com/from-white-house-to-ethereum-president-donald-trump-bets-big-on-eth-is-price-poised-to-reach-2500-report/?utm_source=rss&utm_medium=rss&utm_campaign=from-white-house-to-ethereum-president-donald-trump-bets-big-on-eth-is-price-poised-to-reach-2500-report",
    "description": "<img width=\"1920\" height=\"1054\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/trump-3508121_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/trump-3508121_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/trump-3508121_1920-300x165.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/trump-3508121_1920-1024x562.jpg 1024w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Former President Donald Trump reportedly holds between $250,000 to $500,000 in Ethereum (ETH). Trump&#8217;s involvement with Ethereum correlates with his NFT ventures which raised over $8.9 million. After diving deep and cross-checking with trusted sources like Forbes and Binance Feed, our team has uncovered that former US President Donald Trump has a sizeable chunk in [...]"
  }
]