[
  {
    "source": "Cointelegraph",
    "date": "2023-11-16T14:23:16.000Z",
    "title": "Boosting blockchain adoption by keeping tech on the back end ",
    "url": "http://cointelegraph.com/news/blockchain-adoption-tech-back-end",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/f18cdb08-6f0c-4a0f-9889-cc65e3dc7ba7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Builders are increasingly looking to streamline their applications with more familiar interfaces to onboard new users,</p>\n                    <p><p>Understanding the difference between the front and back end is crucial with Web3 technology. The term “front end” describes the portion of Web3 applications that consumers interact with directly. This includes the technology’s user-facing side, websites and decentralized applications (DApps). </p><p>The back end, on the other hand, refers to the complex system that supports these Web3 applications. Everything from distributed ledgers and smart contracts to consensus protocols is included here.</p><p>However, accessibility and simplicity are important for the adoption of Web3. When the technical complexities of Web3 are too prominently featured on the front end — such as managing cryptographic keys or understanding blockchain concepts — it can alienate a significant portion of potential users. It is important to make the user experience and interactions smooth and easy to understand so that the end-user doesn’t have to worry about the technical details.</p><p>By prioritizing accessibility and simplicity, Web3 technology can be more inviting to diverse users. This approach helps bridge the gap between early adopters well-versed in blockchain technology and the broader mainstream audience. </p><p>Harrison Hines, CEO and co-founder of Fleek, a Web3 app development platform, told Cointelegraph, “Simplicity and accessibility were key to the mainstream growth of computers, smartphones, mobile apps and even very recently with AI. Concealing technical complexities on the back end follows the same logic. Developers are also end users, and they need tools/infrastructure that is easy to use and build with.”</p><h2>Benefits of hiding Web3 in the back end</h2><p>User experience can be improved by making blockchain-based apps easier to navigate. When users are shielded from the technical complexities associated with blockchain technology and cryptographic keys, they can engage with Web3 applications in a manner that feels similar to using traditional web applications. This streamlined experience encourages users to explore and adopt Web3 applications without being intimidated by their complexity.</p><h3>Simplified onboarding for non-technical users</h3><p>When the onboarding process is straightforward, individuals unfamiliar with blockchain technology can quickly get started with Web3 applications. This approach reduces the learning curve and empowers a more extensive and diverse user base to access the benefits of Web3 without needing a deep understanding of its technical aspects.</p><p>For example, Immutable Passport simplifies the onboarding process for WAGMI Defense users by offering a straightforward and password-free sign-up experience. With just a few taps, users can create an account, eliminating the need for password management. In conjunction, Passport establishes a noncustodial wallet in the background, providing a secure repository for users’ digital assets.</p><p><strong><em><a href=\"https://cointelegraph.com/magazine/breaking-into-liberland-dodging-guards-decoys-and-diplomats/\">Magazine: Breaking into Liberland: Dodging guards with inner-tubes, decoys and diplomats</a></em></strong></p><p>Authentication options are streamlined, allowing users to choose from well-known methods such as Google, Apple or email sign-ins. </p><p>Passport’s interoperability feature also allows for seamless logins across all games and marketplaces within the Immutable ecosystem.</p><p>This approach ensures a user-friendly experience, particularly for those not familiar with Web3 technologies. <a href=\"https://medium.com/@wagmi/wagmi-defense-first-mobile-title-in-the-immutable-ecosystem-with-passport-integration-444bb816323e\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to Web3 gaming franchise WAGMI Games, this feature enables it to onboard more players.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/4d9a92c7-0a38-4591-9e30-5223fb81982c.png\"  /><figcaption style=\"text-align: center;\">Immutable Passport enables social login for gaming platforms like WAGMI Games. Source: WAGMI </figcaption></figure><p>Kostas Kroustaloudis, development director at WAGMI Games, told Cointelegraph, “Simplifying the onboarding process for non-technical users is pivotal to driving mainstream adoption of Web3 technology. The majority of individuals have little patience for intricate, technical interfaces.”</p><p>Kroustaloudis continued, “In fact, the likelihood of someone uninstalling an app skyrockets with each additional click or tap required to reach their goal. This is especially crucial when introducing gamers to new titles. The difference between success and failure can often hinge on the reduction of just one extra click.” </p><h2>Attracting more users and developers</h2><p>Keeping Web3 tech in the back end can help to bridge the gap between early adopters and mainstream users, expanding the Web3 user base beyond the tech-savvy and blockchain enthusiasts. As Web3 applications become indistinguishable from their traditional counterparts in terms of user experience, they are more likely to attract users who might have hesitated to explore the technology due to its perceived complexities.</p><p>According to some experts, making it easier to build apps that hide Web3 components in the back end can attract more developers, bringing more Web3 apps to market.</p><p>Fleek’s Hines said, “The main benefit is making it easier and more accessible for more developers to build applications using Web3 technologies in their backends.”</p><p>Hines continued, “It’s just a numbers game. The more developers you have building more Web3-powered applications, the more likely (and faster) you are to start finding those breakout success apps that bring mainstream adoption. It’s the same as we saw happen in Web2 and mobile. Users discovering new Web3 apps that they enjoy is what will encourage them to try others.”</p><h2>Minimizing user errors and risks</h2><p>The back-end concealment of Web3 technology has the additional benefit of minimizing user errors and risks. When users are not exposed to technical complexities, there is a reduced likelihood of making critical mistakes, such as mishandling cryptographic keys or engaging in unsafe transactions. </p><p>This is especially important in decentralized finance applications, where minor errors can lead to significant financial losses.</p><h2>Minimizing user errors and risks</h2><p>One notable example of a back-end Web3 implementation is the Ethereum Name Service (ENS). ENS allows users to replace lengthy, cryptic Ethereum addresses with human-readable domain names. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/3f54882c-33d1-4f64-a7e5-175176e97be0.png\"  /><figcaption style=\"text-align: center;\">ENS enables human-readable names for wallets. Source: ENS</figcaption></figure><p>This technology can be integrated into applications, providing users with a seamless experience. Users can send cryptocurrency to “john.eth” instead of “0x4cbe58a94d991087fa2dc648b1e33f55dbb53f4f2,” making transactions less prone to errors.</p><p>Coinbase employs cb.id usernames, an ENS domain form, to streamline cryptocurrency transfers and user interaction. These usernames are associated with the ENS infrastructure, simplifying complex wallet addresses by offering a human-readable alternative. </p><p>In addition to this, cb.id usernames automatically redirect web users to the respective Web3 profiles on profile.coinbase.com.</p><p>Regarding blockchain gaming, WAGMI Games is another example. Its WAGMI Defence mobile app uses a free-to-play business model and features a familiar user experience. Players start by obtaining a free basic card set. Suppose a player wishes to participate in more challenging games with the chance of higher ranks and potential awards. In that case, they can purchase NFT characters with real money, similar to traditional apps.</p><p>While the blockchain serves as the foundation for the game’s technology, players interact with the game via a more traditional interface. This design can lessen the perceived complexity and difficulty of using blockchain and NFT features, making them more accessible to a wider audience.</p><h2>Actionable advice</h2><p>For builders looking to create more user-friendly and seamless Web3 apps, one key consideration is the implementation of gas optimization strategies. Gas fees are an inherent part of many blockchain transactions and can be a significant barrier for users. </p><p>Builders can improve the gas fee problem by using layer-2 solutions like state channels, diverting transactions off the main chain, reducing congestion and enhancing user experience, especially for gaming DApps. </p><p>Additionally, they can choose low-fee blockchains like BNB Smart Chain, Solana or Polkadot to create budget-friendly environments, especially for microtransactions.</p><p>Kroustaloudis agreed, telling Cointelegraph, “Gas fees, particularly in the context of apps reliant on microtransactions, can be a significant hurdle. Even a $0.10 gas fee, when incurred frequently, can prove problematic. With the emergence of various new L2 chains like Coinbase’s BASE and Immutable’s L2 solution, gas fees cease to be a concern.”</p><blockquote>“Depending on the app’s nature, choosing to build on layer 2s becomes an obvious choice for achieving mass adoption. To embark on this journey, developers should thoroughly research their target users’ needs and determine the most suitable gas optimization strategy for their project.”</blockquote><p>Zero-knowledge (ZK) technology, specifically ZK-rollups, can reduce the load on the main chain by batching off-chain transactions into a single smart contract, offering faster confirmation times and lower fees. Builders can integrate ZK-rollups to make their applications more efficient and cost-effective while enhancing the user experience.</p><p><strong><em><a href=\"https://cointelegraph.com/news/new-york-moma-token-art-nfts\">Recent: New York MoMA now has tokenized artworks in its permanent collection</a></em></strong></p><p>Builders should also consider optimizing for mobile devices. Many users access Web3 apps on their smartphones, so ensuring an app is mobile-responsive and functions seamlessly on various screen sizes and devices is crucial for widespread adoption.</p><p>For users planning to use Web3 apps, it’s essential to maintain awareness and knowledge about the technology. Web3 and blockchain are evolving rapidly, and staying informed about the latest developments, security best practices and user guidelines can help users make informed decisions to protect their digital assets.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-16T14:18:53.000Z",
    "title": "AI identity platform combats ownership and deep fakes ",
    "url": "http://cointelegraph.com/news/ai-identity-platform-combats-ownership-and-deep-fakes",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/cffe3842-b11b-46ba-bd7d-002d4d2907f5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The new AI identity platform Hollo.AI takes on key topics of transparency, ethical use and content sovereignty in the age of rampant AI-generated deep fakes. </p>\n                    <p><p>The rise of artificial intelligence (AI) has introduced new possibilities for human expression and capabilities to create content. Simultaneously, the ability to do almost anything and to do so with a digital AI-generated identity has caused new problems to troubleshoot. </p><p>According to <a href=\"https://terranovasecurity.com/blog/deepfake/#:~:text=The%20rise%20of%20deepfake%20imagery,from%200.1%25%20to%204.6%25.\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from Sumsub, deep fake fraud more than doubled from 2022 in the first quarter of 2023 from 0.2% to 2.6%, in the United States. </p><p>In recent months there have been multiple instances of celebrities like actors Tom Hanks and Jennifer Aniston, and YouTube personality Mr. Beast <a href=\"https://cointelegraph.com/news/tom-hanks-mrbeast-gayle-king-ai-deep-fakes-scams\">calling out deep fakes</a> that used their digital fakes to sell products. </p><p>However, a California-based studio announced the launch of a platform on Nov. 16, Hollo.AI, that allows users to claim their AI-identity or “persona,” along with a personalized chatbot to monetize and verify their AI work. </p><p>Hollo.AI says that this “ethical use of AI” is made possible through blockchain technology verification. Rex Wong, the CEO of the platform told Cointelegraph that creators and personalities will be able to take “sovereign ownership” of their AI through the platform’s verified AI registry. </p><blockquote>“The registry serves as a public registry ledger that offers AI identities, once verified by Hollo.AI, to be logged on the blockchain for all to see.”</blockquote><p>Creators will receive a blue check mark for verified identities, which will then give them control over when, where and how this identity can be used, and then earn revenue through any licensing of that identity. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/open-ai-launches-chatgpt-enterprise-for-business\"><strong><em>OpenAI debuts ChatGPT Enterprise — 4 times the power of consumer version</em></strong></a></p><p>Wong told Cointelegraph that the services work similarly to credit identity theft protection, but are tailored to safeguard AI identities. </p><blockquote>“They monitor and alert users of unauthorized uses of their digital personas, helping to prevent the spread and impact of deep fakes.”</blockquote><p>In addition to monitoring for unauthorized uses, Wong elaborated that Hollo.AI intends to help users after such use is detected to assist in resolving fraud cases. </p><p>He said that “empowerment” in this area is crucial in a time where “digital identities can be easily replicated and misappropriated for unauthorized use.” </p><p>Once a user has created an AI “digital twin” on the platform, it “continues learning” based on the user’s social links provided to create a more accurate digital identity. </p><p>While Hollo.AI is trying to tackle these issues of transparency and ethical use of AI for creators and viewers, these topics are also on the table within other institutions and platforms. YouTube recently <a href=\"https://cointelegraph.com/news/youtube-creators-must-disclose-gen-ai-use-or-face-suspension\">updated its community guidelines</a> to include more AI transparency measures.</p><p>The entertainment industry union SAG-AFTRA is currently<a href=\"https://cointelegraph.com/news/sag-aftra-strike-ends-as-ai-deal-reached-hollywood-still-torn\"> negotiating final terms </a>with major Hollywood studios over the use of AI-generated “digital twins” for its actors, after a 118-day strike which had the AI topic as one of its critical terms. </p><p><strong><em>Magazine: ‘</em></strong><a href=\"https://cointelegraph.com/magazine/ai-killed-translation-industry-easytranslate-boss-change-human-jobs/\"><strong><em>AI has killed the industry’: EasyTranslate boss on adapting to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-16T14:35:38.000Z",
    "title": "Bitcoin whale activity surges, hits 30% of total transaction volume",
    "url": "https://cryptoslate.com/insights/bitcoin-whale-activity-surges-hits-30-of-total-transaction-volume/",
    "description": "<p>Quick Take A noticeable resurgence of whale activity, involving transactions of $10 million or more, has been observed in the entity-adjusted relative on-chain volume breakdown. The volume of these large-scale transactions recently breached the 30% mark of all transactions, an occurrence only seen once this year during a brief period in October. Currently, in 2023, [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoin-whale-activity-surges-hits-30-of-total-transaction-volume/\">Bitcoin whale activity surges, hits 30% of total transaction volume</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-16T14:28:07.000Z",
    "title": "Solana (SOL) Upholds Its Reign Amid Crypto Unrest, But Are Its Greatest Gains Ahead?",
    "url": "https://cryptodaily.co.uk/2023/11/solana-sol-upholds-its-reign-amid-crypto-unrest-but-are-its-greatest-gains-ahead",
    "description": "Dive into the unique journey of Solana (SOL) as it maintains its gold standard in the altcoin market. Our concise analysis covers its resilience amidst crypto volatility and its potential for major gains. As SOL navigates crucial market levels, we evaluate its prospects against struggling counterparts. Stay updated and make informed decisions in the fast-paced world of cryptocurrencies with our focused insights."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-16T14:20:23.000Z",
    "title": "MetaWin Unveils 'MetaWin Millionaire': A Revolutionary $1 Million Cryptocurrency Giveaway",
    "url": "https://cryptodaily.co.uk/2023/11/metawin-unveils-metawin-millionaire-a-revolutionary-1-million-cryptocurrency-giveaway",
    "description": "MetaWin Unveils 'MetaWin Millionaire': A Revolutionary $1 Million Cryptocurrency Giveaway"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-16T14:39:01.000Z",
    "title": "South Korean exchanges double market share in 2023",
    "url": "https://crypto.news/south-korean-exchanges-double-market-share-in-2023/",
    "description": "In the last two months, traders from South Korea have largely contributed to the active growth in the volume of the cryptocurrency market."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-16T14:17:50.000Z",
    "title": "CertiK and ZachXBT impersonators stole over $300k in crypto",
    "url": "https://crypto.news/certik-and-zachxbt-impersonators-stole-over-300k-in-crypto/",
    "description": "Fraudsters have created multiple fake accounts on X, impersonating crypto scam investigators CertiK and ZachXBT. Scammers are now cloning legitimate crypto investigators by impersonating them on X to defraud victims. Crypto sleuth ZachXBT has warned users in an X post&#8230;"
  }
]