[
  {
    "source": "Decrypt",
    "date": "2023-07-18T22:54:22.000Z",
    "title": "'Neopets' Cancels NFT Game After Raising Money From Polygon, Avalanche",
    "url": "https://decrypt.co/149074/neopets-cancels-nft-game-after-raising-money-from-polygon-avalanche",
    "description": "Despite $4 million in funding from crypto firms, Neopets is ditching NFTs—and making a game that can \"better reflect our values and vision.\""
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-18T22:55:40.000Z",
    "title": "Nevada court orders Prime Trust into temporary receivership",
    "url": "https://cryptoslate.com/nevada-court-orders-prime-trust-into-temporary-receivership/",
    "description": "<p>Nevada courts have ordered Prime Trust, a prominent crypto custodian now facing financial troubles, into temporary receivership on July 18, officials confirmed. The Eighth Judicial District Court of Nevada has approved a petition from the Nevada Financial Institutions Division (NFID) that will place Prime Trust into temporary receivership. John Guedry, formerly an executive at the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/nevada-court-orders-prime-trust-into-temporary-receivership/\">Nevada court orders Prime Trust into temporary receivership</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-18T23:00:13.000Z",
    "title": "Wallex․US Launches New Non-Custodial Crypto and DeFi Wallet App",
    "url": "https://news.bitcoin.com/wallex%e2%80%a4us-launches-new-non-custodial-crypto-and-defi-wallet-app/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/wallexus-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/wallexus-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/wallexus-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/wallexus-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/wallexus-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/wallexus-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/wallexus-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/wallexus.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Fintech company Wallex.US has launched a new non-custodial crypto and defi wallet app. The app offers a secure and encrypted way to store, send, and receive more than 150 cryptocurrencies. It also provides real-time chart monitoring and analysis capabilities, as well as easy Pay &#38; Get Paid function. The app is designed to be safe, [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-18T23:01:00.000Z",
    "title": "Reddit’s Moons and Bricks tokens skyrocket amidst terms of service change",
    "url": "https://crypto.news/reddits-moons-and-bricks-tokens-skyrocket-amidst-terms-of-service-change/",
    "description": "The native tokens of Reddit&#8217;s r/CryptoCurrency community, Moons (MOON) and Bricks (BRICK) have recorded an impressive triple-digit price gain this week following an announced change in Reddit&#8217;s terms of service. The cryptocurrency Moons (MOON) associated with Reddit&#8217;s r/CryptoCurrency community, which&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-18T23:00:54.000Z",
    "title": "Why This Upcoming Event Is Bearish For Axie Infinity (AXS)",
    "url": "https://www.newsbtc.com/axs/upcoming-event-is-bearish-for-axie-infinity/",
    "description": "Axie Infinity (AXS) continues to be one of the top performers in the market even though the bear market trend. However, an upcoming token unlock event could put an end to the alt coin’s bullish trend given the amount of tokens involved. $21.7 Million In AXS Set To Be Unlock The upcoming Axie Infinity (AXS) token unlock event is the most notable unlock happening this week. Out of the total $27.4 million in tokens set to be unlocked across the space today, AXS unlocks make up the vast majority. Related Reading: Bearish Signal: BNB Open Interest Skyrockets To New Highs According to the token tracking website Token Unlocks, a total of 3.43 million tokens are set to be unlocked in four days on July 22. Going by the current price of AXS tokens at the time of this writing, this translates to $21.55 million in tokens. $21.55 million in AXS tokens set to be unlocked &#124; Source: Token Unlocks This next unlock will see another 2.96% of the total 270 million supply being sent back into circulation. However, unlike its last token unlock held on April 23, the entirety of this token unlock is going toward staking rewards for users of the platform. Will This Affect The Axie Infinity Token Price? The Axie Infinity (AXS) token unlock will no doubt put bearish pressure on the price of the digital asset. This is because the unlock will increase the circulating supply amid declining demand in the market. As such, AXS&#8217;s price could see a decline from July 22. However, it is important to note that as these tokens are only going toward staking, they will likely not hit the market at the same time. Such staggered introduction into the market could mitigate selling pressure, giving the buyers time to garner enough demand to offset the new supply. AXS price at $6.24 &#124; Source: AXSUSD on TradingView.com This is possible though as long as the general crypto market does not succumb to the bear pressure current mounting. If Bitcoin is able to recover above $31,000 once more, then coins like AXS will benefit as market sentiment recovers. Related Reading: Crypto Liquidations Cross $300 Million Amid Massive Market Recovery For now, AXS is still holding steady compared to others in the space. The altcoin is currently changing hands at a price of $6.24, recording a 0.32% decline in the last 24 hours, but seeing 6.86% gains on the 7-day chart. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from Crypto Ticker, chart from TradingView.com"
  }
]