[
  {
    "source": "CoinDesk",
    "date": "2024-03-26T16:00:00.000Z",
    "title": "Layer-1 Blockchain WAX Signs Deal With Amazon Web Services",
    "url": "https://www.coindesk.com/business/2024/03/26/layer-1-blockchain-wax-signs-deal-with-amazon-web-services/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Layer-1 blockchain Worldwide Asset Exchange (WAX) signed a deal to use Amazon Web Services (AWS) and integrate the WAX network into the Amazon Managed Blockchain (AMB) service."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-26T16:00:00.000Z",
    "title": " Where is Bitcoin heading next? Market experts chime in ",
    "url": "https://cointelegraph.com/news/where-bitcoin-heading-next-market-experts-chime-in",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMmZhNDM4NTAtMTBhMS00ZTk0LWE5YTgtNWU4ZWJmYWEyNGUwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Four market experts assess the current state of the Bitcoin market and where it is heading next. </p>\n                    <p><p data-ct-non-breakable=\"true\">After reaching all-time highs in early March, Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) experienced a sharp correction and then entered a period of consolidation. With less than a month left before the <a href=\"https://cointelegraph.com/news/navigating-the-post-halving-landscape-what-to-expect-for-bitcoin-s-price-and-network-security\">Bitcoin halving</a> takes place, many market participants are wondering whether the top is in or if there will be another leg up, and if so, when the next upward movement is likely to come.</p><p>To answer these questions, the latest Cointelegraph video gathers the opinions of four market experts: professional trader Alessio Rastani, Cointelegraph analyst Marcel Pechman, YouTuber Scott Melker and market analyst Michaël van de Poppe.</p><p>Each expert gives their assessment of the factors behind the latest correction and also evaluates different scenarios. Despite different points of view, most of them agree that there will likely be a period of consolidation for a few months before Bitcoin resumes its upward trend. As in previous cycles, the experts agree that the Bitcoin halving won’t have any major short-term impact on prices but will play a major role in the long run. </p><p><a href=\"https://cointelegraph.com/news/where-bitcoin-heading-next-market-experts-chime-in\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-26T15:47:12.000Z",
    "title": "Web3 fills the void at GDC 2024 as traditional gaming reels from layoffs",
    "url": "https://cryptobriefing.com/web3-void-gdc-traditional-gaming-layoffs/",
    "description": "GDC 2024 showcased web3 gaming as traditional studios pulled back."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-26T15:48:58.000Z",
    "title": "Trump Media & Technology Group (DJT) Stock Soars on Its Nasdaq Debut, Adding Billions of Dollars to Trump’s Net Worth",
    "url": "https://www.cryptoglobe.com/latest/2024/03/trump-media-technology-group-djt-stock-soars-on-its-nasdaq-debut-adding-billions-of-dollars-to-trumps-net-worth/",
    "description": "In a move that marks former President Donald Trump’s return to the forefront of public trading, his Truth Social platform commenced trading under the ticker “DJT” on Tuesday, as reported by CBS News. This venture positions Trump, identifiable by his initials, at the control of a publicly traded entity once more, with the shares of […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-26T16:10:01.000Z",
    "title": "South Korean police nab duo for $4.1M crypto scam",
    "url": "https://www.cryptopolitan.com/south-korean-police-nab-duo-4-1m-crypto-scam/",
    "description": "South Korean police have arrested two individuals for defrauding a senior citizen of 5.5 billion won ($4.1 million) through a cryptocurrency investment scam. The arrests were made by the Haeundae Police Station in Busan, targeting two men in their 20s and 30s.&#160; Between September and December 2022, the suspects convinced the victim to send a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-26T16:08:04.000Z",
    "title": "Appen Unveils New Platform for Customizing Large Language Models",
    "url": "https://www.cryptopolitan.com/appen-unveils-new-platform-for-large-models/",
    "description": "Appen Limited (ASX: APX), a global leader in data solutions for AI development, has announced the launch of its latest platform capabilities designed to assist enterprises in customizing large language models (LLMs). This new solution aims to streamline the process for businesses looking to integrate generative AI into their operations, facilitating the development of AI [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-26T16:07:57.000Z",
    "title": "London Stock Exchange to launch Bitcoin and Ethereum ETNs",
    "url": "https://www.cryptopolitan.com/london-stock-exchange-bitcoin-ethereum-etns/",
    "description": "London is once again grabbing the financial world by the horns. This time, it’s not about tea, crumpets, or the rainy weather we all pretend to love. No, it&#8217;s about the London Stock Exchange (LSE) rolling out the red carpet for Bitcoin and Ethereum Exchange Traded Notes (ETNs) starting May 28, 2024. Aimed squarely at [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-26T16:04:41.000Z",
    "title": "Unlocking the Best Online Casino Bonus Offers: Your Ultimate Guide",
    "url": "https://www.cryptopolitan.com/unlocking-the-best-online-casino-bonus-offers-your-ultimate-guide/",
    "description": "Bonuses provide players with opportunities to increase their winning potential without risking more cash on the casino. However, since there are so many of them in various casinos, it may be hard to pick the best ones. Here is a guide to choosing the best offers to increase your earnings. Understand Various Terms The terms [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-26T15:42:36.000Z",
    "title": "KuCoin faces US money laundering charges",
    "url": "https://crypto.news/kucoin-united-states-money-laundering/",
    "description": "The U.S. Department of Justice alleges that KuCoin and its two founders were knowingly involved in money laundering."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-26T16:00:18.000Z",
    "title": "Ripple CEO Responds To SEC’s Shocking $2 Billion Demand",
    "url": "https://www.newsbtc.com/news/ripple/ripple-ceo-sec-2-billion/",
    "description": "In a rather shocking development, the United States Securities and Exchange Commission (SEC) has demanded a $2 billion sanction against Ripple. Responding to the startling demands, Ripple’s Chief Executive Officer (CEO), Brad Garlinghouse has taken a firm stance against the agency’s demands, determined to expose the true nature of the SEC. Ripple CEO Criticizes SEC’s Demands Stuart Alderoty, the Chief Legal Officer (CLO) of Ripple recently disclosed in a post on X (formerly Twitter) that the US SEC has petitioned a Judge for $2 billion in fines and penalties against Ripple. According to the Ripple CLO, the SEC is in a relentless pursuit to “punish and intimidate Ripple,” rather than faithfully applying the law.  Related Reading: Bitcoin To $50,000 Or $80,000? Crypto Expert Predicts Where Price Is Headed Next Challenging the SEC’s $2 billion penalty, Garlinghouse emphasized that the agency has consistently operated beyond the bounds of law in various enforcement actions. He disclosed that Judges have also taken note of the SEC’s actions, previously admonishing the agency for its extensive abuse of power entrusted to it by Congress.  The Ripple CEO also criticized the SEC’s penalty demand, arguing that it lacks precedent and justification, particularly given the absence of any allegations, findings of fraud or recklessness in the case. As a result, Garlinghouse has vowed to expose the SEC for its conduct, emphasizing that Ripple will vigorously respond to the SEC’s action.  Notably, Alderoty has disclosed that the company’s legal team will be addressing the SEC’s demands in a filing scheduled for next month. Offering his perspective on the SEC, the Ripple CLO characterized the agency as one “that trades in statements that are false, mischaracterized and designed to mislead.” SEC Actions Hurt XRP Holders The Most In its lawsuit against Ripple, the US SEC accused the payment company of violating securities laws by selling XRP in unregistered securities offering to investors in the US. According to the agency, the company and its executives had allegedly failed to protect its investors, depriving them of adequate disclosures of XRP.  However, members of the Ripple community argue that the SEC’s enforcement actions against Ripple have not protected investors but caused even deeper challenges and financial losses for XRP holders.  Related Reading: Bitcoin Whales Remove A Staggering $2.3 Billion From Exchanges, Is It Time To Buy? A popular XRP enthusiast, identified as XRPCryptoWolf has asserted that it should be the SEC, not Ripple, paying billions to XRP holders.  “The SEC asking for $2 billion in fines and penalties is ridiculous when they’re the ones who financially hurt XRP holders the most. The SEC owes XRP holders tens of billions of dollars,” he stated.  The XRP community member disclosed that after the SEC announced its lawsuit against Ripple, approximately $15 billion was wiped out from XRP’s market capitalization, and the token was also delisted from major exchanges. As a result of the lawsuit’s significant impact on XRP’s value, millions of XRP holders experienced financial losses. XRP price at $0.644 &#124; Source: XRPUSDT on Tradingview.com Featured image from Inside Bitcoins, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-26T15:58:21.000Z",
    "title": "Why is the XRP Price So Low? Legal Expert Breaks Down SEC Filing Impact",
    "url": "https://www.crypto-news-flash.com/why-is-the-xrp-price-so-low-legal-expert-breaks-down-sec-filing-impact/?utm_source=rss&utm_medium=rss&utm_campaign=why-is-the-xrp-price-so-low-legal-expert-breaks-down-sec-filing-impact",
    "description": "<img width=\"1800\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-gold-coins-with-background-chart-price-trading.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple-XRP-gold-coins-with-background-chart-price-trading.\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-gold-coins-with-background-chart-price-trading.jpg 1800w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-gold-coins-with-background-chart-price-trading-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-gold-coins-with-background-chart-price-trading-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-gold-coins-with-background-chart-price-trading-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-gold-coins-with-background-chart-price-trading-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-gold-coins-with-background-chart-price-trading-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-gold-coins-with-background-chart-price-trading-450x300.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-gold-coins-with-background-chart-price-trading-1200x800.jpg 1200w\" sizes=\"(max-width: 1800px) 100vw, 1800px\" />A legal expert has shared new insight into the $2 billion fine from SEC and XRP price impact. The expert noted that the discounted sales of XRP to institutional investors mark the basis for this hefty fine demand. Fred Rispoli, an attorney based in the U.S. has outlined in a series of posts on X [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-26T15:44:32.000Z",
    "title": "Bitcoin Cash (BCH) Halving Nears: Miner Tactics Rattle Investors, Fuel Volatility",
    "url": "https://www.crypto-news-flash.com/bitcoin-cash-bch-halving-nears-miner-tactics-rattle-investors-fuel-volatility/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-cash-bch-halving-nears-miner-tactics-rattle-investors-fuel-volatility",
    "description": "<img width=\"1002\" height=\"481\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BITCOIN-CASH-BCH.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin Cash\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BITCOIN-CASH-BCH.png 1002w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BITCOIN-CASH-BCH-300x144.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BITCOIN-CASH-BCH-768x369.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BITCOIN-CASH-BCH-702x336.png 702w\" sizes=\"(max-width: 1002px) 100vw, 1002px\" />Bitcoin Cash&#8217;s price surged to $486 but faces uncertainty due to miners selling off reserves before the upcoming halving event. Miners offloaded 1.5 million BCH, worth $741 million, causing concerns about BCH&#8217;s future price direction. Bitcoin Cash (BCH) experienced a significant price surge, hitting $486 on March 26, marking a remarkable 44% increase over the [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-26T16:10:22.000Z",
    "title": "KuCoin and Founders Charged for Violating U.S. Financial Laws",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/kucoin-and-founders-charged-for-violating-u-s-financial-laws/",
    "description": "<p>These charges highlight increasing global regulatory scrutiny on exchanges violating U.S. anti-money laundering laws. KuCoin faces allegations from U.S. authorities for deliberately ignoring AML regulations to expand its operations. KuCoin Under Fire for AML Regulation Violations The charges point to a major compliance breach, emphasizing the importance of following the Bank Secrecy Act for entities [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/kucoin-and-founders-charged-for-violating-u-s-financial-laws/\">KuCoin and Founders Charged for Violating U.S. Financial Laws</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]