[
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T23:32:51.000Z",
    "title": "Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better ... <a title=\"Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fantom-price-prediction/\" aria-label=\"More on Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-23T23:18:41.000Z",
    "title": "Bitcoin Just Gained Over 18% In Seven Days: What’s Happened When This Has Occurred In The Past?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-just-gained-over-18-in-seven-days-whats-happened-when-this-has-occurred-in-the-past/",
    "description": "By the completion of its daily candle on Wednesday, Bitcoin had gained over 18% in just seven consecutive sessions, abruptly ending the steady drift lower which had dominated its price action since Bitcoin put in its mid-April high above 30,000. How unusual is this magnitude gain in only a week’s time, and what’s happened in the past after similarly robust rallies? Let’s take a closer look at Bitcoin’s price history to find out. Bitcoin’s Price History Suggests Higher Prices Ahead As we examine Bitcoin’s price history for which there is reliable data (2011 to the present), the number one cryptocurrency by market cap has experienced numerous instances of gains greater than or equal to +18% over the span of seven days. Bitcoin gains &#62;= 18% in Seven Days &#124; BTCUSD on TradingView.com Related Reading: Bitcoin Recovers Above Critical Level, Why Bulls Could Be Ready To Charge Because the number of occurrences will vary depending on holding time, we’ll start by listing the number of times this has happened next to our hypothetical hold times of 7 days through 90 days. Holding time is defined as the amount of time one held Bitcoin before exiting. For example, if one hypothetically purchased Bitcoin following the trigger event (i.e., +18% over the span of seven days) and sold it 30 days later, this would be a holding time of 30 days. Bitcoin Occurrences of +18% Gains in Seven Consecutive Days by Holding Time (2011 &#8211; Present) 98 occurrences using a 7-day hold time 73 occurrences using a 15-day hold time 57 occurrences using a 30-day hold time 30 occurrences using a 90-day hold time Clearly, gains of this magnitude in just a week’s time are not uncommon for Bitcoin, an asset with numerous instances of large price advances especially when considering its relatively short price history compared to traditional risk assets. Bitcoin Results Slightly Less Bullish In Recent Years While a gain of over 18% in such a brief time period may lead some traders to lean bearish, the data suggests otherwise, with historical average results clearly positive across the board for all holding times from 2011 to the present. &#160; Bitcoin gains &#62;= 18% in Seven Consecutive Days with Various Hold Times. 2011 &#8211; Present. Because Bitcoin’s early price history experienced arguably outsized gains relative to its more recent history, let’s take a look at average results for the same degree of gains in a week’s time but only examining data for the last five years (6/23/18 to the present). Bitcoin gains &#62;= 18% in Seven Consecutive Days with Various Hold Times. Last Five Years. While once again results are positive across the board, the hypothetical results over more recent data are significantly lower, with the average 90-day return of +25.6% over the past five years a far cry from the +109.4% returns for the same 90-day window over the full price history from 2011 to the present. Related Reading: Bitcoin Price Surges 8% And Defies Gravity – Bulls Eye $30K While some traders may argue that the past five years is less representative data due to the occurrence of two major bear markets for Bitcoin and crypto more broadly, Bitcoin has shown positive follow through on average for both time periods across all the hold times we examined. While the past does not predict the future, the recent powerful price advance appears to suggest that Bitcoin is poised for greater gains in relatively near future. DB the Quant is the author of the REKTelligence Report newsletter on Substack. Follow @REKTelligence on Twitter for evidence-based crypto market research and analysis. Important Note: This content is strictly educational in nature and should not be considered investment advice. Featured images created with Tableau. Charts from TradingView.com."
  }
]