[
  {
    "source": "Decrypt",
    "date": "2024-02-15T17:29:09.000Z",
    "title": "'Crypto: The Game' $100K Winner Skipped Strategy, Wrote Poems for Rivals",
    "url": "https://decrypt.co/217567/crypto-the-game-winner-interview-season-2-preview",
    "description": "The WAGMI vibe prevailed in this crypto riff on \"Survivor.\" We dig inside the social media phenomenon and speak to the winner."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-15T17:20:34.000Z",
    "title": " President of Queens’ College Cambridge warns AI could wipe out mid-level asset managers ",
    "url": "https://cointelegraph.com/news/president-queens-college-cambridge-warns-ai-artificial-intelligence-wipe-out-mid-level-asset-managers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZGY5ZDk3MjUtNWYyOS00Y2FhLWJlYWYtMGFiYmVjMTkwZTFiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>AI tools such as ChatGPT and Gemini have the potential to be both a destructive and lucrative force for the field of asset management.</p>\n                    <p><p>Generative artificial intelligence (AI) technologies will have a transformative impact on the field of asset management leaving both destruction and growth in its wake, according to the President of Queens’ College at Cambridge, Mohamed El-Erian.</p><p>In a recent op-ed <a href=\"https://www.ft.com/content/3adbf2c0-80d5-4574-9a47-6a9672700077\" target=\"_blank\" rel=\"noopener nofollow\">published</a> in the Financial Times, El-Erian writes that generative AI is “a massively disruptive innovation” that is “just getting started.”</p><p>Generative AI is a class of machine learning that includes GPT technologies such as OpenAI’s ChatGPT and Google’s Gemini. Typically, these models and services are used for the purpose of generating text, audio, images, video, and code. </p><p><a href=\"https://cointelegraph.com/news/president-queens-college-cambridge-warns-ai-artificial-intelligence-wipe-out-mid-level-asset-managers\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-15T17:30:53.000Z",
    "title": "Bitcoin’s short-term holders enjoy gains with price surge to $52,000",
    "url": "https://cryptoslate.com/insights/bitcoins-short-term-holders-enjoy-gains-with-price-surge-to-52000/",
    "description": "<p>Quick Take Bitcoin&#8217;s Realized Price, which represents the aggregate on-chain acquisition price for the entire coin supply, has notably increased to $23,230, a 1.5% increase in the past seven days. More specifically, the Short-Term Holder Realized Price (STH RP), which reflects the average on-chain acquisition price for coins moved within the last 155 days, has [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoins-short-term-holders-enjoy-gains-with-price-surge-to-52000/\">Bitcoin&#8217;s short-term holders enjoy gains with price surge to $52,000</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-15T17:30:56.000Z",
    "title": "Sui Revealed as Top Destination for DeFi Inflows Over the Last 30 Days",
    "url": "https://www.cryptoglobe.com/latest/2024/02/sui-revealed-as-top-destination-for-defi-inflows-over-the-last-30-days/",
    "description": "Grand Cayman, Cayman Islands, February 15th, 2024, Chainwire Wormhole data shows nearly $310 million in assets bridged from Ethereum to Sui over the last month — more than all other blockchains combined. Sui, a Layer 1 blockchain that has experienced explosive growth since its inception nine months ago, is seeing a substantial migration of funds […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-15T17:30:30.000Z",
    "title": "Nexo Partners With Sift for Enhanced Digital Asset Fraud Protection",
    "url": "https://news.bitcoin.com/nexo-partners-with-sift-for-enhanced-digital-asset-fraud-protection/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/nexoss-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Nexo Partners With Sift for Enhanced Digital Asset Fraud Protection\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/nexoss-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/nexoss-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/nexoss-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/nexoss-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/nexoss-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/nexoss-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/nexoss.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The digital asset firm Nexo has announced its partnership with Sift, aiming to upgrade its fraud prevention mechanisms. The collaboration between the duo is expected to streamline and secure the user experience for Nexo&#8217;s customer base, which exceeds six million globally. Nexo to Leverage Sift&#8217;s Fraud Protection Services By integrating Sift&#8216;s payment protection and account [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T17:32:04.000Z",
    "title": "ICP Price Prediction 2024-2033: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "Internet Computer ICP Price Prediction 2024-2033 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T17:21:46.000Z",
    "title": "Health Systems Prioritize AI Oversight Amidst Rapid Advancements",
    "url": "https://www.cryptopolitan.com/health-systems-prioritize-ai-oversight/",
    "description": "Amid the swift evolution of artificial intelligence (AI) in healthcare, health systems are increasingly focusing on developing robust oversight measures to navigate the complexities associated with these technologies.&#160; A recent report published by the Center for Connected Medicine (CCM) at the University of Pittsburgh Medical Center (UPMC) sheds light on this trend, revealing insights gathered [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-15T17:24:27.000Z",
    "title": "Elizabeth Warren honors Bitcoin creator Satoshi Nakamoto",
    "url": "https://crypto.news/elizabeth-warren-bitcoin-satoshi-nakamoto/",
    "description": "Senator Elizabeth Warren, known for her skepticism towards Bitcoin, publicly celebrated its 15th anniversary by recognizing its creator, Satoshi Nakamoto."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-15T17:20:42.000Z",
    "title": "Bitcoin ETFs see 14 consecutive days of net inflows as crypto market cap crosses $2t",
    "url": "https://crypto.news/bitcoin-etfs-inflows-crypto-market-cap/",
    "description": "Bitcoin ETFs continued to experience hundreds of millions in demand a day after setting a historical high for daily net inflows. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-15T17:30:13.000Z",
    "title": "$400 XRP Price Point: Analyst Breaks Down The Future Surge Date",
    "url": "https://www.newsbtc.com/analysis/xrp/400-xrp-price-point-analyst-breaks-down-the-future-surge-date/",
    "description": "Amid the XRP price unfavorable market sentiment, Changelly, a prominent global cryptocurrency exchange, has sparked new optimism by predicting a potential surge in the token&#8217;s price. The crypto exchange has projected new all-time highs for the cryptocurrency in the upcoming years. Related Reading: Dogecoin Price Prediction – DOGE Pump To $0.12 Seems Imminent XRP 2024 Price Prediction On Wednesday, February, Changelly released a research report projecting XRP’s monthly prices for 2024. The crypto exchange emphasized XRP’s historical challenges, recounting significant declines that caused the cryptocurrency to trade well below its 2018 all-time high of $3.84. Following an extensive analysis of XRP, Changelly has predicted a 23.71% increase in the price of XRP, surpassing current resistance levels at $0.5 and reaching $0.667 by February 16, 2024. The crypto exchange noted that current technical indicators signal a 28% bearish bullish market sentiment on the token, alongside a Fear and Greed index reflecting high Greed at 74. Changelly has also reported a positive seven-day upward trend for XRP, noting a $0.01 increase in the past 24 hours. The cryptocurrency platform foresees the average price of XRP reaching $0.617 by March, with a projected price range of $0.550 to $0.685. Changelly forecasts that XRP will trade above the $0.50 mark in April and May, reaching average price values of $0.562 and $0.573, respectively. From June to September, the cryptocurrency is expected to gradually approach the $0.60 mark, with the average price values of XRP ranging from $0.55 to $0.59 during these months. By November, the token is anticipated to break past resistance levels, maintaining an average price of $0.662, with a minimum and maximum value of $0.569 and $0.755, respectively. Meanwhile, Changelly has predicted a surge in the average XRP price to $0.695 for December, potentially reaching a peak value of $0.829.  Massive Price Surge In Upcoming Years In its research report, Changelly provided a forecast of the token from 2025 to 2050. The crypto exchange platform anticipates big gains for the cryptocurrency, expecting its price to exceed $500 in the coming decades. Specifically for 2025 and 2026, Changelly projects XRP to surpass the $1 mark and trade at an average price of $1.18 and $1.72, respectively. The cryptocurrency is expected to slowly increase over the years, surging past $2 mark in 2027 and surpassing its all-time high of 3.84 for the first time to reach an average price of $5.04 in 2028. In the decade from 2030 to 2040, Changelly has predicted that XRP would trade at an average price of $7.39 in 2030, rapidly gaining more momentum over the years to reach a maximum level of $480.23 and a minimum of $413.15 in 2040. Related Reading: Ethereum Bulls Keep Pushing, Why ETH Could Soon Test $3K By 2050, XRP is projected to surpass the $600 mark and trade at $625.74, with a maximum and minimum value of $690.55 and $595.36, respectively. Chart from Tradingview"
  }
]