[
  {
    "source": "Cointelegraph",
    "date": "2023-09-08T08:40:00.000Z",
    "title": "Security platforms warn about hidden phishing and wallet drainer links",
    "url": "https://cointelegraph.com/news/security-platforms-warn-hidden-phishing-and-wallet-drainer-links",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/337b784f-ece4-4f01-984f-13e5e11fdc7f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cybersecurity professional Christian Seifert gave an example on how Discord's measure against malicious links can be abused by scammers.</p>\n                    <p><p>With millions of dollars worth of assets <a href=\"https://cointelegraph.com/news/whale-loses-24-million-in-crypto-phishing-attack\">being lost to phishing attacks</a> after signing malicious permissions, the threat of losing crypto assets from questionable links is very real. When these are paired with platforms allowing hidden links, users are subjected to a different kind of risk. </p><p>On Sept. 4, Web3 security provider Pocket Universe shared how scammers are able to hide wallet drainer links on any text on the instant messaging platform Discord. While some users report that the feature has only been <a href=\"https://twitter.com/nishthenomad/status/1698809558280630672\" target=\"_blank\" rel=\"noopener nofollow\">enabled</a> for Discord users recently, the ability to embed links on any text has been available on many different social platforms for a while now. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Scammers can now hide links in any discord text ☠️<br><br>Watch out for hidden wallet drainer links<br>e.g.  <a href=\"https://t.co/mgqG18sOF9\">pic.twitter.com/mgqG18sOF9</a></p>&mdash; Pocket Universe  (@PocketUniverseZ) <a href=\"https://twitter.com/PocketUniverseZ/status/1698767797432779236?ref_src=twsrc%5Etfw\">September 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Cointelegraph reached out to several cybersecurity professionals to learn more about how users can protect themselves from such attempts and how platforms can improve their security so that users are not subjected to such attacks. </p><p>Christian Seifert, who works as a Researcher in Residence at Web3 security firm Forta Network, said that this type of attack has been the bread and butter of hackers since the internet was created. He explained that: </p><blockquote>“Whatever a platform creates, there will be a hacker ready to find a way to hack it. Hyperlinks with text are a feature supported as part of HTML and have been a source for phishing attacks since the early days of the internet.”</blockquote><p>According to Seifert, security requires an in-depth defense approach. “Both platforms and users need to work towards protecting themselves,” he said. From the user’s side, the security professional highlighted that there are plugins that they can use to protect themselves from such scams. </p><p>When it comes to Discord, Seifert pointed out that the platform does provide information on the true destination of the URL after the user clicks on it. However, the platform also allows users to “trust” a domain going forward. This can be abused by scammers according to Seifert. He explained: </p><blockquote>“Imagine a domain like foo.bar which the user trusted. A scammer can craft a potentially malicious link that performs some action on this domain, such as an oauth request to the scammer, like foo.bar/oauth/scammer-account.”</blockquote><p>The cybersecurity professional said that an issue with the platform’s current implementation is that links and text can be deceptive and misaligned with users’ expectations. “If a text link clearly resembles a domain or URL and it is mismatched to the true destination URL, Discord should disallow such links,” he added. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/exploits-hacks-and-scams-stole-almost-1b-in-2023-report\"><strong><em>Exploits, hacks and scams stole almost $1B in 2023: Report</em></strong></a></p><p>Meanwhile, Hugh Brooks, the director of security operations at the blockchain security firm CertiK, echoed some of Seifert’s sentiments. According to Brooks, users and platforms have a collective responsibility to watch out for malicious actors. He explained that it’s essential for platforms to continually review and refine their security features and for users to stay vigilant and educated. </p><p>For users, Brooks said that they should be proactive and cautious when it comes to links, especially when being asked for signatures and permissions. The executive urged users to verify the authenticity of the site address before giving it access to crypto wallets. Brooks shared: </p><blockquote>“A good practice is to cross-check web addresses with recognized phishing warning lists. PhishTank, Google Safe Browsing, and OpenPhish are valuable resources here, along with browser extensions like HTTPS Everywhere and ad blockers like uBlock.”</blockquote><p>Brooks explained that these tools can alert users in real time whenever they are about to visit known phishing or malicious websites. “Furthermore, by simply hovering over a URL link, the actual web address will be displayed, allowing users to confirm its legitimacy before engaging further,” he added. </p><p>On the platform’s side, the cybersecurity professional said that there are measures that can be implemented such as being able to only receive messages from trusted contacts. Brooks said that a good example of this is Meta’s “Facebook Protect,” which lets users have heightened security features for their accounts. </p><p>“As the saying goes, the only constant is change. Platforms owe it to their users and to their continued relevance to make security a priority. This involves not only updating security measures but also fostering a culture of vigilance and awareness among users,” he added. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethics-101-crypto-projects-negotiate-hackers/\"><strong><em>Should crypto projects ever negotiate with hackers? Probably</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-08T08:43:20.000Z",
    "title": "Bumper’s $20M Bid To Undercut Deribit Crypto Options Live on September 7, 2023",
    "url": "https://www.cryptoglobe.com/latest/2023/09/bumpers-20m-bid-to-undercut-deribit-crypto-options-live-on-september-7-2023/",
    "description": "London, United Kingdom, September 7th, 2023, Chainwire Bumper, a decentralised finance (DeFi) protocol, today launched its crypto options killer. The equation that underpins the protocol promises jaw-dropping improvements over traditional Black-Scholes option desks, undercutting the market leader Deribit, by an average of 30% and set to disrupt a $13 trillion market.  Bumper’s innovation is the culmination […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-08T08:54:40.000Z",
    "title": "CFTC Cracks Whip On DeFi Protocols, Fines Opyn, 0x, And Deridex",
    "url": "https://cryptodaily.co.uk/2023/09/cftc-cracks-whip-on-defi-protocols-fines-opyn-0x-and-deridex",
    "description": "The commodities regulator has handed out hefty fines of $250,000, $200,000, and $100,000, respectively, on the three protocols."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T09:00:04.000Z",
    "title": "Coinbase challenges U.S. regulatory climate aims for  crypto-friendly nations",
    "url": "https://www.cryptopolitan.com/coinbase-challenges-u-s-regulatory-climate/",
    "description": "Coinbase, a leading cryptocurrency exchange, has outlined its strategic focus on several countries outside the United States, citing their more transparent and clearer crypto regulations. In a blog post published on September 6, Coinbase&#8217;s vice presidents for international business and international policy, Nana Murugesan and Tom Duff Gordon, identified the European Union, the United Kingdom, ... <a title=\"Coinbase challenges U.S. regulatory climate aims for  crypto-friendly nations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-challenges-u-s-regulatory-climate/\" aria-label=\"More on Coinbase challenges U.S. regulatory climate aims for  crypto-friendly nations\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T08:41:37.000Z",
    "title": "Casa Wallet unveils Ethereum transaction relay service for enhanced user privacy",
    "url": "https://www.cryptopolitan.com/casa-wallet-unveils-ethereum-transaction-relay-service-for-enhanced-user-privacy/",
    "description": "Casa, a leading cryptocurrency self-custody platform, has introduced a new feature aimed at bolstering privacy for its Ethereum (ETH) users. The company, which launched a multi-signature Ethereum self-custody vault in June 2023, has now added an Ethereum pay wallet as a relay service. This development comes as a significant upgrade to Casa&#8217;s initial Bitcoin (BTC) ... <a title=\"Casa Wallet unveils Ethereum transaction relay service for enhanced user privacy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/casa-wallet-unveils-ethereum-transaction-relay-service-for-enhanced-user-privacy/\" aria-label=\"More on Casa Wallet unveils Ethereum transaction relay service for enhanced user privacy\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T08:40:04.000Z",
    "title": "How does the integration of Indigenous knowledges in AI contribute to ethical AI development?",
    "url": "https://www.cryptopolitan.com/integration-of-indigenous-knowledges-in-ai/",
    "description": "In an era dominated by artificial intelligence (AI), there is a pressing concern regarding the impact of AI on Indigenous rights, cultural heritage, and data sovereignty. AI, reliant on the process of machine learning, has the potential to revolutionize industries, but it is currently entrenched in a predominantly white male sphere.  This disparity raises questions ... <a title=\"How does the integration of Indigenous knowledges in AI contribute to ethical AI development?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/integration-of-indigenous-knowledges-in-ai/\" aria-label=\"More on How does the integration of Indigenous knowledges in AI contribute to ethical AI development?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-08T09:00:12.000Z",
    "title": "Axie Infinity Price Corrects, Theta Trades Sideways, But Pomerdoge Remains Bullish",
    "url": "https://www.crypto-news-flash.com/axie-infinity-price-corrects-theta-trades-sideways-but-pomerdoge-remains-bullish/?utm_source=rss&utm_medium=rss&utm_campaign=axie-infinity-price-corrects-theta-trades-sideways-but-pomerdoge-remains-bullish",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-54.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-54.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-54-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-54-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />After the Grayscale win forced a market-wide rally, many cryptocurrencies have cooled off leading to a mixed sentiment in the market. In recent developments, while Axie Infinity (AXS) faces a price correction and Theta (THETA) maintains a sideways trend, Pomerdoge (POMD) continues its bullish momentum. Click Here To Find Out More About The Pomerdoge (POMD) [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-08T08:43:00.000Z",
    "title": "JPMorgan Explores Digital Deposit Tokens for Faster Cross-Border Payments",
    "url": "https://coinedition.com/jpmorgan-explores-digital-deposit-tokens-for-faster-cross-border-payments/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Wall-Streets-JPMorgan-Expanding-its-Presence-in-The-Blockchain.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Wall Street’s JPMorgan Expanding its Presence in The Blockchain\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Wall-Streets-JPMorgan-Expanding-its-Presence-in-The-Blockchain.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Wall-Streets-JPMorgan-Expanding-its-Presence-in-The-Blockchain-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Wall-Streets-JPMorgan-Expanding-its-Presence-in-The-Blockchain-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Wall-Streets-JPMorgan-Expanding-its-Presence-in-The-Blockchain-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Wall-Streets-JPMorgan-Expanding-its-Presence-in-The-Blockchain-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>JPMorgan Chase, the American multinational bank, is reported to be in the early stages of exploring a blockchain-based digital deposit token. A person familiar with the work stated that the bank won’t create the token unless the project is approved by US regulators. JP Morgan is the world’s largest bank by market capitalization as of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/jpmorgan-explores-digital-deposit-tokens-for-faster-cross-border-payments/\">JPMorgan Explores Digital Deposit Tokens for Faster Cross-Border Payments</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]