[
  {
    "source": "Cointelegraph",
    "date": "2023-09-17T21:17:22.000Z",
    "title": "Binance.US exchange volume slumps amidst crisis",
    "url": "https://cointelegraph.com/news/binanceus-exchange-volume-slumps-amidst-crisis",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/908b79a0-7594-4ba5-823d-f332cfbdb6fc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>On Sep. 16, exchange volume stood at $5.09 million on Binance.US amidst executive departures and ongoing regulatory scrutiny.</p>\n                    <p><p>Trading activity on Binance.US has reached new lows in September, as the crypto exchange faces unprecedented challenges. On Sep. 16, exchange volume stood at $5.09 million on Binance.US, as reported by Amberdata on The Tie Terminal. </p><p>The lowest point for the month was on Sep. 9, when trading activity totaled $2.97 million. This is a significant drop compared to Sep. 17, 2022, when its trading volume was around $230 million. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/c92b5cf0-a74e-4ee1-859f-379ed33c0c64.png\"  /><figcaption style=\"text-align: center;\"><em>Binance.US exchange volume over the past 12 months. Source: The Tie Terminal/Amberdata</em></figcaption></figure><p>Binance.US is the offshoot in the United States of global crypto exchange Binance. On June 5, the Securities and Exchange Commission <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">filed a lawsuit against both crypto exchanges</a> on charges related to unregistered securities offerings, and wash trading, among other violations. As per the SEC, Binance.US allegedly failed to register as a broker-dealer and failed to register the offer and sale of its staking-as-a-service programme. </p><p>Since the lawsuit, Binance.US<a href=\"https://cointelegraph.com/news/binance-us-halts-trading-for-dozens-of-usdt-btc-busd-pairs-amid-sec-lawsuit\"> halted trading for over 100 token pairs</a>, contributing to a sharp decline in exchange activity.</p><p>Binance.US turmoil also comes with internal challenges. Brian Shorder, then CEO of Binance.US, <a href=\"https://cointelegraph.com/news/binance-us-cuts-third-of-staff-ceo-brian-shroder-leaves-report\">stepped down last week</a>, joining a number of global executives who left the group of companies over the past weeks. Following Shorder's departure, head of legal Krishna Juvvadi and chief risk officer Sidney Majalya announced their resignations as well. </p><p>According to reports, the departures are allegedly due to an ongoing investigation by the U.S. Department of Justice into Binance, its CEO Changpeng \"CZ\" Zhao, and Binance.US. In response to speculation surrounding Shorder's departure, CZ said on X (formerly Twitter) that the executive was taking a \"deserved break.\" CZ <a href=\"https://twitter.com/cz_binance/status/1702750076647412146\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a>:</p><blockquote>“Under his leadership, Binance.US raised capital, improved its product and service offerings, solidified internal processes, and gained significant market share, all of which helped to build a more resilient company for the benefit of customers. We are grateful for his contributions.”</blockquote><p>Binance.US's problems seem to be far from over. The SEC recently<a href=\"https://cointelegraph.com/news/binance-us-not-cooperating-sec-investigation\"> accused the exchange of non-cooperation</a> in the ongoing investigation, claiming it produced only 220 documents during the discovery process. In another development, a judge <a href=\"https://cointelegraph.com/news/sec-reverses-itself-sealing-redacting-some-documents-binance-us-case\">issued an order on Sept. 15 granting the SEC</a> a motion to unsealed documents on the case. Those documents were sealed or redacted at the SEC's request and are now being unsealed at its request. The documents are expected to be available in the coming days.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-17T21:34:05.000Z",
    "title": "NASA Collaborates with Texas Robotics Firm to Develop Humanoid Robots for Space Missions",
    "url": "https://www.cryptopolitan.com/nasa-collaborates-with-texas-robotics-firm/",
    "description": "Houston, TX &#8211; NASA has entered into a strategic partnership with Texas-based robotics firm Apptronik, Inc. to advance the development of humanoid robots for deployment in space missions. Leveraging the modularity and adaptability of Apptronik&#8217;s Apollo robot, this collaboration aims to equip astronauts with versatile robotic assistants for tasks in orbit, on the moon, and ... <a title=\"NASA Collaborates with Texas Robotics Firm to Develop Humanoid Robots for Space Missions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nasa-collaborates-with-texas-robotics-firm/\" aria-label=\"More on NASA Collaborates with Texas Robotics Firm to Develop Humanoid Robots for Space Missions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-17T21:13:39.000Z",
    "title": "Crypto deals dwindle in Formula One as Web3 attempts to bring back the glory days",
    "url": "https://www.cryptopolitan.com/crypto-deals-dwindle-in-f1-web3-partnership/",
    "description": "The collapse of FTX came as a shock to many, particularly Formula One fans who had gotten used to the Crypto.com logos on the Grand Prix as well as the FTX sign on the race cars, particularly Lewis’ silver arrow. If you were an avid follower of the sport, already going through the ‘Hamilton heartbreak’ ... <a title=\"Crypto deals dwindle in Formula One as Web3 attempts to bring back the glory days\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-deals-dwindle-in-f1-web3-partnership/\" aria-label=\"More on Crypto deals dwindle in Formula One as Web3 attempts to bring back the glory days\">Read more</a>"
  }
]