[
  {
    "source": "CryptoSlate",
    "date": "2023-11-21T15:00:15.000Z",
    "title": "Transactions on Avalanche surge by 3,040% in November",
    "url": "https://cryptoslate.com/transactions-on-avalanche-surge-by-3040-percent-in-november/",
    "description": "<p>Avalanche has seen a significant increase in its market value this year. The token has grown substantially with impressive monthly, year-to-date (YTD), and yearly gains. AVAX&#8217;s price has surged by over 103% in the last 30 days alone, with a notable 77% increase over the past year. This price growth was accompanied by an even [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/transactions-on-avalanche-surge-by-3040-percent-in-november/\">Transactions on Avalanche surge by 3,040% in November</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-21T14:56:31.000Z",
    "title": "Bullish Wave Sweeps Crypto Market: Fantom (FTM), Polygon (MATIC), and Meme Moguls (MGLS) Experience Soaring Growth",
    "url": "https://cryptodaily.co.uk/2023/11/bullish-wave-sweeps-crypto-market-fantom-ftm-polygon-matic-and-meme-moguls-mgls-experience-soaring-growth",
    "description": "There is no doubt that 2023 has brought renewed hope to the cryptocurrency market. While Bitcoin (BTC) leads the way with the potential of an ETF being approved in the US"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-21T14:50:49.000Z",
    "title": "Undervalued Cryptocurrencies That Should Be on Everyone’s Radar – Solana, Pepe and Everlodge",
    "url": "https://cryptodaily.co.uk/2023/11/undervalued-cryptocurrencies-that-should-be-on-everyones-radar-solana-pepe-and-everlodge",
    "description": "Solana (SOL) recently saw a massive spike in trading volume, where it climbed past the $3 billion mark, with top ecosystem DEXs being Orca and Raydium,"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-21T14:45:59.000Z",
    "title": "Will Bitcoin price make a new all-time high in 2023? Prediction and analysis",
    "url": "https://crypto.news/will-bitcoin-price-make-a-new-all-time-high-in-2023-prediction-and-analysis/",
    "description": "Bitcoin's price action shows consolidation and significant volatility, with a focus on the $38,000 resistance level and market sentiment indicators. How far will it go?"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-21T15:00:59.000Z",
    "title": "Solana Forms Sell Signal, Decline To $30 Ahead?",
    "url": "https://www.newsbtc.com/news/solana/solana-forms-sell-signal-decline-30-ahead/",
    "description": "Solana is forming a TD Sequential sell signal on the weekly chart right now and this analyst believes a decline to as low as $30 could happen for SOL. Solana Weekly Chart Is In Process Of Forming A TD Sequential Sell Signal The &#8220;Tom Demark (TD) Sequential&#8221; refers to a popular tool in technical analysis that&#8217;s used to pinpoint probable tops or bottoms in the price of any given asset or commodity. This indicator is made up of two phases: the setup phase and the countdown phase. In the former, candles of the same polarity are counted up to 9. After this ninth candle, the metric signals that a likely reversal in the price is occurring now. Related Reading: Bitcoin Fees Soar Above Ethereum’s As Investors Flock To Ordinals-Backed Assets Naturally, if the setup occurs with green candles, the signal would be for a probable top, meaning that it could be the time to exit from the asset. On the other hand, the opposite type of candle would imply a reversal from the bearish trend may be taking place. As explained by analyst Ali in a new post on X, the Solana 7-day chart has recently been finishing such a setup phase of the TD Sequential, suggesting the winds might be changing for the cryptocurrency. The below chart shared by the analyst shows this signal forming in SOL&#8217;s price: The pattern currently forming in the coin's weekly price chart &#124; Source: @ali_charts on X From the graph, it&#8217;s visible that this Solana signal could be a sell one, as the TD Sequential setup phase is forming with green candles. &#8220;With the week just beginning, the upcoming days could be crucial for traders eyeing profit-booking opportunities,&#8221; notes Ali. As mentioned before, this phase isn&#8217;t the only one that the indicator has; there is also the &#8220;countdown phase.&#8221; This second phase lasts for 13 candles and starts right after the setup is finished. Once these 13 candles are done, the asset&#8217;s price could once again be assumed to have reached a state of exhaustion in its trend and a reversal may be imminent. &#8220;If the bearish formation gets confirmed, we might see a SOL downswing towards $45, potentially even dipping to $30,&#8221; explains the analyst. The former target would mean a decline of more than 21% from the current price of the coin, the latter 47%. Related Reading: Bitcoin About To Smash The $38,000 Barrier – Decoding the Next Moves It now remains to be seen whether the bearish pattern will hold for the cryptocurrency after all. If it does, the TD Sequential may once again be the metric to watch, as the countdown phase&#8217;s end could lead to a reversal in the asset&#8217;s price once more. SOL Price Solana had gone as high as $68 last week, but the cryptocurrency has since seen a sizeable drop towards the $57 mark. Nonetheless, despite this decline, the asset is in profits of more than 100% in the past month, showcasing just how strong SOL&#8217;s recent bullish momentum has been. The coin is still holding great returns for the past month &#124; Source: SOLUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-21T14:53:00.000Z",
    "title": "Altcoin Market Could Skyrocket to $1.23T, Predicts Analyst",
    "url": "https://coinedition.com/altcoin-market-could-skyrocket-to-1-23t-predicts-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Altcoins Not Make States Youtuber\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Altcoins-Not-Make-States-Youtuber-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The cryptocurrency trader and analyst @el_crypto_prof predicted in an X post today that it is only a matter of time before the altcoin market surges. In the post, the analyst revealed that the market cap for altcoins had escaped a falling wedge pattern on its weekly chart. Subsequently, he believes that the market cap could [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/altcoin-market-could-skyrocket-to-1-23t-predicts-analyst/\">Altcoin Market Could Skyrocket to $1.23T, Predicts Analyst</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]