[
  {
    "source": "CoinDesk",
    "date": "2023-10-13T14:17:00.000Z",
    "title": "CertiK, Blockchain Code Auditor, Makes 'Strategic Workforce Adjustment' of 15%",
    "url": "https://www.coindesk.com/tech/2023/10/13/certik-blockchain-code-auditor-makes-strategic-workforce-adjustment-of-15/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Just last year, the company raised nearly $150 million of fresh capital. Now, as crypto winter drags on, it is cutting jobs, citing \"evolving market dynamics.\""
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-13T14:16:32.000Z",
    "title": "Why is Bitcoin price stuck?",
    "url": "https://cointelegraph.com/news/why-is-bitcoin-price-stuck",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/afc8ec08-4768-417a-a371-a46442344ea8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin's price is range-bound due to conflicting fundamentals and reduced network activity, making it hard to establish a clear trend.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price is oscillating within an ascending channel, bounded by a resistance at $28,000 and a rising support at approximately $26,750.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/d6a03f70-ddc9-406e-9d85-69df98a60e65.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD daily price chart. Source: TradingView</em></figcaption></figure><p>The flattening BTC price action has accompanied declining volumes and volatility, underscoring a growing bias conflict among traders.</p><h2>Bitcoin network activity plummets</h2><p>The duration of Bitcoin's consolidation coincides with a massive drop in its deposits, withdrawals, and overall transactions count. Notably, all these metrics increased in May due to the <a href=\"https://cointelegraph.com/explained/what-are-bitcoin-ordinals\">Bitcoin Ordinals</a> hype, only to crash significantly in September. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/3b2ace04-33b4-4eab-9789-b986be3248a0.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin transaction count. Source: CryptoQuant</em></figcaption></figure><p>\"This suggests that the Bitcoin network activity has decreased,\" <a href=\"https://cryptoquant.com/insights/quicktake/652892ad8bdcda6e4638f448-BTC-whales-and-institutional-investors-have-yet-to-act-but-network-fundamentals-\" target=\"_blank\" rel=\"noopener nofollow\">argues</a> MAC_D, on-chain data analyst at CryptoQuant, adding: </p><blockquote>\"This happened because there were fewer new investments coming into the crypto market, resulting in less liquidity and therefore less price volatility.\"</blockquote><h2>Bitcoin ETF hopes versus higher rate worries</h2><p>Bitcoin's consolidation period appears on the heels of two conflicting market catalysts: hopes for a Bitcoin ETF approval in the U.S. against worries about the Federal Reserve's \"<a href=\"https://cointelegraph.com/news/bitcoin-price-holds-steady-as-s-p-500-plunges-to-110-day-low\">higher-for-longer</a>\" interest rate strategy. </p><p>Analysts <a href=\"https://cointelegraph.com/news/bitcoin-etfs-600-billion-tipping-point-crypto\">argue</a> that a Bitcoin ETF approval would bring $600 billion worth of demand to the market — a boon for the BTC price. On the other hand, <a href=\"https://cointelegraph.com/news/bitcoin-cpi-btc-price-tackling-26-8-k\">stickier inflation</a> raises Fed's potential to keep rates higher in the future, which, in turn, could hurt risker assets, including BTC.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The S&amp;P 500, Gold, Bitcoin and EURUSD after the CPI Print: <a href=\"https://t.co/AO4FWHpv0Z\">pic.twitter.com/AO4FWHpv0Z</a></p>&mdash; TradingView (@tradingview) <a href=\"https://twitter.com/tradingview/status/1580537107378221057?ref_src=twsrc%5Etfw\">October 13, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>A former BlackRock director <a href=\"https://fr.cointelegraph.com/news/sec-could-approve-a-bitcoin-cash-etf-within-three-to-six-months\">asserts</a> that the U.S. Securities and Exchange Commission will approve a Bitcoin ETF by the end of Q1/2024.</p><h2>BTC accumulation continues</h2><p>Bitcoin supply across whale and institutional addresses have increased entering October, suggesting the cryptocurrency's richest investors have been accumulating off-market via over-the-counter desks.</p><p>For instance, the supply held by Bitcoin addresses with a 10,000-100,000 BTC balance (the teal wave) has jumped by over 1% from its Oct. 5 low. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/9b90837f-785d-4070-9e41-5b1334d4865b.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin supply held by addresses with a 100-100,000 BTC balance. Santiment</em></figcaption></figure><p>The jump appears as the cohort absorbs drops in the supply held by Bitcoin addresses with a 1,000-10,000 BTC balance (the orange wave). On the other hand, the supply held by 100-1,000 BTC balance cohort (the green wave) have risen.</p><h2>Bitcoin technical analysis shows a 40% decline setup</h2><p>From a technical perspective, Bitcoin eyes a rebound toward $28,000 after showing signs of stabilizing around $26,750. The short-term upside outlook is purely based on BTC's price fluctuations inside its prevailing ascending triangle, as shown below.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/07a5fe6d-eecf-4c4d-a4e9-ec6041511916.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD daily price chart. Source: TradingView</em></figcaption></figure><p>A longer-timeframe scenario shows Bitcoin treading inside a broader ascending channel pattern. Therefore, a rebound from the current support area (the red bar) could have BTC price climb toward $36,000 in late 2023 or early 2024.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/f057958a-4783-4c21-9a3f-dca8e6933259.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD three-day price chart. Source: TradingView</em></figcaption></figure><p>However, the ascending channel appears like a rising wedge, a bearish reversal pattern. A rising wedge resolves after the price breaks below its lower trendline and falls by as much as the pattern's maximum height.</p><p><strong><em>Related: <a href=\"https://fr.cointelegraph.com/news/sec-could-approve-a-bitcoin-cash-etf-within-three-to-six-months\">Inflation and war impact markets, but Paul Tudor Jones says, ‘I love Bitcoin and gold’</a></em></strong></p><p>Therefore, If BTC falls below the channel's lower trendline, Bitcoin's price may <a href=\"https://cointelegraph.com/news/bitcoin-faces-15k-crash-as-us-sparks-financial-meltdown-arthur-hayes\">decline by as much as 40% to $15,650</a> in 2023 or in Q1/2024.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-13T14:10:00.000Z",
    "title": "What is blockchain network congestion?",
    "url": "https://cointelegraph.com/explained/what-is-blockchain-network-congestion",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/17ef9ed95076392cdddf50ee4c301cfa.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Blockchian network congestion results in delayed transaction confirmations, increased costs and a slower user experience.</p>\n                    <p><div data-ct-widget=\"explained-block\" id=\"explained-block-118221-4\">            <h2 data-ct-widget=\"explained-block-title\">                Blockchain network congestion, explained            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Blockchain network congestion refers to a situation where the number of transactions exceeds the network’s capacity, resulting in processing delays.</em></p><p>When there are more pending transactions than the network can handle, blockchain networks get congested. Limited block sizes and the length of time required to construct a new block are the causes of this issue. </p><p>Transactions are delayed, and users notice slower processing times when the volume of transactions exceeds the network’s capacity to confirm them quickly. The release of <a href=\"https://cointelegraph.com/learn/what-is-a-brc-20-token-standard-an-overview\">BRC-20 tokens</a> on the <a href=\"https://cointelegraph.com/learn/how-does-blockchain-work-a-beginners-guide-to-blockchain-technology\">Bitcoin blockchain</a> led to a rapid increase in transactions, resulting in Bitcoin network congestion.</p><p>Increased usage, high transaction volumes and events like <a href=\"https://cointelegraph.com/learn/initial-coin-offering\">initial coin offerings (ICOs)</a> can strain the system and cause congestion. Users may choose to pay extra fees to have their transactions prioritized, which raises expenses even more during these busy periods. Moreover, transactions become more expensive and less efficient as a result of the congestion, which also affects the overall user experience. </p><p>However, blockchain networks are always working on ways to improve scalability, ensure smoother transactions, and reduce congestion-related problems, such as protocol updates and <a href=\"https://cointelegraph.com/learn/a-beginners-guide-on-blockchain-layer-2-scaling-solutions\">layer-2 scaling solutions</a>. These initiatives are essential for widespread adoption because they increase the robustness and effectiveness of blockchain networks, even in times of heavy demand.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-118221-3\">            <h2 data-ct-widget=\"explained-block-title\">                The importance of efficient blockchain transaction processing            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Efficient blockchain transaction processing is vital for enabling high throughput, low latency, reduced transaction fees and enhanced data security across various industries.</em></p><p>The widespread use and integration of blockchain technology into various industries depend on effective blockchain transaction processing. Scalability is one of its main advantages; it enables blockchain networks to manage a large volume of transactions quickly and concurrently. </p><p>Scalability has been a problem in conventional systems, but effective blockchain processing eliminates this problem, providing smooth operations even during periods of high usage. Additionally, by <a href=\"https://cointelegraph.com/explained/why-low-latency-is-important-for-cryptocurrency-exchanges-explained\">lowering latency</a> and congestion, it improves network performance and enables real-time transaction validation and confirmation. Transaction fees are also reduced by efficient transaction processing, making <a href=\"https://cointelegraph.com/learn/how-does-blockchain-work-everything-there-is-to-know\">blockchain technology</a> more affordable for both private individuals and commercial enterprises. </p><p>Furthermore, effective blockchain processing ensures swift, safe and tamper-proof transactions in industries where data security is crucial, such as finance, healthcare and <a href=\"https://cointelegraph.com/explained/how-blockchain-technology-is-used-in-supply-chain-management\">supply chain management</a>. The speed at which blockchain can handle transactions will be a deciding factor in how quickly new technologies are developed and adopted.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-118221-2\">            <h2 data-ct-widget=\"explained-block-title\">                Causes of blockchain network congestion            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Blockchain network congestion arises from factors such as high transaction volumes, increased adoption, DApps, ICOs and malicious activities, causing delays and higher fees in transaction processing.</em></p><p>The processing capacity of the blockchain network is strained by a number of issues, which cause delays and higher transaction fees. For instance, a large number of transactions that exceed the network’s capacity can overwhelm the processing power, delaying confirmation of transactions.</p><p>Moreover, as blockchain technologies are more widely used, more individuals and companies make transactions, which increases network traffic. <a href=\"https://cointelegraph.com/learn/what-are-dapps-everything-there-is-to-know-about-decentralized-applications\">Decentralized applications (DApps)</a>, platforms for <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> and the concurrent execution of <a href=\"https://cointelegraph.com/learn/what-are-smart-contracts-a-beginners-guide-to-automated-agreements\">smart contracts</a> all place a considerable burden on the network’s resources and cause congestion.</p><p>In addition, as investors participate in events like ICOs and token sales, the network is further clogged with transactions. Last but not least, malevolent actors can cause system disruption by sending a large number of low-value transactions, and physical restrictions in the network architecture, like poor internet connections, can obstruct the smooth flow of data and cause congestion problems. </p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-118221-1\">            <h2 data-ct-widget=\"explained-block-title\">                Consequences of network congestion            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>In blockchain systems, network congestion can have serious repercussions for users, businesses and the general operation of decentralized applications.</em></p><p>One immediate consequence is delayed transaction confirmations. Services that depend on timely payments or transactions are affected when a network is crowded because transactions take longer to process. For instance, <a href=\"https://cointelegraph.com/news/readying-the-blockchain-industry-for-the-next-wave-of-adoption\">Ethereum’s network was severely congested</a> during the CryptoKitties boom in late 2017, which led to delays in platform transactions.</p><p>Higher transaction fees are also a result of significant demand for transaction processing. Users frequently bid higher fees to speed up their transactions when there is congestion or a transaction backlog. Transactions may become more expensive as a result of the increase in fees, especially for smaller transactions. Due to the high demand for DeFi apps, the Ethereum network experienced congestion in 2021, which caused transaction costs to soar.</p><p>Additionally, the user experience of DApps is impacted by network congestion due to slow transaction processing. Prolonged congestion and a bad user experience may make users reluctant to interact with the DApp. Users who are frustrated or dissatisfied might abandon the platform completely, which would have an impact on the success of the DApp and its user base.</p><p>Also, developers may need to set aside more resources to boost the DApp’s performance when it is congested. This diversion of resources may have been used to improve user functionality or experience instead, delaying the development of the DApp as a whole.</p>            </p>        </div>                    <div data-ct-widget=\"explained-block\" id=\"explained-block-118221-0\">            <h2 data-ct-widget=\"explained-block-title\">                Strategies to address blockchain network congestion            </h2>            <p data-ct-widget=\"explained-block-content\">                <p><em>Blockchain network congestion needs to be addressed with a diverse strategy that includes both short-term fixes and long-term scaling solutions.</em></p><p>Optimizing transaction fees is one such strategy. To prevent unnecessary bidding wars during congestion, users can set reasonable costs. Also, layer-2 solutions, like <a href=\"https://cointelegraph.com/news/hybrid-rollups-the-silver-bullet-for-scalability-and-security-on-ethereum\">rollups for Ethereum</a> and the <a href=\"https://cointelegraph.com/learn/what-is-the-lightning-network-in-bitcoin-and-how-does-it-work\">Lightning Network for Bitcoin</a>, can be implemented by developers to reduce the load on the primary blockchain by allowing some transactions to take place off-chain.</p><p>Furthermore, by increasing the number of transactions executed in each block and enhancing block propagation methods, throughput can be increased. Additionally, switching to proof-of-stake or other efficient consensus algorithms lowers the computational load, allowing blockchain networks to support more transactions.</p><p>As a crucial tactic to deal with blockchain network congestion, <a href=\"https://cointelegraph.com/learn/ethereum-sharding-a-beginners-guide-to-blockchain-sharding\">sharding, as implemented by the Ethereum blockchain</a>, stands out. Each of the shards created by dividing the blockchain into smaller parts can operate independently to process transactions. The capacity of the network is greatly increased by this parallel processing, enabling numerous transactions to take place simultaneously. </p><p>Finally, encouraging DApp developers to improve their smart contracts and code can lessen the needless load on the network. Blockchain platforms can reduce traffic by combining various techniques, resulting in smooth transaction processing and improving the user experience.</p>            </p>        </div>    </p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-13T14:30:46.000Z",
    "title": "Next cycle’s hypothetical $36k Bitcoin floor, exploring historical data to project future benchmarks",
    "url": "https://cryptoslate.com/insights/next-cycles-hypothetical-36k-bitcoin-bottom-exploring-historical-data-to-project-future-benchmarks/",
    "description": "<p>Quick Take Bitcoin&#8217;s valuation, often viewed as speculative, can be dissected more accurately through the lens of the &#8216;realized price&#8216; metric. This measure, reflecting the average cost at which all current Bitcoin holders purchased their coins, negates the impacts of volatility, thus offering a more realistic view of Bitcoin&#8217;s value over time. Historical data reveals [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/next-cycles-hypothetical-36k-bitcoin-bottom-exploring-historical-data-to-project-future-benchmarks/\">Next cycle&#8217;s hypothetical $36k Bitcoin floor, exploring historical data to project future benchmarks</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T14:38:26.000Z",
    "title": "Microsoft is Offering Up to $15,000 for Breaking AI-Powered Bing: Unveiling the Intricacies of the New Bug Bounty Program",
    "url": "https://www.cryptopolitan.com/microsoft-offering-15000-for-breaking-ai/",
    "description": "In an intriguing turn of events, Microsoft has extended its bug bounty program to include AI-powered Bing services. This move marks a significant shift in the company&#8217;s approach to fortifying its security measures. Security professionals are now invited to probe the capabilities of AI Bing and, if successful, stand a chance to receive rewards of ... <a title=\"Microsoft is Offering Up to $15,000 for Breaking AI-Powered Bing: Unveiling the Intricacies of the New Bug Bounty Program\" class=\"read-more\" href=\"https://www.cryptopolitan.com/microsoft-offering-15000-for-breaking-ai/\" aria-label=\"More on Microsoft is Offering Up to $15,000 for Breaking AI-Powered Bing: Unveiling the Intricacies of the New Bug Bounty Program\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T14:28:23.000Z",
    "title": "Robot-Assisted Advancements in Hip Surgery: A Glimpse into the Future",
    "url": "https://www.cryptopolitan.com/robot-assisted-advancements-in-hip-surgery/",
    "description": "As the medical field continually advances, robots have been predicted to play a transformative role in hip surgeries. Leading the charge in this evolution is Vikas Khanduja, a renowned cTitle: &#8220;Advancements in Hip Surgery: Robots and AI Revolutionize Treatment, Predicts Leading Cambridge Surgeon. Renowned orthopedic surgeon and Affiliated Associate Professor, Vikas Khanduja, of Addenbrooke&#8217;s Hospital, ... <a title=\"Robot-Assisted Advancements in Hip Surgery: A Glimpse into the Future\" class=\"read-more\" href=\"https://www.cryptopolitan.com/robot-assisted-advancements-in-hip-surgery/\" aria-label=\"More on Robot-Assisted Advancements in Hip Surgery: A Glimpse into the Future\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T14:27:24.000Z",
    "title": "THORSwap tightens security protocols and resumes operations After FTX hack incident",
    "url": "https://www.cryptopolitan.com/thorswap-tightens-security-protocols-resumes-operations-after-ftx-hack/",
    "description": "THORSwap, a decentralized exchange running on the THORChain network, has reopened its interface to the public. The reopening comes after a temporary pause initiated on October 6 following the detection that its platform was used to launder funds related to the $470 million FTX hack. The digital exchange has also updated its terms of service ... <a title=\"THORSwap tightens security protocols and resumes operations After FTX hack incident\" class=\"read-more\" href=\"https://www.cryptopolitan.com/thorswap-tightens-security-protocols-resumes-operations-after-ftx-hack/\" aria-label=\"More on THORSwap tightens security protocols and resumes operations After FTX hack incident\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T14:25:33.000Z",
    "title": "Warning from the Bank of England: AI Biases Could Imperil Financial Stability",
    "url": "https://www.cryptopolitan.com/warning-from-the-bank-of-england-ai-biases/",
    "description": "In a recent blog post, Kathleen Blake, an analyst at the Bank of England (BoE), has issued a stark warning about the potential threat of artificial intelligence (AI) biases to financial stability. As AI and machine learning (ML) continue to permeate the financial services industry, concerns are growing that biased algorithms could lead to discriminatory ... <a title=\"Warning from the Bank of England: AI Biases Could Imperil Financial Stability\" class=\"read-more\" href=\"https://www.cryptopolitan.com/warning-from-the-bank-of-england-ai-biases/\" aria-label=\"More on Warning from the Bank of England: AI Biases Could Imperil Financial Stability\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T14:20:34.000Z",
    "title": "Disney Under Fire for AI-Generated Content in Recent Films",
    "url": "https://www.cryptopolitan.com/disney-under-fire-for-ai-generated-content/",
    "description": "The use of AI-generated assets in mainstream media has sparked a new wave of controversies, with prominent brands, including entertainment giant Disney, finding themselves embroiled in heated debates over the ethics and implications of this technology. Fresh off the uproar over their latest Loki poster, Disney is now confronted with a second AI art debacle ... <a title=\"Disney Under Fire for AI-Generated Content in Recent Films\" class=\"read-more\" href=\"https://www.cryptopolitan.com/disney-under-fire-for-ai-generated-content/\" aria-label=\"More on Disney Under Fire for AI-Generated Content in Recent Films\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-13T14:19:06.000Z",
    "title": "Cardano (ADA) Set to Skyrocket 2,448% to $6: Explosive Prediction Unveiled",
    "url": "https://www.crypto-news-flash.com/cardano-ada-set-to-skyrocket-2448-to-6-explosive-prediction-unveiled/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-ada-set-to-skyrocket-2448-to-6-explosive-prediction-unveiled",
    "description": "<img width=\"3840\" height=\"2160\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano ADA\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1.jpg 3840w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-2048x1152.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-48x27.jpg 48w\" sizes=\"(max-width: 3840px) 100vw, 3840px\" />Popular crypto analyst Ali Charts thinks Cardano (ADA) is set for an imminent breakout as soon as this December or consolidate until July 2024 if the upcoming price action mirrors the 2018-2019 phase excluding unforeseen events. Including the impacts of diminishing returns and high Cardano network development, the analyst expects the altcoin to rally towards [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-13T14:25:00.000Z",
    "title": "RNDR Price Could Be at Risk of Hitting the $1.69 Support",
    "url": "https://coinedition.com/rndr-price-could-be-at-risk-of-hitting-the-1-69-support/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-81-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The well-known cryptocurrency analysis channel, CryptoBusy, predicted in an X (formerly Twitter) post yesterday that Render (RNDR) could see a breakdown in its price very soon. CryptoBusy based their prediction on the fact that a head and shoulders pattern had formed on the altcoin’s hourly chart. A head and shoulders pattern is typically a chart [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/rndr-price-could-be-at-risk-of-hitting-the-1-69-support/\">RNDR Price Could Be at Risk of Hitting the $1.69 Support</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-13T14:30:57.000Z",
    "title": "Bitcoin Is the Only ‘Neutral Internet Money’ There Will Ever Be, Says Ex-PayPal President David Marcus – Here’s Why",
    "url": "https://dailyhodl.com/2023/10/13/bitcoin-is-the-only-neutral-internet-money-there-will-ever-be-says-ex-paypal-president-david-marcus-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/Neutral-Internet-Money-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/Neutral-Internet-Money-btc.jpg 1392w, https://dailyhodl.com/wp-content/uploads/2023/10/Neutral-Internet-Money-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/Neutral-Internet-Money-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/Neutral-Internet-Money-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/Neutral-Internet-Money-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/Neutral-Internet-Money-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The former president of PayPal and ex-Facebook vice-president, David Marcus, says Bitcoin (BTC) is in a class of its own compared to other crypto assets. In an appearance on the What Bitcoin Did podcast, the founder of Lightning Network payments protocol Lightspark says he now has the “unshakeable conviction” that Bitcoin &#8220;is the only form of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/13/bitcoin-is-the-only-neutral-internet-money-there-will-ever-be-says-ex-paypal-president-david-marcus-heres-why/\">Bitcoin Is the Only ‘Neutral Internet Money’ There Will Ever Be, Says Ex-PayPal President David Marcus – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]