[
  {
    "source": "Cointelegraph",
    "date": "2023-07-25T10:50:31.000Z",
    "title": "How low can the Bitcoin price go?",
    "url": "https://cointelegraph.com/news/how-low-can-the-bitcoin-price-go",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2022-11/7a07366a-74f3-44b8-b3b6-dc4d9f44d885.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin is down to one-month lows and BTC price predictions are tending to assume worse is to come — how much lower can bears manage?</p>\n                    <p><p>The price of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) has fallen to one-month lows and traders are increasingly betting on more downside to come.</p><h2>Bitcoin price slides to one-month lows</h2><p>BTC price performance has weakened in recent days, with BTC/USD hitting $28,850 on July 24, data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> confirms.</p><p>Despite a brief rebound, market participants remain unconvinced that the largest cryptocurrency has seen the worst of its losses.</p><p>Cointelegraph takes a look at current prognoses during a major macroeconomic week for crypto and risk assets.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/67c71044-47e7-47ff-88c8-d41cf99c408f.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-day chart. Source: TradingView</em></figcaption></figure><h2>$28,500 for a last leg down?</h2><p>For popular trader Crypto Ed, the prior dip to Bitcoin’s lowest since June 21 was entirely expected.</p><p>Now, he believes that a final break into buy liquidity should occur, taking BTC/USD to around $28,500. A relief bounce to $29,400 could come first.</p><p>“If we do get a move like this, then I’m looking for a setup for more downside and possibly $28,500 - 400, more or less,” he said in his <a href=\"https://www.youtube.com/watch?v=bOAr5NVdpdo\" target=\"_blank\" rel=\"noopener nofollow\">latest YouTube update</a>.</p><p>Crypto Ed showed an additional target box covering prices as low as $27,800, but acknowledged that he was unconvinced that Bitcoin would make it there.</p><h2>Low $27,000s to \"stop out\" bidders</h2><p>For fellow trader Crypto Chase, downside could take Bitcoin toward $27,000 before last-minute long entries get suitably burned.</p><p>Speculators should end up bidding at major price points as BTC/USD moves down — at $29,200, $28,500 and $28,000, he predicted earlier in July.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Gonna be one of those situations where people bid all the way down.. 29.2, 28.5, 28, and once finally stopped in the 27’s, they all turn bearish. Run it back to the (hopefully) untapped 32.4K.</p>&mdash; Crypto Chase (@Crypto_Chase) <a href=\"https://twitter.com/Crypto_Chase/status/1680437570067480576?ref_src=twsrc%5Etfw\">July 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In an <a href=\"https://twitter.com/Crypto_Chase/status/1683482692245913604\" target=\"_blank\" rel=\"noopener nofollow\">update</a> on July 24, he maintained that this was the likely course of events.</p><p>“These are still mostly my thoughts. I can't short now as strong R/R opportunities are behind us, decent entries were not offered based on my strategies,” he acknowledged to Twitter followers. </p><blockquote>“With that said, feed already turning giga bear, still plan to bid low 27's for a strong bounce and see where it takes us.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/99688965-35c1-4ccf-96e3-7d3998103066.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Crypto Chase/Twitter</em></figcaption></figure><p>An accompanying chart showed relevant Fibonacci retracement levels for the daily chart.</p><h2>Moving averages still to see retest</h2><p>Ahead of a series of crunch U.S. macro events, various traders are keeping out of Bitcoin until a more obvious trend emerges. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-mining-difficulty-drop-2023-5-things-this-week\"><strong><em>Biggest mining difficulty drop of 2023? 5 things to know in Bitcoin this week</em></strong></a></p><p>Nonetheless, <a href=\"https://cointelegraph.com/news/bitcoin-price-rejects-trendline-btc-how-low-go\">various moving averages persist</a> as important lines in the sand, among them the 200-week and 21-week at $27,130 and $28,200, respectively. </p><p>“Bitcoin is testing support in a key zone of historical significance,” Keith Alan, co-founder of monitoring resource Material Indicators, <a href=\"https://twitter.com/KAProductions/status/1683524482827264006\" target=\"_blank\" rel=\"noopener nofollow\">summarized</a> on July 24. </p><blockquote>“Not convinced we've found strong support yet, but the 21-Week MA looks like it could provide a stronger foundation. Need to let things develop a bit for some clarity.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/49d5bce8-32e0-4c79-8d89-895d9993c03a.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-week chart with 21, 200 MAs. Source: TradingView</em></figcaption></figure><p>As Cointelegraph reported, some worst case scenarios include far deeper drawdowns, with <a href=\"https://cointelegraph.com/news/bitcoin-can-hit-19k-btc-price-big-move\">even the loss of $20,000</a> not entirely off the table.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\">Should you ‘orange pill’ children? The case for Bitcoin kids books</a></em></strong></p><p class=\"post-content__disclaimer\">The views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-25T10:55:08.000Z",
    "title": "Crypto Exchange Rain’s Abu Dhabi Unit Expands Services to UAE",
    "url": "https://cryptodaily.co.uk/2023/07/crypto-exchange-rains-abu-dhabi-unit-expands-services-to-uae",
    "description": "<p>The Middle Eastern crypto exchange Rain, backed by Coinbase, announced that its Abu Dhabi unit secured a license to offer crypto brokerage and custody services in the UAE.</p>\n<p>According to reports by Reuters, Rain, a Middle Eastern crypto exchange based in Bahrain, and backed by Coinbase, announced today its Abu Dhabi unit secured a &ldquo;license to operate a virtual assets brokerage and custody service for clients in the United Arab Emirates.&rdquo;</p>\nRain Expands Offerings into UAE\n<p>Obtaining the license means that Rain&rsquo;s unit based in the Abu Dhabi Global Market financial free zone may now offer institutional and a limited number of retail clients in the UAE services to buy, sell, and store their virtual assets.</p>\n<p>Yehia Badawy, Rain&rsquo;s co-founder, said in an interview with Reuters that the license further allows the exchange to open a bank account in the UAE and permits its clients in the region to fund their own accounts provided they use a local payment network.</p>\n<p>Badawy noted that local asset managers have been reluctant to work with crypto firms who do not have domestic operating licenses but said they would now confidently deal with such firms. He further stated:</p>\n\n<p>&ldquo;We can capture more demand from institutional investors using this licence.&rdquo;</p>\n\n<p>Badawy founded Rain with three partners in 2017 with the backing and support of venture capital firm Kleiner Perkins and Coinbase Ventures.</p>\n<p>Rain has seen significant growth after it raised $110 million in a Series B funding round in 2022, placing the firm&rsquo;s value at $500 million. The firm indicated that the funds were earmarked for regional expansion.</p>\nGrowing Number of Crypto Firms Attracted to UAE\n<p>The current crisis and regulatory uncertainty in the US prompted many crypto-related firms to explore other regions to expand to, and the UAE appears to be a popular option.</p>\n<p>Binance recently said it was considering a move to Dubai due to the UAE&rsquo;s pro-crypto stance and policies. Alex Chehade, Binance Dubai&rsquo;s General Manager, said the region is a prime destination for crypto businesses.</p>\n<p>The US-based crypto exchange Gemini also said it would &ldquo;soon&rdquo; start the process of obtaining a crypto service license for customers in the UAE. Gemini cited &ldquo;hostility and [a] lack of clarity&rdquo; on US regulations as motivation for its decision.</p>\n<p>Coinbase also believes that the UAE is an attractive region for establishing its business amid ongoing difficulties with US regulators. The exchange expressed its interest in establishing an international hub in the UAE with its CEO Brian Armstrong, who believes that the country is well positioned to expand and serve the market in Africa, Asia, and, naturally, the Middle East. Armstrong also praised the country for its &ldquo;forward-thinking&rdquo; approach to crypto regulation.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-25T10:51:58.000Z",
    "title": "Japan’s prime minister hints at improving the web3 space",
    "url": "https://crypto.news/japans-prime-minister-hints-at-improving-the-web3-space/",
    "description": "Japan’s prime minister Fumio Kishida participated in the crypto conference WebX to share his enthusiasm for the decentralized ecosystem and web3. According to the CoinPost report, Kishida spoke on his administration&#8217;s strategies. He opined that web3 is part of the&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-25T10:40:51.000Z",
    "title": "Arkham unveils Terraform’s and Do Kwon’s secret holdings",
    "url": "https://crypto.news/arkham-unveils-terraforms-and-do-kwons-secret-holdings/",
    "description": "Arkham Intelligence, a crypto data provider, has disclosed crucial information regarding the crypto holdings and wallet activity of Terraform Labs and its founder, Do Kwon.  The revelation came from an anonymous sleuth and renowned crypto analyst, ErgoBTC. He won a&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-25T11:02:30.000Z",
    "title": "Cardano Prepares for Mithril Mainnet Launch: Boosting Network Efficiency and ADA’s Versatility",
    "url": "https://www.crypto-news-flash.com/cardano-prepares-for-mithril-mainnet-launch-boosting-network-efficiency-and-adas-versatility/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-prepares-for-mithril-mainnet-launch-boosting-network-efficiency-and-adas-versatility",
    "description": "<img width=\"3840\" height=\"2160\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano ADA\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1.jpg 3840w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-2048x1152.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-2-1-48x27.jpg 48w\" sizes=\"(max-width: 3840px) 100vw, 3840px\" />Cardano&#8217;s core developers are all set to release Mithril solution soon. Designed to boost node efficiency, Mithril will also enhance the versatility of the ADA. According to Input Output Global (IOG), the developer behind the Cardano (ADA) blockchain, the protocol is preparing for the launch of Mithril, an innovative solution designed to revolutionize the network&#8217;s [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-25T10:53:48.000Z",
    "title": "How to Explain About Crypto to Your Family and Friends",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-to-explain-about-crypto-to-your-family-and-friends/",
    "description": "<p>Cryptocurrencies have rapidly gained popularity and are changing the landscape of modern finance. However, explaining this complex and evolving concept to family and friends who may not be familiar with it can be a challenging task. In this article, we&#8217;ll explore some tips on how to effectively explain about crypto to your loved ones and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-to-explain-about-crypto-to-your-family-and-friends/\">How to Explain About Crypto to Your Family and Friends</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]