[
  {
    "source": "Cointelegraph",
    "date": "2023-07-08T01:42:27.000Z",
    "title": "Over $765K worth of NFTs stolen after SIM swap attack on GutterCatGang ",
    "url": "https://cointelegraph.com/news/over-765k-worth-of-nfts-stolen-after-sim-swap-attack-on-guttercatgang",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/6caafd19-e9a9-420d-a22e-a669bd6feb20.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The bad actors utilized a fake GutterCatGang airdrop scam to drain people’s wallets, with at least $700,000 worth of NFTs being stolen from a single address. </p>\n                    <p><p>More than $765,000 worth of nonfungible tokens has been stolen as part of a reported SIM swap attack on the GutterCatGang NFT project.</p><p>The security breach was highlighted by several NFT community members at around 8 pm UTC on July 7, with<strong> </strong>GutterCatGang co-founder @GutterMitch tweeting out a warning that: “Our Twitter has been compromised please do not interact with any links.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Our Twitter has been compromised please do not interact with any links</p>&mdash; Gutter Mitch (@GutterMitch) <a href=\"https://twitter.com/GutterMitch/status/1677409871543562241?ref_src=twsrc%5Etfw\">July 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Alongside the official GutterCatGang account, co-founder @gutterric was also hacked. </p><p>The hacker, or hackers used the accounts to share links to fake “limited edition” GutterCatGang NFT sneaker airdrops that essentially drained people’s hot wallets when they clicked on them. </p><p>In an effort to make the fictitious links look more legitimate, the tweets included recent GutterCatGang branding and imagery from the project's phygital sneaker drop in partnership with Puma and NBA/Charlotte Hornets star LaMelo Ball. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">GutterCatGang Twitter account has been compromised please do not interact with it. <a href=\"https://twitter.com/hashtag/GutterCatGang?src=hash&amp;ref_src=twsrc%5Etfw\">#GutterCatGang</a> <a href=\"https://twitter.com/gutterdan_?ref_src=twsrc%5Etfw\">@gutterdan_</a> <a href=\"https://twitter.com/GutterCatGang?ref_src=twsrc%5Etfw\">@GutterCatGang</a>  —-&gt; ⚠️⛔️ <a href=\"https://t.co/tBu9fwBI7m\">pic.twitter.com/tBu9fwBI7m</a></p>&mdash; Burden ©  (@0x_burden) <a href=\"https://twitter.com/0x_burden/status/1677412801072037888?ref_src=twsrc%5Etfw\">July 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Responding to Gutter Mitch’s thread, <a href=\"https://cointelegraph.com/news/cz-powell-on-chain-sleuth-zach-xbt-legal-fees\">prominent blockchain sleuth</a> ZachXBT asserted that the team was hacked via a <a href=\"https://cointelegraph.com/news/scammers-steal-almost-1m-after-hijacking-8-prominent-crypto-twitter-accounts\"> SIM swap attack</a>, as he questioned the team’s <a href=\"https://cointelegraph.com/news/certik-says-sms-is-the-most-vulnerable-form-of-2fa-in-use\">cyber security practices</a>. </p><p>“Your team better look at a compensation plan for victims as it is gross negligence to have used SMS 2FA on your socials after all of the recent SIM swaps,” ZachXBT said. </p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/sim-swap-hacker-plugwalk-joe-sentenced-to-five-years-in-prison\"><strong>$794K SIM swap hacker PlugwalkJoe sentenced to 5 years in prison</strong></a></p><p>In a separate thread, ZachXBT highlighted two victims of the attack, with one losing a Bored Ape Yacht Club NFT worth $65,913 at current floor prices, and <a href=\"https://twitter.com/zachxbt/status/1677430093520437250\" target=\"_blank\" rel=\"noopener nofollow\">another</a> losing a whopping $700,000 worth of NFTs from a host of blue chip collections. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Someone else just lost $700k of assets (couple BAYCs, MAYC, Doodles, BAKCs, etc) <a href=\"https://t.co/noNvkqkw9U\">pic.twitter.com/noNvkqkw9U</a></p>&mdash; ZachXBT (@zachxbt) <a href=\"https://twitter.com/zachxbt/status/1677427909382795264?ref_src=twsrc%5Etfw\">July 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Providing an update on the matter, GutterCatGang co-founder @gutterdan_ stated: “We are working with Twitter to regain access to the compromised Gutter-affiliated Twitter accounts.”</p><p>“We deeply sympathize with all those impacted and want to assure you that we are taking this matter very seriously and are working with law enforcement to investigate the hack and security breach,” he wrote. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We are working with Twitter to regain access to the compromised Gutter-affiliated Twitter accounts. We deeply sympathize with all those impacted and want to assure you that we are taking this matter very seriously and are working with law enforcement to investigate the hack and…</p>&mdash; Gutter Dan (@gutterdan_) <a href=\"https://twitter.com/gutterdan_/status/1677465118475444224?ref_src=twsrc%5Etfw\">July 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>At the time of writing, it appears that the accounts are still compromised. </p><p>GutterCatGang was launched in mid-2021 and consists of 3000 unique NFT cartoon cat avatars. The current floor price sits at 0.5 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), up almost 615% from the initial cost to mint, according to NFT Price Floor. </p><p><strong>Magazine: </strong><a href=\"https://cointelegraph.com/magazine/nft-collector-snoop-nft-passport-the-goose-millennials-sothebys/\"><strong><em>NFT Collector: Snoop’s NFT nostalgia, The Goose draws Gen Y to Sotheby’s</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-08T01:57:00.000Z",
    "title": "Crypto Analyst Reveals His Bullish Case For $XRP to Surge to $10 in the Future",
    "url": "https://www.cryptoglobe.com/latest/2023/07/crypto-analyst-reveals-his-bullish-case-for-xrp-to-surge-to-10-in-the-future/",
    "description": "A popular cryptocurrency market commentator, who on social media is known as Crypto Assets Guy, has recently revealed an ambitious price prediction for the native token of the XRP Ledger, $XRP, suggesting numerous factors could help drive its price up. According to Crypto Assets Guy’s estimations, several key events could trigger a succession of price […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-08T02:00:12.000Z",
    "title": "Circle Intervenes, Freezes $63 Million From Multichain Hack",
    "url": "https://www.newsbtc.com/news/circle-intervenes-freezes-63-million-from-multichain-hack/",
    "description": "Circle, the official issuer of USDC, the second largest stablecoin by circulating supply, has frozen $63 million from the Multichain hack. Compiled Etherscan data on July 7 shows that the stablecoin issuer froze $27.65 million, $30.1 million, and $5.5 million in three transactions, hampering the hacker&#8217;s cash-out efforts. Multichain Hacked, Circle Intervenes Multichain, a cross-chain protocol router, was hacked on July 7, resulting in the loss of over $126 million worth of various tokens. The exploit came after the attacker illegally accessed Multichain&#8217;s Multi-Party Computation (MPC) address, which stores funds locked between blockchains. Subsequently, the hacker withdrew funds from the address and moved them to an externally controlled wallet. The Fantom Bridge was adversely affected by this outflow as the hacker withdrew various tokens, including wBTC, USDC, and USDT. There were a handful of other altcoins that the hacker stole.  Related Reading: Arbitrum DAO Locks $770 Million In ARB Tokens Into Vesting Contract: Implications For ARB Funds were also stripped from the Moonriver Bridge, with observers noting that at least $6.8 million worth of various coins, including USDC, were moved to an external address. It is also reported that an address associated with Multichain connecting with Dogecoin also lost over $600,000. The stolen USDC has now been frozen and cannot be moved, a relief for the community. However, it is not clear whether Circle will reverse funds to Multichain. In the past, Tether Holdings and Circle, the centralized issuers of the world&#8217;s most liquid stablecoins, have intervened to prevent bad actors from cashing out. Hack Compounding Multichain&#8217;s Woes, Bitcoin Firm Peckshield, a blockchain security firm, was the first to pick out the unusual transfers of over $118 million worth of assets from Multichain&#8217;s Fantom and Moonriver bridges. The firm went on to tag the team behind the cross-chain protocol, who immediately acted. In response to the hack, Multichain said the outflow was &#8220;abnormal&#8221; and halted all activity while recommending users pause their protocol and revoke all contracts approval.  Related Reading: Hackers Have Stolen $30 Billion In Crypto Since 2012, SlowMist Report Finds Although the Multichain team had assured the community that the private keys controlling asset movements through the bridge are secure and stored on-chain, their technology appears to have flaws, resulting in the hack. The hack marks what has also been a tumultuous past few weeks. Besides delayed transactions and what the team described as &#8220;multiple issues,&#8221; the founder is missing. Despite the attack, Bitcoin prices are firm when writing. The coin is above the $30,000 psychological support, rejecting bear pressure from July 6. However, FTM, the native currency of Fantom, is free-falling, dumping 20% from July highs. Feature image from Canva, chart from TradingView"
  }
]