[
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T15:05:44.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T14:54:35.000Z",
    "title": "Tether and Georgia forge an alliance for cutting-edge Bitcoin P2P development",
    "url": "https://www.cryptopolitan.com/tether-and-georgia-forge-an-alliance-for-cutting-edge-bitcoin-p2p-development/",
    "description": "Tether, the leading stablecoin issuer, has inked a momentous Memorandum of Understanding (MOU) with the Georgian government, propelling Georgia into the forefront of blockchain and peer-to-peer (P2P) technology. This strategic alliance is set to spark a monetary revolution with far-reaching implications. In a bold move reflecting their commitment to global expansion, Tether&#8217;s stablecoin issuing platform ... <a title=\"Tether and Georgia forge an alliance for cutting-edge Bitcoin P2P development\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tether-and-georgia-forge-an-alliance-for-cutting-edge-bitcoin-p2p-development/\" aria-label=\"More on Tether and Georgia forge an alliance for cutting-edge Bitcoin P2P development\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T14:52:47.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The $2Million bet by ex-CTO of Coinbase has been the subject of much discussion and debate in the crypto world. At the heart of the controversy is Srinivasan’s prediction that Bitcoin will reach $1 million per coin within just 90 days. This Bitcoin Price Prediction intends to shed light on the ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-28T15:00:25.000Z",
    "title": "Stellar (XLM) Continues Surge As Major Coins Land In The Red",
    "url": "https://www.newsbtc.com/news/stellar/stellar-xlm-continues-surge-as-major-coins-land-in-the-red/",
    "description": "Stellar (XLM) price has continued to surge as the broader crypto market sees correction. The token surprised market participants with interesting price movements over the past seven days. Stellar leads top-gainers with a 4.19% growth in 24 hours and a 19.55% price gain on the weekly chart.  Stellar Price Outlook Stellar is a peer-to-peer (P2P) decentralized network launched by the Stellar Development Foundation in 2015. It provides a protocol that connects global financial systems by linking payment providers and financial institutions. Stellar transactions are powered by its native token XLM. Stellar (XLM) performed well over the past weeks, showing noticeable gains amid dips and rallies in the last seven days. XLM saw a 23.6% price increase over the past 14 days, with a 19.55% seven-day gain in value. Related Reading: Bitcoin Price Rally Stalls For Now, Here’s Why Even more remarkable is the token&#8217;s trading volume, which increased by 287.57% within a 24-hour. The change in trading volume over the past week suggests that XLM bulls worked overtime within these few days. XLM&#8217;s trading volume went from less than $60 million to over $200 million in seven days. As of the time of writing, the token&#8217;s trading volume stands at $224 million, according to CoinMarketCap data. With this bullish signal, XLM overcame the $0.1 critical threshold observed in Pseudonymous crypto trading expert, Nebraskangooner&#8217;s chart pattern analysis on June 27.  Stellar&#8217;s (XLM) price is now changing hands at $09974, trading above the 50-day and 200-day Simple Moving Averages on its TradingView daily chart. This current trend suggests more bullish moves in the short and long term. Also, its Relative Strength Index at 76 suggests price moves above the overbought region.  It has smashed the crucial resistance and support levels, claiming support at $0.102456 in the first hours of 28 June, and may soon hit $0.105 if the uptrend continues. XLM Breaks New Grounds As Stellar Accelerate Network Development Among the factors fueling the bullish momentum is Coinbase’s recent integration with Stellar.org. On June 23, Coinbase integrated the USD Coin stablecoin on Stellar. Following this development, Coinbase fully supports USDC deposits and withdrawals via the Stellar network. Millions of users can now access instance remittance and real-time payments to global fiat and crypto on/off ramps through USDC on Stellar.  The news contributed to a boost in XLM market sentiment, evident in the rising trading volume. And, of course, increased trading volume signifies higher demand for the asset, which propels its price. In addition, Stellar announced another partnership with MoonPay, a leading crypto payments infrastructure company. According to the Stellar team, the partnership enables users to seamlessly buy and sell crypto assets, including Stellar assets, across over 160 countries. Related Reading: Cardano Set To Be Delisted On Huobi – Will It Dent ADA Price? Also, on June 22, Stellar partnered with MoneyGram to support streamlined cash deposits and withdrawals from crypto wallets via USDC without a bank account. These partnership deals must have boosted XLM&#8217;s user base, leading to an increase in its price. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T15:03:32.000Z",
    "title": "Courtroom Showdown: Judge Denies Sam Bankman-Fried’s Motion to Dismiss Most Charges, Sending Shockwaves Through FTX",
    "url": "https://www.crypto-news-flash.com/courtroom-showdown-judge-denies-sam-bankman-frieds-motion-to-dismiss-most-charges-sending-shockwaves-through-ftx/?utm_source=rss&utm_medium=rss&utm_campaign=courtroom-showdown-judge-denies-sam-bankman-frieds-motion-to-dismiss-most-charges-sending-shockwaves-through-ftx",
    "description": "Federal Judge Lewis Kaplan has rejected Sam Bankman-Fried&#8217;s (SBF) request to dismiss the criminal charges filed against him.  The legal team for Fried sought to have 10 of the 13 counts brought against him dismissed by the judge. In light of newly revealed details about FTX fraud, Federal Judge Lewis Kaplan has rejected Sam Bankman-Fried&#8217;s [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T15:00:50.000Z",
    "title": "Ethereum Targets $1900, Algorand, Cardano, and DigiToads Aim For New Heights",
    "url": "https://www.crypto-news-flash.com/ethereum-targets-1900-algorand-cardano-and-digitoads-aim-for-new-heights/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-targets-1900-algorand-cardano-and-digitoads-aim-for-new-heights",
    "description": "The massive earthquake in the crypto market pushes Ethreum, ALGO, and ADA to new highs. Some voices claim that ETH is now eyeing $3,000, while ALGO and ADA could also benefit from the rally. At the same time, DigiToads (TOADS) keeps increasing its value ahead of the big launch. Read on to find out why [...]"
  }
]