[
  {
    "source": "Crypto Briefing",
    "date": "2023-12-08T22:58:27.000Z",
    "title": "LayerZero preps for 2024 token launch",
    "url": "https://cryptobriefing.com/layerzero-preps-for-2024-token-launch/?utm_source=feed&utm_medium=rss",
    "description": "Responding to months of speculation, the cross-chain messaging protocol has confirmed the launch of its token in Q3 next year."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-08T22:56:38.000Z",
    "title": "Chainlink’s early access staking attracts $632m in LINK",
    "url": "https://crypto.news/chainlinks-early-access-staking-attracts-632m-in-link/",
    "description": "Chainlink&#8217;s early access staking program quickly maxes out, with $632 million in LINK staked, indicating strong community interest. Eligible users staked some 40.8 million Chainlink (LINK) tokens worth an estimated $632 million during the protocol’s early access staking program, signaling&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-08T22:45:06.000Z",
    "title": "Elon Musk misquotes Bitcoin self-custody mantra",
    "url": "https://crypto.news/elon-musk-misquotes-bitcoin-self-custody-mantra/",
    "description": "Elon Musk, CEO of Tesla and SpaceX, engaged with Twitter and Block co-founder Jack Dorsey regarding the importance of self-custody in cryptocurrency. Musk responded to Dorsey&#8217;s announcement of Bitkey, a self-custodial Bitcoin (BTC) wallet from Block, but made a minor&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-08T23:00:42.000Z",
    "title": "Solana-Based Meme Coin Outperforms Dogecoin, Shiba Inu To Become 3rd-Largest",
    "url": "https://www.newsbtc.com/meme-coin/solana-meme-coin-dogecoin/",
    "description": "BONK, a Solana-based meme coin, has continued to outperform the likes of Dogecoin and Shiba Inu over the last week. As the SOL price has rallied, so has its ecosystem coins continued to rise. This has led to a Solana-based meme coin becoming the third-largest meme coin in the space. BONK Meme Coin Beats Out PEPE For Third Place Despite BONK debuting on the meme coin scene months before PEPE, the latter had been able to quickly capture a larger market share and eventually became the third-largest in the space. PEPE would maintain this dominance for months, even after an over 60% decline from its all-time high. But it seems that dominance has come to an end. Related Reading: Shiba Inu Burn Rate Rises Rapidly In One Week, What’s Been Driving It? Over the last week, the BONK price has continued to rally, eventually rising above $0.000012. This put its market cap above $700 million, eventually beating out PEPE’s market cap. For context, the PEPE market cap is currently sitting at $650 million compared to BONK’s $717 million. In the same vein, the BONK meme coin has also outperformed the top 10 meme coins by market cap. In a one-week period, BONK has risen 192% compared to PEPE’s 40% and FLOKI’s 27%. Even 9GAG’s Memecoin (MEME) falls behind with 41% gains in the 7-day period. BONK’s price has risen 40% in the last 24 hours alone and its trading volume has not been left out of the action. Currently, the BONK daily trading volume is sitting at $213 million which is a 119% increase from its previous day’s figures, data from CoinMarketCap shows. BONK price touches new ATH &#124; Source: BONKUSDT on Tradingview.com  Dogecoin And Shiba Inu See Positive Headwinds Despite not seeing a performance as good as BONK, other meme coins such as Dogecoin and Shiba Inu have also been seeing positive headwinds. Both assets have performed quite well in the last seven days as DOGE rose 15.4% and SHIB rose 20.1%. Related Reading: Bitcoin Bullish Fractal Returns: Analyst Predicts Another Leg-Up With Price Target There are also other metrics that are driving the positive headwinds for these assets. For Shiba Inu, its volatility has remained high which has historically been a bullish thing for the price. If this holds, then there could be more rallies to come. Then for Dogecoin, multiple upcoming events could trigger a price rally. First is the Dogecoin moon mission which is taking a physical DOGE coin to the moon in December. Then in 2024, the DOGE-1 mission is expected to take off and it is the first space mission fully funded by crypto and paid for entirely in Dogecoin. DOGE’s open interest has also been on the high side, something that has often been a signal of a rally in the past. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Crypto News, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-08T23:01:00.000Z",
    "title": "Judge Bars Former Binance CEO Changpeng Zhao From Leaving the US Until His Sentencing Slated for February",
    "url": "https://dailyhodl.com/2023/12/08/judge-bars-former-binance-ceo-changpeng-zhao-from-leaving-the-us-until-his-sentencing-slated-for-february/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/Traders-on-Binance-Coin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/Traders-on-Binance-Coin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/Traders-on-Binance-Coin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/Traders-on-Binance-Coin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/Traders-on-Binance-Coin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/Traders-on-Binance-Coin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/Traders-on-Binance-Coin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A judge has ruled that former Binance chief executive Changpeng Zhao is a flight risk and has banned him from leaving the US until he’s sentenced in February. In a new court filing, Magistrate Judge Brian Tsuchida made a ruling in favor of the prosecution, who claimed Zhao’s wealth and citizenship with other nations that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/08/judge-bars-former-binance-ceo-changpeng-zhao-from-leaving-the-us-until-his-sentencing-slated-for-february/\">Judge Bars Former Binance CEO Changpeng Zhao From Leaving the US Until His Sentencing Slated for February</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]