[
  {
    "source": "CoinDesk",
    "date": "2023-06-29T13:00:00.000Z",
    "title": "Developer Six Clovers Rolls Out Cross-Border Crypto Payments on Sui",
    "url": "https://www.coindesk.com/business/2023/06/29/developer-six-clovers-rolls-out-cross-border-crypto-payments-on-sui/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Versal Network will allow companies to transact in stablecoins and central bank digital currencies."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-29T12:59:14.000Z",
    "title": "Germany’s BaFin Rejects Binance Crypto Custody License: Report",
    "url": "https://decrypt.co/146699/germanys-bafin-rejects-binance-crypto-custody-license-report",
    "description": "Binance maintains it is “committed” to working with regulators amid reports of BaFin denying its application for a crypto custody license."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-29T12:39:58.000Z",
    "title": "Bitcoin salary: Employees choose crypto paychecks amid economic instability",
    "url": "https://cointelegraph.com/news/bitcoin-salary-crypto-paychecks-economic-instability",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/4bd02793-f5e5-4c5e-ada4-28b05b5208ec.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Volatility among some fiat currencies has made stablecoins like USDC a more attractive option for payroll, according to HR executives.</p>\n                    <p><p>Political and economic tensions around the world are making some more willing to receive their pay in cryptocurrencies like Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), according to executives in the human resources industry.</p><p>The share of salaries taken in cryptocurrencies and stablecoins has been <a href=\"https://cointelegraph.com/news/new-poll-shows-top-regions-where-workers-are-taking-crypto-salaries\">on the rise over the past few years</a>. This trend is driven not only by prominent athletes and politicians <a href=\"https://cointelegraph.com/news/7-nfl-players-that-chose-crypto-over-cash-salaries\">taking their pay in crypto</a>, but also by ordinary people who want to hedge against all kinds of instability, according to goLance co-founder and CEO Michael Brooks.</p><p>There are a number of factors that have triggered a surge in crypto salaries, including increasing acceptance as a legitimate payment method, growing education and new technological developments, Brooks said in an interview with Cointelegraph.</p><p>The economic conditions in various parts of the world have also influenced the surge in crypto payments, he said, adding:</p><blockquote>“Some regions experiencing political instability, hyperinflation, or restrictive financial systems have seen an uptick in cryptocurrency usage as an alternative means of conducting transactions.”</blockquote><p>In 2021, goLance made less than 5% of its payouts in crypto, a figure which grew to almost 10% in 2022 and is expected to hit 17% in 2023, Brooks said. “Of the goLance freelancers that choose to be paid in crypto, an average of 17.5% of payments is in crypto and 82.5% in fiat,” the exec noted.</p><p>Dan Westgarth, chief operating officer at HR and payroll platform Deel, said that many employees worldwide have started taking their wages in crypto in response to the political and economic instability that has fueled sharp fluctuations in local fiat currencies, making stablecoins like USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) more attractive:</p><blockquote>“We see that countries facing more political and currency turbulence continue to use crypto, particularly withdrawals in USDC to combat volatility.”</blockquote><p>He said that the Caribbean presents a use case for crypto salaries due to its dated banking systems, where extensive waiting periods and payment delays, in addition to banking withdrawal fees, could be avoided with crypto. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/latam-crypto-holders-flock-to-bitget-following-binance-coinbase-suits\"><strong><em>LATAM crypto holders flock to Bitget following Binance, Coinbase suit</em></strong></a></p><p>Among the regions Deel supports for crypto payroll, Latin America has the largest share of withdrawals, accounting for 54% of crypto withdrawals on the platform between January and May of 2023.</p><p>Crypto salaries in Europe, the Middle East and Africa accounted for 38% during the same period. Asia-Pacific and non-aligned movement countries collectively accounted for less than 10% of all crypto withdrawals, Westgarth noted.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-miami-2023-shitcoins-for-bitcoin/\"><strong><em>Bitcoin 2023 in Miami comes to grips with ‘shitcoins on Bitcoin’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-29T12:59:24.000Z",
    "title": "US Q1 GDP comes in hot at 2.0%",
    "url": "https://cryptoslate.com/insights/us-q1-gdp-comes-in-hot-at-2-0/",
    "description": "<p>Quick Take The first quarter of the year witnessed the U.S. GDP outperforming expectations by landing at a 2.0% growth rate, surpassing the anticipated forecast of 1.4%. The impressive performance runs in tandem with the recent U.S. initial jobless claims data, which reported 239,000 compared to the projected 265,000. These core economic indicators have influenced [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/us-q1-gdp-comes-in-hot-at-2-0/\">US Q1 GDP comes in hot at 2.0%</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-29T12:59:21.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Rebounds on Thursday, Following Microstrategy’s Latest Purchase",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-rebounds-on-thursday-following-microstrategys-latest-purchase/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2017041662-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BTC Rebounds on Thursday, Following MicroStrategy&#039;s Latest Purchase\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2017041662-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2017041662-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2017041662-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2017041662-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2017041662-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2017041662-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2017041662.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin rebounded on Thursday, as markets reacted to the news that Microstrategy bought an additional $374 million worth of the cryptocurrency. Michael Saylor&#x2019;s firm now has 152,333 bitcoin, worth roughly $4.52 billion. Ethereum moved closer to $1,900 on the news. Bitcoin Bitcoin (BTC) edged higher in today&#x2019;s session, after it was confirmed that Michael Saylor&#x2019;s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-29T12:55:59.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 BREAKING: Twitter to enable #crypto trading in partnership with eToro. Users searching using a $Cashtag symbol currently see live charts for a select few financial assets, like $LTC. Users will soon be able to click through to eToro &#38; have the option to invest in #Litecoin. Is Litecoin silver to Bitcoin&#8217;s ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-29T12:40:36.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 Cryptopolitan foresees risk factors moving from Bitcoin to Ethereum-specific risk factors with the increasing importance of market factors, providing evidence for a decoupling of on-chain and off-chain trading activity. There was evidence that, unlike traditional financial markets, cryptocurrency volatility is not associated with market downturns. Observers also noted that, after gaining widespread attention ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-29T13:00:19.000Z",
    "title": "Compound (COMP) Surges Nearly 10% In The Past Day, Here’s Why",
    "url": "https://www.newsbtc.com/altcoin/compound-comp-surges-nearly-10-in-the-past-day/",
    "description": "As the crypto world continues to evolve with increased volatility, unique patterns emerge, attracting the interest of investors and analysts alike. One such way has been observed in the recent trading activity of Compound (COMP), the governance token tied to the Compound protocol. The asset experienced a significant surge, registering a nearly 10% growth within the past day. Over the last 7 days, COMP has been in an uptrend, and the 10% single-day rise forms part of a larger appreciation pattern. This escalation is noteworthy as the token&#8217;s price soared over 50% within just a week. Whale Activity Fuels Price Momentum Blockchain analytics firm Lookonchain earlier today shed some light on the reason behind the recent COMP price surge. The firm disclosed on Twitter that a possible whale or institutional investor appears to have made substantial COMP transactions. Related Reading: Over 167 Million BAT Utilized In DeFi Mainly In Compound, Aave And Uniswap According to Lookonchain, &#8220;Wallet &#8216;0x0D5&#8217; transferred 3 million USDT to Binance on June 26 and extracted 50,000 COMP, equating to around $2.26 million, 16 hours ago.&#8221; The same entity reportedly withdrew an additional 120,000 COMP, valued at approximately $5.53 million from Binance shortly after. The whale/institution withdrew another 120K $COMP ($5.53M) from #Binance just now. So the rise in the price of $COMP may have something to do with this whale/institution.https://t.co/6LfmjMxaRZ pic.twitter.com/Deh4v260qt — Lookonchain (@lookonchain) June 29, 2023 Such considerable transfers often signify bullish behavior and could contribute to the increase in COMP&#8217;s price, given their potential influence on the token&#8217;s supply and demand dynamics. Compound (COMP) Latest Price Action COMP token price has increased in the past few days, with the governance token breaking multiple resistance levels. COMP is currently trading above $46, up 51.7% over the past week. The token currently has a market capitalization of $321 million, making it rank 109th among the largest cryptocurrency by market cap. Meanwhile, over the past 24 hours, the asset has seen an upward trend of nearly 10% in price. COMP has also added more than $100 million to its market cap in the past weeks. The asset market capitalization has surged from a low of below $200 million in the past few days to as high as $321 million as of today. COMP&#8217;s daily trading volume has also recorded a significant surge from the $10 million volume seen earlier this month to stand above $90 million in the past 24 hours. COMP currently has a 24-hour low of $38.82 and a 24-hour high of $47.39. Related Reading: Compound Prepares For A Major Rally To $80, Here Is Why Notably, the token&#8217;s performance is not limited to the past day or week. When viewed over a two-week span, COMP has recorded a substantial growth pattern, registering a 70% gain. At the beginning of the month, COMP was trading at a low of $25 per token. At the time of writing, however, the token stands tall, commanding a price of $46.94. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-29T13:06:31.000Z",
    "title": "Turning Memes into Millions: A Comprehensive Strategy Guide for Investing in Meme Coins like Hollywood X PEPE",
    "url": "https://www.crypto-news-flash.com/turning-memes-into-millions-a-comprehensive-strategy-guide-for-investing-in-meme-coins-like-hollywood-x-pepe/?utm_source=rss&utm_medium=rss&utm_campaign=turning-memes-into-millions-a-comprehensive-strategy-guide-for-investing-in-meme-coins-like-hollywood-x-pepe",
    "description": "In the eclectic world of cryptocurrencies, &#8216;meme coins&#8217; have emerged as a distinctive category. They began as internet jokes but have since evolved into serious investment opportunities, with some investors turning memes into millions. A prominent player is Hollywood X PEPE, a meme coin gaining substantial attention and value. This blog will serve as a [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-29T12:40:05.000Z",
    "title": "Warner Music Group and Polygon Join Forces to Accelerate Blockchain Innovation in the Music Industry",
    "url": "https://www.crypto-news-flash.com/warner-music-group-and-polygon-join-forces-to-accelerate-blockchain-innovation-in-the-music-industry/?utm_source=rss&utm_medium=rss&utm_campaign=warner-music-group-and-polygon-join-forces-to-accelerate-blockchain-innovation-in-the-music-industry",
    "description": "Polygon Labs and Warner Music Group have entered a strategic partnership. The collaboration will seek to promote music oriented startups. New York-headquartered multinational entertainment and record label conglomerate Warner Music Group (WMG) has collaborated with Polygon Labs to roll out a music accelerator program that integrates the best of blockchain technology in the music industry. [...]"
  }
]