[
  {
    "source": "Decrypt",
    "date": "2024-01-03T11:15:51.000Z",
    "title": "Michael Saylor to Sell $216 Million in MicroStrategy Stock Options, Buy More Bitcoin",
    "url": "https://decrypt.co/211626/michael-saylor-to-sell-216-million-in-microstrategy-stock-options-buy-more-bitcoin",
    "description": "MicroStrategy co-founder Michael Saylor plans to \"acquire additional Bitcoin\" for his personal holdings with some of the proceeds of the sale."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-03T11:10:58.000Z",
    "title": "US national debt soars past $34 trillion, spotlight on Bitcoin as potential hedge",
    "url": "https://cryptoslate.com/insights/us-national-debt-soars-past-34-trillion-spotlight-on-bitcoin-as-potential-hedge/",
    "description": "<p>Quick Take The US national debt has recently hit an unprecedented landmark, crossing the $34 trillion mark. As reported by analyst Joe Consorti, the national debt has seen an alarming increment of $2.5 trillion in just six months, according to Consorti. In a broader timeframe, an addition of approximately $10.5 trillion in the past three [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/us-national-debt-soars-past-34-trillion-spotlight-on-bitcoin-as-potential-hedge/\">US national debt soars past $34 trillion, spotlight on Bitcoin as potential hedge</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NullTX",
    "date": "2024-01-03T11:32:37.000Z",
    "title": "LITECOIN PRICE ANALYSIS & PREDICTION (January 2) – LTC Quickly Lost Buzz After Almost Testing $76, What Happened? ",
    "url": "https://nulltx.com/litecoin-price-analysis-prediction-january-2-ltc-quickly-lost-buzz-after-almost-testing-76-what-happened/",
    "description": "After ending last year in red, LTC found support and bounced off a key level to start the new year on a strong note. But it quickly lost buzz and now looks weak on a daily outlook. It lost 1% in the last 24 hours. Litecoin went through some hurdles [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-03T11:33:36.000Z",
    "title": "EU banking watchdog to probe links between banks and crypto entities",
    "url": "https://crypto.news/eu-banking-watchdog-to-probe-links-between-banks-and-crypto-entities/",
    "description": "The European Banking Authority (EBA) is proposing testing to see if tensions in non-bank financial institutions (NBFIs), including cryptocurrency-related entities, will impact lenders. According to the Financial Times, EBA chairman José Manuel Campa expressed concern about the need to &#8220;deepen&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-03T11:30:00.000Z",
    "title": "Algorand at new highs; Arweave and InQubeta garner investor interest",
    "url": "https://crypto.news/algorand-at-new-highs-arweave-and-inqubeta-garner-investor-interest/",
    "description": "InQubeta is garnering investor interest while Arweave and Algorand are also on their radar"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-03T11:30:05.000Z",
    "title": "Bitcoin Breaks Through Securities Barrier: Registered Funds Want Exposure To BTC",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-breaks-securities-barrier/",
    "description": "An interesting trend looks to be developing among institutional players as their interest in the flagship cryptocurrency, Bitcoin, continues to rise. This interest has in no small way been thanks to the frenzy around the Spot Bitcoin ETFs, which could be approved sooner than later. Other ETFs Considering Bitcoin As An Investment Option   Crypto commentator and music producer Marty Party recently drew the crypto community’s attention to an emerging trend among fund managers and their ETFs. He noted how these asset managers are amending the prospectus of funds they manage so they can gain exposure to Bitcoin.  Related Reading: Dogecoin Is Bullish? Crypto Analyst Gives Reasons Why Investors Should Pay Attention These institutions are said to be looking to use 15% to 50% of assets under their management to gain exposure to BTC. One way they will be looking to achieve this is through the Spot Bitcoin ETFs that could potentially launch anytime soon.  Marty Party specifically highlighted the case of Advisors Preferred Trust, which is already looking to gain the SEC’s permission to invest up to 15% of its AuM in Bitcoin-related ETFs like Grayscale’s Bitcoin Trust (GBTC) and ProShares Bitcoin Strategy ETF.  MicroStrategy’s Executive Chairman and Co-founder, Michael Saylor, had previously hinted that something like this was going to happen soon enough. Then, he suggested that more institutional players were going to direct more of their capital to Bitcoin.  A rule that was implemented by the Financial Accounting Standards Board (FASB) has also paved the way for more companies like MicroStrategy to include BTC on their balance sheet.  The launch of Spot Bitcoin ETFs will also make it easier for these institutional investors to gain direct exposure to the flagship cryptocurrency.  For a long time now, those who had a prior interest in the crypto token have had to either invest in Bitcoin futures ETFs or other Bitcoin derivatives on exchanges like the Chicago Mercantile Exchange (CME). But this is changing with the potential approval of a Spot Bitcoin ETF. BTC price holds $45,000 &#124; Source: BTCUSD on Tradingview.com Grayscale Leading In The “Cointucky Derby” As highlighted recently by Bloomberg Analyst James Seyffart, Grayscale looks to set the lead the way, assuming all pending Spot Bitcoin ETFs were approved simultaneously. This is because the asset manager has already established itself with GBTC and would likely have more capital than other issuers upon launch.  Related Reading: Is A Bitcoin Spot ETF Approval A Sell The News Event? Experts Respond Bloomberg Analyst Eric Balchunas highlighted this fact and hinted that the Securities and Exchange Commission (SEC) could decide not to let Grayscale launch on day one because of this. If that doesn’t happen and all funds launch simultaneously, then Grayscale is likely to have a sort of ‘first mover advantage.’ However, other asset managers will be looking to assert their dominance by adopting different strategies. One such strategy will be these issuers undercutting themselves in terms of the fees they will charge to manage their respective funds. Invesco already made it known that they will be waiving fees for the first six months and the first $5 billion in assets.  Featured image from Finra, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-03T11:27:30.000Z",
    "title": "Polygon’s (MATIC) Patient Play Aims for $1.82 Price Target",
    "url": "https://www.crypto-news-flash.com/polygons-matic-patient-play-aims-for-1-82-price-target/?utm_source=rss&utm_medium=rss&utm_campaign=polygons-matic-patient-play-aims-for-1-82-price-target",
    "description": "<img width=\"2133\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logo-floating-on-a-dark-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polygon-MATIC-logo-floating-on-a-dark-background\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" />Polygon has dipped below $1 today, but according to one analyst, MATIC is getting closer to breaking free from a triangular pattern it has been caught in for some time. The analyst predicts that the token will hit $1.25 first but will slowly march towards $1.82, a price target that would require MATIC to double [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-03T11:28:33.000Z",
    "title": "Top 3 BRC-20 Low-cap Coins with 50-100x Potential",
    "url": "https://www.altcoinbuzz.io/spotlight/top-3-brc-20-low-cap-coins-with-50-100x-potential/",
    "description": "<p>2023 was a better year for the crypto industry, as we slowly. But, it steadily moved away from the thick part of the bear market into better sentiments. Also, several crypto narratives took center stage last year. Some of these narratives include Layer 2, Ordinals, Chinese Coins, AI, and BRC-20. The BRC-20 narrative was arguably [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/spotlight/top-3-brc-20-low-cap-coins-with-50-100x-potential/\">Top 3 BRC-20 Low-cap Coins with 50-100x Potential</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-03T11:34:19.000Z",
    "title": "South Korea Exempts Self-Custodied Crypto From Overseas Tax Reporting",
    "url": "https://coinedition.com/south-korea-exempts-self-custodied-crypto-from-overseas-tax-reporting/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-3-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-3-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-3-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-3-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-3-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-3-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-3-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-3-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-3-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-3-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-3-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-3-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-tax-3-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Tax authorities in South Korea have excluded crypto assets stored in non-custodial and decentralized wallets from overseas financial account reporting, according to Korean crypto news outlet Digital Asset. The update from the authorities gives clarity on the recently introduced financial account reporting for crypto assets. Notably, the much-needed clarification means assets held in self-custody wallets [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/south-korea-exempts-self-custodied-crypto-from-overseas-tax-reporting/\">South Korea Exempts Self-Custodied Crypto From Overseas Tax Reporting</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]