[
  {
    "source": "CryptoSlate",
    "date": "2023-08-09T02:00:13.000Z",
    "title": "Former FTX executive Ryan Salame reportedly negotiating plea deal in face of campaign finance charges",
    "url": "https://cryptoslate.com/former-ftx-executive-ryan-salame-reportedly-negotiating-plea-deal-in-face-of-campaign-finance-charges/",
    "description": "<p>Ryan Salame once co-CEO at FTX&#8216;s Bahamas subsidiary, FTX DM, is reportedly in talks with federal prosecutors that could see him plead guilty to criminal charges related to the collapse of the crypto exchange, Bloomberg reported on Aug. 8. Though Bloomberg described the negotiations underway as a plea deal, the news outlet said it is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/former-ftx-executive-ryan-salame-reportedly-negotiating-plea-deal-in-face-of-campaign-finance-charges/\">Former FTX executive Ryan Salame reportedly negotiating plea deal in face of campaign finance charges</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-09T02:02:00.000Z",
    "title": "Crypto Analyst Predicts $XRP Could Skyrocket to $1,896, But Not Everyone is Buying It",
    "url": "https://www.cryptoglobe.com/latest/2023/08/crypto-analyst-predicts-xrp-could-skyrocket-to-1896-but-not-everyone-is-buying-it/",
    "description": "Cryptocurrency analysts have recently started making outstanding price predictions for the native token of the XRP Ledger, $XRP, after a major player in the cryptocurrency’s ecosystem, Ripple, joined the International Swaps and Derivatives Association (ISDA). A recent tweet from a popular analyst going by Digital Perspectives on the microblogging platform X (formerly known as Twitter), […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-09T02:00:06.000Z",
    "title": "Bitcoin Price To Stay Below $30,000 For Now, Thick Ceiling To Hinder Possible Rally?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-price-to-stay-below-30000-for-now-thick-ceiling-to-hinder-possible-rally/",
    "description": "The Bitcoin price has experienced a slight uptick in the past 24 hours as bulls defended critical support. The number one cryptocurrency by market cap might try another run north of critical resistance, but recent data points towards further sideways price action. Related Reading: Terra Luna Token Burn Proposal Greenlit – Could $1 Be Hittable? As of this writing, Bitcoin trades at $29,400 with a 2% profit in the past day. Over the past week, the cryptocurrency has recorded similar profits while the rest of the market stalls or sees losses. Key resistance stands at around $30,000, but BTC failed to breach it on every recent occasion. Bitcoin Price Prepares… For Monotony? Over the past two years, the Bitcoin price has been moving in tandem with macroeconomic forces. In particular, BTC reacts to the tension from the U.S. Federal Reserve (Fed) and its interest rates hike program. The financial institution is entering a quiet period due to summer vacations. As a result, according to crypto analysis firm Blofin, Bitcoin and the crypto market will likely stay within their current range until September. Over this period, price movements and volatility spikes will continue to decline as the low liquidity environment impacts price action, and institutions hedging their positions impact volatility, Blofin stated. Furthermore, the report claims that potential interest rate hikes are “somewhat priced in” and could be inefficient in propelling BTC above $30,000. The current macroeconomic landscape could persist until May 2023 as inflation, the key reason behind the interest rates hike, becomes sticky. The above could translate into sideways price action until that period or until the U.S. Fed decides to cut interest rates paving the way for more risk appetite across the sector. Blofin stated: (…) investors seem to have become accustomed to daily life at high interest rates. The lack of liquidity has left investors with little interest in “trading”. Most investors are sitting on the sidelines. Bitcoin Investors Brace For Impact The chart below shows monthly trading volume across crypto exchanges has declined since July 2022. The report stated that this status quo reflects investors&#8217; lack of interest in crypto, with BTC recording intraday price movements of around 0.1%, a first for the cryptocurrency in such an extended period. Related Reading: Bitcoin Miners Show Accumulation Again, Bullish Sign? In that sense, the crypto research firm believes that, due to the lack of strength around BTC and ETH, prices are likely to see a dip: (…) it is not difficult to find that when the price of BTC is around $30,000, and the price of ETH is around $2,000, both will lose further upward momentum here, hovering for a while, and then fall. The time to hit both levels was short or long, but further price breakouts did not occur. There seems to be an invisible ceiling around these two levels (…) Cover image from Unsplash, chart from Tradingview"
  }
]