[
  {
    "source": "CoinDesk",
    "date": "2023-06-21T13:00:00.000Z",
    "title": "Bitcoin Miner CleanSpark to Buy 2 Georgia Facilities for $9.3M",
    "url": "https://www.coindesk.com/business/2023/06/21/bitcoin-miner-cleanspark-to-buy-2-georgia-facilities-for-93m/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The new facilities are expected to add just under 1 EH/s to Nasdaq-listed CleanSpark's hashrate."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-21T13:00:00.000Z",
    "title": "Galaxy-Backed Investment Platform Truvius Taps CoinDesk Indices for Digital Asset Portfolios",
    "url": "https://www.coindesk.com/business/2023/06/21/galaxy-backed-investment-platform-truvius-taps-coindesk-indices-for-digital-asset-portfolios/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The sectors Truvius will offer on its platform include currency, DeFi, smart contracts, and others based on CDI's Digital Asset Classification Standard."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-21T12:53:14.000Z",
    "title": "Bitcoin Crosses $29K for First Time in Over a Month",
    "url": "https://www.coindesk.com/markets/2023/06/21/bitcoin-crosses-29k-for-first-time-in-over-a-month/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The world’s largest cryptocurrency has rallied over 8% in the last 24-hours on the back of various traditional finance players jumping into crypto."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-21T13:00:00.000Z",
    "title": "Crypto Exchange BIT Unveils Options Market for Cardano's ADA Token",
    "url": "https://www.coindesk.com/markets/2023/06/21/crypto-exchange-bit-unveils-options-market-for-cardanos-ada-token/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "BIT's unified margin system allows ADA holders to trade options at a discount."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-21T13:00:00.000Z",
    "title": "Bitcoin hits $28,000 after BlackRock files for BTC ETF",
    "url": "https://cointelegraph.com/news/bitcoin-hits-28-000-after-blackrock-files-for-btc-etf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/591318d1-922d-4ad7-96e6-999b519b8c53.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>On this week’s episode of The Market Report, Cointelegraph looks at the probable causes of recent Bitcoin price action, and its market dominance reaching 50% of the total crypto market cap.</p>\n                    <p><p>In the latest episode of <em>The Market Report,</em> Cointelegraph analyst and writer Marcel Pechman explains what’s behind Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) reaching 50% crypto market dominance for the first time in two years amid Blackrock’s spot exchange-traded fund (ETF) filing, and the United States Securities and Exchange Commission’s crackdown on altcoins.</p><p>According to Pechman, it must be admitted that no one expected Bitcoin to become the second-largest nonfungible token blockchain. Analysis from CryptoSlam shows that the 30-day adjusted data — excluding wash trades — was $380 million for Ether (ETH), versus $104 million on Bitcoin and $40 million on Solana (SOL).</p><p>Therefore, Michael Saylor’s call for 80% market dominance depends on decentralized finance moving to the Bitcoin network. While it might sound impossible right now, that’s because there is no infrastructure for smart contracts on Bitcoin, regardless of a second layer.</p><p>Next, Pechman raises an issue with Glassnode’s recent “<a href=\"https://insights.glassnode.com/the-week-onchain-week-25-2023/\" target=\"_blank\" rel=\"noopener nofollow\">The Week On-Chain</a>” report. Using data from previous halving cycles, analysts ascertain that Bitcoin sideways price action may last 18 months, which “suggests that another 6 to 12 months may be ahead of us.“</p><p>Pechman reminds us that, in real life, if the Bitcoin price spikes from $25,000 to $70,000 and corrects to $40,000, for example, that’s life or death for most traders — figuratively speaking. Calling the pre-halving period “sideways boredom” just because Bitcoin eventually reaches $150,000 after the halving does not make sense.</p><p>In the final segment, Pechman discusses Deutsche Bank’s digital asset custody license application. A digital asset custody service means holding client assets, not investing the bank’s money or integrating cryptocurrency services. When it comes to accepting Bitcoin and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) deposits as collateral for international shipping or originating loans, Pechman believes we’re still some way from seeing this.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/VLAe3VSvWTg\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Don’t miss <a href=\"https://youtube.com/playlist?list=PL-HcIk8DKvOhEEnHS66lcpr8A3Ebw7Zp2\" target=\"_blank\" rel=\"noopener nofollow\"><em>The Market Report</em></a>, which airs exclusively on the new <a href=\"https://www.youtube.com/@cointelegraphmarketresearch\" target=\"_blank\" rel=\"noopener nofollow\">Cointelegraph Markets &amp; Research</a> YouTube channel.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-21T12:45:00.000Z",
    "title": "Binance SEC lawsuit could dent crypto exchange’s global plans",
    "url": "https://cointelegraph.com/news/binance-sec-lawsuit-could-dent-crypto-exchange-s-global-plans",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/a33c2343-806a-4889-b3bf-8afac517634e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The U.S. SEC is issuing a spate of regulatory actions against major exchanges, including the world’s largest digital asset exchange, Binance.</p>\n                    <p><p>The United States Securities and Exchange Commission <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">filed a lawsuit against Binance</a> along with its U.S. platform and CEO Changpeng Zhao on June 5 in a Washington, D.C. federal district court for allegedly violating securities laws and offering unregistered securities. </p><p>The U.S. regulator has accused the crypto exchange of offering unregistered securities in the form of its now-paused Binance USD (<a href=\"https://cointelegraph.com/binance-usd-busd-price-index\">BUSD</a>) stablecoin and its native token BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>). The SEC also deemed its Simple Earn and BNB Vault products and its staking program as violations of securities law.</p><p>The SEC further alleged that Binance.US and its legal company, BAM Trading, failed to register as an exchange, broker or clearing agency and named Zhao as a “controlling person.” Although Binance has maintained throughout that the global entity, as well as the U.S.-based crypto platforms, are independent, the lawsuit alleged that the funds from the Biance global platform and Binane.US were co-mingled on multiple occasions.</p><p>The suit also listed nine crypto tokens trading on the platform as securities — Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>), Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>), Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>), Filecoin (<a href=\"https://cointelegraph.com/filecoin-fil-price-index\">FIL</a>), Cosmos (<a href=\"https://cointelegraph.com/cosmos-price-index\">ATOM</a>), The Sandbox (<a href=\"https://cointelegraph.com/the-sandbox-sand-price-index\">SAND</a>), Decentraland (<a href=\"https://cointelegraph.com/decentraland-mana-price-index\">MANA</a>), Algorand (<a href=\"https://cointelegraph.com/algorand-algo-price-index\">ALGO</a>), Axie Infinity (<a href=\"https://cointelegraph.com/axie-infinity-axs-price-index\">AXS</a>) and Coti (COTI).</p><p>The SEC lawsuit, which levies 13 charges against the crypto exchange, its U.S. entity and the CEO, came within weeks of a Reuters report alleging the exchange was comingling customer funds. </p><p>The report alleged that the crypto exchange mixed its corporate revenue with customer funds in 2020 and 2021 and that the commingling occurred on a daily basis.</p><p>Reuters cited three insiders with knowledge of the crypto exchange’s finances and further claimed that the majority of commingling had occurred on accounts held at <a href=\"https://cointelegraph.com/news/impact-of-the-silvergate-collapse-on-crypto-watch-the-market-report-live\">now-bankrupt Silvergate Bank</a>, with amounts reaching the billions of dollars.</p><p>The report also claimed that many of the Silvergate accounts involved in comingling were linked to Zhao. At the time, Binance had refuted the claims and <a href=\"https://cointelegraph.com/news/binance-customer-fund-mismanagement-denial-against-mainstream-reports\">called it a conspiracy theory</a>, only for the SEC to include those accusations in their lawsuits just a few weeks later.</p><p>Binance <a href=\"https://www.binance.com/en/blog/ecosystem/sec-complaint-aims-to-unilaterally-define-crypto-market-structure-8707489117122437402\" target=\"_blank\" rel=\"noopener nofollow\">refuted</a> the accusations made by the SEC in the lawsuit in a blog post and claimed that the onus falls on the SEC for not offering any clear regulatory guidelines for crypto platforms in the United States. </p><p>The SEC lawsuit also came within months of another lawsuit against the crypto exchange and CEO Zhao by the United States Commodity Futures Trading Commission on March 27. The CFTC lawsuit had <a href=\"https://cointelegraph.com/news/binance-and-cz-sued-by-cftc-over-us-regulatory-violations\">alleged violations of derivatives law</a> and failure to register with the required authorities.</p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/magazine/opinion-republican-crypto-maxis-democrat-anti-crypto-army-mchenry-warren/\">Opinion: GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’</a></em></strong></p><p>The SEC lawsuit might have taken many by surprise even though the security regulator has been <a href=\"https://cointelegraph.com/news/bad-day-for-binance-with-sec-investigation-and-reuters-expose\">investigating the crypto exchange since early 2022</a>. </p><p>The SEC’s social media post, highlighting an insider message from Binance’s chief compliance officer from 2018, further raised eyebrows.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today we charged Binance Holdings Ltd. (Binance); U.S.-based affiliate, BAM Trading Services Inc., which, together with Binance, operates <a href=\"https://t.co/swcxioZKVP\">https://t.co/swcxioZKVP</a>; and their founder, Changpeng Zhao, with a variety of securities law violations.<a href=\"https://t.co/H1wgGgR5ir\">https://t.co/H1wgGgR5ir</a> <a href=\"https://t.co/IWTb7Et86H\">pic.twitter.com/IWTb7Et86H</a></p>&mdash; U.S. Securities and Exchange Commission (@SECGov) <a href=\"https://twitter.com/SECGov/status/1665779371108335618?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>To some, the inclusion of this comment in the SEC’s public announcement <a href=\"https://twitter.com/ShiningforceNL/status/1665812369828634624?s=20\" target=\"_blank\" rel=\"noopener nofollow\">made</a> the commission’s approach look more like a personal vendetta than an enforcement drive. </p><p>Iota co-founder Dominik Schiener told Cointelegraph that the agenda of the SEC under Gary Gensler has never been to close the regulatory gap of digital assets and to offer companies a path forward to become compliant: </p><blockquote>“The approach of the SEC has always been to delay, obfuscate and ignore. After the SEC’s blatant failure in protecting retail investors in FTX, Celsius, Voyager and others, they have now chosen to actively fight the crypto industry, with Binance having become the most obvious scapegoat.” </blockquote><p>Bitfinex chief technology officer Paolo Ardoino also advocated for proactive guidance from regulators over enforcement, citing the example of European regulators. He told Cointelegraph that the “MiCA License is a good example of a regulator committing to establish a clear set of guidelines and actively working towards an encompassing framework that provides companies with a solid operational foundation and provides room for feedback.”</p><p>“We see regulators taking a proactive approach to digital assets in Hong Kong, Singapore, Dubai and El Salvador. The concern has to be that regulators who are less open in providing feedback will push away companies and talent. There is an urgent need for inclusive and uniform regulations that not only foster innovation but also safeguard the welfare of customers and investors,” Ardoino added.</p><h2>Parallel to FTX?</h2><p>Binance’s legal trouble with regulators is nothing new, and over the years, the crypto exchange has faced multiple regulatory challenges in various regions. However, in the past, the crypto exchange has managed to get away with either a warning or a fine for its violations, but that has changed with the collapse of multiple crypto platforms and lending firms over the past few years. </p><p>Although the downfall of FTX toward the end of 2022 deteriorated public trust in the crypto industry, Binance and Zhao garnered wider support for their transparency at the time. However, the new lawsuits and accusations of commingling funds have dealt a blow to public trust in the world’s largest crypto exchange.</p><p>Many in the crypto community were quick to draw parallels between FTX and Binance after the accusations of commingling of funds surfaced.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This is going to be soo much bigger than FTX. <a href=\"https://t.co/MkYgTOElEp\">https://t.co/MkYgTOElEp</a></p>&mdash; TruthLabs  (@BoringSleuth) <a href=\"https://twitter.com/BoringSleuth/status/1666688597028753409?ref_src=twsrc%5Etfw\">June 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The exchange’s market depth declined over 78% for its U.S. entity, while its market share in the U.S. dropped below 1%.</p><p>Itai Avneri, deputy CEO of INX — an SEC-registered broker-dealer service for digital assets — told Cointelegraph that, while it is tough to predict outcomes for the exchange, it is clear that Binance was trading cryptocurrencies in the U.S. deemed securities by the SEC without a broker-dealer license: </p><blockquote>“Binance has already lost a great deal of public trust, but it has also aided in the decreased public trust of the entire crypto industry, which has already been plagued with scandal. Customers are uncertain and don’t know who to trust, what to trade, and how to trade it.”</blockquote><p>Avneri added further that there is a very clear regulatory path to registering digital securities that complies with the Securities Exchange Act of 1934. “It doesn’t matter how old those laws are — they are still relevant today. Binance chose to work around the rules and now is dealing with the implications of those shortcuts and other activities,” Anveri added.</p><p>He advised that, while the SEC is claiming that most cryptocurrencies are — in fact — securities, industry participants should register digital assets as such and find a path to list and trade them in a compliant way in the U.S. under current securities law. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/6e612064-f0cf-4bd2-9a35-af58d440d7a8.jpg\"  /><figcaption style=\"text-align: center;\">Source: <a href=\"https://twitter.com/cryptounfolded/status/1668428729293447168?t=ZoctWsXyLi79jTPMRCY_tw&amp;s=19\" target=\"_blank\" rel=\"noopener nofollow\">Twitter</a></figcaption></figure><p>Dave Birnbaum, director of product at Bitcoin-focused crypto trading platform Coinbits, told Cointelegraph that “it’s pretty clear that Binance.US will not survive this lawsuit. Emails have leaked that seem to show Binance compliance executives flaunting U.S. law — not a good look. The best case is Binance continues international operations and [Zhao] lives out his life without setting foot in the U.S. and going to prison.”</p><p>He added that Binance may have enough assets to weather the storm and continue non-U.S. operations; however, one key factor to keep an eye on is the value of Binance’s BNB token, which has taken a nosedive following the SEC charges.</p><h2>Binance’s legal trouble in the U.S. dents its global goals</h2><p>Binance has claimed that it is focused on becoming compliant with the newly passed Markets in Crypto-Assets (MiCA) legislation in the European Union over the course of the next 18 months.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Important dates for the industry coming up, MiCA has now been published in the official journal of the EU: <a href=\"https://t.co/in3qlQO3wV\">https://t.co/in3qlQO3wV</a> <br><br>This means crypto businesses now have firm timelines to implement and be compliant with MiCA&#39;s requirements. Stablecoin rules apply from June 30,… <a href=\"https://t.co/qQtZbxZWqV\">https://t.co/qQtZbxZWqV</a></p>&mdash; CZ  Binance (@cz_binance) <a href=\"https://twitter.com/cz_binance/status/1667119855445704704?ref_src=twsrc%5Etfw\">June 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, Binance’s legal trouble in the U.S. may have put a dent in its global ambitions. In the weeks immediately following the SEC submitting its lawsuit, the exchange <a href=\"https://cointelegraph.com/news/binance-crypto-exchange-exits-netherlands\">withdrew from the Dutch market</a> after failing to obtain a virtual asset license from the regulators despite its multiple attempts.</p><p>Binance claimed that it had explored multiple alternative avenues to serve Dutch residents in compliance with local regulations. However, no such avenues offered a path to virtual asset service provider registration.</p><p>The global crypto exchange has also <a href=\"https://cointelegraph.com/news/binance-applies-to-deregister-in-cyprus\">applied to cancel its registration in Cyprus</a> after receiving a Class 3 registration, the highest level of service provision, as a Crypto Asset Services Provider (CASP) in the country. Binance claimed the move was made to focus on the larger EU market; however, a Reuters report claimed that, despite receiving a Class 3 registration, Binance never offered its services in the region.</p><p>Binance also applied to <a href=\"https://cointelegraph.com/news/binance-cancels-registration-in-the-uk-amid-regulatory-scrutiny\">cancel registration for inactive United Kingdom businesses</a> with the Financial Conduct Authority. The exchange told Cointelegraph that Binance Markets Limited has canceled its existing permissions, which were not in use and unrelated to crypto activities.</p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/slow-food-kenny-schachter-reflects-on-blockchain-art-s-past-present-and-future\">Slow Food: Kenny Schachter reflects on blockchain art’s past, present and future</a></em></strong></p><p>Amid its plans to become MiCA compliant and enter the EU, reports about an ongoing investigation in France have surfaced. The investigation against the exchange is reportedly based on charges of “<a href=\"https://cointelegraph.com/news/binance-france-investigation-report\">aggravated money laundering</a>.”</p><p>While Binance claimed its recent cancellation of multiple registrations across European countries is to become MiCA-compliant, some have suggested that European states are working with the SEC to put pressure on Binance. </p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-21T13:06:06.000Z",
    "title": "Bitcoin price briefly pumps to $138,000 on Binance.US amid exchange’s liquidity crisis",
    "url": "https://cryptoslate.com/bitcoin-price-hits-138000-on-binance-us-amid-exchanges-liquidity-crisis/",
    "description": "<p>Bitcoin (BTC) experienced a &#8220;flash-pump&#8221; to $138,000 on Binance.US during early trading hours of June 21, according to data from the crypto exchange. The Bitcoin price spike lasted only seconds before returning to its normal level and was specific to the exchange&#8217;s BTC/USDT trading pair, while other assets continued trading at their usual levels. Low [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-price-hits-138000-on-binance-us-amid-exchanges-liquidity-crisis/\">Bitcoin price briefly pumps to $138,000 on Binance.US amid exchange&#8217;s liquidity crisis</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-21T13:00:00.000Z",
    "title": "WisdomTree and Invesco File Bitcoin ETF Applications",
    "url": "https://cryptodaily.co.uk/2023/06/wisdomtree-and-invesco-file-bitcoin-etf-applications",
    "description": "<p class=\"md-end-block md-p md-focus\">Global investment firm BlackRock's recent filing for a spot Bitcoin Exchange-Traded Fund (ETF) has reignited optimism in the industry and spurred a flurry of similar filings.</p>\n<p class=\"md-end-block md-p\">Less than a week after BlackRock's application, renowned investment firms WisdomTree and Invesco have followed suit, filing applications for their respective spot Bitcoin ETFs.</p>\nWisdomTree's Persistence in Spot Bitcoin ETF Filing\n<p class=\"md-end-block md-p\">New York-based WisdomTree lodged its latest filing for a spot Bitcoin ETF with the United States Securities and Exchange Commission (SEC) on June 21. If approved, the \"WisdomTree Bitcoin Trust\" would be listed on the Cboe BZX Exchange under the ticker \"BTCW.\" Notably, this is WisdomTree's third attempt to secure approval for a spot Bitcoin ETF. Previous applications submitted in December 2021 and October 2022 were rejected due to the SEC's concerns about fraud and market manipulation.</p>\n<p class=\"md-end-block md-p\">In their recent filing, WisdomTree, which oversees approximately $83 billion in assets, has expressed willingness to enter into a \"surveillance sharing agreement\" with a U.S.-based spot trading platform for Bitcoin. This step echoes BlackRock's approach in its recent filing, aiming to mitigate the SEC's concerns by establishing robust surveillance mechanisms to detect and prevent price distortions and manipulation.</p>\nInvesco Reactivates Its Application for a Spot Bitcoin ETF\n<p class=\"md-end-block md-p\">Shortly after WisdomTree's application, Invesco, a global investment manager, reactivated its application for a similar spot Bitcoin ETF product. The proposed \"Invesco Galaxy Bitcoin ETF\" aims to be listed on the Cboe BZX exchange, per the 19b-4 document informing the SEC of the proposed rule change.</p>\n<p class=\"md-end-block md-p\">Invesco's filing emphasizes the benefit of professional custodians and other service providers. This setup, they argue, reduces reliance on \"loosely regulated offshore vehicles\" and ensures better protection for investors' principal investments in Bitcoin.</p>\nImpact of BlackRock's Strong ETF Approval Track Record\n<p class=\"md-end-block md-p\">Bloomberg's senior ETF analyst Eric Balchunas responded to the flurry of filings, attributing the renewed activity to BlackRock's entry into the race. Balchunas highlighted BlackRock's impressive track record, with a 575-1 success rate of ETF approvals by the SEC, adding weight to the firm's application.</p>\nSpeculations About Fidelity Investments' Entry\n<p class=\"md-end-block md-p\">Amid this resurgence of interest in Bitcoin ETFs, there are rumors that Fidelity Investments, a multi-trillion-dollar fund manager, might also join the fray. Speculation is rife that Fidelity, which manages roughly $4.9 trillion in assets, could file for its own spot Bitcoin ETF or possibly make an offer on Grayscale's GBTC ETF product.</p>\n<p class=\"md-end-block md-p\">While the SEC has yet to approve a spot Bitcoin ETF, the recent wave of applications, driven by industry giant BlackRock's filing, has renewed hope and sparked a fresh round of interest in this segment of the crypto market.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T13:08:43.000Z",
    "title": "Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices if you are considering investing in cryptocurrency. However, it is not just enough to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You have to look at Algorand&#8217;s price prediction from 2023 to 2032, its expected minimum ... <a title=\"Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T12:51:47.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and the platform they need to build blockchain solutions. At this time, we can only make educated guesses ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T12:43:45.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 BREAKING: Twitter to enable #crypto trading in partnership with eToro. Users searching using a $Cashtag symbol currently see live charts for a select few financial assets, like $LTC. Users will soon be able to click through to eToro &#38; have the option to invest in #Litecoin. Is Litecoin silver to Bitcoin&#8217;s ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-21T13:05:28.000Z",
    "title": "Avalanche, Chainlink & Caged Beasts Are Revolutionizing Passive Income Investments In 2023",
    "url": "https://nulltx.com/avalanche-chainlink-caged-beasts-are-revolutionizing-passive-income-investments-in-2023/",
    "description": "The world of cryptocurrencies continues to evolve, offering seasoned traders and investors, as well as crypto enthusiasts, new and innovative ways to generate passive income. In this article, we delve into three exciting avenues for passive income in the crypto space: Avalanche (AVAX), Chainlink (LINK) and Caged Beasts (BEASTS). Each platform presents unique opportunities to [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-21T13:00:42.000Z",
    "title": "Crypto Whales Sway From VeChain & Monero; Caged Beasts A Likely Candidate?",
    "url": "https://nulltx.com/crypto-whales-sway-from-vechain-caged-beasts-a-likely-candidate/",
    "description": "Crypto whales have had a massive impact on the crypto space since the dawn of digital financing. These entities possess substantial holdings, giving them the ability to influence the market with their trading activities. As a result, whales attract attention and speculation due to their wealth, shaping the direction of the crypto community and impacting [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-21T13:07:34.000Z",
    "title": "Bitcoin Cash leads charge as global crypto markets recover",
    "url": "https://crypto.news/bitcoin-cash-leads-charge-as-global-crypto-markets-recover/",
    "description": "Following a downturn that compounded investor angst, the broader crypto market has embarked on a recovery campaign, with bitcoin cash (BCH) leading the charge. This recovery is geared towards reclaiming the losses of the past week. Notably, the global crypto&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-21T13:00:00.000Z",
    "title": "Dogecoin and Tradecurve tokens show bullish signs on daily chart",
    "url": "https://crypto.news/dogecoin-and-tradecurve-tokens-show-bullish-signs-on-daily-chart/",
    "description": "Tradecurve and Dogecoin tokens are bullish. Analysts are bullish DOGE and TCRV will continue to perform well in the sessions ahead"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-21T12:59:16.000Z",
    "title": "Court ruling fuels Coinbase’s regulatory quest against SEC",
    "url": "https://crypto.news/court-ruling-fuels-coinbases-regulatory-quest-against-sec/",
    "description": "Coinbase&#8217;s chief legal officer, Paul Grewal, recently spotlighted the SEC&#8217;s apparent evasiveness on crypto regulation-related questions from a federal court.  In the uncertain landscape of cryptocurrency regulation, another significant clash has taken center stage.&#160; Paul Grewal, Chief Legal Officer of&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-21T13:00:38.000Z",
    "title": "US Bitcoin Investor Trading Volume Rises, Stage Set For Another Massive Rally?",
    "url": "https://www.newsbtc.com/bitcoin-news/us-bitcoin-investor-trading-volume-rises-stage-set-for-another-massive-rally/",
    "description": "The crypto market has been thrown into a euphoric state over the last 24 hours as the price of Bitcoin has surged once more. In its latest run, the digital asset was able to retest the $29,000 resistance before being rejected but continues to hold up nicely above $28,000. This time around, dominance from US investors has been on the rise, suggesting that they may be the leaders of this rally. US Bitcoin Trading Volume Rises To 44% The trading volume from US investors fell to a low 29% back in January and the uncertain regulatory headwinds did not much help investor sentiment. However, this has quickly changed with US investors taking advantage of the low prices presented last week when BTC fell below the $25,000 resistance. Related Reading: Bullish Signal: Bitcoin Realized Profit And Loss Fall To October 2020 Levels A report from Kaiko shows that US investor BTC trading volume has risen sharply compared to its January figures to 44% in June. This shift in Bitcoin trading volume suggests that investors are moving back toward BTC and leaving altcoins behind once more. BTC volume on US exchanges rise to 44% &#124; Source: Kaiko This explains the fact that while Bitcoin has been on an impressive rally, altcoins have not seen as much upside. Thus, it is safe to say that most of this rally will likely be focused on BTC, indicating the potential for further upside from here. A move toward BTC compared to altcoins also shows a lower risk appetite among crypto investors. This is because while altcoins provide an opportunity for higher gains, it also comes with a higher risk of losses Hence, making Bitcoin the choice for investors when getting back into the market from a bear, but not wanting to take too many risks. BTC Steadies Above $28,000 Bitcoin bulls have now set their sights on the $30,000 price level after adding $2,000 to the digital asset’s value in the last 48 hours. This recovery signals what could possibly be the start of another 100% run similar to the one that was witnessed in the first quarter of 2023. BTC reclaims $28,000 support &#124; Source: BTCUSD on TradingView.com If this happens, then $40,000 is a conservative stop point for the BTC price. The question then remains if this rally will rub off on altcoins which are still struggling, especially since the majority of the new volume is currently focused on Bitcoin. Related Reading: Crypto Analyst Says Bitcoin Has Already Bottomed, Sets Halving Price Nevertheless, a rise to $40,000 would be a welcome development for the BTC market and could trigger the start of another massive bull rally, a year earlier than expected. At the time of writing, BTC has broken above $28,900, displaying 8.23% gains in the last 24 hours. The cryptocurrency is performing even better on the 7-day chart after rising 11.34% and bringing its total market cap back above $561 billion. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T13:00:58.000Z",
    "title": "Solana Price Prediction: Is SOL Gearing Up For Price Pump? Tradecruve Set To Increase In Price",
    "url": "https://www.crypto-news-flash.com/solana-price-prediction-is-sol-gearing-up-for-price-pump-tradecruve-set-to-increase-in-price/?utm_source=rss&utm_medium=rss&utm_campaign=solana-price-prediction-is-sol-gearing-up-for-price-pump-tradecruve-set-to-increase-in-price",
    "description": "In the cryptocurrency industry, investors are always monitoring different digital assets to see those with potential bullish movements. Currently, there is growing interest in Solana and Tradecruve&#8217;s token, with speculations of a potential price surge. The question now is if it will happen. &#62;&#62;BUY TCRV TOKENS NOW&#60;&#60; Solana Price Prediction: Is SOL Gearing Up For [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T13:00:30.000Z",
    "title": "Breaking Records: Iris Energy’s Bitcoin Mining Expansion Fuels 21% Stock Spike",
    "url": "https://www.crypto-news-flash.com/breaking-records-iris-energys-bitcoin-mining-expansion-fuels-21-stock-spike/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-records-iris-energys-bitcoin-mining-expansion-fuels-21-stock-spike",
    "description": "Iris Energy announces plans to enhance hash rate capacity to 9.1 EH/s by early 2024. The company is constructing 80MW of data center space as part of its expansion efforts. Iris Energy is currently focused on completing the construction of 80 megawatts (MW) of data center space, which represents the initial phase of its 600MW site [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-21T12:53:50.000Z",
    "title": "Top 3 Crypto ChatGPT Pluggins – Part 1",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-crypto-chatgpt-pluggins-part-1/",
    "description": "<p>As technology continues to evolve, artificial intelligence (AI) models have become increasingly sophisticated, and the crypto industry is not an exception. In this article, we will explore each of these ChatGPT plugins that will help to every person related to the crypto industry. 1) Crypto Prices The Crypto Prices plugin adds real-time cryptocurrency price information [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-3-crypto-chatgpt-pluggins-part-1/\">Top 3 Crypto ChatGPT Pluggins &#8211; Part 1</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-21T13:01:00.000Z",
    "title": "Pepecoin ($PEPE) Soars to 7-Day High: Is the Bull Run Over?",
    "url": "https://coinedition.com/pepecoin-pepe-soars-to-7-day-high-is-the-bull-run-over/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Pepe2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Pepe2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Pepe2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Pepe2-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Pepe2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Pepe2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Pepe2-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Pepe2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Pepe2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Pepe2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Pepe2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Pepe2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Pepe2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Pepe2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Pepe2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Pepe2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Pepe2-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bullish optimism in the Pepe (PEPE) market has peaked in the past 24 hours, with bulls driving the price from an intraday low of $0.000000912 to a new 7-day high of $0.000001106. As of press time, the price had slightly retraced to $0.000001059, reflecting a 14.19% rise from its intraday low. Along with the price [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/pepecoin-pepe-soars-to-7-day-high-is-the-bull-run-over/\">Pepecoin ($PEPE) Soars to 7-Day High: Is the Bull Run Over?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-21T12:41:00.000Z",
    "title": "LTC’s Anticipated Rally Could Materialize Before Its Halving",
    "url": "https://coinedition.com/ltcs-anticipated-rally-could-materialize-before-its-halving/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/106.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/106.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/106-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/106-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/106-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/106-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/106-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/106-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/106-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/106-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/106-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/106-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/106-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/106-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/106-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/106-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/106-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>With Litecoin’s (LTC) third halving coming up in August this year, many people expect the price of the altcoin to soar in anticipation of the event. The altcoin’s price performance has been relatively lackluster over the past few weeks. However, the much-anticipated gains leading up to the halving may soon take place. As the scheduled [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ltcs-anticipated-rally-could-materialize-before-its-halving/\">LTC’s Anticipated Rally Could Materialize Before Its Halving</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]