[
  {
    "source": "CoinDesk",
    "date": "2023-09-21T10:00:00.000Z",
    "title": "Here’s How FTX Founder Sam Bankman-Fried’s Trial May Play Out",
    "url": "https://www.coindesk.com/policy/2023/09/21/heres-how-ftx-founder-sam-bankman-frieds-trial-may-play-out/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "FTX founder and onetime CEO Sam Bankman-Fried will stand trial in just under two weeks to defend himself against allegations he deliberately committed fraud and conspired to defraud crypto investors and customers in FTX and Alameda Research. CoinDesk spoke to several legal experts about how the case may proceed."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-21T09:51:24.000Z",
    "title": "Mt. Gox Trustee Extends Deadline for Creditor Repayments By a Year",
    "url": "https://decrypt.co/198147/mt-gox-trustee-extends-deadline-for-creditor-repayments-by-a-year",
    "description": "Mt. Gox creditors have another wait on their hands, with the repayment deadline pushed back to October 2024."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-21T09:57:35.000Z",
    "title": "Mt. Gox Bitcoin repayment: The day that never comes",
    "url": "https://cointelegraph.com/news/mt-gox-bitcoin-repayment-delay",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/016a9bbd-9a7d-49c0-a1f8-156c20d7af18.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Over the last decade, Mt. Gox has repeatedly backtracked on plans to reimburse the funds that the crypto exchange had barred its users from withdrawing — effective from Feb 25, 2014. </p>\n                    <p><p>Mt. Gox’s <a href=\"https://cointelegraph.com/news/mt_gox_blows_fallout_could_be_catastrophic\">infamous 2014 security breach</a> — that lost 850,000 Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) of investors’ funds — resulted in its users embarking on a seemingly never-ending, decade-long pursuit of closure via funds reimbursement.</p><p>Over the years, Mt. Gox has backtracked on its numerous plans to reimburse the funds that the crypto exchange had barred its users from withdrawing — effective from Feb 25, 2014. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/e22c4567-d115-4e26-8ff4-58136a460cb5.png\"  /><figcaption style=\"text-align: center;\"><em>Latest notice concerning the change of repayment deadlines. Source: Mtgox.com</em></figcaption></figure><p>However, with Mt. Gox postponing its repayment deadlines by one more year, from Oct. 31, 2023, to Oct. 31, 2024, the wait for redressal extends into the 11th year for Mt. Gox investors. </p><h2>Mt. Gox 2014: The year of the largest Bitcoin hack - (Avg. BTC price $420)</h2><p>Days after Mt. Gox lost 850,000 BTC in the February 2014 breach, leaked documents revealed that the crypto exchange became insolvent. It read:</p><blockquote>“The cold storage has been wiped out due to a leak in the hot wallet. The reality is that MtGox can go bankrupt at any moment, and certainly deserves to as a company.”</blockquote><p>It was generally assumed that the fall of Mt. Gox would mean the end for Bitcoin, considering that the exchange managed 70% of the total circulating Bitcoin at the time. Mt. Gox filed for bankruptcy protection in Tokyo District Court, Japan after losing nearly $500,000 in value. </p><p>The exchange was soon hit by numerous lawsuits as investors feared the possibility of Mt. Gox’s intention to return investors’ funds. The sentiment of mistrust grew over the year as Mt. Gox revealed no plans for reimbursement while deleting its website and social media presence.</p><h2>Mt. Gox 2015: Back and forth with Tokyo court (Avg. BTC price $260)</h2><p>Amid its ongoing bankruptcy proceedings in Tokyo District Court, Mt. Gox CEO Mark Karpelès was arrested without charge for 23 days by the Japanese police for allegedly manipulating the computer system to inflate his account. Authorities found it hard to link criminals to crypto crimes due to the lack of regulations around cryptocurrencies. </p><p>On April 22, 2015, Mt. Gox’s bankruptcy trustee, Nobuaki Kobayashi, <a href=\"https://www.mtgox.com/img/pdf/201504_notice1_en.pdf\" target=\"_blank\" rel=\"noopener nofollow\">instructed</a> users to file a claim for their missing Bitcoin via mail or a form that could be accessed with a Mt Gox login and password. </p><p>It was believed that Mt. Gox would return around 20% of the users' funds considering the fall in Bitcoin’s market price.</p><h2>Mt. Gox 2016: Investors go through the claim process (Avg. BTC price $620)</h2><p>Mt. Gox revealed that only $91 million in assets were slated to be distributed to claimants. However, not all investors came to terms with Mt. Gox’s alleged plans to reimburse a small portion of funds. As a result, the total claims for reimbursement reached $2.4 trillion even though the loss was around $500,000. </p><p>This was also the year when the idea of storing cryptocurrencies in cold wallets got much-needed attention from the crypto community. </p><p>After being arrested twice in 2015 under the allegations of embezzlement of $3 million of customers money, <a href=\"https://cointelegraph.com/news/mt-gox-ceo-mark-karpeles-out-on-bail-thinner-than-before\">Karpelès was released from jail</a> on July 13, 2016, after paying a bail bond of nearly $100,000. </p><h2>Mt. Gox 2017: Legal struggles and introduction of Karpeles coin (Avg. BTC price $5,000)</h2><p>Discussions around funds reimbursement were overshadowed by the legal proceedings against former Mt. Gox CEO Karpelès’ involvement in funds embezzlement. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Karpeles admits operating Willy bot, now called an &quot;obligation exchange&quot;, but says it was for good of company so not illegal <a href=\"https://twitter.com/hashtag/KarpelesTrial?src=hash&amp;ref_src=twsrc%5Etfw\">#KarpelesTrial</a></p>&mdash; Kolin Burges (@The_K_meister) <a href=\"https://twitter.com/The_K_meister/status/884648706372448256?ref_src=twsrc%5Etfw\">July 11, 2017</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>During the trial, Karpelès admitted to operating a so-called ‘Willy Bot’ (obligation exchange). The bot <a href=\"https://cointelegraph.com/news/new-wizsec-report-points-to-definitive-insider-trading-at-mt-gox\">earned its name from Mt. Gox traders</a> concerned about the manipulation of the exchange’s volumes at its peak.</p><p>On Nov. 28, 2017, Karpelès introduced his plans to conduct an initial coin offering (ICO) to raise $245 million to “revive” Mt. Gox. However, Karpeles discarded the decision after learning about the legal hurdles around launching an ICO campaign.</p><h2>Mt. Gox 2018: A slow year for creditors (Avg. BTC price $7,000)</h2><p>Following a strong price recovery over the past year, on August 1, 2018, Mt. Gox <a href=\"https://mtgox-creditors.com/2018/08/02/revised-basic-policy-for-preparing-a-rehabilitation-plan-as-of-august-1-2018/\" target=\"_blank\" rel=\"noopener nofollow\">revised</a> its basic policy for preparing a rehabilitation plan. It read:</p><blockquote>“Mt. Gox is not capable of returning all BTC deposited by creditors. Accordingly, we consider that all assets of Mt. Gox should be distributed to creditors and not to shareholders.”</blockquote><p>At the time, the exchange believed that most of the assets, including approximately 166,000 BTC and 168,000 of Bitcoin Cash (<a href=\"https://cointelegraph.com/bitcoin-cash-price-index\">BCH</a>) and other derivatives currently held by Mt. Gox, should be paid to creditors at the time of the first payment.</p><p>Despite the ongoing discussion, a resolution was never reached that could satisfy legal and creditors’ requirements.</p><h2>Mt. Gox 2019: Plan extensions and delays (Avg. BTC price $8,000)</h2><p>The anticipation for the Mt. Gox was at peak as a rehabilitation plan was seemingly underway.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/1a036376-f94f-4238-b4bb-87c8a298abd5.png\"  /><figcaption style=\"text-align: center;\"><em>Mt. Gox extends deadlines for rehabilitation plans. Source: Mt. Gox</em></figcaption></figure><p>However, Mt. Gox requested the Tokyo court to extend the deadline for the submission of the rehabilitation plan. On Oct. 25, 2019, the Tokyo District Court issued an order to extend the deadline for a rehabilitation plan from October 28, 2019 to March 31, 2020.</p><h2>Mt. Gox 2020: Plan extensions and delays (Avg. BTC price $11,000)</h2><p>Going against the 5-year long trend of delaying reimbursements to users, in early 2020, New York-based private equity firm Fortress offered to buy out creditor claims from Mt. Gox. had the deal gone through, eligible creditors would have received $1,293 for every bitcoin they owned on the exchange’s wallet.</p><p>By March, Mt. Gox issued yet another draft rehabilitation plan, which revealed its plans to liquidate cryptocurrencies other than BTC and BCH. However, investors were made to wait much longer after the Tokyo court approved Mt. Gox's yet another request for an extension citing “matters that require closer examination.”</p><p>The court heeded the motion, thereby postponing the Mt Gox Bitcoin settlement date to October 15, 2020, which was later pushed further into the next year.</p><h2>Mt. Gox 2021: Bitcoin bull run creates hopium (Avg. BTC price $37,000)</h2><p>On Oct 20, 2021, Mt. Gox creditors approved a rehabilitation plan to compensate them for billions in lost Bitcoin. According to Mt. Gox trustee Nobuaki Kobayashi, roughly 99% of the creditors affected by the collapse sided with the latest reimbursement plans. </p><p>With Bitcoin reaching an all-time high of $69,000, it was popularly believed that the value held in Mt. Gox's Bitcoin stash could suffice to reimburse complete losses for the investors.</p><p>Amid positive investor sentiment, users awaited further instructions as they waited for the approved plans to unfold.</p><h2>Mt. Gox 2022: Registrations for reimbursement contiues (Avg. BTC price $42,000)</h2><p>The enthusiasm from 2021 seeped into this year as investors lined up to provide details for registering repayment methods. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/6af4903f-9235-46d8-a0da-15bc1b671373.png\"  /><figcaption style=\"text-align: center;\"><em>Mt. Gox shares Repayment method plans. Source: Mt. Gox</em></figcaption></figure><p>It was also rumored that the release of 150,000 BTC could create a 'black swan' event for the Bitcoin ecosystem. The Mt. Gox creditors were given until January 2023 to register and select a repayment method as part of the plan by which they will be compensated for their losses.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-mt-gox-repayment-date-looming-is-bitcoin-in-trouble\">Mt. Gox repayment date looming: Is Bitcoin in trouble?</a></em></strong></p><h2>Mt. Gox 2023: The day that never comes (Avg. BTC price $27,000)</h2><p>The deadlines for reimbursement registrations got pushed into the future twice in 2023. However, on April 7, Mt. Gox trustee Kobayashi stated that the deadline for creditors to provide their repayment information — clarification of payee and payment type — <a href=\"https://cointelegraph.com/news/mt-gox-registration-deadline-pushed-for-another-month\">has passed</a>. </p><p>To the creditor’s disappointment, Mt. Gox <a href=\"https://cointelegraph.com/news/mt-gox-trustee-changes-repayment-deadline-october-2024\">changed repayment deadline to October 2024</a>. </p><p>Mt. Gox has not yet responded to Cointelegraph’s request for comment about its commitment to reimburse users’ funds. In a Sept. 21 letter, Kobayashi wrote that, with the permission of the Tokyo District Court, he had extended the deadline for the base repayment, the early lump-sum repayment and the intermediate repayment.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ai-killed-translation-industry-easytranslate-boss-change-human-jobs/\">‘AI has killed the industry’: EasyTranslate boss on adapting to change</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-21T09:50:12.000Z",
    "title": "Tether 2023 stablecoin loans rise despite downsizing announcement in 2022",
    "url": "https://cointelegraph.com/news/tether-2023-stablecoin-loans-rise-despite-size-down-plans",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/06432a40-1098-4173-b519-d38be0f39e38.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Tether said the new loans were made at the request of some of its long-standing partners, and it plans to cut it down to zero by 2024.</p>\n                    <p><p>Tether, the largest stablecoin issuer in the crypto market, has seen a rise in its stablecoin lending, or secured loans, in 2023, despite the firm having announced it will cut <a href=\"https://cointelegraph.com/news/tether-to-reduce-secured-loans-to-zero-in-2023-amid-battle-against-fud\">such loans down to zero</a> in December 2022. </p><p>In the company's latest quarterly report, Tether noted that its assets included $5.5 billion of loans as of June 30, up from $5.3 billion in last quarter. A Tether spokesperson <a href=\"https://www.wsj.com/finance/currencies/tether-is-lending-its-stablecoins-again-b11705f2\" target=\"_blank\" rel=\"noopener nofollow\">told </a>the Wall Street Journal (WSJ) that the recent rise in stablecoin lending was due to a few short-term loan requests from clients with whom the firm has “cultivated longstanding relationships.” The spokesperson also said that the company plans to cut such loans to zero by 2024.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/84f0f199-dd91-4d5b-849c-389818c161d6.png\"  /><figcaption style=\"text-align: center;\"><em>Tether Stablecoin loans on the rise in 2023. Source: The Company</em></figcaption></figure><p>The stablecoin loans had become a popular lending product for the stablecoin issuer, allowing customers to borrow USDT from Tether in return for some collateral. However, these secured loans were always shrouded in controversy due to a lack of transparency on the collateral and the borrowers.</p><p>A WSJ <a href=\"https://www.wsj.com/articles/rising-tether-loans-add-risk-to-stablecoin-crypto-world-11669875590\" target=\"_blank\" rel=\"noopener nofollow\">report </a>in December 2022 raised concerns about the products, as well about claims about these loans were fully collateralized. The WSJ questioned Tether’s ability to meet redemption requirements in times of crisis.</p><p><strong><em>Related:</em></strong><a href=\"https://cointelegraph.com/news/crypto-biz-you-can-t-stop-the-tether-fud\"><strong><em> Crypto Biz: You can’t stop the Tether FUD</em></strong></a></p><p>Tether <a href=\"https://tether.to/en/tether-addresses-fud-around-secured-loans-reveals-plans-to-reduce-these-to-zero-in-2023/\" target=\"_blank\" rel=\"noopener nofollow\">addressed </a>these controversies last year prior to announcing its plan to eliminate secured loans entirely in 2023. At the time the stablecoin issuer called the concerns around secured loans \"FUD\" and claimed the loans were over collaterized.</p><p>The recent rise in secured loans for Tether comes amid growing market dominance and profit for the firm. Tether reported $3.3 billion in surplus reserves up from just $250 million last year in September. Cointelegraph reached out to Tether for comments but has not yet received a response.</p><p><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/tether-authorizes-1-b-usdt-to-replenish-tron-network&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a> to preserve this moment in history and show your support for independent journalism in the crypto space.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-21T09:45:50.000Z",
    "title": "Balancer calls .fi domains unsafe after regaining access to front end",
    "url": "https://cryptoslate.com/balancer-calls-fi-domains-unsafe-after-regaining-access-to-front-end/",
    "description": "<p>The decentralized finance (DeFi) protocol Balancer has reportedly regained control over its domain after losing approximately $240,000 due to a frontend compromise due to a Domain Name Service (DNS) attack. Balancer made the statement confirming it had regained access via X on Sept 20. The DNS attack led to the theft of significant digital assets. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/balancer-calls-fi-domains-unsafe-after-regaining-access-to-front-end/\">Balancer calls .fi domains unsafe after regaining access to front end</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-21T10:00:18.000Z",
    "title": "DappGambl Report: The NFT Bubble Bursts, From Sky-High Hopes to Crushing Lows",
    "url": "https://www.cryptoglobe.com/latest/2023/09/dappgambl-report-the-nft-bubble-bursts-from-sky-high-hopes-to-crushing-lows/",
    "description": "DappGambl reports that during the cryptocurrency bull market of 2021/22, Non-Fungible Tokens (NFTs) emerged as a significant phenomenon. NFTs, or Non-Fungible Tokens, are unique digital assets verified using blockchain technology. Unlike cryptocurrencies like Bitcoin or Ether, which are interchangeable and identical, each NFT has distinct information or attributes that make it unique. NFTs gained immense […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-21T09:54:36.000Z",
    "title": "Fed rate pause repercussions for Bitcoin",
    "url": "https://cryptodaily.co.uk/2023/09/fed-rate-pause-repercussions-for-bitcoin",
    "description": "Wednesday saw Federal Reserve chairman Jerome Powell announce that U.S. interest rates would stay as they are. A slightly hawkish speech implied a future rise. How will Bitcoin react?"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-21T10:00:11.000Z",
    "title": "Report: Bhutan Commences Plan to Develop 600-Megawatt Bitcoin Mining Farm",
    "url": "https://news.bitcoin.com/report-bhutan-commences-plan-to-develop-600-megawatt-bitcoin-mining-farm/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_653749978-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Report: Bhutan Commences Plan to Develop 600-Megawatt Bitcoin Mining Farm\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_653749978-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_653749978-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_653749978-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_653749978-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_653749978-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_653749978-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_653749978.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Himalayan Kingdom of Bhutan along with its partner Bitdeer Technologies Group has reportedly kickstarted plans to develop a 600-megawatt crypto mining farm. Bitcoin mining in the kingdom is expected to &#8220;equip citizens to participate in the modern global economy from within Bhutan.&#8221; Bhutan&#8217;s Green and Affordable Power The Southeast Asian kingdom of Bhutan has [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T10:08:31.000Z",
    "title": "Crypto holder falls victim to $4.5M phishing scam",
    "url": "https://www.cryptopolitan.com/crypto-holder-falls-victim-to-4-5m-scam/",
    "description": "An unfortunate cryptocurrency holder has reportedly been defrauded in a staggering $4.46 million phishing scam. The incident, which serves as a stark reminder of the risks associated with digital assets, unfolded as $4.46 million in Tether (USDT) was illicitly withdrawn from a Kraken crypto exchange wallet and subsequently transferred to an address ending with &#8220;ACa7.&#8221; ... <a title=\"Crypto holder falls victim to $4.5M phishing scam\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-holder-falls-victim-to-4-5m-scam/\" aria-label=\"More on Crypto holder falls victim to $4.5M phishing scam\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T09:54:30.000Z",
    "title": "OpenAI Reveals DALL-E 3 for Easier Image Generation with Text and Typography Integration",
    "url": "https://www.cryptopolitan.com/openai-dall-e-3-for-easier-image-generation/",
    "description": "In a pioneering announcement, OpenAI has unveiled DALL-E 3, a remarkable leap forward in text-to-image generation technology set to launch in October. This cutting-edge model is designed to eliminate the need for intricate prompt engineering, transforming the way users interact with AI-generated images. DALL-E 3 offers an array of features that promise to enhance precision ... <a title=\"OpenAI Reveals DALL-E 3 for Easier Image Generation with Text and Typography Integration\" class=\"read-more\" href=\"https://www.cryptopolitan.com/openai-dall-e-3-for-easier-image-generation/\" aria-label=\"More on OpenAI Reveals DALL-E 3 for Easier Image Generation with Text and Typography Integration\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T09:51:48.000Z",
    "title": "How the Kingdom of Eswatini’s Digital Transformation Can Open Up the Country to Crypto Adoption",
    "url": "https://www.cryptopolitan.com/how-the-kingdom-of-eswatinis-digital-transformation-can-open-up-the-country-to-crypto-adoption/",
    "description": "TL;DR: The Kingdom of Eswatini&#8217;s digital transformation is opening up the country to crypto adoption by providing fast and reliable internet access to businesses, public schools, and rural communities. This is making it easier for people to learn about and use cryptocurrencies, and is also creating new opportunities for crypto-based businesses to operate in Eswatini. ... <a title=\"How the Kingdom of Eswatini&#8217;s Digital Transformation Can Open Up the Country to Crypto Adoption\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-the-kingdom-of-eswatinis-digital-transformation-can-open-up-the-country-to-crypto-adoption/\" aria-label=\"More on How the Kingdom of Eswatini&#8217;s Digital Transformation Can Open Up the Country to Crypto Adoption\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T09:51:46.000Z",
    "title": "Web3 phone METAVERTU: Genesis Block’s 0th mobile machine in the blockchain",
    "url": "https://www.cryptopolitan.com/web3-phone-metavertu-genesis-blocks-0th-mobile-machine-in-the-blockchain/",
    "description": "Singapore, September 13, 2023 -Pantera partner Paul Veradittakit, speaking at TOKEN 2049, emphasized the need for mobile accessibility in the global adoption of cryptocurrency products. At the same time, VERTU unveils its next-generation WEB3 phone, METAVERTU 2 during TOKEN 2049, slated for an official release at the end of October this year. Building on the ... <a title=\"Web3 phone METAVERTU: Genesis Block&#8217;s 0th mobile machine in the blockchain\" class=\"read-more\" href=\"https://www.cryptopolitan.com/web3-phone-metavertu-genesis-blocks-0th-mobile-machine-in-the-blockchain/\" aria-label=\"More on Web3 phone METAVERTU: Genesis Block&#8217;s 0th mobile machine in the blockchain\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T09:50:20.000Z",
    "title": "Mt. Gox rehabilitation trustee announces extended repayment deadline",
    "url": "https://www.cryptopolitan.com/mt-gox-announces-extended-repayment-deadline/",
    "description": "One of the most significant cryptocurrency exchange meltdowns in history, the Mt. Gox saga, has witnessed yet another twist in its long-winding narrative. Rehabilitation Trustee, Nobuaki Kobayashi, with the endorsement of the Tokyo District Court, has pushed back the repayment deadline for the beleaguered exchange&#8217;s creditors by a year. Previously slated for Oct. 31, 2023, ... <a title=\"Mt. Gox rehabilitation trustee announces extended repayment deadline\" class=\"read-more\" href=\"https://www.cryptopolitan.com/mt-gox-announces-extended-repayment-deadline/\" aria-label=\"More on Mt. Gox rehabilitation trustee announces extended repayment deadline\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T09:44:31.000Z",
    "title": "Warhaven: The Medieval Fantasy War-Game Now Available on PC, Consoles Coming Soon",
    "url": "https://www.cryptopolitan.com/warhaven-medieval-fantasy-war-game/",
    "description": "Explore the world of Warhaven as it arrives on PC and prepares to conquer consoles. Join epic battles and unite with friends across platforms for a memorable gaming experience."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-21T09:45:45.000Z",
    "title": "Terra Classic Forecast: Anticipating A 25% Price Surge With Bullish Patterns",
    "url": "https://www.newsbtc.com/all/terra-classic-forecast-anticipating-a-25-price-surge-with-bullish-patterns/",
    "description": "Terra Luna Classic (LUNC) has been on the radar of crypto enthusiasts and investors, but its recent price performance has left many scratching their heads. Since mid-August, the altcoin has been caught in a pronounced downtrend, drawing the attention of traders worldwide.  This intriguing price movement is marked by the presence of two distinct descending trend lines, which have consistently acted as dynamic barriers of support and resistance. The continuous interplay between Terra Classic&#8217;s price and these trend lines has given birth to a descending channel pattern. This pattern, shaped by the seesawing between support and resistance, holds the potential to offer insights into the altcoin&#8217;s trajectory in the days to come. Related Reading: Polygon (MATIC) Comeback Challenges – What’s Holding It Back? Terra Classic At A Crossroads The current LUNC price, as per CoinGecko, hovers at $0.00005745 with a modest 24-hour gain of 0.3%. However, over the past seven days, it has seen a slight decrease of 0.4%. The price chart has been marked by short-bodied daily candles adorned with extended wicks, indicative of market indecision.  Yet, history suggests that within falling channel patterns, such as the one LUNC is currently in, a bullish breakout often occurs. This hints at the possibility of LUNC breaking through the upper trend line and potentially experiencing a 6.3% surge. LUNC currently trading at $0.000057. Chart: TradingView.com Analyzing The Potential For A Bullish Rally Experts in the crypto space suggest that such a bullish move could amplify the demand pressure for Terra Luna Classic, potentially propelling the coin to rally by as much as 25%. This would put the next major resistance level at $0.000075 squarely in the altcoin&#8217;s sights, offering hope for those holding LUNC tokens. However, it&#8217;s worth noting that the crypto market is currently under the shadow of uncertainty. Renowned crypto analyst Nicholas Merten recently sounded a cautionary note in a YouTube strategy session.  Merten predicted a prolonged bearish trend for Bitcoin (BTC) and altcoins, expressing concern that this downturn could lead to widespread liquidations and the removal of excess money from the system, potentially contributing to economic challenges. Related Reading: Chainlink: Analyst’s Vision Of A 20% Rally And How It Could Happen Terra Luna Classic&#8217;s price behavior, ensnared within the confines of a descending channel pattern, is a topic of keen interest among crypto enthusiasts. While historical patterns hint at the possibility of a bullish breakout, the broader market climate remains uncertain.  As investors brace for potential turbulence, all eyes are on Terra Classic to see if it can break free from the gravitational pull of its descending trend lines and defy the prevailing market sentiment. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Sport Découverte"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-21T10:00:46.000Z",
    "title": "Mark Cuban’s $870,000 Crypto Loss; Could $DOMI and $SHIB Feel the Heat?",
    "url": "https://www.crypto-news-flash.com/mark-cubans-870000-crypto-loss-could-domi-and-shib-feel-the-heat/?utm_source=rss&utm_medium=rss&utm_campaign=mark-cubans-870000-crypto-loss-could-domi-and-shib-feel-the-heat",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-131.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-131.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-131-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-131-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In a surprising turn of events, tech mogul Mark Cuban found himself in the midst of a crypto crisis last week, marking an unfortunate end to an otherwise uneventful period of crypto inactivity. After months of steering clear of the crypto market, Cuban decided to dip his toes back in, only to fall victim to [...]"
  }
]