[
  {
    "source": "Decrypt",
    "date": "2023-07-06T22:49:49.000Z",
    "title": "The Most Anticipated Crypto and NFT Games",
    "url": "https://decrypt.co/15221/most-anticipated-crypto-games",
    "description": "Lavish titles like Illuvium, Shrapnel, and Otherside are poised to redefine blockchain gaming. Here's what to watch for in 2023 and beyond."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-06T22:52:57.000Z",
    "title": "Binance's top strategist departs company amid reported US exec resignations",
    "url": "https://cointelegraph.com/news/binance-cso-patrick-hillmann-departs-us-resignations-doj",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/4d735a74-e36f-4751-a291-cdc177d677f0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Patrick Hillmann confirmed in a tweet that would be departing the company \"on good terms\" after a two-year stint. The departure comes amid a trying time for Binance. </p>\n                    <p><p>Binance's chief strategy officer Patrick Hillman has confirmed he is leaving the crypto exchange amid reports that other top executives in the United States have been departing as a result of a United States Department of Justice (DOJ) investigation.</p><p>On July 6, Patrick Hillmann tweeted \"I am leaving [Binance], but I’m doing so on good terms.\"</p><p>\"I’ve been here for two years and it’s simply time for me to move on to the next challenge,\" added Hillman, noting that he is now expecting his second child, \"so the time is right for me to step aside.\"</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Apologies for any typos, but I was not expecting to be tweeting about this today. <br><br>It’s true that I am leaving <a href=\"https://twitter.com/binance?ref_src=twsrc%5Etfw\">@Binance</a>, but I’m doing so on good terms. I continue to respect and support <a href=\"https://twitter.com/cz_binance?ref_src=twsrc%5Etfw\">@cz_binance</a> and am grateful for having had the incredible opportunity to work under his…</p>&mdash; Patrick Hillmann (@PRHillmann) <a href=\"https://twitter.com/PRHillmann/status/1677070523740884992?ref_src=twsrc%5Etfw\">July 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The tweet follows a <a href=\"https://fortune.com/crypto/2023/07/06/binance-crisis-executives-quit-changpeng-zhao-justice-department/\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from Fortune, citing a person at the exchange familiar with the situation, that several Binance executives including Hillmann left the exchange over CEO Changpeng \"CZ\" Zhao's response to the DOJ's investigation.</p><p>General counsel Han Ng and senior vice president for compliance Steven Christie have been reported to have left the exchange.</p><p>A separate report from Bloomberg, also <a href=\"https://www.bloomberg.com/news/articles/2023-07-06/binance-executive-patrick-hillmann-us-employees-leave-as-crisis-deepens#xj4y7vzkg\" target=\"_blank\" rel=\"noopener nofollow\">citing</a> a source, stated that Binance's head of legal for APAC and MENA, Eleanor Hughes, will become the new general counsel replacing Ng, while Noah Perlamn, who joined as chief compliance officer in February, will remain at the company. </p><p>Cointelegraph contacted Binance for comment but did not immediately receive a response.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/binance-refers-users-coinmerce-exchange-exits-netherlands\">Binance refers users to Coinmerce as exchange exits the Netherlands</a></em></strong></p><p>The DOJ is reportedly <a href=\"https://cointelegraph.com/news/us-justice-department-investigating-binance-for-violating-russian-sanctions-report\">investigating Binance</a> for allowing Russians to use the exchange in violations of U.S. sanctions.</p><p>In June, the Securities and Exchange Commission (SEC) <a href=\"https://cointelegraph.com/news/5-key-highlights-sec-lawsuit-binance\">sued Binance</a> for allegedly offering unregistered securities and misusing customer funds among other charges.</p><p>The Commodities Futures Trading Commission (CFTC) also <a href=\"https://cointelegraph.com/news/binance-and-cz-sued-by-cftc-over-us-regulatory-violations\">sued Binance in March</a> for allegedly failing to properly register with the regualtor. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/3-4-billion-bitcoin-popcorn-tin-silk-road-hacker/\">$3.4B of Bitcoin in a popcorn tin — The Silk Road hacker’s story</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-06T23:00:12.000Z",
    "title": "Multiple senior executives at Binance resign amid ongoing regulatory challenges",
    "url": "https://cryptoslate.com/several-binance-execs-including-cso-patrick-hillman-reportedly-quit-company/",
    "description": "<p>Multiple senior Binance executives have left the company following regulatory developments, Fortune reported on July 6. General counsel Han Ng, chief strategy officer Patrick Hillmann, and SVP for compliance Steven Christie are among those who have decided to exit the firm. Fortune noted that Matthew Price, head of global investigations and intelligence, recently left as [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/several-binance-execs-including-cso-patrick-hillman-reportedly-quit-company/\">Multiple senior executives at Binance resign amid ongoing regulatory challenges</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-06T23:00:04.000Z",
    "title": "BlackRock CEO Larry Fink Says Bitcoin Is Digital Gold, So What’s The Digital Silver?",
    "url": "https://www.newsbtc.com/bitcoin-news/blackrock-ceo-larry-fink-says-bitcoin-is-digital-gold-so-whats-the-digital-silver/",
    "description": "On Wednesday, an interview with BlackRock CEO Larry Fink went viral in which the CEO called Bitcoin an international asset. Not only that, Fink also pointed toward digital assets such as Bitcoin as being a way to digitize gold on the blockchain. This statement from the CEO has since been interpreted in various ways to mean that Fink referred to BTC as digital gold. So the question now remains, if Bitcoin is digital gold, which cryptocurrency is digital silver? ETH Is Digital Silver? The digital gold argument for Bitcoin continues but with Ethereum being the second-largest and most popular cryptocurrency in the market, it has often been dubbed the ‘Digital Silver’. Over the last seven years, its performance has also solidified claims that Ethereum is silver to Bitcoin’s gold. Related Reading: Rapid Rise In Cardano’s TVL Points Toward Bullish Sentiment Around ADA There have previously been claims that Litecoin qualifies to be referred to as the digital silver. Most of these claims were rooted in the fact that Litecoin’s mechanism is basically identical to that of BTC. However, performance-wise, it has fallen short compared to ETH, which is now BTC’s largest rival. One area where Litecoin tends to outshine Ethereum though is when it comes to supply. While Litecoin undergoes halving events every four years like BTC to reduce its block rewards and has a maximum supply, Ethereum has none of these things. ETH’s unlimited supply has usually been a concern as this means the digital asset could be a perpetually inflationary asset. That is, until the implementation of the ETH burn, aimed at reducing the rate at which new coins are being brought into circulation. Data from Ultrasound Money, a website that tracks the ETH burn and issuance rate, shows that instead of increasing, the ETH supply is now decreasing at a rate of 0.33% per year. This development eliminates the concerns about inflation for ETH, further giving credence to the fact that Ethereum is the digital silver. ETH price resting above $1,900 &#124; Source: ETHUSD on Tradingview.com Bitcoin Vs Ethereum, Which Is Better? The argument about the better option between Bitcoin and Ethereum continues to wax strong, especially on social media platforms. However, both of these digital assets are unique in their own way and serve different functions in the market. While Bitcoin continues to hold the torch as the pioneer cryptocurrency, garnering massive support over the last decade, Ethereum, in its own right, has propelled the concept of decentralized finance (DeFi). Related Reading: Shiba Inu Records Accelerated Burn Rate, But Price Fails To Respond The use of smart contracts on the latter has helped developers to create financial products investors can leverage to manage their own wealth without the need for an intermediary. Although this capability is gradually being developed on Bitcoin as well. For now, both digital assets serve different sides of the market. However, this could easily change in the future. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-06T22:39:47.000Z",
    "title": "Chainlink (LINK) Signal Returns That Prompted 14,000% Surge",
    "url": "https://www.newsbtc.com/analysis/link/chainlink-link-signal-returns-that-prompted-14000-surge/",
    "description": "Chainlink (LINK) was among a subset of cryptocurrencies that made a lower low on daily timeframes recently. A lower low is indicative of a continued downtrend and weakness at support. However, on higher timeframes, technical tell a very different story — one of possible strength building. In fact, a signal has appeared that the last time around prompted a 14,000% rally in LINKUSD. High Timeframe Bullish Confluence Hints At Surprise Chainlink Recovery Chainlink (LINKUSD) remains down more than 80% from its former all-time highs. Worse yet, after a full year at bear market lows, the range broke down temporarily forming a lower low on daily charts. In technical analysis, higher timeframes provide more dominant signals. And although there was a lower low made on the daily, the monthly timeframe did not make a lower low on a closing basis. Related Reading: GM: How A Morning Star Pattern Could Awaken Altcoins On top of being a possible range deviation and reclaim, the monthly candlestick formed a dragonfly doji. A dragonfly doji In Japanese candlestick analysis represents a possible bullish reversal pattern. Within even lower timeframes, Chainlink was among a slew of altcoins they formed a different bullish Japanese candlesticks reversal pattern on weekly timeframes, called the morning star pattern. Will a similar trend follow? &#124; LINKUSD on TradingView.com A LINK To The Past: Oversold Stochastic No More If bullish range reclaim on low timeframes, and a pair of higher timeframe Japanese candlestick reversal patterns aren’t enough confluence for you, there’s more. The one-month Stochastic has left oversold territory for the first time since late 2021. The indicator spent all of 2022 oversold, and halfway through 2023. Related Reading: Why Bitcoin Dominance Hints At A Surprise Altcoin Season Ahead Prior to that, the last time Chainlink left oversold conditions was back in early 2019, before going on an over 14,000% run. The signal is back and in alignment with the potential reversal patterns from above. Meanwhile, Bitcoin and other cryptocurrencies have enjoyed much more of a recovery by comparison. The broader trend turning around more clearly could remove whatever doubt is remaining surrounding LINK, allowing the altcoin to return to its former glory days. This chart originally appeared in Issue #10 of CoinChartist (VIP). Sign up for a free subscription. Tony is the author of the CoinChartist (VIP) newsletter. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  }
]