[
  {
    "source": "Decrypt",
    "date": "2023-11-28T21:28:32.000Z",
    "title": "Amazon Launches Q, A ChatGPT AI Competitor for Businesses",
    "url": "https://decrypt.co/207742/amazon-q-chatbot-for-business",
    "description": "After carving out a leadership position in cloud computing, the firm is determined to claim a significant share of the burgeoning AI market."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-28T21:25:22.000Z",
    "title": "Futures will be the best crypto game in town even after a Bitcoin spot ETF",
    "url": "http://cointelegraph.com/news/futures-best-crypto-game-even-after-bitcoin-spot-etf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/98935a7a-0eb4-4e4d-866d-607726de4250.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A spot Bitcoin ETF will bring fresh money to the market, but it will not change a fundamental reality: Bitcoin liquidity is declining.</p>\n                    <p><p>The <a href=\"https://cointelegraph.com/news/cme-second-largest-bitcoin-futures-exchange-open-interest-surges\">Chicago Mercantile Exchange (CME)</a> has long been the home of crypto for traditional finance investors, and this is unlikely to change — even with the approval of a Bitcoin spot ETF.</p><p>Activity on the CME has expanded significantly over the past 12 months. The CME now sees more Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) futures trading than the world’s biggest crypto exchange, Binance. Open BTC interest on the CME now makes up 24.7% of the entire market, making it the top Bitcoin futures trading venue in the world </p><p>While some of this activity is almost certainly linked to anticipation of approval for a spot ETF, the launch of one or more will not lead to a reduction of activity in the futures market. In fact, futures trading is likely to expand rather than contract when the SEC finally gives BlackRock et. al. the green light.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/history-tells-us-strong-bull-market-hard-landing\"><strong><em>History tells us we’re in for a strong bull market with a hard landing</em></strong></a></p><p>There is no doubt that a spot ETF will bring large flows of institutional money into the sector. However, it will not change the basic fundamentals of Bitcoin liquidity. As we know, the supply of Bitcoin is capped at 21 million. That means the futures market is the only place where real trade action can happen. </p><p>The CME has been successfully used by Goldman Sachs, Morgan Stanley, JP Morgan and others to trade cryptocurrency instruments for years, and they have been using futures to do so. Futures remain the instrument of choice because liquidity is the main issue in the spot market. These huge institutional investors could buy bitcoin at any time, but liquidity remains the chief drawback - not the lack of a spot ETF.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/c8687e6b-4694-4644-b989-7a94c5046c95.jpg\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin options open interest, June 2020-November 2023. Source: CoinGlass</em></figcaption></figure><p>Institutional investors that use the CME are also highly sophisticated. As such, any fund manager that takes a position in BlackRock’s spot ETF, for example, will want to hedge that position using futures on the CME. Accordingly, we can expect activity on the CME to grow almost in lockstep with the growth in spot ETFs.</p><p>Futures are also — as we know — a speculative instrument, and there is perhaps no market that is more speculative than cryptocurrency. As the asset class gains more legitimacy and credibility with the approval of a spot ETF, we will see more investors interested in all corners of digital asset trading.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-etfs-600-billion-tipping-point-crypto\"><strong><em>Bitcoin ETFs: A $600B tipping point for crypto</em></strong></a></p><p>Adventurous day traders who may have stuck to the foreign-exchange market in the past will likely start to venture into Bitcoin and other crypto instruments. And they will exercise this interest through the CME. Indeed, I suspect we will see increasing interest in perpetual swaps and other types of derivative instruments in the sector next year.</p><p>Crypto futures also benefit from clearer and more consistent regulation, which is another major factor here. While the Commodity Futures Trading Commission (CFTC) looks after futures, nobody has yet fully decided who looks after the crypto spot market from a regulatory perspective, and this remains a problem. Applications for these Bitcoin spot ETFs are currently sitting on the Securities and Exchange Commission’s desk, but as has become abundantly clear, Chairman Gary Gensler is a big fan of ambiguity. </p><p>Clear regulation is leading to obvious success in cryptocurrency futures, while the spot market is being hindered by regulatory opacity. And so, while the approval of an ETF is just a matter of time at this stage, we still don’t know how much time. While we are waiting, the futures market remains an extremely enticing trading ground for institutional investors.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Lucas Kiely</strong> is the chief investment officer for Yield App, where he oversees investment portfolio allocations and leads the expansion of a diversified investment product range. He was previously the chief investment officer at Diginex Asset Management, and a senior trader and managing director at Credit Suisse in Hong Kong, where he managed QIS and Structured Derivatives trading. He was also the head of exotic derivatives at UBS in Australia.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-28T21:10:05.000Z",
    "title": "Amazon Web Services introduces AI chatbot ‘Q’ and two new AI chips",
    "url": "https://cryptoslate.com/amazon-web-services-introduces-ai-chatbot-q-and-two-new-families-of-ai-chip/",
    "description": "<p>Amazon Web Services (AWS) announced on Nov. 28 the launch of &#8216;Q,&#8217; an AI-powered virtual assistant and chatbot to enhance workplace productivity. The chatbot, capable of engaging in conversations, problem-solving, and generating content and insights, can access company information to provide tailored responses. AWS plans to offer user-based plans with customized features and fees, emphasizing [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/amazon-web-services-introduces-ai-chatbot-q-and-two-new-families-of-ai-chip/\">Amazon Web Services introduces AI chatbot &#8216;Q&#8217; and two new AI chips</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-28T21:30:00.000Z",
    "title": "Dogecoin (DOGE) Network Surpasses 5 Million Addresses with a Balance Amid 16% Price Surge",
    "url": "https://www.cryptoglobe.com/latest/2023/11/dogecoin-doge-network-surpasses-5-million-addresses-with-a-balance-amid-16-price-surge/",
    "description": "The meme-inspired cryptocurrency has seen the total number of addresses on its network with a balance surpass the 5 million milestone after significant surging over the last few weeks amid rising cryptocurrency adoption. According to data from on-chain analytics firm IntoTheBlock, the Dogecoin network surpassed five million addresses with a balance on November 27 after […]\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-28T21:39:15.000Z",
    "title": "Berkshire Hathaway vice chair Charlie Munger passes away at age 99",
    "url": "https://crypto.news/berkshire-hathaway-vice-chair-charlie-munger-passes-away-at-age-99/",
    "description": "The vice chairman of multinational holding company Berkshire Hathaway once described cryptocurrency and artificial intelligence as \"overhyped\" and \"stupid\"."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-28T21:27:47.000Z",
    "title": "SEC extends comment window for Franklin Templeton and Hashdex Bitcoin ETFs",
    "url": "https://crypto.news/sec-extends-comment-window-for-franklin-templeton-and-hashdex-bitcoin-etfs/",
    "description": "Experts said the SEC could be laying blocks ahead of spot Bitcoin ETF approvals in early January 2024 following early delayed decisions on bids from two potential issuers."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-28T21:17:52.000Z",
    "title": "Ethereum turns deflationary as validators exit and defi transactions drop 57%",
    "url": "https://crypto.news/ethereum-turns-deflationary-as-validators-exit-and-defi-transactions-drop-57/",
    "description": "Ethereum's supply turns deflationary amid a decrease in validator participation and declining NFT and defi transactions."
  }
]