[
  {
    "source": "Decrypt",
    "date": "2024-03-21T22:52:34.000Z",
    "title": "Bitcoin Halving Expected on 4/20 Again—Here's Why the Date Keeps Shifting",
    "url": "https://decrypt.co/222835/bitcoin-halving-expected-420-why-date-keeps-shifting",
    "description": "The $69K price peak has already been surpassed, but the Bitcoin halving could indeed happen on 4/20 based on the latest data."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-21T23:00:14.000Z",
    "title": "Crypto Analyst Says XRP Price Is Headed For $27 As 2017 Pattern Emerges",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-headed-for-27/",
    "description": "Popular crypto analyst EGRAG CRYPTO, known for his very bullish stance on XRP, has predicted that the XRP price is headed for $27 as a pattern from 2017 emerges again. The analyst made this prediction known in a recent post on social media to reflect that XRP is now mimicking a historical cross between the 20 and 50 Simple Moving Averages. Interestingly, with XRP currently trading at $0.6079 amidst a lull market gain, EGRAG’s prediction represents a surge of over 4,300% from the current price levels.  Analyst Points To Similarities Between 2017 And Current Market Conditions A detailed look into EGRAG&#8217;s technical analysis points to a cross between the 20 SMA and 50 SMA, with the former crossing above the latter. Interestingly, this cross dates 50 bars on the weekly candlestick time frame, around 350 days ago. Now, he pointed out that this scenario has only happened twice throughout XRP&#8217;s history with two different outcomes, and XRP could now go on the path of either outcome or it could play out something new in the coming days. Related Reading: Shiba Inu Sees A Shift: Short Term Holders Take Possession Of 23 Trillion SHIB #XRP 🚀 Is This Similar to 2017, or Are We Witnessing Something New? The historical data reveals two crosses between the Yellow Line (20 SMA) and Blue Line (50 SMA). A) If this resembles Cycle &#8216;A&#8217;, then we could expect a rapid and aggressive price surge, akin to a rocket… pic.twitter.com/o8PVCqJP14 — EGRAG CRYPTO (@egragcrypto) March 19, 2024 American publicly traded company and crypto exchange, Coinbase has revealed plans to introduce Dogecoin (DOGE) in its futures contract offerings. The first time this type of cross happened between the two moving averages was in 2017. However, the price of XRP continued to consolidate for 49 weekly bars before going on a rapid and aggressive price surge to reach its current all-time high of $3.84. EGRAG called this &#8216;Cycle A&#8217;, likening the price action to a &#8220;rocket ship-style pump.&#8221; The second time this type of cross occurred was in 2021. In this cycle, which he called &#8216;Cycle B,&#8217; XRP went on a smaller consolidation for 32 bars before going on a lesser price surge than that of Cycle B. EGRAG believes that the current cycle, which he called &#8220;Cycle C,&#8221; mirrors that of Cycle A more than Cycle B, as there are no evident similarities in the patterns between the 20 SMA and 50 SMA.  EGRAG, in his continuous spirit of ultra-bullishness, forecasted that the current cycle might break out by a factor of 10 times bigger than the one that was seen in Cycle A, which would indicate a target of $27.  What’s Next For XRP Price? EGRAG is one of the few crypto analysts who are still optimistic about XRP&#8217;s future. In a former analysis made in December 2023, he noted various scenarios of how XRP could surge past $1 in the first quarter of 2024 amidst a bull run ushered in by Spot Bitcoin ETFs. Related Reading: Bitcoin Supply On Exchanges Hit 4-Year Low, But Why Is Price Crashing? Although the introduction of these ETFs undoubtedly attracted capital to the cryptocurrency space and propelled Bitcoin to yet a new record high, XRP&#8217;s price hasn&#8217;t increased all that much. XRP crossed over $0.73 on March 11 for the first time since November 2023 but has been on a downfall since then with the formation of lower highs and lower lows. However, things could change into a strong bullish momentum very soon if XRP bulls continue to hold above the $0.6 price support.  Token price jumps above $0.61 &#124; Source: XRPUSDT on Tradingview.com Featured image from CoinMarketCap, chart from Tradingview.com"
  }
]