[
  {
    "source": "Cointelegraph",
    "date": "2023-11-22T19:44:39.000Z",
    "title": "Bitcoin derivatives traders target $40K BTC price now that Binance is resolved",
    "url": "http://cointelegraph.com/news/bitcoin-traders-target-40-k-btc-price-now-that-binance-resolved",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/b97958fa-6752-4b7c-a58a-191f150af738.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC futures and options held firm despite a wave of negative news, and data shows traders targeting $40,000.</p>\n                    <p><p>The cryptocurrency market recently experienced events that were previously expected to present a severe negative price impact, and yet, Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC)</a> trades near $37,000 on Nov. 22, which is essentially flat from three days prior. </p><p>Such performance was utterly unexpected given the relevance of <a href=\"https://cointelegraph.com/news/binance-richard-teng-ceo-amid-changpeng-zhao-s-forced-departure\">Binance’s plea deal on Nov. 21</a> with the United States Authorities for violating laws involving money laundering and terror financing.</p><h2>Bearish news has had limited impact on Bitcoin price</h2><p>One might argue that entities have been manipulating Bitcoin’s price to avoid contagion, possibly involving the issuing of unbacked stablecoins–especially those with direct ties to the exchanges suffering from the regulatory pressure. Thus, to identify whether investors became highly risk-averse one should analyze Bitcoin derivatives instead of focusing solely on the current price levels.</p><p>The U.S. government filed indictments against Binance and Changpeng \"CZ\" Zhao in Washington state on Nov. 14, but the documents were unsealed on Nov. 21. After admitting the offenses, CZ stepped away from Binance management as part of the deal. Penalties totaled over $4 billion, including fines imposed on CZ personally. The news triggered a mere $50 million in BTC leverage long futures contracts after Bitcoin’s price momentarily traded down to $35,600.</p><p>It is worth noting that on Nov. 20 the United States Securities and Exchange Commission <a href=\"https://cointelegraph.com/news/sec-sues-kraken-for-securities-laws-violations\">(SEC) sued Kraken exchange</a>, alleging it commingled customer funds and failed to register with the regulator as a securities broker, dealer and clearing agency. Additionally, the complaint claimed Kraken paid for operational expenses directly from accounts containing customer assets. However, Kraken said the SEC’s commingling accusations were previously earned fees, so essentially their proprietary assets.</p><p>Another potentially disastrous tidbit of news came from Mt. Gox, a now-defunct Bitcoin exchange that lost 850,000 BTC to a hack in 2014. Nobuaki Kobayashi, the Mt. Gox trustee announced on Nov. 21 the redemption of $47 million in trust assets and reportedly planned to start the first <a href=\"https://cointelegraph.com/news/mt-gox-commencement-of-repayment-email\">cash repayments to creditors</a> in 2023. Even though there was no information regarding the sale of Bitcoin assets, investors speculated that this final milestone is closer than ever.</p><p>One will find posts on social networks from experienced traders and analysts that anticipated a crypto market crash in case Binance were to be indicted by the DoJ. Some examples are listed below, and it is safe to say such a theory was almost a consensus among investors.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">ETF denied, slow bleed is most likely, with a switch to hard crash if DOJ charges are unsealed soon against Binance.</p>&mdash; Parrot Capital  (@ParrotCapital) <a href=\"https://twitter.com/ParrotCapital/status/1695537476205728190?ref_src=twsrc%5Etfw\">August 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I do not believe in coincidences. The Universe is rarely so lazy.<br><br>Expecting ETFs to be rejected and DoJ to drop the hammer on Binance crushing bulls dreams for 2023.</p>&mdash; McKenna (@Crypto_McKenna) <a href=\"https://twitter.com/Crypto_McKenna/status/1686149927682916352?ref_src=twsrc%5Etfw\">July 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Notice how McKeena predicted that Binance would be indicted by the DoJ and further added that the ongoing Bitcoin spot exchange-traded (ETF) fund applications will be denied by the SEC. But, as counterintuitive as it might sound, Binance going fully compliant increases the odds of the spot ETF approval. This is because it greatly weakens the SEC’s main argument for previous denials, namely the excessive volume market share on unregulated exchanges.</p><p>Nothing concrete came out from the spot Bitcoin ETF in regards to recent regulatory actions, but the amends to multiple proposals is a hint of a healthy discussion with the SEC.</p><h2>Bitcoin derivatives display resilience</h2><p>To confirm if the Bitcoin price resilience aligns with professional investors' risk assessment, one should analyze BTC futures and options metrics. For instance, traders could have rushed to hedge their positions, which doesn't pressure the spot markets, but vastly impacts BTC futures premium and options pricing.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/e50f226c-0b96-429f-ab9e-169a813dc193.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin 3-month futures premium. Source: Laevitas.ch</em></figcaption></figure><p>The price of Bitcoin monthly futures contracts tend to differ from regular spot exchanges since participants demand more money to delay the settlement. That’s not exclusive to cryptocurrencies, and in a neutral market it should stand near an annualized 5% rate.</p><p>Notice how Bitcoin futures currently holds an 8% premium, which is an indication of excessive demand for leverage longs, but far from excessive. This level is lower than the 11.5% seen in mid November, but is quite positive given the recent regulatory newsflow.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blackrock-sec-spot-bitcoin-etf-discussion\"><strong><em>BlackRock met with SEC officials to discuss spot Bitcoin ETF</em></strong></a></p><p>To confirm if Bitcoin derivatives did not experience a huge inflow of hedge operations, one needs to analyze BTC option markets as well. The 25% delta skew is a telling sign when arbitrage desks and market makers overcharge for upside or downside protection.</p><p>When traders anticipate a drop in Bitcoin’s price, the delta 25% skew tends to rise above 7%, while periods of excitement typically see it dip below negative 7%.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/b9f2c7bc-f214-4752-a401-83a1419acbc5.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin options 25% delta skew. Source: Laevitas.ch</em></figcaption></figure><p>As displayed above, the options 25% delta skew indicates optimism for the past 4 weeks as the put (sell) options have been trading at a discount when compared with similar call (buy) options. More importantly, the recent news flow did not change professional traders’ appetite for hedging strategies.</p><p>Overall, there's no doubt that the impact of regulatory actions and the potential sell pressure from Mt Gox caught the market in a great mood given the derivatives indicators. </p><p>Additionally, the liquidation of $70 million leverage BTC longs reduced the pressure from future negative price oscillations, meaning even if price revisits $35,000, there's no indication of excessive optimism.</p><p>Since the final round of ETF decisions is scheduled for January and February, there's little incentive for Bitcoin bears to pressure the market while negative news had zero impact. Ultimately, the path to $40,000 becomes more certain.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-11-22T19:43:25.000Z",
    "title": "Crypto analyst blasts Kraken lawsuit as SEC’s money grab, criticizes attacks on ADA",
    "url": "https://crypto.news/crypto-analyst-blasts-kraken-lawsuit-as-secs-money-grab-criticizes-attacks-on-ada/",
    "description": "In a rant-filled video, a crypto channel host slammed the merits of the SEC's lawsuit against Kraken exchange."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-22T20:00:44.000Z",
    "title": "Cardano Forecast: Crypto Analyst Identifies The Event That Could Send ADA Price To $11",
    "url": "https://www.newsbtc.com/analysis/ada/cardano-ada-price-to-11/",
    "description": "Dan Gambardello, the founder of Crypto Capital Venture, has provided some insights into the future trajectory of Cardano (ADA). Interestingly, he hints that the crypto token could reach unprecedented heights that will change the lives of Cardano holders.  When ADA Price Will Rise To $11 In a video shared on YouTube, Gambardello sounded bullish about the future of ADA as the crypto industry awaits the next bull run. According to him, this is when ADA will rise to as high as $11 at a market cap of $400 billion market cap then. He hinted that this bull run is likely to happen after the next Bitcoin Halving event. Related Reading: Ethereum Still Bullish: Richest ETH Wallets Go On Massive $124 Billion Buying Spree The crypto founder also noted how the decentralized finance (DeFi) landscape on the Cardano network has grown since the last bull run. As such, he expects that this “new ecosystem” powered by Shelley and innovations like the multi-asset ledger, positions the token for significant growth in the next bull run. Shelley is the Cardano era, which focused on making the network a decentralized economic system. Basically, Gambardello was alluding to the fact that Cardano has gotten better since the last bull run and now provides more utility to its users. To highlight ADA’s potential, he stated how the token rose from about $0.12 to $3 during the last bull run without having any of these “developmental milestones” in place. Therefore, a rise to $11 is feasible with the immense utility in place now.  The Cardano-Ethereum Comparison Gambardello drew a comparison between Cardano and Ethereum. He went as far as asserting that the former was more sound, secure, and decentralized. Despite his assertion, he recognizes the fact Cardano is like a cycle behind Ethereum. In line with this, he expects that Cardano’s success is going to be similar to the one Ethereum enjoyed when it first established its DeFi ecosystem. Related Reading: Fetch AI Breakout Confirmed: Analysts Reveal Bullish Targets For FET Price The crypto analyst also mentioned how undervalued Cardano is while making a comparison between it and Ethereum. In his opinion, Cardano has everything something like Ethereum has but better. He also believes that the innovations on the Cardano network are happening in a more secure and decentralized way compared to its counterparts. C While Gambardello seems to think that ADA will perform so well in the next bull run, another crypto analyst will beg to differ. This crypto analyst happens to be Lady of Crypto, who once outlined five reasons why she doesn’t believe ADA will perform well during that period. Interestingly, she stated that Cardano has a slow development pace, and that is one of the reasons it won’t thrive. ADA price stalls at $0.369 &#124; Source: ADAUSD on Tradingview.com Featured image from AMBCrypto, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-22T19:45:25.000Z",
    "title": "Crypto Exchange Bittrex Global Announces Plans To Cease Operations and Wind Down Trading",
    "url": "https://dailyhodl.com/2023/11/22/crypto-exchange-bittrex-global-announces-plans-to-cease-operations-and-wind-down-trading/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/bittrex-global-cease.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/bittrex-global-cease.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/bittrex-global-cease.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/bittrex-global-cease.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/bittrex-global-cease.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/bittrex-global-cease.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/bittrex-global-cease.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Embattled crypto exchange Bittrex Global has decided to wind down operations after its US-based arm filed for bankruptcy amid a slew of regulatory challenges earlier this year. The foreign exchange will disable all trading activity on December 4th. No concrete withdrawal deadline has been established, but Bittrex Global recommends customers pull out their assets as [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/22/crypto-exchange-bittrex-global-announces-plans-to-cease-operations-and-wind-down-trading/\">Crypto Exchange Bittrex Global Announces Plans To Cease Operations and Wind Down Trading</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-22T19:41:56.000Z",
    "title": "Binance Experiences Withdrawals, but ‘No Mass Exodus’ of Funds Despite $4,000,000,000 Settlement: Nansen",
    "url": "https://dailyhodl.com/2023/11/22/binance-experiences-withdrawals-but-no-mass-exodus-of-funds-despite-4000000000-settlement-nansen/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/rallies-binance-coin-here.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/rallies-binance-coin-here.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/rallies-binance-coin-here.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/rallies-binance-coin-here.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/rallies-binance-coin-here.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/rallies-binance-coin-here.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/rallies-binance-coin-here.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>New data from market intelligence firm Nansen reveals that Binance is experiencing relatively minimal effects from being charged $4 billion in fines by US regulators. According to Nansen, the world’s largest crypto exchange saw an outflow of $17 million worth of Ethereum (ETH) in one hour and $956 million worth of Bitcoin (BTC) in one [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/22/binance-experiences-withdrawals-but-no-mass-exodus-of-funds-despite-4000000000-settlement-nansen/\">Binance Experiences Withdrawals, but ‘No Mass Exodus’ of Funds Despite $4,000,000,000 Settlement: Nansen</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]