[
  {
    "source": "CryptoGlobe",
    "date": "2023-09-16T08:32:37.000Z",
    "title": "Blockchain Expert Explains Why XRP “Has Much Bigger Expected Returns” Than Ripple Stock",
    "url": "https://www.cryptoglobe.com/latest/2023/09/blockchain-expert-explains-why-xrp-has-much-bigger-expected-returns-than-ripple-stock/",
    "description": "Panos Mekras, a well-known blockchain consultant and financial technology expert, recently engaged with his social media followers on X to discuss the following investment question: Should one invest in Ripple’s potential IPO or buy XRP tokens? Mekras is the Founder of DigitalGen Financial Services, Co-Founder of Anodos Finance, and the author of “Understanding the Crypto […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-16T08:18:41.000Z",
    "title": "Bollywood megastar Govinda under the EOW scanner for possible crypto fraud",
    "url": "https://www.cryptopolitan.com/bollywood-megastar-govinda-crypto-fraud/",
    "description": "In a recent twist to the tumultuous world of cryptocurrencies, Bollywood icon Govinda finds himself caught in a legal quagmire. The Economic Offences Wing (EOW) of the Odisha police is deep-diving into the actor&#8217;s potential ties with Solar Techno Alliance (STA-Token) &#8211; a front for a multi-level marketing operation that falsely projected itself as a ... <a title=\"Bollywood megastar Govinda under the EOW scanner for possible crypto fraud\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bollywood-megastar-govinda-crypto-fraud/\" aria-label=\"More on Bollywood megastar Govinda under the EOW scanner for possible crypto fraud\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-16T08:17:34.000Z",
    "title": "Toncoin Shows Resiliency With 20% Climb – Will TON Hit $3 This Weekend?",
    "url": "https://www.newsbtc.com/news/toncoin-shows-resiliency-with-21-climb/",
    "description": "Toncoin has seen a noteworthy 20% price increase over the past week, rising from $1.75 on September 9 to $1.95 on September 15, 2023. With a current market valuation of $6.72 billion, this rise has elevated the altcoin to the No. 22 position. Within the cryptocurrency arena, there&#8217;s an unmistakable buzz among market participants as they eagerly seek out the next standout digital asset. This quest is leading to a fascinating shift in the top 20 rankings, as a fresh wave of cryptocurrencies enters the fray. While established tokens appear to be caught in a somewhat static trading pattern, a select group of digital currencies is demonstrating remarkable resilience and assertiveness, positioning themselves as formidable contenders capable of potentially supplanting their more renowned counterparts. Related Reading: Cardano Analysis: How Much Energy Do ADA Bulls Have To Hit $0.3 Milestone? Notably, Toncoin (TON) has emerged as a front-runner in this battle for prominence, boasting a noteworthy surge of over 50% in value over the last 30 days. Increased Momentum For Toncoin  The significant price increase in such a short period of time implies increased momentum and interest in this coin. If Toncoin can sustain its steady ascent, it should be able to hit the vaunted $3 mark this weekend or in the coming days. Meanwhile, the current market sentiment is predominantly bearish, marked by a general consolidation within a constrained price range. Recent price declines have somewhat subdued earlier optimism. TON market cap currently at $7.1 billion on the weekly chart: TradingView.com However, Toncoin has managed to attract positive attention in the face of these conditions. It&#8217;s worth noting that there might be a short-lived negative correction anticipated after the coin breached the $2 mark. Related Reading: Dogecoin Key Challenge: Will The $0.06 Support Level Hold? At the time of writing, TON was trading at $2.14, up 12% in the last 24 hours and climbed by an impressive 20% in the last seven days, data from crypto market tracker Coingecko shows. A notable factor contributing to Toncoin&#8217;s price surge is its remarkable trading volume. In the last 24 hours alone, Toncoin recorded a trading volume of $27 million, surpassing its 20-day average volume of $19 million by a significant margin. TON price action in the last month. Source: Coingecko. TON Banks On Increased Trading Volume An increase in trade volume is indicative of growing interest in and use of a cryptocurrency. The increased number of TON buyers and sellers has led to better market transparency and more efficient price formation. Recent high trading volume has provided the necessary impetus to drive the token&#8217;s price higher. On September 14, the Toncoin Foundation and Telegram jointly announced the introduction of TON Space, a novel cryptocurrency wallet designed specifically for Telegram users. TON Space facilitates connectivity to The Open Network ecosystem, which is overseen by the native token of Toncoin. With this move, Telegram hopes to add more than 30% of its users by 2028. It&#8217;s interesting that around 700 million people use the leading messaging app for cryptocurrency fans every month. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from GetBlock.net"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-16T08:31:00.000Z",
    "title": "Altcoin Bull Market is Here, According To Renowned Analyst",
    "url": "https://coinedition.com/altcoin-bull-market-is-here-according-to-renowned-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/Altcoin-Bull-Market-is-Here-According-To-Renowned-Analyst.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Altcoin Bull Market is Here, According To Renowned Analyst\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/Altcoin-Bull-Market-is-Here-According-To-Renowned-Analyst.png 730w, https://coinedition.com/wp-content/uploads/2023/09/Altcoin-Bull-Market-is-Here-According-To-Renowned-Analyst-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/09/Altcoin-Bull-Market-is-Here-According-To-Renowned-Analyst-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/09/Altcoin-Bull-Market-is-Here-According-To-Renowned-Analyst-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/09/Altcoin-Bull-Market-is-Here-According-To-Renowned-Analyst-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/09/Altcoin-Bull-Market-is-Here-According-To-Renowned-Analyst-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/09/Altcoin-Bull-Market-is-Here-According-To-Renowned-Analyst-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/09/Altcoin-Bull-Market-is-Here-According-To-Renowned-Analyst-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/09/Altcoin-Bull-Market-is-Here-According-To-Renowned-Analyst-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/09/Altcoin-Bull-Market-is-Here-According-To-Renowned-Analyst-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/09/Altcoin-Bull-Market-is-Here-According-To-Renowned-Analyst-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/09/Altcoin-Bull-Market-is-Here-According-To-Renowned-Analyst-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/09/Altcoin-Bull-Market-is-Here-According-To-Renowned-Analyst-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/09/Altcoin-Bull-Market-is-Here-According-To-Renowned-Analyst-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/09/Altcoin-Bull-Market-is-Here-According-To-Renowned-Analyst-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/09/Altcoin-Bull-Market-is-Here-According-To-Renowned-Analyst-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Michael van de Poppe and Income Sharks believe now is the perfect time to start stocking up on altcoins. Altcoin prices are starting to surge as venture capitalists are actively promoting them to attract investment. Van de Poppe predicted that most altcoins will follow in LINK’s footsteps with an upward breakout after notable deviation below [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/altcoin-bull-market-is-here-according-to-renowned-analyst/\">Altcoin Bull Market is Here, According To Renowned Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]