[
  {
    "source": "CoinDesk",
    "date": "2023-07-12T13:00:00.000Z",
    "title": "Snoop Dogg and a16z Back Web3 Music Platform Sound’s $20M Funding Round",
    "url": "https://www.coindesk.com/web3/2023/07/12/snoop-dogg-and-a16z-back-web3-music-platform-sounds-20m-funding-round/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The company aims to help artists make a living for their music by minting their songs on-chain and selling them directly to fans."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-12T13:00:00.000Z",
    "title": "DeepBook Brings Centralized-Style Orders for Decentralized Finance on Sui Network ",
    "url": "https://www.coindesk.com/business/2023/07/12/deepbook-brings-centralized-style-orders-for-decentralized-finance-on-sui-network/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Layer-1 blockchain Sui announced the release of DeepBook, a decentralized central limit order book (CLOB) that will support all applications built on the network."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-12T13:00:00.000Z",
    "title": "Crypto Criminals Stealing Much Less Money in 2023: Chainalysis Report",
    "url": "https://www.coindesk.com/business/2023/07/12/crypto-criminals-stealing-much-less-money-in-2023-chainalysis-report/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto crimes are raking in far less revenue this year due to a dry-up among hacks and scams, according to Chainalysis."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-12T13:01:10.000Z",
    "title": "Sound Raises $20 Million, Opens Music NFT Platform to All Artists",
    "url": "https://decrypt.co/148246/sound-raises-20-million-opens-music-nft-platform-all-artists",
    "description": "Any artist can now drop on-chain music via Sound after it paid out $5.5 million over the past year—including to Snoop Dogg."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-12T13:01:02.000Z",
    "title": "Cool Cats Expands Gaming Push With Trio of Upcoming Titles",
    "url": "https://decrypt.co/148199/cool-cats-expands-gaming-push-with-trio-upcoming-titles",
    "description": "The Cool Cats NFT project's next games span action, puzzle, and endless runner experiences, and are all set to release within nine months."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-12T13:00:00.000Z",
    "title": "Regulatory Uncertainty Turns Off Temasek From Crypto Investments",
    "url": "https://cryptodaily.co.uk/2023/07/regulatory-uncertainty-turns-off-temasek-from-crypto-investments",
    "description": "<p>Singapore&rsquo;s leading investment conglomerate, Temasek, has reportedly called off its hunt for cryptocurrency-related investments for now.&nbsp;</p>\nTemasek Waiting For Comprehensive Regulatory Framework\n<p>Temasek CEO Rohit Sipahimalani has stated that the company is not interested in cryptocurrency investments due to the lack of regulatory clarity. This decision comes after the Singaporean state-owned conglomerate experienced a significant loss of $275 million in the aftermath of the FTX crisis.&nbsp;</p>\n<p>During a recent interview, Sipahimalani highlighted the \"regulatory uncertainty\" surrounding the cryptocurrency sector, making it challenging for Temasek to risk a second investment in this ecosystem. However, he mentioned that the company would reconsider its stance if regulators implemented a comprehensive regulatory framework:</p>\n<p>He noted,</p>\n\n<p>\"If you have the right regulatory framework, and we are comfortable with it, and you have the right investment opportunity, there&rsquo;s no reason for us not to look at it.\"</p>\n\nMAS Tightens Regulatory Noose\n<p>The Monetary Authority of Singapore is working toward establishing a framework of protection for local participants in the crypto industry. It is coming down hard on digital organizations by preventing their lending and staking services that are offered to retail investors. Additionally, the MAS is also leaning toward ruling that these firms should hold customers' assets in a designated trust by the end of 2023.</p>\n<p>Temasek is a leading investment giant in Singapore and holds around $500 billion of assets. The company had undertaken its first crypto venture by investing a sizeable $275 million with the FTX crypto exchange.&nbsp;</p>\nEarly Stage Investment In FTX\n<p>CEO Sipahimalani explained that the FTX investment was part of Temasek's strategy to explore new disruptive technologies,&nbsp;</p>\n\n<p>&ldquo;Firstly, you got to remember that the FTX investment was a part of our early-stage investment strategy, where we invest in new disruptive technologies to see what&rsquo;s around the corner, so that we can bring that to our portfolio companies and benefit within our ecosystem.&rdquo;</p>\n\n<p>The CEO also revealed that the company went ahead with the FTX investment as the exchange&nbsp;&ldquo;had good technology, was gaining market share, and showed a willingness to engage with regulators and be licensed.&rdquo;</p>\n<p>However, despite the investment giant&rsquo;s due diligence, its FTX bet did not work out. Temasek lost all of its invested $275 million and also took a hit to its reputation in the market. As a result, the team and senior managers responsible for approving the investment have taken full responsibility and faced reductions in their annual compensations.&nbsp;</p>\n<p>Sipahimalani claimed,&nbsp;</p>\n\n<p>&ldquo;When we do early stage investing, there will be some losses, some write-offs, but, importantly for us, the whole portfolio of early stage investments should do well.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T13:00:47.000Z",
    "title": "Portals Launches Milky Way: The Ultimate Gasless Gateway to DeFi",
    "url": "https://www.cryptopolitan.com/portals-launches-milky-way-the-ultimate-gasless-gateway-to-defi/",
    "description": "Calgary, Canada, July 12th, 2023, Chainwire Portals, the leading yield and protocol aggregator for DeFi, is proud to announce the launch of Milky Way, a major architecture upgrade that enables one-click gasless access to any-to-any swaps across a wide range of ERC20 tokens. With Milky Way, users and developers can enjoy a seamless, cost-effective, and ... <a title=\"Portals Launches Milky Way: The Ultimate Gasless Gateway to DeFi\" class=\"read-more\" href=\"https://www.cryptopolitan.com/portals-launches-milky-way-the-ultimate-gasless-gateway-to-defi/\" aria-label=\"More on Portals Launches Milky Way: The Ultimate Gasless Gateway to DeFi\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T12:53:57.000Z",
    "title": "South Korea implements new accounting rules for cryptocurrency sector",
    "url": "https://www.cryptopolitan.com/south-korea-implements-new-accounting-rules-for-cryptocurrency-sector/",
    "description": "South Korea&#8217;s Financial Services Commission (FSC) has unveiled new regulations to increase transparency and bolster investor confidence in the cryptocurrency market. Starting in January 2024, corporations that issue or hold cryptocurrencies must disclose comprehensive information in their financial statements. Under the new rules, cryptocurrency issuers must publicly disclose details regarding the quantity and characteristics of ... <a title=\"South Korea implements new accounting rules for cryptocurrency sector\" class=\"read-more\" href=\"https://www.cryptopolitan.com/south-korea-implements-new-accounting-rules-for-cryptocurrency-sector/\" aria-label=\"More on South Korea implements new accounting rules for cryptocurrency sector\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T12:48:15.000Z",
    "title": "7-Eleven launches free Slurpee NFTs for 96th anniversary",
    "url": "https://www.cryptopolitan.com/7-eleven-launches-free-slurpee-nfts/",
    "description": "7-Eleven, a global convenience store franchise, announced that it was launching free Slurpee NFTs on Polygon Network as part of its celebration as it turns 96. The sugary collectible game, available on mobile devices, features a virtual 7-Eleven Slurpee cup with four flavors: Pina Colada, Blue Raspberry, Cherry, and Summertime Citrus. In its press release, ... <a title=\"7-Eleven launches free Slurpee NFTs for 96th anniversary\" class=\"read-more\" href=\"https://www.cryptopolitan.com/7-eleven-launches-free-slurpee-nfts/\" aria-label=\"More on 7-Eleven launches free Slurpee NFTs for 96th anniversary\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T12:43:14.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s Solana price is $22.13 with a 24-hour trading volume of $618,897,839. Solana is up 0.52% in the last 24 hours. The current CoinMarketCap ranking is #9, with a live market cap of $7,273,881,101. It has a circulating supply of 394,890,490 SOL coins and the max. supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T12:42:14.000Z",
    "title": "CBDC work engages 93% of global central banks",
    "url": "https://www.cryptopolitan.com/cbdc-work-engages-93-of-global-central-banks/",
    "description": "As the digital revolution in global financial systems continues to gain traction, the development and exploration of Central Bank Digital Currencies (CBDCs) is becoming an increasingly pivotal topic. A staggering 93% of the world&#8217;s central banks are engaged in various forms of CBDC-related work, signifying a significant paradigm shift in global monetary policy. The Evolution ... <a title=\"CBDC work engages 93% of global central banks\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cbdc-work-engages-93-of-global-central-banks/\" aria-label=\"More on CBDC work engages 93% of global central banks\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-12T13:00:00.000Z",
    "title": "United Nations aims to standardize blockchain ",
    "url": "https://crypto.news/united-nations-aims-to-standardize-blockchain/",
    "description": "The United Nations Internet Governance Forum (IGF) and the Government Blockchain Association (GBA) have announced a new partnership to standardize blockchain and cryptocurrency.&#160; The partnership will introduce the Dynamic coalition on blockchain assurance and standardization. It will use the GBA’s&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-12T13:02:58.000Z",
    "title": "CPI Data For June Is A Bullish Surprise For Bitcoin And Crypto",
    "url": "https://www.newsbtc.com/news/cpi-data-june-bullish-surprise-for-bitcoin-crypto/",
    "description": "The Consumer Price Index (CPI) data for June, released by the Bureau of Labor Statistics today, has sent ripples of optimism throughout the Bitcoin and crypto market. The latest figures reveal a surprising cooling in inflation, which has ignited hopes of a positive outlook. According to the data, the headline CPI year-over-year (YoY) inflation fell to 3.0%, coming in below expectations of 3.1%. This represents a noteworthy decline from the previous month&#8217;s 4.0% figure. Even more encouraging is the fact that core CPI YoY inflation dropped to 4.8%, surpassing market expectations of 5.0%. Notably, this is the first time the core CPI has fallen below 5.0% since December 2021, leading analysts at The Kobeissi Letter to remark, &#8220;The 26-month battle against inflation may finally be nearing its end.&#8221; On a month-on-month (m/m) basis, headline CPI came in at 0.3%, picking up slightly compared to May (+0.1%). Meanwhile, core CPI m/m came in lower than expected, landing at 0.3% instead of 0.4%. BREAKING: US inflation below expectations #Bitcoin Headline CPI YoY 3.0% (forecast 3.1%, last 4.0%) Headline CPI MoM 0.2% (forecast 0.3%, last 0.1%) Core CPI YoY 4.8% (forecast 5.0%, last 5.3%) Core CPI MoM 0.2% (forecast 0.3%, last 0.4%) — Jake Simmons (@realJakeSimmons) July 12, 2023 Why The CPI Data Is Crucial For Bitcoin And Crypto The Fed has raised interest rates by 5.0 basis points since March 2022 to bring down the highest inflation in the US in four decades. During the June meeting, the Federal Open Market Committee (FOMC) announced a pause for the first time in this cycle to give itself time to assess the still-evolving impact of the previous hikes. Fed Chair Jerome Powell, as always, stressed data dependency. Related Reading: Bitcoin Market Braces For CPI Figures: Will BTC Rally Or Retreat Today? Prior to the release of the CPI and core CPI, the market was expecting a 92% probability (according to the CME Fed Watch Tool) that Fed policymakers would decide in favor of a 0.25 basis points rate hike at their July 25-26 meeting, which would bring the policy rate into the 5.25% to 5.50% range. Today&#8217;s figures are likely to influence the decision by the Fed. However, San Francisco Fed President Mary Daly recently said at a Brookings Institution event that the Fed &#8220;may end up doing less because we have to do less; we may end up doing just that; we may end up doing more. The data will tell us.&#8221; Related Reading: Bitcoin And Crypto Investors Must Monitor The DXY: 6x Rally Ahead? Despite that, 20 minutes after the CPI release, the CME Fed Watch Tool still displayed a 89% of a 25 basis point hike at the end of July. Renowned journalist Walter Bloomberg, citing &#8220;The Economists,&#8221; stated that the surprisingly good CPI reading is unlikely to deter the Fed from raising interest rates by a quarter point later this month. But, he notes that this rate hike could potentially be the last one in the current cycle. In this regard, it&#8217;s important to note that he Fed’s inflation job is not done yet. Despite headline inflation trending lower and approaching the 2% target fast, sticky inflation is still at levels last seen in 1982, as the following chart shows. The sticky price consumer price index less food and energy is still highly elevated. Fed research published two days ago by economist Michael Kiley showed that core CPI data in &#8217;22 and early &#8217;23 were consistent with models showing greater persistence. &#8220;Updating forecasts from these models suggests core CPI inflation is likely to remain above 3.5% thru 2024,&#8221; writes Kiley. BTC Price Reacts Cautiously At press time, the Bitcoin price quickly jumped above $31,000 before retracing under $30,800. In the coming hours, the market&#8217;s true valuation of the data remains to be seen. As analyst Daan explained via Twitter, there is often an initial positive market reaction to positive CPI releases. This rally often lasts between 5 and 15 minutes, after which it begins to roll over. The price then tends to look for liquidity just below the &#8220;data release candle&#8221;. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-12T13:00:15.000Z",
    "title": "Kava Brushes Off Market Downtrend, Gains 11% On Weekly Chart",
    "url": "https://www.newsbtc.com/altcoin/kava-brushes-off-market-downtrend/",
    "description": "KAVA is one of the Layer-1 blockchains in the crypto industry with links to two top blockchains, Ethereum and Cosmos. The network combines the Cosmos blockchain, and the EVM technology boosting its speed, security, and maximum scalability. It also utilizes the developer support of the Ethereum network.  As such, Kava supports cross-chain interoperability, allowing users to transfer assets between Cosmos and Ethereum ecosystems. Kava&#8217;s native token, KAVA, which powers all the transactions on the blockchain, currently sits at the 62nd position on Coinmarketcap rankings.  Related Reading: Coinbase Stock Surges Nearly 10% Despite Cathie Wood’s Ark Invest $12 Million Sale At the time of writing today, July 12, KAVA’s market cap stands at $661,668,155, showing an increase of 5.95%. Also, the coin has recorded more gains in 7 days than other top coins like Bitcoin and Ethereum, showing losses in their weekly gains.  KAVA Posts Positive Price Moves Amid Plummeting Trading Volume KAVA&#8217;s price stands at $1.06, depicting a gain of 5.51% in 24 hours, while the weekly price shows an 11.31% increase. But KAVA&#8217;s trading volume currently stands at $59,625,037, a decline of 22.88%. This is unexpected, given the increasing price gains.  Looking at the declining volume, trading activities with KAVA show low participation. Also, the global market Fear &#38; Greed Index is currently at 57, depicting Neutral. As such, the current gains on KAVA may not be sustainable.   Also, KAVA’s daily chart on TradingView, shows that the RSI is at 62 moving towards the overbought region of 70. Such a movement suggests a trend reversal to the downside once the asset reaches the overbought region.  So while traders might be encouraged by the greenish moves today, represented by KAVA’s trend above the 50-day moving average, they should be careful, given the possibility of a downtrend soon.  Network Upgrade And USDT Launch Might Be Pushing KAVA Many factors affect the prices of crypto assets. Some of these factors include market-wide sentiment, network developments, news, regulations, etc. Regarding KAVA&#8217;s price gains today, network developments and events are seemingly responsible for it.  The much anticipated Kava 14 blockchain upgrade is slated for today, July 12, at the block height of 5,597,000 at 3:00 p.m. UTC. GitHub reveals that the release will facilitate the seamless unlocking of Cosmos native assets on Kava EVM. Not only that, it will support the conversion of assets between Ethereum and Cosmos through a safer new internal bridge feature. Six days ago, USDT launched on Cosmos through Kava. Even though the launch expanded the Cosmos DeFi Ecosystem, it also brought Kava to the limelight. Related Reading: Bitcoin Market Braces For CPI Figures: Will BTC Rally Or Retreat Today? Kava Co-founder Paolo Ardoino, talking about the integration, said, “Our support for Tether’s USDt integration unlocks much-needed stablecoin liquidity across the Cosmos and EVM ecosystems. Tether’s choice makes Kava a key support and a strong ally for Cosmos ecosystem projects building out the Internet of Blockchains.” Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-12T13:01:16.000Z",
    "title": "Portals Launches Milky Way: The Ultimate Gasless Gateway to DeFi",
    "url": "https://www.crypto-news-flash.com/portals-launches-milky-way-the-ultimate-gasless-gateway-to-defi/?utm_source=rss&utm_medium=rss&utm_campaign=portals-launches-milky-way-the-ultimate-gasless-gateway-to-defi",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/PortalsV2_Cover_v1_1689083842OBSAWOjPwO.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/PortalsV2_Cover_v1_1689083842OBSAWOjPwO.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/PortalsV2_Cover_v1_1689083842OBSAWOjPwO-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/PortalsV2_Cover_v1_1689083842OBSAWOjPwO-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/PortalsV2_Cover_v1_1689083842OBSAWOjPwO-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Calgary, Canada, July 12th, 2023, Chainwire Portals, the leading yield and protocol aggregator for DeFi, is proud to announce the launch of Milky Way, a major architecture upgrade that enables one-click gasless access to any-to-any swaps across a wide range of ERC20 tokens. With Milky Way, users and developers can enjoy a seamless, cost-effective, and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-12T13:00:08.000Z",
    "title": "Crypto Friendly UAE sees a boost in Bitcoin and DigiToads Investors",
    "url": "https://www.crypto-news-flash.com/crypto-friendly-uae-sees-a-boost-in-bitcoin-and-digitoads-investors/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-friendly-uae-sees-a-boost-in-bitcoin-and-digitoads-investors",
    "description": "<img width=\"512\" height=\"269\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-12T101444.077-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-12T101444.077-1.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-12T101444.077-1-300x158.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-12T101444.077-1-351x185.png 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Western regulators, especially in the United States, have made life incredibly difficult for crypto enterprises. This has created an opportunity. The UAE, alongside a handful of emerging economies, have begun introducing more crypto-friendly regulation. This light-touch innovation-friendly approach has attracted capital and talent. The UAE, especially, has led this race and laid the foundation to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-12T13:00:08.000Z",
    "title": "Tron’s GreatVoyage-v4.7.2 Update Brings Optimizations and Lower Smart Contract Costs",
    "url": "https://www.crypto-news-flash.com/trons-greatvoyage-v4-7-2-update-brings-optimizations-and-lower-smart-contract-costs/?utm_source=rss&utm_medium=rss&utm_campaign=trons-greatvoyage-v4-7-2-update-brings-optimizations-and-lower-smart-contract-costs",
    "description": "<img width=\"1200\" height=\"675\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/06/tron_660_010518115805.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/06/tron_660_010518115805.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/tron_660_010518115805-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/tron_660_010518115805-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/tron_660_010518115805-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/tron_660_010518115805-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/tron_660_010518115805-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/tron_660_010518115805-48x27.jpg 48w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />TRON achieved a net negative production ratio of -10,860,726 tokens. Tron boasts a staking ratio of 41.6% and a staking market capitalization exceeding $2.9 billion at the time of writing. Tron [TRX] recently shared its weekly recap, focusing on the significant advancements within its ecosystem. The standout event was undoubtedly the launch of a substantial [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-12T12:50:50.000Z",
    "title": "5 Altcoins You Should be Looking at Now",
    "url": "https://www.altcoinbuzz.io/top-article/5-altcoins-you-should-be-looking-at-now/",
    "description": "<p>In the past month, cryptocurrencies have seen significant gains driven by growing institutional adoption and buoyant investor confidence, with Bitcoin spearheading the trend.  The next alt season is on its way and we&#8217;ll see altcoins hit new price ranges. Fortunately, some altcoins are trading far from their all-time highs and within an affordable range. So, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/top-article/5-altcoins-you-should-be-looking-at-now/\">5 Altcoins You Should be Looking at Now</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-12T13:04:31.000Z",
    "title": "HAQQ Becomes Istanbul Blockchain Week’s Title Sponsor Promoting Islamic Culture in Web3",
    "url": "https://coinedition.com/haqq-becomes-istanbul-blockchain-weeks-title-sponsor-promoting-islamic-culture-in-web3/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/PR2-55.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/PR2-55.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/PR2-55-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/PR2-55-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/PR2-55-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/PR2-55-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/PR2-55-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/PR2-55-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/PR2-55-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/PR2-55-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/PR2-55-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/PR2-55-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/PR2-55-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/PR2-55-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/PR2-55-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/PR2-55-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/PR2-55-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Istanbul Blockchain Week, the highly anticipated global event that attracts industry leaders, politicians, entrepreneurs, and developers, is excited to unveil its collaboration with HAQQ (Islamic Coin), dedicated to creating a fair and ethical decentralized financial system. HAQQ will serve as the title sponsor for this year&#8217;s event, reflecting IBW’s strong commitment to technological innovation and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/haqq-becomes-istanbul-blockchain-weeks-title-sponsor-promoting-islamic-culture-in-web3/\">HAQQ Becomes Istanbul Blockchain Week’s Title Sponsor Promoting Islamic Culture in Web3</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-12T12:53:00.000Z",
    "title": "Bitcoin Consolidates At $30,000 As Network Congestion Clears",
    "url": "https://coinedition.com/bitcoin-consolidates-at-30000-as-network-congestion-clears/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/There_are_now_one_million_addresses_holding_1_bitcoin_or_more.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/There_are_now_one_million_addresses_holding_1_bitcoin_or_more.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/There_are_now_one_million_addresses_holding_1_bitcoin_or_more-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/There_are_now_one_million_addresses_holding_1_bitcoin_or_more-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/There_are_now_one_million_addresses_holding_1_bitcoin_or_more-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/There_are_now_one_million_addresses_holding_1_bitcoin_or_more-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/There_are_now_one_million_addresses_holding_1_bitcoin_or_more-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A recent report by on-chain analytics firm Glassnode took a closer look at Bitcoin and the trends associated with the flagship cryptocurrency. The analysis found that BTC displayed a robust recovery since the beginning of 2023, and much of that can be attributed to the emergence of ordinals and inscriptions on Bitcoin. The report was [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-consolidates-at-30000-as-network-congestion-clears/\">Bitcoin Consolidates At $30,000 As Network Congestion Clears</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]