[
  {
    "source": "Decrypt",
    "date": "2024-01-09T23:29:53.000Z",
    "title": "Solana's SAMO Meme Coin Spikes 24% Amid Airdrop for Saga Phone Owners",
    "url": "https://decrypt.co/212210/solanas-samo-meme-coin-spikes-24-amid-airdrop-saga-phone-owners",
    "description": "Another day, another exclusive benefit for Solana Saga phone buyers. This time, it’s an airdrop of Samoyedcoin (SAMO)."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-09T23:19:33.000Z",
    "title": " Bitcoin ETF’s false start: Hack or fat-fingered SEC intern? ",
    "url": "https://cointelegraph.com/news/bitcoin-etf-approved-sec-twitter-hack-false-informa",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMzk3YTdkNjgtMzZmNC00MDQ2LTliY2ItMGNlZTg4ZjcxNTdlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The official Twitter account of the SEC posted that a spot Bitcoin ETF had been approved, only to claim that its account had been compromised moments later. </p>\n                    <p><p>The United States Securities and Exchange Commission has vehemently denied its staff had any involvement in posting the recent “unauthorized” tweet claiming spot Bitcoin ETFs had been approved, though some in the crypto community still think otherwise. </p><p>On Jan. 9, the official X account of the SEC tweeted that it had granted approvals for Bitcoin ETFs to be listed on all registered national securities exchanges. <a href=\"https://cointelegraph.com/news/sec-account-hacked-no-spot-bitcoin-etf-approval\">This turned out to be false</a>, according to statements from SEC chair Gary Gensler and the official SEC X account. </p><p>Despite this, some pundits on X still believe the post was constructed by the SEC — just accidentally sent out. Others say there are </p><p><a href=\"https://cointelegraph.com/news/bitcoin-etf-approved-sec-twitter-hack-false-informa\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2024-01-09T23:10:23.000Z",
    "title": "Bitcoin Success In El Salvador Inspires Other Nations To Embrace Cryptocurrency",
    "url": "https://nulltx.com/bitcoin-success-in-el-salvador-inspires-other-nations-to-embrace-cryptocurrency/",
    "description": "The remarkable success story of El Salvador embracing Bitcoin is resonating globally, inspiring other nations to consider adopting the leading cryptocurrency. President Nayib Bukele of El Salvador has accumulated 2,798 Bitcoins for his country, already generating a profit of $13 million. Notably, this financial gain has been achieved even before [&#8230;]"
  }
]