[
  {
    "source": "CoinDesk",
    "date": "2023-06-27T07:46:38.000Z",
    "title": "Zimbabwe's Gold-Backed Digital Token Won't Fix the Country's Currency Woes, Economists Say",
    "url": "https://www.coindesk.com/policy/2023/06/27/zimbabwes-gold-backed-digital-token-wont-fix-the-countrys-currency-woes-economists-say/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Sound macroeconomic policies like raising interest rates and bringing down the country's deficit could dampen Zimbabwe's currency instability, economists said."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-27T08:00:00.000Z",
    "title": "Binance Reverses Plans To Delist Specific Privacy Coins In Europe",
    "url": "https://cryptodaily.co.uk/2023/06/binance-reverses-plans-to-delist-specific-privacy-coins-in-europe",
    "description": "<p>Binance, the world&rsquo;s largest cryptocurrency exchange, has reversed its decision to delist certain privacy coins in Europe.&nbsp;</p>\n<p>After feedback from several projects and the community, Binance had earlier revised its operations to comply with EU regulations and delist several privacy coins.&nbsp;</p>\nBinance Goes Back On Initial Decision&nbsp;\n<p>The European Union&rsquo;s new Markets in Crypto Assets (MiCA) regulations triggered the move to delist privacy coins in the European markets. These new regulations called for increased transparency and information sharing when it came to cryptocurrency transfers and transactions. Binance stated in a press release issued on the 26th of June,&nbsp;</p>\n\n<p>&ldquo;After carefully considering feedback from our community and several projects, we have revised how we classify privacy coins on our platform to comply with EU-wide regulatory requirements.&rdquo;</p>\n\n<p>It also added that because Binance conducts operations as an exchange registered in several European Union jurisdictions, the exchange is obliged to follow local regulations. These require them to monitor transactions for the coins that are listed on the platform. The exchange had previously announced that it was shuttering trading services of 12 privacy-focused tokens. These included several well-known coins such as Dash, Monero, and Zcash, along with lesser-known ones such as SCRT and XVG.&nbsp;</p>\n<p>The move came in the face of growing regulatory pressure on the cryptocurrency ecosystem and would impact users based in France, Spain, Poland, and Italy. Delisting the tokens meant that users in these jurisdictions could not purchase these privacy tokens, dealing a significant blow to privacy coin enthusiasts. Binance had stated at the time,&nbsp;</p>\n\n<p>&ldquo;While we aim to support as many quality projects as possible, we are required to follow local laws and regulations regarding the trading of privacy coins to ensure we can continue to serve as many users as we can. &ldquo;As part of Binance&rsquo;s ongoing compliance processes, we have reached out to affected users to notify them that they will no longer be able to purchase or trade privacy tokens on our platform after the 26th of June.&rdquo;</p>\n\n<p>Binance is not the only exchange that has moved to delist privacy tokens. Several other prominent exchanges, such as Huobi, Kraken, and Bittrex, had already removed several popular privacy tokens, such as Dash and Monero, from their listings. Furthermore, several governments, such as those in Japan, South Korea, and Dubai, have taken a hawkish stance against privacy coins, with some even banning them outright.&nbsp;</p>\nProjects Rush To Reassure Users&nbsp;\n<p>According to email communications sent to users, several cryptocurrencies, such as XMR, MOB, BEAM, ZEN, and FIRO, are still subject to restrictions. However, with the ban retracted, several cryptocurrency projects took to Twitter to reassure their users that their projects would remain unaffected. Verge Currency had posted an update as early as the 22nd of June, stating,&nbsp;</p>\n\n<p>&ldquo;We are pleased to inform you that $XVG will remain unaffected by @binance&rsquo;s trading restrictions on #privacy coins in certain EU countries. Verge utilizes a public #blockchain with visible transactions, amounts, and wallet addresses.&rdquo;</p>\n\n<p>The Secret Network also posted an update for its users, stating that it is not included among the currencies Binance planned to delist.&nbsp;</p>\n\n<p>&ldquo;You spoke, and Binance listened! @binance will not be delisting $SCRT, along with six other privacy-focused cryptocurrencies, in European countries.&rdquo;</p>\n\nThe Current Regulatory Landscape&nbsp;\n<p>Binance&rsquo;s decision to reverse the delisting of privacy coins comes after receiving feedback from the crypto community and reviewing its operations to comply with regulatory requirements in the European Union. The initial move to delist the coins was the result of the European Union&rsquo;s Market in Crypto Assets (MiCA) regulation, which was signed into law on the 31st of May. The regulation also includes a &ldquo;travel rule&rdquo; for transactions, requiring more transparency and information sharing. This clashed with the very nature of privacy coins, leading to several concerns when it came to compliance.&nbsp;</p>\n<p>However, the cryptocurrency industry has been welcoming of the Markets in Crypto Assets regulations, stating that it provides regulatory clarity for digital assets. Crypto payments service provider Ripple is one company that has expressed considerable appreciation for the clarity ushered in by the MiCA regulations. Furthermore, the European Securities and Markets Authority is also planning a MiCA consultation process, set to begin in July.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T08:06:09.000Z",
    "title": "What’s next for Polygon and Tradecurve after 20% rise in a week ?",
    "url": "https://www.cryptopolitan.com/whats-next-for-polygon-and-tradecurve-after-20-rise-in-a-week/",
    "description": "The global adoption of cryptocurrencies has started, and a lot of countries and regions have begun supporting them and embracing the overall potential.&#160; This has led to a lot of cryptocurrencies increasing in value recently, where two have stood out the most with their performance, and these include Polygon and Tradecurve. Join us as we ... <a title=\"What&#8217;s next for Polygon and Tradecurve after 20% rise in a week ?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/whats-next-for-polygon-and-tradecurve-after-20-rise-in-a-week/\" aria-label=\"More on What&#8217;s next for Polygon and Tradecurve after 20% rise in a week ?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T08:01:03.000Z",
    "title": "Unveiling The Best Altcoin Investments – Ethereum, Toncoin & Caged Beasts",
    "url": "https://www.cryptopolitan.com/unveiling-the-best-altcoin-investments-ethereum-toncoin-caged-beasts/",
    "description": "The world of altcoins is where opportunities for financial growth and innovation abound. The Best Altcoin Investments offer unique features and high potential for substantial returns. Ethereum has established itself as a leading player in the world of decentralised applications, while Toncoin, boasts impressive transaction speeds and a unique structure for enhanced performance. Meanwhile, Caged ... <a title=\"Unveiling The Best Altcoin Investments &#8211; Ethereum, Toncoin &#38; Caged Beasts\" class=\"read-more\" href=\"https://www.cryptopolitan.com/unveiling-the-best-altcoin-investments-ethereum-toncoin-caged-beasts/\" aria-label=\"More on Unveiling The Best Altcoin Investments &#8211; Ethereum, Toncoin &#38; Caged Beasts\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T07:58:31.000Z",
    "title": "Golteum (GLTM) Propels Crypto Summer With Dazzling Presale As Bitcoin (BTC) Hits $30,000",
    "url": "https://www.cryptopolitan.com/golteum-gltm-propels-crypto-summer-with-dazzling-presale-as-bitcoin-btc-hits-30000/",
    "description": "The current sentiment of the cryptocurrency market is one of optimism and excitement. Several cryptos have risen beyond expectations after the long-lasting effects of the bear. Experts believe that the landscape is in the crypto summer season as the prices of several tokens make positive turns.  &#62;&#62;&#62; BUY GLTM TOKENS NOW&#60;&#60;&#60; Golteum (GLTM) has impressed ... <a title=\"Golteum (GLTM) Propels Crypto Summer With Dazzling Presale As Bitcoin (BTC) Hits $30,000\" class=\"read-more\" href=\"https://www.cryptopolitan.com/golteum-gltm-propels-crypto-summer-with-dazzling-presale-as-bitcoin-btc-hits-30000/\" aria-label=\"More on Golteum (GLTM) Propels Crypto Summer With Dazzling Presale As Bitcoin (BTC) Hits $30,000\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T07:53:00.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-27T08:07:50.000Z",
    "title": "Gemini enables crypto withdrawals for victims of Voyager’s bankruptcy ",
    "url": "https://crypto.news/gemini-enables-crypto-withdrawals-for-victims-of-voyagers-bankruptcy/",
    "description": "Crypto exchange Gemini has initiated crypto transfers for customers affected by Voyager&#8217;s bankruptcy, stating that they can transfer their crypto to Gemini and withdraw their funds. According to Gemini, affected Voyager customers can only transfer crypto supported by Gemini, stating&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-27T07:46:20.000Z",
    "title": "Hut 8 receives a $50m loan from Coinbase’s subsidiary",
    "url": "https://crypto.news/hut-8-receives-a-50m-loan-from-coinbases-subsidiary/",
    "description": "Major Canadian crypto miner Hut 8 Mining inked a $50 million credit facility agreement with Coinbase Credit, to provide the latter with robust financial flexibility, liquidity, and also fund its business operations. Hut 8, in a press release on June&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T08:07:25.000Z",
    "title": "Tron Reaches Major Milestone with 10.2 Million Transactions, but TRX Price Lags Behind",
    "url": "https://www.crypto-news-flash.com/tron-reaches-major-milestone-with-10-2-million-transactions-but-trx-price-lags-behind/?utm_source=rss&utm_medium=rss&utm_campaign=tron-reaches-major-milestone-with-10-2-million-transactions-but-trx-price-lags-behind",
    "description": "Tron&#8217;s network achieves a significant milestone with daily transactions consistently surpassing 10.2 million, indicating high network adoption and activity. Despite the milestone, the price of TRX cryptocurrency struggles to gain momentum, with low demand and limited price movements. Tron (TRX), a distributed software platform, has reached a significant milestone as its network maintains daily transactions [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T08:05:24.000Z",
    "title": "Bitcoin Aims for July Rally as Investors Anticipate Options Expiry and Historic Gains",
    "url": "https://www.crypto-news-flash.com/bitcoin-aims-for-july-rally-as-investors-anticipate-options-expiry-and-historic-gains/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-aims-for-july-rally-as-investors-anticipate-options-expiry-and-historic-gains",
    "description": "Analysts are expecting a strong price rally for Bitcoin in July, considering over 20% gains consecutively for the past three years in the same month. Bitcoin price could face strong turbulence considering the upcoming options expiry on Friday this week. The world&#8217;s largest cryptocurrency Bitcoin (BTC) has been holding above $30,000, however, it needs a [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T08:00:32.000Z",
    "title": "Will Tezos (XTZ) Hit $2 This Year? Experts recommend A Better Alternative For 50x profit.",
    "url": "https://www.crypto-news-flash.com/will-tezos-xtz-hit-2-this-year-experts-recommend-a-better-alternative-for-50x-profit-2/?utm_source=rss&utm_medium=rss&utm_campaign=will-tezos-xtz-hit-2-this-year-experts-recommend-a-better-alternative-for-50x-profit-2",
    "description": "It’s no secret that the crypto industry is rife with speculation and predictions. As a matter of fact, the price movements of certain coins are driven by this. This is why many crypto enthusiasts and investors pay close attention to expert analysis and predictions. Speaking of speculations, analysts and crypto experts have been following Tezos [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T07:43:24.000Z",
    "title": "SEC Bombshell: Solana, Polygon, Cardano Hit Hard as Regulatory Battle Rages On",
    "url": "https://www.crypto-news-flash.com/sec-bombshell-solana-polygon-cardano-hit-hard-as-regulatory-battle-rages-on/?utm_source=rss&utm_medium=rss&utm_campaign=sec-bombshell-solana-polygon-cardano-hit-hard-as-regulatory-battle-rages-on",
    "description": "Solana, Polygon, Cardano, and other tokens face a collective market capitalization loss of $5 billion as a result of SEC lawsuits against Binance and Coinbase. The SEC alleges that these tokens, including Solana (SOL), Cardano (ADA), and Polygon (MATIC), may be selling unregistered securities. In the midst of a regulatory battle, several prominent cryptocurrencies, including [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-27T07:48:13.000Z",
    "title": "The Metaverse Has Arrived on Bitcoin?",
    "url": "https://www.altcoinbuzz.io/metaverse/the-metaverse-has-arrived-on-bitcoin/",
    "description": "<p>In the crypto space today, many Metaverses are well in development. Usually, these projects are built on Layer 1 blockchains. But, Bitcoin has made great technological advances recently. Indeed, some builders in the space have gone as far as to say: &#8220;The Metaverse has arrived on Bitcoin.&#8221; But who are these builders? Why would they [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/metaverse/the-metaverse-has-arrived-on-bitcoin/\">The Metaverse Has Arrived on Bitcoin?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-27T08:06:51.000Z",
    "title": "SEC Filings Trigger Market Drawdown for Emerging Ecosystem Tokens",
    "url": "https://coinedition.com/sec-filings-trigger-market-drawdown-for-emerging-ecosystem-tokens/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/SEC-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SEC Filings Trigger Market Drawdown for Emerging Ecosystem Tokens\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/SEC-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/SEC-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/SEC-3-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/SEC-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/SEC-3-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/SEC-3-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/SEC-3-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/SEC-3-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/SEC-3-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/SEC-3-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/SEC-3-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/SEC-3-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/SEC-3-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/SEC-3-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/SEC-3-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/SEC-3-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Leading crypto market intelligence provider, Messari, highlights a significant drawdown in market capitalization for emerging ecosystem tokens following the U.S. Securities and Exchange Commission (SEC) filings against Binance and Coinbase. The market tracker cited the latest categorization of tokens like Solana’s SOL and Polygon’s MATIC as securities in the SEC. The tweet from Messari provided [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sec-filings-trigger-market-drawdown-for-emerging-ecosystem-tokens/\">SEC Filings Trigger Market Drawdown for Emerging Ecosystem Tokens</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]