[
  {
    "source": "CoinDesk",
    "date": "2023-07-31T15:45:21.000Z",
    "title": "Barbie's Margot Robbie Has a Take on Bitcoin, Says It's a Ken Thing",
    "url": "https://www.coindesk.com/business/2023/07/31/barbies-margot-robbie-has-a-take-on-bitcoin-says-its-a-ken-thing/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "MicroStrategy's Michael Saylor took the connection a bit further, tweeting that \"Bitcoin is Big Ken Energy.\""
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-31T16:00:44.000Z",
    "title": "Bitcoin balances on top exchanges: What history tells us about future bull runs",
    "url": "https://cryptoslate.com/insights/bitcoin-balances-in-top-exchanges-what-history-tells-us-about-future-bull-runs/",
    "description": "<p>Quick Take Of the three cryptocurrency exchanges holding the largest amounts of Bitcoin, Bitfinex has 320,000 BTC, Coinbase has 439,000 BTC, and Binance has 650,000 BTC. When considering the average withdrawal price across all exchanges, Bitfinex&#8217;s cost basis for BTC is way below the current market price at 10,000 USD and thus is often referred [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-balances-in-top-exchanges-what-history-tells-us-about-future-bull-runs/\">Bitcoin balances on top exchanges: What history tells us about future bull runs</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-31T15:45:31.000Z",
    "title": "TRON ecosystem grows amid increasing DeFi activity",
    "url": "https://cryptoslate.com/tron-ecosystem-grows-amid-increasing-defi-activity/",
    "description": "<p>The TRON (TRX) network exhibited considerable growth in Q2 in daily active accounts, new accounts, and transactions, as metrics increased by 14%, 13.4%, and 28.9%, respectively, according to a recent report by Messari. Tron Q2 Growth. This growth coincided with the launch of BitTorrent Bridge and Stake 2.0, among other developments, showing promising expansion of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/tron-ecosystem-grows-amid-increasing-defi-activity/\">TRON ecosystem grows amid increasing DeFi activity</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-31T15:40:23.000Z",
    "title": "SEC Continues its Fight, Accuses HEX Founder of $1B Unregistered Securities Violation",
    "url": "https://cryptobriefing.com/sec-bites-back-accuses-hex-unregistered-securities-violation/?utm_source=feed&utm_medium=rss",
    "description": "The United States Securities and Exchange Commission has lodged a complaint against Richard Schueler, a well-known figure in the crypto community, accusing him of raising more than $1 billion through..."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T15:56:55.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T15:50:17.000Z",
    "title": "Algorand Price Prediction 2023-2032: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices considering investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it brings. For ... <a title=\"Algorand Price Prediction 2023-2032: Resurgence possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Resurgence possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T15:48:10.000Z",
    "title": "Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Flow Coin Price Prediction 2023-2032 Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the ... <a title=\"Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flow-coin-price-prediction/\" aria-label=\"More on Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-31T16:00:12.000Z",
    "title": "US Presidential Candidate Defends Bitcoin, Calls Out Environmental Critics",
    "url": "https://www.newsbtc.com/bitcoin-news/us-presidential-candidate-defends-bitcoin/",
    "description": "For an industry that rarely gets mainstream political support, Bitcoin recently received a massive endorsement after Democratic Presidential candidate Robert F. Kennedy spoke out in support of the cryptocurrency. According to RFK, arguments against adopting Bitcoin due to perceived environmental impact are merely a cover to curtail financial freedom.  Responding to the tweet by Feldman, RFK stated that “&#8230; environmental arguments should be used as a smokescreen to curtail freedom to transact.” RFK, who is a holder of BTC, has previously disclosed his intention to return the USD to hard currency backed with assets such as BTC. Bitcoin And The Environment  One of the challenges of Bitcoin adoption is the perceived threat it poses to the environment. According to anti-crypto campaigners and politicians, bitcoin mining is harmful due to its high energy requirement.  Related Reading: Ahead Of The Pack: Binance Moves Forward With New License in Dubai This argument is a prominent position within the political and environmental protection ecosystem, so much so that campaigners like Greenpeace have accused BTC of destroying the planet. However, while Bitcoin mining is energy-intensive, it utilizes more renewable energy presently than ever before.  This position was further reiterated by Daniel Feldman, director of Sangha Systems. According to him, there exists a “symbiotic relationship” between Bitcoin and renewable energy.  Agreeing with the popular Democratic candidate, Feldman noted that bitcoin mining offers a solution to boost the electric grid and limit dependence on fossil fuels. He, however, noted that “most renewable energy sites are not profitable without government subsidies.”  BTC price maintains tight range at $29,450 &#124; Source: BTCUSD on Tradingview.com Subsidies in the form of tax credits generate market distortions and the flow of these credits is managed by banks who are often bailed out by governments during financial crises, the very banks that Bitcoin seeks to free people from. According to Feldman, renewable energy sites experience curtailment and congestion challenges due to the absence of global markets to sell to during demand troughs. BTC solves this challenge by providing a universal market for electricity that will boost investments in renewable energy projects. A Look Into BTC Energy Usage Renewable energy arguments are popular within the green energy industry as they continually seek the flexibility offered by crypto mining operations. However, they are still faced with serious opposition from the media and the political establishment, who believe BTC mining will boil the planet.  Related Reading: Here’s How Long The Majority Of New Ethereum Wallets Are Used Before They’re Dumped According to data obtained from Cambridge University, it is estimated that global BTC mining activities are currently pegged at 137 TW/h (terawatt hours) per year.  This figure surpasses the energy usage of countries such as Ukraine, which utilizes 134 TW/h. In contrast, the electricity distribution and transmission losses in the US are sufficient to power BTC 1.5 times with 206 TW/h per year. Featured image from Sky News, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-31T16:00:55.000Z",
    "title": "MakerDAO Leads The DeFi Charge with Sharp Gains, InQubeta Presale On Fire As Bulls Target 1000% gains",
    "url": "https://www.crypto-news-flash.com/makerdao-leads-the-defi-charge-with-sharp-gains-inqubeta-presale-on-fire-as-bulls-target-1000-gains/?utm_source=rss&utm_medium=rss&utm_campaign=makerdao-leads-the-defi-charge-with-sharp-gains-inqubeta-presale-on-fire-as-bulls-target-1000-gains",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T100824.720.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T100824.720.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T100824.720-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T100824.720-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T100824.720-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T100824.720-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In this article, we explore the recent surge in MakerDAO&#8217;s governance token MKR, which experienced a remarkable 28% price increase within a week, reaching near its one-year high. The surge was driven by the implementation of a token buyback program by the decentralized finance (DeFi) lending platform. Additionally, we delve into the transformative potential of [...]"
  }
]