[
  {
    "source": "Cryptopolitan",
    "date": "2023-12-02T11:11:00.000Z",
    "title": "AI Revolutionizes Pharmaceutical Research: Accelerating Drug Development",
    "url": "https://www.cryptopolitan.com/ai-revolutionizes-pharmaceutical-research/",
    "description": "In the fast-evolving landscape of generative artificial intelligence (AI), the pharmaceutical industry is experiencing groundbreaking advancements in the development of new drugs. Researchers at ETH Zurich have recently unveiled an AI model that can identify and create active pharmaceutical ingredients, a crucial step in drug development. This innovative AI model promises to streamline the drug ... <a title=\"AI Revolutionizes Pharmaceutical Research: Accelerating Drug Development\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-revolutionizes-pharmaceutical-research/\" aria-label=\"More on AI Revolutionizes Pharmaceutical Research: Accelerating Drug Development\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-02T11:30:19.000Z",
    "title": "Over 80% Of Bitcoin Holders Now In Profit – Report",
    "url": "https://www.newsbtc.com/news/bitcoin/over-80-of-bitcoin-holders-now-in-profit-report/",
    "description": "In the last week, Bitcoin has garnered much attention, gaining 2.58 % in seven days, according to data from CoinMarketCap. During this time, the premier cryptocurrency has moved from trading around  $37,800 to almost breaching the $39,000 price mark.  Following this positive price movement, Bitcoin has recorded some impressive metrics, which could bolster investors&#8217; interest in the coming weeks. Related Reading: Coinbase (COIN) Up By 250% – Here’s Why It’s Outperforming BTC And ETH Bitcoin Experiences Highest Profitability Level In Two Years Via a Friday post on X, blockchain analytics firm IntoTheBlock reported that 81.35% of all Bitcoin holders are currently in profit. This marks the highest profitability level experienced by BTC investors since December 2021, when the token was valued at over $50,000. Interestingly, Bitcoin’s profitability is likely to go higher, with several factors indicating the market leader may soon cross into the $40,000 price zone.  Firstly, there is currently a high level of optimism regarding the approval of a Bitcoin Spot exchange-traded fund (ETF) by the US Securities and Exchange Commission (SEC). On Friday, Bloomberg analyst James Seyffart injected much hype into the crypto community as he predicted that this potential approval order would come between January 8 &#8211; January 10, 2024. Therefore, in anticipation of the massive institutional demand a spot ETF could introduce to the BTC market, investors are likely to start increasing their Bitcoin holdings, which could result in a price boost in the following weeks.  Furthermore,  the US Federal Reserve Chairman Jerome Powell has made statements suggesting that there would likely be no more rate hikes in the coming months. This development, if true, paves the way for Bitcoin, alongside other digital assets, to experience more price gains as increases in fed rate hikes are known to discourage investments in high-risk assets such as cryptocurrencies.  However, despite these favorable indicators, it is worth stating that the crypto market remains subject to multiple forces, and all investors are advised to conduct proper research before engaging with the market. Related Reading: Mystery Bitcoin Whale Who Bought 10,000 BTC Has Been Exposed Bitcoin Network Fees Slashed By 50% In other positives for the BTC community, the Bitcoin network experienced a 50% decline in total fees in the last week. IntoTheBlock reports that this development was due to a drastic decline in ordinals-related transactions. The Ordinals protocol, launched in January 2023, allows the creation of non-fungible tokens (NFTs) known as BRC-20 tokens on the Bitcoin network. Similar to the Ethereum network with its native NFTs, a high level of interest in Ordinals results in high network fees and vice versa.  At the time of writing, Bitcoin trades at $38,758, with a 0.17% decline in the last hour. Meanwhile, the asset’s daily trading volume is up by 4.97% and is valued at $20.37 billion.  BTC trading at $38,810 on the daily chart &#124; Source: BTCUSD chart on Tradingview.com Featured image from iStock, chart from Tradingview"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-02T11:31:00.000Z",
    "title": "Analyst Expects Stacks (STX) To “Fly” If it Can Break $0.80",
    "url": "https://coinedition.com/analyst-expects-stacks-stx-to-fly-if-it-can-break-0-80/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Calling-the-bottom-here-on-STX.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"STX’s price\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Calling-the-bottom-here-on-STX.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Calling-the-bottom-here-on-STX-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Calling-the-bottom-here-on-STX-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Calling-the-bottom-here-on-STX-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Calling-the-bottom-here-on-STX-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Calling-the-bottom-here-on-STX-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>An analyst predicted today that the price of STX could “fly” if it can break past $0.80. STX was close to breaking above this level identified by the analyst at press time after its price rose 13+% in the past day. Technicals on STX’s chart suggested that the price of the token is likely to [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/analyst-expects-stacks-stx-to-fly-if-it-can-break-0-80/\">Analyst Expects Stacks (STX) To “Fly” If it Can Break $0.80</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]