[
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T10:49:11.000Z",
    "title": "HashKey to start Bitcoin and Ether retail trading in Hong Kong from Aug. 28  ",
    "url": "https://cointelegraph.com/news/bitcoin-ether-hashkey-start-bitcoin-and-ether-hong-kong-aug-28",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/0eea5a08-1c28-4d0c-a86a-56c62acee331.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>HashKey, along with OSL, received a major license upgrade on Aug.3 clearing their way to offer crypto trading services to retail customers. </p>\n                    <p><p>Asian cryptocurrency exchange HashKey is set to start offering Bitcoin and Ether crypto trading services to retail customers in Hong Kong starting on August 28, according to a local media <a href=\"https://cn.investing.com/analysis/article-200479915\" target=\"_blank\" rel=\"noopener nofollow\">report</a>. Investors will only be allowed to invest up to 30% of their net worth into cryptocurrencies when using the platform</p><p>HashKey became the first crypto exchange in Hong Kong to get regulatory clearance to offer crypto trading services to retail traders after upgrading two major licenses issued by the country’s Securities and Futures Commission (SFC). The first license known as Type 1, made way for HashKey to start a virtual asset trading platform under Hong Kong’s securities laws. The second license called Type 7, allows the crypto exchange to provide automated trading services to both institutional as well as retail users.</p><p>Apart from HashKey, another crypto platform called OSL also received a regulatory nod from the SFC to offer BTC and ETH retail trading services. The new license regime has made way for Hong Kong to establish itself as one of the few countries that allow crypto retail trading services under the pureview of law.</p><p>Hong Kong started the year 2023 with a focus on building a crypto friendly environment in the country. Hong Kong’s Financial Secretary Paul Chan noted at the start of the year that the local government and regulators are <a href=\"https://cointelegraph.com/news/hong-kong-wants-to-become-crypto-hub-despite-industry-crisis\">looking forward to building</a> a crypto and fintech ecosystem in 2023. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/tokens-hong-kong-and-saudi-arabia-collaborate-on-tokens-and-payments\"><strong><em>Hong Kong and Saudi Arabia collaborate on tokens and payments</em></strong></a></p><p>By March, more than <a href=\"https://cointelegraph.com/news/over-80-crypto-firms-eyeing-presence-in-hong-kong-financial-secretary\">80 crypto firms expressed interest</a> in opening their office in Hong Kong including several crypto heavy weights. In April, the Hong Kong Monetary Authority (HKMA) <a href=\"https://cointelegraph.com/news/hong-kong-regulator-requires-banks-to-open-accounts-for-crypto-firms\">called on banks to provide services</a> to cryptocurrency firms. By May of the same year, the HKMA announced a licensing regime for the crypto platforms with a deadline of June 1. By August a couple of crypto platforms have now been approved to offer crypto trading services to retail as well as institutional clients.</p><p>The role of the regulatory framework that helps to protect investors is quite evident in the case of Hong Kong where retail traders will have access to only BTC and ETH, which the exchange believes is enough for the retail traders' need.</p><p>HashKey didn’t respond to Cointelegraph’s request for comments at press time.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/wolf-of-all-streets-world-bitcoin-hits-1m-1-million-hall-of-flame/\"><strong><em>Hall of Flame: Wolf Of All Streets worries about a world where Bitcoin hits $1M</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-25T11:09:03.000Z",
    "title": "\n                        Top Game Dapp Iskra to Launch Clashmon During Base Mainnet Onchain Summer Roll Out\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/top-game-dapp-iskra-to-launch-clashmon-during-base-mainnet-onchain-summer-roll-out",
    "description": "\n                        <p class=\"s7\">Base opened&nbsp;mainnet for everyone on August 9&nbsp; with their on-chain Summer campaign, featuring over 50 leading brands to connect users with the best on-chain art, music, and games daily throughout August. Top-ranking game Dapp Iskra will be one of the gaming category&rsquo;s features, releasing its latest Free to Play game, ClashMon: Ignition.</p>\n<p class=\"s7\">The ClashMon Collectible Battle RPG offers its first minting opportunity on Base Mainnet during On-chain Summer prior to fully rolling the game out in September.&nbsp; Starting on August 27, the ClashMon Onchain Summer Event allows players to mint a Game NFT Mystery Box and reveal their own ClashMon Monster, ClashMon gear, and ClashMon Tokens. This first mint heralds the game&rsquo;s launch in September 2023, allowing players to get a head start on building their monster decks.&nbsp;</p>\n<p class=\"s7\">ClashMon is one of the many accessible on-chain games from the Iskra game platform that enhances enjoyable gameplay with the benefits of digital ownership through play, trading, collecting, crafting, and competition &nbsp;</p>\n<p class=\"s7\">Offering the ultimate competitive, winner-take-all experience, Clashmon is designed to be fun but competitive and easy to access through any web browser.&nbsp; Players are able to build and &lsquo;own&rsquo; their team of Clashmons for trading, collecting, and fishing (resource farming). Most importantly, the game design emphasizes the spirit of competition.&nbsp;</p>\n<p class=\"s7\">The Collectible Battle RPG comes alive with fast-paced RPG-style monster fights and high-stakes tournament rounds but balances out the pacing with a soothing fishing mode where players can gather resources for gear or pursue other enhancements. In addition, players can simply have fun with a much-loved Galactic Shot mini-game, best described as the penultimate &lsquo;game of chicken.&rsquo;&nbsp; Players need to &lsquo;escape&rsquo; or run from a launched Penguin before it self-destructs. The longer players can hold their nerve, the higher the reward - if they manage to survive before the explosion.&nbsp;&nbsp;&nbsp;</p>\n<p class=\"s7\">Will Chung, Team Lead for ClashMon, explains, </p>\n\n<p class=\"s7\">&ldquo;The team sought to design a game that will let users experience the thrill of winning and competition while incorporating the enjoyment of collecting, trading, and farming game assets. The more you play, the more you can gain and delight in new experiences and immerse yourself more deeply in the&nbsp;ClashMon world.&rdquo;&nbsp;&nbsp;</p>\n\n<p class=\"s7\">Iskra believes that onboarding the next generation of on-chain users will be driven by engaging games that demonstrate the actual value of digital ownership.&nbsp;</p>\n\n<p class=\"s7\">Jesse Pollak, Creator of Base and Head of Protocols at Coinbase, predicts that &ldquo;On-chain gaming will be one of the key verticals bringing the next billion users on-chain. We&rsquo;re super excited to work with global leaders like Iskra to deliver Base users a diverse, high-quality gaming experience.&rdquo;&nbsp;</p>\n\nAbout\n<p class=\"s7\">Iskra offers an all-in-one on-chain game platform that rewards players and developers through a unique community system. Services include on-chain games, wallet, DEX, marketplace, and launchpad. The project is backed by some of the biggest tech and video game companies in South Korea and consistently ranks in the top categories for gaming on Dapp Radar for unique active wallets and engagement.&nbsp;&nbsp;</p>\n<p class=\"s7\">&nbsp;</p>\n<p class=\"s11\">Contact</p>\n<p class=\"s7\">Name: TK Youn</p>\n<p class=\"s7\">Email: tkay.youn@iskra.world</p>\n<p class=\"s7\">Company: Iskra</p>\n<p class=\"s7\">Location: Seoul, Republic of Korea</p>\n<p>&nbsp;</p>\n<p class=\"s14\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n                    "
  },
  {
    "source": "BTCManager",
    "date": "2023-08-25T10:41:06.000Z",
    "title": "Magnet Finance rug pulls $6.4m on Base L2",
    "url": "https://crypto.news/magnet-finance-rug-pulls-6-4m-on-base-l2/",
    "description": "Coinbase&#8217;s Base L2 network faces a new setback as Magnate Finance orchestrates a $6.5 million exit scam using price oracle manipulation. On Aug. 25, ZachXBT, an on-chain analyst and crypto expert, sent out a community alert through X (previously known&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T11:00:54.000Z",
    "title": "THORChain and Toncoin Trending on the Charts, But  Buyers Are More Intrigued With Everlodge",
    "url": "https://www.crypto-news-flash.com/thorchain-and-toncoin-trending-on-the-charts-but-buyers-are-more-intrigued-with-everlodge/",
    "description": "<img width=\"512\" height=\"329\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-130.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-130.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-130-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the dynamic cryptocurrency sector, trends can emerge swiftly, capturing the imagination of investors and enthusiasts alike. This article takes a closer look at two tokens on the rise, THORChain (RUNE) and Toncoin (TON) while shedding light on why the spotlight is increasingly turning towards the Everlodge (ELDG) presale. Keep reading to find out what [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T10:41:25.000Z",
    "title": "Bitcoin Slips Below $26K as Market Awaits Powell’s Keynote at Jackson Hole — Is $20,000 or $30,000 Next?",
    "url": "https://www.crypto-news-flash.com/bitcoin-price-slips-below-26k-as-market-awaits-powells-keynote-at-jackson-hole-is-20000-or-30000-next/",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/bitcoin-g577320603_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/bitcoin-g577320603_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/bitcoin-g577320603_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/bitcoin-g577320603_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/bitcoin-g577320603_1920-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/bitcoin-g577320603_1920-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/bitcoin-g577320603_1920-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Bitcoin price is seeing a drag in price growth amid broader economic uncertainty. Fed Chair Jerome Powell&#8217;s speech may impact the stock market and the crypto ecosystem. Bitcoin (BTC), the leading cryptocurrency by market capitalization has seen a drastic drop in its price below $26,000. This means the digital asset has lost all of Wednesday&#8217;s [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-25T10:53:46.000Z",
    "title": "TOP US Crypto Exchange After Operation ChokePoint 2.0",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-us-crypto-exchange-after-operation-chokepoint-2-0/",
    "description": "<p>Americans! Canadians! Listen up! I know Operation ChokePoint is real and your options for on-ramps to crypto are becoming fewer and fewer. And today I have a solution for you. It’s an exchange and you can do almost everything you can do on big, global Binance. Yet, Americans and Canadians can use it. That’s a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-us-crypto-exchange-after-operation-chokepoint-2-0/\">TOP US Crypto Exchange After Operation ChokePoint 2.0</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-25T10:45:55.000Z",
    "title": "Bitcoin (BTC), Ethereum (ETH) Register Record Rise In Address Activity",
    "url": "https://coinedition.com/bitcoin-btc-ethereum-eth-register-record-rise-in-address-activity/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/BTC-and-ETH-6.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/BTC-and-ETH-6.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/BTC-and-ETH-6-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/BTC-and-ETH-6-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/BTC-and-ETH-6-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/BTC-and-ETH-6-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/BTC-and-ETH-6-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/BTC-and-ETH-6-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/BTC-and-ETH-6-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/BTC-and-ETH-6-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/BTC-and-ETH-6-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/BTC-and-ETH-6-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/BTC-and-ETH-6-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/BTC-and-ETH-6-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/BTC-and-ETH-6-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/BTC-and-ETH-6-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/BTC-and-ETH-6-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The blockchain intelligence firm Santiment revealed in a tweet this morning that Bitcoin (BTC), Ethereum (ETH), and Tether (USDT) recorded the highest level of address activity. This recent uptick in address activity could be an early indication of substantial price movements in the near future. The fact that the two market leaders experienced the highest [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-btc-ethereum-eth-register-record-rise-in-address-activity/\">Bitcoin (BTC), Ethereum (ETH) Register Record Rise In Address Activity</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]