[
  {
    "source": "Decrypt",
    "date": "2023-08-25T17:06:00.000Z",
    "title": "Biden's Crypto Tax Proposal Is Attempt to 'Kill' Adoption in US, Says Financial Services Chair",
    "url": "https://decrypt.co/153764/patrick-mchenry-biden-crypto-tax-proposal",
    "description": "The U.S. Department of the Treasury and the IRS are aiming to make digital-asset trades more transparent—but McHenry said the proposal lacks clarity."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T17:00:00.000Z",
    "title": "Donald Trump NFT prices spike following release of mugshot in Georgia criminal case",
    "url": "https://cointelegraph.com/news/donald-trump-nft-prices-spike-following-release-mugshot",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/cf8dc066-bcb0-49b2-ae85-71e742480b76.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The former U.S. President returned to X for the first time since January 2021 to post his mugshot, which has now been thoroughly manipulated for memes by many users. </p>\n                    <p><p>The price of nonfungible tokens (NFTs) featuring Donald Trump surged after news outlets released a photo of the former United States President as part of his criminal case in the state of Georgia for allegedly attempting to subvert the will of voters in the 2020 election.</p><p>According to data from NFT marketplace OpenSea, the floor price of Trump’s line of digital trading cards first released in December 2022 <a href=\"https://opensea.io/collection/trump-digital-trading-cards/analytics\" target=\"_blank\" rel=\"noopener nofollow\">increased</a> more than 62% from 0.138 to 0.224 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) on Aug. 24 shortly after the former president’s mugshot became public. The image, which shows Trump looking angrily at the camera amid his surrender at the Georgia Sheriff's Office in Fulton County, has gone viral as the first mugshot of a current or former U.S. President facing criminal cases.</p><p>Trump, who has largely restricted his social media activity to his own Truth Social platform since being banned from Twitter in January 2021 — and later reinstated by X CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/elon-musk-and-crypto-twitter\">Elon Musk</a> — posted to X for the first time in more than two years with the mugshot: </p><blockquote class=\"twitter-tweet\"><p lang=\"zxx\" dir=\"ltr\"><a href=\"https://t.co/MlIKklPSJT\">https://t.co/MlIKklPSJT</a> <a href=\"https://t.co/Mcbf2xozsY\">pic.twitter.com/Mcbf2xozsY</a></p>&mdash; Donald J. Trump (@realDonaldTrump) <a href=\"https://twitter.com/realDonaldTrump/status/1694886846050771321?ref_src=twsrc%5Etfw\">August 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The criminal case against Trump in the state of Georgia alleges the former president and 18 allies were part of a racketeering scheme aimed at subverting the will of voters in an attempt to ensure he was re-elected as U.S. President in 2020, despite having lost to Joe Biden. The indictment was made public on Aug. 14 and prosecutors ordered all involved parties to surrender to Georgia authorities before Aug. 25. </p><p>Trump appeared on Aug. 24 and was released on a $200,000 bond. However, he still faces federal charges in the District of Columbia for attempting to overturn the results of the 2020 Presidential Election by allegedly being part of a scheme involving fake electors. He has also been indicted in a classified documents case brought by the Justice Department and a New York criminal case for allegedly falsifying business records related to a hush money payment for porn star Stormy Daniels.</p><p>Crypto and blockchain have <a href=\"https://cointelegraph.com/news/biden-won-t-accept-debt-deal-protecting-crypto-traders-g7\">been on the lips</a> of many politicians in recent elections and while in office. Trump <a href=\"https://twitter.com/realDonaldTrump/status/1149472282584072192?lang=en\" target=\"_blank\" rel=\"noopener nofollow\">said</a> on Twitter in 2019 that he was “not a fan” of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and other cryptocurrencies, claiming they were “based on thin air”. However, the nonprofit organization Citizens for Responsibility and Ethics <a href=\"https://cointelegraph.com/news/new-disclosure-increases-holdings-donald-trump-eth-wallet\">revealed in August</a> that Trump held more than $2.8 million in an Ethereum wallet.</p><p>During his time in office, President Biden has signed an executive order aimed at establishing a regulatory framework for digital assets, but has also been <a href=\"https://cointelegraph.com/news/republican-candidate-end-president-biden-war-on-bitcoin-if-elected\">criticized by many</a> lawmakers and those in the space. With the Trump mugshot now public, many crypto users on X have wasted no time adding the laser eyes to his image or otherwise manipulating it for a variety of memes: </p><blockquote class=\"twitter-tweet\"><p lang=\"qme\" dir=\"ltr\"> <a href=\"https://t.co/jfiNgAX0iG\">pic.twitter.com/jfiNgAX0iG</a></p>&mdash; Blade McG IV (SCM) (@Blade___McG) <a href=\"https://twitter.com/Blade___McG/status/1694953374628921393?ref_src=twsrc%5Etfw\">August 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/joe-biden-bitcoin-coffee-mug-video\"><strong><em>‘Is this a Bitcoin ad?’ Joe Biden unknowingly touts BTC in coffee mug video</em></strong></a></p><p>Though Trump is currently the frontrunner for the Republican Party nomination for the 2024 Presidential Election by a wide margin, he did not <a href=\"https://cointelegraph.com/news/first-republican-presidential-debate-feature-pro-crypto-candidates\">appear alongside other candidates</a> in the first party debate on Aug. 23. Florida Gov. Ron DeSantis — who, according to many polls, is the leading Republican presidential candidate behind Trump — has <a href=\"https://cointelegraph.com/news/ron-desantis-vows-to-ban-cdbc-in-the-us\">promised to ban central bank digital currencies</a> if elected. Vivek Ramaswamy, who received a lot of online attention due to his debate performance, previously spoke at the Bitcoin 2023 conference in Miami and referred to the 2024 election as a “referendum on fiat currency.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/opinion-republican-crypto-maxis-democrat-anti-crypto-army-mchenry-warren/\"><strong><em>Opinion: GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-25T16:40:00.000Z",
    "title": "IRS releases draft of proposed reporting rules for digital asset brokers",
    "url": "https://cointelegraph.com/news/irs-releases-draft-proposed-reporting-rules-digital-asset-brokers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/c4fc4d48-bb18-4067-99c8-68173bc8d6cc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>House Financial Service Committee chair Patrick McHenry said the rules are part of “the Biden Administration’s ongoing attack on the digital asset ecosystem.” </p>\n                    <p><p>The United States Internal Revenue Service (IRS), the agency responsible for tax collection, released proposed regulations on the sale and exchange of digital assets by brokers. Under the <a href=\"https://public-inspection.federalregister.gov/2023-17565.pdf\" target=\"_blank\" rel=\"noopener nofollow\">rules</a>, brokers would be required to use a new form to report to simplify tax filing and cut down on tax cheating.</p><p>The proposed Form 1099-DA would “help taxpayers determine if they owe taxes, and […] avoid having to make complicated calculations or pay digital asset tax preparation services in order to file their tax returns,” according to a Treasury Department statement. It <a href=\"https://home.treasury.gov/news/press-releases/jy1705\" target=\"_blank\" rel=\"noopener nofollow\">added</a>:</p><blockquote>“Under current law, taxpayers owe tax on gains and may be entitled to deduct losses on digital assets when sold, but for many taxpayers it is difficult and costly to calculate their gains.”</blockquote><p>The regulations bring digital asset reporting into line with reporting on other types of assets, the Treasury said. </p><p>The draft proposal, set to run in the Federal Register on Aug. 29, is 282 pages long. It is part of the Biden administration’s implementation of the bipartisan Infrastructure Investment and Jobs Act (IIJA), the Treasury said. IIJA provisions are expected to raise $28 billion in new tax revenue over ten years.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/elizabeth-warren-bernie-sanders-crypto-tax-loophole-closure\">Elizabeth Warren, Bernie Sanders urge closure of ‘$50 billion crypto tax gap’</a></em></strong></p><p>The proposed rules would go into effect in 2026 to reflect sales and exchanges carried out in 2025. Written comments on the proposal are being accepted through Oct. 30. At least one public hearing will be held after that date.</p><p>Judging from the initial reaction to the proposal, the IRS may have a lot of comments to field. Kristin Smith, CEO of the Blockchain Association, an industry advocacy group, released a statement that said: </p><blockquote>“It’s important to remember that the crypto ecosystem is very different from that of traditional assets, so the rules must be tailored accordingly and not capture ecosystem participants that don’t have a pathway to compliance.”</blockquote><p>Smith added that the group and its members were looking forward to providing comment.</p><p>Reuters <a href=\"https://www.reuters.com/markets/us/biden-administration-unveils-new-crypto-tax-reporting-rules-2023-08-25/\" target=\"_blank\" rel=\"noopener nofollow\">quoted</a> DeFi Education Fund CEO Miller Whitehouse-Levine as saying, “Today's proposal from the IRS is confusing, self-refuting, and misguided. It attempts to apply regulatory frameworks predicated on the existence of intermediaries where they don't exist.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Treasury &amp; IRS released proposed regulations on the sale and exchange of digital assets by brokers:<a href=\"https://t.co/u6TewiS7tV\">https://t.co/u6TewiS7tV</a></p>&mdash; DeFi Education Fund (@fund_defi) <a href=\"https://twitter.com/fund_defi/status/1695057569180426716?ref_src=twsrc%5Etfw\">August 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Patrick McHenry, chairman of the House of Representatives Financial Services Committee, <a href=\"https://financialservices.house.gov/news/documentsingle.aspx?DocumentID=408956#:~:text=Patrick%20McHenryChairman&amp;text=%E2%80%9CThe%20notice%20of%20proposed%20rulemaking,ecosystem%2C%E2%80%9D%20said%20Chairman%20McHenry.\" target=\"_blank\" rel=\"noopener nofollow\">called</a> the proposal “another front in the Biden Administration’s ongoing attack on the digital asset ecosystem.” </p><p>McHenry also called the proposed rules “misguided,” and said, “Following the passage of the Infrastructure Investment and Jobs Act, numerous lawmakers of both parties made clear that any proposed rule must be narrow, tailored, and clear.” </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/e14d9b46-5ab0-4b49-b443-a1b64a734ead.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Draft of IRS proposed digital asset broker reporting rules. Source: The Federal Register</em></figcaption></figure><p>McHenry added that he was glad that exemptions in the proposal reflected those in the Keep Innovation in America bill, which <a href=\"https://cointelegraph.com/news/us-lawmakers-planning-to-reintroduce-bill-aimed-at-fixing-crypto-reporting-requirements-report\">he co-wrote with Rep. Ritchie Torres</a>. McHenry said the bill is intended to “fix the poorly constructed digital asset reporting provisions” in the IIJA.</p><p>Advocacy group Coin Center <a href=\"https://cointelegraph.com/news/coin-center-responds-lawmakers-request-crypto-tax-guidance\">weighed in on digital asset taxation</a> a few days earlier in a letter to Sens. Ron Wyden and Mike Crapo. The letter contained suggestions very specifically tailored to digital assets and raised privacy concerns.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\">Best and worst countries for crypto taxes — plus crypto tax tips</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-25T17:00:01.000Z",
    "title": "Brian Armstrong to headline DeSci sessions at forthcoming Sora Summit",
    "url": "https://cryptoslate.com/brian-armstrong-to-headline-desci-sessions-at-forthcoming-sora-summit/",
    "description": "<p>Coinbase CEO Brian Armstrong will discuss Decentralized Science (DeSci) at the Sora Summit, a Web3 conference organized by Sora Ventures, slated for later this year. Armstrong, a prominent figure in the cryptocurrency industry, is actively promoting DeSci through his co-founded startup, ResearchHub. This platform enables researchers to openly share their work and earn cryptocurrency rewards [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/brian-armstrong-to-headline-desci-sessions-at-forthcoming-sora-summit/\">Brian Armstrong to headline DeSci sessions at forthcoming Sora Summit</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-25T16:56:12.000Z",
    "title": "Ethereum ETF Race: ARK Files for Futures ETF Along With 18 Others",
    "url": "https://cryptobriefing.com/ethereum-etf-race-ark-files-for-futures-etf-along-with-18-others/?utm_source=feed&utm_medium=rss",
    "description": "ARK Invest and 21Shares join 18 other contenders aiming to introduce an Ethereum Futures ETF to the market."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T17:08:24.000Z",
    "title": "China bolsters yuan defense with this new trick",
    "url": "https://www.cryptopolitan.com/china-bolsters-yuan-defense-with-new-trick/",
    "description": "In a shrewd maneuver that has taken global financial markets by surprise, China&#8217;s central bank has employed a clever strategy to bolster the yuan. With a slipping economy, depreciating currency, and mounting investor concerns, China&#8217;s leaders have been propelled into action, reinforcing the yuan against the juggernaut U.S. dollar. Shutting Down Southbound Purchases China&#8217;s central ... <a title=\"China bolsters yuan defense with this new trick\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-bolsters-yuan-defense-with-new-trick/\" aria-label=\"More on China bolsters yuan defense with this new trick\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T17:00:40.000Z",
    "title": "Tech titans scramble: EU digital rules prompt online overhauls",
    "url": "https://www.cryptopolitan.com/eu-digital-rules-prompt-online-overhauls/",
    "description": "The digital landscape is in the midst of a seismic shift. As the clock ticks down to the enforcement of the EU&#8217;s groundbreaking Digital Services Act (DSA), the world&#8217;s most formidable online powerhouses have been burning the midnight oil. The imminent EU regulations have spurred them into a frenzy of adjustments, throwing their earlier business ... <a title=\"Tech titans scramble: EU digital rules prompt online overhauls\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eu-digital-rules-prompt-online-overhauls/\" aria-label=\"More on Tech titans scramble: EU digital rules prompt online overhauls\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T16:57:23.000Z",
    "title": "Vauld crypto exchange gets court nod for board overhaul amid crisis",
    "url": "https://www.cryptopolitan.com/vauld-crypto-exchange-gets-court-nod-for-board-overhaul-amid-crisis/",
    "description": "Singapore-based crypto exchange Vauld has received court approval to overhaul its board of directors. The move is part of the company&#8217;s ongoing bankruptcy proceedings, which began in August 2022. Darshan Bathija, Vauld&#8217;s co-founder, announced the news on X, formerly known as Twitter, on August 24. The new board will consist of a fresh CEO, a ... <a title=\"Vauld crypto exchange gets court nod for board overhaul amid crisis\" class=\"read-more\" href=\"https://www.cryptopolitan.com/vauld-crypto-exchange-gets-court-nod-for-board-overhaul-amid-crisis/\" aria-label=\"More on Vauld crypto exchange gets court nod for board overhaul amid crisis\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T16:50:21.000Z",
    "title": "Trump finally surrenders: Details from Georgia authorities",
    "url": "https://www.cryptopolitan.com/trump-surrenders-details-georgia-authorities/",
    "description": "It was a scene that undoubtedly sent shockwaves throughout the political sphere: Donald Trump, once the highest office holder in the nation, walking into Fulton County jail in Atlanta. Facing a slew of 13 charges, Trump&#8217;s surrender is a testament to the persistent efforts of Georgia authorities to ensure accountability over allegations of meddling with ... <a title=\"Trump finally surrenders: Details from Georgia authorities\" class=\"read-more\" href=\"https://www.cryptopolitan.com/trump-surrenders-details-georgia-authorities/\" aria-label=\"More on Trump finally surrenders: Details from Georgia authorities\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-25T16:41:22.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-25T17:00:18.000Z",
    "title": "While Cardano Bounces Back, Borroe Stands Tall as AI Crypto Monarch",
    "url": "https://www.crypto-news-flash.com/while-cardano-bounces-back-borroe-stands-tall-as-ai-crypto-monarch/",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-135.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-135.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-135-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-135-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-135-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-135-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />A rising new DeFi project called Borroe Finance ($ROE) has emerged, capturing the attention of seasoned investors and newcomers amidst the recent surge in the crypto market. Borroe Finance ($ROE) is one of the top DeFi projects that promise to revolutionize the Web3 landscape with its unique blend of AI-powered innovation and cutting-edge blockchain technology. [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-25T17:00:00.000Z",
    "title": "Lawyer Questions SEC Readiness in Ripple Case, Says Trial May Never Happen",
    "url": "https://coinedition.com/lawyer-questions-sec-readiness-in-ripple-case-says-trial-may-never-happen/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Lawyer-Questions-SEC-Readiness-in-Ripple-Case-Says-Trial-May-Never-Happen.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Lawyer Questions SEC Readiness in Ripple Case, Says Trial May Never Happen\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Lawyer-Questions-SEC-Readiness-in-Ripple-Case-Says-Trial-May-Never-Happen.png 730w, https://coinedition.com/wp-content/uploads/2023/08/Lawyer-Questions-SEC-Readiness-in-Ripple-Case-Says-Trial-May-Never-Happen-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/08/Lawyer-Questions-SEC-Readiness-in-Ripple-Case-Says-Trial-May-Never-Happen-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/08/Lawyer-Questions-SEC-Readiness-in-Ripple-Case-Says-Trial-May-Never-Happen-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/08/Lawyer-Questions-SEC-Readiness-in-Ripple-Case-Says-Trial-May-Never-Happen-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/08/Lawyer-Questions-SEC-Readiness-in-Ripple-Case-Says-Trial-May-Never-Happen-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/08/Lawyer-Questions-SEC-Readiness-in-Ripple-Case-Says-Trial-May-Never-Happen-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/08/Lawyer-Questions-SEC-Readiness-in-Ripple-Case-Says-Trial-May-Never-Happen-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/08/Lawyer-Questions-SEC-Readiness-in-Ripple-Case-Says-Trial-May-Never-Happen-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/08/Lawyer-Questions-SEC-Readiness-in-Ripple-Case-Says-Trial-May-Never-Happen-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/08/Lawyer-Questions-SEC-Readiness-in-Ripple-Case-Says-Trial-May-Never-Happen-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/08/Lawyer-Questions-SEC-Readiness-in-Ripple-Case-Says-Trial-May-Never-Happen-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/08/Lawyer-Questions-SEC-Readiness-in-Ripple-Case-Says-Trial-May-Never-Happen-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/08/Lawyer-Questions-SEC-Readiness-in-Ripple-Case-Says-Trial-May-Never-Happen-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/08/Lawyer-Questions-SEC-Readiness-in-Ripple-Case-Says-Trial-May-Never-Happen-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/08/Lawyer-Questions-SEC-Readiness-in-Ripple-Case-Says-Trial-May-Never-Happen-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The XRP token is on a downward trend, trading at $0.5128 with a 2.42% drop. Rispoli argues that the SEC will need help proving recklessness in institutional sales. Rispoli believes that the SEC&#8217;s lawsuit is more of a tactic to pressure Ripple into a vulnerable settlement rather than a genuine legal concern. Fred Rispoli, a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/lawyer-questions-sec-readiness-in-ripple-case-says-trial-may-never-happen/\">Lawyer Questions SEC Readiness in Ripple Case, Says Trial May Never Happen</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-25T16:55:44.000Z",
    "title": "New Coinbase Layer-2 Project To Share Revenue With Its Development Partner in Pursuit of ‘Superchain Future’",
    "url": "https://dailyhodl.com/2023/08/25/new-coinbase-layer-2-project-to-share-revenue-with-its-development-partner-in-pursuit-of-superchain-future/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/coinbase-layer-project-share.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/coinbase-layer-project-share.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/coinbase-layer-project-share.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/coinbase-layer-project-share.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/coinbase-layer-project-share.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/coinbase-layer-project-share.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/coinbase-layer-project-share.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Coinbase&#8217;s new Ethereum (ETH) layer-2 scaling solution Base will share its revenue with its development partner, the Optimism (OP) Collective, in an effort to build what it calls the &#8220;Superchain future.&#8221; The Optimism Collective bills itself as &#8220;a band of companies, communities, and citizens working together to reward public goods and build a sustainable future [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/25/new-coinbase-layer-2-project-to-share-revenue-with-its-development-partner-in-pursuit-of-superchain-future/\">New Coinbase Layer-2 Project To Share Revenue With Its Development Partner in Pursuit of ‘Superchain Future’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]