[
  {
    "source": "Decrypt",
    "date": "2024-03-15T22:58:39.000Z",
    "title": "‘Parallel’ Creator Details ‘Colony’ AI Game on Solana, Pushing PRIME to All-Time High Price",
    "url": "https://decrypt.co/221992/parallel-creator-colony-ai-game-solana-prime-all-time-high-price",
    "description": "The makers of hot Ethereum NFT game Parallel are shifting to Solana for their next game, an AI-driven “survival sim” called Colony."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-15T22:53:17.000Z",
    "title": " Prosecutors want $11B judgment, 40-50 years in prison for Sam Bankman-Fried  ",
    "url": "https://cointelegraph.com/news/united-states-prosecutors-lewis-kaplan-ftx-sam-bankman-fried",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvOThiMTFiOWYtNGZhNi00NTgyLTk5OTctZTI0YTkyNjcxMjRhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Sam Bankman-Fried asked for a maximum sentence of six and a half years, but he could have gotten over 100 years.</p>\n                    <p><p>Prosecutors are asking for a sentence of 40-50 years for former CEO of bankrupt cryptocurrency exchange FTX and convicted fraudster Sam Bankman-Fried. He faces up to 110 years behind bars under the law.</p><p>The 116-page Government’s Sentencing Memorandum, submitted to Judge Lewis Kaplan on March 15, <a href=\"https://www.courtlistener.com/docket/66631291/410/united-states-v-bankman-fried/\" target=\"_blank\" rel=\"noopener nofollow\">recounts</a> Bankman-Fried’s activities in detail, focusing on five points: Bankman-Fried’s scheme to make illegal political contributions, his attempt to bribe Chinese government officials, his banking misconduct, his attempts to deflect blame and various obstructions of justice. </p><p>Bankman-Fried was not charged with illegal political contributions because the government of The Bahamas did not extradite him on that charge. Nor was he charged with bribing Chinese officials. The memorandum also stated:</p><p><a href=\"https://cointelegraph.com/news/united-states-prosecutors-lewis-kaplan-ftx-sam-bankman-fried\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-15T22:48:53.000Z",
    "title": " Neither Joe Biden nor Donald Trump are crypto champions ",
    "url": "https://cointelegraph.com/news/neither-joe-biden-nor-donald-trump-are-crypto-champions",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNTc5YmUzNjgtMzc5My00M2M0LTk3YzQtMjM4ODU1M2RiZWRjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>President Joe Biden hasn't taken a particularly friendly stance toward cryptocurrency. On the contrary, he's been a lot like his predecessor.</p>\n                    <p><p>The presidential campaign trail is heating up as November grows near and many people have become excited about Donald Trump’s comments praising cryptocurrency. But how does the former president compare to the current one? Former President Trump and President Biden are near opposites on many issues, but cryptocurrency may be an issue where they share common ground. </p><p>For his part, President Biden has made few fans among cryptocurrency users and companies. However, aside from an executive order calling for research on cryptocurrency and a tweet calling out unclear “tax loopholes that help wealthy crypto investors,” he’s personally said very little about the issue. Rather, the animosity has been spurred by Biden’s administration.</p><p>For example, in February 2023, headlines erupted with concerns that Operation Choke Point — an Obama administration initiative — had been revived by the Biden administration to lock cryptocurrency-related businesses and users out of the traditional financial system. As Nic Carter <a href=\"https://web.archive.org/web/20240216235956/https://www.piratewires.com/p/crypto-choke-point\" target=\"_blank\" rel=\"noopener nofollow\">documented</a> at the time, government officials were increasingly pressuring banks for any involvement with cryptocurrency.</p><p><a href=\"https://cointelegraph.com/news/neither-joe-biden-nor-donald-trump-are-crypto-champions\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-15T23:05:33.000Z",
    "title": "Minecraft Releases a New Update that Might Risk Losing Worlds ",
    "url": "https://www.cryptopolitan.com/minecraft-releases-update-risk-losing-worlds/",
    "description": "Discover essential tips on avoiding the Minecraft update issue on Windows 10 and 11 that risks world losses."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-15T23:00:25.000Z",
    "title": "Crypto Analyst Predicts Further Upside For Shiba Inu, Here’s The Target",
    "url": "https://www.newsbtc.com/shiba-inu/crypto-analyst-shiba-inu-target/",
    "description": "Shiba Inu is currently on a consolidation path after a strong upswing earlier in the month. Specifically, SHIB is currently down by 13% in the past seven days, although still up by 210% in a wider 30-day time frame. According to crypto analyst Javon Marks, Shiba Inu is on its way to another major breakout after the current consolidation. The analyst sees the meme coin surging to $0.000081, and then a further 90% increase to hit a new all-time high. Continued Uptrend For Shiba Inu Shiba Inu has seen massive gains recently, rallying 280% from $0.00001178 on the last day of February to $0.00004456 on March 5. This surge allowed the dog meme coin to outperform most cryptocurrencies amidst a wider bull market, taking a lot of traders by surprise. This price surge was accompanied by an increase in trading volume. Kaiko data reveals that Shiba Inu saw the largest volume among meme coins at $31 billion in just one week. Related Reading: Dogecoin Open Interest Maintains Record Highs, Is A Crash Coming? However, according to social media posts, analyst Javon Marks had predicted a surge as far back as October 2023, with a SHIB price target of $0.000081. In a recent update to his prediction, Javon noted that the price is set for even more growth, with the breakout target of $0.000081 still valid.  Since the attached and more original analysis, prices of $SHIB has shown MASSIVE STRENGTH, climbing approximately +531%, but these prices can be set for even more growth! With the breakout target still at $0.000081, prices of Shiba Inu could have another +147% move coming. A… https://t.co/ZjA5onlnBO pic.twitter.com/YuUllePvbl — JAVON⚡️MARKS (@JavonTM1) March 13, 2024 It&#8217;s interesting to note that SHIB has done approximately a 531% increase since Javon&#8217;s prediction in October. Furthermore, according to his analysis, a break and hold above $0.000081 could set the stage for another 90% upside to $0.0001553, a new all-time high for the meme coin. Current State Of Shiba Inu Shiba Inu has reversed since reaching $0.00004456 and has majorly traded between $0.0000365 and $0.0000295 in the past week. On-chain data points to a surge in trading volume during this time period. Particularly, IntoTheBlock&#8217;s large trader flow metric, which measures transactions greater than $100,000 has surged, reaching $578.11 million (17.62 trillion SHIB) on March 11th. The last 24 hours saw 9.94 trillion SHIB ($300.55 million) in large transactions.  Related Reading: Cardano Ready For Breakout As Network Adoption Hits Major Milestone While this surge in trading volume could mean an increased accumulation from large traders, it could also mean a selloff, as indicated by the recent drop in price. However, the crypto looks poised to resume price gains, and on-chain signals from ITB point to a bullish sentiment.  Lola, a SHIB enthusiast, listed on X, key factors that could contribute to the meme coin&#8217;s growth in the near future. These factors range from SHIB&#8217;s decentralization, global accessibility and adoption, its strong community, and an efficient deflationary burn mechanism. Notably, over 25.6 million SHIB tokens have been burnt in the past 24 hours. SHIB price retraces to $0.0000288 &#124; Source: SHIBUSDT on Tradingview.com Featured image from The Economic Times, chart from Tradingview.com"
  }
]