[
  {
    "source": "Cointelegraph",
    "date": "2024-02-08T10:05:28.000Z",
    "title": " BTC price nears $45K amid warning Bitcoin leveraged traders in control ",
    "url": "https://cointelegraph.com/news/btc-price-nears-45k-warning-bitcoin-leveraged-traders",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvOTI5ODQzMWMtZTA4Mi00NzkzLWJkM2YtNDcyMjYyMTU5MzFjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin sees a $1,300 daily candle, but a $1 billion surge in open interest sparks concern over BTC price strength at new levels.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) held around 3% higher on Feb. 8 as crypto markets teased some much-needed upside.</p><p>Data from <a href=\"https://subscription.cointelegraph.com/\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> showed BTC price action focusing on $44,700.</p><p>The largest cryptocurrency spiked to $44,766 on Bitstamp after the Feb. 7 daily close, marking its highest levels in nearly a month.</p><p><a href=\"https://cointelegraph.com/news/btc-price-nears-45k-warning-bitcoin-leveraged-traders\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-08T10:00:20.000Z",
    "title": " Hut 8 CEO steps down just weeks after short seller accusations ",
    "url": "https://cointelegraph.com/news/hut8-ceo-resign-pump-and-dump-short-seller-allegation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvOTFjNmUxZDAtOGNjYy00N2ZlLWE1MDUtYTNkZDdkYTE1YmY1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Asher Genoot, the newly-appointed Hut 8 CEO, said that he will focus on “creating lasting shareholder value.”</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) mining firm Hut 8 announced a leadership transition, replacing its CEO weeks after “pump-and-dump” allegations against the company were published by the controversial short-selling firm JCapital Research. </p><p>On Feb. 7, the Miami-based mining company <a href=\"https://hut8.com/2024/02/07/hut-8-announces-leadership-transition/\" target=\"_blank\" rel=\"noopener nofollow\">published</a> a press release saying that its former CEO Jaime Leverton will depart from his position. Asher Genoot, the president and a member of the company’s board of directors, will replace the now-former executive. </p><p>Bill Tai, Chairman of the Board of Hut 8, said in the announcement that Hut 8 is at a “pivotal inflection point” as they just completed the merger with U.S. Bitcoin Corp (USBTC). The executive added that Genoot will bring a “disciplined, proven approach” to unlock the potential of the merger. </p><p><a href=\"https://cointelegraph.com/news/hut8-ceo-resign-pump-and-dump-short-seller-allegation\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-08T09:48:39.000Z",
    "title": "Bitcoin’s recovery on track with previous market cycle trends",
    "url": "https://cryptoslate.com/insights/bitcoins-recovery-on-track-with-previous-market-cycle-trends/",
    "description": "<p>Quick Take An insightful analysis indicates that Bitcoin is adhering to its historical market trends. In November 2022, during the FTX collapse, Bitcoin plummeted to a low of roughly $15,500, while Bitcoin is now hovering above the $44,000 mark, representing an increase of over 160% from that cycle low. A revealing pattern emerges when compared [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoins-recovery-on-track-with-previous-market-cycle-trends/\">Bitcoin&#8217;s recovery on track with previous market cycle trends</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-08T10:00:00.000Z",
    "title": "3 Altcoins Flying Under The Radar Offering Strong Returns",
    "url": "https://www.cryptopolitan.com/3-altcoins-flying-under-the-radar-offering-strong-returns/",
    "description": "Finding fresh gems is the key to unlocking substantial returns as long as the cryptocurrency ecosystem remains active. Industry experts, after a thorough investigation, have selected NuggetRush (NUGX), Aptos (APT), and Liquity (LQTY) as three lesser-known but intriguing altcoins in 2024. These crypto projects are admired for their resilience, good investment returns, and impressive growth. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-08T09:57:39.000Z",
    "title": "TradeStation crypto ends US operations after SEC settlement",
    "url": "https://www.cryptopolitan.com/tradestation-crypto-ends-us-operations/",
    "description": "TradeStation Crypto, a prominent trading platform, has agreed to a settlement with the United States Securities and Exchange Commission (SEC) and a coalition of state regulators. The settlement, announced on February 6, comes after allegations that the company failed to register an interest-bearing crypto lending product. As part of the agreement, TradeStation Crypto will pay [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-08T09:52:48.000Z",
    "title": "AI at the Checkout: Transforming Supermarkets with Smart Technology",
    "url": "https://www.cryptopolitan.com/ai-at-the-checkout-transforming-supermarkets/",
    "description": "In the pursuit of reducing food waste and optimizing stock levels, supermarkets are increasingly turning to artificial intelligence (AI) technologies. These advanced systems are not only enhancing the decision-making process for fresh produce managers but are also introducing innovative methods to ensure food freshness, thereby potentially transforming the food retail sector. Revolutionizing fresh produce management [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-08T09:49:43.000Z",
    "title": "Crypto ransom attack payments soar to record $1 Billion in 2023, Chainalysis reports",
    "url": "https://www.cryptopolitan.com/crypto-ransom-attack-payments-soar-1-billion/",
    "description": "In a recent report by blockchain analytics firm Chainalysis on Wednesday, payments from crypto-related ransom attacks surged to $1 billion in 2023. This alarming figure nearly doubles the amount recorded in 2022, highlighting an escalating trend in the digital extortion landscape. The data points to a concerning rise in the frequency and sophistication of ransomware [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-08T10:08:13.000Z",
    "title": "Analyst Predicts Bitcoin Rally To $45,000 Before Pullback",
    "url": "https://www.newsbtc.com/news/bitcoin/analyst-predicts-bitcoin-rally-to-45000-before-pullback/",
    "description": "Bitcoin (BTC) has started riding the recent bull market wave and rising with fresh gains after weeks of sluggish momentum, with crypto analysts predicting more potential gains for the leading cryptocurrency asset in the coming days. Bitcoin To See A Correction After Surging To $45,000 A cryptocurrency expert from Cheeky Crypto has made a daring forecast for Bitcoin. The analyst revealed his recent projections during one of Cheeky Crypto&#8217;s latest episodes on YouTube. Related Reading: Bitcoin Price Targets $55,000 Following Bull Pennant Breakout His predictions came in light of the price of Bitcoin closing Wednesday on a positive note, leading the altcoin market as a whole with it. As the new trading day began, BTC&#8217;s price broke above the consolidation, signaling that bulls have returned to the fore. Cheeky Crypto analyst&#8217;s latest analysis delves into the present trading range for Bitcoin. In the analysis, the expert talked about a potential surge to the upside that will take BTC to $45,000.  He defined the current stage as a continuation pattern and forecasted that after the range is done, there will be an upward breakout. The analyst mentioned that volume profiles have been declining throughout the market&#8217;s range, which gave him the belief that the price will increase to $45,000. However, he believes a notable correction will occur after BTC reaches the aforementioned price level. Meanwhile, given the positioning on the Stochastic Relative Strength Index (RSI), he anticipates a further decline to $30,000. He underscored that there is resistance at the 50 Exponential Moving Average (EMA) and support at the 50 Simple Moving Average (SMA) for BTC&#8217;s present trading range. If the 50 EMA is breached, Bitcoin may test the 50 EMA once again, and the 200 EMA would provide extra support. Furthermore, the analyst looked at a series of indications throughout the hourly, daily, and weekly time periods. He noted key levels of support, resistance, and indicators to inspect for prospective market changes and momentum, like the RSI and the stochastic RSI. BTC&#8217;s Price Surges Above $44,000, Eyes $45,000 Amid the recent bullish rally encompassing the crypto market, Bitcoin&#8217;s price has risen over $44,000. This marks the first time this month that the crypto asset has reached this level, suggesting market recovery. The recent surge has sent quite a positive sentiment in the entire crypto space. It is believed that the rise might be due to the anticipation around the Ethereum Spot ETFs and BTC ETF options. Although, in comparison to last month, trend levels are still low, indicating that one should stay vigilant.  Related Reading: Bitcoin Nears $45,000 Level In Historic Price Surge Following Spot ETF Debut As of the time of writing, the price of Bitcoin has increased by over 4% in the past 24 hours, trading at $44,704. In addition, its market cap and trading volume have increased by over 4% and 47% in the past day. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-08T09:41:47.000Z",
    "title": "Earn $88K From Life changing A.I Crypto, Solana (SOL) loses support",
    "url": "https://www.crypto-news-flash.com/earn-88k-from-life-changing-a-i-crypto-solana-sol-loses-support/?utm_source=rss&utm_medium=rss&utm_campaign=earn-88k-from-life-changing-a-i-crypto-solana-sol-loses-support",
    "description": "<img width=\"1109\" height=\"622\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/photo_2024-02-08_12-37-39.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/photo_2024-02-08_12-37-39.jpg 1109w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/photo_2024-02-08_12-37-39-300x168.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/photo_2024-02-08_12-37-39-768x431.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/photo_2024-02-08_12-37-39-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/photo_2024-02-08_12-37-39-450x252.jpg 450w\" sizes=\"(max-width: 1109px) 100vw, 1109px\" />Transform Your Fortune: Earn $88K with O2T&#8217;s A.I. Crypto Giveaway Cryptocurrency, where fortunes can shift overnight, a groundbreaking opportunity emerges from Option2Trade (O2T). As Solana (SOL) faces hurdles, losing support amidst its recent outage saga, Option2Trade (O2T) presents a life-changing chance to earn up to $88K through its innovative A.I. crypto giveaway. This contrast paints [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-08T09:41:54.000Z",
    "title": "Dynamic Simplifies Solana Access via Email and Social Media",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/dynamic-simplifies-solana-access-via-email-and-social-media/",
    "description": "<p>This addition will transform how developers integrate new users into Solana, making it easier and more accessible. Dynamic&#8217;s embedded wallet support allows developers to onboard users through email and social media platforms directly. Solana&#8217;s Integration Leap: Email and Social Onboarding This means that new users can join the Solana ecosystem without the traditional hurdles associated [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/dynamic-simplifies-solana-access-via-email-and-social-media/\">Dynamic Simplifies Solana Access via Email and Social Media</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]