[
  {
    "source": "CoinDesk",
    "date": "2023-11-14T11:20:42.000Z",
    "title": "FTX Can Start Mediation, File Counterclaims in BlockFi Bankruptcy Case, Judge Rules",
    "url": "https://www.coindesk.com/business/2023/11/14/ftx-can-start-mediation-file-counterclaims-in-blockfi-bankruptcy-case-judge-rules/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "BlockFi filed for bankruptcy in late November last year, in part because of the ripple effects of the sudden collapse of FTX, which triggered an automatic stay that halted proceedings between the two."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-14T11:25:00.000Z",
    "title": "Owner of Hong Kong crypto exchange OSL secures $90M investment",
    "url": "http://cointelegraph.com/news/osl-owner-secures-90-million-investment",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/7fb9a5e8-016c-46dd-9792-78c2b7672580.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BC Technology Group, the operator of Hong Kong’s publicly-listed crypto exchange OSL, has raised $90 million in subscription of new shares from BGX. </p>\n                    <p><p>BC Technology Group, the operator of Hong Kong’s publicly-listed cryptocurrency exchange OSL, has announced a significant investment from industry firm BGX.</p><p>BC Technology entered into a partnership with BGX, which agreed to subscribe for shares in BC Technology for an investment of about 710 million Hong Kong dollars ($90.1 million), the firms said in a joint announcement on Nov. 14.</p><p>This strategic investment will involve the subscription of new shares under a specific mandate, subject to approval by shareholders, the announcement notes. </p><p>According to the firms, the investment marks a testament to OSL’s commitment to setting new standards in digital asset security, compliance and technological innovation. As previously reported by Cointelegraph, <a href=\"https://cointelegraph.com/news/hong-kong-welcomes-first-licensed-retail-crypto-exchange-hashkey\">OSL was one of the first crypto exchanges to acquire</a> a Hong Kong crypto license in 2023.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitget-drops-crypto-license-hong-kong\"><strong><em>Bitget drops plans to seek crypto license in Hong Kong</em></strong></a></p><p>The BGX partnership news comes the day after BC Technology <a href=\"https://media-bcgroup.todayir.com/20231113094001752510965576_en.pdf\" target=\"_blank\" rel=\"noopener nofollow\">halted</a> trading OSL shares on the Stock Exchange of Hong Kong. According to <a href=\"https://twitter.com/WuBlockchain/status/1724024615364915541\" target=\"_blank\" rel=\"noopener nofollow\">industry sources</a>, a rumor implied that OSL was  acquired or received investment from Bitget, an exchange that officially announced its departure from the Hong Kong market on Nov. 13.</p><p>OSL operator BC Technology has <a href=\"https://www.bloomberg.com/news/articles/2023-10-16/hong-kong-crypto-exchange-osl-weighs-sale-at-hk-1-billion-valuation\" target=\"_blank\" rel=\"noopener nofollow\">reportedly</a> considered selling the OSL exchange for $1 billion Hong Kong dollars, or $128 million.</p><p><em>Additional reporting by Zhiyuan Sun.</em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitmains-hong-kongs-jpex-bitget-asia-express/\"><strong><em>Bitmain’s revenge, Hong Kong’s crypto rollercoaster: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-14T11:32:02.000Z",
    "title": "November’s Top Cryptocurrency Contenders: Solana, VC Spectra, and NEO’s Market Position",
    "url": "https://www.cryptopolitan.com/novembers-top-cryptocurrency-contenders-solana-vc-spectra-and-neos-market-position/",
    "description": "November has proven to be the golden month for crypto investors. Recent Solana news suggests that Solana (SOL) surged by 152.9% in the past month due to increased institutional investments. Furthermore, NEO (NEO) witnessed a price rally despite a new crypto legislation threatening its utilization. Notably, VC Spectra (SPCT) has once again dominated headlines after ... <a title=\"November&#8217;s Top Cryptocurrency Contenders: Solana, VC Spectra, and NEO&#8217;s Market Position\" class=\"read-more\" href=\"https://www.cryptopolitan.com/novembers-top-cryptocurrency-contenders-solana-vc-spectra-and-neos-market-position/\" aria-label=\"More on November&#8217;s Top Cryptocurrency Contenders: Solana, VC Spectra, and NEO&#8217;s Market Position\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-14T11:32:43.000Z",
    "title": "Memecoin rallies 28% to new all-time high amid surging interest",
    "url": "https://crypto.news/memecoin-rallies-28-to-new-all-time-high-amid-surging-interest/",
    "description": "Memecoin (MEME), a recently launched crypto meme project, rallied by over 28% in less than five hours to a new all-time high of $0.03760 amid a resurgence of investor interest. The token&#8217;s recent upsurge comes at a time when the&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-14T11:23:45.000Z",
    "title": "Friend.tech phishing scheme involved fake journalists",
    "url": "https://crypto.news/friend-tech-phishing-scheme-involved-fake-journalists/",
    "description": "SlowMist reveals a sophisticated phishing attack on friend.tech, where fraudsters used fake interviews and malicious scripts to target users. Experts found that unknown attackers sent a link containing a malicious JavaScript script. Fraudsters tricked users into adding it as a&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-14T11:20:04.000Z",
    "title": "Solana Price Regains Momentum As FTX Sell-Off Ends",
    "url": "https://www.newsbtc.com/news/solana/solana-price-momentum-ftx-sell-off-ends/",
    "description": "After a significant dip to $51.27, Solana (SOL) is currently witnessing a notable recovery in its market price, currently trading at $55.31 (up 7%). This upswing follows a period of intense volatility, with SOL reaching a peak of $63.80 last Saturday, marking an impressive 270% rally over 61 days, only to drop almost 20% subsequently. The FTX Factor In The Solana Price Movement FTX has probably been a significant influence on SOL&#8217;s price volatility. A report from Lookonchain, an on-chain analysis service, indicates that FTX&#8217;s liquidity in SOL has drastically diminished, with Solana worth only $185,000 remaining in their public addresses. &#8220;FTX deposited 250,000 SOL ($13.6 M) to Kraken 7 hours ago. Currently, FTX’s public addresses on Solana only have 3,408 SOL,&#8221; Lookonchain reported. FTX deposited 250K $SOL($13.6M) to #Kraken 7 hours ago. Currently, FTX’s public addresses on #Solana only have 3,408 $SOL ($185K) left.https://t.co/A4CyCXgVzS pic.twitter.com/4EVtrwoYyX &#8212; Lookonchain (@lookonchain) November 14, 2023 Crypto influencer MartyParty commented on the situation, criticizing FTX&#8217;s strategy of liquidating SOL holdings for creditor payments as &#8220;one of the most idiotic moves in crypto history.&#8221; According to his observations, FTX&#8217;s liquid SOL has been entirely offloaded to the market, marking an end to its influence on SOL&#8217;s price dynamics. Related Reading: Solana (SOL) Shines 40% Toward $60 As Whales Make Big Moves Meanwhile, crypto analyst Bluntz pointed out that despite FTX&#8217;s consistent selling of SOL, ranging from 250,000 to 700,000 daily for the past three weeks, the price of SOL managed to stay resilient. He suggests that with the depletion of FTX&#8217;s unlocked tokens, a significant price surge for SOL could be imminent, &#8220;Once this seller is gone, I can only imagine how hard it&#8217;s gonna pump. Dont middle curve this.&#8221; The Remaining SOL Holdings Of FTX While FTX has sold 6.996 million SOL in the last few weeks, they are still sitting on a huge pile of Solana. Crypto Edgar provided an overview of FTX&#8217;s SOL holdings, highlighting that while the bulk of SOL transfers from FTX’s cold wallets have been completed, a substantial amount remains staked in various liquid stake solutions, potentially available for future sale. Related Reading: Solana Price Could Reach $1,000, Analyst Explains Why &#8220;The FTX cold wallets contain almost no more SOL but they still hold some amount of liquid SOL which is staked in liquid stake solutions Lido Finance, Marinade Finance and JPool. In total 1.25 million SOL is still locked but could easily be withdrawn and sold as well,&#8221; the analyst remarked. Moreover, it is important to note that FTX still holds 42.2 million SOL, worth $2.19 billion under lock-up. According to the SOL unlock schedule, each month sees the release of 618,400 SOL. This regular monthly unlocking accounts for about 1.1% of the entire SOL holdings of FTX. Notably, a significant event is scheduled for March 1, 2025, where 7.5 million SOL will be unlocked. In conclusion, although some influencers are celebrating the end of the FTX sell-off, this is not the full reality. While a large chunk of selling pressure may have been very well absorbed by the market in recent weeks, it is not close to an end. The FTX factor for the Solana price is still out there. Despite that the SOL price has shown tremendous strength in recent weeks, considering the massive selling pressure from FTX. At press time, SOL was trading at $55.31, making the 1,618 Fibonacci extension level at $57.85 once again the key resistance for the bulls. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-14T11:14:05.000Z",
    "title": "All You Need to Know About the Upcoming Plexus IDO",
    "url": "https://www.altcoinbuzz.io/finance-and-funding/idos/all-you-need-to-know-about-the-upcoming-plexus-ido/",
    "description": "<p>Buckle up! The bull run is looking to get started. And, many projects are looking to launch their Initial DEX Offerings, or IDO for short. Today, we&#8217;ll be looking at the upcoming Plexus IDO! In this article, you will find out if you should participate! What is Plexus? Plexus is the world’s first cross-chain exchange. [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/finance-and-funding/idos/all-you-need-to-know-about-the-upcoming-plexus-ido/\">All You Need to Know About the Upcoming Plexus IDO</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-14T11:23:00.000Z",
    "title": "Chainlink Is the Top Participant in the Polygon Ecosystem: Report",
    "url": "https://coinedition.com/chainlink-is-the-top-participant-in-the-polygon-ecosystem-report/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/LINK-6.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/LINK-6.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/LINK-6-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/LINK-6-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/LINK-6-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/LINK-6-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/LINK-6-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Chris Barrett, a developer at Chainlink (LINK), shared data from the blockchain intelligence platform Nansen, which shows that LINK was a leading participant on Polygon (MATIC) in Q3 2023. According to the post, Chainlink registered 47.08 million transactions on the Layer-2 network. On-chain data also shows that Chainlink was by far the biggest participant in [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/chainlink-is-the-top-participant-in-the-polygon-ecosystem-report/\">Chainlink Is the Top Participant in the Polygon Ecosystem: Report</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]