[
  {
    "source": "Bitcoin.com",
    "date": "2024-01-21T09:00:12.000Z",
    "title": "CFTC Files Civil Enforcement Action Against Bogus Crypto Exchange Debiex",
    "url": "https://news.bitcoin.com/cftc-files-civil-enforcement-action-against-bogus-crypto-exchange-debiex/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_1402920173-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_1402920173-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_1402920173-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_1402920173-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_1402920173-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_1402920173-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_1402920173-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_1402920173.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.S. commodities regulator revealed on Jan. 19 that it had filed a civil enforcement action against a bogus digital asset exchange platform. According to the Commission, Debiex customers were not aware that the entire set-up was a clever scam designed to dupe prospective investors. Romance Scam Tactics The Commodities Futures Trading Commission (CFTC) announced [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-21T09:07:21.000Z",
    "title": "Meta’s Strategic Move: AI Boosting Business Messaging",
    "url": "https://www.cryptopolitan.com/metas-strategic-move-ai-boosting-business-messaging/",
    "description": "Meta, the tech conglomerate that owns Facebook, Instagram, and WhatsApp, is redefining its business strategy with a sharp focus on artificial intelligence (AI) to enhance business messaging. This strategic shift comes amidst the company&#8217;s recent relocation to its new 340,000-square-foot office space in Ballsbridge, formerly part of the AIB Bankcentre. Real estate and business expansion [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-21T09:00:10.000Z",
    "title": "Africa’s Agenda 2063: Harnessing AI for a Strategic Leap in Healthcare, Agriculture, and Education.",
    "url": "https://www.cryptopolitan.com/africas-agenda-2063-harnessing-ai-for-a-strategic-leap-in-healthcare-agriculture-and-education/",
    "description": "In alignment with the African Union&#8217;s transformative Agenda 2063, artificial intelligence (AI) stands poised to significantly reshape the socio-economic landscape of the continent. This strategic framework, dedicated to propelling Africa into a future of prosperity and unity, recognizes the pivotal role of sectors like healthcare, agriculture, and education. AI, with its vast capabilities, is set [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-21T08:59:30.000Z",
    "title": "Bitcoin Price Prediction 2024-2033: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2024-2033 How much is Bitcoin (BTC) worth? Today, the price of Bitcoin stands at $41,667, with a trading volume over the past 24 hours reaching $24 billion. Its market capitalization is $887 billion, and it currently commands 54% of the market share. Over the last 24 hours, the BTC price has experienced [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-21T08:47:37.000Z",
    "title": "Futuristic Insights – 10 Predictions on AI’s Impact in the Years Ahead",
    "url": "https://www.cryptopolitan.com/10-predictions-on-ais-impact-in-the-years/",
    "description": "In the wake of a year marked by significant strides in artificial intelligence, the landscape of our world is on the verge of a profound transformation. In a recent episode of the Norwegian podcast Game Over?, Professor Morten Goodwin and Associate Professor Per-Arne Andersen unveiled ten bold predictions that foresee how artificial intelligence will reshape [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-21T08:50:18.000Z",
    "title": "Solana Stablecoin Volume Reaches Record High Of $300 Billion In January",
    "url": "https://www.newsbtc.com/news/solana/solana-stablecoin-volume-reaches-record-high-of-300-billion-in-january/",
    "description": "According to the latest on-chain data, the Layer-1 network Solana has hit a significant milestone in terms of the transfer volume of stablecoins this month. Solana Overtakes Tron In Stablecoin Transfer Volume Data from the blockchain analytics platform Artemis shows that the stablecoin transfer volume on Solana has already surpassed $300 billion in January. This is the largest transfer volume recorded by stablecoins on the Layer-1 blockchain in a single month. To put this figure into context, the Solana network registered $297 billion in stablecoin volume in the entire December. Meanwhile, the blockchain&#8217;s stablecoin transfer volume was about $11.56 billion in January 2023, reflecting an over 2,500% growth in the past year. Stablecoin transfer volume across various blockchains in the past year &#124; Source: Artemis Related Reading: Bitcoin Whale Addresses Hit 15-Month High – A Sign Of Growing Accumulation? From the chart above, it is clear that Solana’s stablecoin activity has been on a steady rise since October, increasing by more than 650% in the past few months.  This growth has also impacted the network’s share in the stablecoin market, with Solana now boasting about 32% market share. Unsurprisingly, Ethereum leads the market for stablecoins, with its transfer volume already reaching almost $317 billion in January. Meanwhile, the Tron network trails Solana in third place, with a stablecoin volume of roughly $240 billion. On Thursday, January 18, Paxos revealed the launch of its regulated stablecoin, USDP, on the Solana network. According to DefiLlama data, USDC remains the dominant stablecoin on the Layer-1 network, with a market cap of over $1 billion. Paxos is thrilled to share our regulated stablecoin USDP is now live on the @solana blockchain! This integration makes it easier for anyone to access and use the safest, most reliable stablecoins in the market. Learn more here: https://t.co/0j4Kj0yyPk pic.twitter.com/1doexKvVmY — Paxos (@Paxos) January 18, 2024 SOL Price Overview Despite Solana’s burgeoning network activity, the price performance of its native token SOL has somewhat dampened in the past few weeks. As of this writing, the Solana token is valued at $92, reflecting a 0.6% decline in the last 24 hours. This sluggish performance in the past day underscores the altcoin’s challenges since the turn of the year. After reaching a multi-month high of $124 at the end of 2023, the SOL price has largely struggled to hold above the $100 mark. Related Reading: Brace For Crypto Market Waves: FTX And Celsius Are Sending MATIC, ETH, And WBTC To Binance According to data from CoinGecko, the Solana token is down by more than 5% in the past week. Meanwhile, the coin has declined by about double that figure since the beginning of 2024. Nevertheless, SOL maintains its position as the fifth-largest cryptocurrency in the sector, with a market capitalization of more than $40 billion. Solana price faces downward pressure on the daily timeframe &#124; Source: SOLUSDT chart on TradingView Featured image from Dreamstime/Aivaras Sakurovas, chart from TradingView"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-21T08:58:03.000Z",
    "title": "How to Understand Your Solana Transactions Easily with SolanAI",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/how-to-understand-your-solana-transactions-easily-with-solanai/",
    "description": "<p>This innovative tool aims to bridge the gap between the complex world of blockchain transactions and the everyday user. Now is in the Alpha phase. It provides a user-friendly interface for a better understanding of Solana&#8217;s decentralized ecosystem. A Solan.ai Brief Guide  To get started, users can visit SolanAI. This new platform has two groups: [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/how-to-understand-your-solana-transactions-easily-with-solanai/\">How to Understand Your Solana Transactions Easily with SolanAI</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]