[
  {
    "source": "CryptoSlate",
    "date": "2023-11-24T14:47:35.000Z",
    "title": "Tether and Bitfinex yield to FOIL request amid transparency pledge",
    "url": "https://cryptoslate.com/tether-and-bitfinex-yield-to-foil-request-amid-transparency-pledge/",
    "description": "<p>Crypto firms Tether and Bitfinex have agreed to drop their opposition to a freedom of information (FOIL) request filed by several journalists in New York, according to a Nov. 24 statement shared with CryptoSlate. According to the statement, the companies decided not to challenge the FOIL request made by journalists Zeke Faux, Shane Shifflett, and [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/tether-and-bitfinex-yield-to-foil-request-amid-transparency-pledge/\">Tether and Bitfinex yield to FOIL request amid transparency pledge</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-24T15:00:33.000Z",
    "title": "Ripple CEO Offers Perspective On Legal Fallout With The SEC",
    "url": "https://www.newsbtc.com/ripple-2/ripple-ceo-offers-perspective-on-legal-fallout-with-the-sec/",
    "description": "Brad Garlinghouse, the CEO of Ripple, expressed his views on the aftermath of their legal battle with the US Securities and Exchange Commission (SEC). Ripple CEO Insights On The SEC&#8217;s Stand In The Legal Battle The Ripple CEO spoke about the case between the crypto company and the SEC in an interview at the 2023 DC Tech Week. Garlinghouse highlighted the SEC&#8217;s several setbacks since the case started. According to the CEO, &#8220;the SEC has lost on everything that matters&#8221; when he was asked if the case is &#8220;done and dusted.&#8221; He further highlighted that the case&#8217;s conclusion rests on the SEC&#8217;s decision to pursue an appeal or not. Related Reading: Ripple Introduces AMMs To XRPL, But Is This Good Or Bad For XRP Price Nonetheless, Garlinghouse asserted that whether or not the SEC files an appeal on the case, which seems over for the regulator. This is due to the SEC&#8217;s &#8220;losing about three times to the crypto firm.&#8221;   In addition, the CEO also brought up the SEC&#8217;s losses in the Grayscale case. In a court ruling, a trial judge declared the agency was behaving &#8220;arbitrarily and capriciously&#8221; towards Grayscales&#8217;s Spot Bitcoin ETF application.  Notably, this legal wording suggests intentional and unreasonable activities done carelessly, ignoring relevant circumstances, facts, and other parties&#8217; rights. With this incident, Garlinghouse emphasized that the SEC should reevaluate its course toward cryptocurrency regulation. The CEO stated: I mean this is damning language from a federal judge to the SEC. At some point when you keep trying the same thing and having the same outcome, you need to change your approach. I hope the SEC&#8217;s change will be magical. Nonetheless, Garlinghouse noted that the SEC losses will be amplified if they decide to take the appeal process higher.  Furthermore, Garlinghouse &#8220;reaffirmed&#8221; that Ripple stands prepared to pursue the matter further with the US Supreme Court should the situation demand it. Given that the Supreme Court has typically ruled against regulators, he firmly believes that the SEC would fail in the Supreme Court. Regulatory Framework For the Cryptocurrency Industry The Ripple CEO also spoke about the ambiguous regulatory framework for the cryptocurrency industry in the United States. According to Garlinghouse, other nations are increasing their market influence by implementing open rules and luring capital into the industry. On the other hand, the US continues to view cryptocurrencies with &#8220;skepticism.&#8221; Related Reading: Ripple CEO Declares Intent To Bring XRP Battle To Supreme Court Garlinghouse conveyed that the US lacks a conducive regulatory framework. This causes the United States to &#8220;forfeit&#8221; its prospective position as a leader in the cryptocurrency space. So far, the Ripple CEO believes the US will create a crypto-friendly legal environment in the next ten years. Feature image from iShock, chart by Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-24T15:01:00.000Z",
    "title": "Ripple on Potential of NFTs: “We Have Not Even Scratched the Surface”",
    "url": "https://coinedition.com/ripple-on-potential-of-nfts-we-have-not-even-scratched-the-surface/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Ripple-CEO-Brad-Garlinghouse-in-Twitter-Spat-With-VC-Over-XRP.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple on Potential of NFTs: “We Have Not Even Scratched the Surface”\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Ripple-CEO-Brad-Garlinghouse-in-Twitter-Spat-With-VC-Over-XRP.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Ripple-CEO-Brad-Garlinghouse-in-Twitter-Spat-With-VC-Over-XRP-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Ripple-CEO-Brad-Garlinghouse-in-Twitter-Spat-With-VC-Over-XRP-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Ripple-CEO-Brad-Garlinghouse-in-Twitter-Spat-With-VC-Over-XRP-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Ripple-CEO-Brad-Garlinghouse-in-Twitter-Spat-With-VC-Over-XRP-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Ripple-CEO-Brad-Garlinghouse-in-Twitter-Spat-With-VC-Over-XRP-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The blockchain company said NFTs are in their early stages and hold more potential. Ripple Labs highlighted its plans and recent strides in the tokenisation and NFT space. Ripple predicts XRPL will champion the growing tokenisation market and support various use cases. XRP enthusiast Edo Farina recently drew his X followers’ attention to a document [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/ripple-on-potential-of-nfts-we-have-not-even-scratched-the-surface/\">Ripple on Potential of NFTs: “We Have Not Even Scratched the Surface”</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-24T14:40:00.000Z",
    "title": "SBF Is Locked Up With Former Honduran President and Ex-Mexican Police Chief",
    "url": "https://coinedition.com/sbf-is-locked-up-with-former-honduran-president-and-ex-mexican-police-chief/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/FTX-Relieves-the-Deputies-of-Sam-Bankman-Fried-of-Their-Duties-.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FTX Relieves the Deputies of Sam Bankman-Fried of Their Duties \" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/FTX-Relieves-the-Deputies-of-Sam-Bankman-Fried-of-Their-Duties-.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/FTX-Relieves-the-Deputies-of-Sam-Bankman-Fried-of-Their-Duties--300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/FTX-Relieves-the-Deputies-of-Sam-Bankman-Fried-of-Their-Duties--380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/FTX-Relieves-the-Deputies-of-Sam-Bankman-Fried-of-Their-Duties--150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/FTX-Relieves-the-Deputies-of-Sam-Bankman-Fried-of-Their-Duties--600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/FTX-Relieves-the-Deputies-of-Sam-Bankman-Fried-of-Their-Duties--696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Sam Bankman-Fried (SBF), the once-high-flying founder of crypto exchange FTX and trading firm Alameda Research, is getting adjusted to his new life inside the confines of Brooklyn&#8217;s Metropolitan Detention Center. The Wall Street Journal (WSJ) has reported that Bankman-Fried is scheduled for a sentencing date on March 28, 2024. Bankman-Fried&#8217;s life behind bars is marked [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/sbf-is-locked-up-with-former-honduran-president-and-ex-mexican-police-chief/\">SBF Is Locked Up With Former Honduran President and Ex-Mexican Police Chief</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]