[
  {
    "source": "Cointelegraph",
    "date": "2023-06-06T18:00:00.000Z",
    "title": "House Ag Committee looks at digital assets regulatory bill, Dems ask how to pay for it",
    "url": "https://cointelegraph.com/news/house-ag-committee-looks-at-digital-assets-regulatory-bill-dems-ask-how-to-pay-for-it",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/a6cd7171-f647-4cd2-adf4-8a85f6b0eb8d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The full Agriculture Committee heard testimony from CFTC chair Rostin Behnam, a full roster of former regulators and Coinbase’s chief legal officer. </p>\n                    <p><p>If there were ever such a thing as an all-star lineup of regulators, the United States House of Representatives Agricultural Committee’s June 6 hearing on digital asset regulation would probably <a href=\"https://agriculture.house.gov/calendar/eventsingle.aspx?EventID=7639\" target=\"_blank\" rel=\"noopener nofollow\">hold</a> the record. The current chair of the Commodity Futures Trading Commission (CFTC) Rostin Behnam was joined by a former chair and a former acting chair of that agency, as well as a former commissioner. Coinbase chief legal officer Paul Grewal also appeared.</p><p>It was also very long hearing, with Behnam alone speaking and answering questions for over two hours. The topic of the hearing <a href=\"https://cointelegraph.com/news/us-lawmakers-aim-for-crypto-regulatory-clarity-with-proposed-bill-putting-the-screws-to-sec\">was the draft bill authored</a> by committee chair Glenn Thompson and House Financial Services Committee chair Patrick McHenry. </p><p>“It is our hope that we will have a bipartisan, joint committee legislative proposal,” Thompson said of the Republicans’ bill in his opening remarks.</p><p>Democratic committee members showed some signs of balking at this hope. The 162-page bill was described as “incredibly complex,” and they only got to see it last week, the Democrats pointed out. </p><p>The bill is only a <a href=\"https://financialservices.house.gov/uploadedfiles/digital_002_xml.pdf\" target=\"_blank\" rel=\"noopener nofollow\">draft</a>, Thompson emphasized, but it is badly needed, as: </p><blockquote>“Current federal laws and regulations provide few rules of the road […], leading to complicated enforcement actions by regulators and creating further confusion in the industry and market.\"</blockquote><p>The bill should not impact existing law, Behnam told the committee, and it does not shift existing authorities. Rather it covers gaps, especially the spot market for digital assets that are not securities. That gap leads to “Joe Shmo at a vape shop selling cryptocurrency,” as committee member Rick Crawford described in his hometown. Meanwhile, bankers are avoiding the emerging asset class while it remains unregulated.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/sec-labels-61-cryptocurrencies-securities-after-binance-suit\">Binance lawsuit: 61 cryptocurrencies are now seen as securities by the SEC</a></em></strong></p><p>The Thompson-McHenry bill would change the method of defining securities and commodities to one based on how the asset was traded — whether obtained from the issuer or bought on an exchange — and level of decentralization, as an adjustment to the “principles-based regulatory regime” already in place. Securities are generally bought from an issuer and commodities trade on exchanges. </p><p>The bill would also create new definitions of digital commodity brokers and dealers without altering the core components of market structure.</p><p>The regulatory gap affects 60% of the digital assets market, Behnam said. He was referring to the market for Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>). Behnam declared ETH a commodity, not a security, without hesitation, in contrast to Securities and Exchange Commission chair Gary Gensler, who <a href=\"https://cointelegraph.com/news/us-house-committee-chair-repeatedly-presses-sec-chair-is-ether-a-commodity-or-a-security\">refused to make that distinction</a> at a House Financial Services Committee hearing in April. </p><p>Behnam was less enthusiastic about the provisional registration period foreseen by the bill, which would give intermediaries limited relief from the requirements of the bill while final rules were being drafted. Behnam described it as “handcuffing” regulators.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">.<a href=\"https://twitter.com/CongressmanGT?ref_src=twsrc%5Etfw\">@CongressmanGT</a>: Today, the SEC filed a complaint against one of our witnesses, <a href=\"https://twitter.com/coinbase?ref_src=twsrc%5Etfw\">@Coinbase</a>. While I will not &amp; cannot speak to any specific allegations against the company, I do want to note this action is exactly why we are holding our hearing hear today.<a href=\"https://t.co/NF0tyLf0Du\">https://t.co/NF0tyLf0Du</a></p>&mdash; House Committee on Agriculture (@HouseAgGOP) <a href=\"https://twitter.com/HouseAgGOP/status/1666087854269952001?ref_src=twsrc%5Etfw\">June 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Authorizing the CFTC to cover the regulatory gap in digital asset regulation would give the agency a considerably broader remit and cost money. The bill does not include a funding mechanism, as numerous Democratic committee  members pointed out, and the House Appropriations Committee has proposed cutting funding to the CFTC.</p><p>Behnam said the current CFTC budget is $360 million, while it requested $410 million for the next fiscal year, and the Appropriation Committee is suggesting $345 million. If that budget cut is made, the agency must furlough staff, Behnam said. </p><p>With the digital assets regulatory bill, the CFTC would require an additional $120 million over three years. The extra money would pay for three rulemaking teams and new computer hardware and software. Rulemaking would take up to four years.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/cleaning-crypto-how-much-enforcement-needed/\">Cleaning up crypto: How much enforcement is too much?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T18:01:24.000Z",
    "title": "Crypto funds experience withdrawals as prices continue to rise",
    "url": "https://www.cryptopolitan.com/crypto-funds-withdrawals-as-prices-rise/",
    "description": "According to a recent report by CoinShares, the past seven weeks have seen a drawdown of $329 million from crypto funds, with last week alone accounting for investor withdrawals of $62 million. This decline in assets under management (AUM) is attributed to a rise in investors capitalizing on short positions, following a substantial 56% increase ... <a title=\"Crypto funds experience withdrawals as prices continue to rise\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-funds-withdrawals-as-prices-rise/\" aria-label=\"More on Crypto funds experience withdrawals as prices continue to rise\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T17:40:21.000Z",
    "title": "SEC Chair Gensler asserts, “we don’t need more digital currency” as agency sues Coinbase and Binance",
    "url": "https://www.cryptopolitan.com/sec-chair-gensler-asserts-we-dont-need-more-digital-currency-as-agency-sues-coinbase-and-binance/",
    "description": "In an interview with CNBC, Securities and Exchange Commission (SEC) Chair Gary Gensler responded to criticism by denying that his approach was confusing the crypto industry. This comes as the SEC filed lawsuits against major cryptocurrency exchanges Binance and Coinbase for allegedly operating unregistered securities exchanges. Gensler also drew parallels between the case against Binance&#8217;s ... <a title=\"SEC Chair Gensler asserts, &#8220;we don&#8217;t need more digital currency&#8221; as agency sues Coinbase and Binance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-chair-gensler-asserts-we-dont-need-more-digital-currency-as-agency-sues-coinbase-and-binance/\" aria-label=\"More on SEC Chair Gensler asserts, &#8220;we don&#8217;t need more digital currency&#8221; as agency sues Coinbase and Binance\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-06T18:00:28.000Z",
    "title": "InQubeta (QUBE) Presale Launch Surpasses Expectations, Attracting Bitcoin (BTC) Holders",
    "url": "https://nulltx.com/inqubeta-qube-presale-launch-surpasses-expectations-attracting-bitcoin-btc-holders/",
    "description": "06The cryptocurrency market is abuzz with the recent presale launch of InQubeta (QUBE), an innovative platform that bridges the gap between AI and crypto. InQubeta aims to revolutionize the way AI startups receive funding and investors participate in the growing AI industry. Since its highly anticipated presale started, InQubeta has exceeded expectations, drawing the attention [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-06T17:56:36.000Z",
    "title": "Binance launches bitcoin NFTs amidst SEC lawsuit",
    "url": "https://crypto.news/binance-launches-bitcoin-nfts-amidst-sec-lawsuit/",
    "description": "Binance has added bitcoin non-fungible tokens (NFTs) to its marketplace only one day after the U.S. Securities and Exchange Commission (SEC) filed a complaint against the business."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-06T18:00:37.000Z",
    "title": "Coinbase Caught In SEC Legal Crossfire, COIN Price Suffers",
    "url": "https://www.newsbtc.com/breaking-news-ticker/coinbase-caught-in-sec-legal-crossfire-coin-price-suffers/",
    "description": "Coinbase, the leading cryptocurrency trading platform in the United States, has recently found itself embroiled in a legal battle with the US Securities and Exchange Commission (SEC). The SEC filed a lawsuit on Tuesday, accusing Coinbase of operating without proper registration, thereby violating regulations designed to safeguard investors. This lawsuit has sent shockwaves through the crypto market, impacting not only the global cryptocurrency market but also Coinbase&#8217;s stock value and triggering concerns about the broader implications for the industry. The SEC Lawsuit Against Coinbase In a complaint lodged with the Manhattan federal court, the SEC alleges that Coinbase has been functioning as an unregistered broker since about 2019, breaching disclosure requirements aimed at protecting investors. Related Reading: When Is A Token Coming For Coinbase’s Base L2? Here’s What The Roadmap Says The regulator also claims that Coinbase, through its various services such as Coinbase Prime and Coinbase Wallet, facilitated cryptocurrency transactions without obtaining the necessary authorization. SEC Chair Gary Gensler emphasized the gravity of Coinbase&#8217;s alleged failures, stating that they deprived investors of crucial protections against fraud, manipulation, conflicts of interest, and routine inspections. The SEC chairman noted:  Coinbase&#8217;s alleged failures deprive investors of critical protections, including rulebooks that prevent fraud and manipulation, proper disclosure, safeguards against conflicts of interest, and routine inspection. During an interview with CNBC on Tuesday, Gensler remarks about crypto trading platforms and questioned their operational models. He highlighted the fact that these platforms, often referred to as exchanges, encompasses various functions that go beyond traditional exchange activities. Drawing a comparison, he said that the New York Stock Exchange does not engage in hedge fund operations. Market Impact And COIN Stock Decline News of the SEC lawsuit had an immediate impact on Coinbase&#8217;s stock value, which plunged significantly during premarket trading following the filing. The legal action against Coinbase comes on the heels of the SEC&#8217;s recent lawsuit against Binance, the world&#8217;s largest cryptocurrency exchange, and its founder Changpeng Zhao, further intensifying scrutiny on the industry. Related Reading: Bitcoin (BTC) Dominance Trend Shifts Alongside Stablecoin Flows: Glassnode In the wake of the SEC lawsuit, Coinbase&#8217;s stock (COIN) has experienced a significant downturn, recording a 13% loss in just one day. This downward trend has seen Coinbase shares tumble from a high of $64 last Tuesday to $50.15 within the past 24 hours. Coinbase stock (COIN)’s value moving sideways on the 1-day chart. Source: COIN on TradingView.com The outcome of the legal battle and its potential implications for Coinbase&#8217;s operations could have lasting effects on the company&#8217;s stock performance and the broader cryptocurrency market. Already, the fallout from these legal challenges has resulted in a 2.8% decline in the global crypto market, causing its overall value to dip below the $1.2 trillion mark, which had previously served as a plateau. Larger crypto market such as Bitcoin (BTC) and Ethereum (ETH) has also fallen dramatically with both recording 2.7% and 1.3% decline in the past 24 hours, respectively. Featured image from Shutterstock, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-06T18:05:13.000Z",
    "title": "Coinbase Sued By SEC, Regulator Says Crypto Exchange Is Offering Unregistered Securities",
    "url": "https://dailyhodl.com/2023/06/06/coinbase-sued-by-sec-regulator-says-crypto-exchange-is-offering-unregistered-securities/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/coinbase-lays-off-nearly.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/coinbase-lays-off-nearly.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/coinbase-lays-off-nearly.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/coinbase-lays-off-nearly.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/coinbase-lays-off-nearly.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/coinbase-lays-off-nearly.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/coinbase-lays-off-nearly.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A day after suing Binance, the U.S. Securities and Exchange Commission (SEC) has targeted Coinbase in its latest offensive on the crypto industry. In a new press release, the SEC says it&#8217;s charging Coinbase for &#8220;operating as an unregistered securities exchange, broker, and clearing agency.&#8221; The regulator is also charging Coinbase for &#8220;failing to register [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/06/coinbase-sued-by-sec-regulator-says-crypto-exchange-is-offering-unregistered-securities/\">Coinbase Sued By SEC, Regulator Says Crypto Exchange Is Offering Unregistered Securities</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]