[
  {
    "source": "CoinDesk",
    "date": "2023-06-12T15:29:33.000Z",
    "title": "Binance.US Market Depth Declines 76% in June Following SEC Lawsuit",
    "url": "https://www.coindesk.com/markets/2023/06/12/binanceus-market-depth-declines-76-in-june-following-sec-lawsuit/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Binance.US’s market depth has dropped in June as market makers are fleeing the exchange following the SEC’s lawsuit."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-12T15:31:03.000Z",
    "title": "Gaming sector hit hard as Nexo outperforms tokens listed in SEC lawsuits",
    "url": "https://cryptoslate.com/gaming-sector-hit-hard-as-nexo-outperforms-tokens-listed-in-sec-lawsuits/",
    "description": "<p>The fallout from the U.S. Securities and Exchange Commission (SEC) lawsuits against major cryptocurrency exchanges Binance and Coinbase is starting to play out in the market. The legal action sent shockwaves throughout the crypto market, affecting many tokens in the lawsuits as evidence that the exchanges have been trading crypto securities. Analyzing the performance of these [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/gaming-sector-hit-hard-as-nexo-outperforms-tokens-listed-in-sec-lawsuits/\">Gaming sector hit hard as Nexo outperforms tokens listed in SEC lawsuits</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-12T15:28:31.000Z",
    "title": "Bored Pepe VIP Club (BPVC) Is Now Available for Trading on LBank Exchange",
    "url": "https://cryptodaily.co.uk/2023/06/bored-pepe-vip-club-bpvc-is-now-available-for-trading-on-lbank-exchange",
    "description": "<p>Road Town, BVI, June 12th, 2023, Chainwire</p><p>LBank Exchange, a global digital asset trading platform, listed Bored Pepe VIP Club (BPVC) on Jun 12, 2023. For all users of LBank Exchange, the BPVC/USDT trading pair is now officially available for trading at 10:00 UTC on Jun 12, 2023.</p><p>Bored Pepe Vip Club is a Coin named $BPVC and a collection of 10,000 Bored Pepe NFTs unique digital collectibles living on the Ethereum blockchain. Its native token, BPVC, was listed on LBank Exchange at 10:00 UTC on Jun 12, 2023, with the goal of expanding its global footprint and supporting the realization of its forward-thinking objectives.</p><p>Introducing Bored Pepe VIP Club</p><p>LBank Exchange is thrilled to announce the upcoming listing of Bored Pepe VIP Club (BPVC), a Coin named $BPVC and a collection of 10,000 Bored Pepe NFTs unique digital collectibles living on the Ethereum blockchain.</p><p>Possessing a Bored Pepe NFT not only offers ownership of a unique digital asset but also functions as a VIP Club membership card, endowing holders with exclusive members-only benefits. The primary benefit provided is access to PEPE LOUNGE, a collaborative graffiti board. Furthermore, the community has the ability to unlock future areas and perks through the activation of the roadmap.</p><p>Every Bored Pepe is distinctive and algorithmically created from a pool of over 70 potential traits, such as expression, headwear, clothing, and more. While all pepes are appealing, some are rarer than others. The pepes are held as ERC-721 tokens on the Ethereum blockchain and are hosted on IPFS for guaranteed proof of ownership and authenticity (See Record and Proof). The purchase of a Bored Pepe comes at a cost of 0.08 ETH. In order to gain access to members-only areas like the PEPE LOUNGE, holders of Bored Pepe will need to be signed into their Metamask Wallet.</p><p>Upon purchasing a Bored Pepe, one isn't simply acquiring an avatar or a provably rare piece of art. Instead, purchasers are becoming a member of an exclusive club, the benefits and offerings of which are poised to expand over time. A Bored Pepe can act as a digital identity and unlock virtual opportunities for its owner.</p><p>The BPVC Lounge, an exclusive area for Pepe holders, will become operational once the sale period concludes. It features a canvas that is only accessible to wallets that contain at least one pepe. As one might expect in any quality bar, this is the place for users to draw, jot down thoughts, or write expletives.</p><p>Every fifteen minutes, each pepe-holder is granted the privilege to paint a pixel on the bathroom wall. This can be seen as a collective art experiment in the cryptosphere: a members-only canvas for the sophisticated minds of crypto Twitter.</p><p>About BPVC Token</p><p>Based on ERC-20, BPVC has a fixed total supply of 1 trillion (i.e. 1,000,000,000,000). It was listed on LBank Exchange at 10:00 UTC on Jun 12, 2023, investors who are interested in BPVC can easily buy and sell it on LBank Exchange now. The listing of BPVC token on LBank Exchange will undoubtedly help it further expand its business and draw more attention in the market.</p><p>Learn More about BPVC Token:</p><p>Official Website | Twitter | Telegram | Opensea | Contract</p><p>About LBank</p><p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge growing platform that ensures the integrity of users' funds and aims to contribute to the global adoption of cryptocurrencies.</p><p>Start Trading Now: lbank.com</p><p>Community &amp; Social Media:&nbsp;</p><p>Telegram l&nbsp;Twitter l&nbsp;Facebook l&nbsp;LinkedIn l&nbsp;Instagram l&nbsp;YouTube</p><p></p>ContactLBK Blockchain Co. Limitedmarketing@lbank.info"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-12T15:30:28.000Z",
    "title": "Biggest Movers: ADA, ATOM Rebound on Monday, as Bulls Buy Recent Dip",
    "url": "https://news.bitcoin.com/biggest-movers-ada-atom-rebound-on-monday-as-bulls-buy-recent-dip/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2072530853-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers: ADA, ATOM Rebound on Monday, as Bulls Buy Recent Dip\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2072530853-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2072530853-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2072530853-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2072530853-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2072530853-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2072530853-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2072530853.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Cardano climbed higher to start the week, as bulls moved to buy the recent dip in price. The token dropped by over 30% over the weekend, as traders continued to react to the Robinhood delisting. Cosmos also rebounded, moving away from a one-year low. Cardano (ADA) Cardano (ADA) rebounded by nearly 5% to start the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T15:29:49.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "The automatic release of new APT tokens into the open market is valued at over $50 million based on current prices. Cryptopolitan foresees risk factors moving from&#160;Bitcoin&#160;to Ethereum-specific risk factors with the increasing importance of market factors, providing evidence for a decoupling of on-chain and off-chain trading activity. So, it&#8217;s interesting to see how the ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T15:28:54.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The $2Million bet by ex-CTO of Coinbase has been the subject of much discussion and debate in the crypto world. At the heart of the controversy is Srinivasan’s prediction that Bitcoin will reach $1 million per coin within just 90 days. This Bitcoin Price Prediction intends to shed light on the ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T15:11:35.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-12T15:35:00.000Z",
    "title": "a16z leads $43m funding round for Gensyn AI",
    "url": "https://crypto.news/a16z-leads-43m-funding-round-for-gensyn-ai/",
    "description": "UK-based Gensyn AI recently secured $43 million in Series A funding led by a16z crypto. The company wants to enable developers to build AI tools using a flexible pay-as-you-go model."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-12T15:30:43.000Z",
    "title": "Insights On ADA’s Security Concerns: Cardano Founder And Ripple CTO Exchange Views",
    "url": "https://www.newsbtc.com/news/cardano/insights-on-adas-security-concerns-cardano-founder-and-ripple-cto-exchange-views/",
    "description": "In a series of tweets, Ripple&#8217;s CTO, David Schwartz, and Cardano founder Charles Hoskinson have contested SEC&#8217;s security classification of ADA in the ongoing regulatory crackdown. Hoskinson and Schwartz’s objections to the SEC&#8217;s stance were prompted by tweets from an attorney known for supporting XRP, Bill Morgan. It&#8217;s important to note that the US SEC filed lawsuits against Binance and Coinbase on June 6 and June 5, alleging that both exchanges were trading unregistered securities. Product Improvements Doesn’t Make it A Security, Said Bill Morgan In recent tweets, Bill Morgan expressed his skepticism about the SEC&#8217;s argument. He raised concerns about the validity of the SEC&#8217;s claim, emphasizing that it overlooks the transformative nature of technological progress and innovation within the cryptocurrency industry. Related Reading: Pepecoin Price Drops, Breaking Key Support Level – Further Downfall Ahead? He compared the situation to how smartphones have evolved, with manufacturers constantly improving and adding new features to make them better. Referring to a section of the SEC’s complaint, he highlighted that the agency’s argument is based on the notion that ADA is a security due to IOHK’s efforts to enhance the Cardano blockchain and released blogs. Meanwhile, Bill stressed that updating the community about product improvements does not make that product a security. He added that this principle should apply to the continuous progress made within the Cardano Blockchain. Furthermore, the SEC&#8217;s accusations mainly focus on trading ADA on Coinbase after it was listed in March 2021, rather than the initial coin offering (ICO) that occurred four years earlier, Morgan added.  Cardano Founder And Ripple CTO Respond To Recent Developments Cardano founder Charles Hoskinson and Ripple’s CTO David Schwartz have weighed in on Morgan’s arguments, providing insight into the recent events. Hoskinson shed light on the ADA&#8217;s Initial Coin Offering (ICO) situation, providing much-need clarification to crypto enthusiasts. He highlighted that the ADA’s ICO took place in Japan and did not entail the direct selling of ADA tokens but instead utilizing vouchers, targeted marketing, and pricing in Yen and Bitcoin. Notably, Americans did not participate in the ICO, and Charles confirmed that the only purchase made by US citizens were exclusively related to secondary sales that occurred four years after the ICO.  However, this means that Americans acquired ADA solely through the secondary market and were not directly involved or connected to the original ICO in Japan. In response to Hoskinson, Morgan added that based on the SEC&#8217;s location and nature of the operation, its power does not cover the ICO. He emphasized that, despite this reality, the agency claims that ADA &#8220;became&#8221; security solely because it became available on US-based exchanges. Morgan criticized the illogical nature of this argument. Ripple&#8217;s CTO, David Schwartz, also entered the conversation, drawing attention to the SEC&#8217;s perspective on ICO transactions and subsequent sales.  According to Schwartz; I guess their argument must be the ICO was a securities offering, just not an SEC issue because of no US nexus. But then I thought it was their position that secondary sales were exempt. The ICO transactions didn&#8217;t take place on exchanges. So what&#8217;s the investment contract? Featured image from Pixabay and chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T15:30:14.000Z",
    "title": "Chainlink price prediction; Polkadot and Collateral Network remain investor favorites",
    "url": "https://www.crypto-news-flash.com/chainlink-price-prediction-polkadot-and-collateral-network-remain-investor-favorites/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-price-prediction-polkadot-and-collateral-network-remain-investor-favorites",
    "description": "Investors in the cryptocurrency market are closely monitoring the performance of various tokens, including Chainlink (LINK), Polkadot (DOT), and Collateral Network (COLT). With Collateral Network currently in its presale phase, anticipation is high for its disruptive lending platform. Find out more below.  &#62;&#62;BUY COLT TOKENS NOW&#60;&#60; Chainlink (LINK) Latest Trend Chainlink is a decentralized oracle [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T15:28:35.000Z",
    "title": "Bored Pepe VIP Club (BPVC) Is Now Available for Trading on LBank Exchange",
    "url": "https://www.crypto-news-flash.com/bored-pepe-vip-club-bpvc-is-now-available-for-trading-on-lbank-exchange/?utm_source=rss&utm_medium=rss&utm_campaign=bored-pepe-vip-club-bpvc-is-now-available-for-trading-on-lbank-exchange",
    "description": "Road Town, BVI, June 12th, 2023, Chainwire LBank Exchange, a global digital asset trading platform, listed Bored Pepe VIP Club (BPVC) on Jun 12, 2023. For all users of LBank Exchange, the BPVC/USDT trading pair is now officially available for trading at 10:00 UTC on Jun 12, 2023. Bored Pepe Vip Club is a Coin [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T15:14:55.000Z",
    "title": "Twitter CEO Elon Musk’s Mysterious Tweet Mentions DOGE: Will Dogecoin’s Price Finally Catch the Bullish Wave and Rise to $0,10?",
    "url": "https://www.crypto-news-flash.com/twitter-ceo-elon-musks-mysterious-tweet-mentions-doge-will-dogecoins-price-finally-catch-the-bullish-wave-and-rise-to-010/?utm_source=rss&utm_medium=rss&utm_campaign=twitter-ceo-elon-musks-mysterious-tweet-mentions-doge-will-dogecoins-price-finally-catch-the-bullish-wave-and-rise-to-010",
    "description": "Elon musk, the current CEO of Twitter, and a well-known Dogecoin supporter has made a cryptic tweet centering on the memecoin. While market participants expect Dogecoin to react positively by skyrocketing in price, the asset is still trading in the red zone.  Billionaire Elon Musk, who also holds the position of Chief executive officer at [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-12T15:20:00.000Z",
    "title": "Coinbase CLO Comments on UK’s Rishi Sunak’s Crypto Stance",
    "url": "https://coinedition.com/coinbase-clo-comments-on-uks-rishi-sunaks-crypto-stance/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Coinbase_CLO_Says_US_is_Settling_for_Bring_Back_Crypto_Act_of_2050-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Coinbase_CLO_Says_US_is_Settling_for_Bring_Back_Crypto_Act_of_2050-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Coinbase_CLO_Says_US_is_Settling_for_Bring_Back_Crypto_Act_of_2050-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Coinbase_CLO_Says_US_is_Settling_for_Bring_Back_Crypto_Act_of_2050.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>UK prime minister Rishi Sunak recently stated on a16z’s expansion to the UK that the country should embrace innovations like Web3 and blockchain technology. Sunak’s statement attracted the attention of Coinbase chief legal officer Paul Grewal. Grewal sarcastically stated in one of his recent tweets that the US is likely to settle for the ‘Bring [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coinbase-clo-comments-on-uks-rishi-sunaks-crypto-stance/\">Coinbase CLO Comments on UK’s Rishi Sunak’s Crypto Stance</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]