[
  {
    "source": "CoinDesk",
    "date": "2023-07-20T09:01:57.000Z",
    "title": "Proposed Legal Reforms Aid UK Crypto Dreams – but Offer Scant Hope for Bitcoin Developers Sued by Craig Wright",
    "url": "https://www.coindesk.com/policy/2023/07/20/proposed-legal-reforms-aid-uk-crypto-dreams-but-offer-scant-hope-for-bitcoin-developers-sued-by-craig-wright/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A new Law Commission report doesn’t address legal concerns beyond token ownership, lawyers told CoinDesk."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-20T09:05:59.000Z",
    "title": "Conflux partners with WorldMobile as WMT token bridges outside of Cardano, CFX up 3%",
    "url": "https://cryptoslate.com/coinflux-partners-with-worldmobile-as-wmt-token-bridges-outside-of-cardano-cfx-up-3/",
    "description": "<p>A new partnership between Conflux Network (CFX), China&#8217;s first regulatory-compliant public blockchain, and World Mobile, a global mobile network based on blockchain, aims to expand blockchain-based mobile access. The collaboration follows the successful launch of Conflux&#8217;s BSIM, which saw its CFX token surge over 100%. It focuses initially on four key strategic areas: Public bridging, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/coinflux-partners-with-worldmobile-as-wmt-token-bridges-outside-of-cardano-cfx-up-3/\">Conflux partners with WorldMobile as WMT token bridges outside of Cardano, CFX up 3%</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-20T08:46:47.000Z",
    "title": "XRP’s Bullish Breakout Above ‘Cloud’ Resistance: A Positive Omen for Bitcoin?",
    "url": "https://www.cryptoglobe.com/latest/2023/07/xrps-bullish-breakout-above-cloud-resistance-a-positive-omen-for-bitcoin/",
    "description": "Recently, XRP has made a significant stride, setting a positive precedent for Bitcoin, the market leader. According to a CoinDesk report published on 20 July 2023, XRP, a digital asset primarily used for payments, has seen a huge surge in the past week, marking its best performance since August 2021. This surge has apparently propelled […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-20T09:05:00.000Z",
    "title": "Chinese Authorities Bust $55M USDT Money Laundering Scheme",
    "url": "https://cryptodaily.co.uk/2023/07/chinese-authorities-bust-55m-usdt-money-laundering-scheme",
    "description": "<p>Enforcement authorities in China&rsquo;s northern province of Shanxi have uncovered an alleged USDT money laundering scheme amounting to over $55 million.</p>\n<p>According to local news reports, the police have arrested 21 individuals in connection with the money laundering ring.</p>\nA Major Bust\n<p>The laundering operation came to light when authorities in Qinshui County observed that a bank account operated under the name of Mouyue Zhao had a highly erratic flow of funds. This abnormal flow of funds sparked suspicions of money laundering, leading to the police launching a thorough investigation. The investigation revealed staggering details about how an organized group of criminals had been orchestrating an over-the-counter (OTC) trading ring involving USDT since October 2021, according to a report by China&rsquo;s national broadcasting service.</p>\n<p>USDT is the world&rsquo;s largest stablecoin and has its value pegged to the US Dollar. It is operated by Tether Limited Inc.</p>\nModus Operandi&nbsp;&nbsp;\n<p>Investigators revealed that the accused individuals operated across four provinces, purchasing USDT at a low price and then selling it at higher prices through WeChat groups and money laundering platforms and making significant illegal profits. Authorities stated that the laundering operation had completed transactions totaling nearly $55 million over the nearly three-year period of their operations.</p>\n<p>Authorities were able to track down members of the operation across six cities in the provinces of Jiangxi, Henan, Guangxi, and Anhui. Over 50 officers were dispatched to arrest the perpetrators. Along with the arrests, the police also seized over 40 mobile phones, along with 200,000 yuan ($28,000) in cash and over 1 million yuan worth of USDT ($140,000).</p>\nSuspects Confess\n<p>The suspects were interrogated by the authorities and, according to local news agencies, have confessed to the accusations made against them. The accusations include facilitating the conversion of the Chinese Yuan to USDT and helping criminals launder their money. However, the case is still open and remains under investigation. According to the authorities, USDT has quickly become a preferred choice for crypto money launderers thanks to the ease and anonymity that it offers.</p>\nChina&rsquo;s Stance On Crypto\n<p>China has historically taken a tough stance against crypto. However, the country&rsquo;s stance comes as no surprise to long-time observers of the crypto space. Chinese citizens first caught wind of cryptocurrencies in 2011 thanks to the centralized exchange Bitcoin China, set up by Bobby C. Lee. Bobby C. Lee is the brother of Litecoin&rsquo;s Charlie Lee. During the early days of Bitcoin, Bitcoin China was responsible for a significant chunk of the global Bitcoin trading activity.</p>\n<p>Bitcoin soon became widely accepted in China, with businesses beginning to accept it as payment. However, 2013 saw China&rsquo;s first attempt at stifling the crypto space in the country, even though Bitcoin adoption was skyrocketing, with the People&rsquo;s Bank of China prohibiting banks from holding or transacting in digital currencies. However, Chinese citizens could still buy, send, and store crypto. During the 2017 bull run, Chinese authorities put further sanctions on the crypto space, outlawing all platforms offering ICOs (Initial Coin Offerings). Additionally, authorities also forced several exchanges to shut down operations.</p>\n<p>In 2021, Chinese officials banned crypto mining, effectively crippling the industry in China. The impact on the markets was severe, with Bitcoin&rsquo;s hash rate falling to 50% and its price registering a dramatic drop. Along with the ban on mining, authorities also outlawed all crypto trading and transactions. Additionally, anyone working with Chinese firms associated with the crypto space could potentially face jail time. However, despite all these hurdles, Chinese citizens can still access cryptocurrencies through proxy internet servers and decentralized finance (DeFi) platforms.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-20T09:00:28.000Z",
    "title": "Conflux And World Mobile Join Forces To Expand Blockchain-based Mobile Access",
    "url": "https://cryptodaily.co.uk/2023/07/conflux-and-world-mobile-join-forces-to-expand-blockchain-based-mobile-access",
    "description": "<p>Toronto, Canada, July 20th, 2023, Chainwire</p><p>Conflux Network, the first regulatory-compliant public blockchain in China, has today announced a new collaboration with World Mobile, the only global mobile network built on the blockchain.&nbsp;</p><p>The partnership comes on the heels of the successful launch of the Conflux BSIM card earlier this year and will see the two companies work together initially in four areas:</p><p>1) Public Bridging&nbsp;</p><p>World Mobile Token (WMT) will bridge from Cardano blockchain into the Conflux blockchain ecosystem and will be the first bridge outside the Cardano ecosystem for the mobile network&rsquo;s native token.&nbsp;</p><p>2) Tech Integration&nbsp;</p><p>World Mobile and Conflux will collaborate on the technical integration of the Conflux network into World Mobile's sidechain, AyA,&nbsp;bringing EarthNode capabilities and financial settlement to the Conflux network.</p><p>3) Asian and African Market Expansion&nbsp;</p><p>Conflux and World Mobile enjoy a strong presence in the Asian and African markets, respectively. The two businesses will work together to leverage these strengths to increase connectivity, drive user acquisition and further market penetration in key markets. Conflux&rsquo;s CFX now ranks top 3 in most popular crypto currencies in Nigeria.&nbsp;This is especially relevant as Nigeria holds nearly 67% of crypto interest in Africa. World Mobile has recently concluded successful field tests of its hybrid dynamic network in Nigeria, following a successful commercial launch in Zanzibar earlier this year.&nbsp;</p><p>4) Blockchain-based SIM card development</p><p>World Mobile and Conflux will collaborate on how the mobile network can best utilize Conflux&rsquo;s blockchain-based SIM card to increase access to digital connectivity across the world.</p>YuanJie Zhang, Co-Founder of Conflux, said of the partnership: &ldquo;Conflux Network takes its mission to push the frontier of Web3 adoption at a low cost, with fast speed and decentralized security very seriously. One important strategy is to promote collaboration with telecommunication service providers all over the world. World Mobile is the next significant partner Conflux brings on board after China Telecom. Together, affordable and applicable blockchain technology is bridged beyond Asia to the rest of the world.&rdquo;Zachary Vann, Head of Token, World Mobile Token added: &ldquo;We are excited to work with Conflux to build a more connected and inclusive future. This partnership will accelerate our market expansion in Asia and to provide connectivity globally. The Conflux network has a unique, regulatory-compliant blockchain, and the world's first blockchain-based sim cards bring many opportunities to our mobile network and our AyA chain. This is our most significant partnership to expand our network and sharing economy into the Asian markets and beyond.&rdquo;<p>About Conflux</p><p>Conflux Network is a permissionless Layer 1 blockchain connecting decentralized economies across borders and protocols. Recently migrated to hybrid PoW/PoS consensus, Conflux provides a fast, secure, and scalable blockchain environment with zero congestion, low fees, and improved network security.</p><p>As the only regulatory-compliant public blockchain in China, Conflux provides a unique advantage for projects building and expanding into Asia. Conflux has collaborated with global brands and government entities in the region on blockchain and metaverse initiatives, including the city of Shanghai, McDonald&rsquo;s China, and Oreo.</p><p class=\"ql-align-justify\">Learn more: https://confluxnetwork.org/</p><p>About World Mobile</p><p>World Mobile was founded with a far-reaching goal: to connect everyone, everywhere while advocating for economic freedom and dignity. Unlike traditional mobile networks, World Mobile is based on blockchain and incentivizes people to be part of a sharing economy that taps into the trillion dollar global telecom market. Individuals and business owners around the world can operate nodes on its network and bring their community online while earning revenue.</p><p>Learn more: https://worldmobile.io/</p>ContactMelissa TireyShift6 Studiosmelissa@shift6studios.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-20T09:00:52.000Z",
    "title": "Bitboy Predicts XRP Will Soar To $35 On Heels Of Ripple IPO",
    "url": "https://www.newsbtc.com/news/ripple/bitboy-predicts-xrp-will-soar-to-35-on-heels-of-ripple-ipo/",
    "description": "In a recent tweet, Ben &#8220;BitBoy&#8221; Armstrong, a controversial figure in the crypto community, stirred discussions with a noteworthy projection for the future price of XRP. The excitement began when Evan Luthra, an angel investor and Forbes 30 under 30 award winner, tweeted, &#8220;XRP just surpassed BTC trading volume. It&#8217;s now the highest trading crypto asset. What&#8217;s your price target for Ripple?&#8221; Will XRP Rise to $35? BitBoy&#8217;s response can be classified as very bold when he said &#8220;$15 is reasonable, I think over 18 months or so. If they IPO and time it right, could be up to $35 imo. At the heart of Armstrongs projection is his belief in the long-term growth potential of XRP, with the projected price of $15 signifying a whopping 1,720% increase from its current price. This optimism may be bolstered by the recent legal victory by Ripple which has provided some clarity for XRP. Remarkably, BitBoy&#8217;s enthusiasm didn&#8217;t stop at $15, as he suggested that XRP&#8217;s price could potentially reach $35 if Ripple proceeds with an Initial Public Offering (IPO) and times it strategically. Achieving this target would necessitate a staggering surge of 4,200%. Related Reading: XRP Maintains Bullish Run With Nearly 80% Rally – Is $1 Within Reach? The rumors about an upcoming IPO of Ripple are not new. CEO Brad Garlinghouse hinted at the possibility already before the SEC lawsuit. It&#8217;s likely the agency threw a wrench in the company&#8217;s plans. Nevertheless, it is crucial to approach such forecasts with caution, as BitBoy himself acknowledged the inherent unpredictability of the crypto market. Cryptocurrencies are renowned for their price volatility and susceptibility to various external factors, making accurate predictions a challenging task. BityBoy added: Make no mistake… it may not go that high… but XRP IS breaking an all time high this cycle save some sort of pointless, vindictive SEC appeal. (Low chance) Also, the influencer&#8217;s optimistic outlook on XRP&#8217;s potential is not entirely new. In April, he had already identified XRP as his top altcoin pick for the next bull run, contingent on a favorable outcome in the SEC lawsuit. A positive resolution would provide the asset with much-needed legal and regulatory clarity, potentially acting as a further catalyst for growth. Related Reading: Bitcoin, XRP, &#38; Ethereum: Three Top Coins On Brink Of Golden Cross In another tweet the influencer reacted to a Twitter user who stated &#8220;Everything is breaking ATH this cycle.&#8221; Armstrong answered that he doesn’t think so, revealing his picks for such altcoins, “Solana, Dogecoin, Shiba all potentially on that list. Previous top 10 coins that didn’t make new ath’s last cycle: NEM, NEO, Dash, BCH, XRP (for good reason) etc. Don’t fall into the same trap I did last cycle. Everything doesn’t perform.&#8221; Armstrong Is Not Without Controversy David Schwartz, Chief Technology Officer (CTO) of Ripple, called the BEN coin project a 100% rug pull two months ago. In response to a tweet, Schwartz wondered if the rug pull would happen in the future or if Bitboy&#8217;s involvement in the project was a rug pull. Schwartz concluded that he believed in both scenarios: Do you think the rug will be pulled in the future? Or do you think Bitboy joining the team is itself a rug pull? Because I definitely agree with either one. In addition, BitBoy was accused of defrauding or misleading his 1.44 million YouTube subscribers in 2022, as several pieces of evidence surfaced suggesting that he did not disclose the paid advertising content in his videos. At press time, the XRP price stood at $0.8219, up 4.6% in the last 24 hours. Featured image from Exness, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-20T09:08:51.000Z",
    "title": "Solana Foundation Leads $30M Funding Round for Web3 Startup Cosmic Wire",
    "url": "https://www.crypto-news-flash.com/solana-foundation-leads-30m-funding-round-for-web3-startup-cosmic-wire/?utm_source=rss&utm_medium=rss&utm_campaign=solana-foundation-leads-30m-funding-round-for-web3-startup-cosmic-wire",
    "description": "<img width=\"1280\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Solana-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Solana-1.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Solana-1-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Solana-1-1024x576.jpg 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />This successful funding round serves as a reaffirmation of Cosmic Wire&#8217;s unwavering dedication to connecting creators, businesses, and industries globally. According to the Solana price prediction, SOL cryptocurrency has positive momentum, indicating a potential surge toward the $40 mark on the charts. In a seed funding round that secured $30 million, Cosmic Wire, a Web3 [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-20T09:00:41.000Z",
    "title": "Compound and Polygon Price Shows Bullish Patterns, Can It Match Tradecurve’s 80% Rise?",
    "url": "https://www.crypto-news-flash.com/compound-and-polygon-price-shows-bullish-patterns-can-it-match-tradecurves-80-rise/?utm_source=rss&utm_medium=rss&utm_campaign=compound-and-polygon-price-shows-bullish-patterns-can-it-match-tradecurves-80-rise",
    "description": "<img width=\"720\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/WWWWW.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/WWWWW.png 720w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/WWWWW-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/WWWWW-104x69.png 104w\" sizes=\"(max-width: 720px) 100vw, 720px\" />The crypto market is on its path to recovery after a market sell-off that occurred during the previous months. Two altcoins that saw a significant surge in their value are Compound (COMP) and Polygon (MATIC). However, despite their bullish patterns, another altcoin surged by 80% &#8211; Tradecurve. Analysts are now analyzing all three altcoins to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-20T09:00:34.000Z",
    "title": "Conflux And World Mobile Join Forces To Expand Blockchain-based Mobile Access",
    "url": "https://www.crypto-news-flash.com/conflux-and-world-mobile-join-forces-to-expand-blockchain-based-mobile-access/?utm_source=rss&utm_medium=rss&utm_campaign=conflux-and-world-mobile-join-forces-to-expand-blockchain-based-mobile-access",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-18_124554_16896987885OpXCUZNDK.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-18_124554_16896987885OpXCUZNDK.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-18_124554_16896987885OpXCUZNDK-300x180.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-18_124554_16896987885OpXCUZNDK-1024x614.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/photo_2023-07-18_124554_16896987885OpXCUZNDK-768x461.jpeg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Toronto, Canada, July 20th, 2023, Chainwire Conflux Network, the first regulatory-compliant public blockchain in China, has today announced a new collaboration with World Mobile, the only global mobile network built on the blockchain.  The partnership comes on the heels of the successful launch of the Conflux BSIM card earlier this year and will see the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-20T08:41:36.000Z",
    "title": "Twitter CEO Elon Musk Pushes Dogecoin as DOGE Breaks Through Key Resistance – Is $0.10 Price Target Achievable in July? Report",
    "url": "https://www.crypto-news-flash.com/twitter-ceo-elon-musk-pushes-dogecoin-as-doge-breaks-through-key-resistance-is-0-10-price-target-achievable-in-july-report/?utm_source=rss&utm_medium=rss&utm_campaign=twitter-ceo-elon-musk-pushes-dogecoin-as-doge-breaks-through-key-resistance-is-0-10-price-target-achievable-in-july-report",
    "description": "<img width=\"512\" height=\"362\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/unnamed-2023-06-15T165742.173.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Elon Musk Denies Dogecoin Wallet Ownership Amid Insider Trading Lawsuit\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/unnamed-2023-06-15T165742.173.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/unnamed-2023-06-15T165742.173-300x212.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Dogecoin (DOGE) surged approximately 4% following a tweet mention by Elon Musk, the CEO of Tesla and Twitter.  Speculation arises regarding Musk&#8217;s interest and potential influence on DOGE, as markets react quickly to his comments. According to cross reports by Fortune and Finance Yahoo, Dogecoin (DOGE) experienced a sudden surge of about 4% within minutes [...]"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-07-20T08:49:16.000Z",
    "title": "Mobile App Change Log 6.5",
    "url": "https://blog.bitfinex.com/mobile-app/mobile-app-change-log-6-5/",
    "description": "<p>Recent updates and optimisations to the Bitfinex mobile app We’re pleased to present Version 6.5 of the Bitfinex mobile app. The latest update to the Bitfinex mobile app includes general improvements. iOS Android You can also download the latest version of the Bitfinex mobile app...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/mobile-app/mobile-app-change-log-6-5/\">Mobile App Change Log 6.5</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-07-20T08:40:23.000Z",
    "title": "Change Log: Version 1.76",
    "url": "https://blog.bitfinex.com/changelogs/change-log-version-1-76/",
    "description": "<p>The Bitfinex Change Log is an overview of all performance and UI changes made to the Bitfinex trading platform. For an overview of all previous changes, please refer to blog.bitfinex.com/category/changelogs. Version 1.76 Features Addition of P2P Market Place fees on the Fees page Improvements Updated...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/changelogs/change-log-version-1-76/\">Change Log: Version 1.76</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]