[
  {
    "source": "NewsBTC",
    "date": "2023-11-05T15:00:07.000Z",
    "title": "This ‘Smart’ Whale Buys ETH Again – Could There Be An Incoming Price Surge?",
    "url": "https://www.newsbtc.com/analysis/eth/this-smart-whale-buys-eth-again-could-there-be-an-incoming-price-surge/",
    "description": "In the last week, Ethereum (ETH) has attracted many investors&#8217; attention as it gradually approaches the $1900 price region. Similar to many assets riding on the Bitcoin-fueled market rally, ETH, also known as Ether, is up by 5.85% in the last seven days, bringing its total price increase in the last four weeks to 15.17%. Interestingly, a recent whale movement has now added more speculation around ETH, prompting suggestions that the largest altcoin may soon experience a price surge. Related Reading: ETH Sent To Exchanges Climbs Above 500,000, Is Ethereum At $2,000 Still Possible? &#8216;Smart&#8217; Whale Purchases $15.94 Million Ether &#8211; What Could They Know? In a Sunday post on X, blockchain analytics platform Lookonchain shared that an ETH whale with the wallet address “0xb15” had just purchased 8,698 ETH, valued at $15.94 million, from the Binance exchange, depositing 31.8 million USDT in the process. This transaction has drawn much attention due to the past antecedents of this Ether investor. Popularly known as a &#8220;smart&#8221; whale, Lookonchain notes that “0xb15” has conducted 8 ETH transactions since February 12, recording a win rate of 87.5% and an aggregate profit of $13 million.  In particular, this smart whale is known for buying low and selling high. Most recently, they deposited 24,495 ETH ($45 million) on Binance on November 2, shortly after purchasing 24,548 ETH, valued at $39.8 million, leading to a profit margin of approximately $5.47 million. Following the purchase made by “0xb15” on Sunday, many traders are likely on high alert as it indicates the whale is anticipating a continuous rise in Ether&#8217;s price over the next few days.  Looking at Ether&#8217;s daily chart, the altcoin is poised to break into the $1900 price zone if this buying pressure continues. However, investors should note the token’s Relative Strength Index (RSI) is now at 71.43, indicating it is now in the overbought zone and may experience a trend reversal.  Related Reading: ProShares Goes Short On Ethereum With New ETF Launch ETH Market Records Largest CEXs Weekly Outflow Since August In other news, centralized exchanges (CEXs) just recorded an outflow of $210 million worth of Ether in the last seven days, according to data from IntotheBlock. This marks the altcoin’s largest weekly outflow off CEXs since August. This data only reflects the strong bullish sentiment surrounding the ETH market, as a reduction in the token’s supply on exchanges reflects an increase in purchasing activity by investors.  At the time of writing, Ether is trading at $1890.95, with a 2.61% gain in the last day. However, the token’s daily trading volume is down by 11.485 and valued at $6.02 billion. With a market cap of $227.4 billion, Ethereum remains the second-largest cryptocurrency in the world.  ETH trading at $1,896.73 on the daily chart &#124; Source: ETHUSDT chart on Tradingview.com Featured image from iStock, chart from Tradingview"
  }
]