[
  {
    "source": "Decrypt",
    "date": "2023-11-22T21:49:32.000Z",
    "title": "Binance Moved $3.9B in Tether From Cold Wallet Days Ahead of DOJ Settlement",
    "url": "https://decrypt.co/207141/binance-4-billion-tether-cold-wallet-doj-settlement",
    "description": "It’s unclear if the Tether transfer is related to the Binance settlement, but the timing and amount of the move is enough to raise eyebrows."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-22T21:55:13.000Z",
    "title": "Why is Bitcoin price up today?",
    "url": "http://cointelegraph.com/news/why-is-bitcoin-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2022-10/2975699c-abdd-4f7b-bd35-74267a570117.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin price is up today as the crypto community interprets Binance’s resolution with the DOJ as a bullish outcome.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price is up today, rebounding from the Nov. 21 correction to $35,651 and hitting an intra-day high of $37,431. The rally comes after <a href=\"https://cointelegraph.com/news/btc-price-bounces-3-post-binance-bitcoin-bulls-step-in\">Bitcoin price</a> bounced 3% as traders digested Binance’s settlement with the U.S. Department of Justice (DOJ). The settlement has reignited hype around traders’ belief that a spot BTC exchange-traded fund (<a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-nasdaq-clearing-firm\">ETF</a>) will be approved soon and that this will bring significant inflows to Bitcoin, pushing prices across the crypto market higher. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/2689fc88-ebe7-44ea-a4d9-ba7b15c91607.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin price. Source: </em><a href=\"https://www.tradingview.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>Let’s look into the reasons why Bitcoin price is up today. </p><h2>The Binance saga ends with a settlement  </h2><p>Initially, Bitcoin price <a href=\"https://cointelegraph.com/news/crypto-markets-mixed-as-traders-digest-doj-action-against-binance-cz\">flashed mixed signals</a> after Changpeng “CZ” Zhao’s guilty plea and the DOJ’s $4.3 billion settlement with Binance. After taking some time to digest the outcome, the market began to notice the Binance exchange was not having a mass exodus of funds like FTX did when its liquidity crisis first became public.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Here&#39;s our latest update on <a href=\"https://twitter.com/binance?ref_src=twsrc%5Etfw\">@binance</a>, 12 hours after our previous one<br><br>At the time of writing, withdrawals are continuing, and we&#39;re not seeing a mass exodus of funds<br><br>Over the past hour on Ethereum, Binance has a $17M negative netfow (more leaving the exchange than what&#39;s… <a href=\"https://t.co/yQPtMl5ue8\">pic.twitter.com/yQPtMl5ue8</a></p>&mdash; Nansen  (@nansen_ai) <a href=\"https://twitter.com/nansen_ai/status/1727288174861266972?ref_src=twsrc%5Etfw\">November 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Despite the DOJ settlement, Binance’s Bitcoin reserves are only down 17% from their all-time high. By comparison, FTX BTC reserves were depleted by 99.9% from the all-time high when the exchange experienced a run on the bank in November 2022.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/94529066-e465-440b-ae1e-eb330112a449.png\"  /><figcaption style=\"text-align: center;\"><em>Exchanges’ Bitcoin reserves compared to all-time highs. Source: CryptoQuant</em></figcaption></figure><p>While Binance’s Bitcoin reserves are their lowest since 2017, they maintain the largest amount of BTC compared to other centralized exchanges.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Binance?src=hash&amp;ref_src=twsrc%5Etfw\">#Binance</a> Bitcoin reserve analysis after the settlement with the DOJ.<br>Is better to make analysis of reserves in relative terms.<br><br>1. Reserves, which were already declining, are now down 17% from their previous all-time-high, the lowest since 2017.<br><br>2. However, Binance’s Bitcoin… <a href=\"https://t.co/lpY2u65V5p\">pic.twitter.com/lpY2u65V5p</a></p>&mdash; Julio Moreno (@jjcmoreno) <a href=\"https://twitter.com/jjcmoreno/status/1727336816498323587?ref_src=twsrc%5Etfw\">November 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Potential spot BTC ETF approval boosts market sentiment </h2><p>Despite a bevy of macro headwinds, Bitcoin price continues to push higher, achieving a 124% year-to-date gain with <a href=\"https://cointelegraph.com/news/how-low-can-the-bitcoin-price-go\">volatility</a> increasing. Some Bitcoin analysts believe the <a href=\"https://cointelegraph.com/news/binance-cz-settlement-us-doj-bullish-bitcoin-etf-crypto-community-says\">Binance and DOJ</a> settlement is bullish for spot Bitcoin ETF approval, noting a similar deal achieved by Arthur Hayes and BitMex. </p><p>The Bitcoin Fear and Greed index remained in the “Greed” cohort, showing sustained elevated market sentiment versus last month. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/95680e40-fbd5-41a9-882f-6582d34b27be.png\"  /><figcaption style=\"text-align: center;\"><em>Fear and Greed Index. Source: Alternative.me</em></figcaption></figure><p>After a rush of spot <a href=\"https://cointelegraph.com/news/bitcoin-price-holds-as-institutional-investor-boosts-sentiment\">Bitcoin ETF amendments</a> in mid-October, the Securities and Exchange Commission (<a href=\"https://cointelegraph.com/news/bitcoin-etf-approval-window-sec-bloomberg-analysts\">SEC</a>) has refused to approve a spot Bitcoin ETF despite numerous applicants, including <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">BlackRock</a>, Fidelity, <a href=\"https://cointelegraph.com/news/third-time-s-the-charm-ark-and-21shares-again-file-with-sec-for-bitcoin-etf\">ARK</a> Invest and 21Shares. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-substance-abuse-traders-trading/\"><strong><em>This is your brain on crypto: Substance abuse grows among crypto traders</em></strong></a></p><p>After delaying approvals on a Nov. 17 deadline, the SEC’s next deadline is Jan. 10. Both <a href=\"https://cointelegraph.com/news/grayscale-meets-sec-to-discuss-bitcoin-trust\">Grayscale</a> and <a href=\"https://cointelegraph.com/news/blackrock-sec-spot-bitcoin-etf-discussion\">BlackRock</a> executives met with the SEC on Nov. 20 to discuss spot Bitcoin ETF approval.</p><p>According to reports, an approval may <a href=\"https://cointelegraph.com/news/bitcoin-etfs-600-billion-tipping-point-crypto\">generate $600 billion</a> in new demand. CryptoQuant analysts believe that an ETF approval will lead to a $1 trillion increase in Bitcoin’s <a href=\"https://cointelegraph.com/tags/market-capitalization\">market capitalization</a>.</p><p>Galaxy Digital predicts a 74% <a href=\"https://cointelegraph.com/news/galaxy-digital-soaring-bitcoin-price-increase-after-etf-launch\">price increase</a> in the first year after a spot BTC ETF launch. </p><h2>Institutional inflows surpass $1 billion</h2><p>While some investors may be awaiting increased liquidity from approved ETFs, institutional investors have already begun deploying funds to Bitcoin and crypto. According to CoinShares, institutional investors have pushed more than $1 billion into crypto in the past year.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/rethinking-bitcoin-dominance-51-misleading-metric\"><strong><em>Rethinking Bitcoin ‘dominance’ at 51% — A misleading metric?</em></strong></a></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/f7ab7f8a-c1ec-46d4-9e7f-16706e03e273.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto asset institutional investor inflow. Source: CoinShares</em></figcaption></figure><p>Of the $1 billion pushed to crypto assets last year, over $240 million has flowed to <a href=\"https://cointelegraph.com/news/crypto-product-inflows-amid-excitement-bitcoin-etf\">Bitcoin</a> specifically. In the past week, $155 million of institutional inflow was for Bitcoin alone.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/why-is-bitcoin-price-up-today&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-22T22:00:52.000Z",
    "title": "Whale Alert: Big Players Scoop Up These 4 Altcoins, On-Chain Data Indicates",
    "url": "https://www.newsbtc.com/altcoin/whale-alert-big-players-scoop-up-these-4-altcoins/",
    "description": "The transactions of &#8216;whales&#8217; – large-scale investors – often set the tone for market trends. So far, recent on-chain data from Lookonchain, a renowned on-chain analytics platform, has unveiled a notable accumulation pattern in four specific altcoins. Maker (MKR), ssv.network (SSV), Coin98 (C98), and RSS3 have emerged as the latest targets of these accumulative efforts. The data shows a series of substantial withdrawals of altcoins from Binance, a leading crypto exchange, hinting at a growing interest in these altcoins among heavyweight investors. Notably, this trend of whale accumulation is not just a fleeting occurrence but a concerted effort that has been unfolding over recent months. Related Reading: Crypto Whales’ Big Bet: An Examination Of Their 3 New Altcoin Targets Diving Deep Into Whale Transactions: A Closer Look at the Accumulated Altcoins The analysis by Lookonchain reveals intriguing details about the accumulated assets. A new wallet, identified as “0xB4aE”, mainly made waves by withdrawing 10 million RSS3 tokens, valued at approximately $1.44 million, from the OKX exchange. This transaction underscores the growing interest in RSS3, a lesser-known crypto asset. In parallel, another prominent wallet, dubbed “0xb6a7”, substantially withdrew 114,227 SSV tokens from Binance, amounting to a value of about $1.93 million. 1/ We noticed that whale/fresh wallets are accumulating $MKR, $SSV, $C98 and $RSS3.👇 pic.twitter.com/AOIlNTVyux — Lookonchain (@lookonchain) November 22, 2023 This same investor also transferred 2.77 million C98 tokens from Binance, signaling a bullish stance on these specific altcoins. It is worth noting that these transactions exemplify the strategic moves by whales, often aimed at leveraging market dynamics to their advantage. The Maker (MKR) Movement: Whale “0x9e74 Leads the Charge One of the most significant players in this scenario is the whale wallet “0x9e74”. Since July 2023, this investor has consistently withdrawn Maker (MKR) tokens from Binance, totaling roughly 4,776 MKR. The most recent transaction involved moving $1.7 million worth of MKR from the exchange, bringing the total worth of MKR withdrawn by this investor to about $6.9 million. This consistent and targeted accumulation of MKR suggests a strong confidence in the future of this particular altcoin. The Maker token, part of the MakerDAO ecosystem, has been a subject of interest, mainly due to its role in decentralized finance (DeFi) as a lender. These large-scale movements by whales underscore a broader trend within the crypto world, where informed players are increasingly steering towards altcoins with strong fundamentals and potential for substantial growth. Related Reading: Pumping Altcoins All Have One Thing In Common: Crypto Whale Games Amid the accumulation of the altcoins above by whales, RSS3 and Maker are still the top gainers, with both altcoins seeing a surge in price by 34.8% and 10.7%, respectively, over the past two weeks. The remaining two altcoins, however, have seen slight gains and decline, with SSV seeing a mere 4.8% increase and C98 seeing an 8.6% plunge over the same period. Featured image from iStock Chart from TradingView"
  }
]