[
  {
    "source": "Cointelegraph",
    "date": "2023-06-03T13:01:00.000Z",
    "title": "Is Biden’s controversial Bitcoin mining tax dead or set to rise from the ashes?",
    "url": "https://cointelegraph.com/news/is-biden-s-controversial-bitcoin-mining-tax-dead-or-set-to-rise-from-the-ashes",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/6eaac31a-2d24-4ba5-a133-a1abd8e5186f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>References to the tax were removed from the U.S. debt bill, but that doesn’t mean it’s gone for good.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) miners in the United States can breathe a sigh of relief after a proposed tax on crypto mining <a href=\"https://cointelegraph.com/news/deal-to-avoid-us-debt-default-nixes-proposed-30-crypto-mining-tax-says-ohio-lawmaker\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/deal-to-avoid-us-debt-default-nixes-proposed-30-crypto-mining-tax-says-ohio-lawmaker/amp\">did not make it into a bill</a> to raise the U.S. debt ceiling that appears <a href=\"https://twitter.com/POTUS/status/1664081809909456896\" target=\"_blank\" rel=\"noopener nofollow\">set</a> to pass.</p><p>The Digital Assets Mining Energy (DAME) excise tax proposal sought to charge crypto miners a tax equal to 10% of the cost of the electricity they used for mining in 2024, before scaling up to 30% in 2026.</p><p>The tax was highly controversial, with critics arguing that it had the <a href=\"https://cointelegraph.com/news/would-biden-s-plan-to-tax-crypto-mining-reduce-emissions-critics-say-no\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/would-biden-s-plan-to-tax-crypto-mining-reduce-emissions-critics-say-no/amp\">potential to increase global emissions</a> as a result of miners being forced to go overseas where countries may produce more emissions during energy production.</p><p>Additionally, Bitcoin miners seek out cheap energy, and as one of the cheapest sources of energy is excess renewable energy, Bitcoin miners can actually incentivize its production by providing utilities with a buyer for energy that would otherwise be wasted.</p><p>The news broke after Bitcoin miner Riot Platforms vice president of research Pierre Rochard noted on May 28 that the proposed bill did not include any mention of the DAME tax, which Representative Warren Davidson replied was “one of the victories” of the bill. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Yes, one of the victories is blocking proposed taxes.</p>— Warren Davidson  (@WarrenDavidson) <a href=\"https://twitter.com/WarrenDavidson/status/1663001207651155970?ref_src=twsrc%5Etfw\">May 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>Dead and buried or set to return?</h3><p>While much of the online discussion around the news suggested the proposal was “dead,” others, such as Coin Metrics co-founder Nic Carter, highlighted that it was only temporarily defeated, alluding to the possibility of it being included in future bills.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Bitcoin mining \"DAME\" tax defeated (for now) <br><br>Biden CEA, specifically Heather Boushey, hold this L <a href=\"https://t.co/hJgZ7oUGub\">https://t.co/hJgZ7oUGub</a></p>— nic  carter (@nic__carter) <a href=\"https://twitter.com/nic__carter/status/1663186155846914048?ref_src=twsrc%5Etfw\">May 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Carter <a href=\"https://twitter.com/nic__carter/status/1663191437469712384\" target=\"_blank\" rel=\"noopener nofollow\">suggested</a> later in a May 29 Twitter thread that the administration would likely attempt to sneak it into some omnibus bill and would already have done so if it had the political currency to do so.</p><p>But bills are required to pass both through Congress and the House, and considering the Republican party is generally opposed to increases in taxes and currently controls the House, it seems unlikely such an omnibus bill would be able to make it to the president’s desk.</p><p>While speaking to Chamber of Digital Commerce founder and CEO Perianne Boring during a May 20 fireside chat at the Bitcoin 2023 conference in Miami, Senator Cynthia Lummis <a href=\"https://www.youtube.com/watch?v=Vw-87xDScQc&ab_channel=BitcoinMagazine\" target=\"_blank\" rel=\"noopener nofollow\">assured</a> viewers that the DAME tax “isn’t going to happen.”</p><p>Lummis added that ensuring Bitcoin mining firms remain in the U.S. was important for both national security and energy security, highlighting how Bitcoin mining can both <a href=\"https://cointelegraph.com/news/oil-giant-conocophilips-reduces-gas-flaring-emissions-via-bitcoin-mining\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/oil-giant-conocophilips-reduces-gas-flaring-emissions-via-bitcoin-mining/amp\">reduce gas flaring emissions</a> and help stabilize the energy grid.</p><p>Cointelegraph contacted the White House asking whether it planned to continue pursuing the DAME tax but did not receive a response.</p><h3>Is the damage already done?</h3><p>In response to questions from Cointelegraph, Bitcoin miner Marathon Digital Holdings CEO Fred Thiel suggested that, regardless of whether President Joe Biden’s administration decides to keep pursuing the DAME tax, it will continue its anti-crypto agenda, saying:</p><blockquote>“I think it is clear that this administration will continue to broadly oppose the crypto sector, and even if this specific tax is no longer on the table, it is likely not the last of misguided, targeted efforts to bring this industry down.”</blockquote><p>Many from within the crypto industry and even some U.S. lawmakers agree with this take, arguing that, among other measures, the U.S. government is making a <a href=\"https://cointelegraph.com/news/unwinding-the-hyperbole-are-us-based-crypto-firms-really-being-choked\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/unwinding-the-hyperbole-are-us-based-crypto-firms-really-being-choked/amp\">coordinated effort to discourage banks</a> from working with crypto firms — aka Choke Point 2.0 — under the guise of ensuring the financial system remains stable and safe.</p><p>When businesses make long-term decisions, they generally seek to reduce risk. So, given the choice of operating in a region with clear, crypto-friendly policies compared to one where regulations are unclear, and there is a greater potential for policies that hurt the competitiveness of U.S.-based activity, firms will generally choose the former.</p><p>Thiel highlighted how the actions of the U.S. government and regulators weigh in on business decisions while speaking to Cointelegraph, saying, “Regardless of the DAME tax’s likelihood of passing, Marathon has already begun diversifying the locations of our operations.”</p><p><strong><em>Asia Express: <a href=\"https://cointelegraph.com/magazine/yuan-stablecoin-team-arrested-wechats-new-bitcoin-prices-hk-crypto-rules-asia-express/\">Yuan stablecoin team arrested, WeChat’s new Bitcoin prices, HK crypto rules</a></em></strong></p><p>Thiel added that “with regulation around mining being so nebulous,” his firm has made the strategic decision not to concentrate its footprint in the U.S. but rather diversify its operations.</p><p>He pointed to a May 9 announcement from his firm, which said it would be building <a href=\"https://cointelegraph.com/news/marathon-digital-announces-immersion-crypto-mining-operations-in-abu-dhabi\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/marathon-digital-announces-immersion-crypto-mining-operations-in-abu-dhabi/amp\">two new mining facilities</a> in Abu Dhabi. </p><p>Abu Dhabi is a region that has made a concerted effort to attract crypto-related investment via its <a href=\"https://cointelegraph.com/news/abu-dhabi-regulator-introduces-guiding-principles-for-crypto\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/abu-dhabi-regulator-introduces-guiding-principles-for-crypto/amp\">clear regulatory regime</a>, which has been hailed as pro-market.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-03T13:04:11.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-03T12:49:27.000Z",
    "title": "Polkadot price analysis: DOT race to $5.29 after a bullish revival",
    "url": "https://www.cryptopolitan.com/polkadot-price-analysis-2023-06-03/",
    "description": "The latest Polkadot price analysis shows a bullish market sentiment. In the past 24 hours, DOT prices have increased from $5.22 to $5.30 at the time of writing. Despite trading on a bearish note earlier, buyers have revived the market sentiment by pushing up prices. The markets were much higher during the day, with a ... <a title=\"Polkadot price analysis: DOT race to $5.29 after a bullish revival\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-analysis-2023-06-03/\" aria-label=\"More on Polkadot price analysis: DOT race to $5.29 after a bullish revival\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-03T12:59:14.000Z",
    "title": "Quant Hype Spikes As Price Surges 15% – Is This A Top Signal?",
    "url": "https://www.newsbtc.com/quant-qnt/quant-hype-spikes-as-price-surges-15-is-this-a-top-signal/",
    "description": "Quant (QNT), an Ethereum-based token, has experienced a 15.15% increase in its price over the past seven days. QNT plays a vital role in Quant Network&#8217;s Overledger, a suite of enterprise software solutions designed to connect public blockchains and private networks seamlessly. By enabling the creation of multi-chain decentralized applications (mDapps), Quant Network empowers developers to build and operate applications that span across multiple blockchains simultaneously. With its focus on interoperability, Quant Network&#8217;s Overledger solution provides a framework for bridging different blockchain networks, fostering connectivity and facilitating efficient data exchange between disparate systems. The use of QNT within the Overledger ecosystem not only powers these interoperability capabilities but also plays a crucial role in securing and incentivizing participants within the network. As the price of Quant (QNT) continues its upward trajectory, the growing interest in the token reflects the recognition of its importance in enabling the seamless operation of mDapps and facilitating cross-chain communication. With Quant Network&#8217;s innovative approach to interoperability, the future holds promising possibilities for enhanced collaboration and integration across various blockchain platforms. Related Reading: Injective Protocol (INJ) Tallies 23% Price Surge In Past 7 Days – Here’s Why Why’s There A Strong Bullish Sentiment For QNT?  The recent price surge of Quant (QNT) can be attributed to the transformative power of distributed ledger technology (DLT) and the unique features offered by the Quant platform. DLT, surpassing the limitations of traditional blockchain, provides solutions to unanswered questions, enabling secure and cost-effective asset exchange while driving value, opening new markets, and increasing efficiency for enterprises, governments, and individuals worldwide. Founded in 2015 by Gilbert Verdian, Quant emerged as a pioneer in harnessing the potential of DLT to empower and expedite people&#8217;s lives. As the genesis of Quant, DLT addresses scalability issues by ensuring faster and more affordable transactions, offering a promising alternative to traditional blockchain networks. The unique utility of Quant (QNT) makes it a very interesting project. And, since utility is one of the major factors that affect the growth of a crypto project, it’s no surprise that investors are turning toward QNT. What’s Next For Quant? Quant has caught the attention of investors with its impressive market capitalization of $1,408,329,718 and a notable trading volume of $25,330,831. While it may have been considered the slowest in terms of price movement, Quant has consistently demonstrated growth in the cryptocurrency market.  Related Reading: Floki Inu Gains Momentum As Chinese E-Commerce Giant Recognizes Its Utility The optimistic founders of Quant believe that as a leader in the industry, the mass adoption of Quant holds great promise for its supporters. Currently priced at $116, there is anticipation for Quant&#8217;s value to soar even higher in response to the increasing demand projected in the future. Based on bullish scenarios and analysis of historical data, the price of Quant is expected to experience a significant rise. -Featured image from iStock.com, charts from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-03T12:44:00.000Z",
    "title": "FTX Objects To Mediation Extension Proposal From Genesis Global",
    "url": "https://coinedition.com/ftx-objects-to-mediation-extension-proposal-from-genesis-global/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/FTX-6-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"FTX Objects To Mediation Extension Proposal From Genesis Global\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/FTX-6-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/FTX-6-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/FTX-6-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/FTX-6-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/FTX-6-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/FTX-6.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Bankrupt crypto exchange FTX and its affiliated debtors have filed an objection to Genesis Global Holdco’s proposal to extend its mediation period. With its latest filing in the U.S. Bankruptcy Court for the Southern District of New York, FTX joined more than a dozen parties that are owed by bankrupt crypto lender Genesis. As per [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ftx-objects-to-mediation-extension-proposal-from-genesis-global/\">FTX Objects To Mediation Extension Proposal From Genesis Global</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]