[
  {
    "source": "Crypto Daily",
    "date": "2024-03-30T18:08:17.000Z",
    "title": "In Q2 2024, Expect DeeStream (DST) to Prosper as Ethereum Classic (ETC) and Kusama (KSM) Encounter Headwinds",
    "url": "https://cryptodaily.co.uk/2024/03/in-q2-2024-expect-deestream-dst-to-prosper-as-ethereum-classic-etc-and-kusama-ksm-encounter-headwinds",
    "description": "The crypto market has a total cap of $2.65T, which is a 0.30% increase over the last few days. While we are approaching the end of Q1, Q2 is coming. In 24 days, Bitcoin (BTC) will be halved, and many market token holders will benefit from this market boost. Ethereum Classic (ETC) and Kusama (KSM) have been the latest holders exploring this opportunity."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-30T18:01:49.000Z",
    "title": "Crypto Price Predictions A Look at New Meme Coin Koala Coin (KLC) 2024 - 2025 Forecast",
    "url": "https://cryptodaily.co.uk/2024/03/crypto-price-predictions-a-look-at-new-meme-coin-koala-coin-klc-2024-2025-forecast",
    "description": "Koala Coin (KLC), the new meme coin sensation, has made waves in the crypto community, particularly with its highly anticipated Stage 1 of the presale at $0.014. As we explore the forecast for 2024 - 2025, the enthusiasm surrounding the potential growth of Koala Coin (KLC) and its impact on the market during and after the presale is undeniable."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-30T17:56:21.000Z",
    "title": "Join the Koala Craze, Shiba Inu (SHIB) and Dogecoin (DOGE) Fans Flock to Koala Coin (KLC)",
    "url": "https://cryptodaily.co.uk/2024/03/join-the-koala-craze-shiba-inu-shib-and-dogecoin-doge-fans-flock-to-koala-coin-klc",
    "description": "Crypto enthusiasts, get ready for an adventure with Koala Coin (KLC)! Now available in its presale stage at $0.014, Koala Coin (KLC) is the buzz of the town, drawing in fans from Shiba Inu (SHIB) and Dogecoin (DOGE) communities. This is your chance to join the next big hit in the meme coin saga."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-30T17:51:26.000Z",
    "title": "Stellar (XLM) and Ripple (XRP) Investors Shift to Fezoo (FEZ) Amid Crypto Fluctuations, Aiming High Against OKX and Binance",
    "url": "https://cryptodaily.co.uk/2024/03/stellar-xlm-and-ripple-xrp-investors-shift-to-fezoo-fez-amid-crypto-fluctuations-aiming-high-against-okx-and-binance",
    "description": "Stellar (XLM) and Ripple (XRP) hold strong positions and their investors are always looking for new projects to invest in."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-30T17:41:05.000Z",
    "title": "Market Resilience Tested as NFT Sales Fall for Third Consecutive Week",
    "url": "https://news.bitcoin.com/market-resilience-tested-as-nft-sales-fall-for-third-consecutive-week/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/nft-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Market Resilience Tested as NFT Sales Fall for Third Consecutive Week\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/nft-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/nft-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/nft-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/nft-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/nft-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/nft-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/nft.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Sales of non-fungible tokens (NFTs) have dipped once more, marking the third consecutive week of decline, with a 14.97% decrease compared to the previous week. Leading the charge in this week&#8217;s sales from March 23 to March 30, Bitcoin NFT transactions amassed $82.61 million, despite experiencing a 3.8% drop from the previous week&#8217;s figures. Despite [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-30T17:50:00.000Z",
    "title": "XRP Price Prediction 2024-2033: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2024-2033 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-30T18:05:45.000Z",
    "title": "Vitalik Buterin calls for ‘higher quality’ meme coins",
    "url": "https://crypto.news/vitalik-buterin-calls-for-higher-quality-meme-coins/",
    "description": "Enough with racist, copy-paste meme coins, Buterin says: 'I want to see higher quality fun projects'"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-30T17:57:41.000Z",
    "title": "Q2 outlook: DeeStream set to excel as Cardano, Solana, struggle ",
    "url": "https://crypto.news/q2-outlook-deestream-set-to-excel-as-cardano-solana-struggle/",
    "description": "The DeeStream (DST) decentralized streaming platform is forecasted to excel in Q2, as ADA, and SOL record dips#partnercontent"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-30T18:00:04.000Z",
    "title": "Prepping For $100,000: Bitcoin Shark And Whales Spend Over $18 Billion To Buy BTC",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-shark-and-whales/",
    "description": "Almost every Bitcoin investor is anticipating a continued price surge as the crypto continues to trade around the $70,000 price mark. On-chain data has shown a large part of this surge can be attributed to the accumulation by large whales.  Bitcoin is undoubtedly home to a lot of these whale addresses holding hundreds of millions of dollars and with transactions that can move the market. However, on-chain data has further revealed that the accumulation trend has also flowed into the next cohort of traders. These traders, also known as &#8220;Sharks,&#8221; are addresses that hold between 100 BTC and 1,000 BTC. According to Glassnode data, shark wallet addresses have accumulated 268,441 BTC in the past 30 days, which is the biggest net position change since 2012.  Increased Accumulation Of BTC According to a Glassnode chart shared on social media by crypto analyst James Van Straten, Bitcoin accumulation by shark investors shot up in 2024 to reverse a multi-year consolidation since 2020. As a result, these addresses increased their holdings by 268,441 in 30 days, roughly converting to $18 billion.  Related Reading: Crypto Expert Predicts Massive Shiba Inu Run As Price Mirrors 2021 While these sharks do not have as much individual power over price movement as very large whales, their collective behavior is still worth monitoring as they also relate to the sentiment among investors. Consequently, this large accumulation trend could lead to more buying which would signal a continued price surge for Bitcoin. Source: Glassnode The surge in accumulation is not really surprising, as the launch of Spot Bitcoin ETFs in the US has ushered in a bigger wave of accumulation sentiment from all cohorts of Bitcoin investors. As another analyst pointed out on social media, this shark accumulation could&#8217;ve been due to ETFs purchasing massive amounts of Bitcoins from Coinbase OTC desks. Bitcoin whales (addresses holding more than 1,000 BTC) have also upped their activity in the past few days, signaling strategic positioning in the market. Various transaction alerts from Whale Alerts have shown strategic movement from whale addresses. Notably, the crypto whale transaction tracker has revealed $1.3 billion worth of BTC exchanged between whale addresses in the past 24 hours. Among these large BTC movements was a notable transfer of 3,599 BTC worth $252 million between two unknown wallets. Another notable transaction was the transfer of 3,118 BTC from an unknown wallet to Coinbase Institutional. Bitcoin To $100,000? Data from IntoTheBlock has also reiterated this accumulation trend with its net transfer trend from exchanges. Data from ITB’s platform shows a $16.18 billion outflow from exchanges as against a $15.76 billion inflow in the past seven days. Bitcoin is now trading at $67,931 and has failed to stabilize above the $70,000 mark again. Related Reading: Crypto Analyst Predicts 600%-1000% Return For XRP, Here’s The Target However, the accumulation by whales and sharks, increasing mainstream interest from institutional investors through Spot Bitcoin ETFs, and the approaching halving all point to the possibility of substantial price appreciation to $100,000. BTC price at $70,000 &#124; Source: BTCUSDT on Tradingview.com Featured image from BBC, chart from Tradingview.com"
  }
]