[
  {
    "source": "CoinDesk",
    "date": "2023-06-28T13:00:00.000Z",
    "title": "Maple Finance Expands to Direct Lending Targeting Web3 Firms",
    "url": "https://www.coindesk.com/business/2023/06/28/maple-finance-expands-to-direct-lending-targeting-web3-firms/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The firm aspires to fill the gap in crypto lending left by the implosion of centralized lenders such as BlockFi and Genesis."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-28T13:00:00.000Z",
    "title": "Crypto Custody Firm Ledger Introduces Institutional-Grade Trading Network",
    "url": "https://www.coindesk.com/business/2023/06/28/crypto-custody-firm-ledger-introduces-institutional-grade-trading-network/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The network has a range of partner firms, including Crypto.com, Bitstamp, Huobi, Wintermute and Komainu."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-28T13:00:00.000Z",
    "title": "IFC-Backed Carbon Opportunities Fund Uses Chia Network to Settle Tokenized Carbon Credits",
    "url": "https://www.coindesk.com/business/2023/06/28/ifc-backed-carbon-opportunities-uses-chia-network-to-settle-tokenized-carbon-credits/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Investment company Sumitomo Corporation of Americas purchased a batch of tokenized carbon offsets from the Carbon Opportunities Fund."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-28T13:00:00.000Z",
    "title": "Warner Music Group Partners With Polygon on Blockchain Music Accelerator",
    "url": "https://www.coindesk.com/web3/2023/06/28/warner-music-group-partners-with-polygon-on-blockchain-music-accelerator/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The chosen projects will receive funding from both WMG and Polygon Labs and will also be eligible for mentorship and networking opportunities."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-28T13:01:02.000Z",
    "title": "Warner Music, Polygon Labs Launch Blockchain Music Accelerator",
    "url": "https://decrypt.co/146533/warner-music-polygon-labs-launch-blockchain-music-accelerator",
    "description": "The program will offer projects working at the intersection of music and the blockchain access to funding, marketing support, and other resources. "
  },
  {
    "source": "Decrypt",
    "date": "2023-06-28T12:59:03.000Z",
    "title": "Mercado Libre Gives Mexican Customers Access to Pax Dollar Stablecoin",
    "url": "https://decrypt.co/146481/mercado-libre-gives-mexican-customers-access-to-pax-dollar-stablecoin",
    "description": "The e-commerce giant’s Mercado Pago app will give Mexicans access to digital dollars. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-28T13:05:00.000Z",
    "title": "Open source: Buzzword or real security for crypto wallets?",
    "url": "https://cointelegraph.com/news/open-source-buzzword-or-real-security-for-crypto-wallets",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/5e18221f-93f1-4ee9-9633-ca94c3b2a53c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Open-sourcing crypto wallet designs offers some benefits, but there are trade-offs as well.</p>\n                    <p><p>Last month, hardware crypto wallet manufacturer Ledger announced its “Ledger Recover” program designed to allow customers to back up their seed phrases to the cloud and link it with their real-world identity.</p><p>The announcement <a href=\"https://cointelegraph.com/news/ledger-recover-paused-code-will-open-source\">was met with heavy pushback</a> from the crypto community, as many saw it as opposing the ideals of blockchain security and the decade-old mantra of keeping custody over one’s own keys.</p><p>Ledger responded swiftly, assuring customers that their seed phrases were safe and that the Ledger Recover program was opt-in. But the entire saga has led to a growing demand for open-source hardware wallets, which could enable the community to rule out any hardware or software backdoors.</p><p>Just a week later, Ledger announced that it was accelerating its open-source roadmap. But what does an open-source hardware wallet mean? What are the benefits? And crucially, are they actually securer than their closed-source counterparts?</p><h3>What your hardware wallet isn’t</h3><p>First, it’ll help to clear up some misconceptions surrounding hardware wallets.</p><p><strong>Your wallet doesn't store crypto.</strong></p><p>A lot of people think hardware wallets are used to store cryptocurrencies, but in reality, they’re used to store your private keys. All cryptocurrencies exist on the blockchain, and your private keys prove you own your tokens. This is why it’s important to keep your private key, well, <em>private</em>.</p><p><strong>Your spare phone isn't a hardware wallet.</strong></p><p>Hardware wallet manufacturing is complicated — and for good reason. People use these devices to secure millions of dollars worth of digital assets, and ensuring the safety of customer funds is crucial to building and maintaining a successful hardware wallet brand. </p><p>For this reason, various hardware wallet components are typically proprietary, meaning they cannot be purchased or inspected outside of buying a device and tearing it down. Some wallets even have built-in tamper protection to prevent this. Phones use far more accessible parts, making it a lot easier for an attacker to study and break.</p><p><strong>Hardware wallets are not %100 secure</strong></p><p>No device or software is completely invulnerable to attack. Accidentally interacting with a malicious smart contract can be catastrophic, and even the most secure wallet can’t protect you from rug pulls or phishing attacks. Hardware wallets are not digital bank vaults — they’re more like keys to a secure public lockbox. They’re a tool to help you store and access your assets securely and are only ever as safe as you are.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/cee39971-c6f7-4328-b4aa-8a1a7bb477e9.png\"  alt=\"Wallet, Bitcoin Wallet, Hardware Wallet, Mobile Wallet, Private Keys\"  title=\"Open source: Buzzword or real security for crypto wallets?\"  /></figure><h2>Will going open-source help?</h2><p>If wallets were built with publicly available source code, mass individual audits could prevent malicious actors from getting their way — or at least that’s the claim. But manufacturing hardware wallets requires a lot more trust than one may think, and not just for the manufacturer.</p><p>Other businesses in the supply chain have reasonable opportunities to insert their own backdoors, and these devices have complex supply chains. Most hardware wallet companies rely on contract manufacturers, which tend to rely on supply chains originating in China.</p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/magazine/bitcoin-miami-2023-shitcoins-for-bitcoin/\">Bitcoin 2023 in Miami comes to grips with ‘shitcoins on Bitcoin’</a></em></strong></p><p>Another supposed advantage of open-source hardware wallets is increased compatibility and greater community involvement in development. However, making code publicly available makes it easier for hackers to scour it for vulnerabilities. And since the wallet would be made using publicly available components, it would be easier for scammers to create fake wallets that can steal your funds.</p><p>Nicolas Bacca, co-founder and vice president of Innovation Lab at Ledger, told Cointelegraph that the biggest challenge facing open-source hardware wallets is creating a way for users to easily verify whether their device is genuine with strong guarantees. Most reputable manufacturers allow you to check the device serial number on their website to confirm its legitimacy. Would you trust every business in an open-source hardware wallet’s supply chain?</p><p>“It’s important to remember that an open-source hardware wallet will almost always rely on closed-source components,” said Bacca. “The only way to really know how secure it is is to try to break it and reverse engineer it.” With closed-source wallets, this isn’t possible.</p><p>“Until now no wallet has ever released firmware with a proven backdoor. If the firmware is open, it is scrutinized around the world. In closed-source wallets, that is never possible,” Vipul Saini, co-founder and chief technology officer of hardware wallet firm Cypherock, told Cointelegraph. </p><p>He believes that operations involving the generation and utilization of private keys should be made open-source. “That is where major backdoors, like kleptographic attacks and predictive random numbers, can be easily established,” he said. </p><p>In April 2022, a white hat hacker from Ledger’s security team <a href=\"https://blog.ledger.com/Funds-of-every-wallet-created-with-the-Trust-Wallet-browser-extension-could-have-been-stolen/\" target=\"_blank\" rel=\"noopener nofollow\">caught</a> a vulnerability similar to a backdoor in the seed generation of Trust Wallet, a Binance-owned open-source software wallet. With off-the-shelf chips, any party in the supply chain could modify the code that loads the bootloader, a critical part of ensuring the customer receives a device with genuine firmware. </p><p>This wouldn’t be noticed by code auditors since the backdoor could be inserted, while the code is being loaded onto the device.</p><p>“Given this limitation, it’s not possible to build a robust chain of trust for open-source hardware wallets, which considerably limits their distribution and safe use by the largest number of users,” he added. “The ‘many eyes’ paradigm doesn’t really work for security code, with the best example of this being the <a href=\"https://en.wikipedia.org/wiki/Heartbleed\" target=\"_blank\" rel=\"noopener nofollow\">Heartbleed OpenSSL exploit</a>.”</p><h2>Are open-source wallets the future?</h2><p>As centralized exchanges continue their efforts to rebuild trust with the crypto community, people are being encouraged to store their coins in hardware wallets more than ever before. If the open-source movement gains more traction, the ability to verify that your device hasn’t been tampered with is critical, and this isn’t easy without an intermediary.</p><p>One solution is encouraging open-source hardware wallet producers to comply with the Open Source Hardware Association (OSHWA) criteria and obtain CERN’s Open Hardware Licence. But as examples like the 2008 global financial crisis showed, licenses and certifications can only guarantee so much.</p><p>“OSHWA helps provide proper labels, define and certify what is open hardware,” said Bacca, stating that it doesn’t help secure against attacks, but it’s useful to avoid dubious marketing claims. Bacca also mentioned a few existing vendors that <a href=\"https://github.com/Coldcard/firmware/blob/master/COPYING-CC\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> to be open-source without having an open-source license, or with proprietary code <a href=\"https://github.com/KeystoneHQ/keystone-se-firmware/blob/bitcoin/source/driver/ecdsa_v2.lib\" target=\"_blank\" rel=\"noopener nofollow\">mixed in</a> with their open-source codebase.</p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/how-security-education-and-regulation-can-mitigate-rising-crypto-scams\">How security, education and regulation can mitigate rising crypto scams</a></em></strong></p><p>From unclear incentive structures to restricted testing in predefined circumstances, it’s important to address the limitations of certification organizations. The movement could also lead to a stampede of companies capitalizing on the “open-source” buzzword, hiding their proprietary elements behind sub-standard certifications.</p><p>Closed-source manufacturers use proprietary chips to enforce strong root-of-trust guarantees, but what would a pure open-source wallet employ? The reality of the market is that security evaluations are more nuanced than a simple dichotomy of open source vs. closed source. </p><p>At the end of the day, consumers want the securest option that requires them to trust the least number of people.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-28T13:04:02.000Z",
    "title": "European Commission aims for universal acceptance with Digital Euro proposal",
    "url": "https://cointelegraph.com/news/european-commission-aims-universal-acceptance-digital-euro-proposal",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/23f028a4-968a-4491-b5f1-8f20adf6b265.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>With this move, the European Commission aims to open up the payments market that has been controlled by banks, Visa and Mastercard.</p>\n                    <p><p>The European Commission announced on June 28 that it has proposed a legislative plan for <a href=\"https://cointelegraph.com/learn/the-digital-euro-project-how-will-it-impact-the-current-financial-system#:~:text=A%20digital%20euro%20is%20one,payment%20in%20this%20digital%20era.\">a digital euro</a>, aiming to make it a widely accepted and easily accessible form of payment.</p><p>The announcement <a href=\"https://www.ecb.europa.eu//press/pr/date/2023/html/ecb.pr230628~e76738d851.en.html\" target=\"_blank\" rel=\"noopener nofollow\">emphasized</a> that allowing individuals to obtain digital euros through their banks upon request ensures easy accessibility and prevents anyone from being left behind. The proposal also includes provisions for free basic digital euro services, privacy protection and offline payments. </p><p>As a separate proposal, the commission suggested that banks, insurers, and funds should share customer data with fintech companies in exchange for compensation, aiming to promote the advancement of digital finance. Under this proposal, companies holding customer data would be required to promptly and continuously share it with participating companies upon customer request, ensuring real-time access to the information.</p><p>With this move, the European Commission aims to open up the payments market that has been controlled by banks, Visa and Mastercard and is now facing competition from fintech companies offering alternative services. Furthermore, the proposed legislation prioritizes user privacy and data protection, while also minimizing the risks of money laundering and terrorist financing.</p><p>The European Central Bank (ECB) <a href=\"https://twitter.com/ecb/status/1674011614540972035\" target=\"_blank\" rel=\"noopener nofollow\">welcomes</a> the Commission’s proposal aiming to ensure that cash continues to be a vital part of the payments system. It expressed its support for the Commission's proposal to safeguard the legal tender status of euro cash. In the words of ECB President Christine Lagarde, </p><blockquote>“We look forward to continuing working together with other European Union institutions towards a digital euro to ensure our currency is fit for the digital age.”</blockquote><p>The investigation phase of the project will be completed by October 2023, after which the European Central Bank will proceed with further development and testing. In the next phase, the ECB would further develop and test the technical solutions and business arrangements. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/eu-approves-smart-contract-kill-switch-rules-under-data-act\"><strong><em>EU finalizes controversial smart contract kill switch rules under Data Act</em></strong></a></p><p>A possible decision by the Governing Council to issue a digital euro would be taken only after the legislative act is adopted.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\"><strong><em>Best and worst countries for crypto taxes — plus crypto tax tips</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-28T13:01:00.000Z",
    "title": "Paxos and MercadoLibre partner up to bring USDP to Mexico",
    "url": "https://cointelegraph.com/news/paxos-and-mercado-libre-partner-up-to-bring-usdp-to-mexico",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/4620a2c7-c731-4cbf-b18c-0e3e08b71b41.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The move provides PAX coin access to Mexico’s 3.1 million-plus cryptocurrency users.</p>\n                    <p><p>Blockchain fintech company Paxos and online marketplace MercadoLibre have entered a partnership to bring the Pax Dollar (USDP) stablecoin to Mexico via the MercadoPago payment service on June 28. </p><p>According to a press release shared with Cointelegraph, USDP will be available to all MercadoPago customers throughout Mexico. While the company is based in the United States — with offices in New York, London and Singapore — more than 60% of its active wallets support customers throughout Latin America. </p><p>Mexico currently <a href=\"https://www.statista.com/outlook/dmo/fintech/digital-assets/cryptocurrencies/mexico#revenue\" target=\"_blank\" rel=\"noopener nofollow\">boasts</a> a 9.3% penetration rate for cryptocurrency use, with more than 12 million users, per a report from Statista. By 2027, analysts estimate more than 20 million people in Mexico will hold crypto, bringing the total penetration to 14.6%. </p><p>The introduction of USDP to the MercadoPago payment ecosystem adds stablecoin access to the service’s options in Mexico, a feature that could provide much-needed relief from extraneous fees related to remittances for a significant number of users.</p><p>While Venezuela may lead the way in cryptocurrency adoption among Latin American nations, <a href=\"https://cointelegraph.com/news/this-country-accepts-more-retail-crypto-transactions-than-anywhere-else-in-latin-america\">Mexico ranks highest in total number of transactions</a>. This is largely due to the number of remittances, with only India receiving more. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/why-crypto-remittance-companies-are-flocking-to-mexico\">Why crypto remittance companies are flocking to Mexico</a></em></strong></p><p>Paxos is well known in fintech through its various dealings, including <a href=\"https://cointelegraph.com/news/paypal-to-offer-crypto-payments-starting-in-2021\">a partnership with PayPal</a>, and its noteworthiness as the first blockchain company to receive approval from the U.S. Securities and Exchange Commission (SEC) to settle U.S.-listed securities. </p><p>In February 2023, however, <a href=\"https://cointelegraph.com/news/paxos-categorically-disagrees-with-the-sec-that-busd-is-a-security\">Paxos received a Wells notice</a> indicating that its Binance-based stablecoin, Binance USD (<a href=\"https://cointelegraph.com/binance-usd-busd-price-index\">BUSD</a>), would be labeled a security and, as such, should have been registered. </p><p>As Cointelegraph reported in February, <a href=\"https://cointelegraph.com/news/sec-lawsuit-against-paxos-over-busd-baffles-crypto-community\">the cryptocurrency community was baffled by the notice</a>, and Paxos <a href=\"https://paxos.com/2023/02/13/paxos-issues-statement/\" target=\"_blank\" rel=\"noopener nofollow\">issued</a> a statement vehemently disagreeing with the SEC’s notion that BUSD should be classified as a security. </p><p>In other Paxos news, recently launched cryptocurrency exchange EDX has decided to switch custody providers. The exchange will drop its current partner, Paxos, and instead tap Anchorage Digital. According to a Paxos spokesperson, EDX made the change in order to facilitate <a href=\"https://cointelegraph.com/news/new-exchange-edx-reportedly-switching-out-paxos-custody-services-for-anchorage-s\">a shift toward a noncustodial offering at launch</a>.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-28T12:48:33.000Z",
    "title": "Tether signs MoU with Georgia to develop Bitcoin P2P infrastructure",
    "url": "https://cointelegraph.com/news/tether-to-build-bitcoin-p2p-infrastructure-for-georgia-mou-signed",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/62a5b3e8-dad5-49c4-8267-0158d3dc277e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> The alliance intends to bring a change to the public administration and the business sector. </p>\n                    <p><p>Stablecoin issuer Tether has <a href=\"https://tether.to/en/tether-signs-mou-with-government-of-georgia-to-develop-blockchain-bitcoin-and-peer-to-peer-infrastructure-to-foster-innovation/\" target=\"_blank\" rel=\"noopener nofollow\">signed </a>a memorandum of understanding (MoU) with the government of Georgia to develop Bitcoin and peer-to-peer focused infrastructure in the country. The Strategic collaboration between the stablecoin issuer and the Georgian government will focus on building key infrastructure for a thriving startup ecosystem in Georgia. </p><p>The collaborative effort between the two parties aims to attract international attention and investment towards the nascent decentralized space. The partnership will aim at flourishing the P2P technology at a state level and help build financial tools around it. Some of the key areas of development include education on Bitcoin and blockchain technology, building payment infrastructure for merchants and developing a resilient, open and private peer-to-peer communication system.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Paolo Ardoino (CTO, Tether) and Irakli Nadareishvili (Deputy Minister of Economy and Sustainable Development) signing the MOU for the collaboration between Tether and the Government of Georgia to develop Blockchain, <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> and Peer-to-Peer Infrastructure. <a href=\"https://t.co/g3LayZxDPX\">pic.twitter.com/g3LayZxDPX</a></p>&mdash; Tether (@Tether_to) <a href=\"https://twitter.com/Tether_to/status/1673988552739246080?ref_src=twsrc%5Etfw\">June 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Tether said that the partnership with the government of Georgia will also look at creating and implementing a strong and autonomous financial and communication system. This entails encouraging the adoption of peer-to-peer technology-based digital payment and communication systems, as well as improving existing infrastructure to ensure its robustness and dependability in supporting blockchain-based solutions. The alliance intends to bring a change to the public administration and the business sector.</p><p>Georgia will create a special fund for local startups in order to provide assistance to develop blockchain technologies and position Georgia as a country with an attractive ecosystem for technological startups. Irakli Nadareishvili, deputy minister of economy and sustainable development said that the collaborative effort “will contribute to the development of local blockchain technologies in the country, as well as the introduction of companies operating in this sector in Georgia.” </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/peer-to-peer-crypto-exchanges-struggle-to-navigate-shifting-legal-landscape\"><strong><em>Peer-to-peer crypto exchanges struggle to navigate shifting legal landscape</em></strong></a></p><p>Tether’s collaborative effort in Georgia is not its first and over the years not just Tether, many crypto giants have worked closely with governments to flourish the nascent technology. In most cases, the collaborative efforts often translate into a better understanding of the tech by the respective governments which eventually leads to positive regulation. </p><p>El Salvador the first country to make Bitcoin a legal tender had Bitfinex as its key exchange technology partner and eventually granted the first <a href=\"https://cointelegraph.com/news/bitfinex-securities-el-salvador-receives-digital-asset-service-provider-license-in-el-salvador\">digital asset license to the exchange</a> as well. Similarly, crypto exchange <a href=\"https://cointelegraph.com/news/binance-signs-mou-with-kazakhstan-to-further-crypto-adoption-and-regulation\">Binance signed MoU with Kazakhstan</a> in May 2022 and a year later received compliance approval from the country.</p><p>Tether didn’t respond to Cointelegraph’s requests for comments at the time of publishing.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/cryptocurrency-trading-addiction-what-to-look-out-for-and-how-it-is-treated/https://cointelegraph.com/magazine/cryptocurrency-trading-addiction-what-to-look-out-for-and-how-it-is-treated/https://cointelegraph.com/magazine/cryptocurrency-trading-addiction-what-to-look-out-for-and-how-it-is-treated/\"><strong><em>Cryptocurrency trading addiction: What to look out for and how it is treated</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-28T12:46:16.000Z",
    "title": "Tether forms agreement with Georgia for development of blockchain industry hub",
    "url": "https://cryptoslate.com/tether-signs-terms-with-georgia-for-development-of-blockchain-industry-hub/",
    "description": "<p>Tether has signed a Memorandum of Understanding (MOU) with the Government of Georgia, as reported by the firm on June 28. The &#8220;strategic collaboration&#8221; is part of a broader vision to position Georgia as a &#8220;central hub for peer-to-peer and blockchain technology,&#8221; intended to bring about innovation and economic growth in the region. A flourishing [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/tether-signs-terms-with-georgia-for-development-of-blockchain-industry-hub/\">Tether forms agreement with Georgia for development of blockchain industry hub</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-28T12:55:01.000Z",
    "title": "ADA: Crypto Analyst Explains Why He Believes a Mass Sell-Off of Cardano (ADA) Is Coming Soon",
    "url": "https://www.cryptoglobe.com/latest/2023/06/ada-crypto-analyst-explains-why-he-believes-a-mass-sell-off-of-cardano-ada-is-coming-soon/",
    "description": "In a recent episode of the popular crypto market commentary YouTube series “Cheeky Crypto,” the host (Nick) got into a detailed technical analysis of Cardano (ADA). The video provides insights into the recent performance of ADA and what might be expected next. Nick begins the video by addressing some confusion caused by recent videos about […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T13:04:57.000Z",
    "title": "Unveiling the top crypto hubs in 2023: Optimal locations for freedom, productivity, and favorable tax laws",
    "url": "https://www.cryptopolitan.com/unveiling-the-top-crypto-hubs-in-2023/",
    "description": "Crypto hubs are taking different shapes and forms in 2023. Crypto enthusiasts and entrepreneurs search for the best areas to blend independence, productivity, and advantageous tax legislation in a world where digital currency disrupts financial systems.&#160; Since 2023 is building up to be a milestone year for blockchain and decentralized finance, it&#8217;s time to highlight ... <a title=\"Unveiling the top crypto hubs in 2023: Optimal locations for freedom, productivity, and favorable tax laws\" class=\"read-more\" href=\"https://www.cryptopolitan.com/unveiling-the-top-crypto-hubs-in-2023/\" aria-label=\"More on Unveiling the top crypto hubs in 2023: Optimal locations for freedom, productivity, and favorable tax laws\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T12:56:11.000Z",
    "title": "FTX troubles double with $500 AI sale suspension and hush money accusations ",
    "url": "https://www.cryptopolitan.com/ftx-suspends-500-ai-sale-bribe-accusations/",
    "description": "FTX has found itself caught in a swirling whirlwind of trouble akin to a digital tornado that shows no signs of abating. As if navigating the stormy seas of the crypto world wasn&#8217;t challenging enough, the failed crypto exchange now finds its woes doubling, with a suspension of $500 AI sales and the ominous whispers ... <a title=\"FTX troubles double with $500 AI sale suspension and hush money accusations \" class=\"read-more\" href=\"https://www.cryptopolitan.com/ftx-suspends-500-ai-sale-bribe-accusations/\" aria-label=\"More on FTX troubles double with $500 AI sale suspension and hush money accusations \">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-28T13:02:18.000Z",
    "title": "French workers turn to crypto, as 20% prefer to receive salaries in it",
    "url": "https://crypto.news/french-workers-turn-to-crypto-as-20-prefer-to-receive-salaries-in-it/",
    "description": "Despite the previous year of implosions and the cluster of hacks and scam schemes dominant within the crypto space, a recent survey reveals that 20% of French residents are likely to invest in cryptocurrencies. The survey was part of a&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-28T12:54:46.000Z",
    "title": "Bitcoin holds firm at $30k: what lies ahead for crypto market",
    "url": "https://crypto.news/bitcoin-holds-firm-at-30k-what-lies-ahead-for-crypto-market/",
    "description": "A glance at the crypto world reveals bitcoin (BTC) is experiencing a pause at the $30,000 mark, but does this stagnation indicate an impending bear market or a precursor to another bull run? Let&#8217;s delve deeper. The world&#8217;s first and&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-28T13:00:34.000Z",
    "title": "Bitcoin Correlation To Gold, Silver Drops To Cyclical Lows: Glassnode",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-correlation-gold-silver-drops-cyclical-lows-glassnode/",
    "description": "Data from Glassnode shows the Bitcoin correlation to Gold and Silver has taken a plunge toward cyclical lows recently. Bitcoin Correlation With Gold &#38; Silver Has Now Turned Negative According to data from the on-chain analytics firm Glassnode, the latest price action in BTC has decoupled the cryptocurrency from commodities such as Gold and Silver. The &#8220;correlation&#8221; here is an indicator that tells us how closely Bitcoin has been moving with any particular asset, over a given time period. In the context of the current discussion, the 30-day time period is of interest. When the value of the correlation is positive, it means that the cryptocurrency is mimicking the movements of the other asset currently. Negative values of the indicator, on the other hand, suggest BTC has been moving in the opposite direction to the commodity&#8217;s price. Naturally, the higher the value of the metric (whether on the positive or the negative scale), the stronger the response of Bitcoin to movements in the asset in question. The correlation can also attain a value of zero during periods where there isn&#8217;t any discernible pattern between the prices of the two assets (like when one of the assets moves sideways while the other is experiencing some kind of volatility). Related Reading: Bitcoin Holders Expect Retrace, Will BTC Move Against Crowd Once Again? Now, here is a chart that shows the trend in the Bitcoin 30-day correlation to Gold and Silver over the last few years: Looks like the value of the metric has plunged in recent days &#124; Source: Glassnode on Twitter As displayed in the above graph, the Bitcoin 30-day correlation to both Gold and Silver had been high just recently, but with the latest surge in the cryptocurrency, the indicator&#8217;s value has taken a deep hit. Following this plunge, the metric&#8217;s value has fallen inside the negative territory for both these assets, with BTC&#8217;s correlation to XAU (the price of one troy ounce of Gold) hitting -0.78, while that to XAG (one ounce of Silver) going even deeper to -0.90. In the case of Gold, the correlation between the two assets is now close to the cyclical lows, while for Silver, the indicator has already set a new cyclical low with this plummet. Related Reading: XRP Traders Show Capitulation, Why This Could Be Bullish Bitcoin is currently showing such a highly negative correlation to these commodities because of the fact that their prices have been going down recently, while the cryptocurrency has observed a very sharp rally at the same time. The current values of the 30-day correlation pose an interesting shift of trend, as except for a period between late February and early March, Bitcoin had been tightly moving in tandem with these traditional assets since the rally started back in January of this year. It now remains to be seen whether Bitcoin will remain decoupled from these assets in the coming days and do its own thing, or if the break in correlation is only temporary, like the aforementioned instance earlier in the year. BTC Price At the time of writing, Bitcoin is trading around $30,200, up 5% in the last week. BTC hasn't moved much during the last few days &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T13:02:45.000Z",
    "title": "PEPE Continues Its Magical Rally with a Whopping 74% Weekly Growth, Defying Skepticism",
    "url": "https://www.crypto-news-flash.com/pepe-continues-its-magical-rally-with-a-whopping-74-weekly-growth-defying-skepticism/?utm_source=rss&utm_medium=rss&utm_campaign=pepe-continues-its-magical-rally-with-a-whopping-74-weekly-growth-defying-skepticism",
    "description": "PEPE triggered an &#8220;insane&#8221; rally with a 74 percent surge despite concerns surrounding the project.  The asset is cumulatively up by 2600 percent in the last three months with neutral market sentiment. PEPE extended its bullish run with a 74 percent surge in the last seven days before losing some of the gains to end [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-28T13:00:19.000Z",
    "title": "Best Crash Gambling Sites in 2023: Top 10 Crypto Crash Games to Play for Real Money",
    "url": "https://www.crypto-news-flash.com/best-crash-gambling-sites-in-2023-top-10-crypto-crash-games-to-play-for-real-money/?utm_source=rss&utm_medium=rss&utm_campaign=best-crash-gambling-sites-in-2023-top-10-crypto-crash-games-to-play-for-real-money",
    "description": "If you’ve never tried crash gambling before, you’re missing out on a ton of fun! Crash games used to be a concept just a few years ago, and today – you have hundreds of crypto casinos offering up these unique games. This begs the question: Which are the best crash gambling sites out there? With [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-28T13:05:19.000Z",
    "title": "How Banks Are Preparing for the Bull Run",
    "url": "https://www.altcoinbuzz.io/top-article/how-banks-are-preparing-for-the-bull-run/",
    "description": "<p>In the US, the SEC wants you to believe that crypto has no future. The same as the Chinese government did before. However, recently, we saw a whole set of companies willing to launch spot Bitcoin ETFs. The SEC now has 240 days, until February 2024, to accept or reject this. So, this is one [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/top-article/how-banks-are-preparing-for-the-bull-run/\">How Banks Are Preparing for the Bull Run</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]