[
  {
    "source": "NewsBTC",
    "date": "2024-02-08T00:30:38.000Z",
    "title": "Bitcoin Miner Reserves Drop To June 2021 Levels, What This Means For Price",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-miner-reserves-june-2021/",
    "description": "Bitcoin miner reserves can often be a tell for where the market could be headed next due to their large holdings. These reserves going up or down can pinpoint how miners are looking at the market, and a drop in their reserves can be bad for the BTC price. Miners Reserves Drop By 14,000 BTC Bitcoin miners, who are responsible for confirming transactions on the blockchain and keeping the network safe, seem to be turning toward selling rather than accumulating. According to a CryptoQuant report, these miner reserves have seen a notable drop since 2024 began. Related Reading: PEPE Ready To Make A Comeback? On-chain Indicators Have The Answer Their holdings dropped by 14,000 BTC in less than two months, suggesting that these miners have been selling some of their stash. Going by an average price of $43,000 since January 2024, this means that Bitcoin miners have sold over $600 million worth of BTC so far. As a result of this, miner reserves are currently sitting at 1.8 million BTC, which is the lowest level since June 2021. Bitcoin miners selling their coins are not new because they often need to sometimes sell to keep their operations running. The most notable costs include electricity, as well as mining machines. However, it does not change the fact that their selling can have an adverse effect on the price of BTC. This time around, though, miners seem to be selling for an additional reason, which Matthew Sigel, who’s head of digital asset research at VanEck, has identified to be for purposes of bolstering their balance sheets. Bitcoin Miners Getting Ready For The Halving The next Bitcoin halving is expected to happen sometime in April 2024, and the block rewards are expected to fall to 3.125 BTC. Naturally, these miners are getting ready for this drop in rewards, as identified by Matthew Sigel. “Miners have begun to sell more of their coins to bolster balance sheets and fund growth capex ahead of tougher times for margins when block rewards are halved in April. After the halving, scale will matter even more.” Related Reading: Massive $29.3 Million Whale Transfer Threatens XRP Price With More Sell Pressure Nevertheless, as selling has ramped up, so has buying as Spot Bitcoin ETF issuers scramble to accumulate BTC for their customers. According to this NewsbTC report, Spot Bitcoin ETF issuers now hold more than 657,000 BTC, worth more than $28 billion at current prices. At the time of writing, the BTC price is trending at $42,933, after being beaten back from the $43,000 resistance. The crypto’s fluctuations at this level suggest that $43,000 is the target to beat if it is to continue its uptrend. BTC price struggles below $43,000 &#124; Source: BTCUSD on Tradingview.com Featured image from Forbes India, chart from Tradingview.com"
  }
]