[
  {
    "source": "Cointelegraph",
    "date": "2023-06-30T13:00:00.000Z",
    "title": "Challenges Web3 developers encounter when using chatbots like ChatGPT",
    "url": "https://cointelegraph.com/innovation-circle/challenges-web3-developers-encounter-when-using-chatbots-like-chatgpt",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/71e1eaea-8d5b-4e34-ae43-3d1c77935758.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>So, if you still haven’t jumped on the chatbot bandwagon, it could be high time you consider exploring the possibilities.</p>\n                    <p><p>Chatbots have become all the rage for businesses of all sizes and industries as they offer a cost-effective and efficient way to improve customer experience and streamline operations. </p> <p>Did you know the chatbot market was worth around <a href=\"https://brandessenceresearch.com/technology-and-media/chatbot-market-size-growth?utm_source=Pooja&utm_medium=linkedin\">$435.2 million</a> in 2018? Experts predict that the chatbot market will reach $2.3 billion by 2025. That’s a compound annual growth rate (CAGR) of 26.9% over the forecast period. It’s astonishing to see how quickly the chatbot market is growing. </p> <p>It’s no wonder that chatbots are increasingly used in e-commerce, banking, finance, healthcare and customer service. Its usage has <a href=\"https://www.juniperresearch.com/resources/analystxpress/july-2017/chatbot-conversations-to-deliver-8bn-cost-saving\">helped</a> businesses save over $8 billion annually in e-commerce and reduced customer service costs by up to 30%. </p> <p>So, if you still haven’t jumped on the chatbot bandwagon, it could be high time you consider exploring the possibilities.</p> <h2>Real challenges while engaging with Chatbots like ChatGPT</h2> <p>Chatbots like ChatGPT play a dynamic role in the Web3 space (which has a constant distributed data computing demand). In that context, it is crucial to understand the value of using an AI language model to enhance and streamline Web3 development operations. </p> <p>However, without a predefined Web3 training model, ChatGPT would face some significant challenges. For instance, consider a scenario where a Web3 developer gives ChatGPT a prompt that requires a complex text-to-SQL translation. </p> <h3>Challenge 1: Lack of training models</h3> <p>ChatGPT is not well-versed in the developer’s project database and cannot map the NQL logic to SQL response. It provides an inaccurate SQL response to the Web3 developer’s prompt. This happens because it does not know about the schema cadence and primary and foreign keys of the developer’s project database.  </p> <p>There are two predominant datasets <a href=\"https://web.stanford.edu/class/archive/cs/cs224n/cs224n.1194/reports/custom/15844304.pdf\">involved</a> in the NQL-to-SQL translation. One is WikiSQL (a large annotated corpus for building language interfaces) and the other is Spider (a large-scale annotated semantic parsing and text-to-SQL dataset). </p> <p class=\"has-black-color has-text-color has-background\" style=\"background-color: #fabf2c;padding: 20px 30px\">Join the community where you can transform the future. Cointelegraph Innovation Circle brings blockchain technology leaders together to connect, collaborate and publish. <strong><a href=\"https://circle.cointelegraph.com/learn-more?utm_campaign=Coin&_ga=2.123197772.699257063.1649682515-719256619.1645538730\" target=\"_blank\" rel=\"noopener\">Apply today</a></strong></p> <p>Now a chatbot like ChatGPT should comprehend the underlying database schema cadence and get accustomed to the new schemas. Currently, to achieve this a Web3 developer enters the entire database in prompts to train ChatGPT. Training data models through prompts require a certain number of tokens, resulting in huge query processing cost for ChatGPT. </p> <h3>Challenge 2: High cost for processing queries</h3> <p>Another significant challenge is the cost calculation of ChatGPT’s latest version GPT 4. For every 3-4 words a developer enters in his text query in return for SQL, ChatGPT charges a token. </p> <p>So, considering the size of a complete Web3 project database, it might cost more than 1,000 tokens (it can also go up to 8,192-32,768 <a href=\"https://platform.openai.com/docs/models/gpt-3-5\">tokens</a>) for one fully functional application development. </p> <p>As <a href=\"https://julianivaldy.medium.com/chatgpt-x-web3-how-ai-can-help-you-build-grow-your-web3-company-f8ac26a68a9c#:~:text=ChatGPT%20can%20help%20find%20web3,used%20to%20create%20Web3%20businesses.\">stated</a> by the co-founder of Mobula, (crypto-aggregator) Julian, ChatGPT is a revolutionizing tool to innovate in Web3. However, it lacks the technical potential to build and grow a specific Web3 project.</p> <h2>Potential steps to mitigate these challenges</h2> <p>Building huge language models that have already been trained and can convert text to SQL is something that AI developers should pay close attention to. </p> <p>Pragmatically speaking, building pre-trained models remains a significant step in chatbot invention. Instead, for the chatbots to evolve on their own, we will have to teach them to use the project database and business intelligence (BI). This training will make it easier for chatbots to understand the database schema cadence and speed up the creation of Web3 code. </p> <p>A chatbot like ChatGPT can reduce the cost per token if it is tailored and linked to the database structure, primary key, foreign key and schema cadence of a Web3 project. </p> <p>Avoid entering the database and schema codes repeatedly and paying a token per three to four words. Instead, use aggregated token cost to fund a one-time chatbot training for Web3 development.</p> <h2>Endnote</h2> <p>Chatbots like ChatGPT are surfacing as an integral platform for dApp development with evolving Web3 technology. However, developers do face some ground obstacles when integrating chatbots into these systems.</p> <p>We can showcase the model’s capacity to recognize and produce appropriate Web3 and dApp code patterns by upgrading the ChatGPT architecture. It also supports multilingual programming languages for dApp development.</p> <p>Thus, by solving the pragmatic issues of ChatGPT, we can build seamless and adaptive generative AI models that offer new potential for future dApp and Web3 advancements.</p> <p><em>Vinita Rathi is the Founder and Chief Executive Officer of Systango, specialising in Web3, Data and Blockchain.</em></p> <div class=\"wp-block-columns\"> <div class=\"wp-block-column\" style=\"flex-basis:100%\"> <hr class=\"wp-block-separator\" /> </div> </div> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p> <p><a href=\"https://circle.cointelegraph.com/\"><em><strong>Learn more about Cointelegraph Innovation Circle and see if you qualify to join</strong></em></a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-30T12:53:00.000Z",
    "title": "Cardinal Labs Shuts Shop",
    "url": "https://cryptodaily.co.uk/2023/06/cardinal-labs-shuts-shop",
    "description": "<p>Solana&rsquo;s Cardinal protocol just announced its decision to wind down operations and shut down, citing economic conditions.&nbsp;</p>\nCardinal Starts 2-Months &ldquo;Notice Period&rdquo;\n<p>Nearly a year after raising $4.4 million, Solana&rsquo;s NFT utility provider, Cardinal Labs, has decided to pack it in. The protocol was launched in early 2022 as an infrastructure provider to improve NFT utility on the Solana network.&nbsp;</p>\n<p>However, on Wednesday, the Cardinal team took to Twitter to announce that they would be winding down operations and eventually shut shop.&nbsp;</p>\n<p>They wrote,</p>\n\n<p>&ldquo;Today is the first day of our 2 month &ldquo;notice period&rdquo; (6/28-8/26) during which we recommend any and all depositors of assets into our systems manually withdraw them. All of our website product UIs will remain live during the period so that no one should have any issue doing so.&rdquo;</p>\n\n&ldquo;Product Market Fit Difficult&rdquo;\n<p>The team tweeted that the macroeconomic conditions have been very challenging for the protocol. They claimed that product market fit has been difficult, and although there has been some usage of the protocol&rsquo;s staking, rentals, and identity products, the market has not scaled up as they had hoped it would. Until blockchain tech adoption happens on a larger scale, the protocol&rsquo;s offerings are &ldquo;stuck in the context of the crypto maximalist community.&rdquo;&nbsp;</p>\n<p>The team also noted that the code behind the protocol will always be open source and accessible by all, even after the deployments are no longer live. They also reassured users that their assets were safe and would be returned to owners by the end of the process.&nbsp;</p>\nWind Down Schedule&nbsp;\n<p>August 26 would mark the end of the two-month notice period, so users will need to complete all withdrawals by that date. The team has also dropped the closing schedule, which revealed that activities like creating staking pools, token management, NFT rentals and rental extensions, management of social media handles, and new deposits would be suspended on July 19.</p>\n<p>The team tweeted,&nbsp;</p>\n\n<p>&ldquo;As we move towards closing up shop, our focus now shifts to carrying out a wind down as smoothly as possible so that the Solana ecosystem doesn&rsquo;t skip a beat&hellip;We realize that many people and teams rely on our protocols, and we want to minimize the impact of this transition on the ecosystem as much as possible, so we&rsquo;ve worked deliberately to find a path that does just that.&rdquo;</p>\n\nAnother Solana Project Shuts Down\n<p>Twitter user and crypto expert JagoeCapital pointed out that Solana-related protocols are not faring well in the market.&nbsp;</p>\n<p>They tweeted,&nbsp;</p>\n\n<p>&ldquo;Cardinal announced a $4.4 Million raise just 11 months ago led by Solana Ventures and ProtagonistXYZ with headline participation from Alameda Research, Animoca Brands and Delphi Digital. Today they announced they will be shutting down. It&rsquo;s becoming a common theme with Solana projects.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-30T13:05:26.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Remains in the Green, Ahead of US Consumer Sentiment Report",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-remains-in-the-green-ahead-of-us-consumer-sentiment-report/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1660515424-2-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BTC Remains Near $31,000, Ahead of US Consumer Sentiment Report\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1660515424-2-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1660515424-2-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1660515424-2-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1660515424-2-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1660515424-2-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1660515424-2-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1660515424-2.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin remained close to the $31,000 level on Friday, as momentum in the market continued to be bullish heading into the weekend. This comes ahead of the anticipated consumer sentiment report from the United States, which is expected to show an increase in overall consumer confidence. Ethereum also edged higher today, climbing above $1,900. Bitcoin [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T12:44:20.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The $2Million bet by ex-CTO of Coinbase has been the subject of much discussion and debate in the crypto world. At the heart of the controversy is Srinivasan’s prediction that Bitcoin will reach $1 million per coin within just 90 days. This Bitcoin Price Prediction intends to shed light on the ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-30T13:05:28.000Z",
    "title": "Litecoin Up 18% In Past 24 Hours, Is Halving Rally Here?",
    "url": "https://www.newsbtc.com/news/litecoin/litecoin-up-18-in-past-24-hours-is-halving-rally-here/",
    "description": "Litecoin has observed a sharp increase of around 18% during the past day as the much-anticipated halving is just over a month away now. Litecoin Outperforms Market With A Strong 18% Surge Like most of the wider cryptocurrency market, LTC had enjoyed a sharp rally a week or so back, which had taken its price above the $90 mark. Unlike coins like Bitcoin, however, the asset had failed to maintain at these post-surge levels, as it slid off during the days that followed, until eventually bottoming out at the low $80 level. In the past day, however, tides seem to have rapidly shifted for Litecoin, as the asset is now trading above $101 after registering a sharp growth of 18% during the last 24 hours. The below chart shows how the cryptocurrency has performed recently. Looks like the coin has observed a sharp uptrend today &#124; Source: LTCUSD on TradingView As you can see in the graph, Litecoin was around the $81 level only a couple of days back. This latest turnaround for the asset has meant that it has now surpassed the high registered around the start of the month. In terms of daily returns, LTC has outperformed almost all the top 20 cryptocurrencies by market cap; Bitcoin Cash (BCH) is the only exception with its whopping 26% gains in the same period. Related Reading: Stablecoin Cap Shows Early Sign Of Reversal, Why This Could Benefit Bitcoin As analyst Tony &#8220;The Bull&#8221; pointed out on Twitter, Litecoin formed a golden cross just before this surge, as its 50-day moving average (MA) has crossed over its 200-day MA. 2020 it is#Litecoin has golden crossed, days after a death cross Does the rest of history repeat? https://t.co/sGlMhgKE0R pic.twitter.com/CRSaqHSbGt — Tony &#8220;The Bull&#8221; (@tonythebullBTC) June 30, 2023 Interestingly, only a few days ago, the same MAs had also formed a cross of the opposite type: the death cross. The bullish cross canceling this bearish one out merely days later is a pattern similar to the one seen back in 2020, which preceded the bull run. LTC Only Has 34 Days To Go For The Next Halving Litecoin also has a strong bullish narrative coming up in the form of its halving. The &#8220;halving&#8221; is an event where the block rewards of the cryptocurrency are permanently cut in half. As the block rewards are the only way to introduce new LTC into the circulating supply, the halving tightens up its production rate. This increased scarcity is why the event has historically been hyped up as a bullish one. Related Reading: Altcoin Whales Show Highly Active Day, Volatility Incoming? Halvings take place roughly every four years, and the next one is estimated to place on August 3, 2023, which is just 34 days away. It now remains to be seen whether the current price surge will be an extended rally that leads to the halving, or if this is another attempt that would run out of steam before long. Featured image from Michael Förtsch on Unsplash.com, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-30T13:03:55.000Z",
    "title": "Mastercard’s Ethereum-Based App Store and Multi-Token Network Is Revolutionary – Will It Use Bitcoin, Ethereum, Ripple (XRP), or Any Other Cryptocurrency in the Future? Deep Dive",
    "url": "https://www.crypto-news-flash.com/mastercards-ethereum-based-app-store-and-multi-token-network-is-revolutionary-will-it-use-bitcoin-ethereum-ripple-xrp-or-any-other-cryptocurrency-in-the-future-deep-dive/?utm_source=rss&utm_medium=rss&utm_campaign=mastercards-ethereum-based-app-store-and-multi-token-network-is-revolutionary-will-it-use-bitcoin-ethereum-ripple-xrp-or-any-other-cryptocurrency-in-the-future-deep-dive",
    "description": "Mastercard unveils its Multi-Token Network (MTN). The upcoming beta release of MTN in the United Kingdom during the summer season will function as a testing ground. On June 28, Mastercard unveiled its Multi-Token Network (MTN). The platform is specifically tailored to facilitate transactions related to blockchain technology and digital assets, as the company&#8217;s official announcement [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-30T13:00:56.000Z",
    "title": "The Meme of the Crop: Are Meme Coins Dogecoin, Shiba Inu, and DogeMiyagi the Very Best of What Crypto Has to Offer?",
    "url": "https://www.crypto-news-flash.com/the-meme-of-the-crop-are-meme-coins-dogecoin-shiba-inu-and-dogemiyagi-the-very-best-of-what-crypto-has-to-offer/?utm_source=rss&utm_medium=rss&utm_campaign=the-meme-of-the-crop-are-meme-coins-dogecoin-shiba-inu-and-dogemiyagi-the-very-best-of-what-crypto-has-to-offer",
    "description": "Meme coins have the ability to make movements on the crypto scene like nothing else, and it seems that other cryptocurrencies need to take note. They can go viral and make millionaires of their investors overnight, so many crypto enthusiasts are turning to the meme coin market to experience the exhilaration of life-changing rallies and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-30T12:55:56.000Z",
    "title": "Shiba Inu’s Burn Account Suspension: How Will BEASTS Coin and Tamadoge Benefit?",
    "url": "https://www.crypto-news-flash.com/shiba-inus-burn-account-suspension-how-will-beasts-coin-and-tamadoge-benefit/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-burn-account-suspension-how-will-beasts-coin-and-tamadoge-benefit",
    "description": "The recent suspension of Shiba Inu&#8217;s burn Twitter account, ShibBurn, has sent shockwaves through the crypto community. As investors and enthusiasts wonder how this negative development will impact Shiba Inu&#8217;s recovery, attention turns to the potential beneficiaries of this situation. Among them are BEASTS Coin and Tamadoge, two emerging players in the crypto space. In [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-30T12:41:00.000Z",
    "title": "Do Kwon Sentenced to Jail and South Korea Tightens Crypto Laws",
    "url": "https://coinedition.com/do-kwon-sentenced-to-jail-and-south-korea-tightens-crypto-laws/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Do-Kwon-Sentenced-to-Jail-and-South-Korea-Tightens-Crypto-Laws.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Do Kwon Sentenced to Jail and South Korea Tightens Crypto Laws\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Do-Kwon-Sentenced-to-Jail-and-South-Korea-Tightens-Crypto-Laws.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Do-Kwon-Sentenced-to-Jail-and-South-Korea-Tightens-Crypto-Laws-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Do-Kwon-Sentenced-to-Jail-and-South-Korea-Tightens-Crypto-Laws-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Do-Kwon-Sentenced-to-Jail-and-South-Korea-Tightens-Crypto-Laws-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Do-Kwon-Sentenced-to-Jail-and-South-Korea-Tightens-Crypto-Laws-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Do-Kwon-Sentenced-to-Jail-and-South-Korea-Tightens-Crypto-Laws-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Do-Kwon-Sentenced-to-Jail-and-South-Korea-Tightens-Crypto-Laws-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Do-Kwon-Sentenced-to-Jail-and-South-Korea-Tightens-Crypto-Laws-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Do-Kwon-Sentenced-to-Jail-and-South-Korea-Tightens-Crypto-Laws-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Do-Kwon-Sentenced-to-Jail-and-South-Korea-Tightens-Crypto-Laws-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Do-Kwon-Sentenced-to-Jail-and-South-Korea-Tightens-Crypto-Laws-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Do-Kwon-Sentenced-to-Jail-and-South-Korea-Tightens-Crypto-Laws-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Do-Kwon-Sentenced-to-Jail-and-South-Korea-Tightens-Crypto-Laws-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Do-Kwon-Sentenced-to-Jail-and-South-Korea-Tightens-Crypto-Laws-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Do-Kwon-Sentenced-to-Jail-and-South-Korea-Tightens-Crypto-Laws-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Do-Kwon-Sentenced-to-Jail-and-South-Korea-Tightens-Crypto-Laws-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>South Korea has recently approved its first independent digital-asset bill aimed at enhancing investor protection. In related news, Do Kwon has been sentenced to jail for four months after attempting to use a forged passport. CoinMarketCap indicated that both LUNA and LUNC saw their prices rise throughout the past day of trading. South Korea has [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/do-kwon-sentenced-to-jail-and-south-korea-tightens-crypto-laws/\">Do Kwon Sentenced to Jail and South Korea Tightens Crypto Laws</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]