[
  {
    "source": "Decrypt",
    "date": "2024-01-22T22:05:28.000Z",
    "title": "Air Ball: NBA Star Dwight Howard's Avalanche NFTs Are a Huge Miss",
    "url": "https://decrypt.co/213736/air-ball-nba-star-dwight-howard-avalanche-nfts-huge-miss",
    "description": "Negative buzz around Dwight Howard's collection, Ballers, was so bad that Ava Labs distanced itself from the collection on Sunday."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-22T21:46:02.000Z",
    "title": "Alameda Research Drops Grayscale Lawsuit, Sparking Share Redemption Rush",
    "url": "https://decrypt.co/213748/alameda-research-drops-grayscale-lawsuit-sparking-share-redemption-rush",
    "description": "The likely reason? The ability to sell Grayscale’s Bitcoin Trust (GBTC) tokens."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-22T21:59:52.000Z",
    "title": " SEC blames &#039;SIM swap&#039; attack for hacked X account prior to official Bitcoin ETF approval ",
    "url": "https://cointelegraph.com/news/sec-blames-sim-swap-attack-hacked-x-account-prior-official-bitcoin-etf-approval",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOTI4OTAxNzgtMzQ1Yy00MGE0LWJkNGMtZjZlNDg2MmY4ODlhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The SEC had multi-factor authentication six months prior to the hack; however, it was disabled by X Support following a request by an SEC staff member, the securities regulator revealed. </p>\n                    <p><p>The United States Securities and Exchange Commission has confirmed it fell victim to a \"SIM swap\" attack which led to the false X post stating that spot Bitcoin exchange-traded funds had been approved on Jan. 9.</p><p>\"Two days after the incident, in consultation with the SEC's telecom carrier, the SEC determined that the unauthorized party obtained control of the SEC cell phone number associated with the account in an apparent 'SIM swap' attack,\" a SEC spokesperson <a href=\"https://www.sec.gov/secgov-x-account\" target=\"_blank\" rel=\"noopener nofollow\">said</a> on Jan. 22.</p><p>\"Once in control of the phone number, the unauthorized party reset the password for the @SECGov account,\" the SEC spokesperson added.</p><p><a href=\"https://cointelegraph.com/news/sec-blames-sim-swap-attack-hacked-x-account-prior-official-bitcoin-etf-approval\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-22T21:53:53.000Z",
    "title": " 3 bull market narratives for 2024 that you haven’t heard  about yet ",
    "url": "https://cointelegraph.com/news/3-bull-market-narratives-2024-you-havent-heard",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYjVkOWIwNzgtYmYzZS00ODkzLWEzMzEtNjg4YjM3Njg4NzZjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Layer-3s, superchains, appchains and chain development kits (CDKs) are just some of the developments in blockchain primed to take off in the year ahead.</p>\n                    <p><p>Every market cycle in cryptocurrency is made up of new narratives that demand investors' attention and money. Being aware of these movements is strategically necessary for both individuals and companies.</p><p>Looking back at previous bull cycles, it's clear that there are always new narratives to capture investors' attention and resources, shaping the development of the crypto market for the coming years.</p><p>In 2017, the narrative of <a href=\"https://cointelegraph.com/learn/initial-coin-offering\">initial coin offerings (ICOs)</a> stood out. In 2019, the focus was on <a href=\"https://cointelegraph.com/defi-101/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a>. In 2021, we witnessed the rise of nonfungible tokens (NFTs) and the metaverse.</p><p><a href=\"https://cointelegraph.com/news/3-bull-market-narratives-2024-you-havent-heard\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-22T21:53:28.000Z",
    "title": " Binance and SEC lawyers present arguments on crypto as a security: Report ",
    "url": "https://cointelegraph.com/news/binance-sec-lawyers-crypto-securities",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMmIwZTY3OTItZjcwMC00ZTU2LWE0M2YtYTE4YmM3N2QyZmYwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Judge Amy Berman Jackson said she would take a joint motion from Binance and Binance.US to dismiss under advisement following arguments on whether certain tokens were securities.</p>\n                    <p><p>Lawyers representing cryptocurrency exchange Binance in a lawsuit brought by the United States Securities and Exchange Commission (SEC) called on a judge to dismiss the case after arguing whether specific tokens qualified as securities.</p><p>In a Jan. 22 hearing in U.S. District Court for the District of Columbia, Binance’s legal team presented arguments on <a href=\"https://cointelegraph.com/news/judge-sec-binance-arguments-crypto-security\">how the SEC treated cryptocurrencies</a> under current regulatory and legal frameworks. According to a Reuters report, a Binance lawyer <a href=\"https://www.reuters.com/legal/binance-kicks-off-oral-arguments-push-end-sec-lawsuit-2024-01-22/\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the SEC was taking a contradictory approach to crypto firms, “telling the industry [to] come in and register, while simultaneously with their other hand holding the door closed and preventing any viable path to do that.”</p><p>Reports from the courtroom suggested the SEC said the Howey test for securities was “clear” for all assets, including crypto, and regulators were not obligated to warn firms that they could be violating securities laws. Judge Amy Berman Jackson reportedly said she would take the SEC’s and Binance’s arguments under advisement.</p><p><a href=\"https://cointelegraph.com/news/binance-sec-lawyers-crypto-securities\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-22T22:00:09.000Z",
    "title": "Trezor Issues Security Alert Following Phishing Attack and Data Breach",
    "url": "https://news.bitcoin.com/trezor-issues-security-alert-following-phishing-attack-and-data-breach/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/trezor_phishing_attack-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Trezor Alerts Users to Phishing Risk After Security Breach\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/trezor_phishing_attack-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/trezor_phishing_attack-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/trezor_phishing_attack-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/trezor_phishing_attack-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/trezor_phishing_attack-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/trezor_phishing_attack-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/trezor_phishing_attack.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a recent security alert, Trezor announced a breach in its support ticketing system, potentially exposing the personal contact information of over 66,000 customers and raising the alarm for possible phishing attacks. Trezor Alerts Users to Phishing Risk After Security Breach Satoshilabs, the company behind the popular cryptocurrency hardware wallet Trezor, has issued a critical [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T22:00:27.000Z",
    "title": "LUNC and USTC burn campaign accelerates ecosystem revival",
    "url": "https://www.cryptopolitan.com/lunc-and-ustc-burn-campaign-accelerates/",
    "description": "Terra Classic community has successfully executed the burning of over 700 million LUNC and 230,000 USTC tokens. This move forms a part of the broader strategy to restore the Terra Classic (LUNC) and TerraUSD Classic (USTC) after their notable collapse over 20 months ago. Ongoing efforts in reviving LUNC The Terra Classic community remains steadfast [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T21:57:39.000Z",
    "title": "Bitcoin crashes below $40,000 – so what now?",
    "url": "https://www.cryptopolitan.com/bitcoin-crashes-below-40000-so-what-now/",
    "description": "Bitcoin, the undisputed heavyweight champion of the cryptocurrency world, took a nosedive below the $40,000 mark, stirring up a cocktail of reactions, speculations, and eyebrow raises. On Monday, the bellwether of the crypto market slipped into a zone it hadn&#8217;t seen since the early days of January &#8211; under the $40,000 threshold. This drop came [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T21:51:37.000Z",
    "title": "How Binance fared against the SEC today in court",
    "url": "https://www.cryptopolitan.com/how-binance-fared-against-the-sec-in-court/",
    "description": "Today&#8217;s courtroom drama saw Binance, the titan of the cryptocurrency exchange world, go toe-to-toe with the U.S. Securities and Exchange Commission (SEC). The stage was set in the federal courthouse, with the world&#8217;s largest crypto exchange advocating for the dismissal of a lawsuit brought by the SEC. This legal tussle is more than just a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T21:46:06.000Z",
    "title": "The elusive finish line: U.S. inflation fight’s final stretch",
    "url": "https://www.cryptopolitan.com/us-inflation-fights-final-stretch/",
    "description": "The U.S. economy&#8217;s struggle with inflation is like a marathon with a finish line that keeps moving. Just when we thought we were close to beating inflation, it turns out the hardest part is yet to come. Mohamed El-Erian from Allianz and Queens’ College at the University of Cambridge suggests that the final leg of [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-22T22:00:42.000Z",
    "title": "XRP Could Hit $0.39 Before Soaring 1000%: Crypto Analyst",
    "url": "https://www.newsbtc.com/xrp-news/xrp-could-hit-0-39-before-1000/",
    "description": "The price of XRP is currently navigating bearish territory. Following its descent below the 200-day exponential moving average (EMA), the digital currency has further dipped beneath the critical 0.618 Fibonacci retracement level. Despite this downward trend, renowned crypto analyst Dark Defender offers a glimmer of optimism for the XRP army. However, he also suggests that the market might face additional challenges first before embarking on a remarkable 1000% surge. In his latest analysis, the crypto analyst shared the weekly XRP/USD chart, employing a range of technical indicators including the Ichimoku Cloud, Fibonacci levels, ABC corrective patterns, and Elliott Wave theory. XRP Price Could Drop Further The chart provided depicts XRP&#8217;s price movements within the context of an Elliott Wave structure, which postulates that markets move in predictable, repetitive cycles. The analyst is identifying the progress of an ABC correction pattern within a larger Elliott Wave cycle. This correction consists of three waves: A (down), B (up), and C (down again), which is purportedly nearing completion. Dark Defender’s analysis suggests that the current market structure for XRP mirrors that of a period in early 2021 when the crypto asset surged by 1,060% in less than four months. According to Dark Defender, this is indicated by the confluence of the RSI readings and price action. Related Reading: XRP Crash Fears Mount As Whale Dumps 26 Million Tokens – Details The RSI, a momentum oscillator that measures the extent of recent price changes to evaluate overbought or oversold conditions, is marked with a white circle at a level of approximately 47.61, indicating neutrality. This is similar to the RSI level noted in 2021, suggesting a potential repetition in market sentiment and behavior. Moreover, the RSI is currently in an uptrend, as previously stated, with plenty of room to the upside. The Ichimoku Cloud, a collection of indicators that show support and resistance levels, as well as momentum and trend direction, shows that XRP is trading within the cloud on the weekly timeframe. A breakout from the cloud could signal a strong trend in the direction of the breakout. Fibonacci levels, derived from the Fibonacci sequence, are used to predict the extent of a correction or a continuation of a trend. The chart highlights several key Fibonacci retracement levels from a recent high to a low. These levels are $0.3917 (23.60%), $0.4623 (38.20%), $0.5286 (50.00%), and $0.6649 (70.20%). Related Reading: XRP Price Breakout To $5: Analyst Reveals Key Levels Of Importance According to the analysis, holding above or below the 50% retracement level at $0.5286 could indicate the likelihood of testing the next levels at $0.6649 or falling towards $0.3917, respectively. “#Equation: 1. XRP stays below $0.52 for 3 days &#8212;&#62;$0.39 in play 2. XRP stays above $0.52 for 3 days&#8212;&#62; $0.66 in play,” the analyst remarked. Followed By 1000% Price Rally Looking further ahead, the Fibonacci extension level at 161.80%, which translates to a price target of $1.8815, is highlighted as potential objectives for Wave 3 of the Elliott Wave cycle. The analyst has outlined a substantial potential increase, with a range up to $5.85, which would exceed the 161.80% Fibonacci extension level. However, it’s important for traders to note the main resistance trend line that has been pressing down on the price (red line), as well as the support trend line that has been upholding the price during retracements (blue line) are the most crucial price levels at the moment. The convergence of these trend lines forms a triangle that is a focal point for the price action going forward. A decisive break in either direction could lead to significant price moves &#8211; either to $0.39 or $0.66 in the short-term. In conclusion, Dark Defender’s analysis presents two pivotal scenarios, both leading to the anticipation of a major wave up (Wave 3) after the completion of the current corrective phase. “One way or another, wave 2 will be completed &#38; wave 3 is expected to target $1.88 &#8211; $5.85 for both scenarios,” Dark Defender concludes. At press time, XRP traded at $0.53195. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-22T22:08:00.000Z",
    "title": "Here Are Top 10 Countries With a Green Energy Mix for BTC Mining",
    "url": "https://coinedition.com/here-are-top-10-countries-with-a-green-energy-mix-for-btc-mining/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/PEGA-Pool-To-Tackle-Carbon-Footprint-Issue-of-BTC-Mining.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"93.8% of Bitcoin Hash Rate Concentrated in US, China, and Kazakhstan\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/PEGA-Pool-To-Tackle-Carbon-Footprint-Issue-of-BTC-Mining.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/PEGA-Pool-To-Tackle-Carbon-Footprint-Issue-of-BTC-Mining-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/PEGA-Pool-To-Tackle-Carbon-Footprint-Issue-of-BTC-Mining-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/PEGA-Pool-To-Tackle-Carbon-Footprint-Issue-of-BTC-Mining-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/PEGA-Pool-To-Tackle-Carbon-Footprint-Issue-of-BTC-Mining-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/PEGA-Pool-To-Tackle-Carbon-Footprint-Issue-of-BTC-Mining-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Recently, X user known as Seth, a pro-Bitcoin portfolio manager, called attention to the growing eco-friendly mining landscape of Bitcoin, with more miners shifting towards renewable energy sources for Bitcoin. Seth cited a report by Visual Capitalist that studies the countries with the most environmentally sustainable ecosystems for Bitcoin mining, including China and the United [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/here-are-top-10-countries-with-a-green-energy-mix-for-btc-mining/\">Here Are Top 10 Countries With a Green Energy Mix for BTC Mining</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]