[
  {
    "source": "CoinDesk",
    "date": "2023-08-31T08:55:49.000Z",
    "title": "Bitcoin Holdings on Crypto Exchanges Dwindle to 2M, Fewest Since January 2018",
    "url": "https://www.coindesk.com/markets/2023/08/31/bitcoin-holdings-on-crypto-exchanges-dwindle-to-2m-fewest-since-january-2018/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The number of BTC held in wallets tied to crypto exchanges has declined by 4% this month, data tracked by CryptoQuant show."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-31T08:45:25.000Z",
    "title": "Arkham IDs Robinhood as 5th-largest ETH holder",
    "url": "https://cointelegraph.com/news/ether-arkham-i-ds-robinhood-as-5th-largest-eth-holder",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/5a6b7e78-26ff-4c5f-b4f2-513c91c72fc1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Arkham Intelligence said the wallet contains approximately $2.54 billion worth of ETH under custody for user balances.</p>\n                    <p><p>Crypto analytics platform Arkham Intelligence has revealed financial services company and crypto trading platform Robinhood as a leading holder of Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) and the owner of the fifth-largest ETH wallet, which contains about $2.54 billion of the cryptocurrency.</p><p>Arkham <a href=\"https://twitter.com/ArkhamIntel/status/1696931898117800322\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> on X (formerly Twitter) that its recognition of Robinhood <a href=\"https://cointelegraph.com/news/bitcoin-whale-wallet-becomes-third-largest-holder-three-months\">possessing the third-largest Bitcoin wallet</a> garnered significant attention. However, it said less attention has been paid to its identification of Robinhood as the holder of the fifth-largest ETH wallet. In a separate <a href=\"https://twitter.com/ArkhamIntel/status/1696933188268954046\" target=\"_blank\" rel=\"noopener nofollow\">update</a>, Arkham emphasized that these funds are user balances under custody.</p><p>The largest Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) wallets in the world, <a href=\"https://bitinfocharts.com/bitcoin/address/bc1ql49ydapnjafl5t2cp9zqpjwe6pdgmxy98859v2\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to BitInfoCharts, are reportedly owned by Binance and Bitfinex.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Our identification of Robinhood as the owner of the third-largest Bitcoin wallet was widely covered.<br><br>But most coverage missed that we’ve also identified them as the owner of the 5th largest ETH wallet, holding $2.54B of ETH.<br><br>0x40B38765696e3d5d8d9d834D8AaD4bB6e418E489 <a href=\"https://t.co/Sczj11uLlA\">pic.twitter.com/Sczj11uLlA</a></p>&mdash; Arkham (@ArkhamIntel) <a href=\"https://twitter.com/ArkhamIntel/status/1696931898117800322?ref_src=twsrc%5Etfw\">August 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to Arkham Intelligence, a wallet associated with Robinhood holds various other cryptocurrencies, <a href=\"https://cointelegraph.com/news/how-significant-is-it-that-robinhood-accumulated-3b-in-bitcoin-over-three-months\">such as 122,076 BTC ($3.3 billion)</a>, 34.1 trillion Shiba Inu (<a href=\"https://cointelegraph.com/shiba-inu-price-index\">SHIB</a>) ($277.8 million), 4.9 million of Chainlink’s <a href=\"https://cointelegraph.com/chainlink-price-index\">LINK</a> ($29.7 million) and 2.6 million Avalanche (<a href=\"https://cointelegraph.com/avalanche-price-index\">AVAX</a>) ($29.6 million). Despite its prominence in stock trading, Robinhood’s cryptocurrency trading activity has declined, with second-quarter crypto revenue dropping to $31 million from the first quarter’s $38 million.</p><p>On Wednesday, Aug. 30, the company <a href=\"https://newsroom.aboutrobinhood.com/robinhood-wallet-adds-support-for-bitcoin-and-dogecoin-and-enables-ethereum-swaps/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> the expansion of its wallet product, incorporating \"custodial, sending, and receiving capabilities for Bitcoin and Dogecoin,\" alongside the existing feature of facilitating Ethereum swaps. This enhancement is a direct response to user demands for broader support, as stated by the company.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/how-significant-is-it-that-robinhood-accumulated-3b-in-bitcoin-over-three-months\"><strong><em>Robinhood accumulates $3B of Bitcoin in 3 months — What does this mean for markets?</em></strong></a></p><p>Upon its initial launch in March, the Robinhood Wallet introduced self-custody services, catering to the Polygon and Ethereum networks. It also encompassed various tokens like COMP, MATIC, SHIB, SOL, UNI, along with the USDC stablecoin.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/big-questions-did-the-nsa-create-bitcoin/\"><strong><em>Did the NSA create Bitcoin?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-31T08:45:19.000Z",
    "title": "Bitcoin price holds 200-day trend line as trader predicts low is in",
    "url": "https://cointelegraph.com/news/bitcoin-price-holds-200-day-trendline-btc-bottom",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/8c814270-064d-486c-bb6e-31aeba6ff17a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC price action is all about the 200-day moving average into the monthly close, and opinions on the outlook are increasingly polarized.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is retaining this week’s gains — and some traders are doubling down on their bullish BTC price bets.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/72459e6d-0e26-4d72-bd68-d4ae8380b0e1.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart with 200-day EMA. Source: TradingView</em></figcaption></figure><h2>Trader: Bitcoin price may have bottomed</h2><p>A key moving average is buoying low-timeframe BTC price action, which continues to preserve $27,000, data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> shows.</p><p>Bitcoin may have retraced from its local highs above $28,000, but bears have not yet sparked a full retrace of the move.</p><p>For some, this is increasingly positive news, as BTC/USD is now successfully holding a long-term trend line lost as support earlier in August.</p><p>This comes in the form of the 200-day exponential moving average (EMA), currently at $27,180.</p><p>Some hourly candles closing below into Aug. 31 were not enough to spark a more significant breakdown, and Bitcoin is tightly hugging the 200-day EMA into the August monthly close.</p><p>“Bitcoin is back above the daily EMA 200-Line,” popular trader Moustache told X subscribers. </p><blockquote>“A lot of people are waiting for a better entry, but I don't think it's going to happen.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/2c44c779-f0eb-4ec9-86da-b5e2409af277.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart with 200-day EMA. Source: Moustache/X</em></figcaption></figure><p>That perspective contrasts strongly with the slew of more bearish market takes from various well-known sources, many of which call for <a href=\"https://cointelegraph.com/news/bitcoin-price-prediction-metric-long-23k-btc\">a return to $25,000 or lower</a>.</p><p>Still optimistic, however, is fellow trader Jelle, who likewise placed significance on Bitcoin holding above $27,000.</p><p>“This is exactly what I want to see after an impulse. Spike up, shallow retrace, hold at key HTF level. Send it higher,” he <a href=\"https://twitter.com/CryptoJelleNL/status/1696877377328926862/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">summarized</a> on Aug. 30.</p><p>A <a href=\"https://twitter.com/CryptoJelleNL/status/1697156913459290469\" target=\"_blank\" rel=\"noopener nofollow\">subsequent update</a> revealed plans for longs in preparation for BTC/USD “taking out” local highs.</p><h2>BTC price outlooks diverge</h2><p>As Cointelegraph reported, BTC price action <a href=\"https://cointelegraph.com/news/bitcoin-doubt-btc-price-rally-23k-target\">has yet to reclaim</a> some other bull market moving averages from earlier in the month.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-price-prediction-metric-long-23k-btc\">Bitcoin metric with ‘100% long hit rate’ predicts $23K BTC price floor</a></em></strong></p><p>Trader and analyst Rekt Capital, cautious in the current climate, <a href=\"https://twitter.com/rektcapital/status/1696945790302765443\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> overnight that some of these are now acting as resistance.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/dd650882-0fcc-4a29-b498-9992d114dc2c.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Rekt Capital/X</em></figcaption></figure><p>Continuing on the day, monitoring resource Material Indicators likewise <a href=\"https://twitter.com/MI_Algos/status/1697055149238190437\" target=\"_blank\" rel=\"noopener nofollow\">warned</a> that Bitcoin could come full circle, and that a “resurgence in bullish sentiment” was required for a higher local high.</p><p>Based on signals from its proprietary trading tools, Material Indicators flagged $27,760 and $24,750 as the upside and downside levels to watch, respectively.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-31T09:06:45.000Z",
    "title": "Bitcoin withdrawals outpace deposits in trend unseen since FTX collapse",
    "url": "https://cryptoslate.com/insights/bitcoin-withdrawals-outpace-deposits-in-trend-unseen-since-ftx-collapse/",
    "description": "<p>Quick Take Recent data reveals a remarkable trend as Bitcoin withdrawals from exchanges are outpacing deposits at a rate unseen since the FTX collapse in November. This rapid divergence between deposits and withdrawals is accelerating, with the current ratio standing at 58,000 Bitcoin being withdrawn for every 45,000 Bitcoin deposited. This trend reflects a significant [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-withdrawals-outpace-deposits-in-trend-unseen-since-ftx-collapse/\">Bitcoin withdrawals outpace deposits in trend unseen since FTX collapse</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-31T08:14:39.000Z",
    "title": "GOP candidate Ramaswamy vows to keep crypto innovation stateside following Grayscale victory",
    "url": "https://cryptoslate.com/gop-candidate-ramaswamy-vows-to-keep-crypto-innovation-stateside-following-grayscale-victory/",
    "description": "<p>Vivek Ramaswamy, a Republican presidential candidate, expressed optimism about Bitcoin&#8217;s (BTC) prospects and views Grayscale&#8217;s recent victory as a promising indicator for cryptocurrency innovation in the United States, according to an Aug. 30 post on his official X handle. Ramaswamy described regulators, such as the Securities and Exchange Commission (SEC), as a shadow government and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/gop-candidate-ramaswamy-vows-to-keep-crypto-innovation-stateside-following-grayscale-victory/\">GOP candidate Ramaswamy vows to keep crypto innovation stateside following Grayscale victory</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-31T08:56:24.000Z",
    "title": "Coinbase CEO Brian Armstrong Shares Top 10 Crypto Startup Ideas for Entrepreneurs",
    "url": "https://www.cryptoglobe.com/latest/2023/08/coinbase-ceo-brian-armstrong-shares-top-10-crypto-startup-ideas-for-entrepreneurs/",
    "description": "Coinbase CEO Brian Armstrong has penned a blog post outlining his top 10 startup ideas for the burgeoning crypto industry. Armstrong believes that the crypto space is still in its early stages and presents a golden opportunity for entrepreneurs. He emphasizes that while Coinbase has the resources to build various crypto projects, they can’t cover […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-31T09:06:54.000Z",
    "title": "Judge Calls ETH A Commodity In Uniswap Lawsuit Dismissal Order",
    "url": "https://cryptodaily.co.uk/2023/08/judge-calls-eth-a-commodity-in-uniswap-lawsuit-dismissal-order",
    "description": "Judge Katherine is also the Judge overseeing the United States Securities and Exchange Lawsuit against Coinbase."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-31T08:30:10.000Z",
    "title": "Binance Finds Way to Serve Belgian Users After Cease Order",
    "url": "https://news.bitcoin.com/binance-finds-way-to-serve-belgian-users-after-cease-order/",
    "description": "<img width=\"768\" height=\"433\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2031493265-768x433.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Binance Finds Way to Serve Belgian Users After Cease Order\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2031493265-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2031493265-1024x577.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2031493265-768x433.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2031493265-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2031493265-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2031493265-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2031493265.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Cryptocurrency exchange Binance said it continues to provide services to residents of Belgium through its Polish entity. The announcement comes two months after the crypto trading company was ordered by the Belgian financial regulator to cease all crypto services in the country. Binance Offers Belgian Clients to Trade on Its Polish Platform Belgian customers of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T08:26:16.000Z",
    "title": "Is AI Safety a Top Priority for Australians? Survey Reveals Insights",
    "url": "https://www.cryptopolitan.com/ai-safety-priority-australians-survey/",
    "description": "In a comprehensive survey conducted by Roy Morgan in collaboration with the Campaign for AI Safety, it has been revealed that a significant majority of Australians harbor concerns about the safety of artificial intelligence (AI). The study found that 57% of the respondents believe that AI technology creates more issues than it resolves. Even more ... <a title=\"Is AI Safety a Top Priority for Australians? Survey Reveals Insights\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-safety-priority-australians-survey/\" aria-label=\"More on Is AI Safety a Top Priority for Australians? Survey Reveals Insights\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-31T09:00:48.000Z",
    "title": "Bloomberg Analysts Raises Approval Chances Of Spot Bitcoin ETF To 75%",
    "url": "https://www.newsbtc.com/bitcoin-news/bloomberg-analysts-raises-approval-chances-of-spot-bitcoin-etf-to-75/",
    "description": "Bloomberg senior analysts Eric Balchunas and James Seyffart have raised their approval odds of the first Bitcoin spot exchange-traded fund (ETF) in the United States (US) to 75%.  This development comes after the US District of Columbia Circuit ruled against the US Securities and Exchange Commission (SEC), stamping out the regulator’s denial of Grayscale’s conversion of its Grayscale Bitcoin Trust (GBTC) into a Bitcoin ETF. Court “Unanimity And Decisiveness” Unexpected, SEC Now In Tight Spot, Analysts Say According to his X post on August 30, Eric Balchunas explains that the new stance from him and his colleague was based on certain developments in Grayscale’s case against the SEC. Related Reading: US Bitcoin ETF Approval Could See North America’s ETF Volume Rise To 99.5% Although the Bloomberg analyst stated that a Gracyscale victory had been factored into their last 65% approval odds of a Bitcoin spot ETF, the court&#8217;s “unanimity and decisiveness” in ruling against the SEC was quite unanticipated. Furthermore, Balchunas explains that the SEC now faces a PR loss as Grayscale’s victory received media coverage from top media firms across the country. Combining this situation with the recent court defeat, the commission&#8217;s denial of the Bitcoin spot ETF will be “politically untenable.” In their official report, both Balchunas and Seyffart also highlighted that the SEC’s dilemma worsens as it faces its first deadlines on seven Bitcoin spot ETF applications between September 1 and September 4.  However, following the recent court ruling, the Bloomberg analysts believe the securities regulator will likely give a delayed order.  Source: Bloomberg Finally, if the SEC is somehow able to deny all applications, the analysts state the financial agency will struggle to reject Hashdex’s unique proposal. On August 25, the Brazillian asset manager filed to introduce a mixture of Bitcoin spot and futures ETF, secured by the Exchange for Physical (EFP) transactions, instead of a surveillance-sharing arrangement (SSA) with a crypto exchange.  Based on all the factors listed above, Balchunas and Seyffart rate the approval chances of a Bitcoin spot ETF in 2023 at 75%, with the potential of these odds rising to 95% at the end of 2024.  Bitcoin Poised For Massive Gains If Spot ETF Gains Approval Following the influx of Bitcoin spot ETF applications in June, there has been much optimism about the potential effects these trading products could have on the premier cryptocurrency.  A Bitcoin spot ETF tracks the price of BTC, granting investors indirect exposure to the asset without the risks of direct investment in the cryptocurrency itself. According to hedge fund expert Tom Lee, a spot ETF will likely create a high demand-to-supply ratio of the largest crypto asset, pushing its prices of BTC as high as $185,000. Related Reading: Ethereum ETF Race Gets Hotter As SEC Receives 11 Filings In One Week The market leader rose by over 7% following Grayscale’s court victory to trade at $27,974.42, according to data from Coingecko. However, BTC soon experienced a price correction, finding support around the $27,000 price zone. At the time of writing, Bitcoin is trading at 27,229.89 with a 0.9% loss in the last day. BTC trading at $27,223 on the daily chart &#124; Source: BTCUSD chart on Tradingview.com Featured image from Forbes India, chart from Tradingview."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-31T08:17:31.000Z",
    "title": "Cardano Price Prediction: ADA’s Potential $5 Push. InQubeta to rally too",
    "url": "https://www.crypto-news-flash.com/cardano-price-prediction-adas-potential-5-push-inqubeta-to-rally-too/",
    "description": "<img width=\"512\" height=\"322\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-114.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-114.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-114-300x189.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-114-343x215.jpg 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-114-326x205.jpg 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-114-163x102.jpg 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The InQubeta (QUBE) project remains on track as it sells over $2.4 million in tokens while a growing number of cryptocurrency analysts declare it one of the best cryptos to invest in this year. This top altcoin project aims to open up investments in artificial intelligence (AI) with the use of its Ethereum-based blockchain and [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-31T08:44:40.000Z",
    "title": "Courts Turning Against SEC’s Interpretation of Crypto: XRP Lawyer",
    "url": "https://coinedition.com/courts-turning-against-secs-interpretation-of-crypto-xrp-lawyer/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Ripple-Legal-Team-Counters-SEC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple Legal Team Counters SEC\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Ripple-Legal-Team-Counters-SEC.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Ripple-Legal-Team-Counters-SEC-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Ripple-Legal-Team-Counters-SEC-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Ripple-Legal-Team-Counters-SEC-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Ripple-Legal-Team-Counters-SEC-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Ripple-Legal-Team-Counters-SEC-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bill Morgan, a prominent Ripple attorney, has reaffirmed his optimistic outlook on the long-running U.S. Securities and Exchange Commission (SEC)-Ripple legal tussle. Morgan elucidated on the court’s stance against the Securities and Exchange Commission (SEC) in multiple lawsuits, and highlighted the repeated failure of the regulators in their lawsuits against crypto firms, as the court’s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/courts-turning-against-secs-interpretation-of-crypto-xrp-lawyer/\">Courts Turning Against SEC’s Interpretation of Crypto: XRP Lawyer</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-31T08:26:48.000Z",
    "title": "Meme Coins Continue To Stumble Through Marketwide Selloff",
    "url": "https://coinedition.com/meme-coins-continue-to-stumble-through-marketwide-selloff/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The past week has not been kind to popular meme coins like Shiba Inu (SHIB) and Pepe (PEPE). While other altcoins saw their prices rise after Grayscale’s victory over the SEC, most meme coins did not share in the market-wide bliss. CoinMarketCap shared that, at press time, SHIB was worth about $0.000008139 after its price [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/meme-coins-continue-to-stumble-through-marketwide-selloff/\">Meme Coins Continue To Stumble Through Marketwide Selloff</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]