[
  {
    "source": "Decrypt",
    "date": "2024-02-14T23:36:25.000Z",
    "title": "Starkware CEO Dismisses Starknet Airdrop, Token Unlocks Controversy: 'We Build Different'",
    "url": "https://decrypt.co/217583/starkware-ceo-dismisses-starknet-token-controversy",
    "description": "In an interview with Decrypt, Eli Ben-Sasson addressed complaints around details of Starknet’s upcoming STRK token launch."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-14T23:09:52.000Z",
    "title": "How to Make the Most of the 'Nifty Island' Play-to-Airdrop Campaign",
    "url": "https://decrypt.co/217575/nifty-island-make-most-airdrop-founder-interview",
    "description": "Playing Nifty Island? Here are a few tips straight from the game's co-founder for maximizing your time amid the airdrop push."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-14T23:15:01.000Z",
    "title": " Why South Korea’s N-Po generation is excited about crypto ",
    "url": "https://cointelegraph.com/news/south-koreas-po-generation-excited-about-cryptocurrency",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMzliYWVhMjEtNzY1YS00Yjc1LWE4YWEtZjcwMDE0MTQxMzA2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>South Korea's young people are known as the \"N-Po generation\" — a phrase that suggests they were abandoned. But they've found new hope in cryptocurrency.</p>\n                    <p><p>Amid economic challenges, South Korea is witnessing a surge in interest for digital currency, particularly among its youth — the “N-Po generation”</p><p>The N-Po generation — aged 20-39 — is grappling with economic challenges and societal pressures, but finds solace and opportunity in the booming digital market and the promises of <a href=\"https://cointelegraph.com/blockchain-for-beginners/what-is-web-3-0-a-beginners-guide-to-the-decentralized-internet-of-the-future\">Web3 tech</a>.</p><p>The generation’s troubles began in 1997 when South Korea faced a severe currency crisis, which led to a significant depreciation of the Korean won and required a bailout from the International Monetary Fund (IMF).</p><p><a href=\"https://cointelegraph.com/news/south-koreas-po-generation-excited-about-cryptocurrency\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-14T23:30:08.000Z",
    "title": "Report: Genesis Global Cleared to Unload $1.3 Billion in GBTC Shares",
    "url": "https://news.bitcoin.com/report-genesis-global-cleared-to-unload-1-3-billion-in-gbtc-shares/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/gen-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Report: Genesis Global Cleared to Unload $1.3 Billion in GBTC Shares\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/gen-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/gen-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/gen-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/gen-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/gen-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/gen-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/gen.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Genesis Global Capital has received authorization to offload its stake in Grayscale&#x2019;s Bitcoin Trust (GBTC), valued at approximately $1.3 billion. Genesis Global Permitted to Liquidate $1.3 Billion in Bitcoin Trust Shares According to Bloomberg, Genesis Global Holdco LLC secured Judge Sean Lane&#x2019;s approval to liquidate its GBTC investments, currently estimated at $1.3 billion. The request [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-14T23:30:04.000Z",
    "title": "Cardano Q4 2023 Report: TVL Growth And ADA Price Surge Outshine Competitors",
    "url": "https://www.newsbtc.com/news/cardano/cardano-q4-2023-report-tvl-growth-and-ada-price-surge-outshine-competitors/",
    "description": "Cardano (ADA) showcased remarkable progress during the fourth quarter (Q4) of 2023, surpassing its competitors and demonstrating impressive growth in key metrics, according to a Messari report.  Average Daily Transactions Soar In Q4 The report highlights that ADA&#8217;s revenue in USD increased by 66.7% quarter-over-quarter (QoQ), driven not only by ADA&#8217;s price action but also by a 10.6% QoQ increase in revenue denominated in ADA.  Furthermore, Cardano&#8217;s Treasury balance expanded by 2.6% QoQ, reaching 1.43 billion ADA, in line with growth trends observed in previous quarters. Currently, 20% of transaction fees contribute to the treasury, which can be adjusted through governance. Related Reading: These Developments Show That The Bitcoin Bullish Momentum Is Far From Over Another key metric, transactions, shows that Cardano experienced 10.9% QoQ growth in average daily transactions, outpacing the 1.6% QoQ growth in daily active addresses. The ratio of transactions to active addresses has steadily increased over the past year, indicating increased power users.  In Q4, the ratio of transactions to active addresses increased 9.2% sequentially and 45.0% year-over-year (YoY), reflecting higher average activity per user due to the introduction and development of various protocols throughout 2023. In terms of stake, active stake declined by 0.5% QoQ for the second consecutive quarter, amounting to 22.8 billion ADA. Engaged stake also remained relatively flat in the second half of 2023. However, active and engaged stake witnessed a YoY decrease of 10.2% and 9.6%, respectively. Cardano TVL Reaches New Milestone With the thawing of the crypto winter, the Cardano ecosystem experienced a significant surge in Total Value Locked (TVL) in USD, skyrocketing 166% QoQ and 693% YoY.  Indigo emerged as the largest protocol by TVL, surpassing Minswap. TVL of stablecoins on Cardano increased by 37% QoQ and 673% YoY, with the addition of Mehen&#8217;s USDM fiat-backed stablecoin scheduled to launch in March. Notably, TVL in USD reached an all-time high of $449 million on December 14th, representing the Q4 growth of 166%. This surge contributed to Cardano&#8217;s rise in TVL rankings from 15th to 11th during Q4, following its initial position of 34th at the beginning of the year. TVL denominated in ADA also achieved an all-time high, peaking at just over 700 million ADA. According to the report, Cardano&#8217;s TVL growth was primarily driven by the introduction of new stablecoins, namely iUSD and DJED, early in 2023. Stablecoins remained a crucial indicator of decentralized finance (DeFi) health, as the total value locked in stable assets rose by 36.8% to $21.5 million. Cardano&#8217;s stablecoin market cap also improved from 54th to 32nd among other networks. However, non-fungible token (NFT) activity declined during Q4. Transactions and trading volume in the NFT space decreased by 8.0% and 33.8% QoQ, respectively. Every year, NFT transactions and trading volume substantially declined by 58.3% and 68.3%, respectively.  The only metric to show growth in 2023 was the number of unique sellers, which increased by 213.2% YoY, averaging 270 unique sellers daily. Related Reading: Breakout Confirmed: Shiba Inu Price Set For A Possible 73% Surge Lastly, ADA&#8217;s price surged 127.2% QoQ, outperforming the overall crypto market&#8217;s 53.8% increase. This Q4 surge contributed to ADA&#8217;s YoY change of 145.2%. As of now, ADA continues to show significant gains with its current trading price of $0.5724. This reflects a significant increase of 5.5% over the past 24 hours and 8% over the past 30 days. These figures further solidify the bullish momentum of the token as the market enters the middle of the first quarter of 2024. Featured image from Shutterstock, chart from TradingView.com"
  }
]