[
  {
    "source": "Cointelegraph",
    "date": "2023-07-10T03:15:47.000Z",
    "title": "'Scammers' impersonate Crypto Twitter users on Threads as users near 100M",
    "url": "https://cointelegraph.com/news/crypto-twitter-impersonated-on-threads-by-possible-scammers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/1fcb79f8-c7ba-4b60-96d9-3fad9fef2bfe.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Threads are already seeing potential crypto scammers arrive on the platform as Crypto Twitter personas warn of impersonators on the app.</p>\n                    <p><p>Scammers appear to have wasted no time since the launch of Meta’s new microblogging app — with several high-profile Crypto Twitter users already warning of imposter accounts on Threads. </p><p>Threads was launched on July 5 and has seen sign-ups climb above 98 million in the days following. It’s still far away from Twitter’s estimated 450 million users. </p><p>However, over the past few days, multiple Crypto Twitter figures have already pointed out fake accounts <a href=\"https://cointelegraph.com/news/will-crypto-community-move-to-meta-twitter-rival-threads\">on Threads</a> impersonating others or themselves.</p><p>On July 8, decentralized finance platform Wombex Finance tweeted an image of a Threads account impersonating it — warning it could be a scammer as the project isn't on the platform.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Attention, <a href=\"https://twitter.com/hashtag/WombexWarriors?src=hash&amp;ref_src=twsrc%5Etfw\">#WombexWarriors</a>! <br><br>Please be aware that Wombex Finance DOES NOT have an account on the Threads platform. <br><br>Any account claiming to be Wombex Finance on that platform is fraudulent and is operated by a scammer!<br><br>To avoid scams, always refer to our official channels:… <a href=\"https://t.co/uU8fc2lTiB\">pic.twitter.com/uU8fc2lTiB</a></p>&mdash; Wombex (@WombexFinance) <a href=\"https://twitter.com/WombexFinance/status/1677625612813365248?ref_src=twsrc%5Etfw\">July 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The nonfungible token (NFT) influencer Leonidas <a href=\"https://twitter.com/LeonidasNFT/status/1677196328961441797\" target=\"_blank\" rel=\"noopener nofollow\">tweeted</a> a similar warning a day earlier to their over 93,000 followers, saying that they and other \"large NFT accounts\" are being impersonated by \"scammers\" on Threads. Leonidas said they have now made an account on Threads to combat impersonators.</p><p>Jeffrey Huang, known on Twitter <a href=\"https://cointelegraph.com/news/cz-powell-on-chain-sleuth-zach-xbt-legal-fees\">as Machi Big Brother</a>, tweeted his Threads profile on July 6 with one user pointing out there was already a Threads account impersonating his Twitter persona.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Damn dude you already have a scam account on threads <a href=\"https://t.co/QTDv3V39H7\">pic.twitter.com/QTDv3V39H7</a></p>&mdash; Nataly (NLC) (@NLC972) <a href=\"https://twitter.com/NLC972/status/1677029354046386176?ref_src=twsrc%5Etfw\">July 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>So far, the Thread accounts mentioned have avoided sharing any scam or phishing links, with most posting crypto-related content.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/elon-musk-accuses-mark-zuckerberg-of-cheating-twitter-vs-threads\"><strong><em>Elon Musk accuses Mark Zuckerberg of cheating: Twitter vs. Threads</em></strong></a></p><p>For years, Twitter has been a popular channel for crypto phishing scammers, with a common tactic involving <a href=\"https://cointelegraph.com/news/the-sandbox-ceo-s-twitter-was-hacked-used-to-promote-alleged-airdrop-scam\">hacking into the Twitter accounts</a> of well-known people and businesses and posting malicious links.</p><p>Such links usually attempt to dupe unwitting targets into sharing either their crypto exchange login, a crypto wallet seed phrase or have them connect a wallet to a <a href=\"https://cointelegraph.com/news/inferno-drainer-scam-as-a-service-has-stolen-5-9m-since-march-report\">crypto-draining smart contract</a>.</p><p>In the first half of this year, <a href=\"https://cointelegraph.com/news/656m-lost-from-crypto-hacks-scams-and-rug-pulls-in-h12023-report\">$108 million worth of crypto</a> was stolen in such phishing scams according to a report by Web3 security firm Beosin.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/sbf-hunter-gary-gensler-gags-beef-bitboy-gabriel-haines-hall-of-flame/\"><strong><em>Crypto Twitter Hall of Flame, Gabriel Haines: Shirtless shitposting and hunting SBF on the meme streets</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-10T03:10:58.000Z",
    "title": "Bitcoin Price Could Nosedive If It Continues To Struggle Below $31K",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-could-nosedive-30k/",
    "description": "Bitcoin price is moving lower below the $30,500 pivot level. BTC could decline heavily if there is a close below the $29,800 support zone in the near term. Bitcoin is moving lower below the $30,500 support zone. The price is trading below $30,500 and the 100 hourly Simple moving average. There was a break below a contracting triangle with support near $30,200 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could extend its decline if it stays below $31,200 for a long time. Bitcoin Price Shows Bearish Signs Bitcoin price moved into the red zone after it broke the $30,500 support zone. BTC traded below the $30,000 level but the downsides were limited. The price seems to be trading in a range above the $29,850 support zone. There was a move above the 23.6% Fib retracement level of the downward move from the $31,630 swing high to the $29,868 low. The price even attempted a fresh increase above the $30,500 resistance but failed. Bitcoin is now trading below $30,500 and the 100 hourly Simple moving average. There was also a break below a contracting triangle with support near $30,200 on the hourly chart of the BTC/USD pair. If there is another increase, the price might face resistance near the $30,300 level and the 100 hourly Simple moving average. The next resistance is near the $30,500 zone, above which the price might retest $30,750. It is close to the 50% Fib retracement level of the downward move from the $31,630 swing high to the $29,868 low. Source: BTCUSD on TradingView.com If the bulls push the price above the $30,750 level, there could be a drift toward $31,000. The next major resistance is near the $31,400 level. Any more gains could open the doors for a move toward the $32,000 resistance zone. More Losses in BTC? If Bitcoin’s price fails to clear the $30,300 resistance, it could continue to move down. Immediate support on the downside is near the $30,000 level. The next major support is near the $29,850 level, below which there could be a drop toward $29,400. Any more losses might send the price toward the $28,800 level. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $29,850, followed by $29,400. Major Resistance Levels – $30,300, $30,500, and $30,750."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-10T03:36:32.000Z",
    "title": "Shiba Inu’s Shibarium Blockchain Set to Launch in August: Ready to Kill More Zeros",
    "url": "https://www.crypto-news-flash.com/shiba-inus-shibarium-blockchain-set-to-launch-in-august-ready-to-kill-more-zeros-2/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-shibarium-blockchain-set-to-launch-in-august-ready-to-kill-more-zeros-2",
    "description": "<img width=\"1280\" height=\"711\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/shiba-7513487_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/10/shiba-7513487_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/shiba-7513487_1280-300x167.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/shiba-7513487_1280-1024x569.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/10/shiba-7513487_1280-768x427.png 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />According to Shytoshi Kusama, the lead Shiba Inu developer, the highly anticipated Shibarium blockchain is set to go live in August.  All Shiba Inu projects will be built on the Shibarium network once launched.  The long anticipated Shibarium blockchain is set to be launched in a few months. According to Shytoshi Kusama, the blockchain will [...]"
  }
]