[
  {
    "source": "Cointelegraph",
    "date": "2023-08-15T14:41:15.000Z",
    "title": "Sei token valued at $1.8B after beta launch, exchange listings",
    "url": "https://cointelegraph.com/news/sei-token-valued-1-8-b-after-beta-launch-exchange-listings",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/ac7388e3-c921-4043-9d84-91d6d82a8800.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The token opened to a wild trading session across major exchanges. </p>\n                    <p><p>Layer one trading blockchain Sei Network has reached a fully diluted valuation of $1.8 billion on the initial day of token listing.</p><p>On August 15, major exchanges such as Binance, Bybit and Bitget jointly listed the network's native token (SEI). On Binance, the token opened at $0.064 apiece before surging as high as $0.48. It currently <a href=\"https://www.binance.com/en/trade/SEI_USDT?ref=40896146&amp;theme=dark&amp;type=spot\" target=\"_blank\" rel=\"noopener nofollow\">trades</a> at $0.18 at the time of publication. The total supply is 10 billion SEI and the initial supply is 1.8 billion SEI. </p><p>The same day, Sei <a href=\"https://www.prnewswire.com/news-releases/sei-launches-mainnet-301900263.html\" target=\"_blank\" rel=\"noopener nofollow\">launched</a> the beta phase of its mainnet. Developers claim that during its alpha phase, the blockchain saw over 400 million transactions and 7.5 million test wallets created. Sei claims that its network can finalize transactions within 0.5 seconds and process up to 20,000 at a time. </p><p>Built on the Cosmos software development kit, Sei is designed to scale the trading capabilities of decentralized exchanges (DEXs) with its matching engine and order front-run prevention tools.</p><p>\"Current Web 3 infrastructure is unscalable, congested, and still too slow,\" said Jeff Feng, co-founder of Sei Labs, while mentioning that 30 Sei applications are scheduled to launch by the end of the year. Among other projects, DEX Sushiswap plans to launch a perpetual futures exchange on the Sei protocol.</p><p>Developers building on Sei have access to a $120 million ecosystem development fund, in part due to exchange MEXC Global's <a href=\"https://cointelegraph.com/news/mexc-launches-20m-ecosystem-fund-to-support-sei-network\">$20 million contribution in January</a>. In April, the firm raised $50 million for its ecosystem fund from Bitget and venture capital firm Foresight Ventures. Just days prior, Sei closed a $30 million round at a valuation of $800 million. The firm held its seed round of $5 million in August 2022. </p><p><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\">Deposit risk: What do crypto exchanges really do with your money?</a></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-15T14:45:00.000Z",
    "title": "Polygon (MATIC) Vs Solana? Analysts Choose Everlodge",
    "url": "https://cryptodaily.co.uk/2023/08/polygon-matic-vs-solana-analysts-choose-everlodge",
    "description": "<p>Polygon and Solana are two of DeFi&rsquo;s most popular altcoins. In 2023, both projects have grown their ecosystems, with Solana taking a slight lead over Polygon in terms of market cap. Now, however, a new cryptocurrency could outperform both.</p>\n<p>Everlodge is a new DeFi project set to release in 2023. It has revolutionary utility and could offer returns of 280% during its presale. Here&rsquo;s why analysts are choosing Everlodge over Polygon and Solana.</p>\n<p class=\"s6\">Find Out How To Buy Everlodge (ELDG)</p>\nEverlodge Brings Travel Properties To Web3 \n<p>Everlodge is a DeFi property marketplace designed for luxury villas, vacation homes, and hotels. Its marketplace lets individuals buy, sell and invest in fractional real estate on the blockchain. To achieve this, a property is minted into an NFT and fractionalized.</p>\n<p>For example, A $2 million luxury villa in Spain could be fractionalized into 20 fragments. Each can then be purchased or sold for $200,000, reducing the amount an investor needs for their investment.</p>\n<p>Everlodge will also offer a launchpad designed for property developers. This launchpad will let developers raise capital from the Everlodge community to kick-start developments. Investors will then profit from getting involved in developments early to maximize their returns.</p>\n<p>In addition to its launchpad and property marketplace, Everlodge will offer an exclusive rewards club. As part of the rewards club, investors will earn free nightly stays across properties throughout the Everlodge ecosystem. Several tiers will be available and will determine the properties and number of stays an individual gets. Members aren&rsquo;t obliged to use this timehowever. Instead, it can be sold on third-party platforms such as Airbnb to generate another income source.</p>\n<p>Investors who co-own properties will be able to use their NFT as collateral to obtain other short term loans. This will give them access to more capital to quickly scale their property portfolio.</p>\n<p>ELDG tokens will be used throughout the Everlodge ecosystem. They will grant holders a number of benefits such as staking bonuses, discounts on property and free stays at properties. Tokens will start at $0.01 when the Everlodge presale begins, and are expected to hit $0.035 before tokens are launched on mainstream exchanges.</p>\nExperts Predict That Solana Will Pass $30 \n<p>Solana&rsquo;s total value locked has consistently increased since the start of 2023. Over the last month, Solana&rsquo;s TVL has stayed above $1 billion. This indicates that confidence in Solana is starting to build following the project's crash in June.</p>\n<p>Furthermore, Solana&rsquo;s value has also increased. In the last 30 days, Solana has increased in value by 22.44%. At the time of writing, SOL was trading at $23.59. Given its steady increase, experts believe that Solana will pass $30 in August.</p>\nConfidence In Polygon Remains High Despite POL Proposal\n<p>Polygon&rsquo;s price increases slowed over the last week after Polygon founders proposed an upgrade to Polygon's native token. This proposal has caused Polygon to decrease in value by 2.24%, andcreated confusion throughout the Polygon community.</p>\n<p>The development team has proposed replacing MATIC tokens with POL. This new token would be used throughout the Polygon network, though investors are questioning why the upgrade needs to be made.</p>\n<p>Nonetheless, confidence in Polygon continues to rise. PancakeSwap recently launched its v3 on the Polygon zkEVM Mainnet Beta, which is a huge win for the Polygon ecosystem.</p>\n<p>Currently trading at $0.6897, analysts believe that Polygon will increase to $1 by the end of the year. Despite this increase, experts still predict that Everlodge will be a more profitable investment.</p>\n<p class=\"s12\">Find out more about the Everlodge (ELDG) Presale</p>\n<p class=\"s12\">Website: https://www.everlodge.io/</p>\n<p class=\"s6\">Telegram: https://t.me/everlodge</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>\n<p>&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T14:53:52.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and platform they need to build blockchain solutions. At this time, we can only make educated guesses about ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-15T14:40:21.000Z",
    "title": "AI-Powered Stock Picking Raises Doubts About Its Ability to Beat the Market",
    "url": "https://www.cryptopolitan.com/ai-powered-stock-picking-raises-doubts/",
    "description": "Artificial Intelligence (AI) is making waves in the world of stock picking, but can it really outperform human analysts? We take a closer look at three stocks that have been identified by the AI-driven analytics platform Danelfin as having a high probability of beating the market over the next three months. As we approach the ... <a title=\"AI-Powered Stock Picking Raises Doubts About Its Ability to Beat the Market\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-powered-stock-picking-raises-doubts/\" aria-label=\"More on AI-Powered Stock Picking Raises Doubts About Its Ability to Beat the Market\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-15T14:46:40.000Z",
    "title": "Singapore introduces regulations for single-currency stablecoins",
    "url": "https://crypto.news/singapore-introduces-regulations-for-single-currency-stablecoins/",
    "description": "Singapore&#8217;s Monetary Authority (MAS) has rolled out a regulatory framework for single-currency stablecoins linked to the Singapore Dollar or other G10 fiat currencies.  With this new setup, any token with a circulation value over S$5 million will earn the MAS-regulated&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-15T15:00:17.000Z",
    "title": "PEPE Shines With 20% Gains As Market Sees Correction, What’s Next?",
    "url": "https://www.newsbtc.com/analysis/pepe/pepe-shines-with-20-gains-as-market-sees-correction-whats-next/",
    "description": "PEPE surged remarkably in the past week posting gains of approximately 20%. The $0.0000011079 support level on the daily chart acted as a price pivot for the gains in the last few days, indicating an attempt to enter the buy zone.  PEPE&#8217;s previous attempts to break above the $0.0000015440 resistance zone between July 19-24 were unsuccessful. However, the bulls are in control, driving PEPE to attempt another break above the $0.0000015440 resistance.  Related Reading: US Prosecutors Accuse FTX’s Sam Bankman-Fried Of Using $100M To Curry Political Favors The rally in the past 7-days indicates a momentum shift for PEPE to a more positive outlook as the bulls attempt to seize control again.  PEPE Bulls Forcing Another Rally, But Bears Still Active Price volatility is evident when comparing price data for PEPE on the daily, weekly, and monthly timeframes. It trades at $0.000001348 on August 15 with a 6.03% price drop in 24 hours, while it has dropped 17% on the monthly time frame.   However, PEPE shows a more positive outlook on the weekly timeframe, although traders must tread cautiously as a price drop remains a possibility due to volatility.  The Relative Strength Index (RSI) value is 55.71 in the neutral zone reflecting traders&#8217; indecision in the market. Also, the Moving Average Convergence Divergence (MACD) is rising above the signal line, confirming the return of the bulls.  However, the size of the candles indicates low trading activity despite the gains making the price action moving forward quite tricky. The close of the August 15 candle will bring confirmation of the next price direction.  PEPE Shows Resilient Above $0.00000120 As Whale Comes Onboard In recent days, there has been a resurgence in PEPE&#8217;s performance. This trend is attributable to substantial investments from prominent investors and a rise in social engagement. According to Lookonchain data, there is a significant surge in whale attention to the PEPE token. The data shows a whale spent $ 1 million to acquire 807 billion PEPE tokens at $0.000001239. This whale involvement will likely have positive impacts on the price of PEPE. Another instance of this type of Whale involvement occurred on August 7. A holder of PEPE tokens sold a substantial amount of 2.26 trillion tokens at the price of $0.000001121 per token. Unfortunately, this action resulted in a significant decrease of $707,000 in the token&#8217;s overall market capitalization. Such contrasting maneuvers taking place in a short period might carry potential consequences for individual investors over an extended duration. Related Reading: Bitcoin Prediction: Crypto Analyst Forecasts New ATH by 2024 – Can It Happen? Meanwhile, the asset has been experiencing a notable resurgence, attracting investors&#8217; attention. The steady upward trajectory has pushed it from $0.000001185 to approximately $0.000001356, with a trading volume of over $100 million. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-15T14:43:00.000Z",
    "title": "Unlocking the Future: Chainlink Explores the Dynamics of Multi-Chain Applications",
    "url": "https://www.crypto-news-flash.com/unlocking-the-future-chainlink-explores-the-dynamics-of-multi-chain-applications/?utm_source=rss&utm_medium=rss&utm_campaign=unlocking-the-future-chainlink-explores-the-dynamics-of-multi-chain-applications",
    "description": "<img width=\"1038\" height=\"612\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Airchains has joined Chainlink&#039;s BUILD program, aiming to accelerate appchains and rollup technology adoption. \" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1.png 1038w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1-300x177.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1-1024x604.png 1024w\" sizes=\"(max-width: 1038px) 100vw, 1038px\" />Multi-chain involves numerous blockchains, emphasizing applications spanning them. Cross-chain evolution enhances access, competition, and innovation. Users gain via multi-chain and CCIP, boosting secure, seamless Web3. &#8220;Multi-chain&#8221; denotes the collection of numerous blockchains in the current landscape. Nonetheless, the phrase is predominantly used to depict applications introduced across multiple blockchains, commonly recognized as &#8220;multi-chain applications.&#8221; Multi-chain [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-15T14:57:08.000Z",
    "title": "Upcoming Meme Coins: SHIB Surges 7% Ahead Of Shibarium, FLOKI Introduces Gemstones, Big Eyes Turned To Infinity",
    "url": "https://coinedition.com/upcoming-meme-coins-shib-surges-7-ahead-of-shibarium-floki-introduces-gemstones-big-eyes-turned-to-infinity/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Big-Eyes-Turned-To-Infinity.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Upcoming Meme Coins: SHIB Surges 7% Ahead Of Shibarium, FLOKI Introduces Gemstones, Big Eyes Turned To Infinity\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Big-Eyes-Turned-To-Infinity.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Big-Eyes-Turned-To-Infinity-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Big-Eyes-Turned-To-Infinity-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Big-Eyes-Turned-To-Infinity-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Big-Eyes-Turned-To-Infinity-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Big-Eyes-Turned-To-Infinity-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Big-Eyes-Turned-To-Infinity-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Big-Eyes-Turned-To-Infinity-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Big-Eyes-Turned-To-Infinity-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Big-Eyes-Turned-To-Infinity-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Big-Eyes-Turned-To-Infinity-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Big-Eyes-Turned-To-Infinity-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Big-Eyes-Turned-To-Infinity-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Big-Eyes-Turned-To-Infinity-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Big-Eyes-Turned-To-Infinity-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Big-Eyes-Turned-To-Infinity-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The crypto realm is excitedly buzzing due to the imminent meme coin projects. Meme coins have transcended their comedic origins and are now potent assets with real-world applications. This shift in dynamics has prompted investors to flock towards meme coins, resulting in an overall market surge. Amidst various meme coins, some stand out for their [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/upcoming-meme-coins-shib-surges-7-ahead-of-shibarium-floki-introduces-gemstones-big-eyes-turned-to-infinity/\">Upcoming Meme Coins: SHIB Surges 7% Ahead Of Shibarium, FLOKI Introduces Gemstones, Big Eyes Turned To Infinity</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]