[
  {
    "source": "CoinDesk",
    "date": "2023-08-03T20:31:04.000Z",
    "title": "Coinbase Shares Jump as Exchange Beats Analyst Estimates for Q2 ",
    "url": "https://www.coindesk.com/business/2023/08/03/coinbase-shares-jump-as-exchange-beats-analyst-estimates-for-q2/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "tk"
  },
  {
    "source": "Decrypt",
    "date": "2023-08-03T20:21:43.000Z",
    "title": "Elvis Presley Dances Into the Metaverse via 'The Sandbox'",
    "url": "https://decrypt.co/151184/elvis-presley-dances-into-metaverse-sandbox",
    "description": "Some 3,000 Elvis Presley NFT avatars will launch in the Ethereum game that’s home to Snoop Dogg, McDonald’s, and many more."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-03T20:34:55.000Z",
    "title": "Coinbase Q2 earnings beat estimates amid Blackrock custody deal, institutional focus",
    "url": "https://cointelegraph.com/news/coinbase-q2-profits-blackrock-custody-institution",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/f70cf6a0-8500-4e8c-930c-855700506257.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The company beat estimates while non-trading revenue beat trading revenue. </p>\n                    <p><p>New York-based crypto exchange Coinbase reported revenue in the amount of $708 million in the second quarter of 2023, despite the regulatory issues it's faced in recent months, boosted by a custody deal with Blackrock and institutional focus.</p><p>The exchange said Q2 net revenue reached $663 million, down 10% versus the same period last year, yet beating early estimates on its growing market dominance in the United States as competitors such as Binance are bogged down by regulatory trouble. </p><p>The crypto exchange’s impressive performance was also attributed to the strong crypto price cycle last quarter where the likes of Bitcoin and other altcoins posted new yearly highs. </p><p>Early estimates from the Zacks Consensus Estimate put crypto exchange’s earnings at $643.4 million, a 20.4% decline from the past year during the same time. Another report from Messari suggested that  for the first time, Coinbase's non-trading revenue may exceed its trading revenue. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/64532b39-50e9-4356-b439-c621673f0cbf.jpg\"  /></figure><p>According to Coinbase, the predictions were correct. Non-trading revenue for Q2 2023 reached $335.4 million against transaction revenue of $327.1 million for the quarter. </p><p><em>Tristan Greene contributed to the story.</em></p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-03T20:30:00.000Z",
    "title": "Optimism transactions surpass Arbitrum, but what’s behind the uptick in users? ",
    "url": "https://cointelegraph.com/news/optimism-transactions-surpass-arbitrum-but-what-s-behind-the-uptick-in-users",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/4927dcfd-4221-4bb5-9d1c-37ea5e7ee5ce.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Transactions on Optimism recently eclipsed the Arbitrum network, but do the project’s fundamentals support a sustainable growth trajectory? </p>\n                    <p><p>Optimism (OP) is a <a href=\"https://cointelegraph.com/learn/a-beginners-guide-on-blockchain-layer-2-scaling-solutions\">Layer 2 scaling solution</a>, which operates as a separate blockchain built on top of Ethereum. Despite having a smaller total value locked (TVL) than its rivals, Optimism may still have the potential to thrive in the increasingly competitive DeFi landscape. </p><p>Being one of the pioneers in the DeF space, Optimism initially gained an initial but had to contend with fierce competition. The project has been trailing behind other scaling solutions in terms of daily transactions for the past six months. However, in late July, the situation changed as Optimism finally overtook its main competitor Arbitrum and is showing signs of increasing demand from users.</p><h2>The rise of Layer 2 scaling solutions</h2><p>The increase in Layer 2 activity on Ethereum has been significant, surpassing mainnet activity by more than four times, according to data from L2beat. Various solutions have emerged to address Ethereum's scalability challenges and each Layer 2 project focuses on different aspects such as privacy, specific decentralized applications and NFT marketplaces. </p><p>Consequently, the leaderboard of transactions and volumes constantly fluctuates based on demand, and each solution comes with its own advantages and drawbacks.</p><p>Optimism operates using rollups, bundling all transactions into a single transaction to be executed on the base layer, inheriting all security features from Ethereum. The philosophy behind Optimism assumes that all transactions are valid unless challenged and proven otherwise, allowing for cost-effective and fast transactions for users.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/3d657613-ea46-4832-8cea-232eb6bd7615.png\"><figcaption style=\"text-align: center;\"><em>Transactions: Ethereum mainnet vs. Layer-2. Source: L2beat</em></figcaption></figure><p>While Optimism and Arbitrum (ARB) rely on rollups, the core difference lies in Arbitrum's centralized approach where a single entity (sequencer) is responsible for submitting fraud proof. On Optimism, anyone can submit them.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/cdcf7fda-d974-47a1-9e9f-e95c50b40080.png\"><figcaption style=\"text-align: center;\"><em>Layer-2 transactions per second, 7-day change. Source: L2beat</em></figcaption></figure><p>Among the Layer-2 competitors, Optimism has been the standout performer since July 20, experiencing a 47% growth in daily transactions. This growth has enabled Optimism to surpass its competitor Arbitrum in daily transactions for the first time in 6 months.</p><p>Furthermore, the Optimism protocol has witnessed a surge in daily active addresses, with a 27.6% increase in 30 days, while Arbitrum's activity declined by 7.5%.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/bb2e02df-84ec-4962-9f4d-91fc00e35084.png\"><figcaption style=\"text-align: center;\"><em>Arbitrum vs. Optimism, number of unique daily active addresses. Source: GrowThePie</em></figcaption></figure><p>This trend indicates a potential shift in dominance, although drawing conclusions prematurely would be unwise. Arbitrum's main advantage lies in its much larger total value locked (TVL) compared to Optimism.</p><p>According to DefiLlama, Arbitrum currently holds a significant TVL of $2.35 billion, whereas Optimism's TVL is comparatively lower at $920 million. Arbitrum's dominance is especially evident in the decentralized finance (DeFi) applications it shares with Optimism, such as Uniswap and AAVE. Additionally, Arbitrum boasts an impressive $500 million TVL in the derivatives exchange GMX.</p><h2>Coinbase and Worldcoin back the recent surge in Optimism activity</h2><p>Two of the main reasons for higher demand on Optimism are increased use from Coinbase and Worldcoin. The project is also on track to implement important privacy mechanisms that could create another use case.</p><p>A pivotal moment for Optimism came with the launch of Coinbase's sandbox on July 21, providing developers with a test environment to build and deploy new applications on this Layer 2 solution. This initiative incentivizes the creation of new tools, applications, and protocols, fostering growth and innovation.</p><p>One of the projects utilizing Optimism as a scaling solution is Worldcoin, which has been gaining substantial attention. The token airdrop on July 26 further boosted activity on Optimism after supporting Uniswap on the Optimism mainnet. Worldcoin has also <a href=\"https://twitter.com/tiagosada/status/1673722545877417984\" target=\"_blank\" rel=\"noopener nofollow\">deployed</a> most of its Safe wallets on Optimism. This adoption has contributed significantly to the daily activity on the network, accounting for around 40%.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/ad5ff8e2-1945-4788-b5c3-4a6a27ca4293.png\"><figcaption style=\"text-align: center;\"><em>Share of transactions on Optimism Network, July 27. Source: Dune Analytics</em></figcaption></figure><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/worldcoin-stuck-downside-wld-price-analysis\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/worldcoin-stuck-downside-wld-price-analysis/amp\"><strong><em>Worldcoin stuck after 70% drop from peak — More downside for WLD price?</em></strong></a></p><h2>New privacy features could benefit Optimism</h2><p>Optimism's ecosystem is set to undergo several developments, including two proposals by O(1) Labs and RISC Zero to implement <a href=\"https://cointelegraph.com/news/zero-knowledge-multi-chain-bridges-venture-capital-merge-blockchain-technology\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/zero-knowledge-multi-chain-bridges-venture-capital-merge-blockchain-technology/amp\">zero-knowledge proof systems</a>. This move will provide the network with its own ZKP layers, akin to developments on Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) and ZKSync.</p><p>The growth in active addresses on Optimism is a positive indicator for the network's success and the successful launch of the Worldcoin project marked a milestone for this scaling solution. </p><p>The surge in daily active addresses is also promising, signifying the network's continuous growth and potential opportunities with the successful implementation of its privacy solutions.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-03T20:30:00.000Z",
    "title": "Polygon Zero accuses Matter Labs’ developers of plagiarism",
    "url": "https://cointelegraph.com/news/polygon-zero-accuses-matter-labs-developers-of-plagiarism",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/5a42b3ca-3a9a-4abb-a923-2046aa1824ba.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Polygon Zero has accused Matter Labs of copying significant code from its Plonky2 library to zkSync, a rival Ethereum layer-2 scaling solution.</p>\n                    <p><p>Polygon's zero-knowledge scaling arm, Polygon Zero, is accusing developers of Matter Labs of copy-pasting \"a substantial amount of source code\" from its Plonky2 library, <a href=\"https://mirror.xyz/0x70DF15b0208eFCeFaA541Da9A0ED6C4A884554Fc/gNi8coqXjd1ybFsQBAG7QARUkPHZECu7ihIRkpiVx2Y\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to an announcement on Aug. 3.</p><p>The alleged plagiarized code was found on zkSync, a competitor layer-2 scaling solution for Ethereum powered by zero-knowledge technology. Matter Labs is the developer of the zkSync ecosystem. </p><p>According to Polygon Zero, Matter Labs recently <a href=\"https://zksync.mirror.xyz/HJ2Pj45EJkRdt5Pau-ZXwkV2ctPx8qFL19STM5jdYhc\" target=\"_blank\" rel=\"noopener nofollow\">released</a> a proving system called Boojum with lots of code copy-pasted from critical components of its recursive SNARK Plonky2. A recursive SNARK is a cryptographic proof that allows one party (the prover) to demonstrate to another party (the verifier) that a certain statement is true, without revealing any additional information.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Crypto runs on the open source ethos. When projects don’t follow it, the ecosystem suffers.<br><br>We were disappointed to see that <a href=\"https://twitter.com/zksync?ref_src=twsrc%5Etfw\">@zksync</a> copied our code without attribution and made misleading claims about the original work, so we wrote this post.<br> <a href=\"https://t.co/8VnoYVWgI8\">https://t.co/8VnoYVWgI8</a></p>— Polygon Zero  (@0xPolygonZero) <a href=\"https://twitter.com/0xPolygonZero/status/1687153310699057152?ref_src=twsrc%5Etfw\">August 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Polygon Zero claims that the code was included without the original copyrights or clear attribution to the original authors. It also noted that Boojum is extremely similar to Plonky2's library. \"It uses the same strategy of parallel repetition to boost soundness in a small field, similar custom gates to efficiently arithmetize recursive verification, and the same lookup argument developed by our teammate Ulrich Haböck,\" reads the blog post.</p><p>Furthermore, Polygon noted that Matter Labs has marketed Boojum as 10x faster than Plonky2. \"Wondering how this is possible, given that the performance-critical field arithmetic code is directly copied from Plonky2?\"</p><p>According to Polygon Zero:</p><blockquote>\"It’s great to give credit, and we appreciate the recognition for our optimization of the Poseidon parameters. However, it might not be apparent to the reader that Boojum borrows far more than the Poseidon constants from Plonky2, and in fact that Boojum’s design is nearly identical to Plonky2’s, even to the point of copy-pasted code.\"</blockquote><p>Cointelegraph reached out to Matter Labs, but did not receive an immediate response. </p><p>This isn't the first time plagiarism accusations have surfaced in the crypto community. In March, a member of the Shiba Inu community reported that Shibarium layer-2 beta testnet and Rinia testnet <a href=\"https://cointelegraph.com/news/shiba-inu-community-divided-over-allegations-of-code-chain-id-plagiarism\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/shiba-inu-community-divided-over-allegations-of-code-chain-id-plagiarism/amp\">had identical chain IDs</a>, along with claims that the Shibarium alpha testnet was a copy of Polygon's Mumbai testnet.</p><p><a href=\"https://cointelegraph.com/magazine/ethereums-layer-2-zk-rollups-can-become-interoperable/\"><strong><em>Magazine: Here’s how Ethereum’s ZK-rollups can become interoperable</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T20:15:38.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T20:12:05.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  }
]