[
  {
    "source": "Crypto Daily",
    "date": "2024-01-21T21:35:53.000Z",
    "title": "XAI Hits Strong 30% Weekly Growth, Yet This Crypto Promises Even Greater Potential",
    "url": "https://cryptodaily.co.uk/2024/01/xai-hits-strong-30-weekly-growth-yet-this-crypto-promises-even-greater-potential",
    "description": "Discover the latest in cryptocurrency trends with Xai (XAI), as it outshines Bitcoin with a 30% weekly growth, merging gaming and finance innovatively. Uncover the potential of a presale project and its promising future in the gaming ecosystem, offering a unique opportunity for early adopters in the thriving crypto market."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-21T21:18:19.000Z",
    "title": "Trezor investigates security breach: User information exposed, digital assets safe",
    "url": "https://www.cryptopolitan.com/trezor-investigates-security-breach-user/",
    "description": "Trezor, a prominent provider of cryptocurrency hardware wallets, has launched an investigation into a recent security incident that occurred on January 17, 2024. This breach resulted in unauthorized access to the company&#8217;s support portal and the exposure of contact information belonging to approximately 66,000 users who had interacted with Trezor Support since December 2021.&#160; The [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-21T21:10:32.000Z",
    "title": "Bitcoin ETF launch leaves the market in search of direction",
    "url": "https://www.cryptopolitan.com/bitcoin-etf-launch-leaves-the-market/",
    "description": "Bitcoin&#8217;s recent ETF launch has left the cryptocurrency market uncertain, with analysts struggling to discern a clear trend in BTC price. As of the weekly close on January 21st, Bitcoin traded at around $41,718, inching closer to the $42,000 mark after a challenging week for bulls.&#160; While Bitcoin did not experience a significant downturn, it [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-21T21:20:00.000Z",
    "title": "Monero, Cardano, and Solana investors tracking Pushd in presale",
    "url": "https://crypto.news/monero-cardano-and-solana-investors-tracking-pushd-in-presale/",
    "description": "Pushd is conducting its presale. Amid this, Cardano, Solana, and Monero are struggling for traction"
  }
]