[
  {
    "source": "CoinDesk",
    "date": "2024-03-11T18:43:17.000Z",
    "title": "Solana DeFi's KMNO Airdrop Sparked Outrage. Kamino Responded With Changes",
    "url": "https://www.coindesk.com/business/2024/03/11/solana-defis-kmno-airdrop-sparked-outrage-kamino-responded-with-changes/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Kamino is trying to quell days of angst after it revealed key details for April's KMNO airdrop."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-11T19:00:23.000Z",
    "title": " Futureverse Studios debuts trailer for Readyverse battle royale game &#039;Open&#039; ",
    "url": "https://cointelegraph.com/news/futureverse-studios-debuts-trailer-web3-readyverse-battle-royale-game",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNzhmNGFhZGQtMGY2Ni00ZDEwLTkxMmEtOTY5YzVlZjFhZjY3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The development of “Open” could bring us one step closer to bringing the “Ready Player One” experience to reality.</p>\n                    <p><p>Futurverse Studios and Readyverse, the metaverse co-founded by Ready Player One author Ernest Cline and producer Dan Farah, launched the first official trailer for “Open,” a third-person battle royale video game. </p><p>The new game was developed in concert with Walker Labs, creators of 2022’s open-world shooter “Walker World.” It’s the first major gaming title developed for Cline’s Readyverse. According to the game’s website, it’ll feature multiple genres, IPs, and environments:</p><p>As Cointelegraph reported in January 2024, Readyverse will not only bring iconic assets, environments, and gameplay from the Ready Player One fiction franchise, <a href=\"https://cointelegraph.com/news/ready-player-one-metaverse-author-producer-intellectual-property-web3\">it’ll also tap into Warner Bros.</a>’ IPs as well. </p><p><a href=\"https://cointelegraph.com/news/futureverse-studios-debuts-trailer-web3-readyverse-battle-royale-game\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-11T18:54:41.000Z",
    "title": " Why is Ether (ETH) price up today? ",
    "url": "https://cointelegraph.com/news/why-is-ethereum-eth-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDEvNjJhOWU5MTEtNDNhMi00Y2M0LTkyYTEtZjQ4MTlkOGYwZGI1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ethereum price is up today, rallying to a new 2024 high at $4,065 as ETH whales accelerate the pace of their accumulation.</p>\n                    <p><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) price is up today, rallying 3.5% over the last 24 hours to reach a new year-to-date high of $4,065, according to data from <a href=\"https://pro.cointelegraph.com/\">Cointelegraph Markets Pro</a> and CoinMarketCap.</p><p>Ether’s price move comes as the leading crypto, Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), ventures into the $72,000 range by rising 4.4% over the last 24 hours and setting a <a href=\"https://cointelegraph.com/news/bitcoin-breaks-new-high-above-71-000\">new all-time high at $72,377</a> on March 11. Ether’s price is up 16% over the last seven days, mirroring BTC’s 15% price increase over the same period.</p><p>Let’s look at the factors driving Ether’s price today.</p><p><a href=\"https://cointelegraph.com/news/why-is-ethereum-eth-price-up-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-11T18:52:16.000Z",
    "title": " Telegram close to profitability, considering IPO, owner Durov says  ",
    "url": "https://cointelegraph.com/news/telegram-close-profitability-considering-ipo-owner-durov-says",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNDdlMDE0NmUtNGZkYy00NjBlLTlmZGQtZDk5Nzc2NTBjMzA3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The world’s fourth-largest messaging app may look for a U.S. listing after its IPO. Investor offers have valued Telegram at over $30 billion.</p>\n                    <p><p>Telegram co-founder Pavel Durov gave his first interview since 2017 to talk about the messaging service’s future, and particularly its financial future. An initial public offering (IPO) is under consideration, he said.</p><p>Pavel Durov and his brother Nikolai founded Telegram in 2013. Pavel Durov is now  the sole owner of the company, according to the Financial Times. He told the newspaper on March 11:</p><p>Durov said the company has “started to monetise,” and “we see value in [an IPO] as a means to democratise access to Telegram’s value.” This comes despite offers from investors at “$30bn-plus valuations.” The newspaper wrote that two unnamed sources had told it that Telegram would probably seek a listing in the United States once the company becomes profitable.</p><p><a href=\"https://cointelegraph.com/news/telegram-close-profitability-considering-ipo-owner-durov-says\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-11T18:56:50.000Z",
    "title": "Pushd (PUSHD) Skyrockets On the Dawn of Bitcoin (BTC) Halving: Ethereum (ETH) Whale Shifts Big into Presale",
    "url": "https://cryptodaily.co.uk/2024/03/pushd-pushd-skyrockets-on-the-dawn-of-bitcoin-btc-halving-ethereum-eth-whale-shifts-big-into-presale",
    "description": "Bitcoin (BTC) Halving occurs in the next 39 days and before that happens, many tokens, especially new ones, have been rising in their market prices."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-11T18:49:51.000Z",
    "title": "Cardano (ADA) & USDC (USDC) Bulls Diversify into Raffle Coin (RAFF) Triumph Post Binance Coin (BNB) Surge: Ethereum (ETH) at $4K, Shiba Inu (SHIB) Up 124%",
    "url": "https://cryptodaily.co.uk/2024/03/cardano-ada-usdc-usdc-bulls-diversify-into-raffle-coin-raff-triumph-post-binance-coin-bnb-surge-ethereum-eth-at-4k-shiba-inu-shib-up-124",
    "description": "In this moving preferences environment, between established assets and emerging projects, investors see on an everyday basis."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-11T18:40:26.000Z",
    "title": "Cardano (ADA) & USDC (USDC) Bulls Diversify Portfolios into Pushd (PUSHD) E-Commerce Triumph: Ethereum (ETH) Soars $4,000, Shiba Inu (SHIB) Sees a 130% Surge",
    "url": "https://cryptodaily.co.uk/2024/03/cardano-ada-usdc-usdc-bulls-diversify-portfolios-into-pushd-pushd-e-commerce-triumph-ethereum-eth-soars-4000-shiba-inu-shib-sees-a-130-surge",
    "description": "Cardano (ADA) and USDC (USDC) holders are looking to diversify their portfolio into new crypto projects and explore the opportunity to gain while the bullish market approaches"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-11T18:40:28.000Z",
    "title": "Tether to launch USDT on Celo blockchain",
    "url": "https://crypto.news/tether-launch-usdt-celo-blockchain/",
    "description": "Leading stablecoin issuer Tether is set to introduce its USDT token on the Celo blockchain, an Ethereum Virtual Machine-compatible platform transitioning to an Ethereum Layer 2 network."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-11T19:00:26.000Z",
    "title": "Crypto Expert Reveals Why Bitcoin Could Hit $200,000 By April",
    "url": "https://www.newsbtc.com/news/bitcoin/why-bitcoin-could-hit-200000/",
    "description": "A crypto analyst has forecasted Bitcoin’s price to surge to unprecedented highs ahead of the 2024 Bitcoin halving event scheduled for April. The cryptocurrency has already been experiencing significant gains, surpassing its previous all-time high to trade above $70,000.  Bitcoin’s Path To $200,000 In a recent X (formerly Twitter) post, crypto analyst, Gert van Lagen provided a compelling narrative supporting Bitcoin’s bullish trajectory leading up to the halving event in April 2024.  Related Reading: Crypto Expert Says Dogecoin, Shiba Inu, PEPE, Others Are About To Explode Sharing a price chart illustrating Bitcoin’s recent bullish movements, Lagen revealed that the cryptocurrency doubled in value within 10, 18 and 84 days following its surge to new all-time highs. As a result of this massive rallying trend, the analyst confidently expressed his belief that a move to $200,000 before the halving cycle in April is becoming more plausible.  Traditionally, the Bitcoin halving marks an event where the rewards for mining new blocks are cut by half, leading to a subsequent reduction in the cryptocurrency’s supply and contributing to a sustainable increase in its value. The highly regarded four-year event is usually accompanied by a significant bull run for Bitcoin and other cryptocurrencies within the market.  Contrary to historical patterns indicating that the Bitcoin bull run typically aligns with the halving event, the cryptocurrency has been experiencing unprecedented gains in anticipation of the halving, leading analysts to consider the possibility of an even larger price jump during the event.  The cryptocurrency’s achievement of a new all-time high before the halving stands as an extraordinary occurrence, underscoring the immense demand and growing popularity of Bitcoin in the crypto space.  Including Lagen, other analysts have predicted bullish outcomes for Bitcoin ahead of the halving event. According to crypto analyst, “The Bitcoin Therapist,” on X, Bitcoin is expected to rise to $100,000 by April. Additionally, a steady rise to new all-time highs at $75,000 is expected to occur before the halving, as stated by another crypto analyst.  Bitcoin Smashes Through $70,000 Barrier Following its previous surge to $70,000 on Friday, March 8, 2024, Bitcoin encountered a minor setback, retracting to a level just above $69,000. However, in the last 24 hours, the cryptocurrency has recorded an unprecedented surge, amassing approximately 2.68% and currently trading above the $71,000 price mark, according to CoinMarketCap. Related Reading: Shiba Inu BONE Token Garners Over 20,000 Picks On Binance Futures NEXT Program This price increase marks a historic milestone for the cryptocurrency as it reaches an all-time high above $71,000 for the first time. As of this moment, Bitcoin is trading around $71,312, experiencing significant price fluctuations that have contributed to its recent gains. The cryptocurrency’s 24-hour trading volume is also up by 82.80%, underscoring the increasing demand and interest in the pioneering digital currency. BTC price at $71,581 &#124; Source: BTCUSD on Tradingview.com Featured image from Yahoo Finance, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-11T18:45:32.000Z",
    "title": "Brother of ‘Cryptoqueen’ Responsible for $4,000,000,000 Scheme Released From US Prison: Report",
    "url": "https://dailyhodl.com/2024/03/11/brother-of-cryptoqueen-responsible-for-4000000000-scheme-released-from-us-prison-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/scammers-Crypto-Assets-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/scammers-Crypto-Assets-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/scammers-Crypto-Assets-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/scammers-Crypto-Assets-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/scammers-Crypto-Assets-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/scammers-Crypto-Assets-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/scammers-Crypto-Assets-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The brother of the infamous “Cryptoqueen” fugitive has reportedly been released from a US prison for his role in the $4 billion OneCoin crypto fraud. Bloomberg reports that Konstantin Ignatov, the brother of Ruja Ignatova, received a sentence of 34 months behind bars – time that he had already served in prison. Authorities said that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/11/brother-of-cryptoqueen-responsible-for-4000000000-scheme-released-from-us-prison-report/\">Brother of ‘Cryptoqueen’ Responsible for $4,000,000,000 Scheme Released From US Prison: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-11T18:41:26.000Z",
    "title": "Institutional Investors Set New Weekly Record With $2,700,000,000 in Crypto ETP Inflows: CoinShares",
    "url": "https://dailyhodl.com/2024/03/11/institutional-investors-set-new-weekly-record-with-2700000000-in-crypto-etp-inflows-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/banking-system-us-inflows.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/banking-system-us-inflows.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/banking-system-us-inflows.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/banking-system-us-inflows.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/banking-system-us-inflows.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/banking-system-us-inflows.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/banking-system-us-inflows.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets manager CoinShares says institutions poured a record $2.7 billion into crypto investment products last week for a sixth consecutive week of inflows. In its latest Digital Asset Fund Flows report, CoinShares says that year-to-date inflows for crypto investment products are also nearing the record mark. &#8220;Digital asset investment products saw record weekly inflows totaling [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/11/institutional-investors-set-new-weekly-record-with-2700000000-in-crypto-etp-inflows-coinshares/\">Institutional Investors Set New Weekly Record With $2,700,000,000 in Crypto ETP Inflows: CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]