[
  {
    "source": "Crypto Daily",
    "date": "2023-07-23T13:50:00.000Z",
    "title": "Crypto Weekly Roundup: UK Rejects Treasury’s Proposal And More",
    "url": "https://cryptodaily.co.uk/2023/07/crypto-weekly-roundup-uk-rejects-treasury-proposal-and-more",
    "description": "<p>The UK&rsquo;s HM Treasury has officially rejected the House of Commons Treasury Committee&rsquo;s recent recommendation to regulate crypto trading not as financial assets but as gambling instruments. Let&rsquo;s find out more.&nbsp;</p>\nBitcoin&nbsp;\n<p>Elon Musk&rsquo;s Tesla has continued to hodl its BTC reserves for the fourth consecutive quarter after being forced to divest 75% of its reserves in 2022 Q2.&nbsp;</p>\n<p>After hitting the range bottom, BTC looks to be heading higher once more, with the bulls looking to test the $31,000 to $32,000 major resistance again.&nbsp;</p>\nEthereum\n<p>In the midst of a rebounding crypto market, Vitalik Buterin has hinted at a forthcoming upgrade to the Ethereum network, which could potentially reduce costs by a factor of 100.</p>\nDeFi\n<p>DeFi protocol Conic Finance revealed that it had suffered an exploit, with the attacker draining over 1700 ETH worth $3.6 million from one of its Omnipools.</p>\n<p>Uniswap founder Hayden Adam&rsquo;s Twitter account suffered a breach, with hackers sending out several tweets leading users to scam websites and phishing links.</p>\n<p>Leading DEX platform Spectrum Finance has revealed its strategic collaboration with Cardano, the innovative smart contract platform.</p>\n<p>Axelar has launched the Interchain Token Service, a solution designed to enhance the interoperability of ERC-20 tokens across all EVM-compatible chains.</p>\nAltcoins\n<p>Solana Labs has announced the rollout of the Solang compiler that will help EVM developers transition to the Solana ecosystem.&nbsp;</p>\n<p>The crypto world eagerly awaits upcoming Litecoin's third halving event, which is expected to happen on August 2, 2023, once the 2,520,000th block is mined.&nbsp;</p>\nTechnology&nbsp;\n<p>Crypto experts have raised questions on central bank digital currencies like where are all the mainstream media articles or televised debates on the advantages or disadvantages of implementing CBDCs nationwide.</p>\n<p>Worldcoin has completed its migration to the Optimism ecosystem, with critical components such as the World ID and World App technology stack already migrated to the OP mainnet.&nbsp;</p>\n<p>Starknet has disclosed the initiation of \"appchains,\" a framework designed to enable developers to construct several application-specific blockchains within the Starknet ecosystem.</p>\nBusiness\n<p>The recently uncovered personal diaries of Alameda Research CEO Caroline Ellison could be used as key evidence in the upcoming trial of FTX founder Sam Bankman-Fried.&nbsp;</p>\n<p>Venture capital firms Coinfund and Polychain Capital have successfully raised a total of $350 million in their latest fundraising rounds, showcasing returning confidence in the crypto space.&nbsp;</p>\n<p>American investor Cathie Wood&rsquo;s ARK Invest sold another $50.5 million worth of Coinbase shares to cash in on the recent crypto market rally.&nbsp;</p>\n<p>Binance has abruptly ended its five-year partnership with the Argentine Football Association (AFA) after only one year.&nbsp;</p>\nRegulation\n<p>A bipartisan group of United States Senators has introduced the CANSEE Act to regulate DeFi platforms in order to curb money laundering and other financial transgressions.&nbsp;</p>\n<p>The UK government rejected a recent House of Commons Treasury Committee proposal, which suggested that retail crypto trading be regulated like gambling instruments.</p>\n<p>In the face of legal turbulence surrounding its co-founder, Do Kwon, blockchain firm Terraform Labs has appointed a new CEO.</p>\n<p>Myanmar&rsquo;s National Unity Government (NUG), a shadow government opposing the current military rule, is set to launch a crypto neobank operating on the Polygon blockchain network.</p>\n<p>Enforcement authorities in China&rsquo;s northern province of Shanxi have uncovered an alleged USDT money laundering scheme amounting to over $55 million.</p>\n<p>Third largest French bank, Societe Generale, has become the first bank to procure a licence to provide trading and custody of cryptocurrency assets.</p>\n<p>The International Monetary Fund (IMF) underscored its views that crypto requires &ldquo;comprehensive policies to safeguard economies and investors.&rdquo;</p>\n<p>The founder and former CEO of the now-defunct Thodex crypto exchange, Faruk Fateh Ozer, has received a seven-month prison sentence after he failed to submit relevant documents requested during the trial.</p>\n<p>Representative Ritchie Torres becomes the latest US lawmaker to level criticism against the SEC and its Chairman Gary Gensler&rsquo;s position on crypto.</p>\n<p>The clock has started ticking for the SEC to approve or reject BlackRock&rsquo;s application for a spot Bitcoin exchange traded fund.&nbsp;</p>\n<p>Coinbase CEO Brian Armstrong, is set to hold a private meeting with House Democrats on Wednesday, according to Democratic aides familiar with the agenda.</p>\n<p>US Judge Sarah Netburn has ordered the SEC and Ripple to agree to possible settlement dates should both parties believe them to be constructive at this stage.&nbsp;</p>\n<p>On Monday, the Financial Stability Board published its recommendations for a global regulatory framework for crypto-assets to &ldquo;promote the comprehensiveness and international consistency of regulatory and supervisory approaches.&rdquo;</p>\nNFT\n<p>Proof Collective is trying to rekindle interest in its Moonbirds NFTs with a brand new 20,000-piece Mythics collection, released almost a year after its initial mention in August 2022.</p>\n<p>Staking protocol EtherFi has called out the OpenSea marketplace for its decision to suspend the trading of the former&rsquo;s EtherFan NFT collection last week.&nbsp;</p>\nWeb3\n<p>Andreessen Horowitz partner Sriram Krishnan expressed confidence that Web3 has the potential to remedy the issues plaguing current Web2-based social media platforms.</p>\n<p>The developers behind Polygon Labs have proposed changes to their governance system that are integral to their forthcoming Polygon 2.0 roadmap.&nbsp;</p>\n<p>The potential of AR games has yet to be fully realized, but developers have already created lots of highly original apps to enhance our experiences in the physical world.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice. </p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-23T14:04:35.000Z",
    "title": "Google Cloud expands Web3 focus, eyes new products and partnerships",
    "url": "https://www.cryptopolitan.com/google-cloud-expands-web3-eyes-new-products-partnerships/",
    "description": "Google Cloud plans to introduce more Web3-focused products to make its computing offerings the first choice for industry firms and developers. This move follows the recent launch of a startup program aimed at supporting players within the Web3 segment. The tech giant’s cloud computing services unit will continue to build services similar to its Blockchain ... <a title=\"Google Cloud expands Web3 focus, eyes new products and partnerships\" class=\"read-more\" href=\"https://www.cryptopolitan.com/google-cloud-expands-web3-eyes-new-products-partnerships/\" aria-label=\"More on Google Cloud expands Web3 focus, eyes new products and partnerships\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-23T13:47:07.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-23T14:00:37.000Z",
    "title": "Bitcoin (BTC) Address Dormant For More Than 11 Years Moves $31 Million In BTC",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-dormant-address-moves-31-million-btc/",
    "description": "After over 11 years of inactivity, a dormant Bitcoin address containing $31 million in BTC suddenly came to life recently. On July 22, 2023, the address transferred its entire balance to a new address. Early BTC Address Comes Back To Life Bitcoin has been around since 2009, so there are dormant addresses that have been inactive for years that contain large amounts of BTC. Some of the early adopters of this cryptocurrency were able to buy in very cheap but the private keys to many of these addresses have been lost, locking them forever. Every now and then, however, some of these addresses suddenly come back to life as the owner regains asses to the funds. Related Reading: Dogecoin Becomes 8th-Largest Cryptocurrency After Adding $1 Billion To Market Cap The address here was one of the earliest Bitcoin addresses. According to on-chain data, it received its first transaction of 1,037 BTC in November 2012. At the time, the price of each BTC sold for only $12.41. It then received regular small deposits of BTC over the years. With the price of Bitcoin now at $29,828, this sets the total price at just over $31 million. 💤 💤 💤 💤 A dormant address containing 1,037 #BTC (31,080,234 USD) has just been activated after 11.3 years!https://t.co/6cW9vnTOhD — Whale Alert (@whale_alert) July 22, 2023 There are a few possibilities for what could have prompted the owner to suddenly move these funds after all this time, ranging from regaining control of the private keys to cashing out and taking a profit. Whatever the reason, the sudden reawakening of dormant Bitcoin addresses has the potential to cause a stir and spark interest in the Bitcoin community. BTC price remains below $30,000 &#124; Source: BTCUSD on Tradingview.com Implications For The Price Of Bitcoin When a large amount of BTC suddenly moves, it can cause temporary price fluctuations. An immediate selloff of the assets can lead to a drop in the market price of Bitcoin. However, these effects are often short-lived. Over the long run, an increase in circulating supply is unlikely to significantly impact Bitcoin’s price due to the rapid rate of adoption. Dormant BTC addresses have also been showing up in a flurry this year. Back in May, a similar address containing 1,000 BTC that was dormant for more than 11 years moved 400 BTC to a new wallet. In February, a BTC address that had been dormant for 11 years came back to life to move $9.6 million worth of BTC.  Related Reading: Ethereum Daily Users Plunge Amid Declining Network Revenue These examples show that even if an address has been dormant for a long time, there is always a possibility of the funds moving again. However, many of these addresses seem to be lost forever. According to IntoTheBlock, around 29% of the total Bitcoin circulating supply is now presumed lost forever after remaining stagnant for over five years.S Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-23T14:05:59.000Z",
    "title": "Uniswap Founder’s Twitter Account Hacked: Beware of Deceptive Scam Attempt",
    "url": "https://www.crypto-news-flash.com/uniswap-founders-twitter-account-hacked-beware-of-deceptive-scam-attempt/?utm_source=rss&utm_medium=rss&utm_campaign=uniswap-founders-twitter-account-hacked-beware-of-deceptive-scam-attempt",
    "description": "<img width=\"1201\" height=\"601\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Uniswap\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card.png 1201w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card-300x150.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Card-1024x512.png 1024w\" sizes=\"(max-width: 1201px) 100vw, 1201px\" />Uniswap founder Hayden Adams&#8217; Twitter account was hacked, promoting a scam and urging followers to click on a malicious link. Social media platforms like Twitter and Meta are taking measures to combat such scams, but vigilance is still crucial for users. Uniswap Founder&#8217;s Twitter Account Hacked in Scam Attempt Uniswap founder Hayden Adams&#8217; Twitter account [...]"
  }
]