[
  {
    "source": "Decrypt",
    "date": "2023-05-26T09:58:34.000Z",
    "title": "Crypto Exchange Gemini Turns to Ireland for European Headquarters",
    "url": "https://decrypt.co/142500/crypto-exchange-gemini-turns-ireland-european-headquarters",
    "description": "Amid increasing regulatory pressure in the U.S., the Winklevoss twins see the Emerald Isle as an “entry point” into the rest of Europe."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-26T09:55:00.000Z",
    "title": "Ripple Case In Final Stretch? Crypto Daily TV 26/5/2023",
    "url": "https://cryptodaily.co.uk/2023/05/ripple-case-in-final-stretch-crypto-daily-tv-26-5-2023",
    "description": "In Todays Headline TV CryptoDaily News:\n<p></p>\n<p>Sam Altman's Worldcoin secures $115m</p>\n<p>Crypto project Worldcoin, co-founded by OpenAI's CEO Sam Altman, has reportedly raised $115 million in a Series C round led by Blockchain Capital. Funds will be used to support its decentralized World ID and the recently released crypto wallet World App.&nbsp;</p>\n<p>Stablecoin market shrinks for the 14th consecutive month</p>\n<p>The stablecoin market is on track to shrink for the 14th consecutive month, a sign of capital draining from the digital asset space, and a troubling trend for the recovery of cryptocurrency prices.</p>\n<p>Ripple case could be in final stretch</p>\n<p>Ripple chief Brad Garlinghouse is confident that SEC court battle is coming to a close in a matter of weeks. The XRP price is back below $0.45 as it continues to oscillate around this level.&nbsp;</p>\nBTC/USD gained 0.5% in the last session.\n<p>Bitcoin rose 0.5% against the Dollar in the last trading session. The Williams indicator is giving a positive signal. Support is at 25419.3333 and resistance is at 27705.3333.</p>\n<p>The Williams indicator is giving a positive signal.</p>\n<p></p>\nETH/USD rose 0.4% in the last session.\n<p>Ethereum rose 0.4% against the Dollar in the last trading session. The Williams indicator is giving a positive signal. Support is at 1739.8533 and resistance is at 1883.5933.</p>\n<p>The Williams indicator is currently in the positive zone.</p>\n<p></p>\nXRP/USD saw a minor dip of 0.1% in the last session.\n<p>The Ripple-Dollar pair made a minor downwards correction in the last session, dropping 0.1%. The MACD is giving a positive signal. Support is at 0.4356 and resistance is at 0.4737.</p>\n<p>The MACD is giving a positive signal.</p>\n<p></p>\nLTC dropped 0.6% against USD in the last session.\n<p>The last session saw the Litecoin fall 0.6% against the Dollar. The ROC is giving a negative signal. Support is at 80.5433 and resistance is at 94.5033.</p>\n<p>The ROC is currently in the negative zone.</p>\n<p></p>\nDaily Economic Calendar:\n<p>AU Retail Sales</p>\n<p>Retail Sales measure the total receipts of retail stores. Monthly percent changes reflect the rate of change of such sales. Australia's Retail Sales will be released at 01:30 GMT, Italy's Business Confidence at 08:00 GMT, and French Consumer Confidence at 06:45 GMT.</p>\n<p>IT Business Confidence</p>\n<p>Business Confidence is a survey of the current business conditions. It indicates the short-term performance of the overall economy.</p>\n<p>FR Consumer Confidence</p>\n<p>Consumer Confidence is a leading index that measures the level of consumer confidence in economic activity. </p>\n<p>UK Retail Sales</p>\n<p>Retail Sales measure the total receipts of retail stores. Monthly percent changes reflect the rate of change of such sales. The UK's Retail Sales will be released at 06:00 GMT, the UK's CFTC GBP NC Net Positions at 20:30 GMT, and Japan's Leading Economic Index at 05:00 GMT.</p>\n<p>UK CFTC GBP NC Net Positions</p>\n<p>The weekly Commitments of Traders (COT) report provides information on the size and the direction of the positions taken. The report focuses on speculative positions.</p>\n<p>JP Leading Economic Index</p>\n<p>The Leading Economic Index is an economic indicator comprising 12 indices such as account inventory ratios, machinery orders, stock prices, and other leading economic indicators.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-26T09:59:27.000Z",
    "title": "Crypto firm closes doors, blames US regulatory environment",
    "url": "https://www.cryptopolitan.com/crypto-firm-closes-doors/",
    "description": "Unbanked, a cryptocurrency fintech firm specializing in crypto custody and payments services, has recently announced its decision to shut down operations due to the challenging regulatory environment for cryptocurrencies in the United States. In a blog post on May 26, Unbanked&#8217;s co-founders, Ian Kane, and Daniel Gouldman, expressed their disappointment in the regulatory landscape that ... <a title=\"Crypto firm closes doors, blames US regulatory environment\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-firm-closes-doors/\" aria-label=\"More on Crypto firm closes doors, blames US regulatory environment\">Read more</a>"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-05-26T10:06:09.000Z",
    "title": "Top DeFi Dapps on Stacks",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-defi-dapps-on-stacks/",
    "description": "<p>You can compare Stacks to any layer 2 chain, but it’s built on Bitcoin. In contrast to Bitcoin, it can handle smart contracts and Dapps. They cover all kinds of different fields, For example, finance or NFTs, but also social or wallets. So, we take a closer look at two top decentralized Dapps on Stacks. When [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-defi-dapps-on-stacks/\">Top DeFi Dapps on Stacks</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-26T09:45:00.000Z",
    "title": "John E. Deaton Slams Bitcoin Maximalists for Backing SEC’s Gensler",
    "url": "https://coinedition.com/john-e-deaton-slams-bitcoin-maximalists-for-backing-secs-gensler/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Any_so_called_Bitcoin_Maxi_supporting_GaryGensler_s_political-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Any_so_called_Bitcoin_Maxi_supporting_GaryGensler_s_political-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Any_so_called_Bitcoin_Maxi_supporting_GaryGensler_s_political-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Any_so_called_Bitcoin_Maxi_supporting_GaryGensler_s_political-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Any_so_called_Bitcoin_Maxi_supporting_GaryGensler_s_political-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Any_so_called_Bitcoin_Maxi_supporting_GaryGensler_s_political-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Any_so_called_Bitcoin_Maxi_supporting_GaryGensler_s_political.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In a recent Twitter outburst, cryptocurrency advocate John E. Deaton issued a scathing rebuke towards Bitcoin maximalists supporting the actions of Gary Gensler, Chair of the Securities and Exchange Commission (SEC). Deaton accuses them of abandoning their libertarian views on government overreach for the sole purpose of channeling more money into Bitcoin​​. Deaton also referenced [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/john-e-deaton-slams-bitcoin-maximalists-for-backing-secs-gensler/\">John E. Deaton Slams Bitcoin Maximalists for Backing SEC’s Gensler</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]