[
  {
    "source": "CoinDesk",
    "date": "2023-10-12T07:52:32.000Z",
    "title": "Bitcoin Drops Below $27K, Ether Stable as Jim Cramer Pokes Bearish Calls",
    "url": "https://www.coindesk.com/markets/2023/10/12/bitcoin-drops-below-27k-ether-stable-as-jim-cramer-pokes-bearish-calls/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Ether showed signs of stability after a nearly weeklong decline."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-12T07:43:24.000Z",
    "title": "BarnBridge DAO votes to comply with SEC order ",
    "url": "https://cointelegraph.com/news/barnbridge-dao-votes-comply-sec-order",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/46604eea-2927-4d42-9150-b54d1adbd04b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The voting ended with an unanimous decision to comply with the SEC’s potential demands and pay fines if necessary.</p>\n                    <p><p>BarnBridge decentralized autonomous organization’s (DAO) members have conducted their voting on how to react to the United States Securities Exchange Commission’s (SEC) potential demands. </p><p>The voting ended on Oct. 12 with an unanimous <a href=\"https://snapshot.org/#/barnbridge.eth/proposal/0x6eacba217278781b805686d7ecffabc2a07beca16da8d97e2b63c1cf235caf81\" target=\"_blank\" rel=\"noopener nofollow\">decision</a> to comply with the SEC’s potential demands and pay fines if necessary. Tyler Ward and Troy Murray were nominated as DAO’s special delegates for dealing with the regulator. At the same time, Douglas Park remains the DAO’s legal counsel and will sign the final version of the Order on behalf of BarnBridge. Voters have also let the DAO’s Treasury “sell all tokens that it is permitted to sell” if needed. </p><p>No information is available on any specific order the SEC has sent to BarnBridge. The regulator’s investigation into this DAO <a href=\"https://cointelegraph.com/news/barnbridge-dao-calls-halt-on-work-amid-sec-investigation\">began in June 2023</a>. BarnBridge immediately paused all its work and closed the liquidity pools. Addressing the members, Ward provided no details for the SEC's investigation due to its “non-public nature.”</p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/vitalik-buterin-dao-staking-pool\"><strong><em>Vitalik Buterin voices concerns over DAOs approving ETH staking pool operators</em></strong></a></p><p>The price of BarnBridge’s native token, BOND, has been gradually falling since its last peak on July 25, when <a href=\"https://cointelegraph.com/news/this-little-known-defi-crypto-token-has-rallied-over-800-in-a-month\">it reached $21.69</a>. By press time, it <a href=\"https://www.coingecko.com/en/coins/barnbridge\" target=\"_blank\" rel=\"noopener nofollow\">stands</a> at $1.67, according to CoinGecko. Its all-time maximum, $185.7, happened in October 2020. </p><p>In 2021, BarnBridge <a href=\"https://cointelegraph.com/news/barnbridge-unveils-application-to-maintain-portfolio-weightings-of-erc-20-tokens\">announced its application</a>, \"SMART Exposure,\" enabling users to passively maintain a particular weighting between the assets in a specific ERC-20 token pair through automatic rebalancing.</p><p>In November 2022, the SEC instituted administrative proceedings <a href=\"https://cointelegraph.com/news/american-cryptofed-registration-at-risk-as-sec-alleges-filing-anomalies\">against the first legally recognized DAO</a> in the U.S., American CryptoFed DAO. According to the SEC, the Form S-1 registration statement filed by American CryptoFed lacked vital information, such as audited financial statements and details about its business and management.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/barnbridge-dao-votes-comply-sec-order&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/legal-dangers-getting-involved-daos/\"><strong><em>The legal dangers of getting involved with DAOs</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-12T08:03:43.000Z",
    "title": "SBF And Caroline Ellison Conspired To Keep Bitcoin Under $20,000",
    "url": "https://cryptodaily.co.uk/2023/10/sbf-and-caroline-ellison-conspired-to-keep-bitcoin-under-20000",
    "description": "Ellison’s statements bring to the fore concerns about potential Bitcoin price tampering and financial wrongdoing during the FTX trial."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-12T08:08:50.000Z",
    "title": "AI Image Generators Perpetuate Stereotypes and Biases: A Deep Dive into the Problem",
    "url": "https://www.cryptopolitan.com/ai-image-generators-perpetuate-stereotypes/",
    "description": "Artificial intelligence has undoubtedly revolutionized various industries but is not immune to biases and stereotypes. Recent investigations have shed light on the tendencies of generative AI systems, such as Midjourney, Dall-E, and Stable Diffusion, to perpetuate stereotypes and reduce diverse national identities to simplistic caricatures. The problem unveiled BuzzFeed&#8217;s ill-fated experiment with 195 AI-generated Barbie ... <a title=\"AI Image Generators Perpetuate Stereotypes and Biases: A Deep Dive into the Problem\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-image-generators-perpetuate-stereotypes/\" aria-label=\"More on AI Image Generators Perpetuate Stereotypes and Biases: A Deep Dive into the Problem\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-12T07:43:45.000Z",
    "title": "BIGTIME unleashed: Coinbase and OKX partnership to launch the blockchain gaming token",
    "url": "https://www.cryptopolitan.com/bigtime-coinbase-okx-blockchain-gaming-token/",
    "description": "In a groundbreaking collaboration, Coinbase, one of the world&#8217;s preeminent cryptocurrency exchanges, and OKX, a notable crypto trading platform, have joined forces to introduce Big Time (BIGTIME) to the spot market. This innovative project, crafted by a team of adept game developers with a history of working on blockbuster titles like Fortnite, Call of Duty, ... <a title=\"BIGTIME unleashed: Coinbase and OKX partnership to launch the blockchain gaming token\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bigtime-coinbase-okx-blockchain-gaming-token/\" aria-label=\"More on BIGTIME unleashed: Coinbase and OKX partnership to launch the blockchain gaming token\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-12T07:40:29.000Z",
    "title": "E-Sports Shanghai Masters Returns with a Bang in December",
    "url": "https://www.cryptopolitan.com/e-sports-shanghai-masters-returns/",
    "description": "The E-Sports Shanghai Masters is set to make a triumphant return after a two-year hiatus, promising an electrifying showcase of talent at the Jing&#8217;an Sports Center from December 1 to 5. Jointly introduced by the Shanghai Sports Bureau and CMG (China Media Group) Shanghai Station, this eagerly anticipated event has upped the ante by featuring ... <a title=\"E-Sports Shanghai Masters Returns with a Bang in December\" class=\"read-more\" href=\"https://www.cryptopolitan.com/e-sports-shanghai-masters-returns/\" aria-label=\"More on E-Sports Shanghai Masters Returns with a Bang in December\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-12T07:59:54.000Z",
    "title": "How Low Can XRP Price Go Before It Skyrockets To $5? Analyst Forecasts",
    "url": "https://www.newsbtc.com/analysis/xrp/how-low-xrp-price-before-skyrockets-to-5/",
    "description": "A meticulous analysis of the XRP/USD trading pair by renowned crypto analyst, Jaydee, has shed light on some compelling technical patterns and indicators. With the crypto community eagerly anticipating XRP&#8217;s next major move, Jaydee offers insights that hint at two critical price thresholds before a potential rally toward $5. What’s Next For The XRP Price? The analyst today shared the following 1-week chart of XRP and explained: “XRP &#8211; PATIENCE &#38; ignoring the news is key! Let&#8217;s take a step back and look at a more macro view! Though short term may look scary (even w/all these irrelevant news), the weekly chart still creating ‘hidden bullish divergence’ on RSI/SRSI.” Central to Jaydee&#8217;s analysis of the logarithmic scale chart of XRP/USD is the identification of a symmetrical triangle pattern. This pattern on a chart signifies a phase of consolidation, after which the price will either break out or break down. A breach of the lower trendline signals the onset of a fresh bearish trend, whereas a surge past the upper trendline suggests the commencement of a new bullish trend. Related Reading: Bulls Vs Bears: XRP Price Gears Up For Big Squeeze, Which Side Will Prevail? Jaydee highlights the significance of the $0.4797 support level within this pattern for the XRP price. The chart suggests robust support at this price level which aligns with the 61.8% Fibonacci retracement level. The analyst also brings attention to the 78.6% Fibonacci retracement level which he sees as the lower end of the dip area. The chart implies that XRP could further drop significantly towards this area below $0.35. In the event of such a short-term pullback, this lower Fibonacci level could very well delineate a critical support area. As remarked by Jaydee in the tweet, the Relative Strength Index (RSI) and the Stoch RSI have both formed hidden bullish divergences. The RSI of XRP/USD in the 1-week chart currently stands around 45.53, and is in neutral territory, not signaling any immediate overbought or oversold conditions. Yet, the divergence in the RSI presents a captivating narrative. Jaydee highlights the hidden bullish divergence, where the price charts higher lows while the RSI is trending with lower lows, typically an indication of diminishing bearish momentum. This is usually seen as a bullish sign as it suggests that the downward momentum is weakening and could well be a precursor to a bullish phase. The Stochastic RSI stands at 7.66 and shows the same pattern. Overall, Jaydee&#8217;s forecast for XRP is bullish in the medium to long term. Related Reading: XRP Price Retest: A Prelude To A Stunning Surge To $2, Predicts Expert In conclusion, the convergence of these technical indicators and the unwavering support at $0.4797 shows strong bullish undercurrents for the XRP price. Still, it is conceivable that XRP might face a further short-lived drawdown before launching into a significant bullish ascent. Assuming these patterns persist, a leap to a $5 pricing (green arrow) seems plausible as per Jaydee. Feedback From The XRP Community Delving into the commentary, Jaydee added nuances, stating, &#8220;Scary on the daily chart (glad we knew that 12% correction was coming). The weekly chart is way different compared to daily.&#8221; When queried by a user named Steven about the potential implications of Bitcoin ETF approvals and increased adoption and utility, Jaydee responded, &#8220;Charts will still play out. May even have a &#8216;wick&#8217; at higher levels on higher time frames. But the body candle close on the macro view is the true value, rather than any wicks. Wicks would just be &#8220;noise&#8221; caused by news. Didn&#8217;t all these bullish news REKT many already?&#8221; On the timing of the $5 forecast, Jaydee candidly remarked, &#8220;Nobody can predict timeframe or knows when we would start getting the next impulse move up. I just placed an arrow wherever. Wait a minute&#8230; You really think we are God?&#8221; Responding to a user&#8217;s inquiry about XRP potentially dipping to $0.35 creating a lower low, Jaydee clarified, &#8220;It would if a body candle closes there. But possible wicks can head down there.&#8221; At press time, XRP traded at $0.4821. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-12T08:08:13.000Z",
    "title": "Is it Time To Cash Out of Solana and Dogecoin? Tradecurve Markets Emerges As TradFi Leader",
    "url": "https://www.crypto-news-flash.com/is-it-time-to-cash-out-of-solana-and-dogecoin-tradecurve-markets-emerges-as-tradfi-leader/?utm_source=rss&utm_medium=rss&utm_campaign=is-it-time-to-cash-out-of-solana-and-dogecoin-tradecurve-markets-emerges-as-tradfi-leader",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-46.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-46.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-46-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-46-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In 2023, bulls and bears have fought to take control of the crypto market. With bears appearing to take the upper hand, should you consider cashing out of Solana and Dogecoin? While experts weigh in on that, Tradecurve Markets has emerged as the leader in the TradFi revolution.  &#62;&#62;Register For The Tradecurve Markets Presale&#60;&#60; Solana’s [...]"
  }
]