[
  {
    "source": "Decrypt",
    "date": "2023-09-15T19:32:17.000Z",
    "title": "Crypto Companies Aren't Banks, Hong Kong Warns Investors",
    "url": "https://decrypt.co/197359/crypto-companies-arent-banks-hong-kong-warns-investors",
    "description": "“Describing themselves as banks may mislead the public into entrusting the companies with their savings,” read the regulator's notice."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-15T19:20:00.000Z",
    "title": "Coinbase CEO stands up for DeFi, Polygon says $1B ZK-rollup paying off: Finance Redefined ",
    "url": "https://cointelegraph.com/news/coinbase-ceo-stands-up-for-defi-polygon-says-1b-zk-rollup-paying-off-finance-redefined",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/2de294f3-7291-4c52-8579-3a419135cca2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Coinbase’s CEO has become the latest ally of the DeFi space, calling for apt regulations of the ecosystem rather than enforcement action by regulatory bodies. </p>\n                    <p><p>Welcome to Finance Redefined, your weekly dose of essential <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> insights — a newsletter crafted to bring you the most significant developments from the past week.</p><p>The past week in DeFi saw Coinbase CEO stand up for the nascent ecosystem amid growing calls for enforcement action, while Polygon CEO has said that its $1 billion zero-knowledge proof rollup bet is paying off.</p><p>MakerDAO’s founder believes decentralized stablecoins could dominate crypto, while Solidus Labs says decentralized exchanges have become a magnet for wash trading.</p><p>The top 100 DeFi tokens had another mixed week with bearish domination as the majority of the tokens traded in red on the weekly charts.</p><h2>Coinbase CEO champions DeFi, calls for court action to set legal precedent</h2><p>Coinbase CEO Brian Armstrong has expressed his endorsement of DeFi protocols. In a recent social media post, Armstrong urged DeFi protocols to consider legal proceedings in court to set a precedent, as the legal system has consistently demonstrated its dedication to upholding the rule of law. The current approach is mainly pushing a crucial industry toward overseas jurisdictions, he said.</p><p>According to his <a href=\"https://twitter.com/brian_armstrong/status/1702043655928955139\" target=\"_blank\" rel=\"noopener nofollow\">post</a> on X (formerly Twitter), the United States Commodities Futures Trading Commission should avoid taking enforcement actions against DeFi protocols, as they do not function as conventional financial service businesses, and it’s questionable whether the Commodity Exchange Act is even applicable to them.</p><p><a href=\"https://cointelegraph.com/news/coinbase-ceo-champions-de-fi-urges-court-action-to-set-legal-precedent\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/coinbase-ceo-champions-de-fi-urges-court-action-to-set-legal-precedent/amp\"><strong>Continue reading</strong></a></p><h2>Decentralized stablecoins could dominate crypto: MakerDAO founder</h2><p>Decentralized stablecoins may eventually dominate the stablecoin market, so long as crypto “ends up living up to its potential,” says Rune Christensen, co-founder of DeFi pioneer MakerDAO.</p><p>Speaking to Cointelegraph’s Andrew Fenton at Token2049 in Singapore, Christensen aired his thoughts on the future of decentralized stablecoins, such as Dai (<a href=\"https://cointelegraph.com/dai-price-index\">DAI</a>), and their role in the wider crypto economy.</p><p><a href=\"https://cointelegraph.com/news/decentralized-stablecoins-could-dominate-makerdao-founder\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/decentralized-stablecoins-could-dominate-makerdao-founder/amp\"><strong>Continue reading</strong></a></p><h2>Polygon co-founder: $1B bet on ZK-rollups paying off</h2><p>Polygon co-founder Sandeep Nailwal believes the layer-2 blockchain firm is reaping the benefits of allocating $1 billion to develop <a href=\"https://cointelegraph.com/explained/zero-knowledge-proofs-explained\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/explained/zero-knowledge-proofs-explained/amp\">zero-knowledge (ZK) proof</a>-powered scaling solutions for the Ethereum ecosystem.</p><p>Speaking at a keynote address during the latest edition of the Token2049 conference in Singapore, Nailwal touched on the development of “Polygon 2.0” scaling efforts and the promise of recursive ZK-proof technology to create a seamless interoperable blockchain ecosystem.</p><p><a href=\"https://cointelegraph.com/news/polygon-allocated-1-billion-dollars-zk-rollups\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/polygon-allocated-1-billion-dollars-zk-rollups/amp\"><strong>Continue reading</strong></a></p><h2>Decentralized exchanges are a magnet for crypto wash traders: Solidus Labs</h2><p>Over 20,000 crypto tokens have been manipulated via decentralized exchange (DEX) wash trading over the last three years, according to market surveillance firm Solidus Labs.</p><p>In the second part of its “2023 Crypto Market Manipulation Report,” released on Sept. 12, Solidus <a href=\"https://www.soliduslabs.com/reports/crypto-wash-trading\" target=\"_blank\" rel=\"noopener nofollow\">says</a> that among a sample of 30,000 Ethereum-based DEX liquidity pools, nearly 70% were found to have executed wash trades since September 2020, making up for around $2 billion worth of crypto.</p><p><a href=\"https://cointelegraph.com/news/decentralized-crypto-exchanges-wash-trading-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/decentralized-crypto-exchanges-wash-trading-report/amp\"><strong>Continue reading</strong></a></p><h2>DeFi group petitions to stop ‘patent troll’ targeting DeFi protocols</h2><p>A DeFi advocacy body has petitioned the United States Patent and Trademark Office to review a patent owned by a company it accuses of being a “patent troll” — a firm that aims to profit from patent lawsuits.</p><p>In a Sept. 11 blog post, the DeFi Education Fund said that on Sept. 7, it filed an over 90-page petition to the Patent Trial and Appeal Board in a bid to cancel a patent owned by True Return Systems.</p><p><a href=\"https://cointelegraph.com/news/defi-group-asks-uspto-cancel-patent-troll-suing-protocols\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/defi-group-asks-uspto-cancel-patent-troll-suing-protocols/amp\"><strong>Continue reading</strong></a></p><h2>DeFi market overview</h2><p>Data from <a href=\"https://pro.cointelegraph.com/users/sign_in?\">Cointelegraph Markets Pro</a> and TradingView shows that DeFi’s top 100 tokens by market capitalization had a mixed week, with most tokens trading in the red on the weekly charts. The total value locked into DeFi protocols remained above $49 billion.</p><p>Thanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-15T19:15:00.000Z",
    "title": "Nvidia AI partner Databricks raises $500M to achieve $43B valuation",
    "url": "https://cointelegraph.com/news/nvidia-ai-partner-databricks-raises-500-m-43-b-valuation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/e1b4f18e-6875-4dbe-b65d-7ceb045a1c2a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Capital One also joined the investment round, despite being the top client of rival cloud platform Snowflake.</p>\n                    <p><p>Cloud data company Databricks recently announced the completion of a Series I fundraising round where it raked in $500M from primary investor accounts led by T.Rowe and new investors Capital One Ventures, Ghisallo Capital Management, Ontario Teachers’ Pension Plan and Nvidia.</p><p>The latest investment round was achieved at a valuation of $43 billion dollars and a share price of $73.50, according to Databricks. Previously, the company raised $1.6 billion in series H funding at a valuation of $38 billion in 2021. </p><p>Databrick’s financial partnership with Nvidia indicates an increased synergy between the two artificial intelligence (AI) corporations with generative AI for enterprise data being the primary driver for the fundraise.</p><p>Nvidia CEO Jensen Huang, per a Databricks press release, <a href=\"https://www.databricks.com/company/newsroom/press-releases/databricks-raises-series-i-investment-43b-valuation\" target=\"_blank\" rel=\"noopener nofollow\">called</a> enterprise data “a goldmine for generative AI,” adding “Databricks is doing incredible work with Nvidia technology to accelerate data processing and generative AI models.”</p><p>Databricks’ most prominent product is its “Lakehouse'' platform. Lakehouse essentially combines a data warehouse with a data lake for seamless developer workflow access. </p><p>Per the company’s press release:</p><blockquote>“The Databricks Lakehouse unifies data, analytics and AI on a single platform so that customers can govern, manage and derive insights from enterprise data and build their own generative AI solutions faster.”</blockquote><p>Lakehouse empowers enterprise clients to build out their own generative AI models — sort of like a ChatGPT-style AI system that’s trained only on a client’s internal data. This architecture puts privacy controls in the purview of the business client and allows enterprises to fine-tune models in order to inhibit unwanted or erroneous outputs. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ai-startup-helsing-raises-223-million-in-series-b-funding-for-defense-solutions\"><strong><em>AI startup Helsing raises $223 million in Series B funding for defense solutions</em></strong></a></p><p>At a valuation of $43 billion, Databricks is one of the highest valued U.S. artificial intelligence companies in existence — trillion-dollar competitors such as AWS, Microsoft Cloud, and Google Cloud notwithstanding. </p><p>Its chief competitor, Snowflake, has a market value of approximately $51 billion. It’s worth noting that Capital One, one of the firms investing in the latest Databricks funding round, is <a href=\"https://www.capitalone.com/software/blog/harnessing-snowflakes-data-cloud/\" target=\"_blank\" rel=\"noopener nofollow\">among</a> Snowflake’s largest corporate clients. </p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-15T19:36:15.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-15T19:23:21.000Z",
    "title": "Ethereum’s Goerli testnet to make way for new Holeky platform",
    "url": "https://www.cryptopolitan.com/ethereums-goerli-testnet-to-make-way-for-new-holeky-platform/",
    "description": "The Ethereum community is gearing up for a significant transition. The Goerli testnet, a crucial tool for developers in testing validation and staking, is set to be replaced by a new testnet called Holeky. This move comes as the Ethereum Foundation aims to provide a more robust testing environment for its growing user base. Initially, ... <a title=\"Ethereum&#8217;s Goerli testnet to make way for new Holeky platform\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereums-goerli-testnet-to-make-way-for-new-holeky-platform/\" aria-label=\"More on Ethereum&#8217;s Goerli testnet to make way for new Holeky platform\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-15T19:32:25.000Z",
    "title": "Hong Kong policymaker responds to Vitalik Buterin over regulation",
    "url": "https://crypto.news/hong-kong-policymaker-responds-to-vitalik-buterin-over-regulation/",
    "description": "Buterin shared doubts about Hong Kong’s crypto welcome party and laws during a Singapore summit, prompting an invitation from local regulator Johnny Ng. A member of the Legislative Council invited Ethereum (ETH) creator Vitalik Buterin to scope out Hong Kong’s&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-15T19:13:22.000Z",
    "title": "BNB.WIN, a rebasing protocol on BNB Chain, releases RWA product",
    "url": "https://crypto.news/bnb-win-a-rebasing-protocol-on-bnb-chain-releases-rwa-product/",
    "description": "BNB.WIN, a rebasing protocol on the BNB Chain, has launched their first real-world asset (RWA) product"
  }
]