[
  {
    "source": "Decrypt",
    "date": "2024-02-27T15:44:13.000Z",
    "title": "Casper Network: Opening a 'New World of Possibilities' Beyond Enterprise Users",
    "url": "https://decrypt.co/videos/interviews/xz9F8Lct/casper-network-opening-a-new-world-of-possibilities-beyond-enterprise-users",
    "description": "Casper Network's Director of Ecosystem Alizee Carli and Head of Content Joe Benso join Stephen Graves at NFT Paris to talk about how the Layer 1 blockchain is expanding beyond its enterprise user base to Web3-native projects."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-27T15:40:07.000Z",
    "title": "Decrypt, Rug Radio Unveil New Decentralized Publishing Company DASTAN at R HAUS Paris",
    "url": "https://decrypt.co/218952/decrypt-rug-radio-unveil-new-decentralized-publishing-company-dastan-at-r-haus-paris",
    "description": "DASTAN is the product of the merger between Rug Radio and Decrypt, creating the world’s biggest decentralized publishing company."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-27T16:03:01.000Z",
    "title": " Bitcoin ASIC maker Canaan&#039;s revenue stagnant despite crypto bull run ",
    "url": "https://cointelegraph.com/news/bitcoin-asic-maker-canaan-revenue-stagnant-despite-crypto-bull-run",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMWYzNzc1MDktNGNhOS00ZDZlLTgzNDktZjdjMDYxMDNhMTEzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The firm's ASIC orders have increased while pricing decreased, leading to an overall negative revenue growth. </p>\n                    <p><p>Despite an ongoing crypto bull market, it appears that demand for Bitcoin application-specific integrated circuit (ASIC) miners and servers has been lukewarm.</p><p>On Feb. 27, Bitcoin ASIC manufacturer Canaan <a href=\"https://www.prnewswire.com/news-releases/canaan-inc-reports-unaudited-fourth-quarter-and-full-year-2023-financial-results-302072568.html\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> Q4 2023 earnings. In its report, the company disclosed revenue of $49 million, representing a decrease of 16% compared to the same period last year. Meanwhile, the firm’s net loss widened to $139 million versus $91.6 million in Q4 2022. Despite an increase in the amount of computing power sold and Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price recovery, Canaan said that its ASICs were sold at lower prices compared to the market last year. </p><p>In addition, the firm forecasts tougher market conditions ahead. \"For the first quarter of 2024 and the second quarter of 2024, the Company expects total revenues to be approximately US$33 million and US$70 million, respectively, considering the challenging market conditions across the industry,\" Canaan stated. During the quarter, the firm recognized a non-cash inventory writedown of $55 million due to pricing pressures.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-asic-maker-canaan-revenue-stagnant-despite-crypto-bull-run\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-27T15:58:13.000Z",
    "title": "LBank Exchange Will List beoble (BBL) on February 28, 2024",
    "url": "https://cryptodaily.co.uk/2024/02/lbank-exchange-will-list-beoble-bbl-on-february-28-2024",
    "description": "LBank Exchange Will List beoble (BBL) on February 28, 2024"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-27T15:41:19.000Z",
    "title": "Beyond Bitcoin's $56K High: Top Crypto Opportunities for Stellar Returns",
    "url": "https://cryptodaily.co.uk/2024/02/beyond-bitcoins-56k-high-top-crypto-opportunities-for-stellar-returns",
    "description": "Bitcoin's meteoric rise is reshaping the crypto landscape, signaling a potential shift in market dominance. Dive into the burgeoning world of layer-2 solutions and explore top cryptocurrencies for exceptional investment opportunities. Don't miss out on the chance to capitalize on the evolving blockchain technology and potentially outperform traditional market leaders!"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-27T16:00:03.000Z",
    "title": "Core Chain’s Vision Paper highlights how BTCfi will open the door to a trillion-dollar Bitcoin economy",
    "url": "https://www.cryptopolitan.com/core-chains-vision-paper-highlights-how-btcfi-will-open-the-door-to-a-trillion-dollar-bitcoin-economy/",
    "description": "Cayman Islands, Cayman Islands, February 27th, 2024, Chainwire Solutions for Bitcoin Scaling: The paper presents a range of technological solutions aimed at scaling the Bitcoin ecosystem without altering its foundational base layer Beyond Layer 2: Highlighting the limitations of existing Bitcoin layer 2 solutions, the paper argues for a novel approach that builds directly on [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-27T16:04:40.000Z",
    "title": "BNB Chain vs. Ethereum: who is winning the dapp race?",
    "url": "https://crypto.news/binance-chain-vs-ethereum-who-is-winning-the-dapp-race/",
    "description": "The competition heats up in the dapp arena as developers weigh Binance Smart Chain against Ethereum. How do factors like scalability and transaction costs affect their decisions? The blockchain space is fiercely competitive, particularly when it comes to decentralized applications&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-27T16:00:20.000Z",
    "title": "Theta Network Leads Crypto Rally With 60% Price Explosion: Here’s Why",
    "url": "https://www.newsbtc.com/news/theta-network-crypto-rally-60-price-explosion/",
    "description": "Theta Network (THETA), a platform for decentralized video delivery and edge computing, has seen its price skyrocket by 60% in the past 24 hours. This surge has propelled THETA to become the top gainer across the entire spectrum of the top 100 cryptocurrencies. The rally can be attributed to a confluence of factors, notably the anticipation surrounding the upcoming launch of Theta EdgeCloud in the next quarter, a broader crypto market uplift led by Bitcoin and a bullish chart setup for THETA. EdgeCloud Launch Sparks Growth Catalyst At the heart of Theta Network&#8217;s bullish trajectory is the Theta EdgeCloud project, an ambitious endeavor to establish a global peer-to-peer cloud computing network. This initiative is poised to harness the power of user devices to scale blockchain applications to new heights. The excitement around this development was heightened by a tweet from Theta developers yesterday, which stated, &#8220;Theta EdgeCloud Phase 1 is coming in Q2! Check out the preview blog on how Theta EdgeCloud is ushering in a new era of AI computing.&#8221; Theta EdgeCloud Phase 1 is coming in Q2! Check out the preview blog on how Theta EdgeCloud is ushering in a new era of AI Computing:https://t.co/kNMYib48RJ &#8212; Theta Network (@Theta_Network) February 26, 2024 Theta&#8217;s foray into AI computing aligns with the current market enthusiasm for AI-related tokens, as evidenced by the impressive gains of projects like Render Network (RNDR) and Fetch.Ai (FET). This alignment suggests that Theta&#8217;s price surge is not only a result of its intrinsic value proposition but also its strategic positioning within the booming AI narrative in the crypto space. In the newly released blog post, the Theta team elaborated on EdgeCloud&#8217;s mission to democratize access to GPU processing power for AI and video tasks, offering a cost-effective and decentralized alternative to traditional cloud computing. This initiative leverages the Theta Edge Network&#8217;s substantial distributed GPU computing power, which ranks among the world&#8217;s largest, to support a wide range of AI applications, from language models to text-to-image and text-to-video models. Related Reading: THETA Breaches $1 Level Courtesy Of Solid On-Chain Developments The blog further elaborates on the technical prowess of the Theta Edge Network, highlighting its capacity to support a wide array of AI applications, thereby democratizing access to GPU processing power. &#8220;This vast processing power [&#8230;] can deliver upwards of 2500 equivalent NVIDIA A100s, enough to train and serve some of the largest language models,&#8221; the post reads, illustrating the network&#8217;s potential to significantly impact the AI computing landscape. Theta&#8217;s approach to innovation is also reflected in its patented technology for an edge computing platform supported by a blockchain network, enabling a new era of hybrid computing architectures. &#8220;This set in motion the capability to build a next generation hybrid computing architecture,&#8221; the team noted. Technical Analysis Of THETA/USD The Theta token (THETA/USD) has charted a significant bullish breakout on its 1-week timeframe chart. Over the past week, the price has surged with an impressive gain, reflecting a newfound vigor in the buying sentiment. However, the rally has reached a formidable resistance at $2.28 level, which acted as a crucial support in early 2022. At press time, THETA was trading at approximately $2.01, after a massive move from its recent lows of around $0.55, representing an increase of over 365% in just 20 weeks. Before the breakout, the 100-week and 200-week exponential moving averages (EMAs) served as crucial resistance while the 20-week and 50-week EMAs marked strong support levels. The breakout above the 100- and 200-week EMA (blue line) can be seen as a major catalyst. Notably, the relative strength index (RSI) is currently positioned at approximately 62.6, which is comfortably below the overbought threshold of 70. This suggests that there may still be room for upward movement before the market is considered overextended. Related Reading: Crypto Analyst Sounds Warning Alarm: Last Chance To Buy Bitcoin And Ethereum Before Bull Run This thesis is supported by the Fibonacci retracement levels, drawn from the all-time high to the significant low, which shows that the Theta price is still in somewhat bearish territory. It would take a further doubling of the price for THETA to reach the 0.236 level at $4.31911099, which can be seen as major resistance. However, for this to happen, the $2.28 resistance needs to be cleared. A decisive weekly close above this level could pave the way for a test of the 0.382 level at $6.64707545, followed by the 0.5 and 0.618 levels at $8.5285097 and $10.41008649, respectively. Conversely, a rejection at the current level could see a retest of the 200-week EMA. The volume indicator shows a modest increase in trading volume accompanying the recent price spike, which lends credence to the breakout. However, traders and investors will be closely monitoring this metric to confirm whether the momentum has the conviction to break through the current resistance zone. Featured image from Binance US Blog, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-27T15:58:08.000Z",
    "title": "LBank Exchange Will List beoble (BBL) on February 28, 2024",
    "url": "https://www.crypto-news-flash.com/lbank-exchange-will-list-beoble-bbl-on-february-28-2024/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-exchange-will-list-beoble-bbl-on-february-28-2024",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/1600-900en_1709046223B8btNyvrWo.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/1600-900en_1709046223B8btNyvrWo.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/1600-900en_1709046223B8btNyvrWo-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/1600-900en_1709046223B8btNyvrWo-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/1600-900en_1709046223B8btNyvrWo-150x90.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/1600-900en_1709046223B8btNyvrWo-450x270.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Road Town, BVI, February 27th, 2024, Chainwire In a significant move for cryptocurrency and mobile technology enthusiasts, LBank Exchange, a premier global digital asset trading platform, announced the listing of beoble (BBL) on February 28, 2024. Users of LBank Exchange can brace themselves for the BBL/USDT trading pair, which will go live at 12:00 UTC [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-27T15:47:05.000Z",
    "title": "XRP Ripple Siap untuk Lonjakan Luar Biasa: Analis Memperkirakan Kenaikan Harga 61.052% ke US$288, Mengutip Tren Historis",
    "url": "https://www.crypto-news-flash.com/xrp-ripple-siap-untuk-lonjakan-luar-biasa-analis-memperkirakan-kenaikan-harga-61-052-ke-us288-mengutip-tren-historis/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-ripple-siap-untuk-lonjakan-luar-biasa-analis-memperkirakan-kenaikan-harga-61-052-ke-us288-mengutip-tren-historis",
    "description": "<img width=\"1920\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Rocket-with-Ripple-XRP-logo-and-starry-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Rocket-with-Ripple-XRP-logo-and-starry-background\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Rocket-with-Ripple-XRP-logo-and-starry-background.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Rocket-with-Ripple-XRP-logo-and-starry-background-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Rocket-with-Ripple-XRP-logo-and-starry-background-1024x640.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Rocket-with-Ripple-XRP-logo-and-starry-background-768x480.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Rocket-with-Ripple-XRP-logo-and-starry-background-1536x960.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Rocket-with-Ripple-XRP-logo-and-starry-background-150x94.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Rocket-with-Ripple-XRP-logo-and-starry-background-450x281.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Rocket-with-Ripple-XRP-logo-and-starry-background-1200x750.jpg 1200w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Seorang analis menunjukkan kesamaan antara pasar XRP saat ini dan tahun 2017 ketika, setelah mengikuti garis tren bearish menurun, XRP melepaskan diri untuk melonjak 60.000%. Analis tersebut percaya bahwa XRP telah menunjukkan pola perdagangan dan harga yang sama dan dapat menembus dalam waktu dekat untuk melonjak lebih dari 61.000% untuk mencapai US$288. XRP bisa menuju [...]"
  }
]