[
  {
    "source": "CryptoSlate",
    "date": "2024-04-01T15:47:12.000Z",
    "title": "Crypto thefts fall 48% month over month to $79 million in March",
    "url": "https://cryptoslate.com/crypto-thefts-fall-48-month-over-month-to-79-million-in-march/",
    "description": "<p>Crypto hacks saw a consecutive monthly decline, with malicious players stealing roughly $79 million from decentralized finance projects in March. The fall represents a 48% decrease from the $160 million stolen in February. Blockchain security firm CertiK stated: &#8220;Combining all the incidents in March, we’ve confirmed [approximately] $79 million lost to exploits, hacks and scams [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/crypto-thefts-fall-48-month-over-month-to-79-million-in-march/\">Crypto thefts fall 48% month over month to $79 million in March</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-04-01T16:07:49.000Z",
    "title": "Tether completes ‘gold standard’ compliance audit",
    "url": "https://cryptobriefing.com/tether-soc-2-audit-security-compliance/",
    "description": "Tether has completed a System Organization Control (SOC) 2 Type 1 audit, a major security compliance milestone."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-04-01T15:46:30.000Z",
    "title": "Ethereum Classic (ETC) and Solana (SOL) Enthusiasts Rally Behind Kelexo (KLXO) for Next-Generation Lending Solutions",
    "url": "https://cryptodaily.co.uk/2024/04/ethereum-classic-etc-and-solana-sol-enthusiasts-rally-behind-kelexo-klxo-for-next-generation-lending-solutions",
    "description": "As the financial market shifts towards decentralized solutions, there is a growing demand for advanced lending platforms."
  },
  {
    "source": "BTCManager",
    "date": "2024-04-01T16:07:50.000Z",
    "title": "Solana Labs co-founder introduces BunkerCoin whitepaper",
    "url": "https://crypto.news/solana-labs-bunkercoin-whitepaper-anatoly-yakovenko/",
    "description": "Solana Labs Co-Founder Anatoly Yakovenko has directed his community towards a new blockchain protocol called BunkerCoin."
  },
  {
    "source": "BTCManager",
    "date": "2024-04-01T15:59:38.000Z",
    "title": "Ethereum restaking protocols’ TVL exceeds $8b",
    "url": "https://crypto.news/ethereum-restaking-protocols-tvl-exceeds-8b/",
    "description": "The total value locked in Ethereum restaking protocols has jumped to $8.35 billion."
  },
  {
    "source": "BTCManager",
    "date": "2024-04-01T15:42:52.000Z",
    "title": "Vitalik Buterin reveals details on next Ethereum update",
    "url": "https://crypto.news/vitalik-buterin-ethereum-update-details/",
    "description": "Ethereum co-founder Vitalik Buterin spoke about the next stage of the blockchain roadmap, the Purge."
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-01T16:00:16.000Z",
    "title": "Traders Not Showing Dogecoin FOMO, Good Sign For Rally?",
    "url": "https://www.newsbtc.com/news/dogecoin/traders-not-dogecoin-fomo-good-sign-rally/",
    "description": "On-chain data suggests traders haven&#8217;t been showing FOMO towards Dogecoin despite the latest rally, a sign that could be positive for its continuation. Dogecoin Total Amount Of Holders Has Remained Flat Recently According to data from the on-chain analytics firm Santiment, FOMO, which would normally be associated with tops, has been absent from the Dogecoin market recently. The indicator of relevance here is the &#8220;Total Amount of Holders,&#8221; which, as its name suggests, keeps track of the total number of DOGE addresses that are carrying a non-zero balance right now. Related Reading: What’s A Simple Strategy For Buying &#38; Selling Bitcoin? This Analyst Answers When the value of this metric goes up, it can be because of a number of reasons. A major one would naturally be fresh adoption, as new investors coming into the sector would open up new addresses and add balance to them, thus raising the indicator&#8217;s value. Other reasons can include existing users reconsolidating their holdings among multiple addresses (usually for a purpose like privacy) or old investors coming back to reinvest in the meme coin. In general, whenever the metric shows this kind of trend, it means that some net adoption of the asset is taking place, which can be a positive sign in the long term. On the other hand, a decline in the indicator implies some holders may have decided to exit from the cryptocurrency as they have completely cleared out their addresses. Now, here is a chart that shows the trend in the Dogecoin Total Amount of Holders over the last few months: The value of the metric appears to have been moving sideways for a while now &#124; Source: Santiment on X As displayed in the above graph, the &#8216;Total Amount of Holders&#8217; for Dogecoin has been flat for many weeks now, implying that the adoption of the meme coin has hit the brakes. Interestingly, this sideways trajectory has come despite the fact that DOGE&#8217;s price has gone through some volatile price action during this period. Generally, events like rallies are attractive to traders, so a notable amount of them tend to jump into the asset during them. It would appear that the traders have either not been paying attention to the recent DOGE rally or just not taking it seriously. In the past couple of weeks, the &#8216;Total Amount of Holders&#8217; for the meme coin has gone up by only 0.21%, despite the fact that the price has rallied more than 40% in the same window. Historically, when a large number of traders join the blockchain at once during price surges, it&#8217;s a sign that FOMO around the asset is spreading. Usually, the meme coin&#8217;s price tends to go against the expectations of the majority, so when there is widespread FOMO, a top can become likely to take place. Related Reading: Coinbase Sees Largest USDC Inflow Ever, What This Could Mean For Bitcoin As there hasn&#8217;t been any such FOMO for Dogecoin recently, it&#8217;s possible that it could be a positive sign for the rally&#8217;s continuation. There is also another signal brewing, however, that may not be so constructive. From the chart, it&#8217;s visible that the Mean Dollar Invested Age, a metric that keeps track of the average age of DOGE investments, has plunged recently, implying that the experienced hands have been on the move. When this signal formed earlier in the year, the coin&#8217;s price approached the top not too long after. DOGE Price Dogecoin had surpassed the $0.22 level earlier, but it seems the asset has gone through some drawdown as it&#8217;s now back under $0.21. Looks like the price of the coin has been going up in recent days &#124; Source: DOGEUSD on TradingView Featured image from Kanchanara on Unsplash.com, Santiment.net, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-04-01T16:00:15.000Z",
    "title": "Experts Crown BlockDAG Top Altcoin Choice for 2024, as It Secures $11.6M in Presale Amid Arbitrum’s New Program & Ocean Bull Run",
    "url": "https://www.crypto-news-flash.com/experts-crown-blockdag-top-altcoin-choice-for-2024-as-it-secures-11-6m-in-presale-amid-arbitrums-new-program-ocean-bull-run/?utm_source=rss&utm_medium=rss&utm_campaign=experts-crown-blockdag-top-altcoin-choice-for-2024-as-it-secures-11-6m-in-presale-amid-arbitrums-new-program-ocean-bull-run",
    "description": "<img width=\"2048\" height=\"1152\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/yhgfb.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/04/yhgfb.png 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/yhgfb-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/yhgfb-1200x675.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/yhgfb-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/yhgfb-1536x864.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/yhgfb-150x84.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/04/yhgfb-450x253.png 450w\" sizes=\"(max-width: 2048px) 100vw, 2048px\" />One question reigns supreme in the ever-evolving cryptocurrency market: which altcoin will emerge as the leader of 2024? The answer appears to be crystal clear as experts unanimously crown the BlockDAG (BDAG) network. Amid the Arbitrum Community&#8217;s overwhelming endorsement of its Gaming Catalyst Program, coupled with an optimistic price prediction for OCEAN amidst its bull [...]"
  }
]