[
  {
    "source": "Cointelegraph",
    "date": "2023-06-18T20:12:47.000Z",
    "title": "Bitcoin bulls look to re-establish control — Will BNB, LTC, OKB and QNT follow?",
    "url": "https://cointelegraph.com/news/bitcoin-bulls-look-to-re-establish-control-will-bnb-ltc-okb-and-qnt-follow",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/9dfd1d42-62cb-49e6-b511-8a61eed9c1fc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin price is showing some strength, and charts suggest BNB, LTC, OKB and QNT could follow?</p>\n                    <p><p>The bears lost an opportunity when they failed to sustain Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) below the $25,000 level this week. That may have attracted buying from the bulls who are attempting to start a recovery in Bitcoin and select altcoins. </p><p>Additionally, BlackRock’s application to launch a Bitcoin spot price exchange-traded fund and the sustained strength in the United States equities markets may have helped improve crypto sentiment. Bitcoin is on track to finish the week with a minor gain of 2% and institutional buying in the Grayscale Bitcoin Trust <a href=\"https://cointelegraph.com/news/grayscale-bitcoin-trust-2023-high-blackrock-etf-filing-buyers\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/grayscale-bitcoin-trust-2023-high-blackrock-etf-filing-buyers/amp\">reduced its discount to Bitcoin spot</a> from 44% on June 13 to 36.6%, according to CoinGlass data. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/b89116ba-bc5b-4420-8e39-7ea0e800483e.png\"><figcaption style=\"text-align: center;\"><em>Crypto market data daily view. Source:</em><em> </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>Although Bitcoin and select altcoins are trying to start a relief rally, the overall trend remains bearish. Therefore, short-term traders who buy for a pullback should consider booking profits or tightening their stops when the price struggles to break above stiff resistance levels. </p><p>The strategy may be different for long-term investors who may use the dips to strong support levels to acquire the cryptocurrencies of their choice. It is prudent to adopt a staggered buying approach as a runaway rally is unlikely. </p><p>Let’s look at the top-5 cryptocurrencies that are trying to start a recovery in the short term.</p><h2>Bitcoin price analysis</h2><p>Bitcoin turned up sharply on June 15, trapping the aggressive bears who may have gone short on a break below $25,250. That may have caused a short squeeze in the near term, which propelled the price to the 20-day exponential moving average ($26,403).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/7eecb7cc-4487-4fa8-bfd3-f605b8a5d250.png\"><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bears are trying to limit the relief rally at the 20-day EMA but a positive sign is that the bulls have not given up much ground. This suggests that the buyers are holding on to their positions in anticipation of a move higher.</p><p>However, the bears are likely to have other plans as they will try to offer stiff resistance in the zone between the 20-day EMA and the resistance line of the descending channel. If the price turns down from this zone, the BTC/USDT pair may remain inside the channel for a while longer.</p><p>But if bulls drive the price above the channel, the pair will signal a potential trend change in the near term. The pair could then surge toward $31,000.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/4597ccee-ff4a-4a7a-a3e0-8c6d5be5706d.png\"><figcaption style=\"text-align: center;\"><em>BTC/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The 20-EMA on the 4-hour chart has turned up and the relative strength index (RSI) is in the positive area, indicating that bulls have the upper hand in the near term. There is a minor resistance at $26,850 but if that is crossed, the pair may reach the resistance line of the channel near $27,600. This level may prove to be a difficult hurdle for the bulls to cross but if they manage to do that, the pair could rally to $28,500.</p><p>This positive view will invalidate in the short term if the price turns down and breaks below the 20-EMA. That could pull the price down to the 50-simple moving average and eventually to the strong support zone between $25,250 and $24,800. A break below this zone may intensify selling.</p><h2>BNB price analysis</h2><p>BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/binance-coin-price-index\">BNB</a>) has been in the thick of things for the past few days but a positive sign is that the bulls did not allow the price to break the $220 support. This indicates demands at lower levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/e4aee987-3014-4fd7-b6fb-34652113a965.png\"><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The first resistance on the upside is the 38.2% Fibonacci retracement level of $252.50. If this level is scaled, the BNB/USDT pair may reach the 20-day EMA ($261). The bears will try to halt the recovery at this level. If they succeed, the pair may turn down toward $220.</p><p>On the contrary, if bulls propel the price above the 20-day EMA, the pair could reach the 61.8% Fibonacci retracement level of $272.50. This is a crucial level for the bears to defend because if it gives way, the pair may soar toward $305.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/07a9956d-3f1e-44bc-aa9d-eeac374f9bf1.png\"><figcaption style=\"text-align: center;\"><em>BNB/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The 4-hour chart shows that the moving averages have completed a bullish crossover and the RSI has risen into the positive zone. This indicates that buyers are attempting a comeback. The bulls will have to overcome the barrier at $252.50 to gain strength. The pair could then rally to $265.</p><p>On the downside, the first support is at the 20-EMA. If this level breaks down, the pair could slip to the uptrend line. A break and close below this level will indicate that the bulls have given up. The pair could then retest the critical support at $220.</p><h2>Litecoin price analysis</h2><p>Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) plunged below the symmetrical triangle pattern on June 10, indicating that bears have the upper hand. The sellers pulled the price below the immediate support at $75 on June 14 but could not build upon this move. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/e113f488-f7d4-4d04-b8c0-7698dba01ee1.png\"><figcaption style=\"text-align: center;\"><em>LTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The sharp recovery in the past few days has pushed the LTC/USDT pair back above $75. This shows strong buying at lower levels. The bulls will next try to push the price to the 20-day EMA ($82), which is an important level to keep an eye on. If buyers clear this hurdle, the pair may rise to the 50-day SMA ($86).</p><p>Contrary to this assumption, if the price turns down from the current level or the 20-day EMA and breaks below $70, it will signal the start of the downtrend. The first stop is likely to be $65 and then $60.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/32f5d006-4b1a-4d3d-8dbe-49590f61759b.png\"><figcaption style=\"text-align: center;\"><em>LTC/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The strong recovery pushed the price above the 20-EMA on the 4-hour chart, suggesting that the selling pressure is reducing. The moving averages are on the verge of completing a bullish crossover and the RSI has jumped into the positive territory, indicating that buyers are attempting a comeback.</p><p>There is a minor resistance at $80 but if bulls overcome this obstacle, the pair may accelerate to $85 and thereafter to $90. If bears want to prevent the up-move, they will have to quickly yank the price back below $75.</p><p><em>Related: </em><a href=\"https://cointelegraph.com/news/binance-cease-and-desist-notice-to-nigerian-scammer\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-cease-and-desist-notice-to-nigerian-scammer/amp\"><em>Binance sends cease and desist notice to fraudulent Nigerian entity</em></a></p><h2>OKB price analysis</h2><p>OKB (OKB) broke below the symmetrical triangle pattern on June 10, signaling the start of a deeper correction. A minor positive for the bulls is that they successfully defended the support at $30.50, indicating demand at lower levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/d1bb20ca-af16-43a4-abc0-cba19d5b9f68.png\"><figcaption style=\"text-align: center;\"><em>OKB/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The price has reached the 20-day EMA ($42.73), which is an important level to watch out for. If the price turns down from the current level, it will suggest that the sentiment remains negative and traders are selling on rallies. That could pose a serious threat to the $38.50 support. If this level gives way, the OKB/USDT pair may skid to $35 and eventually to $30.</p><p>Contrarily, if buyers thrust the price above the 20-day EMA, it will suggest that the bears may be losing their grip. The pair could then rise to the support line, which is likely to act as a formidable resistance. Buyers will have to kick the price above $48 to gain the upper hand.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/2fd81ae8-ab1e-4a8f-a055-8ee3907090d5.png\"><figcaption style=\"text-align: center;\"><em>OKB/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The pair bounced off $38.50 with vigor but is facing resistance near $42.39. A minor positive in favor of the buyers is that the moving averages have completed a bullish crossover and the RSI is in the positive territory.</p><p>If buyers thrust the price above $42.39, the pair may pick up momentum and soar to $46 where the bears are again expected to mount a strong defense. </p><p>Another possibility is that the price turns down and tumbles below the 20-EMA. That may indicate a possible range-bound action between $38.50 and $42.39 for some time.</p><h2>Quant price analysis</h2><p>Quant (<a href=\"https://cointelegraph.com/quant-qnt-price-index\">QNT</a>) rebounded off the $95 level with strength on June 16, indicating aggressive buying at the support. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/7720ce9c-75f5-4d23-a280-211e87bfc2ef.png\"><figcaption style=\"text-align: center;\"><em>QNT/USDT daily chart. Source: TradingView</em></figcaption></figure><p>However, the bears have not yet given up and they are fiercely defending the downtrend line. Sellers will try to sink the price below $95 while the bulls will try to maintain the QNT/USDT pair above it. </p><p>If the price turns up from $95 once again, it will enhance the prospects of a rally above the downtrend line. If that happens, the pair may start a strong recovery that could catapult the price to $135.</p><p>This positive view could invalidate in the near term if the price continues lower and plummets below $95. The pair may then slip to $87 and subsequently to $80.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/4c0851af-be5a-4a2f-af4e-d86fe2a20da3.png\"><figcaption style=\"text-align: center;\"><em>QNT/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The 4-hour chart shows that the pair quickly gave back a major portion of its gains, indicating that bears are active at higher levels. They pulled the price below the 61.8% Fibonacci retracement level of $103.90, which is a negative sign. </p><p>Buyers will have to quickly drive the price back above the moving averages if they want to have another shot at the downtrend line. Alternatively, if the price sustains below the 50-SMA, the likelihood of a drop to $95 increases.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p>\n</p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-18T20:30:35.000Z",
    "title": "Subpoena Evasion: 3AC Asks Court to Fine Kyle Davies $10,000 Daily for Non-Compliance",
    "url": "https://news.bitcoin.com/subpoena-evasion-3ac-asks-court-to-fine-kyle-davies-10000-daily-for-non-compliance/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddf-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Subpoena Evasion: 3AC Asks Court to Fine Kyle Davies $10,000 Daily for Non-Compliance\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddf-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddf-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddf-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddf-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddf-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddf-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/ddf-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In February, it was reported that Kyle Davies, the co-founder of Three Arrows Capital (3AC), faced allegations of evading subpoenas related to the collapse of the defunct Singapore cryptocurrency hedge fund. The current custodians of the 3AC estate are now pursuing a daily fine of $10,000 against him for his non-compliance with the New York [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-18T20:19:00.000Z",
    "title": "VeChain Price Prediction 2023-2031: What’s the Growth Potential of VET?",
    "url": "https://www.cryptopolitan.com/vechain-price-prediction/",
    "description": "VeChain Price Prediction 2023-2032 Since its launch, Vechain’s focus has been building technologies that solve obstacles impeding the mass adoption of blockchain technology. Two mnths ago, one of the most important pieces of technology in this mission was officially launched — VORJ. VORJ is a no-code Web3-as-a-Service platform that enables anyone to create, deploy and ... <a title=\"VeChain Price Prediction 2023-2031: What&#8217;s the Growth Potential of VET?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/vechain-price-prediction/\" aria-label=\"More on VeChain Price Prediction 2023-2031: What&#8217;s the Growth Potential of VET?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-18T20:14:08.000Z",
    "title": "PancakeSwap price analysis: CAKE slowly trends towards $1.50 resistance",
    "url": "https://www.cryptopolitan.com/pancakeswap-price-analysis-2023-06-18/",
    "description": "PancakeSwap price analysis shows a meagre uptrend taking place, as price slowly begins to trend upwards. CAKE price reached up to the $1.43 mark over the past 24 hours, in pursuit of the $1.5 resistance. The highest point this month has been set around $1.73, on June 5, when price declined 9 percent to initiate ... <a title=\"PancakeSwap price analysis: CAKE slowly trends towards $1.50 resistance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/pancakeswap-price-analysis-2023-06-18/\" aria-label=\"More on PancakeSwap price analysis: CAKE slowly trends towards $1.50 resistance\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-18T20:12:30.000Z",
    "title": "Ransomware actors and scammers exploit cloud mining services for crypto laundering: Report",
    "url": "https://www.cryptopolitan.com/ransomware-actors-and-scammers-exploit-cloud-mining-services/",
    "description": "Cloud mining services have become increasingly utilized by cybercriminals to facilitate cryptocurrency laundering. What was initially observed in nation-state actors has now been adopted by ransomware operations and cryptocurrency scammers, according to a report by blockchain analytics firm Chainalysis. This trend sheds light on the growing sophistication of criminals in their pursuit of illicit gains, ... <a title=\"Ransomware actors and scammers exploit cloud mining services for crypto laundering: Report\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ransomware-actors-and-scammers-exploit-cloud-mining-services/\" aria-label=\"More on Ransomware actors and scammers exploit cloud mining services for crypto laundering: Report\">Read more</a>"
  }
]