[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T04:29:37.000Z",
    "title": "AI Regulation Worry Industry Groups Over Tech Progress",
    "url": "https://www.cryptopolitan.com/ai-regulation-concerts-industry-groups/",
    "description": "Industry Groups Request Extension for Reviewing SEC's Proposed AI Regulation"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-16T04:38:28.000Z",
    "title": "ADA Price Plunges 5%, Can Buyers Save The Key $0.275 Support?",
    "url": "https://www.newsbtc.com/analysis/ada/ada-price-plunges-0-275-support/",
    "description": "Cardano’s price started a fresh decline from well above $0.30. ADA is testing $0.275 and remains at risk of more downsides in the near term. ADA price is gaining bearish momentum below the $0.30 level against the US dollar. The price is trading above $0.288 and the 100 simple moving average (4 hours). There is a major bearish trend line forming with resistance near $0.288 on the 4-hour chart of the ADA/USD pair (data source from Kraken). The pair could start a recovery wave if there is a close above the $0.30 resistance. Cardano’s ADA Price Extends Losses In the past few days, Cardano’s price saw a fresh decline from well above $0.308. The price traded below the $0.300 and $0.288 support levels to move into a bearish zone, similar to Bitcoin and Ethereum. The price even declined below $0.280 and tested the $0.275 support. A low is formed near $0.2752 and the price is now consolidating losses. It is now trading near the 23.6% Fib retracement level of the downward move from the $0.3018 swing high to the $0.2752 low. ADA price is now trading below $0.288 and the 100 simple moving average (4 hours). There is also a major bearish trend line forming with resistance near $0.288 on the 4-hour chart of the ADA/USD pair. On the upside, immediate resistance is near the $0.285 zone. The first major resistance is forming near the $0.288 zone and the trend line. It is close to the 50% Fib retracement level of the downward move from the $0.3018 swing high to the $0.2752 low. Source: ADAUSD on TradingView.com The next key resistance might be $0.300. If there is a close above the $0.300 resistance, the price could start a decent increase. In the stated case, the price could rise toward the $0.320 resistance zone. More Losses in ADA? If Cardano’s price fails to climb above the $0.288 resistance level, it could start another decline. Immediate support on the downside is near the $0.275 level. The next major support is near the $0.262 level. A downside break below the $0.262 level could open the doors for a sharp fresh decline toward $0.235. The next major support is near the $0.220 level. Technical Indicators 4 hours MACD – The MACD for ADA/USD is gaining momentum in the bearish zone. 4 hours RSI (Relative Strength Index) – The RSI for ADA/USD is now below the 50 level. Major Support Levels – $0.275, $0.262, and $0.235. Major Resistance Levels – $0.285, $0.288, and $0.300."
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-16T04:26:11.000Z",
    "title": "Ethereum Price Prints Bearish Technical Pattern, Why It Could Extend Losses",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-bearish-1800/",
    "description": "Ethereum price is moving lower below the $1,850 zone against the US Dollar. ETH could extend losses and trade below the $1,800 support. Ethereum is slowly moving lower below the $1,850 and $1,840 resistance levels. The price is trading below $1,840 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance near $1,835 on the hourly chart of ETH/USD (data feed via Kraken). The pair could drop further below the $1,800 support in the near term. Ethereum Price Turns Red Ethereum’s price struggled to recover above the $1,860 resistance zone. ETH remained in a bearish zone and extended its decline below the $1,850 level, similar to Bitcoin. There was a clear move below the $1,830 support and the price declined toward $1,800. A low is formed near $1,811 and the price is now consolidating losses. There was a recovery wave above the $1,820 level. The price climbed above the 23.6% Fib retracement level of the recent decline from the $1,854 swing high to the $1,811 low. Ether is now trading below $1,840 and the 100-hourly Simple Moving Average. There is also a key bearish trend line forming with resistance near $1,835 on the hourly chart of ETH/USD. On the upside, the price might face resistance near the $1,835 level or the trend line. It is close to the 50% Fib retracement level of the recent decline from the $1,854 swing high to the $1,811 low. The next resistance is near $1,840 or the 100-hourly Simple Moving Average. Source: ETHUSD on TradingView.com The first key resistance is near the $1,850 level. The next key resistance is near the $1,860 level. A close above the $1,860 level could start a decent increase toward $1,900. Any more gains might send the price toward the $1,920 pivot level, above which the price could rise toward the $2,000 zone. More Losses in ETH? If Ethereum fails to clear the $1,840 resistance, it could continue to move down. Initial support on the downside is near the $1,810 level. The first major support is near the $1,800 zone. If the bulls fail to protect the $1,800 support, there could be more losses. The next major support is near the $1,760 support level. Any more losses might send the price toward the $1,720 level in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,800 Major Resistance Level – $1,850"
  }
]