[
  {
    "source": "Cryptopolitan",
    "date": "2024-03-08T00:57:42.000Z",
    "title": "ECB holds firm on high interest rates, but there is a silver lining",
    "url": "https://www.cryptopolitan.com/ecb-holds-firm-on-high-interest-rates/",
    "description": "The European Central Bank has made a move that&#8217;s got everyone talking, but not in the way you might expect. They&#8217;ve decided to keep interest rates steady, even though they&#8217;ve cut down their guesses for both inflation and how fast the economy will grow. It seems like the eurozone&#8217;s economy is struggling, but the ECB [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-08T01:00:20.000Z",
    "title": "This Bitcoin Indicator Has Hit Levels That Often Lead To Corrections",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-indicator-hit-levels-lead-corrections/",
    "description": "On-chain data shows a Bitcoin metric has recently hit levels that have historically led to corrections in the cryptocurrency&#8217;s price. Bitcoin Is Currently 40% Above The Cost Basis Of Short-Term Holders CryptoQuant Netherlands community manager Maartunn explained in a post on X that the BTC price is currently 40% above the cost basis of the short-term holders. The indicator of interest here is the &#8220;Market Value to Realized Value (MVRV) ratio,&#8221; which is an indicator that keeps track of the ratio between the Bitcoin market cap and the realized cap. The &#8220;realized cap&#8221; refers to a capitalization model for the asset that assumes that the real value of any coin in circulation isn&#8217;t equal to the current spot price but rather the price when it was last transacted on the blockchain. Related Reading: Dogecoin Accumulation: DOGE Millionaires Have Shot Up By 76% The previous transfer of any coin was likely the last point at which it changed hands, so the price at that time would act as its current cost basis. As such, the realized cap is essentially the sum of the cost basis of the entire supply. Therefore, the metric&#8217;s value can measure the total capital the holders have put into the asset. And since the market cap is the value they are currently carrying, its comparison against the realized cap in the MVRV ratio can tell us about the amount of profits or losses the investors hold. In the current discussion, the MVRV ratio of the entire market isn&#8217;t of interest but rather of a particular segment of it: the &#8220;short-term holders&#8221; (STHs). The STH cohort includes all investors who bought their coins within the past 155 days. The below chart shows the trend in the Bitcoin MVRV ratio specifically for these investors over the history of the cryptocurrency: Looks like the value of the metric has been rising in recent days &#124; Source: @JA_Maartun on X As displayed in the above graph, the Bitcoin STH MVRV has been greater than 1 for a while now as the STHs have been carrying net profits, but with the latest rally in the asset, the indicator has shot up to especially high levels. The BTC spot price has recently been 40% over this cohort&#8217;s average cost basis. The chart shows that this same level has led to asset corrections a few times in the past. Related Reading: Bitcoin Short-Term Holders Panic Capitulate $2.6 Billion In BTC Crash Naturally, this doesn&#8217;t mean that the coin would necessarily see a correction here, but given the historical pattern, there is a chance one would occur. The likely reason behind this pattern is that Bitcoin investors are more likely to give in to the allure of profit-taking the larger their profits grow. BTC Price Bitcoin has gone through some significant volatility since setting its brand new all-time high above the $69,000 level, with its price now trading around $67,700. BTC has seen a rollercoaster over the past few days &#124; Source: BTCUSD on TradingView Featured image from André François McKenzie on Unsplash.com, CryptoQuant.com, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-08T01:00:22.000Z",
    "title": "Solana-Based Altcoin That’s Up 900%+ in a Month Primed for Monster Move, Says Top Trader – Here Are His Targets",
    "url": "https://dailyhodl.com/2024/03/07/solana-based-altcoin-thats-up-900-in-a-month-primed-for-monster-move-says-top-trader-here-are-his-targets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/03/month-monster-move-top.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/03/month-monster-move-top.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/03/month-monster-move-top.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/03/month-monster-move-top.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/03/month-monster-move-top.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/03/month-monster-move-top.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/03/month-monster-move-top.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst and trader is expressing bullish sentiment on an altcoin in the Solana (SOL) ecosystem that has skyrocketed by triple digits in four weeks. The analyst pseudonymously known as Bluntz tells his 244,400 followers on the social media platform X that the memecoin dogwifhat (WIF) is primed for a “monster” surge [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/07/solana-based-altcoin-thats-up-900-in-a-month-primed-for-monster-move-says-top-trader-here-are-his-targets/\">Solana-Based Altcoin That’s Up 900%+ in a Month Primed for Monster Move, Says Top Trader – Here Are His Targets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]