[
  {
    "source": "CryptoSlate",
    "date": "2023-08-15T01:00:21.000Z",
    "title": "Coinbase launches Stand with Crypto Alliance, reports 52k ‘advocate’ signups on first day",
    "url": "https://cryptoslate.com/coinbase-launches-stand-with-crypto-alliance-reports-52k-advocate-signups-on-first-day/",
    "description": "<p>Coinbase announced on Aug. 14 the launch of its Stand With Crypto Alliance, an initiative aimed at countering anti-crypto legislation by mobilizing the community at a grassroots level. While Coinbase has not detailed its long-term strategy, the company suggests that it aims to foster a grassroots movement and develop a proactive constituency advocating for legal [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/coinbase-launches-stand-with-crypto-alliance-reports-52k-advocate-signups-on-first-day/\">Coinbase launches Stand with Crypto Alliance, reports 52k &#8216;advocate&#8217; signups on first day</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-15T01:00:29.000Z",
    "title": "Bernstein Predicts Spot ETFs Could Claim 10% Of Bitcoin’s Market If Greenlit",
    "url": "https://www.newsbtc.com/bitcoin-news/bernstein-predicts-spot-etfs-bitcoin-market-if-greenlit/",
    "description": "According to Bloomberg, a recent research report from Sanford C. Bernstein has shed light on the potential impact of Exchange Traded Funds (ETFs) on the Bitcoin market dynamics. Related Reading: Silent Bitcoin Storm: Glassnode Uncovers What Lies Beneath The Surface Potential Surge In Bitcoin Market Value Sanford C. Bernstein&#8217;s research indicates that should the US green-light a fund investing directly in spot Bitcoin, ETFs could constitute roughly 10% of Bitcoin&#8217;s market value within the next three years. Such a shift could amplify Bitcoin&#8217;s presence in traditional financial portfolios and potentially foster more significant institutional adoption. According to Bloomberg, Gautam Chhugani, an analyst at Bernstein, highlighted the rising probability of a spot Bitcoin ETF in the report. In a separate report, this same analyst had recently disclosed that the SEC believes that a Bitcoin Spot ETF may be &#8220;unreliable&#8221; since crypto exchanges (such as Coinbase) aren&#8217;t under their oversight, leading to concerns about potential price manipulation and unreliability. While the speculation on the SEC approval of a Spot Bitcoin ETF continues, with the Grayscale Bitcoin Trust currently holding about 4% of all Bitcoin, according to Bloomberg, a direct investment, ETF could more than double this figure, potentially aiding the growth of the crypto investment landscape. The “Growth Flywheel” Effect Once regulatory approval is in place, Bernstein anticipates a &#8220;growth flywheel&#8221; effect propelled by retail and other institutional inflows. Such a cascade effect would be reminiscent of other financial markets where introducing new financial products spurred fresh investments and liquidity waves. Notably, to understand the significance of this, one only needs to consider the broader ETF market&#8217;s growth trajectory. Since their inception, ETFs have grown exponentially, with assets under management surging across various sectors and asset classes. Introducing a Spot Bitcoin ETF would mean integrating a highly liquid, decentralized, and increasingly accepted asset into this mix, further validating Bitcoin&#8217;s place in the financial ecosystem. Meanwhile, Bitcoin&#8217;s price is struggling to break above the $30,000 mark after slipping below that price range last week. As of this writing, the asset trades at $29,623, recording a slight increase of 0.5% over the past 24 hours. Alongside its struggling price, BTC’s market capitalization has increased by more than $10 billion in just the past week. The asset market cap has surged from a high of $560 billion earlier last week to a current cap of $573 billion. Related Reading: Bitcoin Addresses In Loss Soar To One-Month High Amid Mixed Market Indicators The top crypto&#8217;s trading volume has also followed closely with its surging market cap and has seen a significant spike from last week&#8217;s daily trading volume. Bitcoin&#8217;s 24-hour trading volume currently stands at $11.3 billion compared to a lesser volume of $8.7 billion last Monday. Featured image from iStock, Chart from TradingView"
  }
]