[
  {
    "source": "Decrypt",
    "date": "2023-08-01T11:44:29.000Z",
    "title": "What is Worldcoin? Sam Altman's Eye-Scanning Global ID 'Orb' Project Explained",
    "url": "https://decrypt.co/resources/what-is-worldcoin-the-app-and-token-that-protects-your-personhood",
    "description": "Worldcoin has introduced a concept called “proof of personhood\" to keep AI bots out of its global financial network."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-01T12:00:00.000Z",
    "title": "ConsenSys releases ‘fuzzing’ tool to test smart contract vulnerabilities",
    "url": "https://cointelegraph.com/news/consensys-releases-fuzzing-tool-test-smart-contract-vulnerabilities",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/13502092-7bbd-4e3d-bf08-aafd8af30b93.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Diligence Fuzzing lets developers introduce random and invalid data points to find security flaws.</p>\n                    <p><p>Blockchain technology firm ConsenSys publicly released its “Diligence Fuzzing” tool for smart contract testing, according to an Aug. 1 announcement. The new tool produces “random and invalid data points” to find vulnerabilities in contracts before they are launched.</p><p>Over $2.8 billion was <a href=\"https://cointelegraph.com/news/defi-exploits-and-access-control-hacks-cost-crypto-investors-billions-in-2022-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/defi-exploits-and-access-control-hacks-cost-crypto-investors-billions-in-2022-report/amp\">lost in decentralized finance hacks</a> in 2022. According to ConsenSys, these losses are leading developers to embrace more sophisticated testing tools to help find vulnerabilities before attackers do.</p><p>The new tool used to be available in a closed beta version, where developers needed to get approval for access. This approval process is no longer necessary as of Aug. 1. Diligence Fuzzing is also now integrated with smart contract toolkit Foundry and features a free version for developers who want to test it out before spending any money.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/4ac4108a-77a0-4c85-b8b1-95df884e4c38.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Diligence Fuzzing tutorials. Source: Consensys</em></figcaption></figure><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/coinpaid-crypto-payments-suspect-lazarus-group-behind-hack\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/coinpaid-crypto-payments-suspect-lazarus-group-behind-hack/amp\"><strong>Crypto payment gateway CoinsPaid suspects Lazarus Group in $37M hack</strong></a></em></p><p>In a conversation with Cointelegraph, ConsenSys security services lead Liz Daldalian explained how the tool works in more detail. Developers can annotate their contracts using a machine language called “Scribble,” also developed by ConsenSys. Once they do this, the annotations will be understood by the fuzzing tool. The tool produces “unexpected” inputs so as to test whether the contract can be forced to produce unintended actions.</p><p>ConsenSys security researcher Gonçalo Sá said the tool is not a “black box fuzzer.” It does not produce completely random data. Instead, it is a “grey-box fuzzer” that employs an understanding of the program’s current state to reduce the types of data produced, increasing the tool's efficiency.</p><p>Sá has seen developers becoming more interested in fuzzing recently. As Foundry has become more popular, developers have started to use its default black-box fuzzer and have grown accustomed to using it. On the other hand, some users want a more sophisticated fuzzer than the default one, which he argued Diligence Fuzzer could provide. He said:</p><blockquote>“People are now trying to harness the power of the different types of security tools that they have in their hands. And Foundry [has] a black box fuzzer that is really easy to use. [...] So people now are starting to understand the power of fuzzing. [...] And they are looking for more powerful tools.”</blockquote><p>Smart contract hacks have continued to pose a problem for users. Excluding rug pulls and phishing scams, over $471.43 million was <a href=\"https://cointelegraph.com/news/656m-lost-from-crypto-hacks-scams-and-rug-pulls-in-h12023-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/656m-lost-from-crypto-hacks-scams-and-rug-pulls-in-h12023-report/amp\">lost from Web3 security vulnerabilities</a> in the first half of 2023. Daldalian cautioned that Diligence Fuzzing is not a “silver bullet” that would eliminate all smart contract hacks. However, she argued that it is “one tool in an arsenal that developers can use in order to write more secure smart contracts,” which can at least set the Web3 community on a path to minimize losses from these attacks.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-01T12:00:24.000Z",
    "title": "BALD token surge sparks rumors of ties to Alameda Research",
    "url": "https://cryptoslate.com/bald-token-surge-sparks-rumors-of-ties-to-alameda-research/",
    "description": "<p>The BALD token, which experienced an explosive surge of over 10,000% on the Coinbase-backed Base network before plummeting, triggered a storm of investigations on Twitter, with some analysts linking BALD to Alameda Research. Igor Igamberdiev, Head of Research at Wintermute, has conducted an in-depth analysis of the BALD deployer. No Coinbase link to Bald. According [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bald-token-surge-sparks-rumors-of-ties-to-alameda-research/\">BALD token surge sparks rumors of ties to Alameda Research</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-01T11:47:08.000Z",
    "title": "NFTs and Bitcoin Casinos: Here Are Some Predictions for the Future Crypto Market",
    "url": "https://www.cryptoglobe.com/latest/2023/08/nfts-and-bitcoin-casinos-here-are-some-predictions-for-the-future-crypto-market/",
    "description": "Disclaimer: This article is sponsored content and should not be considered as financial or investment advice. Always do your own research before making any financial decisions. The opinions expressed in this article are those of the author and do not necessarily reflect the views of CryptoGlobe. As if the high inflation wasn’t enough of a […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-01T12:00:00.000Z",
    "title": "LeetSwap And $BALD Rug Plague Coinbase Ecosystem",
    "url": "https://cryptodaily.co.uk/2023/08/leetswap-and-bald-rug-plague-coinbase-ecosystem",
    "description": "<p>Decentralized exchange LeetSwap, built on Coinbase&rsquo;s Layer 2 blockchain Base, recently suspended trading due to fears of a potential exploit. Furthermore, Coinbase and Base are also dealing with the aftermath of the SEC&rsquo;s lawsuit.&nbsp;</p>\nLeetSwap Halts Trading Amid Security Concerns\n<p>Trouble is brewing in the Coinbase ecosystem as multiple challenges loom ahead. On the one hand, is the BALD coin crash, which has prompted leading DEX on the Base blockchain, LeetSwap, to halt trading. The DEX tweeted that they detected a security vulnerability in their factory, leading them to suspect compromised pool liquidity. As a result, trading was temporarily stopped for further investigation.&nbsp;</p>\n<p>PeckShield, a crypto-security firm, reported that approximately 340 ETH (equivalent to $630,000) had been exploited from liquidity pairs on Base, highlighting the severity of the situation.</p>\nBald Memecoin's Crash\n<p>Shortly before the trading pause, Bald, a popular memecoin, experienced a significant crash in value. The token's developer withdrew a substantial sum of 6,800 ETH ($12.5 million) from the liquidity pool on LeetSwap. This sudden move raised eyebrows and further added to the challenges faced by Base's leading DEX.</p>\nBase and Coinbase's Regulatory Woes\n<p>Base, as an Ethereum Layer 2 (L2) chain, empowers developers to build decentralized apps using Coinbase's products, users, and tools. However, Coinbase has been dealing with its own regulatory challenges after falling in the crosshairs of the U.S. Securities and Exchange Commission (SEC). The latter has demanded Coinbase suspend all cryptocurrency trading except for Bitcoin, and upon questioning the decision, the regulatory body filed a lawsuit against the exchange.</p>\nSEC&rsquo;s Lawsuit Against Coinbase\n<p>According to the lawsuit filed by the SEC, the regulatory body deemed 13 assets on Coinbase, including Solana (SOL), Polygon (MATIC), Cardano (ADA), FIL, SAND, AXS, ICP, NEAR, CHZ, DASH, VGX, and NEXO, as securities. The SEC also accused Coinbase of failing to register as a broker, clearing agency, or national securities exchange, indicating that the exchange was not adhering to the established disclosure regime for the U.S. securities markets.</p>\n<p>Coinbase CEO Brian Armstrong stated that the exchange had limited choices in dealing with the SEC's demands. Following the regulator's instructions would have set a dangerous precedent and conveyed the wrong message. Therefore, it found itself caught between compliance and potential harm to the cryptocurrency industry's principles.</p>\nIssues Pile Up For Coinbase&nbsp;\n<p>LeetSwap's trading halt and the exploits on Base's liquidity pairs have raised serious concerns about security vulnerabilities on the Coinbase-backed blockchain. Additionally, Bald's dramatic crash and Coinbase's ongoing legal battle with the SEC have further complicated matters for the platform. The situation highlights the challenges and uncertainties surrounding the crypto industry's regulatory landscape and emphasizes the need for continued vigilance and security measures to protect investors and users alike.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T11:51:46.000Z",
    "title": "IRS ruling requires crypto investors to report staking rewards as taxable income",
    "url": "https://www.cryptopolitan.com/irs-ruling-requires-crypto-investors-to-report-staking-rewards-as-taxable-income/",
    "description": "The Internal Revenue Service (IRS) issued a crucial ruling on Monday, affecting cryptocurrency investors engaged in proof-of-stake networks. According to the judgment, investors who receive rewards for validating activities must include the value of those tokens as part of their taxable income in the year they gain ownership of them. This legal analysis specifies that ... <a title=\"IRS ruling requires crypto investors to report staking rewards as taxable income\" class=\"read-more\" href=\"https://www.cryptopolitan.com/irs-ruling-requires-crypto-investors-to-report-staking-rewards-as-taxable-income/\" aria-label=\"More on IRS ruling requires crypto investors to report staking rewards as taxable income\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-08-01T12:00:34.000Z",
    "title": "FUN Token Pioneers Blockchain Evolution with 20 Million FUN Seed Fund Initiative",
    "url": "https://nulltx.com/fun-token-pioneers-blockchain-evolution-with-20-million-fun-seed-fund-initiative/",
    "description": "FUNToken is delighted to announce the launch of the FUN Token Seed Fund, an innovative program designed to accelerate the integration of FUN Token into the rapidly expanding blockchain industry. The company set aside a 20 million FUN Tokens reserve and will award 40 dapps with 500,000 FUNToken each. The goal is to inspire these [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-01T11:49:50.000Z",
    "title": "InQubeta finds support, QUBE can flip BTC, BNB, and XRP",
    "url": "https://crypto.news/inqubeta-finds-support-qube-can-flip-btc-bnb-and-xrp/",
    "description": "Industry experts predict InQubeta's utility token, QUBE, to outgrow established coins like Bitcoin (BTC), Binance Coin (BNB), and XRP "
  },
  {
    "source": "BTCManager",
    "date": "2023-08-01T11:48:53.000Z",
    "title": "Etihad Airways to launch web3 loyalty program with NFTs",
    "url": "https://crypto.news/etihad-airways-to-launch-web3-loyalty-program-with-nfts/",
    "description": "Etihad Airways, the national airline of the United Arab Emirates, is set to launch an exclusive 300-edition expansion to its EY-ZERO1 non-fungible token (NFT) collection on Aug. 1. The new release promises a host of benefits for NFT holders, including&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-01T12:08:48.000Z",
    "title": "FTT Token Surges 17% After FTX Confirms Rumors Of Relaunch",
    "url": "https://www.newsbtc.com/ftx/ftt-token-surges-17-after-ftx-confirms-rumors-of-relaunch/",
    "description": "Bankrupt crypto exchange FTX has submitted a proposal that may result in the relaunch of its international arm FTX.com. On August 1, the company’s bankruptcy administrators confirmed rumors of a relaunch by filing a draft plan of reorganization in which it proposes the kick-off of a “rebooted” offshore exchange exclusive to non-US users only. FTT Gains By 17% Amidst Plans To Terminate Claims FTT, the native token of the FTX exchange, recorded a significant boost in its price on the emergence of the exchange’s proposal to relaunch in the international market.  Related Reading: FTT Flies 45% On Rumors Of FTX Planned Relaunch According to data by CoinMarketCap, FTT rose by 17% on Tuesday, moving from $1.34 to $1.59. Thereafter, the token experienced a decline, falling as low as $1.42, but has been climbing back up since then. Interestingly, FTT’s gain today has occurred despite the exchange’s plans in relation to its native token. According to the draft plan of reorganization, FTX stated intentions to cancel all FTT claims as a result of their “equity-like characteristics.&#8221;  The statement read:   ….claims by holders of FTT (whether or not held on any FTX exchange), preferred stock, and equity investors in the Debtors and related claims. All these claims and interests will be canceled and extinguished as of the Effective Date, and holders will not receive any distribution. At the time of writing, FTT is trading at $1.45, having gone up by 7.39% in the last day. Meanwhile, the token’s daily trading volume is up by 378.65% and is now valued at $43.8 million. FTT trading at $1.43 on the daily chart &#124; Source: FTTUSDT chart on Tradingview.com FTX.com To Relaunch As Exchange Plans Settlement For Foreign Customers Based on its proposed blueprints for reorganization, FTX intends to sort claimants into several pools. Firstly, customers of the FTX.com exchange will be termed as Dotcom customers, while customers of the FTX US are drawn into the US Customer Pool.  In regards to the settlement of Dotcom creditors, FTX proposes that debtors may partner with third-party investors to set up a new exchange that will operate as an offshore platform. Alternatively, this exchange can also be formed as a merger or “similar transaction.”  Related Reading: Ethereum DeFi Coins Plunge As Curve Concerns Threaten Major Market Crash Thereafter, the debtors may then choose to grant the Dotcom customer pool some share of the company instead of conducting a full cash settlement. A statement from the draft read: Rather than all cash, the Debtors may determine that the Offshore Exchange Company remit non-cash consideration to the Dotcom Customer Pool in the form of equity securities, tokens, or other interests in the Offshore Exchange Company or rights to invest in such equity securities tokens or other interests (“Take-Back Interests”).  Talks concerning an FTX.com relaunch began as early as January, with the company CEO, John J. Ray III, stating he had authorized a team to explore that possibility. In June, WSJ reported that the company had begun discussions with potential investors in a bid to actualize the goal. Featured image from PRNewswire, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-01T12:01:08.000Z",
    "title": "Liquid Mercury Partners with Crossover Markets to Provide Trading Platform Front End",
    "url": "https://www.crypto-news-flash.com/liquid-mercury-partners-with-crossover-markets-to-provide-trading-platform-front-end/?utm_source=rss&utm_medium=rss&utm_campaign=liquid-mercury-partners-with-crossover-markets-to-provide-trading-platform-front-end",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/CROSSx_MacBook__iPad_1690835762bqqDST0ZkM.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/CROSSx_MacBook__iPad_1690835762bqqDST0ZkM.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/CROSSx_MacBook__iPad_1690835762bqqDST0ZkM-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/CROSSx_MacBook__iPad_1690835762bqqDST0ZkM-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/CROSSx_MacBook__iPad_1690835762bqqDST0ZkM-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Chicago, Illinois, August 1st, 2023, Chainwire Liquid Mercury’s professional crypto trading interface will allow CROSSx clients to transact on the exchange via GUI Liquid Mercury, a leading crypto trading technology provider, announced today that it is partnering with Crossover Markets, a digital asset technology firm focused on meeting the unique liquidity requirements of institutions, to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-01T12:00:45.000Z",
    "title": "This New Meme Coin Raises Over $6.5 Million in presale and could surpass Dogecoin (DOGE) in 2023",
    "url": "https://www.crypto-news-flash.com/this-new-meme-coin-raises-over-6-5-million-in-presale-and-could-surpass-dogecoin-doge-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=this-new-meme-coin-raises-over-6-5-million-in-presale-and-could-surpass-dogecoin-doge-in-2023",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T104757.678.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T104757.678.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T104757.678-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T104757.678-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />A generation of new DeFi projects looks ready to upset the established status quo, and one, in particular, has broken out from the pack: DigiToads (TOADS). This new memecoin has raised over $6.57 million in its presale, and analysts have already forecast the possibility that this nascent blockchain ICO could surpass Dogecoin (DOGE) in 2023. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-01T12:00:29.000Z",
    "title": "Analysts Suggest Borroe ($ROE) and Maker (MKR) Could Outperform Litecoin (LTC) In 2023",
    "url": "https://www.crypto-news-flash.com/analysts-suggest-borroe-roe-and-maker-mkr-could-outperform-litecoin-ltc-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=analysts-suggest-borroe-roe-and-maker-mkr-could-outperform-litecoin-ltc-in-2023",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T112116.564.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T112116.564.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T112116.564-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T112116.564-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T112116.564-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T112116.564-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In July 2023, Maker (MKR) recorded two massive double-digit price surges, and investors concluded that the token performed better than Litecoin (LTC) in July. Right now, Litecoin&#8217;s (LTC) halving event is still days away, and there&#8217;s still a chance for the token to prove itself. On the other hand, Borroe ($ROE) is outshining both tokens [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-01T11:57:23.000Z",
    "title": "Is SBF BALD? FTX Connection Emerges in Rug Pull Investigation",
    "url": "https://coinedition.com/is-sbf-bald-ftx-connection-emerges-in-rug-pull-investigation/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/We-are-seeing-a-slippage-on-@BaldBaseBald.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/We-are-seeing-a-slippage-on-@BaldBaseBald.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/We-are-seeing-a-slippage-on-@BaldBaseBald-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/We-are-seeing-a-slippage-on-@BaldBaseBald-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/We-are-seeing-a-slippage-on-@BaldBaseBald-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/We-are-seeing-a-slippage-on-@BaldBaseBald-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/We-are-seeing-a-slippage-on-@BaldBaseBald-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/We-are-seeing-a-slippage-on-@BaldBaseBald-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/We-are-seeing-a-slippage-on-@BaldBaseBald-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/We-are-seeing-a-slippage-on-@BaldBaseBald-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/We-are-seeing-a-slippage-on-@BaldBaseBald-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/We-are-seeing-a-slippage-on-@BaldBaseBald-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/We-are-seeing-a-slippage-on-@BaldBaseBald-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/We-are-seeing-a-slippage-on-@BaldBaseBald-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/We-are-seeing-a-slippage-on-@BaldBaseBald-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/We-are-seeing-a-slippage-on-@BaldBaseBald-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/We-are-seeing-a-slippage-on-@BaldBaseBald-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Sam Bankman-Fried (SBF) may be the deployer of the controversial meme token BALD, according to analysis by on-chain sleuths on Twitter. The previous transactions made by the wallet that added liquidity to the meme token indicated an affiliation with FTX and its sister firm Alameda Research, both founded by Bankman-Fried. In an interesting turn of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/is-sbf-bald-ftx-connection-emerges-in-rug-pull-investigation/\">Is SBF BALD? FTX Connection Emerges in Rug Pull Investigation</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-01T11:44:33.000Z",
    "title": "DeSantis Promises to End Biden’s ‘War on Bitcoin’ if Elected President",
    "url": "https://coinedition.com/desantis-promises-to-end-bidens-war-on-bitcoin-if-elected-president/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Bidens_war_on_bitcoin_and_cryptocurrency_will_come_to_an_end_when.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Bidens_war_on_bitcoin_and_cryptocurrency_will_come_to_an_end_when.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Bidens_war_on_bitcoin_and_cryptocurrency_will_come_to_an_end_when-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Bidens_war_on_bitcoin_and_cryptocurrency_will_come_to_an_end_when-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Bidens_war_on_bitcoin_and_cryptocurrency_will_come_to_an_end_when-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Bidens_war_on_bitcoin_and_cryptocurrency_will_come_to_an_end_when-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Bidens_war_on_bitcoin_and_cryptocurrency_will_come_to_an_end_when-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Bidens_war_on_bitcoin_and_cryptocurrency_will_come_to_an_end_when-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Bidens_war_on_bitcoin_and_cryptocurrency_will_come_to_an_end_when-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Bidens_war_on_bitcoin_and_cryptocurrency_will_come_to_an_end_when-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Bidens_war_on_bitcoin_and_cryptocurrency_will_come_to_an_end_when-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Bidens_war_on_bitcoin_and_cryptocurrency_will_come_to_an_end_when-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Bidens_war_on_bitcoin_and_cryptocurrency_will_come_to_an_end_when-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Bidens_war_on_bitcoin_and_cryptocurrency_will_come_to_an_end_when-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Bidens_war_on_bitcoin_and_cryptocurrency_will_come_to_an_end_when-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Bidens_war_on_bitcoin_and_cryptocurrency_will_come_to_an_end_when-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Bidens_war_on_bitcoin_and_cryptocurrency_will_come_to_an_end_when-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Governor Ron DeSantis of Florida, United States, committed to ending the so-called “war on Bitcoin” and cryptocurrencies being waged by the Biden administration if he becomes the next President of the United States. DeSantis committed during a campaign event this Monday in pursuit of the Republican party’s nomination for the upcoming presidential election. While speaking [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/desantis-promises-to-end-bidens-war-on-bitcoin-if-elected-president/\">DeSantis Promises to End Biden’s ‘War on Bitcoin’ if Elected President</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-01T11:45:45.000Z",
    "title": "Global Crypto Users To Explode to 1,200,000,000, Predicts Former Goldman Sachs Executive – Here’s His Timeline",
    "url": "https://dailyhodl.com/2023/08/01/global-crypto-users-to-explode-to-1200000000-predicts-former-goldman-sachs-executive-heres-his-timeline/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Global-Crypto-Users-To.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Global-Crypto-Users-To.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Global-Crypto-Users-To.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Global-Crypto-Users-To.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Global-Crypto-Users-To.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Global-Crypto-Users-To.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Global-Crypto-Users-To.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Ex-Goldman Sachs executive Raoul Pal says that the number of crypto users is on course to explode above one billion across the globe. The CEO of Real Vision and Global Macro Investor tells his 997,500 Twitter followers that a chart comparing the adoption of the internet and crypto over each of the sectors&#8217; initial ten [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/01/global-crypto-users-to-explode-to-1200000000-predicts-former-goldman-sachs-executive-heres-his-timeline/\">Global Crypto Users To Explode to 1,200,000,000, Predicts Former Goldman Sachs Executive – Here’s His Timeline</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]