[
  {
    "source": "Decrypt",
    "date": "2024-01-11T21:56:21.000Z",
    "title": "'Axie Infinity' Caps SLP Token Supply—Can It Revitalize the Play-to-Earn Game?",
    "url": "https://decrypt.co/212564/axie-infinity-caps-slp-token-supply-revitalize-play-earn-game",
    "description": "Axie Infinity's SLP or Smooth Love Potion token is getting a rework, including a capped supply and a \"stability fund\" to support it."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-11T22:00:27.000Z",
    "title": "SEC wants Ripple to share financial statements and contracts to determine remedies",
    "url": "https://cryptoslate.com/sec-wants-ripple-to-share-financial-statements-and-contracts-to-determine-remedies/",
    "description": "<p>The U.S. Securities and Exchange Commission (SEC) said in a Jan. 11 filing that it aims to have Ripple provide certain documents in an ongoing legal case. Specifically, the securities regulator requested a court order compelling Ripple Labs, Inc. to produce financial statements for 2022 and 2023. The SEC also asked for Ripple to be [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/sec-wants-ripple-to-share-financial-statements-and-contracts-to-determine-remedies/\">SEC wants Ripple to share financial statements and contracts to determine remedies</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-11T21:50:19.000Z",
    "title": "Socrates Leads Debate2Earn Revolution with New Pioneer Pen",
    "url": "https://cryptodaily.co.uk/2024/01/socrates-leads-debate2earn-revolution-with-new-pioneer-pen",
    "description": "Socrates Leads Debate2Earn Revolution with New Pioneer Pen"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-11T21:59:53.000Z",
    "title": "Digital Yuan Fraud cases surge, prompting security review",
    "url": "https://www.cryptopolitan.com/digital-yuan-fraud-cases-surge-prompting/",
    "description": "The digital yuan, China&#8217;s central bank digital currency (CBDC), is being exploited in sophisticated fraud schemes. Notably, a recent case in Shanghai highlighted how criminals use the digital yuan to commit financial crimes. The Shanghai High Court reported a unique “run-score” fraud involving the digital yuan, where perpetrators swiftly emptied an ATM within two hours. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-11T21:50:21.000Z",
    "title": "Socrates Leads Debate2Earn Revolution with New Pioneer Pen",
    "url": "https://www.cryptopolitan.com/socrates-leads-debate2earn-revolution-with-new-pioneer-pen/",
    "description": "London, United Kingdom, January 11th, 2024, Chainwire Socrates, the first SocialFi Debate-to-Earn platform, announces a transformative upgrade with the launch of the Pioneer Pen on January 11th, 2024. This significant development shifts existing ERC-1155 SBT Pens to the ERC-721 Pioneer Pens, bringing the uniqueness and tradability of NFTs to the forefront, which are now tradable [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-11T21:41:00.000Z",
    "title": "Ripple CTO David Schwartz refutes claims of excessive XRP sales in December",
    "url": "https://www.cryptopolitan.com/david-schwartz-refute-claim-of-excessive-xrp/",
    "description": "Ripple CTO David Schwartz has recently addressed and refuted claims regarding the company&#8217;s alleged excessive sales of XRP in December 2023. These allegations suggest that Ripple sold 237 million XRP, a significant increase from their usual monthly sales, and have been a topic of intense speculation within the cryptocurrency community. Schwartz&#8217;s intervention aims to clarify [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-11T21:50:28.000Z",
    "title": "Dogwifhat $WIF Witnesses Impressive Surge, Nearing All-Time High With Over 100% Gain",
    "url": "https://nulltx.com/dogwifhat-wif-witnesses-impressive-surge-nearing-all-time-high-with-over-100-gain/",
    "description": "The recent upswing in the value of Dogwifhat $WIF echoes the prevailing optimism sweeping through the broader cryptocurrency market, particularly focusing on alternative coins (altcoins). Among Solana-based tokens, Dogwifhat, a memecoin, stands out as the biggest beneficiary of this positive momentum, showcasing an impressive surge of 128% in the last [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-11T22:00:59.000Z",
    "title": "XRP And XLM Price Correlation Persists, Ripple CTO Explains Why",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-and-xlm-price-ripple-cto/",
    "description": "XRP and Stellar (XLM) are two cryptocurrencies that have been constantly compared in terms of price growth and development. Both digital assets are dedicated to facilitating cross-border transactions.  Given their considerable similarities, the Chief Technology Officer (CTO) of Ripple, David Schwartz has attempted to uncover the factors contributing to the persistent price correlations between the cryptocurrencies.  Ripple CTO Explores XRP And XLM Price Trends Schwartz has recently taken to X (formerly Twitter) to share a chart illustrating a strong correlation in the price movements and patterns between XRP and XLM tokens. In response to an X user who expressed curiosity regarding the similar price trends between the two cryptocurrencies, Schwartz explained the distinct reasons behind XRP and XLM’s unique price movements.  Related Reading: Renowned Finance Author Says Bitcoin Price Is Headed For $150,000, Reveals Catalyst The Ripple CTO acknowledged that he lacked an accurate explanation for the price correlations between XRP and XLM. However, he provided two major factors that could be influencing the price trends.  Schwartz revealed that comparable market forces that regulate various cryptocurrencies also control XRP and XLM. He further stated that most investors and crypto enthusiasts often place XRP and XLM within the same category due to the cryptocurrencies’ historical connection.  As a result, a significant number of people simultaneously engage in buying and selling XRP and XLM causing the cryptocurrencies to have similar price movements.  Concluding his analysis, Schwartz stated that he believed there were no market manipulations or external “evil forces” making these cryptocurrencies display similar price trends.  Bulls resume control of price &#124; Source: XRPUSD on Tradingview.com Latest Developments For Both Assets XRP and XLM are one of the major cryptocurrencies that have gained significant attention, often seen as the leading contenders for cross-border payments and mainstream adoption.  While these two cryptocurrencies tend to display similar price tracks, they have been experiencing vastly different developments in their respective markets and ecosystems.  Related Reading: Cardano Price Explosion: Crypto Analyst Predicts ADA Price To Hit $6 XRP recently gained regulatory clarity after successfully gaining a victory in its ongoing legal battle with the United States Securities and Exchange Commission (SEC). Despite speculations suggesting that XLM might be the SEC’s next target due to its striking similarities with XRP, the cryptocurrency has not encountered similar legal issues in the US as Ripple.  Following XRP’s partial legal success, the price of XRP surged considerably. While XLM followed behind increasing by almost 90% but retraced some of the accumulated gains later.  In terms of expansion, XRP has achieved multiple milestones and has gained approvals in several regions including Dubai. The cryptocurrency is positioned to gain from Ripple’s potential integration into trillion-dollar markets and industries. On the other hand, Stellar (XLM) is improving its ecosystem by integrating a new testnet upgrade, Protocol 20. The cryptocurrency is also actively seeking new partnerships with banks to expand its reach and utility. Featured image from Coinmarketcap, chart from Tradingview.com"
  }
]