[
  {
    "source": "CoinDesk",
    "date": "2024-03-15T04:19:02.000Z",
    "title": "Bitcoin Tumbles to $67K As Asia Begins Trading Day",
    "url": "https://www.coindesk.com/markets/2024/03/15/bitcoin-tumbles-to-67k-as-asia-begins-trading-day/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bitcoin's price has begun a recovery, trading above $68,5K as the day continues."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-15T04:30:40.000Z",
    "title": " El Salvador’s Bitcoin wallet gets sats, cats and a cypherpunk manifesto ",
    "url": "https://cointelegraph.com/news/el-salvadors-bitcoin-wallet-vault-gets-ordinals-sats-donations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNGViZDllZmUtMzJmNC00ODI2LTliMzQtOTYwZmNiZmQzYTNhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Approximately $700 in satoshis were sent to El Salvador’s new “Bitcoin piggy bank” across dozens of donations.</p>\n                    <p><p>Only hours after El Salvador publicly announced its move to store a “big chunk” of its Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC)</a> in a physically secured cold wallet, Bitcoiners have already lined the wallet with their favorite “rare sats” and Ordinals.</p><p>On March 14, El Salvador President Nayib Bukele <a href=\"https://x.com/nayibbukele/status/1768425845163503738\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> his country’s new “Bitcoin piggy bank” — storing a portion of the country’s Bitcoin holdings in a cold wallet stored in a physical vault. </p><p>The wallet currently shows a balance of $388 million in Bitcoin, <a href=\"https://mempool.space/address/32ixEdVJWo3kmvJGMTZq5jAQVZZeuwnqzo\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to Bitcoin explorer Mempool.</p><p><a href=\"https://cointelegraph.com/news/el-salvadors-bitcoin-wallet-vault-gets-ordinals-sats-donations\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-15T04:21:32.000Z",
    "title": " Chainlink CCIP revenue surges 180% over 2 months amid ‘massive adoption’ ",
    "url": "https://cointelegraph.com/news/chainlink-ccip-revenue-surges-180-percent-2-months",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvOGUxYmFjNGYtZjNhMi00OGQ5LTk3YWQtMTMzNjdjNmUxOTQzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The cumulative revenue for the cross-chain protocol which launched in July 2023 has reached $377,724. </p>\n                    <p><p>Revenue for Chainlink’s Cross Chain Interoperability Protocol (CCIP) has surged 180% over the past two months amid  increased adoption of the multichain bridging platform.</p><p>Fee revenue for CCIP has gone up from around $61,000 in total for January to more than $171,000 in just the first two weeks of March.</p><p>Meanwhile, total cumulative revenue for the cross-chain protocol, which <a href=\"https://cointelegraph.com/news/chainlink-launches-cross-chain-protocol-ccip-ethereum-blockchain-mainnet\">launched</a> in July 2023, has reached $377,724, according to Dune Analytics.</p><p><a href=\"https://cointelegraph.com/news/chainlink-ccip-revenue-surges-180-percent-2-months\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-15T04:29:09.000Z",
    "title": "Is the OpenAI Controversy Deepening Amidst Sora’s Data Sourcing Doubts? Elon Musk Raises Questions",
    "url": "https://www.cryptopolitan.com/openai-controversy-soras-data-sourcing-musk/",
    "description": "In the latest development of the ongoing saga between Tesla and SpaceX CEO Elon Musk and the AI giant OpenAI, the OpenAI controversy erupts once again as Musk accuses the company of unethical practices in data sourcing. The dispute stems from an interview featuring OpenAI&#8217;s CTO Mira Murati, wherein questions arose regarding the sources of [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-15T04:18:22.000Z",
    "title": "Ethereum Price Takes Hit, But This Support Could Spark Fresh Increase",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-takes-hit-3680/",
    "description": "Ethereum price is declining from the $4,080 zone. ETH is now approaching a major support at $3,500 where the bulls might take a stand. Ethereum started a downside correction from the $3,080 zone. The price is trading below $3,800 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance at $3,850 on the hourly chart of ETH/USD (data feed via Kraken). The pair could resume its increase if it clears the $3,850 resistance zone. Ethereum Price Dips Ethereum price failed to stay above the $4,000 resistance zone and started a downside correction, like Bitcoin. ETH declined below the $3,920 and $3,850 support levels to enter a short-term bearish zone. It even spiked below the $3,680 support zone. A low was formed at $3,625 and the price is now consolidating losses. It seems like there is a key bearish trend line forming with resistance at $3,850 on the hourly chart of ETH/USD. Ethereum price is now trading below $3,800 and the 100-hourly Simple Moving Average. On the upside, immediate resistance is near the $3,740 level or the 23.6% Fib retracement level of the recent decline from the $4,083 swing high to the $3,625 low. The first major resistance is near the $3,850 level and the trend line. It is close to the 50% Fib retracement level of the recent decline from the $4,083 swing high to the $3,625 low. Source: ETHUSD on TradingView.com The next major resistance is near $3,880, above which the price might gain bullish momentum. In the stated case, Ether could rally toward the $4,000 level. If there is a move above the $4,000 resistance, Ethereum could even rise toward the $4,080 resistance. Any more gains might call for a test of $4,150. More Losses In ETH? If Ethereum fails to clear the $3,850 resistance, it could continue to move down. Initial support on the downside is near the $3,680 level. The first major support is near the $3,600 zone. The next key support could be the $3,500 zone. A clear move below the $3,500 support might send the price toward $3,350. Any more losses might send the price toward the $3,250 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $3,600 Major Resistance Level – $3,850"
  }
]