[
  {
    "source": "CoinDesk",
    "date": "2023-09-25T16:18:18.000Z",
    "title": "Coinbase Successfully Registers With Spain's Central Bank  ",
    "url": "https://www.coindesk.com/policy/2023/09/25/coinbase-successfully-registers-with-spains-central-bank/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The firm has registered as a crypto exchange and custody wallet provider."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-25T16:21:04.000Z",
    "title": "Price analysis 9/25: SPX, DXY, BTC, ETH, BNB, XRP, ADA, DOGE, TON, SOL",
    "url": "https://cointelegraph.com/news/price-analysis-9-25-spx-dxy-btc-eth-bnb-xrp-ada-doge-ton-sol",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/9ec40e5a-dcb9-4ec6-8be4-65837b9dca08.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The strength in the United States dollar index could keep Bitcoin and select altcoins under pressure in the near term.</p>\n                    <p><p>Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) weakness on Sep. 24 shows that the bears remain in control. Sellers are trying to pull the price below $26,000 but the bulls are likely to defend the level with vigor. Buyers are trying to achieve a <a href=\"https://cointelegraph.com/news/us-govt-shutdown-looms-5-things-bitcoin-this-week\">positive monthly close for Bitcoin in September</a> for the first time since 2016.</p><p>If they can pull it off, it will be a major sentiment booster as October generally favors the buyers. According to CoinGlass data, Bitcoin has seen a negative monthly close in October only on two occasions, in 2014 and 2018. However, Bitcoin bulls will find it difficult to maintain the momentum if macroeconomic headwinds persist.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/23e29adb-f998-4c77-af4d-9233b366fc16.png\"  /><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>Another risk to the cryptocurrency recovery may come from the strength in the greenback, which has risen for ten straight weeks, its longest winning streak since 2014. The United States dollar index (DXY) has also formed a golden cross, indicating further potential upside in the near term.</p><p>Will the U.S. dollar extend its gains or witness a short-term correction? Can Bitcoin bulls hold off the bear pressure in the last week of September? Let’s analyze the charts to find out.</p><h2>S&P 500 Index price analysis</h2><p>The S&amp;P 500 Index turned down sharply from the downtrend line and broke below the moving averages on Sep. 15. This started a downward move, which has reached the crucial support at 4,325.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/130b1eff-0843-48f3-92e4-b7e815d01626.png\"  /><figcaption style=\"text-align: center;\"><em>SPX daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=TVC%3ASPX\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The 20-day exponential moving average (4,422) has started to turn down and the relative strength index (RSI) is near the oversold territory, indicating that bears have the edge. If the price maintains below 4,325, the index will complete a bearish head and shoulders (H&amp;S) pattern. This negative setup has a target objective of 4,043.</p><p>If bulls want to prevent the fall, they will have to quickly drive the price above the 20-day EMA. That could attract further buying and the bulls will then attempt to kick the price above the downtrend line. If they manage to do that, the index has a good chance of retesting the local high at 4,607.</p><h2>U.S. dollar index price analysis</h2><p>The U.S. dollar index bounced off the 20-day EMA (104.85) on Sep. 20, indicating that the sentiment remains positive and traders are buying on dips.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/008d177a-5033-4289-802f-ecfe150ec1e3.png\"  /><figcaption style=\"text-align: center;\"><em>DXY daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=TVC%3ADXY\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The up-move is likely to hit a wall at 106. This is the key level to keep an eye on in the near term. If the price turns down from this resistance but bounces off the 20-day EMA, it will enhance the prospects of a rally above 106. The next resistance on the upside is at 108.</p><p>Sellers will have to yank the price back below the 20-day EMA if they want to weaken the bullish momentum. The index could then drop to 104.40 and later to the 50-day simple moving average (103.35).</p><h2>Bitcoin price analysis</h2><p>The uncertainty from the inside-day candlestick pattern on Sep. 22 and 23 resolved to the downside on Sep. 24. This suggests that the bears have asserted their supremacy.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/090aef31-c88f-450e-8cc0-b79005491b55.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The sellers will try to strengthen their position further by pulling the price to the solid support at $24,800. This remains the key level to watch out for in the near term as the bulls are expected to defend it with all their might. If the $24,800 support gives way, the BTC/USDT pair could start a downward move to $20,000.</p><p>Time is running out for the bulls. If they want to start a meaningful recovery, they will have to push and sustain the price above the moving averages. That will open the doors for a retest of the overhead resistance at $28,143.</p><h2>Ether price analysis</h2><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) has been gradually slipping toward the pivotal level at $1,531, suggesting a lack of buying support from the bulls.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/36c118f3-8d3c-47d7-9b02-22eb1590feaa.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AETHUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>Although the downsloping moving averages indicate advantage to sellers, the RSI is showing signs of forming a bullish divergence. This suggests that the selling pressure could be reducing. This increases the likelihood of a bounce off $1,531. </p><p>If bulls shove the price above the 20-day EMA ($1,616), it will signal a range-bound action between $1,531 and $1,746 for a few days. This view will invalidate if bears sink and sustain the ETH/USDT pair below $1,531. The pair could then plummet to $1,368.</p><h2>BNB price analysis</h2><p>BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) has been swinging between $220 and $203 for the past few days. In a range, traders generally buy near the support and sell close to the resistance. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/82bdc1bc-bbc4-4529-afcf-28b248e3c973.png\"  /><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABNBUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>Both moving averages are sloping down, indicating advantage to bears but the RSI is trying to form a bullish divergence. This suggests that the bearish momentum may be weakening. Buyers are likely to defend the $203 level with vigor. </p><p>If the price rises from the current level or bounces off $203, it will suggest that the range-bound action may continue for some more time. Sellers will need to tug the price below the critical support at $203 to take charge. The BNB/USDT pair could then plunge to $183.</p><h2>XRP price analysis</h2><p>After staying above the 20-day EMA ($0.50) for a few days, XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) tumbled below the level on Sep. 24. This suggests that the bears have gained the upper hand.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/b87738d1-cc6b-45b6-b3ff-e505f99984b2.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AXRPUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>XRP price could fall to the uptrend line, which is expected to act as a strong support. If the price rebounds off the uptrend line, the bulls will again try to shove the price above the 20-day EMA. If they do that, it will signal aggressive buying at lower levels. The pair may then climb to the 50-day SMA ($0.53).</p><p>Contrarily, if the uptrend line fails to hold, XRP price could first slump to $0.46 and thereafter to the formidable support at $0.41. This level is likely to attract strong buying by the bulls.</p><h2>Cardano price analysis</h2><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) dropped to the critical support at $0.24 on Sep. 25, indicating that the bears have maintained their pressure.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/2a464d0f-3cb9-46d4-8c00-36eed1b8ab1c.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AADAUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>A minor advantage in favor of the bulls is that the RSI is forming a bullish divergence. The bulls will have to quickly shove the ADA/USDT pair above the downtrend line to reduce the risk of a breakdown below $0.24. If they can pull it off, the bearish descending triangle will be rendered invalid and that could boost the price to $0.29.</p><p>Instead, if bears drag ADA price below $0.24, it will complete the bearish setup. That could start a downward move toward $0.22 and subsequently to the pattern target of $0.19.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/how-much-is-bitcoin-worth-today\"><strong><em>How much is Bitcoin worth today?</em></strong></a></p><h2>Dogecoin price analysis</h2><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) is stuck inside a tight range between $0.06 and the 20-day EMA ($0.06). Typically, a volatility squeeze is followed by an expansion in volatility but it is difficult to predict the direction of the breakout.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/71f47801-dc8d-4697-aed6-fdea767c76fc.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ADOGEUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>If the price turns up off the current level, the bulls will again try to clear the overhead hurdle at the 20-day EMA. If they succeed, the DOGE/USDT pair could rise to $0.07 and later sprint to $0.08. The bears are expected to sell near this level.</p><p>Alternatively, if the range resolves to the downside with a break below $0.06, it will indicate that bears have seized control. DOGE price may then nosedive to the next major support at $0.055.</p><h2>Toncoin price analysis</h2><p>Toncoin (TON) turned down sharply from the overhead resistance at $2.59 on Sep. 20 and continued lower, indicating that the bulls are booking profits.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/8109e4d4-c699-4682-9835-14de6c5c1168.png\"  /><figcaption style=\"text-align: center;\">TON/USDT daily chart. Source: TradingView</figcaption></figure><p>The first support on the downside is at the 20-day EMA ($2.11). If the price rebounds off this level with strength, it will suggest that the sentiment remains positive and traders are buying on dips. The bulls will then again try to push the price to $2.59.</p><p>Contrary to this assumption, if the price skids below the 20-day EMA, it will indicate that the bulls are losing their grip. The TON/USDT pair could first dip to the psychological level of $2 and later to the 50-day SMA ($1.72). A deeper correction is likely to delay the next leg of the up-move.</p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) has been clinging to the 20-day EMA ($19.53) for the past few days, indicating a tough battle between the bulls and the bears.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/c5f9b7b7-35d8-424c-8e58-dbfdb27057f3.png\"  /><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ASOLUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The flattish 20-day EMA and the RSI just below the midpoint indicate a balance between supply and demand. On the upside, the bulls will have to thrust the price above the 50-day SMA ($20.80) to signal the start of a recovery to $22.30.</p><p>Conversely, if the price turns down from the current level, it will suggest that the bears are back in command. The SOL/USDT pair could then retest the important support at $17.33. If this level snaps, the pair may collapse to $14.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-25T16:12:31.000Z",
    "title": "$200M Mixin Network hack draws controversy",
    "url": "https://cointelegraph.com/news/200-million-mixin-network-hack-draws-controversy",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/720f7053-b2b0-434d-898d-07b743c09caf.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Xiaodong Feng, Mixin's founder, immediately outlined a compensation plan but would only reimburse up to 50% of users' assets for now. </p>\n                    <p><p>Hong Kong-based decentralized cross-chain transfer protocol Mixin Network is drawing controversy over the disclosure of a $200 million hack on Sept. 25.</p><p>In a <a href=\"https://weibo.com/7623214127/NkWWYpCpY\" target=\"_blank\" rel=\"noopener nofollow\">post</a> on Sept. 25, Zhuoer Jiang, CEO of Bitcoin mining pool BTC.TOP, <a href=\"https://mixin.network/blog/2023/mixin-network-monthly-report-no.53/\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> that BTC stored in the Mixin protocol \"should have never been stolen in the first place.\" Jiang claims that, normally, Mixin's Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) would have been \"kept in cold storage\" and remained unaffected by the cloud server hack compromising Mixin's hot wallets. During its last monthly report in July, Mixin disclosed a total of 9,544 BTC, worth roughly $253 million, stored in its protocol. </p><p>On Sept. 23, Mixin's cloud service provider's database was breached by hackers, resulting in the loss of $200 million in assets on its mainnet. Deposits and withdrawal services were immediately suspended on the protocol. However, developers said transfers would not be affected as the investigation continues.</p><p>During a live briefing on Sept. 25, Xiaodong Feng, Mixin's founder, <a href=\"https://www.panewslab.com/zh/sqarticledetails/hhfi727g.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a> that Bitcoin was \"the core asset\" stolen during the <a href=\"https://cointelegraph.com/news/mixin-network-hack-200-m-crypto-assets\">$200 million security incident</a> and that developers would compensate users \"up to a maximum of 50%\" on the stolen assets. According to Feng, the remainder would be distributed to users in the form of \"tokenized liability claims\" that Mixin would eventually repurchase \"with its future profits.\"</p><p>Founded in 2017, Mixin had nearly $400 million across 48 chains locked in its protocol before the incident, as per <a href=\"https://defillama.com/chain/Mixin\" target=\"_blank\" rel=\"noopener nofollow\">data</a> provided by DeFiLlama. The protocol allows users to send digital assets to other individuals via phone numbers. Xiaolai Li, a Chinese billionaire and early Bitcoin enthusiast, is one of the earliest angel investors in the firm. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">[Announcement] In the early morning of September 23, 2023 Hong Kong time, the database of Mixin Network&#39;s cloud service provider was attacked by hackers, resulting in the loss of some assets on the mainnet. We have contacted Google and blockchain security company <a href=\"https://twitter.com/SlowMist_Team?ref_src=twsrc%5Etfw\">@SlowMist_Team</a>…</p>&mdash; Mixin Kernel (@MixinKernel) <a href=\"https://twitter.com/MixinKernel/status/1706139175018529139?ref_src=twsrc%5Etfw\">September 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/dao-hyped-voting-decentralization/\">Are DAOs overhyped and unworkable? Lessons from the front lines</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-25T16:30:13.000Z",
    "title": "Justin Sun confirms $8 HTX exploit; attacker offered 5% bounty and a security advisor role to return funds",
    "url": "https://cryptoslate.com/justin-sun-confirms-8-htx-exploit-attacker-offered-5-bounty-and-a-security-advisor-role-to-return-funds/",
    "description": "<p>Crypto entrepreneur and HTX global adviser Justin Sun confirmed today that the exchange was compromised in an exploit that resulted in a loss of $7.9 million. Web3 security firm Cyvers first reported the hack, noting that its system detected a suspicious transaction involving the exchange on Sept. 24. It identified an externally owned account (EOA) that received [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/justin-sun-confirms-8-htx-exploit-attacker-offered-5-bounty-and-a-security-advisor-role-to-return-funds/\">Justin Sun confirms $8 HTX exploit; attacker offered 5% bounty and a security advisor role to return funds</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-25T16:14:16.000Z",
    "title": "HTX Global faces $7.9M loss in major security breach",
    "url": "https://www.cryptopolitan.com/htx-global-faces-7-9m-loss-in-hack/",
    "description": "HTX Global, a renowned cryptocurrency exchange, reported a loss of $7.9 million. The vigilant monitoring system of Theo CyversAlerts first flagged this incident. Consequently, concerns about the safety of bitcoin exchanges are now more pronounced than ever. Huobi Global, another major player in the Bitcoin industry, was involved in a transaction with HTX Global. However, ... <a title=\"HTX Global faces $7.9M loss in major security breach\" class=\"read-more\" href=\"https://www.cryptopolitan.com/htx-global-faces-7-9m-loss-in-hack/\" aria-label=\"More on HTX Global faces $7.9M loss in major security breach\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-25T16:33:32.000Z",
    "title": "Polkadot’s Quantum Leap: Roadmap Unveiled to Support 1,000 Parachains",
    "url": "https://www.crypto-news-flash.com/polkadots-quantum-leap-roadmap-unveiled-to-support-1000-parachains/?utm_source=rss&utm_medium=rss&utm_campaign=polkadots-quantum-leap-roadmap-unveiled-to-support-1000-parachains",
    "description": "<img width=\"1280\" height=\"721\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Polkadot.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polkadot\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Polkadot.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Polkadot-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/02/Polkadot-1024x577.jpg 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Polkadot, a Proof-of-Stake (POS) unveils ambition to support 1000 Parachains. The protocols innovators have named asynchronous backing as the solution to usher in this massive scalability. There is growing interest in improving the scalability of the Polkadot (DOT) network and expanding the number of parallel chains, as such, developers of the interoperability blockchain plan to [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-25T16:36:00.000Z",
    "title": "Worldcoin (WLD) Adoption Skyrockets in Chile, Price Reaches $1.70",
    "url": "https://coinedition.com/worldcoin-wld-adoption-skyrockets-in-chile-price-reaches-1-70/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/Worldcoin-WLD-Adoption-Skyrockets-in-Chile-Price-Reaches-1.70.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Worldcoin (WLD) Adoption Skyrockets in Chile, Price Reaches $1.70\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/Worldcoin-WLD-Adoption-Skyrockets-in-Chile-Price-Reaches-1.70.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/Worldcoin-WLD-Adoption-Skyrockets-in-Chile-Price-Reaches-1.70-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/Worldcoin-WLD-Adoption-Skyrockets-in-Chile-Price-Reaches-1.70-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/Worldcoin-WLD-Adoption-Skyrockets-in-Chile-Price-Reaches-1.70-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/Worldcoin-WLD-Adoption-Skyrockets-in-Chile-Price-Reaches-1.70-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/Worldcoin-WLD-Adoption-Skyrockets-in-Chile-Price-Reaches-1.70-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/Worldcoin-WLD-Adoption-Skyrockets-in-Chile-Price-Reaches-1.70-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/09/Worldcoin-WLD-Adoption-Skyrockets-in-Chile-Price-Reaches-1.70-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/Worldcoin-WLD-Adoption-Skyrockets-in-Chile-Price-Reaches-1.70-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/Worldcoin-WLD-Adoption-Skyrockets-in-Chile-Price-Reaches-1.70-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/Worldcoin-WLD-Adoption-Skyrockets-in-Chile-Price-Reaches-1.70-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/Worldcoin-WLD-Adoption-Skyrockets-in-Chile-Price-Reaches-1.70-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/Worldcoin-WLD-Adoption-Skyrockets-in-Chile-Price-Reaches-1.70-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/Worldcoin-WLD-Adoption-Skyrockets-in-Chile-Price-Reaches-1.70-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/Worldcoin-WLD-Adoption-Skyrockets-in-Chile-Price-Reaches-1.70-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/09/Worldcoin-WLD-Adoption-Skyrockets-in-Chile-Price-Reaches-1.70-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Worldcoin&#8217;s World ID gains traction in Chile as 200,000 Chileans have created a World ID. If bearish momentum recoups market control, the potential support level lies at $1.50 and $1.30. WLD surges to $1.70, eyeing $2.00, with increased market cap and trading volume indicating strong investor interest. Worldcoin recently revealed a pivotal achievement as over [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/worldcoin-wld-adoption-skyrockets-in-chile-price-reaches-1-70/\">Worldcoin (WLD) Adoption Skyrockets in Chile, Price Reaches $1.70</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-25T16:19:05.000Z",
    "title": "Cryptocurrency Trading and Investment Revolutionized with Defibot",
    "url": "https://coinedition.com/cryptocurrency-trading-and-investment-revolutionized-with-defibot/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/Cryptocurrency-Trading-and-Investment-Revolutionized-with-Defibot.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cryptocurrency Trading and Investment Revolutionized\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/Cryptocurrency-Trading-and-Investment-Revolutionized-with-Defibot.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/Cryptocurrency-Trading-and-Investment-Revolutionized-with-Defibot-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/Cryptocurrency-Trading-and-Investment-Revolutionized-with-Defibot-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/Cryptocurrency-Trading-and-Investment-Revolutionized-with-Defibot-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/Cryptocurrency-Trading-and-Investment-Revolutionized-with-Defibot-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/Cryptocurrency-Trading-and-Investment-Revolutionized-with-Defibot-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/Cryptocurrency-Trading-and-Investment-Revolutionized-with-Defibot-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/09/Cryptocurrency-Trading-and-Investment-Revolutionized-with-Defibot-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/Cryptocurrency-Trading-and-Investment-Revolutionized-with-Defibot-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/Cryptocurrency-Trading-and-Investment-Revolutionized-with-Defibot-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/Cryptocurrency-Trading-and-Investment-Revolutionized-with-Defibot-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/Cryptocurrency-Trading-and-Investment-Revolutionized-with-Defibot-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/Cryptocurrency-Trading-and-Investment-Revolutionized-with-Defibot-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/Cryptocurrency-Trading-and-Investment-Revolutionized-with-Defibot-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/Cryptocurrency-Trading-and-Investment-Revolutionized-with-Defibot-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/09/Cryptocurrency-Trading-and-Investment-Revolutionized-with-Defibot-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In the fast-paced world of cryptocurrency trading and investment, finding a reliable and innovative platform can be a daunting task. Enter Defibot, a financial technology platform that has been shaking up the crypto space since its launch in 2018. With a range of cutting-edge services and a commitment to risk management, Defibot has earned its [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/cryptocurrency-trading-and-investment-revolutionized-with-defibot/\">Cryptocurrency Trading and Investment Revolutionized with Defibot</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]