[
  {
    "source": "Decrypt",
    "date": "2023-10-23T20:10:48.000Z",
    "title": "These Crypto Stocks Are Still Outperforming Bitcoin",
    "url": "https://decrypt.co/202865/crypto-stocks-beating-bitcoin-grayscale-microstrategy-coinbase",
    "description": "While Bitcoin has been a great buy, many companies built around it are flying even higher this year. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-23T20:26:17.000Z",
    "title": "Lower-middle income countries lead in crypto adoption, but not volume: Chainalysis ",
    "url": "https://cointelegraph.com/news/lower-middle-income-countries-lead-crypto-adoption-not-volume-chainalysis",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/dafd8602-ffd3-4e0e-88df-842c7882c144.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Usage is down, but the future of crypto looks bright thanks to adoption in up-and-coming economies, according to Chainalysis.</p>\n                    <p><p>India leads the world in crypto adoption, followed by Nigeria and Vietnam, according to a new Chainalysis report. Nonetheless, North America accounts for nearly a quarter of all value received by cryptocurrency exchanges, with the United States leading by far.</p><p>To calculate adoption, Chainalysis <a href=\"https://go.chainalysis.com/rs/503-FAP-074/images/The%202023%20Geography%20of%20Cryptocurrency%20Report.pdf?version=0\" target=\"_blank\" rel=\"noopener nofollow\">used</a> web traffic data from 13 billion web visits to track five categories of activity, weighted by purchasing power parity per capita. That is, “if two countries received equal amounts of cryptocurrency at centralized services, the country with lower PPP per capita would rank ahead.” That will help determine where “everyday people are embracing crypto the most.”</p><p>Crypto adoption is down worldwide, with the exception of lower-middle income (LMI) countries, such as India, Nigeria and fifth-ranked Ukraine, the report found. Those countries, where 40% of the world’s population lives, have been the greatest crypto adopters since the second quarter of 2022, when world usage began to plummet:</p><blockquote>“This could be extremely promising for crypto’s future prospects. LMI countries are often countries on the rise, with dynamic, growing industries and populations. […] If LMI countries are the future, then the data indicates that crypto is going to be a big part of that future.” </blockquote><p>Central and Southern Asia and Oceania, Central, Northern and Western Europe, and North America group together as the top originators of transaction value received.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/44d208de-b47c-4a4f-a01a-29b4b81bd676.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Crypto transaction volume received by region. Source: Chainalysis</em></figcaption></figure><p>While North America was dominant on the crypto market by volume, there was a clear drop in institutional transaction volume beginning in April. The share of stablecoin in that volume also fell significantly, from 70.3% in February to 48.8% by June. The weighted volume of transactions in decentralized finance (DeFi) fell from over 75% in August 2022 to less than 50% in July 2023.</p><p>Central, Northern and Western Europe produced 17.6% of crypto value received, with the United Kingdom accounting for more than twice the volume of second-runner Germany. The U.K. ranked 14th in adoption worldwide. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/uk-top-crypto-economy-cnwe-chainalysis\">UK tops crypto activity in Central, Northern and Western Europe: Chainalysis</a></em></strong></p><p>France led in DeFi growth, however. DeFi saw growth in Central and Southern Asia and Oceania, Eastern Europe and Central, Northern and Western Europe year-on-year in the 12 months ending in June 2023. </p><p>Central and Southern Asia and Oceania accounted for 19.3% of crypto value received by exchanges. First-place India led second-place Vietnam by approximately 100%.</p><p>Bans in China dragged down transaction volume in Eastern Asia, beginning in 2020. Nonetheless, China produced over $75 billion in value received by exchanges in the 12 months ending in June, with almost three-quarters of it being handled by centralized exchanges. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The top 10 countries in our 2023 Global Crypto Adoption Index spanned five continents, but Central &amp; Southern Asia dominated the list. See the rest of the top 20 and gain more insights on global crypto usage here. <a href=\"https://t.co/czQb7cXPgn\">https://t.co/czQb7cXPgn</a> <a href=\"https://t.co/z6FOFvQgzf\">pic.twitter.com/z6FOFvQgzf</a></p>&mdash; Chainalysis (@chainalysis) <a href=\"https://twitter.com/chainalysis/status/1704934586315370973?ref_src=twsrc%5Etfw\">September 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In the Middle East and North Africa, Turkey saw a large predominance in web traffic to NFT sites, and Saudi Arabia led the world in transaction growth, up 12%. Nigeria towers over other sub-Saharan countries by transaction volume. That region accounts for 2.3% of world volume. Bitcoin is most popular in that region, accounting for 9.3% of volume, compared to 4.2% in Eastern Asia. </p><p>In Latin America (where Chainalysis places Mexico and Puerto Rico), Argentina and Brazil are the top contributors to transaction volume. The report notes crypto’s role in protecting users against inflation in the region.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\">Blockchain detectives: Mt. Gox collapse saw birth of Chainalysis</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-23T20:35:48.000Z",
    "title": "Image matters: Lado Okhotnikov changes his appearance",
    "url": "https://cryptodaily.co.uk/2023/10/image-matters-lado-okhotnikov-changes-his-appearance",
    "description": "Every charismatic person always has a unique image that emphasizes the personality and says a lot about his vision of life in general and business in particular."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-23T20:30:05.000Z",
    "title": "Dormant $144M in Bitcoin From Defunct Abraxas Darknet Market Moved After Years of Inactivity",
    "url": "https://news.bitcoin.com/dormant-144m-in-bitcoin-from-defunct-abraxas-darknet-market-moved-after-years-of-inactivity/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/dnm-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Dormant $144M in Bitcoin From Defunct Abraxas Darknet Market Moved After Years of Inactivity\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/dnm-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dnm-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dnm-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dnm-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dnm-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dnm-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/dnm.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to the onchain analyst Zachxbt, 4,800 bitcoins taken from the now-defunct darknet marketplace Abraxas were transferred to a bitcoin mixing service. Abraxas exit scammed in November 2015 after less than a year, and the bitcoins had remained untouched since then. $144M in Bitcoin from 2015 Abraxas Scandal Suddenly Moved to Mixer Zachxbt reported on [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T20:35:08.000Z",
    "title": "How the Israel-Palestine war is affecting crypto",
    "url": "https://www.cryptopolitan.com/how-israel-palestine-war-is-affecting-crypto/",
    "description": "The reverberations of the Israel-Palestine conflict can be felt across various sectors, and cryptocurrency is no exception. The confluence of political tension and evolving technology has put a magnifying glass on crypto&#8217;s role in international disputes. As governments express concerns over the potential misuse of digital currencies in financing acts of terror, the crypto community ... <a title=\"How the Israel-Palestine war is affecting crypto\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-israel-palestine-war-is-affecting-crypto/\" aria-label=\"More on How the Israel-Palestine war is affecting crypto\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T20:23:43.000Z",
    "title": "XVG Price Prediction 2023-2032: Is Verge a Good Investment?",
    "url": "https://www.cryptopolitan.com/xvg-price-prediction/",
    "description": "XVG Price Predictions 2023-2032 Verge is a noteworthy entrant in the cryptocurrency arena, distinguished by an array of innovative features that leverage blockchain technology for enhanced speed and transaction efficiency. While Verge&#8217;s technological capabilities make its native token, XVG, an attractive investment tool, evaluating its long-term price projections and market behavior is essential for anyone ... <a title=\"XVG Price Prediction 2023-2032: Is Verge a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xvg-price-prediction/\" aria-label=\"More on XVG Price Prediction 2023-2032: Is Verge a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-23T20:15:41.000Z",
    "title": "Why exactly is Japan going after Google?",
    "url": "https://www.cryptopolitan.com/why-exactly-is-japan-going-after-google/",
    "description": "When the headlines scream of another tech behemoth under scrutiny, one has to pause and ask, &#8220;Why now? And more importantly, why them?&#8221; Japan, in its latest move, has turned its regulatory gaze towards Google, adding yet another layer of complexity to the giant&#8217;s global dance with antitrust watchdogs. But why? What&#8217;s the core of ... <a title=\"Why exactly is Japan going after Google?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/why-exactly-is-japan-going-after-google/\" aria-label=\"More on Why exactly is Japan going after Google?\">Read more</a>"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-23T20:30:00.000Z",
    "title": "Reddit Removes Moderators Accused of 819,580 MOON Insider Trading",
    "url": "https://coinedition.com/reddit-removes-moderators-accused-of-819580-moon-insider-trading/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-3-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-3-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Price-analysis-3-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Recent events within the r/CryptoCurrency Reddit community have prompted a swift response to address concerns related to insider trading. In a statement from the subreddit&#8217;s crypto community, they confirmed that all moderators who sold MOONs before their announcement regarding the discontinuation of their Community Points program have been removed from their positions and the group. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/reddit-removes-moderators-accused-of-819580-moon-insider-trading/\">Reddit Removes Moderators Accused of 819,580 MOON Insider Trading</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]