[
  {
    "source": "Decrypt",
    "date": "2023-12-13T18:03:58.000Z",
    "title": "How To AI: Best AI Tools for Writers",
    "url": "https://decrypt.co/209639/how-to-ai-best-ai-tools-for-writers",
    "description": "While some scribes are scared of artificial intelligence, tools like Grammarly and Hemingway are helping many with grammar, creativity, and productivity."
  },
  {
    "source": "Decrypt",
    "date": "2023-12-13T17:52:21.000Z",
    "title": "Cantor Fitzgerald CEO 'Fan' of Tether, Bullish on Bitcoin Halving",
    "url": "https://decrypt.co/209640/cantor-fitzgerald-ceo-tether-bullish-bitcoin-halving-etf",
    "description": "Howard Lutnick dismissed other cryptocurrencies as “make believe” and lauded Bitcoin’s “uncontrollable” nature."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-13T18:00:00.000Z",
    "title": " Web3 chess game developer shutters play-to-earn due to ‘heavy cheating’ ",
    "url": "https://cointelegraph.com/news/web3-nft-chess-game-developer-shutters-play-to-earn-heavy-cheating",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYzliOTQ1ZDItMjMzNS00MGQyLThkN2UtOGU0NGIyN2U2ZGRhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Both in-game Checkmate token rewards and NFT gameplay modes will be disabled.</p>\n                    <p><p>Developers of the blockchain chess game Immortal Game are pulling the plug on its <a href=\"https://cointelegraph.com/news/axie-infinity-axs-price-risks-deeper-losses-despite-90-drawdown-already\">play-to-earn (P2E)</a> and nonfungible token (NFT) features due to rampant cheating.</p><p>According to the Dec. 13 <a href=\"https://immortal.game/wiki/important-update-from-immortal-game\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>, while developers continue to build Immortal Game as an online chess hub and may incorporate further decentralized technologies in the future, its goal of “giving a real opportunity for people to earn an income through chess” through Immortal Game has ended in failure.</p><p>“We found that by offering large amounts of cash with no limit barrier to entry, we encouraged heavy cheating on the platform and degraded the user experience for our legitimate player base who want a fair and safe place to play chess online,” Immortal developers wrote. “The unintended consequence of offering money to players has increased the unfair practices.”</p><p><a href=\"https://cointelegraph.com/news/web3-nft-chess-game-developer-shutters-play-to-earn-heavy-cheating\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-13T18:00:10.000Z",
    "title": "Worldcoin pushes for mainstream adoption via integration with Shopify, Minecraft, Reddit",
    "url": "https://cryptoslate.com/worldcoin-pushes-for-mainstream-adoption-via-integration-with-shopify-minecraft-reddit/",
    "description": "<p>Worldcoin, a crypto project co-founded by Sam Altman, recently announced its integration with several prominent online platforms, including Minecraft, Reddit, Telegram, Shopify, and Mercado Libre, TechCrunch reported. This development extends the reach of its World ID technology, which had previously been integrated with platforms like Discord, Talent Protocol, and Okta’s Auth0. Launched publicly about four [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/worldcoin-pushes-for-mainstream-adoption-via-integration-with-shopify-minecraft-reddit/\">Worldcoin pushes for mainstream adoption via integration with Shopify, Minecraft, Reddit</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-13T18:00:54.000Z",
    "title": "OKX DEX hacked for $2.7 million after private key leak",
    "url": "https://cryptobriefing.com/okx-dex-hacked-2-7-million-after-private-key-leak/?utm_source=feed&utm_medium=rss",
    "description": "The total damage of this exploit stands at an estimated $2.7 million."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-13T17:47:47.000Z",
    "title": "Giddy Teams Up with Stripe for Effortless Crypto Purchases",
    "url": "https://cryptodaily.co.uk/2023/12/giddy-teams-up-with-stripe-for-effortless-crypto-purchases",
    "description": "Giddy, the self-custody smart wallet, has recently announced a strategic partnership with payment giant Stripe. This collaboration is set to simplify the process of purchasing cryptocurrencies directly within the Giddy mobile app, marking a significant advancement in user accessibility."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-13T18:01:32.000Z",
    "title": "Tether partnership boosts credibility of El Salvador’s visa program",
    "url": "https://www.cryptopolitan.com/tether-partnership-with-el-salvador/",
    "description": "El Salvador&#8217;s National Bitcoin Office (ONBTC) has reported a significant influx of interest and applications for the country&#8217;s newly launched Freedom Visa program.&#160; The initiative, which offers residency and a pathway to citizenship in exchange for a $1 million Bitcoin or Tether donation, has garnered attention since its launch on December, with ONBTC anticipating it [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-13T17:51:15.000Z",
    "title": "Bitcoin ETF prospects brighten as major issuers meet SEC",
    "url": "https://www.cryptopolitan.com/bitcoin-etf-prospects-brighten/",
    "description": "Several major Bitcoin exchange-traded fund (ETF) issuers have recently engaged in discussions with the Securities and Exchange Commission (SEC), signaling an increasing likelihood of approval for their respective products. These meetings have paved the way for potential breakthroughs in the rapidly evolving world of cryptocurrency investment. Meeting with SEC James Seyffart, an ETF analyst at [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-13T17:59:50.000Z",
    "title": "FASB introduces crypto accounting rules for fair value reporting",
    "url": "https://crypto.news/fasb-introduces-crypto-accounting-rules-for-fair-value-reporting/",
    "description": "The Financial Accounting Standards Board has released its first crypto accounting rules, revolutionizing how companies report cryptocurrency holdings."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-13T18:00:57.000Z",
    "title": "Crypto Pundit Predicts That XRP Price Will Rise “Dramatically,” Here’s When",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-rise-dramatically/",
    "description": "Crypto analyst Austin Hilton is the latest to give his opinion on the future trajectory of the XRP price going forward. Specifically, Hilton noted two events that will spur XRP’s price to go up “dramatically.” The analyst also outlined other metrics that present a bullish sentiment for the XRP ecosystem.  Major Events That Will Cause XRP Price To Rise In a video shared on his YouTube Channel, Hilton singled out the approval of Spot Bitcoin ETFs and the upcoming Bitcoin Halving as the two events that will cause XRP’s price to go up “dramatically.” He mentioned that the XRP price could rise to over $1.50 when the SEC approves these funds.  Related Reading: Crypto Analyst Predicts Cardano Price Will Rise 6000% To $33, Here’s The Timeline Bloomberg analysts James Seyffart and Eric Balchunas currently predict that there is a 90% chance that a Spot BTC ETF will get approved by January 10. Although he had his reservations about that, he seemed optimistic that the SEC would approve these funds soon as the Commission is “running out of reasons to say no.” Once that happens, he expects his price prediction of $1.50 or over to materialize. He had referred to an article where another analyst predicted that XRP would hit this price level in March. However, he believes that it could happen in January or February, depending on how things go. Hilton was quick to point out the fact that these events (BTC Spot ETF &#38; Bitcoin Halving) do not exactly relate to XRP. However, he stated that XRP, being a blue chip, will move up when the overall market moves up. Major altcoins have so far been beneficiaries of Bitcoin’s metric rise on the back of a possible Spot BTC ETF approval. As such, that could explain Hilton’s position on XRP’s rise.  XRP bulls struggle to retain control &#124; Source: XRPUSD on Tradingview.com On-Chain Metrics Suggest Bullish Sentiments For XRP The analyst also noted that on-chain metrics suggest a bullish outlook for the XRP ecosystem. These metrics include the number of daily transactions and wallet addresses on the XRP Ledger. According to him, this suggests that there is a “fair amount” of liquidity flowing into the ecosystem.  Related Reading: Shiba Inu Rally To $0.0001? Shibarium Transaction Count Breaches 90 Million Milestone The XRP Ledger indeed continues to record significant milestones in terms of transactions processed on the network. Data from BitInfoCharts also shows that XRP has been going head-to-head with Bitcoin and Ethereum in terms of daily transactions. Despite the XRP price’s relatively tepid movement, Hilton sounded bullish on the crypto token as he mentioned that current price levels are a “steal” considering the heights that XRP will attain.  At the time of writing, the XRP price is trading at around $0.60, down over 2% in the last 24 hours, according to data from CoinMarketCap.  Featured image from TechnoPixel, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-13T17:40:50.000Z",
    "title": "Anodos Finance Embraces XRP for Salaries and Launches XRPL Validator – A Decentralized Revolution",
    "url": "https://www.crypto-news-flash.com/anodos-finance-embraces-xrp-for-salaries-and-launches-xrpl-validator-a-decentralized-revolution/?utm_source=rss&utm_medium=rss&utm_campaign=anodos-finance-embraces-xrp-for-salaries-and-launches-xrpl-validator-a-decentralized-revolution",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP Lawyer John Deaton\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Anodos Finance drives XRP adoption for payments and payroll, highlighting efficiency and security of XRPL in financial transactions. With the launch of its first XRPL validator, Anodos Finance contributes to the decentralization and robustness of the XRP Ledger network. have you ever wondered what it would be like to receive your salary in cryptocurrencies? Well [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-13T17:55:37.000Z",
    "title": "Elizabeth Warren Expands Support for Digital Asset Anti-Money Laundering Crypto ‘Crackdown’ Bill",
    "url": "https://dailyhodl.com/2023/12/13/elizabeth-warren-expands-support-for-digital-asset-anti-money-laundering-crypto-crackdown-bill/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/anti-money-laundering-warren.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/anti-money-laundering-warren.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/12/anti-money-laundering-warren.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/12/anti-money-laundering-warren.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/12/anti-money-laundering-warren.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/anti-money-laundering-warren.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/12/anti-money-laundering-warren.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>US Senator Elizabeth Warren has expanded support for her bill that aims to crack down on the use of digital assets in money laundering. Warren (D-Massachusetts), a longtime crypto critic, first introduced the Digital Asset Anti-Money Laundering Act at the end of 2022 and then reintroduced the 2023 version of the bill this past July. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/13/elizabeth-warren-expands-support-for-digital-asset-anti-money-laundering-crypto-crackdown-bill/\">Elizabeth Warren Expands Support for Digital Asset Anti-Money Laundering Crypto ‘Crackdown’ Bill</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]