[
  {
    "source": "CryptoSlate",
    "date": "2023-08-10T23:00:38.000Z",
    "title": "SEC settles with Bittrex and its ex-CEO for $24M following ‘scrubbing’ charges",
    "url": "https://cryptoslate.com/sec-settles-with-bittrex-and-its-ex-ceo-for-24m-following-scrubbing-charges/",
    "description": "<p>The U.S. Securities and Exchange Commission (SEC) said on Aug. 10 that it has reached a $24 million settlement with Bittrex and its former CEO, William Shihara. The SEC made numerous allegations against Bittrex in its original claim. Notably, it alleged that coin issuers seeking exchange listings from Bittrex were instructed to remove &#8220;problematic statements&#8221; [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sec-settles-with-bittrex-and-its-ex-ceo-for-24m-following-scrubbing-charges/\">SEC settles with Bittrex and its ex-CEO for $24M following &#8216;scrubbing&#8217; charges</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T22:47:39.000Z",
    "title": "Aave token-holders vote on proposals to reshape exposure to CRV",
    "url": "https://www.cryptopolitan.com/aave-token-holders-vote-on-proposals/",
    "description": "The Aave community is currently taking active measures to mitigate its protocol&#8217;s exposure to the Curve DAO token (CRV), with two distinct proposals up for voting as of August 10th. This strategic move aims to curtail the potential risks posed to the lending protocol by the significant borrowing position held by Michael Egorov, the founder ... <a title=\"Aave token-holders vote on proposals to reshape exposure to CRV\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-token-holders-vote-on-proposals/\" aria-label=\"More on Aave token-holders vote on proposals to reshape exposure to CRV\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-10T23:00:31.000Z",
    "title": "Terra Classic (LUNC) Chances Of Revival Grow Slimmer, Here’s Why",
    "url": "https://www.newsbtc.com/analysis/lunc/terra-classic-lunc-chances-of-revival/",
    "description": "Terra Classic (LUNC) has suffered persistent declines since the network’s collapse back in 2022. These declines have ranged from its price through to the network’s Total Value Locked (TVL). And even while development abounds among its community members to try to restore it to its past glory, the numbers point to a low possibility of recovery. Terra Classic TVL Falls To All-Time Low After Terra’s crash in 2022, the network lost a significant chunk of its TVL due to investors pulling out their funds as well as developers moving their decentralized applications and protocols to other networks. Over time, there seemed to be a stable trend but once again, the network has lost out against its better counterparts. Related Reading: Cardano (ADA) Next In Line For A Rally Following Shark And Whale Buying Spree Data from the on-chain tracker DeFiLlama shows that as of Thursday, the total Terra Classic (LUNC) TVL is sitting at $2.11 million. This is notable because this is the lowest that the network’s TVL has ever been. It is also a long way from the over $20 billion all-time high TVL of the Terra blockchain before its tragic collapse. LUNC TVL falls to new all-time low &#124; Source: DeFiLlama The vast majority of its meager TVL is spread across just two DeFi protocols: Terraswap and Astroport Classic, with $1.07 million and $933,527 in TVL, respectively. The highest that Terra’s TVL has been in 2023 is $12 million back in April 2023. Terra’s TVL has now declined by over 83% from its 2023 peaks. In the same vein, DeFiLlama shows $0 decentralized exchange (DEX) volumes over the last week, meaning that trading activity on the network has grounded to a halt. The Road To Recovery For LUNC Over the last year, the Terra community has been consistent about trying to help the network recover. However, the kind of decline that the cryptocurrency suffered as a result of the crash is not easy and near impossible to recover from. Related Reading: Crypto Analyst Says Bitcoin Could Reach $180,000 Next Cycle If This Happens Throwing in the fact that the network’s activities are almost non-existent, the chances of recovery have become even slimmer. But perhaps the biggest hindrance to its recovery is the fact that LUNC’s supply ballooned to over 6 trillion coins. Given this, even a surge to the $1 mark is out of reach for the token, unless there is a significant reduction in its supply. LUNC’s price continues to struggle at this time, trading at $0.00007746 at the time of writing. Its market cap is currently sitting at $450 million, making it the 80th-largest cryptocurrency by market cap. LUNC price trading over 99% below all-time high &#124; Source: LUNCUSDT on Tradingview.com Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from Finbold, chart from TradingView.com"
  }
]