[
  {
    "source": "CoinDesk",
    "date": "2023-08-10T16:49:57.000Z",
    "title": "VC Firm a16z Wades Into Crypto Tech Research with ZK Projects ‘Jolt’ and ‘Lasso’",
    "url": "https://www.coindesk.com/tech/2023/08/10/vc-firm-a16z-wades-into-crypto-tech-research-with-zk-projects-jolt-and-lasso/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A pair of open-source projects from venture giant Andreessen Horowitz, known as a16z, aim to improve the performance of systems that use zero-knowledge technology – a cryptographic method used to scale blockchains."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-10T16:57:02.000Z",
    "title": "Dear crypto writers: No one wants to read your ChatGPT-generated trash",
    "url": "https://cointelegraph.com/news/crypto-writers-chatgpt-trash",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/8496f8fe-2de8-4f66-8366-af6431fe9ed4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Opinion: If you used ChatGPT to write an article, do us all a favor and delete it. None of us want to read it.</p>\n                    <p><p>There was a time when anything generated by ChatGPT was fascinating. </p><p>To fathom that a super-intelligent robot was writing poetry, drafting legal documents or even <a href=\"https://cointelegraph.com/news/7-game-changing-uses-of-chatgpt\">acting as a personal life coach</a> was mind-boggling. </p><p>As if each prompt was a window into a kind of shared human consciousness.</p><p>That was the novelty then, at least. But it’s been nine months since GPT-3 and almost five months since the launch of GPT-4.</p><h2>ChatGPT has become the go-to strategy for churning out useless content</h2><p>In May, a crypto firm shared a 10-minute video presentation it had whipped up about artificial intelligence’s role in increasing business productivity (in the hopes of coverage). </p><p>Ironically, the presenter was an AI-generated avatar reading from a script most likely lifted straight out of ChatGPT. It took all of 20 seconds to close it.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/worldcoin-sam-altman-scan-your-eyeballs-wld\"><strong><em>Worldcoin: Should you let Sam Altman scan your eyeballs for WLD?</em></strong></a></p><p>Oh, was it written by a bot? No worries, send it to my AI transcriber.</p><p>Another great example came in recently from a colleague who received a pitch from a third party — offering an article on how to use MetaMask more efficiently.</p><p>The 1,159-word explainer discussed six cold wallets that could be connected to MetaMask, a potentially relevant subject given the recent spate of hot wallet hacks, such as the <a href=\"https://cointelegraph.com/news/crypto-exchange-bitrue-suffers-23m-hack-due-to-hot-wallet-eploit\">$23 million hack of the Bitrue</a> crypto exchange on April 14.</p><p>At first glance, the article was decently written. It had an introduction, a sub-introduction and six subheadings for each individual cold wallet, followed by a conclusion. There wasn’t a single grammatical error.</p><h2>Unfortunately, it reads like the nutritional label of a cereal box</h2><p>Packed with facts but void of any personality, flair or human element. No impactful conclusions.</p><p>“Each of these wallets has its unique features and advantages, so it’s important to do your research and choose the one that best suits your needs,” was its fireworks ending.</p><p>Surprise, surprise. The article came back on an AI detection tool as 74.2% AI/GPT generated. Even the cover letter that pitched the idea wasn’t authentic — scoring a whopping 93.57% on ZeroGPT. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/136009fd-3119-40c5-a198-aba593ba7a1c.jpg\"  /><figcaption style=\"text-align: center;\">Screenshot of ZeroGPT’s analysis of the pitch received via email. Source: ZeroGPT</figcaption></figure><p>Crypto news aggregators are also starting to show more of these types of articles — with headlines along the lines of: “We asked ChatGPT… and this is what it said.” </p><h2>Get ready for a hell of a lot more</h2><p>Unfortunately, it’s only the latest indication of more AI-generated news content to come. </p><p>In May, misinformation watchdog NewsGuard <a href=\"https://web.archive.org/web/20230721225141/https://www.newsguardtech.com/special-reports/newsbots-ai-generated-news-websites-proliferating/\" target=\"_blank\" rel=\"noopener nofollow\">identified</a> 49 websites spanning seven languages that appear to be entirely or mostly generated by artificial intelligence language models — mainly in the form of independent news outlets.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/artificial-intelligence-tools-harvesting-your-data\"><strong><em>Think AI tools aren’t harvesting your data? Guess again</em></strong></a></p><p>By Aug. 9, that number had rocketed to 408, with these fake news websites spanning 14 languages. There’s no telling how much that will reach by year’s end. </p><p>So, here’s my non-AI-generated conclusion. </p><p>Generative AI technology like ChatGPT is a game-changing piece of technology that can be wielded by nearly anyone with an internet connection. </p><p>But if you’re a crypto writer, do me a favor: Submit your typo-laden rants, share your clickbait articles, and forward your poorly disguised advertorials.</p><p>Just make sure it’s your real work — not this ChatGPT-generated trash.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Felix Ng</strong> began writing about the blockchain industry through the lens of a gambling industry journalist and editor in 2015. He is most interested in innovative blockchain technology aimed at solving real-world challenges.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-10T16:45:00.000Z",
    "title": "Chinese police to crackdown on crypto and deepfake AI",
    "url": "https://cointelegraph.com/news/chinese-police-to-crackdown-crypto-deepfake-ai",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/ae706c69-763d-45c4-8a5d-6d7549e5338c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The move comes as several prominent Chinese blockchain executives have been arrested this year. </p>\n                    <p><p>After a surge in personal identity thefts and digital financial crimes, Chinese police are taking closer scrutiny at the Web3 sector.</p><p>During a press conference <a href=\"http://society.people.com.cn/GB/441686/448907/457888/index.html\" target=\"_blank\" rel=\"noopener nofollow\">hosted</a> by China's Ministry of Public Security, Jinfeng Sun on August 10, political commissar of the Network Security Bureau, said there has been a spree of incidents involving the use of Trojan viruses, phishing sites, infiltration tools, and cyberstalkers in fraud and data theft. Specifically, Sun said:</p><blockquote>\"[We have been] Monitoring [the use of] Chat GPT, cloud computing, blockchain, deepfake AI, and other new emerging technologies, new applications, new organizations [in these incident]. We [the Ministry] will strike hard at such methods as we research their use.\"</blockquote><p>Sun disclosed there had been 79 cases of fraud involving deepfake AI, such as impersonation via digital face-swap, leading to the arrest of 515 individuals. On July 18, Shangxi Police <a href=\"http://society.people.com.cn/GB/441686/448907/457888/index.html\" target=\"_blank\" rel=\"noopener nofollow\">arrested</a> 21 individuals concerning an alleged 54.8 million Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) money laundering scheme. The suspects allegedly bought USDT from Chinese residents for below-market value to sell them for fiat on oversea exchanges, banking in the difference while transferring their clients' money abroad. China imposes <a href=\"https://sjgrand.cn/money-in-out-of-china/\" target=\"_blank\" rel=\"noopener nofollow\">strict</a> exit controls on capital, with Chinese nationals prohibited from purchasing more than $50,000 worth of foreign currencies each year. </p><p>Despite strict controls, however, some have alleged the Chinese police of embezzling funds from crypto projects through enforcement measures. Last month, cross-chain protocol Multichain <a href=\"https://cointelegraph.com/news/spiritswap-fantom-project-winds-down-citing-multichain-exposure\">became defunct</a> after its CEO, Zhaojun He, was arrested by police. No information has been revealed regarding his detention, while funds belonging to Multichain developers and users alike have been converted to stablecoins and privacy coins and transferred out of the exchange. </p><p><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/yuan-stablecoin-team-arrested-wechats-new-bitcoin-prices-hk-crypto-rules-asia-express/\">Yuan stablecoin team arrested, WeChat’s new Bitcoin prices, HK crypto rules</a></strong></p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-10T17:00:00.000Z",
    "title": "Brazil Unveils the Name and Logo of Its Upcoming CBDC",
    "url": "https://cryptodaily.co.uk/2023/08/brazil-unveils-the-name-and-logo-of-its-upcoming-cbdc",
    "description": "<p>The Central Bank of Brazil reveals the official brand name of the upcoming government-backed &ldquo;digital real&rdquo; &ndash; DREX.</p>\nWhat Does DREX Stand For?\n<p>On Monday, August 7, the Central Bank of Brazil broadcasted a live conversation on the topic &ldquo;What will change for me with the Digital Real?&rdquo; on the institution&rsquo;s official YouTube account. F&aacute;bio Ara&uacute;jo, coordinator of the digital real, Aristides Cavalcante, deputy head of the Central Bank's technology and information department, and Gustavo Igreja, communications specialist at the Central Bank of Brazil, discussed the main features of the anticipated CBDC (central bank digital currency).</p>\n<p>As it was revealed during the broadcast, the official name of the digital real will be the acronym &ldquo;DREX&rdquo;.</p>\n\n<p>&ldquo;DREX combines several elements of innovation: the D for digital, R for real, E for electronic, and X for transaction, taking a step further in this family of Pix that we created and was a success,&rdquo; Ara&uacute;jo explained.</p>\n\n<p>* Pix is the instant payment system developed by the Central Bank of Brazil and widely used across the country. Pix is a way to transfer money from one account to another instantly and free of charge by using a QR code or an ID such as phone number, email, or CPF (the taxpayer registry number) via any bank&rsquo;s application.</p>\nThe Meaning Behind DREX&rsquo; Logo\n<p>The official logo of DREX also represents the evolution of Brazil&rsquo;s currency in the digital environment:</p>\n\n<p>&ldquo;Alluding to a transaction, the two arrows that lean into the 'D' relate to the evolution of the real to the digital environment, reinforcing the attribute of agility, and the use of colors, in a transition from blue to light green, conveys the message of 'transaction completed,'&rdquo; the Central Bank of Brazil stated.</p>\n\nHow Will the Digital Real Work?\n<p>The authorized entities will mint the digital real with the help of a similar-to-blockchain distributed ledger technology. DREX will support the trading of public treasury bonds, transactions backed by Web3 infrastructure for token burning, creation, and registration. Thus, the tokenized real will be the representation of the digital real and will be managed exclusively by authorized financial institutions.</p>\n<p>The Central Bank of Brazil claimed that DREX will make the life of Brazilians easier.</p>\n\n<p>&ldquo;The solution, previously referred to as the Digital Real, will provide citizens and entrepreneurs with a safe and regulated environment for the creation of new businesses and a more democratic access to the benefits of the economic digitization&rdquo;, highlighted the agency.</p>\n\n<p>Apparently, the Brazilian CBDC project has been in works since at least the beginning of this year. The Central Bank of Brazil plans to start the digital real pilot testing in September 2023. However, DREX is expected to be widely available to the population no earlier than the end of 2024.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T17:01:27.000Z",
    "title": "Investors caught in the middle of Biden’s tech restrictions",
    "url": "https://www.cryptopolitan.com/investors-in-the-middle-of-biden-tech-curbs/",
    "description": "The financial arena has been sent into a whirlwind as President Joe Biden clamps down on U.S. technological investments into China. Investors, once enthusiastic about the tech-rich, booming Chinese market, now find themselves skidding on a slippery slope, deliberating their next moves amidst burgeoning geopolitical tensions. A chilled investment atmosphere When the Biden administration unveiled ... <a title=\"Investors caught in the middle of Biden&#8217;s tech restrictions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/investors-in-the-middle-of-biden-tech-curbs/\" aria-label=\"More on Investors caught in the middle of Biden&#8217;s tech restrictions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T17:00:37.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T16:59:55.000Z",
    "title": "How to Play the Shiba Eternity Game",
    "url": "https://www.cryptopolitan.com/how-to-play-the-shiba-eternity-game/",
    "description": "In an era marked by the convergence of technology and entertainment, the realm of mobile games has sparked a revolution, captivating players globally. Shiba Inu, renowned in the cryptocurrency landscape, introduces Shiba Eternity, a groundbreaking card battle game that defies convention. Unlike play-to-earn blockchain games, Shiba Eternity stands as a free-to-play marvel, a gateway to ... <a title=\"How to Play the Shiba Eternity Game\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-to-play-the-shiba-eternity-game/\" aria-label=\"More on How to Play the Shiba Eternity Game\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T16:41:07.000Z",
    "title": "Binance Labs invests $5M in CRV, supports Curve BNB Chain deployment",
    "url": "https://www.cryptopolitan.com/binance-labs-invests-5m-in-crv/",
    "description": "Binance Labs, the venture capital division of the world&#8217;s largest cryptocurrency exchange regarding trading volume, has recently pledged a substantial investment of $5 million into the Curve DAO Token (CRV). As part of this joint effort, Curve is actively considering extending its presence onto Binance&#8217;s BNB Chain, as conveyed in Binance&#8217;s official blog post. Binance ... <a title=\"Binance Labs invests $5M in CRV, supports Curve BNB Chain deployment\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-labs-invests-5m-in-crv/\" aria-label=\"More on Binance Labs invests $5M in CRV, supports Curve BNB Chain deployment\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-10T17:00:33.000Z",
    "title": "The Spoils Of Victory: XRP Daily Transactions Surpass Ethereum",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-daily-transactions-surpass-ethereum/",
    "description": "On the back of Ripple’s partial win over the United States Securities and Exchange Commission (SEC), activity on the blockchain has ramped up quickly. This increase has now seen XRP beat out market leader Ethereum when it comes to the number of daily transactions carried out on the blockchain.  Ripple Leading The Pack While the euphoria from Judge Analisa Torres’s ruling has been waning, there is still enough left to continue to drive new milestones on Ripple’s XRP Ledger. The most prominent of these has been the number of transactions that are being carried out on the Ledger since the ruling. Related Reading: Pro-XRP Lawyer John Deaton Says He Is Willing To Bet That Ripple Will Win SEC Appeal Despite ending the month of July on a low note, the transactions have picked up in August. According to data from BitInfoCharts, daily transactions on the Ripple Ledger have consistently crossed 1 million since the start of August. This puts XRPL ahead of leading blockchains such as Ethereum (ETH) and Bitcoin (BTC), both of which have seen daily transaction figures come out below 1 million this month. On August 2, which has been the best day of the month so far for Ripple, transaction figures crossed 1.3 million, compared to 1.04 million for Ethereum and 390,000 for Bitcoin. XRP daily transactions rise above Ethereum &#124; Source: BitInfoCharts The new milestone comes after XRP first experienced a sharp drop in July. But since then, the blockchain has been on an upward trajectory. According to the present data, the XRP Network carried out 1.1173 million transactions on Thursday, August 9, almost double the number of its July 29 low of 612,000. However, despite the rise in transaction numbers, XRP continues to lag behind Bitcoin and Ethereum in terms of volume. Coinmarketcap data shows Bitcoin’s volume over the last day was $14 billion, Ethereum was in second with $4.2 billion, while XRP volume came in at $1.7 billion. Token price falls from local peak following court ruling &#124; Source: XRPUDST on Tradingview.com SEC’s Appeal Brings Down The XRP Momentum  XRP had undoubtedly enjoyed a huge boost following Judge Analisa Torres’ partial summary judgment in favor of Ripple in its ongoing case against the US Securities and Exchange Commission (SEC). Related Reading: Billionaire Investor Wishes He Bought Bitcoin Early On, Here’s Why XRP experienced a massive spike from $0.47 to $0.81 (+72%) on the 13th of July (the day the partial summary judgment was given). However, it has since then retracted to the present zone. The token has maintained its current price range since the start of August with no significant movement upwards since then.  Furthermore, the SEC’s intention to file an interlocutory appeal may also draw down XRP’s momentum. In fact, XRP has reacted negatively to the aforementioned news as it is trading at around $0.6293, down 2.24% in the last 24 hours. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-10T17:00:19.000Z",
    "title": "Sandbox Price Prediction for August. Should You Buy SAND Now?",
    "url": "https://www.crypto-news-flash.com/sandbox-price-prediction-for-august-should-you-buy-sand-now/?utm_source=rss&utm_medium=rss&utm_campaign=sandbox-price-prediction-for-august-should-you-buy-sand-now",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-5.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-5.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-5-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-5-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />After the explosive rise of NFTs in 2021, numerous tokens emerged to enhance the real-world applications of NFTs. Ethereum (ETH) emerged as the leading platform for NFT trading, and many tokens were launched on its blockchain to capitalize on its popularity. One such token is The Sandbox (SAND), which leveraged its association with Ethereum (ETH) [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-10T16:55:16.000Z",
    "title": "Fed Reveals New Rules for How US Banks Can Interact With Stablecoins and Crypto Assets",
    "url": "https://dailyhodl.com/2023/08/10/fed-reveals-new-rules-for-how-us-banks-can-interact-with-stablecoins-and-crypto-assets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/fed-new-rules-how.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/fed-new-rules-how.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/fed-new-rules-how.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/fed-new-rules-how.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/fed-new-rules-how.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/fed-new-rules-how.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/fed-new-rules-how.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. Federal Reserve says its state member banks need to ask for permission before interacting with stablecoins. The Fed published a regulation letter on Wednesday outlining its new rules on &#8220;tokens denominated in national currencies and issued using distributed ledger technology,&#8221; otherwise known as stablecoins. &#8220;A state member bank seeking to engage in activities [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/10/fed-reveals-new-rules-for-how-us-banks-can-interact-with-stablecoins-and-crypto-assets/\">Fed Reveals New Rules for How US Banks Can Interact With Stablecoins and Crypto Assets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]