[
  {
    "source": "CoinDesk",
    "date": "2023-06-01T14:50:56.000Z",
    "title": "Qatar Didn’t Properly Enforce Its Crypto Ban, Global Money Laundering Watchdog Says",
    "url": "https://www.coindesk.com/policy/2023/06/01/qatar-didnt-properly-enforce-its-crypto-ban-global-money-laundering-watchdog-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The central bank should proactively identify and sanction service providers breaching its 2019 prohibition, according to the Financial Action Task Force"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-01T15:00:14.000Z",
    "title": "Bitcoin outperforms commodities as market gears up for high volatility",
    "url": "https://cryptoslate.com/bitcoin-outperforms-commodities-as-market-gears-up-for-high-volatility/",
    "description": "<p>Bitcoin and commodities have shown surprising resilience since 2023. Recent data reveals Bitcoin outperforming silver and gold, but there's an unusual twist in its monthly realized volatility and exchange activity momentum. Both factors suggest a dormant market, yet historical trends tell a different story. With low-volatility periods representing only a small fraction of Bitcoin's market history, a significant shift could be on the horizon...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-outperforms-commodities-as-market-gears-up-for-high-volatility/\">Bitcoin outperforms commodities as market gears up for high volatility</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-01T14:47:34.000Z",
    "title": "Daily CEX crypto trade volume sinks to lows last seen in 2020",
    "url": "https://cryptoslate.com/daily-cex-crypto-trade-volume-sinks-to-lows-last-seen-in-2020/",
    "description": "<p>Daily trade volume from centralized exchanges (CEX) has sunk to lows last seen in late 2020, per data from Kaiko. Crypto sentiment The chart below shows a pattern of declining CEX trade volume tops from May 2021 onwards. This year saw a double top at $100 billion around April. Since then, CEX trading volume has [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/daily-cex-crypto-trade-volume-sinks-to-lows-last-seen-in-2020/\">Daily CEX crypto trade volume sinks to lows last seen in 2020</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-01T14:46:14.000Z",
    "title": "Privacy coin projects denounce Binance delisting",
    "url": "https://cryptoslate.com/privacy-coins-denounce-binance-delisting/",
    "description": "<p>Three privacy coin projects — Secret (SCRT), Zcash (ZEC), and Dash (DASH) — have denounced Binance&#8217;s intention to delist their tokens from its platform, according to June 1 statements shared with CryptoSlate. On May 31, a Binance spokesperson told CryptoSlate that it would delist certain privacy coins, including Secret, Zcash, and DASH, for users in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/privacy-coins-denounce-binance-delisting/\">Privacy coin projects denounce Binance delisting</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-01T14:45:05.000Z",
    "title": "Uniswap price analysis: Bulls steer the price beyond the significant $5 mark",
    "url": "https://www.cryptopolitan.com/uniswap-price-analysis-2023-06-01/",
    "description": "Today&#8217;s Uniswap price analysis reveals an encouraging upward trend in the cryptocurrency market, highlighting a strong comeback from buyers. The current focus lies on surpassing the next resistance level at $5.06. As we anticipate the week ahead, buying activity is expected to intensify further. The bulls, however, need continued support from buyers to successfully counter ... <a title=\"Uniswap price analysis: Bulls steer the price beyond the significant $5 mark\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-analysis-2023-06-01/\" aria-label=\"More on Uniswap price analysis: Bulls steer the price beyond the significant $5 mark\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-01T15:00:52.000Z",
    "title": "HEX and PulseChain are old news. Avorak is the Fresh Release Everyone is Eyeing",
    "url": "https://nulltx.com/hex-and-pulsechain-are-old-news-avorak-is-the-fresh-release-everyone-is-eyeing/",
    "description": "HEX is an Ethereum-based token that focuses on incentives for token holders, and PulseChain is a hard fork of Ethereum that seeks to improve the network. Avorak AI is a fresh release that everyone is currently eyeing. The Avorak ecosystem provides creative ways to speed up procedures and reduce waiting times. It offers a variety [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-01T15:08:58.000Z",
    "title": "Google Bard’s assessment of AiDoge, Collateral Network, and Tradecurve",
    "url": "https://crypto.news/google-bards-assessment-of-aidoge-collateral-network-and-tradecurve/",
    "description": "We asked Google Bard about the future of AiDoge, Collateral Network, and Tradecurve, and we got interesting answers"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-01T14:50:20.000Z",
    "title": "Shiba Inu Burn Frenzy: More Than 15 Billion Tokens Scorched In May",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-burn-frenzy-more-than-15-billion-tokens-scorched-in-may/",
    "description": "The Shiba Inu community burnt over 15 billion SHIB tokens in May 2023, showing their commitment to reducing the circulating supply. The intention of such burns is to reduce the total supply of the coin from market Blaze Token is the top SHIB burner of the month, with MARSWAP (MSWAP) and Coinbase 10 among the top burners. According to Shibburn, 15.36 billion SHIB, were burnt in 191 transactions in May 2023.  Top SHIB Burners Blaze Token emerged as the top SHIB burner for May 2023, with its largest burn executed on May 29, seeing over 3.60 billion SHIB tokens sent to the dead wallet. Also, Blaze token burnt 2 billion SHIB on May 2, 1.69 billion SHIB on May 8, and 1.23 billion SHIB on May 22. Related Reading: Did The US SEC Just Endorse Ethereum After This Settlement? A new crypto project, MARSWAP, ranks second on the top SHIB burners list. The crypto project launched on ShibSwap DEX burnt 1.35 billion SHIB in 100 transactions on May 24.  Additionally, a Coinbase-affiliated wallet tagged Coinbase 10 contributed 200.58 million SHIB burns to the total burns on the network. However, the increased burn rate did not affect Shiba Inu&#8217;s price as it still displays volatility.  SHIB Price Prediction SHIB is trading in a downtrend today, forming a fourth consecutive red candle on the daily chart as it forms lower lows. It is trading below its 50-day and 200-day Simple Moving Averages (SMA), a short and long-term bearish sentiment. Related Reading: Ethereum’s Block Size Surges To 1-Month High – What This Means For ETH Also, its Relative Strength Index (RSI) is 35.64, close to the oversold region of 30. This also confirms the bearish sentiment as the indicator moves downwards.  SHIB&#8217;s Moving Average Convergence/Divergence (MACD) is above its signal line but shows a negative value, and the histogram bars are fading, hinting at a bearish trend. These indicators imply that SHIB will likely continue in the bearish phase till the bulls rally again. SHIB is approaching the 38.2% Fibonacci level ($0.00000839), its closest support level. Hopefully, if SHIB doesn’t fall below that support level, it can rally to the 23.6% Fib level ($0.00000869), its nearest resistance level. A move above the $0.00000869 resistance level will mean a price recovery for SHIB.  Shiba Inu Reclaims Security Rating, A Plus For Its Network Shiba Inu reclaimed the top security rating on blockchain security audit company CertiK&#8217;s list. Previously, the company reduced Shiba Inu&#8217;s rating from AAA to AA, a second-class rating. Shiba Inu reclaimed the top security (AAA rating of 94 out of 100), which was its former security level. Also, CertiK hosted an Ask-Me-Anything (AMA) session on Twitter spaces to respond to questions from the community. The focus of the discussion bordered on the upcoming Shibarium mainnet, security ratings, and network tokenomics. Featured image from Pixabay and chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T14:49:32.000Z",
    "title": "BRICS Takes a Leap into the Future: Bitcoin Integration on the Agenda at Upcoming Summit",
    "url": "https://www.crypto-news-flash.com/brics-takes-a-leap-into-the-future-bitcoin-integration-on-the-agenda-at-upcoming-summit/?utm_source=rss&utm_medium=rss&utm_campaign=brics-takes-a-leap-into-the-future-bitcoin-integration-on-the-agenda-at-upcoming-summit",
    "description": "<p>The BRICS Coalition has reportedly gotten a large number of requests from new countries looking to join the coalition.  Brazil’s President reveals that he is willing and open to accepting new members.  According to local news outlets, Brazil’s current President Luiz Inácio Lula da Silva has shown support for the admission of Venezuela to the [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/brics-takes-a-leap-into-the-future-bitcoin-integration-on-the-agenda-at-upcoming-summit/\">BRICS Takes a Leap into the Future: Bitcoin Integration on the Agenda at Upcoming Summit</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-01T14:48:39.000Z",
    "title": "Ripple (XRP) and Coinbase Continue to Battle with SEC, Buyers Move to HedgeUp",
    "url": "https://www.crypto-news-flash.com/ripple-xrp-and-coinbase-continue-to-battle-with-sec-buyers-move-to-hedgeup/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-xrp-and-coinbase-continue-to-battle-with-sec-buyers-move-to-hedgeup",
    "description": "<p>The battle between the U.S. Securities and Exchange Commission (SEC) and cryptocurrency companies has been escalating, with both sides making bold threats in an attempt to gain leverage.  Companies such as Coinbase and Ripple (XRP) have recently made statements critical of the SEC&#8217;s stance on crypto regulations, while Chair Gary Gensler insists that digital assets [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/ripple-xrp-and-coinbase-continue-to-battle-with-sec-buyers-move-to-hedgeup/\">Ripple (XRP) and Coinbase Continue to Battle with SEC, Buyers Move to HedgeUp</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-01T14:48:00.000Z",
    "title": "Bitcoin is Trading Near Three Significant Price Levels: Glassnode",
    "url": "https://coinedition.com/bitcoin-is-trading-near-three-significant-price-levels-glassnode/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/WHY-Bitcoin-And-Global-Markets-Are-About-to-SURGE-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin is Trading Near Three Significant Price Levels: Glassnode\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/WHY-Bitcoin-And-Global-Markets-Are-About-to-SURGE-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/WHY-Bitcoin-And-Global-Markets-Are-About-to-SURGE-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/WHY-Bitcoin-And-Global-Markets-Are-About-to-SURGE-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/WHY-Bitcoin-And-Global-Markets-Are-About-to-SURGE-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/WHY-Bitcoin-And-Global-Markets-Are-About-to-SURGE-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/WHY-Bitcoin-And-Global-Markets-Are-About-to-SURGE.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Data from the on-chain metrics platform, Glassnode, shows Bitcoin’s price is in a critical region. In a tweet, Glassnode noted Bitcoin’s price behavior around this region as a crucial factor. It could determine the next major trend for the pioneer cryptocurrency. Glassnode’s analysis showed Bitcoin to be close to three significant price levels between $25,300 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-is-trading-near-three-significant-price-levels-glassnode/\">Bitcoin is Trading Near Three Significant Price Levels: Glassnode</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]