[
  {
    "source": "Cointelegraph",
    "date": "2023-07-20T05:29:54.000Z",
    "title": "China’s digital yuan nears $250B transaction volume: Central bank governor",
    "url": "https://cointelegraph.com/news/china-cbdc-transaction-volume-nears-two-trillion-yuan",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/f074b2d1-fbd9-48b9-98c4-a6d6c2b0a62b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>While the adoption and use cases of China’s e-CNY are expanding, the digital yuan still only represents 0.16% of China’s monetary supply.</p>\n                    <p><p>Nearly $250 billion worth of transactions have taken place using China’s digital yuan in the one-and-a-half years since the start of its pilot, the country’s central bank governor has claimed.</p><p>On July 19, People’s Bank of China governor Yi Gang <a href=\"https://www.youtube.com/watch?v=TooiuEG_wCk\" target=\"_blank\" rel=\"noopener nofollow\">spoke</a> at a conference in Singapore and said its central bank digital currency transacted 1.8 trillion yuan as of the end of June.</p><p>Yi added there have been around 950 million transactions from roughly 120 million wallets since the e-CNY’s initial <a href=\"https://cointelegraph.com/news/china-s-central-bank-releases-pilot-version-of-digital-yuan-wallet\">January 2022 rollout</a> lending to an average transaction amount of about $260.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">MAS is honoured to have Dr Yi Gang, President of China Society for Finance and Banking as the speaker for the MAS Lecture 2023. Dr Yi spoke on “CBDC from China’s perspective”.<br><br>Find out more here: <a href=\"https://t.co/UbikjgQhRn\">https://t.co/UbikjgQhRn</a> <a href=\"https://t.co/UuQwOQe8n0\">pic.twitter.com/UuQwOQe8n0</a></p>&mdash; MAS (@MAS_sg) <a href=\"https://twitter.com/MAS_sg/status/1681597507716132864?ref_src=twsrc%5Etfw\">July 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>He claimed around $2.3 billion, or 16.5 billion e-CNY, was in circulation at the end of June, which only represents 0.16% of China’s monetary supply, according to a July 19 Reuters <a href=\"https://www.reuters.com/markets/asia/chinas-digital-yuan-transactions-seeing-strong-momentum-says-cbank-gov-yi-2023-07-19/\" target=\"_blank\" rel=\"noopener nofollow\">report</a>.</p><p>The digital yuan’s adoption is still minimal relative to China’s 1.4 billion strong population, so far, the e-CNY had mostly been used for <a href=\"https://cointelegraph.com/news/crypto-friendly-dbs-bank-launches-digital-yuan-payment-tool\">domestic retail payments</a> aside from a few trials in Hong Kong.</p><p>On July 18, the South China Morning Post (SCMP) <a href=\"https://www.scmp.com/tech/tech-trends/article/3228094/chinas-digital-currency-bank-china-helps-mainland-tourists-spend-e-cny-hong-kong-select-retailers?module=perpetual_scroll_0&amp;pgtype=article&amp;campaign=3228094\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> the Bank of China Hong Kong began trialing another cross-border payment scheme for Bank of China customers at select retail stores in Hong Kong. </p><p>The trial was rolled out in a bid to further promote the cross-border applications of e-CNY and is the third cross-border trial of the digital yuan in Hong Kong, according to the SCMP.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-web3-animoca-hong-kong-would-not-go-crypto-without-approval-of-china-says-animoca-exec\"><strong><em>Hong Kong would not go crypto without China’s approval — Animoca exec </em></strong></a></p><p>In a trial last year the BOCHK launched a program that encouraged customers to set up a BOC e-CNY wallet to receive $14 (100 yuan) to be used at the Hong Kong supermarket chain U Select.</p><p>In January, the central bank <a href=\"https://cointelegraph.com/news/china-s-digital-yuan-gets-smart-contract-functionality-alongside-new-use-cases\">integrated smart contract functionality </a>into the digital yuan to expand upon its use cases.</p><p>The $250 billion in e-CNY transactions is an over 70% increase from the number the bank cited in August 2022.</p><p>The amount is still, however, far off the amount of value processed by some of the largest public blockchains in the world. </p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), for example, processed $8.2 trillion in 2022, <a href=\"https://finbold.com/over-8-trillion-worth-of-transactions-made-on-bitcoin-blockchain-in-2022/\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to various reports.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/china-expands-cbdcs-tentacles-malaysia-is-hks-new-crypto-rival-asia-express/\"><strong><em>Asia Express: China expands CBDC’s tentacles, Malaysia is HK’s new crypto rival</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-20T05:11:54.000Z",
    "title": "LBank Labs and Symbolic Capital Join Forces to Empower Web3 Innovation Worldwide",
    "url": "https://cryptodaily.co.uk/2023/07/lbank-labs-and-symbolic-capital-join-forces-to-empower-web3-innovation-worldwide",
    "description": "<p>Road Town, BVI, July 20th, 2023, Chainwire</p><p>LBank Labs, at the forefront of blockchain venture funding, is delighted to share the news of its investment in Symbolic Capital. This strategic collaboration is poised to ignite innovation and provide robust support for the expansion of highly-scalable Web3 infrastructures worldwide.</p><p>LBank Labs, known for its protocol and exchange-agnostic approach, is committed to supporting projects through direct funding, acceleration, incubation, and extensive networking. With $100 million assets under management (AUM), the venture capitalist arm of global cryptocurrency exchange LBank has a strong track record of nurturing startups and helping them thrive. Besides direct investments in projects, the team aims to build a strong fund network via investing in global top funds to support portfolios from the network in both financial and resource value-add. Czhang Lin, IC board member of Labs, is also personally LPs to NGC, Blockchain Founders Fund and Lemniscap, where Eric He, Co-Founder of LBank is LP to SevenX Ventures fund I, II and FOF, and IOSG Ventures.</p><p>Symbolic Capital is a leading, thesis-driven venture capital firm co-founded by Sandeep Nailwal (founder of Polygon) and Kenzi Wang (partner at Borderless Capital). Rooted in the founders' own experiences of overcoming funding hurdles in their early days, Symbolic Capital places a special focus on identifying and accelerating the best blockchain founders. Even in the face of what some term a 'funding winter' for crypto, Symbolic Capital maintains its bullish outlook on the future of Web3, viewing it as the next evolution in the digital ecosystem.</p>Symbolic Capital&rsquo;s Co-founder Kenzi Wang expressed his enthusiasm for the firm's future collaborations, stating, \"At Symbolic Capital, we are excited to collaborate with LBank Labs as we work towards our shared vision of building the future of crypto. Our partnership allows us to continue supporting innovative startups in the Web3.0 ecosystem, especially those from emerging markets, and pave the way for the mass adoption of decentralized applications.\"<p>As investors, LBank Labs is committed to fueling the growth of highly-scalable Web3 infrastructures and empowering innovative startups worldwide. The strategic investment in Symbolic Capital solidifies LBank Labs' dedication to building the future of crypto and supporting the mass adoption of decentralized applications.</p><p>With $100 million assets under management, LBank Labs not only boasts substantial financial resources but also possesses an expansive global network. In return, Symbolic Capital will provide LBank Labs with significant value, harnessing their expertise, strategic insights, and innovative mindset to foster mutual growth and chart a course towards resounding success.</p><p>The venture fund also aims to forge its commitment by building a comprehensive network of Fund of Funds, designed to enhance the performance and diversification of its portfolios while emphasising the inherent value of its ecosystem network. Labs&rsquo; presence in seven global regions, including San Francisco, Dubai, Paris, Denver, Singapore, Mexico, and Shanghai, positions them as a powerhouse for fostering collaboration and innovation across borders.</p><p>About LBank Labs</p><p>LBank Labs, a prominent player in the web3 space, manages a versatile $100 Million fund that extends beyond specific protocols and exchanges. With a team of experienced web3 veterans from prestigious entities, they have built an extensive network of expertise and connections. Their investment strategy includes fund-of-fund investments, direct investments in early-stage projects, and liquid projects, enabling them to explore diverse opportunities. LBank Labs actively promotes their investment thesis, &ldquo;The Other Angle,&rdquo; through engaging discussions and focuses on the PSE principles to foster sustainable growth and innovation in the web3 landscape. With a Fund of Fund network comprising 12 funds and over $1 billion in AUM, and offices in seven global regions, LBank Labs is well-positioned to expand their network and drive innovation in the web3 ecosystem, together with their partners and collaborators.</p>ContactLBank Labsjunjie.niu@lbanklabs.com"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-20T05:30:06.000Z",
    "title": "Societe Generale Division Forge Receives Crypto Services License From AMF",
    "url": "https://news.bitcoin.com/societe-generale-division-forge-receives-crypto-services-license-from-amf/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2288649905-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Societe Generale Division Forge Receives Crypto Services License From AMF\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2288649905-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2288649905-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2288649905-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2288649905-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2288649905-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2288649905-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2288649905.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />French banking giant Societe Generale&#8217;s subsidiary, Forge, has been issued with the first crypto services license issued under the country’s crypto assets laws. According to France&#8217;s Autorité des Marchés Financiers, the license allows Forge to offer services which include crypto custody, trading, and sales. License Said to Enable Forge to Meet Institutional Demand for Digital [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T05:29:58.000Z",
    "title": "Nasdaq Postpones Crypto Custody Business Amid Regulatory Uncertainty",
    "url": "https://www.cryptopolitan.com/nasdaq-postpones-crypto-custody-business/",
    "description": "Nasdaq, the prominent US stock exchange, has announced that it is pausing its ambitious venture into the cryptocurrency custodial business due to shifting market conditions and regulatory uncertainties. CEO Adena Friedman made the announcement during a recent earnings call, highlighting the need to assess the evolving regulatory landscape before proceeding. Nasdaq had initially planned to ... <a title=\"Nasdaq Postpones Crypto Custody Business Amid Regulatory Uncertainty\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nasdaq-postpones-crypto-custody-business/\" aria-label=\"More on Nasdaq Postpones Crypto Custody Business Amid Regulatory Uncertainty\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-20T05:11:59.000Z",
    "title": "LBank Labs and Symbolic Capital Join Forces to Empower Web3 Innovation Worldwide",
    "url": "https://www.crypto-news-flash.com/lbank-labs-and-symbolic-capital-join-forces-to-empower-web3-innovation-worldwide/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-labs-and-symbolic-capital-join-forces-to-empower-web3-innovation-worldwide",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1280X1280_1689825333udduf70XMA.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1280X1280_1689825333udduf70XMA.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1280X1280_1689825333udduf70XMA-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1280X1280_1689825333udduf70XMA-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1280X1280_1689825333udduf70XMA-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Road Town, BVI, July 20th, 2023, Chainwire LBank Labs, at the forefront of blockchain venture funding, is delighted to share the news of its investment in Symbolic Capital. This strategic collaboration is poised to ignite innovation and provide robust support for the expansion of highly-scalable Web3 infrastructures worldwide. LBank Labs, known for its protocol and [...]"
  }
]