[
  {
    "source": "CoinDesk",
    "date": "2023-06-20T06:14:17.000Z",
    "title": "Alibaba's Crypto Friendly Joseph Tsai Set to Become Chairman ",
    "url": "https://www.coindesk.com/business/2023/06/20/alibabas-crypto-friendly-joseph-tsai-set-to-become-chairman/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Joe Tsai, one of Alibaba’s founders, has been an active Web3 investor and once tweeted “I like Crypto.”"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-20T06:28:45.000Z",
    "title": "Binance UK office one of 2,403 companies sharing ‘utility closet’ in Suffolk",
    "url": "https://cointelegraph.com/news/binance-uk-address-shared-by-thousands-of-companies",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/c1259980-f6a1-4d47-bdee-27ee10255b8c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Binance has drawn attention for using a small building as its registered office in the UK, but tech firms have used a similar trick for years.</p>\n                    <p><p>The United Kingdom-registered address for an entity of one of the world’s largest crypto exchanges, Binance, is nothing but a tiny building in Britain’s east that is shared by thousands of other companies. </p><p>On June 19, a <a href=\"https://old.reddit.com/r/Buttcoin/comments/14dkyia/the_billion_dollar_crypto_company_binance_has_a/\" target=\"_blank\" rel=\"noopener nofollow\">post</a> on the r/buttcoin subreddit showed the so-called “utility closet” Binance Ltd and thousands of other firms use as a registered office address in the U.K. — a tactic often used by other tech firms and large companies.</p><p>Binance Ltd’s address points to the small town of Mildenhall in Suffolk county, England. Google Maps shows the site is a small, nondescript garage building on the outer edge of the town about an hour and a half's drive from Britain’s capital London.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/e418e529-2c83-4fb2-ba94-e95ba57820dd.jpg\"  /><figcaption style=\"text-align: center;\"><em>The top image shows Binance’s office address registration with the government while the image spliced below shows the address on Google Maps. Source: Reddit</em></figcaption></figure><p>Companies House — the government's company’s registrar — <a href=\"https://find-and-update.company-information.service.gov.uk/advanced-search/get-results?companyNameIncludes=&amp;companyNameExcludes=&amp;registeredOfficeAddress=82A+James+Carter+Road%2C+Mildenhall&amp;incorporationFromDay=&amp;incorporationFromMonth=&amp;incorporationFromYear=&amp;incorporationToDay=&amp;incorporationToMonth=&amp;incorporationToYear=&amp;status=active&amp;sicCodes=&amp;dissolvedFromDay=&amp;dissolvedFromMonth=&amp;dissolvedFromYear=&amp;dissolvedToDay=&amp;dissolvedToMonth=&amp;dissolvedToYear=\" target=\"_blank\" rel=\"noopener nofollow\">shows</a> Binance Ltd shares the address with 2,403 active companies in total.</p><p>The address is actually the site of a company called OfficeServ, a virtual registered address service provider which aims to give a “believable business location,” as per its <a href=\"https://www.office-serv.co.uk/registered-address-services/\" target=\"_blank\" rel=\"noopener nofollow\">website</a>.</p><p>Companies House <a href=\"https://find-and-update.company-information.service.gov.uk/company/14576191\" target=\"_blank\" rel=\"noopener nofollow\">shows</a> Binance Ltd is registered to provide ”other service activities not elsewhere classified.” Binance has around six <a href=\"https://find-and-update.company-information.service.gov.uk/search/companies?q=Binance\" target=\"_blank\" rel=\"noopener nofollow\">entities</a> in Britain across various addresses registered to provide IT and financial services.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-cancels-registration-in-the-uk-amid-regulatory-scrutiny\"><strong><em>Binance cancels registration for inactive business in the UK</em></strong></a></p><p>Cointelegraph contacted Binance for more information on the entity but did not immediately receive a response.</p><h3>Tech firms shell games</h3><p>Technology companies have employed such virtual “shell” addresses around the world and in the United States for years. These are used for a host of reasons - from providing privacy, obscuring patent filings or registering a business in a corporate tax haven.</p><p>Most notable is the Corporation Trust Company, the world’s largest registered agent service firm<a href=\"https://www.nytimes.com/2012/07/01/business/how-delaware-thrives-as-a-corporate-tax-haven.html\" target=\"_blank\" rel=\"noopener nofollow\"> used</a> by thousands of firms including well-known companies such as Google, Walmart, Coca-Cola and Apple. It operates out of a similarly nondescript brick building in Delaware.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This utterly nondescript building in Wilmington, Delaware is (probably) the most famous address in corporate law.<br><br>1209 North Orange Street.<br><br>It houses the Corporation Trust Center, the registered agent address of about three hundred thousand businesses.  Including some giants. <a href=\"https://t.co/HhdaUfKXCU\">pic.twitter.com/HhdaUfKXCU</a></p>&mdash; Lucius Winslow (@Lucius_Winslow) <a href=\"https://twitter.com/Lucius_Winslow/status/1328030036390072320?ref_src=twsrc%5Etfw\">November 15, 2020</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The firm was <a href=\"https://cointelegraph.com/news/apple-job-listings-and-patents-hint-at-foray-into-3d-mixed-reality-world\">used by Apple last November</a> in an attempt to obscure the patent fillings for its recently announced <a href=\"https://cointelegraph.com/news/apple-vision-pro-headset-wwdc-no-mention-metaverse\">Vision Pro headset</a> and related operating system.</p><p>Another firm, Wyoming Corporate Services was uncovered in a 2011 Reuters <a href=\"https://www.reuters.com/article/us-usa-shell-companies-idUSTRE75R20Z20110628\" target=\"_blank\" rel=\"noopener nofollow\">exposé</a> which was said to be a “brick house” in a “sleepy city” and home to 2,000 registered companies at the time.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/real-bedford-soccer-team-puts-bitcoin-on-the-map/\"><strong><em>Peter McCormack’s Real Bedford Football Club puts Bitcoin on the map</em></strong></a></p></p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2023-06-20T06:35:48.000Z",
    "title": "Increase In Crypto Adoption As Russia Embraces Bitcoin Mining",
    "url": "https://nulltx.com/increase-in-crypto-adoption-as-russia-embraces-bitcoin-mining/",
    "description": "The rising interest from countries in Bitcoin adoption and the role of Bitcoin mining in this trend can be seen through the example of Russia&#8217;s Ministry of Energy pushing for the legalization of industrial crypto mining. This development highlights the growing recognition of the economic potential and significance of cryptocurrencies, particularly Bitcoin. Bitcoin Mining Role [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-20T06:25:56.000Z",
    "title": "Sparklo (SPRK) Thrives Amid Avalanche (AVAX) and Near Protocol (NEAR) Price Uncertainty",
    "url": "https://nulltx.com/sparklo-sprk-thrives-amid-avalanche-avax-and-near-protocol-near-price-uncertainty/",
    "description": "New and exciting digital currencies are emerging amid the market&#8217;s ups and downs. Sparklo is one of the creative endeavors. This new cryptocurrency project is gaining traction and might stir the market. The potential for Sparklo to dominate the cryptocurrency market is examined in this article. Avalanche (AVAX) and Near Protocol (NEAR)&#8217;s recent price trajectories [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-20T06:17:54.000Z",
    "title": "Tron reaches bearish limit Litecoin shows green signs and Tradecurve to surge 50% again",
    "url": "https://nulltx.com/tron-reaches-bearish-limit-litecoin-shows-green-signs-and-tradecurve-to-surge-50-again/",
    "description": "The current downtrend for the TRON cryptocurrency reached a bearish limit, and the uptrend will resume when the cryptocurrency&#8217;s value ends up returning above the moving average lines.  Cryptocurrency prices will rise again, and this has also been evident in the upwards recent momentum experienced by the Litecoin cryptocurrency, which indicated green signs. Tradecurve is [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-20T06:09:52.000Z",
    "title": "Ethereum (ETH) Struggles to break $2000, Filecoin (FIL) Crashes and Alex The Doge (ALEX) Leads The Meme Gang",
    "url": "https://nulltx.com/ethereum-eth-struggles-to-break-2000-filecoin-fil-crashes-and-alex-the-doge-alex-leads-the-meme-gang/",
    "description": "In the rollercoaster ride that is the cryptocurrency market, investors are currently witnessing a struggle in Ethereum (ETH), a crash in Filecoin (FIL), and an unlikely leader emerging from the meme tokens &#8211; Alex The Doge (ALEX). Each of these events is leading to profound shifts in the way investors approach their portfolio. Ethereum (ETH) [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-20T06:24:42.000Z",
    "title": "Etherscan integrates ChatGPT to analyze Ethereum source code",
    "url": "https://crypto.news/etherscan-integrates-chatgpt-to-analyze-ethereum-source-code/",
    "description": "Etherscan, a popular Ethereum (ETH) block explorer, has announced the addition of ChatGPT to its suite of tools for analyzing the coin&#8217;s blockchain. The new tool, called Code Reader, utilizes the ChatGPT API to provide users with the ability to&#8230;"
  }
]