[
  {
    "source": "CoinDesk",
    "date": "2023-06-21T16:00:00.000Z",
    "title": "First Animated Film Funded by a DAO Brings Nouns NFT Collection to Life",
    "url": "https://www.coindesk.com/web3/2023/06/21/web3-creative-studio-atrium-releases-pilot-episode-of-nouns-movie/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Led by former animators for Pixar, Netflix and Marvel, “The Rise of Blus: A Nouns Movie” has a budget of $2.75 million and is said to be the first animated film funded by a DAO."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-21T15:39:58.000Z",
    "title": "MakerDAO Boosts U.S. Treasury Holdings by $700M to Back DAI Stablecoin With Real-World Assets",
    "url": "https://www.coindesk.com/markets/2023/06/21/makerdao-boosts-us-treasury-holdings-by-700m-to-back-dai-stablecoin-with-real-world-assets/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The purchase is the latest step to increase the role of real-world assets in the platform’s DAI stablecoin reserve."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-21T16:01:06.000Z",
    "title": "Neutron Raises $10 Million to Develop Smart Contracts on Cosmos",
    "url": "https://decrypt.co/145599/neutron-raises-10-million-to-develop-smart-contracts-on-cosmos",
    "description": "Neutron, a CosmWasm smart contract platform for the Cosmos \"internet of blockchains,\" has raised $10 million in a funding round."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-21T16:00:44.000Z",
    "title": "Bitcoin Startup Casa Expands Beyond BTC With Ethereum Vaults",
    "url": "https://decrypt.co/145642/bitcoin-startup-casa-expands-beyond-btc-ethereum-vaults",
    "description": "The Bitcoin-centric startup has embraced Ethereum, offering ETH holders self-custody vaults that require multiple signatures to transact."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-21T15:43:24.000Z",
    "title": "Don’t be mean to CEXs — Crypto relies on them",
    "url": "https://cointelegraph.com/news/centralized-exchanges-cexes-crypto-relies",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/d3764be1-c9ff-47c2-a848-613d4f674cfa.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Centralized crypto exchanges have a crucial role left to play in bridging traditional finance with decentralized cryptocurrencies.</p>\n                    <p><p>However, there are certain factors that may hinder this bright future, including the zero-sum nature of the <a href=\"https://cointelegraph.com/learn/crypto-derivatives\">derivatives market</a>. Crypto needs continuous adoption and capital injection to increase in value — the psychological tendencies that tend to encourage the fear of missing out (FOMO) and excessive trading.</p><p>Money itself is not inherently valuable but rather a vessel for value. Consequently, the cryptocurrency market is a zero-sum derivatives market where individuals trade against each other based on differing expectations of the value it represents rather than the actual value itself.</p><h2>Zero-sum nature of the derivatives market</h2><p>A zero-sum game is a situation where any gains made by one participant come at the expense of losses for another participant. In derivatives markets, options and futures are considered zero-sum because the contracts represent agreements between two parties, and if one trader loses, the wealth is transferred to another trader.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ripple-verdict-bull-market-more-malaise\"><strong><em>Ripple verdict could spark a new bull market — Or more malaise</em></strong></a></p><p>The zero-sum nature can create a highly competitive and speculative environment where traders are focused on short-term gains rather than the underlying value and potential of the cryptocurrencies. Consequently, this distracts from the ultimate goal of decentralization and the establishment of a robust, reliable framework for value exchange.</p><h2>Need for adoption and capital injection</h2><p>For a cryptocurrency to increase in value, more individuals and businesses must use and invest in that cryptocurrency. The greater the adoption and capital inflow, the more stable and valuable the cryptocurrency can become. However, as cryptocurrencies gain popularity and value, there is a tendency for users to gravitate toward <a href=\"https://cointelegraph.com/explained/centralized-cryptocurrency-exchanges-explained\">centralized exchange (CEX)</a> platforms because of their higher efficiency, reliability and more user-friendly interfaces.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/19c4abbe-7c47-4a9c-9a7c-8d10027f95a0.jpg\"  /><figcaption style=\"text-align: center;\"><em>Change in market share for top CEXes, March-May 2023. Source: CCData</em></figcaption></figure><p>Furthermore, the reliance on continuous adoption and capital injection can create a cycle where the value of cryptocurrencies is predominantly driven by speculative trading and market sentiment rather than underlying technological advancements. This dynamic can lead to an unstable market environment and hinder the development of an open, resilient financial system based on decentralized principles.</p><p>The allure of making quick profits through crypto trading is difficult to resist, and this collective drive to trade often results in capital flowing toward the exchanges that facilitate these trades and charge fees in the form of cryptocurrencies with limited supply. This presents a dilemma: Cryptocurrencies were intended to dismantle centralized power structures, but the pursuit of profit draws users to the most reliable, efficient CEX platforms, and these platforms consistently attract more users, accumulate more wealth through fees and then become more centralized and powerful.</p><h2>So, why do we still need CEXs?</h2><p>CEXs play a vital role in the journey toward achieving a truly decentralized ecosystem. They act as a crucial bridge between traditional financial systems and the emerging world of cryptocurrencies. By refining their operations and implementing robust security infrastructure, CEXs are not only facilitating the seamless transition into decentralized finance but also actively driving its widespread adoption.<strong></strong></p><p>One of the primary advantages of CEXs is their ability to provide liquidity and foster market depth within the cryptocurrency ecosystem. They create an active marketplace where traders can efficiently buy and sell digital assets. With a sufficient number of buyers and sellers, CEXs reduce <a href=\"https://cointelegraph.com/news/cryptocurrency-markets-low-volatility-a-curse-or-an-opportunity\">price volatility</a> and enable fair price discovery, ultimately contributing to the stability and growth of the crypto market.</p><p>Another key reason is that they serve as a significant entry point for newcomers to the crypto space. Their user-friendly interfaces and intuitive trading tools make it easier for individuals with limited technical knowledge to navigate the complexities of cryptocurrency trading. By providing a familiar environment akin to traditional financial platforms, CEXs lower the barriers to entry and attract a broader user base.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-charges-binance-coinbase-terrible-defi\"><strong><em>SEC charges against Binance and Coinbase are terrible for DeFi</em></strong></a></p><p>There are several other factors that contribute to the need for CEXs, including their efficient risk management measures, around-the-clock support services and convenient fiat on-ramps, among others.</p><p>While the goal of the cryptocurrency industry and blockchain technology is decentralization, it is essential to recognize the indispensable role of centralized exchanges in this journey. As the industry continues to evolve and innovate, striking a balance between decentralization and the need for centralized exchanges becomes crucial for achieving a sustainable, inclusive, decentralized future.</p><p>It is our responsibility to approach this delicate balance with caution and avoid any tendencies toward forceful expansionism. Let us always remember the age-old wisdom that power corrupts and absolute power corrupts absolutely.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Hao Yang</strong> has served as the head of options at Bybit since 2021. He previously provided consultancy services for OKEx Options. Prior to that, he worked as a quantitative analyst modeling energy options with exotic pay-off structures at energy firm PZEM and as a trader at Optiver, where he focused on interest rates and index options. Hao began his crypto journey as a miner before building the trading system for a crypto exchange startup. He holds an MSc in finance from Vrije Universiteit Amsterdam’s Duisenberg Honors Programme in Quantitative Risk Management.</div></div><p>Blockchain technology will eventually establish a reliable framework for exchanging value, effectively decentralizing power and financial control. This vision represents a revolutionary paradigm shift that we should wholeheartedly embrace.</p><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-21T15:42:44.000Z",
    "title": "How to track and report crypto transactions for tax purposes",
    "url": "https://cointelegraph.com/news/how-to-track-and-report-crypto-transactions-for-tax-purposes",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/f9389153-d640-4ced-826c-b41aa7521f4c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Crypto assets are subject to tax and must be tracked and reported to the IRS. This comprehensive tax guide contains everything you need to know.</p>\n                    <p><p>As cryptocurrencies and blockchain assets continue to grow in popularity and mainstream adoption, the United States Internal Revenue Service has taken an increasing interest in their taxation. </p><p>In the U.S., cryptocurrency is subject to crypto tax and is classified as transactions instead of property or assets. Needless to say, failure to accurately <a href=\"https://cointelegraph.com/news/study-claims-99-5-of-crypto-investors-did-not-pay-taxes-in-2022\">track and report</a> these transactions can result in <a href=\"https://cointelegraph.com/news/spanish-tax-agency-to-send-over-328k-notices-to-crypto-holders\">penalties and fines</a>. </p><p>Here is a comprehensive crypto tax guide for tracking and reporting crypto transactions for tax purposes in the United States.</p><h2>How cryptocurrency is taxed in the U.S.</h2><p>In the U.S., if you invest in crypto assets, such as nonfungible tokens (NFTs), and transact further for gains, you must be ready for crypto taxation. </p><p>Note that buying crypto alone — or its rise or fall in value while it is in your portfolio — isn’t taxable. Taxes are due when you sell, invest or dispose of the asset in any way for gains.</p><p>Cryptocurrency is subject to taxation in two ways: capital gains tax and income tax.</p><h3>Capital gains tax</h3><p>This applies to profits earned from the sale of an asset that was purchased at a lower price. Any gains realized from selling or trading a digital asset for a higher price than purchased are subject to capital gains tax. </p><p>If crypto assets were held for less than a year, it is considered a short-term gain. If it was held for more than a year, it is regarded as a long-term gain.</p><p>Capital gains events include selling cryptocurrency for fiat currency and sending cryptocurrency (over $15,000) as a gift.</p><p>Additionally, purchasing goods and services with cryptocurrency is also considered a capital gains taxable event. Trading or swapping one digital asset for another is also considered a capital gains event. This includes purchasing NFTs with cryptocurrency.</p><p>As such, it is crucial to accurately track all crypto transactions for tax purposes. That said, declaring your capital losses can offset capital gains tax.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/biggest-mistake-is-not-using-tax-loss-harvesting-koinly-head-of-tax\"><strong><em>‘Biggest mistake’ is not using tax loss harvesting: Koinly head of tax</em></strong></a></p><h3>Income tax </h3><p>Income tax on cryptocurrency transactions applies to earnings from the <a href=\"https://cointelegraph.com/news/how-to-mine-bitcoin-at-home\">mining</a> and <a href=\"https://cointelegraph.com/explained/understanding-staking-pools-the-pros-and-cons-of-staking-cryptocurrency\">staking</a> of tokens. These include receiving cryptocurrency from an airdrop or any crypto interest earnings from <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> lending.</p><p>Also, receiving cryptocurrency as a means of payment for labor is also considered an income tax event. </p><h3>Long-term cryptocurrency tax rates</h3><p>The IRS’ long-term cryptocurrency tax rates will apply to gains on cryptocurrencies that have been held for over a year. </p><p>For single individuals, no tax would be levied on crypto gains of up to $44,625. For individuals filing as heads of household or married people filing jointly, the rates range from 0% to 20% based on income tax brackets. </p><p>See the table below for more details:</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/91011710-d0ca-4edb-a3ca-31847d9b8b65.jpg\"  /></figure><h3>Short-term cryptocurrency tax rates</h3><p>For short-term crypto gains — i.e., gains on cryptocurrencies held for 365 days or less — the tax rates will be calculated as ordinary income tax rates. </p><p>As shown in the table below, they range from 10% to 37% based on income brackets for single filers, married couples filing jointly, and heads of household. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/6af9fee8-ab4c-485f-bd56-5b56b5fecb00.jpg\"  /></figure><h3>When is cryptocurrency not taxed?</h3><p>Some cryptocurrency transactions that are not subject to either capital gains or income tax:</p><ul><li>Purchasing cryptocurrency with fiat currency</li><li>Holding cryptocurrencies without selling them</li><li>Moving cryptocurrency between your own cryptocurrency wallets</li><li>Gifting cryptocurrency amounting to less than $15,000</li><li>Donating cryptocurrency to charities (in fact, this may be tax deductible) </li><li>Creating an NFT (unless it is sold).</li></ul><h2>How to track crypto transactions</h2><p>It is essential to accurately track and report all cryptocurrency transactions and consult a tax professional to meet all obligations. For some, it may just be a matter of screenshotting the few crypto transactions they’ve made all year. For others, recording crypto transactions across all Web3 ecosystems can be an arduous affair.</p><p>Several purpose-built crypto tax software solutions are available for tracking and generating reports for cryptocurrency transactions. Popular options include <a href=\"https://koinly.io/\" target=\"_blank\" rel=\"noopener nofollow\">Koinly</a>, <a href=\"https://coinledger.io/\" target=\"_blank\" rel=\"noopener nofollow\">CoinLedger</a> and <a href=\"https://www.accointing.com/\" target=\"_blank\" rel=\"noopener nofollow\">Accointing</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/e88ecd2a-9640-46ae-b7a4-d697c5e3e303.jpg\"  /></figure><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/b155e13e-9c82-4717-8411-d43335b25dd6.jpg\"  /></figure><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/6d921d50-5891-4af5-8152-f7c06d7ccf4e.jpg\"  /></figure><p>If you prefer to do it all yourself, here’s a step-by-step guide to tracking and reporting crypto transactions: </p><ul><li>Identify and organize all of your cryptocurrency transactions, including trades, purchases and sales. Make a list of the type of cryptocurrency or asset, the date of the transaction, the amount and the value at the time of the transaction. It’s also a good practice to note the relevant wallet addresses.</li><li>Calculate the cost basis for each transaction, which includes the purchase price, fees and any other costs incurred.</li><li>Determine the gain or loss on each transaction, which is the difference between the cost basis and the fair market value of the cryptocurrency at the time of the sale or trade.</li><li>Separate your short-term and long-term transactions based on whether you’ve held the crypto asset in question for less than a year (short-term) or longer than a year (long-term).</li></ul><p>By keeping accurate records and staying informed on the latest tax guidelines, you can easily navigate the tax implications of your cryptocurrency investments. While there are still many “undefined scenarios” as it pertains to taxing crypto, the IRS is continually <a href=\"https://cointelegraph.com/news/new-r-d-tax-rules-could-bankrupt-your-blockchain-startup\">working to cover them</a>. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/arizona-governor-vetoes-bill-targeting-taxes-on-blockchain-node-hosts\"><strong><em>Arizona governor vetoes bill targeting taxes on blockchain node hosts</em></strong></a></p><h2>Reporting crypto holdings on your taxes </h2><p>After accurately tracking your crypto transactions, you must send them all to the IRS for tax purposes. </p><h3>Reporting capital gains and losses</h3><p>The <a href=\"https://www.irs.gov/pub/irs-pdf/f8949.pdf\" target=\"_blank\" rel=\"noopener nofollow\">crypto tax Form 8949</a> is used to report the sales and disposals of capital assets, including cryptocurrencies. It consists of two parts: Part I for short-term disposals and Part II for long-term disposals. </p><p>You need to check the relevant box at the top of the sheet based on whether your transaction was reported on <a href=\"https://www.irs.gov/pub/irs-pdf/f1099msc.pdf\" target=\"_blank\" rel=\"noopener nofollow\">Form 1099</a>. Crypto tax Form 1099 B — supposed to be issued by exchanges — is used to report various types of income received throughout the year, including income from stock investments and cryptocurrencies. </p><p>However, as most exchanges do not issue Form 1099-B for cryptocurrency transactions, you will likely need to select option C (on Form 8949), which applies to short-term transactions that were not previously reported.</p><p>To fill in the details on Form 8949, you’ll need to provide the following information:</p><ul><li>A description of the crypto asset sold</li><li>The date you originally acquired it</li><li>The date you sold or disposed of it</li><li>The fair market value </li><li>The cost basis</li><li>The gain or loss.</li></ul><p>Each of these pertains to each column in Form 8949 (as shown below):</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/0d6a3a23-cdbf-462d-b76a-98aa29c22d87.jpg\"  /></figure><p>Once Form 8949 is filled out, you must take the total gain (or loss) and mention the same on <a href=\"https://www.irs.gov/forms-pubs/about-schedule-d-form-1040\" target=\"_blank\" rel=\"noopener nofollow\">Schedule D</a> of Form 1040. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/f6317fe4-757a-494d-b6f4-56ecf030c85a.jpg\"  /></figure><h2>Reporting crypto income</h2><p>The most common form for individual income tax returns in the United States is Form 1040. You must report all crypto income on your 1040, along with capital gains or losses from crypto transactions.</p><p>Form 1040 has a crypto question: ‍“At any time during 2022, did you: (a) receive crypto as a reward, award, or compensation; or (b) sell, exchange, gift, or otherwise dispose of a digital asset?” Withholding information or any form of dishonesty constitutes tax fraud.</p><p>Earning crypto as a business entity via payments for labor, running a mining income operation, or tapping into staking income are treated as self-employment. They must be reported in <a href=\"https://www.irs.gov/forms-pubs/about-schedule-c-form-1040\" target=\"_blank\" rel=\"noopener nofollow\">Schedule C</a> of Form 1040.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/95a07901-1288-4175-a2d0-56e88bce0fe9.jpg\"  /></figure><p>When it comes to reporting crypto income from <a href=\"https://cointelegraph.com/news/what-is-a-crypto-airdrop-and-how-does-it-work\">airdrops</a>, forks or other sources, such as wages and hobby income, it is usually recorded as “other income” on <a href=\"https://www.irs.gov/pub/irs-pdf/f1040s1.pdf\" target=\"_blank\" rel=\"noopener nofollow\">Schedule 1</a> of Form 1040.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/e72c4fb6-9c48-4d2b-ab37-c6e0b0a90db8.jpg\"  /></figure><p>One may consult a tax professional for guidance on filing your cryptocurrency taxes accurately and reporting them correctly on your tax return.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-21T16:00:54.000Z",
    "title": "Bitcoin’s illiquid supply hits all-time high as hodlers continue to accumulate",
    "url": "https://cryptoslate.com/bitcoins-illiquid-supply-hits-all-time-high-as-hodlers-continue-to-accumulate/",
    "description": "<p>Despite Bitcoin recently breaking through the $28,000 resistance level, the crypto market has been relatively flat for the past month. The lack of volatility in the historically aggressive market has been an underlying trend evident in several on-chain metrics. Bitcoin hodlers have been capitalizing on this sideways price movement, continuing the steady accumulation that&#8217;s been [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoins-illiquid-supply-hits-all-time-high-as-hodlers-continue-to-accumulate/\">Bitcoin’s illiquid supply hits all-time high as hodlers continue to accumulate</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-21T15:54:23.000Z",
    "title": "Wall Street Backed ‘EDX Markets’ Crypto Exchange Goes Live",
    "url": "https://cryptodaily.co.uk/2023/06/wall-street-backed-edx-markets-crypto-exchange-goes-live",
    "description": "<p>EDX Markets, the crypto exchange endorsed by Wall Street heavyweights such as Fidelity and Citadel, launched its operations this week. The platform will offer trading in BTC, LTC, ETH and BCH. </p>\n<p>EDX Markets launched its operations on Tuesday after it completed an investment round which saw it onboard new equity partners to join its founding investors Citadel Securities, Fidelity Digital Assets, Sequoia Capital, and Charles Schwab.</p>\nEDX Will Allow Trading In BTC, ETH, LTC, and BCH\n<p>In a press release, EDX explained that it offers a &ldquo;non-custodial&rdquo; model, meaning it does not hold clients&rsquo; digital assets. The platform instead works with a third-party custodian, said Chief Executive Officer Jamil Nazarali.</p>\n<p>The exchange also said it successfully conducted an investment round to add investors such as Miami International Holdings, DV Crypto, GTS, GSR Markets LTD, and HRT Technology.</p>\n<p>Nazarali said:</p>\n\n<p>EDX&rsquo;s ability to attract new investors and partners in the face of sector headwinds demonstrates the strength of our platform and the demand for a safe and compliant cryptocurrency market.</p>\n\n<p>EDX further stated it aims to bring elements of traditional finance over to crypto, focusing on compliance and mitigating conflicts of interest.</p>\n\n<p>We are committed to bringing the best of traditional finance to cryptocurrency markets, with an infrastructure built by market experts to embed key institutional best practices.</p>\n\n<p>Unlike other crypto exchanges, EDX will only allow investors to trade four top cryptocurrencies, including Bitcoin (BTC), Ethereum (ETH), Litecoin (LTC) and Bitcoin Cash (BCH). &nbsp;</p>\n<p>The platform&rsquo;s CEO said EDX would soon launch a clearing house.</p>\n\n<p>With the endorsement of our new and growing list of investors and customers, we&rsquo;re proud to launch trading and look forward to further enhancements to our offering. Looking ahead, EDX Clearing will be a major differentiator for EDX -- and resolve an unmet need in the market &ndash; by enhancing competition and creating unparalleled operational efficiency through a single settlement process.</p>\n\nTraditional Financial Institutions Bullish on Bitcoin\n<p>In a time of intense regulatory scrutiny of the crypto industry, some traditional financial institutions are laying the groundwork to participate in the market. BlackRock, the world&rsquo;s largest asset manager, announced last week that it applied for a Bitcoin spot ETF (exchange-traded fund). If approved, the ETF would become the first crypto spot ETF in the US.</p>\n<p>Rumour also has it that Fidelity Investments applied with the SEC to develop a Bitcoin ETF similar to BlackRock&rsquo;s.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T15:46:21.000Z",
    "title": "Ava Labs launches AvaGPT on its platform",
    "url": "https://www.cryptopolitan.com/ava-labs-launches-avagpt-on-its-platform/",
    "description": "Ava Labs, the company behind the Avalanche network, has unveiled AvaGPT, a new addition to the growing number of blockchain companies adopting OpenAI’s ChatGPT technology. This move aims to provide quick answers to general questions from Avalanche users while still allowing access to the support team. Ava Labs enters collaboration with Kapa AI AvaGPT was ... <a title=\"Ava Labs launches AvaGPT on its platform\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ava-labs-launches-avagpt-on-its-platform/\" aria-label=\"More on Ava Labs launches AvaGPT on its platform\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T15:40:02.000Z",
    "title": "Core Scientific’s chapter 11 plan paving the way for Bitcoin mining titan’s resurgence",
    "url": "https://www.cryptopolitan.com/core-scientifics-chapter-11-plan-btc-mining/",
    "description": "Core Scientific, a Bitcoin mining company facing serious difficulties due to the current bankruptcy procedures, has taken a decisive step to ensure its long-term viability. The company has recently filed for Chapter 11 bankruptcy protection in order to demonstrate its commitment to reorganizing its business and pleasing its creditors. The Chapter 11 plan was submitted ... <a title=\"Core Scientific&#8217;s chapter 11 plan paving the way for Bitcoin mining titan&#8217;s resurgence\" class=\"read-more\" href=\"https://www.cryptopolitan.com/core-scientifics-chapter-11-plan-btc-mining/\" aria-label=\"More on Core Scientific&#8217;s chapter 11 plan paving the way for Bitcoin mining titan&#8217;s resurgence\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-21T16:00:20.000Z",
    "title": "WisdomTree Investments Joins Blackrock, Files For Bitcoin ETF",
    "url": "https://www.newsbtc.com/bitcoin-news/wisdomtree-investments-joins-blackrock-files-for-bitcoin-etf/",
    "description": "Several United States asset managers have sought the US Securities and Exchange Commission’s (SEC) blessing to start a spot Bitcoin exchange-traded fund (ETF). However, companies like WisdomTree, Grayscale, and One River Asset Management only received the SEC’s rejection. However, the SEC&#8217;s denial didn&#8217;t deter WisdomTree as a June 21 Bloomberg report revealed that the asset manager filed another application with the SEC to launch its spot BTC ETF. The firm’s application comes a few days after BlackRock submitted its own, seeking approval for the same product. WisdomTree Reapplies For Spot BTC ETF Approval Despite Previous Rejections WisdomTree Investments had previously proposed to launch a spot BTC ETF with the SEC in 2021. However, the commission denied the company&#8217;s application in December 2021 after a prolonged delay in taking action.  Related Reading: Shiba Inu Breaks Through Crucial Resistance Point With 10% Climb After the denial, WisdomTree, alongside One River, made changes to its proposal and resubmitted it to the SEC. However, in March 2022, the commission announced designating a longer period to decide on the proposed rule change. It noted that it needed ample time to consider the proposed change, including the accompanying comments. One would have expected WisdomTree to surrender after the prolonged delay and denial, but the latest development suggests otherwise.  The Tuesday filing disclosed that the asset manager&#8217;s Bitcoin Trust would list on the Cboe BZX Exchange under the name BTCW if approved. The SEC has previously refused to allow such Bitcoin-based investment products, rejecting or ignoring applications from firms such as Grayscale, One River, and VanEck.  It cited fraud and BTC spot market manipulation as reasons for not approving the spot-based BTC ETFs. Instead, the SEC allowed futures-based BTC ETFs. Notably, the manager of the largest Bitcoin Trust fund, Grayscale, had applied with the SEC to convert its private spot Bitcoin trust to spot ETF. But the commission rejected the move, enraging the firm to sue it for denying the application. BlackRock Raises Hope In Spot BTC Approval Last week, US’ leading asset manager BlackRock applied for the SEC’s approval to launch iShares Bitcoin Trust spot ETF. It appears that BlackRock’s application restored hope among previous applicants. Eric Balchunas and James Seyffart, ETF analysts at Bloomberg Intelligence, said:  BlackRock’s spot BTC ETF filing “has restored hope in approval thanks to the company’s size, stature, and reputation.” Interestingly, some Bitcoin proponents threw weights behind BlackRock’s political affluence and power in the United States as an advantage.  Related Reading: TUSD Emerges Strong: 1 Billion Injection Bolsters Supply Amidst Declining Stablecoin Market In a June 12 tweet, a notable Bitcoin proponent, Paine, while cheering BlackRock, expressed optimism that the firm would receive the SEC&#8217;s approval to launch its spot BTC ETF.  Paine said: BlackRock is probably the most politically powerful and connected entity in the United States. I bet this spot BTC ETF will be approved. He also said the SEC&#8217;s stalling the approval of other firms&#8217; applications was to ward off &#8220;undeserving frontrunners&#8221; and &#8220;let the anointed [BlackRock] have their due.&#8221; Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T16:00:47.000Z",
    "title": "Shiba Inu Roars Past $4 Billion Market Cap, Leaving Another Zero Behind in a Remarkable Surge",
    "url": "https://www.crypto-news-flash.com/shiba-inu-roars-past-4-billion-market-cap-leaving-another-zero-behind-in-a-remarkable-surge/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-roars-past-4-billion-market-cap-leaving-another-zero-behind-in-a-remarkable-surge",
    "description": "Shiba Inu has more than 2.3 million holders with whale holders fueling the long-term bullish perspective. Nonetheless, Shiba Inu&#8217;s price is down more than 91 percent from its ATH achieved during 2021’s crypto bull market. Less arguably, the striking initial growth of Shiba Inu (SHIB) remains at the back of most cryptocurrency traders. As the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T16:00:32.000Z",
    "title": "Avalanche Increases Its Utility By Reaching Out To Potential European Users, How Can Caged Beasts Benefit From This Update?",
    "url": "https://www.crypto-news-flash.com/avalanche-increases-its-utility-by-reaching-out-to-potential-european-users-how-can-caged-beasts-benefit-from-this-update/?utm_source=rss&utm_medium=rss&utm_campaign=avalanche-increases-its-utility-by-reaching-out-to-potential-european-users-how-can-caged-beasts-benefit-from-this-update",
    "description": "In the dynamic world of cryptocurrency, projects like Avalanche (AVAX) are constantly evolving to enhance utility and accessibility. The recent update from Avalanche regarding the integration of the EuroCoin (EUROC) stablecoin signifies a significant step forward. We will also understand how new altcoins like Caged Beasts (BEAST) can benefit from the expansion of the Avalanche [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-21T16:01:00.000Z",
    "title": "CSA Cautions Canadians About Fake Crypto Trading Services",
    "url": "https://coinedition.com/csa-cautions-canadians-about-fake-crypto-trading-services/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Canadian Securities Administrators (CSA) issued a cautionary message to Canadians, urging them to exercise caution when dealing with alleged cryptocurrency trading service providers. Apparently, these platforms falsely claim to be authorized or associated with non-existent regulatory or dispute resolution bodies. According to the CSA’s warning, certain trading service providers are resorting to deceptive tactics [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/csa-cautions-canadians-about-fake-crypto-trading-services/\">CSA Cautions Canadians About Fake Crypto Trading Services</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]