[
  {
    "source": "CryptoSlate",
    "date": "2023-06-16T13:30:02.000Z",
    "title": "Damus says there is “nothing Apple can do” to stop its Bitcoin Lightning tips",
    "url": "https://cryptoslate.com/damus-says-there-is-nothing-apple-can-do-to-stop-its-bitcoin-lightning-tips/",
    "description": "<p>Decentralized social media platform Damus has hit back at Apple over a thread to remove its app from the APP store, saying the tech giant cannot prevent the use of Bitcoin Lightning tips, known as &#8220;zaps,&#8221; on its platform. The team behind Damus said, &#8220;There&#8217;s nothing Apple can do&#8221; to stop Bitcoin Lightning tips on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/damus-says-there-is-nothing-apple-can-do-to-stop-its-bitcoin-lightning-tips/\">Damus says there is &#8220;nothing Apple can do&#8221; to stop its Bitcoin Lightning tips</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-16T13:15:00.000Z",
    "title": "France's AMF Turns On Binance: Investigations Underway Since 2022",
    "url": "https://cryptodaily.co.uk/2023/06/france-amf-turns-on-binance-investigations-underway-since-2022",
    "description": "<p class=\"md-end-block md-p md-focus\">Binance, the world's largest crypto exchange with roughly 62 million users, is reportedly under scrutiny from French financial regulatory authorities.</p>\n<p class=\"md-end-block md-p\">According to a breaking report from Le Monde, investigations into the exchange's activities were to have been underway since at least the early quarter of 2022.</p>\n<p class=\"md-end-block md-p\">The inquest, led by the judicial investigation service of finance and under the specialized interregional jurisdiction of Paris, has brought into question the exchange's adherence to legal norms.</p>\n<p class=\"md-end-block md-p\">Reportedly, the focus of the probe revolves around \"acts of illegal exercise of the function of service provider on digital assets (PSAN), and acts of aggravated money laundering.\" Particularly, the exchange is being examined for its participation in investment operations, concealment, and conversion - all purportedly carried out by offenders that generated profits.</p>\n<p class=\"md-end-block md-p\">Offhand, however, these allegations appear to be more a matter of misinterpretation and miscommunication withe the regulatory body than a wilful abandonment of due diligence from the side of Binance.</p>\n<p class=\"md-end-block md-p\">Binance Commits To KYC Procedures</p>\n<p class=\"md-end-block md-p\">Simultaneously, questions have been raised about Binance's commitment to 'Know Your Customer' (KYC) procedures, a regulatory framework meant to curb money laundering activities. Reports suggest that Binance may not have been fully compliant with these protocols, leading to further speculation about the exchange's operations.</p>\n<p class=\"md-end-block md-p\">To further complicate matters, it's alleged that Binance had been offering services to French customers without obtaining an appropriate operating license. Regulations enacted in 2019 require crypto exchanges to gain the approval of the Financial Markets Authority (AMF) to legally operate in France. Binance commenced operations in France in 2020 but purportedly only secured AMF approval in May 2022, fueling further controversy.</p>\n<p class=\"md-end-block md-p\">In response to the claims, a Binance spokesperson maintained that the company cooperates with global law enforcement and abides by all local laws. However, they refrained from commenting on specifics about the investigation.</p>\n<p class=\"md-end-block md-p\">Binance: Between Compliance and Current Charges</p>\n<p class=\"md-end-block md-p\">This French investigation comes amidst Binance facing litigation in the United States. The U.S. Securities and Exchange Commission (SEC) has brought forward 13 charges against the crypto exchange's U.S. subsidiary and CEO Changpeng Zhao. Recent reportage also indicate that Binance.US has also cut off staff amid the ongoing legal troubles.</p>\n<p class=\"md-end-block md-p\">These revelations underscore the challenging terrain for Binance, as well as for similar platforms such as Coinbase. As of mid-2022, the SEC stated that out of the 62 million users on Binance globally, only 25 million had filled in KYC documents. This implies a substantial proportion of users on the platform are operating without the requisite KYC documentation.</p>\n<p class=\"md-end-block md-p\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice. Note: This story is currently developing and CryptoDaily will update this article with relevant information when available and as the matter unfolds.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-16T13:30:06.000Z",
    "title": "French Investigation Targets Binance: Allegations of Money Laundering and Regulatory Violations",
    "url": "https://news.bitcoin.com/french-investigation-targets-binance-allegations-of-money-laundering-and-regulatory-violations/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/binancefrance-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/binancefrance-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/binancefrance-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/binancefrance-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/binancefrance-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/binancefrance-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/binancefrance-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/binancefrance.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Binance, the crypto exchange with the highest trade volume globally, is currently facing an investigation for suspected money laundering activities, as reported by the French publication Le Monde. The finance judicial investigation service of France is currently scrutinizing the actions of Binance&#8217;s subsidiary in the country. French Regulators Probe Binance Amid mounting challenges faced by [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T13:36:41.000Z",
    "title": "Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 If you are thinking of investing in a cryptocurrency, Algorand is one of the best choices you can make. However, it is not just enough to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You have to look at Algorand&#8217;s price prediction from 2023 ... <a title=\"Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-16T13:19:14.000Z",
    "title": "Ethereum whales are aggressively buying the dip ",
    "url": "https://crypto.news/ethereum-whales-are-aggressively-buying-the-dip/",
    "description": "Ethereum whales have taken advantage of ether’s dip below the $1,700 region to accumulate millions of dollars worth of ETH in the last 24 hours, according to on-chain data released by Spot on Chain. While market analysts and on-chain metrics&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-16T13:32:42.000Z",
    "title": "Bitcoin Market Dominance Touches Two-Year Peak, Here’s Why",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-market-dominance-peaks-in-nearly-two-years/",
    "description": "Amid the ongoing crypto regulatory uncertainty, Bitcoin&#8217;s market dominance has surged to its highest level since July 2021, suggesting a shift in the sentiments of traders and investors towards the world&#8217;s pioneer and most substantial cryptocurrency, Bitcoin. This milestone highlights the current volatility of the crypto market as it continues to grapple with regulatory uncertainty and the various factors that impact Bitcoin&#8217;s value. The Resurgence Of Bitcoin Dominance The latest data from TradingView reveals that Bitcoin dominance, defined as Bitcoin&#8217;s share of the total cryptocurrency market capitalization, has hit a high of 49.5%. This level has not been recorded since July 2021 when Bitcoin&#8217;s dominance touched a peak of over 48%. It is worth noting that earlier this year in April, Bitcoin&#8217;s dominance momentarily reached 48.83%, after which it fluctuated within a specific range. Related Reading: BlackRock Inches Closer To Launching Bitcoin ETF: Potential Impact On BTC Price However, the past week saw a notable increase in Bitcoin&#8217;s market dominance, correlating with the time when the US Securities and Exchange Commission (SEC) categorized numerous tokens as unregistered securities in its lawsuits against the world&#8217;s largest crypto exchanges &#8211; Binance and Coinbase. Consequently, many of these tokens such as Cardano (ADA), Solana (SOL), and Binance Coin (BNB) have experienced significant price drops, while Bitcoin&#8217;s value has remained comparatively stable. Market Influences And The Upcoming BTC Halving The regulatory actions by the SEC underscore an environment of uncertainty that has had noticeable effects on the crypto market. Amid this backdrop, Bitcoin emerges as a sort of safe haven. Micheal Saylor, a prominent Bitcoin advocate, echoed these sentiments in a recent interview with Bloomberg, predicting that: &#8220;the entire industry is kind of destined to be rationalized down to Bitcoin and a half a dozen to a dozen other proof-of-work tokens.&#8221; Furthermore, anticipation around the upcoming Bitcoin halving event, slated for April or May 2024, could be a contributing factor to Bitcoin&#8217;s increasing dominance. This quadrennial event reduces the reward for mining new Bitcoin blocks by half, effectively slowing the rate at which new Bitcoins are created to manage inflation and maintain their scarcity. The impending halving will result in a block reward decrease from 6.25 bitcoins to 3.125 bitcoins. Related Reading: Bitcoin Price On Shaky Ground: Market Analysts Warn Of Potential Fall To $20,000 Level Notably, BTC has been in a downward trend in the past week. The largest crypto asset by market capitalization has recorded a bearish movement falling by nearly 5% in the past 7 days. However, over the past 24 hours, BTC has picked up an uptrend, seeing a 2.3% gain in its value. Bitcoin currently has a market price of $25,515, at the time of writing after initially trading below that price range earlier this week. Meanwhile, Bitcoin’s trading volume has plunged over the past 24 hours from over $15 billion on Thursday to $7.7 billion at the time of writing indicating less trading activity. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-16T13:22:00.000Z",
    "title": "Binance Faces French Probe Over Suspected Money Laundering",
    "url": "https://coinedition.com/binance-faces-french-probe-over-suspected-money-laundering/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/binance7-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/binance7-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/binance7-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/binance7.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>French news platform Le Monde reported on June 16 that the French authorities are currently conducting an investigation into the world’s leading crypto exchange Binance’s French subsidiary due to allegations of providing digital asset services in violation of the law and engaging in acts of intensified money laundering. According to Paris&#8217; public prosecution office, allegations [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binance-faces-french-probe-over-suspected-money-laundering/\">Binance Faces French Probe Over Suspected Money Laundering</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]