[
  {
    "source": "CoinDesk",
    "date": "2023-08-09T16:27:08.000Z",
    "title": "As Curve Averts DeFi Death Spiral, Fiasco Exposes Serious Risks",
    "url": "https://www.coindesk.com/tech/2023/08/09/as-curve-averts-defi-death-spiral-fiasco-exposes-serious-risks/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Curve, a leading decentralized exchange on Ethereum, was hacked for $70 million in July. Questions continue to linger around the platform's long-term viability and potential contagion risk."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-09T16:32:14.000Z",
    "title": "Amazon Is Giving Away Free Gaming NFTs—Here's How to Claim",
    "url": "https://decrypt.co/151872/amazon-giving-away-free-gaming-nfts-how-claim",
    "description": "Amazon Prime subscribers can grab free in-game NFTs for games like Mojo Melee and Blankos Block Party. Here’s what you can get right now."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-09T16:17:41.000Z",
    "title": "Coinbase Ethereum L2 Launches Mainnet With $142M Already on Its Network",
    "url": "https://decrypt.co/151870/coinbase-ethereum-l2-launches-mainnet-with-142m-already-on-its-network",
    "description": "The company says it has no plans to launch a native token on Base, and will prioritize supporting network-native developers. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-09T16:30:00.000Z",
    "title": "Binance drops majority of USD Coin reserves — Latest USDC news",
    "url": "https://cointelegraph.com/news/binance-drops-majority-of-usd-coin-reserves-latest-usdc-news",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/3f1b8864-2ac1-4717-bccd-b013e77f4000.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This week’s episode of The Market Report explores the reasons why Binance let go of a majority of its USDC reserves and what it replaced them with.</p>\n                    <p><p>In the most recent episode of <em>The Market Report</em>, analyst and writer Marcel Pechman delves into the topic of <a href=\"https://cointelegraph.com/news/binance-sold-usdc-for-btc-eth-silvergate-collapse\">crypto exchange Binance’s proof-of-reserves</a>. This report reveals a significant decline in USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) balances, plummeting from $3.4 billion on March 1 to a mere $23.9 million by May 1. </p><p>According to insights from on-chain analyst Aleksandar Djakovic, this decline signifies that Binance utilized the $3.4 billion to procure 100,000 Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and 550,000 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) during that period, totaling approximately $3.5 billion. The central question, as posed by Pechman, revolves around whether this investment was initiated by Binance users, thereby distancing Binance CEO Changpeng Zhao and the company from direct involvement.</p><p>Pechman disagrees with this conjecture, although he does acknowledge the possibility of the exchange accessing a portion of its USDC reserved for margin or derivatives trades. Nevertheless, he finds the notion of depleting the entire balance without client awareness or impacting the exchange’s day-to-day functions implausible.</p><p>Transitioning to the next segment of the show, Pechman delves into <a href=\"https://cointelegraph.com/news/circle-ceo-usdc-adoption-emerging-developing-markets\">PayPal’s imminent launch of a stablecoin</a>, announced on Aug. 7. This stablecoin, issued by Paxos Trust and built on the Ethereum blockchain, bears striking similarities to USDC and Paxos USD (USDP). Yet, Pechman highlights a distinguishing factor in the integration of the stablecoin with PayPal and Venmo.</p><p>Ultimately, Pechman concludes that there is no discernible benefit for end users in adopting this new stablecoin. Other stablecoins, he points out, offer both yield and a more extensive presence in the decentralized applications market.</p><p>Lastly, Pechman addresses <a href=\"https://cointelegraph.com/magazine/chinas-risky-bitcoin-court-decision-is-huobi-in-trouble-or-not-asia-express/\">the circulating rumors</a><a href=\"https://cointelegraph.com/magazine/chinas-risky-bitcoin-court-decision-is-huobi-in-trouble-or-not-asia-express/\"></a> that Huobi executives within the cryptocurrency realm are facing arrest by Chinese law enforcement. He also raises questions about Tron founder Justin Sun and the peculiar drawdown of Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) reserves from Huobi.</p><p>For further insights into these matters, tune in to the latest episode of <em>The Market Report</em>, an exclusive show available on the newly launched <a href=\"https://www.youtube.com/@cointelegraphmarketresearch\" target=\"_blank\" rel=\"noopener nofollow\">Cointelegraph Markets &amp; Research YouTube channel</a>.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/T3FflVwReRY\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-09T16:20:00.000Z",
    "title": "Maple Finance secures SEC exemption for on-chain Treasury Pools",
    "url": "https://cointelegraph.com/news/maple-finance-secures-sec-exemption-on-chain-treasury-pools",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/d27ba971-c051-49ac-9acf-67bfbabdd557.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Launched in April, the USDC Pools were previously accessible only to non-U.S. accredited investors. </p>\n                    <p><p>Blockchain institutional capital marketplace Maple Finance has secured an exemption from the United States Securities and Exchange Commission (SEC) to offer its one-month U.S. Treasury yields to accredited investors in the U.S.</p><p>Before the Aug. 9 <a href=\"https://www.maple.finance/news/maple-cash-management-opens-to-us-investors/\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>, the Maple Finance Treasury Pools were only available to accredited investors <a href=\"https://cointelegraph.com/news/maple-finance-launches-pool-for-us-treasury-yields\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/maple-finance-launches-pool-for-us-treasury-yields/amp\">outside the U.S.</a> Through the SEC Regulation D Rule 506(c) Exemption, a firm may offer investment products, without prior registration, to individual investors in the U.S. with a net worth exceeding $1 million excluding the value of their primary residence, or with an annual income exceeding $200,000 per year ($300,000 if their spouse is included). A firm may also sell such investment products to accredited U.S. entities, such as banks. </p><p>Data from Maple Finance <a href=\"https://app.maple.finance/#/v2/lend/pool/0xfe119e9c24ab79f1bdd5dd884b86ceea2ee75d92\" target=\"_blank\" rel=\"noopener nofollow\">show</a> that over 21 million USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) have been deposited into its Treasury Pool, which currently holds an annualized yield of 4.76%. No inbound or outbound fees are charged, except for an annualized management fee of 0.50% taken from the yield. </p><p>Developers wrote that \"onboarding takes 15 minutes and Lenders can download monthly interest statements anytime.\" The website states that withdrawals are processed within a maximum of 48 hours. Room40 Capital, an institutional crypto hedge fund founded in 2022, is currently the sole borrower from the pool.</p><p>Room40 Capital said the \"proceeds will be used to purchase and hold short-dated U.S. Treasury bills and reverse repurchase agreements fully collateralized by U.S. Treasury bills only.\" The firm has made 46 payments thus far since the Treasury Pools launched in April, with no late payments.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/defi-faces-stress-test-doj-fears-run-on-binance-hong-kongs-crypto-trading-hodlers-digest-july-30-aug-5/\">DeFi faces stress test, DoJ fears run on Binance, Hong Kong’s crypto trading</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-09T16:14:39.000Z",
    "title": "Microsoft and Aptos Labs partnership sends APT token soaring",
    "url": "https://cryptoslate.com/microsoft-and-aptos-labs-partnership-sends-apt-token-soaring/",
    "description": "<p>Aptos Labs, the developer of layer1 blockchain network Aptos (APT), has partnered with Microsoft to &#8220;unlock Web3,&#8221; according to an Aug. 9 press statement shared with CryptoSlate. The blockchain network stated that the partnership would explore asset tokenization, payments, and Central Bank Digital Currencies (CBDCs). Aptos integrates AI through Microsoft partnership The network also introduced [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/microsoft-and-aptos-labs-partnership-sends-apt-token-soaring/\">Microsoft and Aptos Labs partnership sends APT token soaring</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-09T16:12:23.000Z",
    "title": "13 Russian Banks Will Kickstart Digital Ruble Trial",
    "url": "https://cryptobriefing.com/13-russian-banks-will-kickstart-digital-ruble-trial/?utm_source=feed&utm_medium=rss",
    "description": "Russia's Central Bank forges ahead with its CBDC trials, aiming to gauge the feasibility of its digital currency initiative."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-09T16:33:19.000Z",
    "title": "Introducing TON Space – Self-Custody Wallet in Telegram, Available to Developers Now",
    "url": "https://www.cryptoglobe.com/latest/2023/08/introducing-ton-space-self-custody-wallet-in-telegram-available-to-developers-now/",
    "description": "Dubai, United Arab Emirates, August 9th, 2023, Chainwire Wallet, the TON-based application in Telegram Messenger, announces the launch of TON Space, a new self-custody wallet, that gives users complete control of their digital assets. In tandem with this upcoming product comes the opening of a waitlist for developers to integrate with TON Space in beta.  […]\n"
  },
  {
    "source": "NullTX",
    "date": "2023-08-09T16:38:51.000Z",
    "title": "BTC Battles Introduces Its Decentralized Social Game Built on Polygon",
    "url": "https://nulltx.com/btc-battles-introduces-its-decentralized-social-game-built-on-polygon/",
    "description": "BTC Battles, a new and exciting social game incorporating DeFi, Bitcoin, and prediction elements, proudly presents its decentralized social game, BTC Battles, constructed on the Polygon network. BTC Battles offers a decentralized and transparent gaming experience whereby participants can use their digital wallets. This removes the need to depend on a centralized platform, which should [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-09T16:34:43.000Z",
    "title": "Bitcoin Longs Could Precipitate Plunge To $28,000, This Chart Urges Caution",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-longs-could-precipitate-plunge-to-28000-this-chart-urges-caution/",
    "description": "After a week of moving sideways, the Bitcoin price is finally experiencing some action; bulls are pushing for the most immediate critical resistance. The increasing uncertainty in the macroeconomic landscape supports the spike in price action, but optimist operators might have been too fast at jumping to their positions. Related Reading: Bitcoin Open Interest Hits Peak Since FTX Crash: What It Means As of this writing, Bitcoin trades at $29,700 with sideways movement in the last 24 hours and a 2% profit over the past week. Other cryptocurrencies in the top 10 are experiencing similar price action, but Solana stands out with a 6% profit on similar timeframes. Why Is The Bitcoin Price Up Today, But Could Be Down Tomorrow All eyes are set on tomorrow&#8217;s US Consumer Price Index (CPI) data, the proxy to gauge inflation in this country’s fiat currency. A recent report highlights positive expectations for this event, as most investors expect inflation to continue its decline. This might allow the Federal Reserve (Fed) to slow down on its interest rates hike program, finally giving Bitcoin room to break and flip $30,000 into support. However, the report notes that any surprises could trigger the opposite effect. In this scenario, data from crypto analyst firm The King Fisher shows a concentration of long liquidity sitting between the $27,000 to $29,000 levels. As seen in the chart below, this liquidity could operate as a magnet erasing BTC’s gain and pushing it into support. Conversely, positive CPI data could have little to no impact on BTC, allowing it to continue in its current range. As NewsBTC Related Reading: BlackRock Insiders Give A Timeline For When The First Spot Bitcoin ETF Will Be Approved Analyst Keith Alan from Material Indicators believes Bitcoin bulls are fighting to regain control over the 50-day moving average (MA). While the analyst expects bullish momentum could weaken, a push into the region around $30,200 to $30,000 is likely. Alan stated: That doesn&#8217;t mean we can&#8217;t see a push to the $30.2k &#8211; $30.5k range today. In fact I think there&#8217;s a good chance we could see that, and if we do, I&#8217;ll take some more profit on my scalp. What I&#8217;m watching for is where we close today and were bid liquidity comes in as local support. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-09T16:30:16.000Z",
    "title": "LFi’s Proprietary Development Under CEO Luiz Góes: A New Era for Blockchain Technology",
    "url": "https://www.crypto-news-flash.com/lfis-proprietary-development-under-ceo-luiz-goes-a-new-era-for-blockchain-technology/?utm_source=rss&utm_medium=rss&utm_campaign=lfis-proprietary-development-under-ceo-luiz-goes-a-new-era-for-blockchain-technology",
    "description": "<img width=\"1280\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Luiz-Goes-as-the-new-CEO_2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Luiz-Goes-as-the-new-CEO_2.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Luiz-Goes-as-the-new-CEO_2-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Luiz-Goes-as-the-new-CEO_2-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Luiz-Goes-as-the-new-CEO_2-768x432.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />LFi, a pioneer in the blockchain industry, is excited to share insights from its CEO, Luiz Góes, on the company&#8217;s proprietary development efforts. Góes, a visionary leader with a wealth of experience in technology, is set to lead LFi into the next era of blockchain. Góes&#8217; insights come at a crucial time for LFi, as [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-09T16:27:27.000Z",
    "title": "Solana TVL Soars: Outperforms Ethereum, BSC, and Avalanche with 14% Growth ",
    "url": "https://www.crypto-news-flash.com/solana-tvl-soars-outperforms-ethereum-bsc-and-avalanche-with-14-growth/?utm_source=rss&utm_medium=rss&utm_campaign=solana-tvl-soars-outperforms-ethereum-bsc-and-avalanche-with-14-growth",
    "description": "<img width=\"1043\" height=\"575\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/Solana.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Anatoly Yakovenko, the co-founder of Solana Labs, believes that using Ethereum (ETH) as a layer-2 solution for the Solana (SOL) blockchain is a viable concept, despite some limitations and potential risks.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/Solana.jpg 1043w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/Solana-300x165.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/Solana-1024x565.jpg 1024w\" sizes=\"(max-width: 1043px) 100vw, 1043px\" />Solana outperforms the likes of Ethereum and Binance Smart Chain in Total Value Lock (TVL) while maintaining 100 percent average uptime for six straight months.  Its active user count has, however, declined by 5 percent in the last 30 days.  Solana (SOL) makes incredible progress in the crypto-sphere as its network activities boom and outperform [...]"
  }
]