[
  {
    "source": "CoinDesk",
    "date": "2023-11-28T20:13:41.000Z",
    "title": "Everyone Needs a Manifesto",
    "url": "https://www.coindesk.com/consensus-magazine/2023/11/28/everyone-needs-a-manifesto/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Vitalik Buterin thoughtful musings on techno-optimism contrast with VC Marc Andreessen’s recent writings."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-28T20:13:06.000Z",
    "title": "Starfield Isn't Actually Boring, Game Maker Weirdly Explains in User Review Comments",
    "url": "https://decrypt.co/207731/starfield-isnt-actually-boring-game-maker-weirdly-explains-user-review-comments",
    "description": "Bethesda has been responding to negative Steam reviews—mostly by telling players they should keep playing if they’re bored."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-28T20:14:25.000Z",
    "title": "Why is Solana (SOL) price up this week?",
    "url": "http://cointelegraph.com/news/why-is-solana-price-up-this-week",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/0b986869-aaa2-4d6f-9d16-77548e4b8e70.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Increased activity in Solana’s NFT markets and decentralized applications are pushing SOL price back toward year-to-date highs.</p>\n                    <p><p>Solana's native token (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) made significant gains of 5.5% on Nov. 28, trading at $58. This increase followed a retest of the $54 support level on Nov. 27. While some attribute SOL's rise to the broader cryptocurrency market's performance amid a deteriorating macroeconomic environment, the Solana network and its ecosystem have also played a crucial role in driving the price upswing.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/ccf4b845-d156-496c-9aa3-01683a382f67.png\"  /><figcaption style=\"text-align: center;\"><em>U.S. Dollar Strength Index (DXY). Source: TradingView</em></figcaption></figure><p>On Nov. 28, the U.S. Dollar Strength Index (DXY), which measures the U.S. dollar against major fiat currencies, hit a three-month low. Investors are increasingly betting that the U.S. Federal Reserve (Fed) will cease raising interest rates, exerting downward pressure on the domestic currency. This sentiment has led fixed-income investors to seek higher yields abroad, resulting in selling pressure on the U.S. dollar.</p><p>Additionally, the price of gold surged by 1.5% to $2,043, reaching a six-month high, as U.S. Treasury yields declined. With the Fed signaling a forthcoming decline in interest rates, fixed-income investments are expected to yield lower returns. This has created an environment conducive to risk-taking and hedging positions, especially if inflation remains above the long-term target of 2%, favoring both gold and cryptocurrencies.</p><h2>Solana's gains can be explained by its competitive advantage</h2><p>SOL's momentum has surged, particularly as it competes with Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), which is grappling with high transaction fees averaging above $7 per transaction over the past two weeks. In contrast, the average non-voting transaction on Solana costs only $0.003, making it a more favorable choice for various applications, including gaming, social networks, gambling, NFT launches, and collectibles.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/1319e9e2-0ea7-40ab-b075-da69db3966c9.png\"  /><figcaption style=\"text-align: center;\"><em>Top blockchains by DApps activity, 7-day change. Source: DappRadar</em></figcaption></figure><p>During the past seven days, Solana saw a 10% increase in active addresses and a 9% rise in decentralized application (DApp) volume, while Ethereum faced a 21% decrease in volume. Additionally, the second-ranking BNB Chain experienced a 2% drop in volume. As a result, Solana emerged as the top-performing blockchain among the top 10 in terms of DApp activity gains.</p><p>Furthermore, Solana's NFT activity surged by 35% in the past week, amounting to $24.5 million in sales, as reported by CryptoSlam. Despite the overall decline of 34% in global NFT volumes across all blockchains, Solana witnessed a 90% increase in the number of unique buyers during the same period. Notable highlights among Solana's NFT markets included the Mad Lads, Tensorians and Claynosaurz collections.</p><h2>Challenges include FTX and the lack of open-source projects</h2><p>In September, SOL's price faced downward pressure as investors worried about a potential sell-off resulting from the <a href=\"https://cointelegraph.com/news/solana-price-down-amid-ftx-liquidation-fears\">liquidation of FTX bankruptcy assets</a>, which included over $600 million worth of SOL tokens. However, these concerns eased when it became apparent that most of these assets were locked up in vesting periods or staking, and the FTX estate's digital asset sales were initially limited to $100 million per week, excluding Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether.</p><p>Moreover, a significant shift occurred within the Solana ecosystem as Code, a Solana-based crypto wallet, adopted the MIT License for its entire codebase. This open-source approach allows users to freely copy, modify, and distribute the code without restrictions. Code was founded by the same team behind the Canadian messaging app Kik.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/why-is-bitcoin-price-up-today\">Why is Bitcoin price up today?</a></em></strong></p><p>In short, while favorable macroeconomic conditions have contributed to the recent surge in SOL token value, it is crucial to recognize that increased activity in Solana's NFT and DApps has played a significant role. In contrast to competitors grappling with high transaction costs and regulatory uncertainties, Solana is well-positioned for continued growth.</p><p>With the network boasting over 40,000 <a href=\"https://dappradar.com/rankings/protocol/solana?range=7d\" target=\"_blank\" rel=\"noopener nofollow\">active</a> addresses in the top six DApps over the last seven days, including Rarible, Jupiter Exchange, MeanFi, Raydium, and Magic Eden, SOL may have the potential to surpass its Nov. 16 high of $65, representing a $27.5 billion capitalization. In comparison, only two DApps on Ethereum, Uniswap and the newly launched Blast, achieved similar levels of activity during the same period.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-28T20:20:29.000Z",
    "title": "Bitcoin Surges Above $38,000 After Dovish Comments About US Inflation From Fed Governor Chris Waller",
    "url": "https://www.cryptoglobe.com/latest/2023/11/bitcoin-surges-above-38000-after-dovish-comments-about-us-inflation-from-fed-governor-chris-waller/",
    "description": "Christopher J. Waller has been a pivotal figure in the Federal Reserve System since his appointment as a Board of Governors member on 18 December 2020. His term is set to conclude on 31 January 2030. Waller’s journey to this influential position began with his tenure as executive vice president and director of research at […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-28T20:30:29.000Z",
    "title": "Study Reveals Bitcoin Mining as a Catalyst for Renewable Energy Growth and Flexible Load Systems",
    "url": "https://news.bitcoin.com/study-reveals-bitcoin-mining-as-a-catalyst-for-renewable-energy-growth-and-flexible-load-systems/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/study-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Study Reveals Bitcoin Mining as a Catalyst for Renewable Energy Growth and Flexible Load Systems\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/study-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/study-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/study-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/study-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/study-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/study-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/study.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A recently published working paper, collaboratively authored by industry experts, examines the critical influence of bitcoin mining in promoting worldwide clean energy efforts and stabilizing electricity grids. This paper probes into the utility of mining as a flexible and versatile instrument for large-scale demand response in industries and harnessing unused energy resources. Working Paper Highlights [&#8230;]"
  }
]