[
  {
    "source": "CoinDesk",
    "date": "2023-08-08T15:52:31.000Z",
    "title": "Brevan Howard Backs Crypto Infrastructure Startup Puffer in $5.5M Round",
    "url": "https://www.coindesk.com/business/2023/08/08/brevan-howard-backs-crypto-infrastructure-startup-puffer-in-55m-round/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The seed round for the liquid staking startup was co-led by Lemniscap and Lightspeed Faction."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-08T16:01:02.000Z",
    "title": "Coinbase Layer-2 Chain Base Taps Chainlink Ahead of Mainnet Launch",
    "url": "https://decrypt.co/151738/coinbase-layer-2-chain-base-taps-chainlink-ahead-mainnet-launch",
    "description": "Base is integrates Chainlink's price feeds to simplify integrating popular DeFi applications on the new blockchain."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-08T16:07:00.000Z",
    "title": "Can Cardano whales stop ADA price from falling 20%? ",
    "url": "https://cointelegraph.com/news/cardano-whales-ada-price-analysis-down-20",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/dc1bd311-f771-4ac6-abc0-11e5069e613a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The number of Cardano's richest investors holding ADA has surged to its highest level in almost a year.</p>\n                    <p><p>The price of Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) risks falling by over 20% in August as it enters a breakdown stage of a classic technical pattern that could be offset by some promising fundamentals. </p><h2>ADA price risks falling to June lows</h2><p>Dubbed <a href=\"https://cointelegraph.com/news/bitcoin-to-100k-next-analyst-eyes-textbook-perfect-btc-price-move\">Bump-and-Run-Reversal</a> (BARR), the pattern develops when excessive speculation drives the prices higher quickly, eventually leading to a \"bull trap\" situation. As it forms, the price trend undergoes three stages — Lead-in, Bump, and Run — as shown below.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/2ebf67ff-d72d-437d-823a-737814d624e1.png\"  /><figcaption style=\"text-align: center;\"><em>Bump-and-Run-Reversal illustration. Source: Warrior Trading</em></figcaption></figure><p>The Lead-in stage sees the price trending upward in an orderly fashion — without any excess speculation. But the Bump stage witnesses a sharp advance in prices, followed by a complete wipeout of the spike.</p><p>In the Run stage, the price breaks below the support from the Lead-in trendline. Currently, Cardano appears to have entered the Run phase of its BARR pattern, as shown below.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/532ab67f-14f5-4b1c-89c3-cb6afd056e37.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USD daily price chart. Source: TradingView</em></figcaption></figure><p>If the pattern is confirmed, BARR's downside target is measured after subtracting the breakdown point at the support line from the pattern's maximum height. That brings ADA's price target near $0.22 in August or early September, down 20% from current levels.</p><p>Conversely, an ADA rebound can reach the 50-day exponential moving average (50-day EMA; the red wave in the chart below) near $0.30 in August, up 5% from the current prices.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/4255f974-d10a-47b9-95b2-c35554e68076.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USD daily price chart. Source: TradingView</em></figcaption></figure><p>Furthermore, flipping the wave into support could see a further run-up toward the 200-day EMA (the blue wave) near $0.34, up around 30% from current price levels.</p><h2>Whales and sharks buy ADA price dips</h2><p>On-chain fundamentals, however, could offset the bearish risks for Cardano.</p><p>Notably, whale and shark wallets holding between 100,000 and 1 million ADA have accumulated $116.1 million worth of Cardano since May 2023, raising their net holdings to the highest levels since September 2022.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/c56d4b52-d1e3-4c1f-9a3a-ae406c72108c.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Cardano whales and shark accumulation in recent months. Source: Santiment</em></figcaption></figure><p>This period of Cardano accumulation coincides with its <a href=\"https://cointelegraph.com/news/cardano-worst-week-may-2021-ada-price-rebound-40\">25% price decline</a> caused by regulatory fears in the United States. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Here’s what happened in crypto today</a></em></strong></p><p>Simply put, ADA whales and sharks have bought the price dip, and are betting on future gains.</p><h2>Cardano TVL, dapp transactions grow</h2><p>Additionally, the ADA accumulation period happened alongside growth in Cardano's key network metrics in the second quarter. Namely, the total-value-locked (TVL) grew 9.7% quarter-on-quarter (QoQ), while average daily dapp transactions jumped 49% QoQ.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/e59adbda-08f9-4669-889f-a58bac3d3079.png\"  /><figcaption style=\"text-align: center;\"><em>Cardano TVL denominated in the U.S. dollar and ADA. Source: Messari</em></figcaption></figure><p><a href=\"https://cointelegraph.com/learn/stablecoins-101-what-are-crypto-stablecoins-and-how-do-they-work\">Stablecoins</a> fueled this TVL and dapp transactions, growing 34.9% QoQ — from $10.0 million in Q1 to $13.5 million in Q2. This growth in network activity should add to the upward pressure for ADA, which serves as a fee settlement and staking token in the Cardano ecosystem. </p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-08T16:00:40.000Z",
    "title": "Long-term HODLers rule Bitcoin landscape amid strategic cling to value despite price swings",
    "url": "https://cryptoslate.com/insights/long-term-hodlers-rule-bitcoin-landscape-amid-strategic-cling-to-value-despite-price-swings/",
    "description": "<p>Quick Take The landscape of Bitcoin ownership is experiencing an unprecedented shift as the divergence between long-term and short-term hodlers reaches a historical high. Currently, the Bitcoin market is overwhelmingly dominated by long-term hodlers, with 13.3 million entities that have held Bitcoin for a year or more. Contrarily, short-term hodlers, those who have held Bitcoin [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/long-term-hodlers-rule-bitcoin-landscape-amid-strategic-cling-to-value-despite-price-swings/\">Long-term HODLers rule Bitcoin landscape amid strategic cling to value despite price swings</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-08T15:40:53.000Z",
    "title": "DeFi Protocol Dolomite Unveils Zap: A Breakthrough Collateral Solution for Arbitrum Users",
    "url": "https://cryptobriefing.com/defi-protocol-dolomite-unveils-zap/?utm_source=feed&utm_medium=rss",
    "description": "DeFi lending protocol Dolomite launches Zap, a new one-step collateral feature, simplifying the lending process on the Arbitrum network."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-08T16:00:08.000Z",
    "title": "Biggest Movers: LINK, SOL Extend Gains, as Crypto Momentum Begins to Shift",
    "url": "https://news.bitcoin.com/biggest-movers-link-sol-extend-gains-as-crypto-momentum-begins-to-shift/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2137989923-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers: LINK, SOL Extends Gains, as Crypto Momentum Begins to Shift\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2137989923-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2137989923-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2137989923-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2137989923-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2137989923-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2137989923-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2137989923.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Chainlink surged by nearly 4% during Tuesday’s session, as the token moved towards a one-week high. The move came as cryptocurrencies rebounded, following a slow start to the week. Solana was another big mover, as it headed towards the $24.00 level. Chainlink (LINK) Chainlink (LINK) was one of Tuesday’s biggest movers, as price surged by [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T16:08:10.000Z",
    "title": "Brazil’s central bank announces the official name of its digital currency",
    "url": "https://www.cryptopolitan.com/brazils-announces-official-name-of-cbdc/",
    "description": "Brazil’s central bank has officially named its new central bank digital currency (CBDC) “DREX,” short for “digital real.” The announcement came during a live broadcast on the Central Bank of Brazil’s YouTube channel. The name is a fusion of “digital,” “real,” “electronic,” and “transaction,” signifying the innovative elements of the currency. DREX’s launch builds on ... <a title=\"Brazil’s central bank announces the official name of its digital currency\" class=\"read-more\" href=\"https://www.cryptopolitan.com/brazils-announces-official-name-of-cbdc/\" aria-label=\"More on Brazil’s central bank announces the official name of its digital currency\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T16:03:05.000Z",
    "title": "Organizations Worldwide Contemplate Bans on Generative AI Applications, BlackBerry Research Finds",
    "url": "https://www.cryptopolitan.com/organizations-on-generative-ai-applications/",
    "description": "In a recent study conducted by BlackBerry Limited, a renowned leader in cybersecurity solutions, it was unveiled that a staggering 75% of organizations globally are in the process of implementing or deliberating the imposition of bans on Generative AI applications, including the widely used ChatGPT, within their workplace environments. This research brings to light the ... <a title=\"Organizations Worldwide Contemplate Bans on Generative AI Applications, BlackBerry Research Finds\" class=\"read-more\" href=\"https://www.cryptopolitan.com/organizations-on-generative-ai-applications/\" aria-label=\"More on Organizations Worldwide Contemplate Bans on Generative AI Applications, BlackBerry Research Finds\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T15:56:00.000Z",
    "title": "PayPal stablecoin launch births wave of fake copycats",
    "url": "https://www.cryptopolitan.com/paypal-stablecoin-launch-birth-fake-copycats/",
    "description": "In the wake of PayPal’s recent unveiling of its PYUSD stablecoin, the cryptocurrency space has witnessed a flurry of opportunistic ventures, speculative traders, and potential scams attempting to ride the coattails of the new digital currency. According to data sourced from DEX Screener, a decentralized exchange scanner, a surge of approximately 30 new token pairs ... <a title=\"PayPal stablecoin launch births wave of fake copycats\" class=\"read-more\" href=\"https://www.cryptopolitan.com/paypal-stablecoin-launch-birth-fake-copycats/\" aria-label=\"More on PayPal stablecoin launch births wave of fake copycats\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T15:48:18.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-08-08T15:57:04.000Z",
    "title": "Binance Becomes El Salvador’s First Fully Licensed Crypto Exchange",
    "url": "https://nulltx.com/binance-becomes-el-salvadors-first-fully-licensed-crypto-exchange/",
    "description": "Binance, the world&#8217;s largest cryptocurrency exchange, has become the first fully licensed crypto exchange in El Salvador. This is a major milestone for Binance and for the adoption of cryptocurrency in El Salvador. El Salvador made history in 2021 when it became the first country in the world to adopt Bitcoin as legal tender. The [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-08T16:07:26.000Z",
    "title": "Circle CEO reveals massive USDC adoption outside US",
    "url": "https://crypto.news/circle-ceo-reveals-massive-usdc-adoption-outside-us/",
    "description": "Circle&#8217;s CEO, Jeremy Allaire, unveiled that approximately 70% of USDC adoption occurs outside the United States.  Despite the perception that USDC primarily caters to the US market, emerging economies and developing regions emerge as strongholds for this stablecoin. Allaire stated&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-08T16:05:35.000Z",
    "title": "Is Curve DAO (CRV) Price On Track To Reach Or Exceed $1 This Month?",
    "url": "https://www.newsbtc.com/all/is-curve-dao-crv-price-on-track-to-reach-or-exceed-1-this-month/",
    "description": "Curve DAO (CRV) encountered notable obstacles in reestablishing its market equilibrium subsequent to a recent breach in its network security. After a network intrusion that jeopardized a portion of Curve DAO&#8217;s (CRV) smart contracts and caused a monetary setback of $50 million, the value plummeted drastically. This occurrence prompted numerous investors to bet against their CRV tokens, exacerbating the downward pressure on its valuation. Based on a recent analysis of the price trends, the value of Curve DAO experienced a favorable support level close to the $0.56 threshold. On August 1st, there was an instance of rejection for the lower price, indicating that buyers are accumulating at this reduced price point. Anticipated Curve DAO (CRV) Price Movement In the face of ongoing security concerns, a separate analysis anticipates a substantial 42.1% surge in CRV&#8217;s price, propelling it to $0.81 once the security issues are effectively addressed and resolved. Conversely, contrasting predictions foresee a potential 15.7% decline, bringing the value down to $0.48. This shift in sentiment is attributed to a significant number of investors diverting their attention toward competing options within the CRV ecosystem. Related Reading: Can Litecoin Bulls Turn The Tide On Recent Declines? A Closer Look Examining the daily chart, a notable trend emerges as the CRV price experiences its second reversal from a horizontal support level, indicative of the emergence of a double bottom pattern. Presently, this bullish reversal has facilitated an 8% upsurge, driving the price to its current value of $0.614. CRV market cap at $525 million on the daily chart: TradingView.com Within the framework of the double bottom pattern, an expectation arises for buyers to steer the prices upwards by 20%, seeking to challenge the upper trendline of the channel pattern. The true confirmation of a trend reversal lies in a bullish breakout from this resistance level, which would fortify the validity of the emerging pattern. A Potential Trend Reversal The double bottom pattern is a technical chart pattern observed in financial markets, characterized by two consecutive troughs forming near a common horizontal support level. Related Reading: PEPE’s Future: Will Prices Of Meme Coins Continue To Drop? This pattern suggests a potential trend reversal from a downtrend to an uptrend, as the initial downtrend exhausts itself and buyers regain control, leading to a bullish breakout when the price surpasses the pattern&#8217;s resistance level. Should the CRV breakout materialize, a subsequent rally could ensue, targeting an initial goal of approximately $0.08. Following this milestone, a subsequent price objective of $1.1 might come into play, underscoring the potential magnitude of the trend reversal that the double bottom pattern could potentially signify. CRV price action. Source: Coingecko With a CoinGecko listing of $0.603, the price of CRV demonstrated a 2% decline over the past 24 hours, while it managed a 1.7% increase over the last seven days. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from CCN.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-08T16:00:24.000Z",
    "title": "DigiToads Trumps AAVE, TOADS Huge Demand In Presale a Bullish Force To Reckon With",
    "url": "https://www.crypto-news-flash.com/digitoads-trumps-aave-toads-huge-demand-in-presale-a-bullish-force-to-reckon-with/?utm_source=rss&utm_medium=rss&utm_campaign=digitoads-trumps-aave-toads-huge-demand-in-presale-a-bullish-force-to-reckon-with",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-08T095313.849.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-08T095313.849.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-08T095313.849-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-08T095313.849-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the realm of cryptocurrency, a noticeable shift in the tide has emerged, with DigiToads (TOADS) boldly overshadowing AAVE, a DeFi giant, as market dynamics undergo a transformation. AAVE has witnessed a substantial decline in recent times, with its value plummeting to $63.4, marking a significant 25% contraction over the span of one month. There [...]"
  }
]