[
  {
    "source": "Cryptopolitan",
    "date": "2024-03-21T02:30:34.000Z",
    "title": "What Positive Impacts Might Audio Deepfakes Have Beyond Deceptive Practices?",
    "url": "https://www.cryptopolitan.com/positive-impacts-might-audio-deepfakes-have/",
    "description": "In the realm of emerging technologies, audio deepfakes have captured attention, not only for their potential to deceive but also for the untapped opportunities they present. In recent discourse surrounding the topic, concerns about fraudulent activities and misinformation have dominated headlines. However, amidst these apprehensions lies a nuanced narrative—one that highlights the bright side of [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-21T02:30:22.000Z",
    "title": "Solana Whale Makes Massive 1,000,000 SOL Deposit To Binance, Bearish Sign?",
    "url": "https://www.newsbtc.com/news/solana/solana-whale-1000000-sol-binance-bearish/",
    "description": "On-chain data shows a Solana whale has just moved a massive SOL stack to Binance, which could prove to be bearish for the asset&#8217;s price. Solana Whale Has Deposited 1 Million SOL To Binance Today According to data from the cryptocurrency transaction tracker service Whale Alert, several large SOL transactions have occurred on the blockchain during the past day. More specifically, six massive transfers have been spotted on the network. Out of these, two transactions were gigantic, with tokens worth $362 million and $498 million involved. Related Reading: Santiment Reveals Best Altcoins Currently In “Opportunity Zone” These extraordinary transfers, though, were both between unknown wallets. Addresses like these are those unattached to any known centralized exchange, so they are usually the users&#8217; personal, self-custodial wallets. Due to this, transfers between unknown wallets are generally hard to say anything about. Often, they can be as simple as the investor moving to a fresh wallet, which is naturally of no particular consequence for the wider market. The other four whale transactions from the past day, however, did involve central entities on one end, so speculation around them can have a bit more ground to stand on. Out of these four, one transaction in particular stands out. In this move, a whale shifted 1 million SOL on the network, worth more than $166 million at the transfer time. Below are some additional details regarding this transfer. Looks like this massive move only required a negligible fee of 0.000005 SOL to go through &#124; Source: Whale Alert As is visible, the receiver in the case of this transaction was a wallet affiliated with the cryptocurrency exchange Binance, implying that the whale transferred coins from their address to the platform. Such transactions are known as exchange inflows. Users make these transfers when they want to use one of the exchange services, which can include selling. As such, exchange inflows may sometimes be bearish for the cryptocurrency. In particular, massive inflows made by the whales can exert some visible fluctuations on the market. Just like this huge SOL transfer, the other three transactions mentioned before were also exchange inflows. They were significantly smaller in scale, though, with their average value being $33.2 million. Two of these transactions also went to Binance, while the third (and the latest) headed to Coinbase. Interestingly, the address pairs in these two Binance transfers were the same, hinting that the same whale may have been responsible for them. With the four exchange inflows, Solana, worth $265.6 million, has now found its way to exchanges. This is clearly a notable amount, so it may impact the asset&#8217;s price. Related Reading: Bitcoin Plunges Under $63,000, Here’s Where Next On-Chain Support Is There is no guarantee, however, that any of the whales involved made these transactions for selling; it&#8217;s possible that they made the moves for some other purpose that&#8217;s not directly relevant to the market. Although Solana has been sliding off over the past few days, the possibility of these whales deciding to exit certainly exists. SOL Price Following the recent drawdown Solana has seen, the asset&#8217;s price has come down to the $174 level. The price of the asset appears to have gone through some drawdown recently &#124; Source: SOLUSD on TradingView Featured image from Rod Long on Unsplash.com, chart from TradingView.com"
  }
]