[
  {
    "source": "CoinDesk",
    "date": "2023-06-08T11:01:48.000Z",
    "title": "Bitcoin Traders Shrug Off U.S. SEC's Action Against Binance, Coinbase",
    "url": "https://www.coindesk.com/markets/2023/06/08/bitcoin-traders-shrug-off-us-secs-action-against-binance-and-coinbase/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Implied volatility metrics show no signs of panic after the SEC's filed lawsuits against the two cryptocurrency exchanges."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-08T10:53:49.000Z",
    "title": "SEC Chair Gensler Offered to Serve as Binance Advisor in 2019, Lawyers Claim",
    "url": "https://decrypt.co/143805/sec-chair-gensler-offered-to-serve-as-binance-advisor-in-2019-lawyers-claim",
    "description": "Documents filed as part of the ongoing court case between the SEC and Binance allege that Gary Gensler and Changpeng Zhao have history."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T10:58:36.000Z",
    "title": "SEC is killing innovation in United States - 1inch co-founder",
    "url": "https://cointelegraph.com/news/sec-is-killing-innovation-in-united-states-1inch-co-founder",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/c86ea1eb-53f4-4806-a1ca-41afab7cfe3c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>American-based Web3 companies and cryptocurrency exchanges could be pushed to move offshore following enforcement actions against Coinbase and Binance.US. </p>\n                    <p><p>The United States could run the risk of an exodus of major Web3 and cryptocurrency service providers as the Securities and Exchange Commission (SEC) takes action <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">against Coinbase</a> and <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">Binance.</a></p><p>Sergej Kunz, co-founder of decentralized finance (DeFi) protocol 1inch Network, believes the SEC’s enforcement action against the two centralized exchanges could have a negative effect on the growth of Web3 in the U.S.</p><p><a href=\"https://cointelegraph.com/news/sec-lawsuit-binance-coinbase-crypto-industry-comments\"><strong><em>Related: SEC lawsuits against Binance and Coinbase unify the crypto industry</em></strong></a></p><p>Speaking to Cointelegraph during Money 20/20 in Amsterdam, which has long been a popular global fintech event focused on payments and financial service providers, Kunz highlighted his belief that regulatory uncertainty in the U.S. could hurt the industry:</p><blockquote>“I would say the same as Brian Armstrong. It's killing innovation in the U.S. All the companies there are thinking of moving to another country.”</blockquote><p>Kunz added that he had witnessed Coinbase's CEO holding talks with United Arab Emirates delegates earlier this year exploring the possibility of setting up shop in the Middle East. Within a few weeks, news broke that Coinbase is indeed<a href=\"https://cointelegraph.com/news/coinbase-execs-visit-uae-to-test-potential-of-strategic-hub-for-international-operations\"> looking to establish a base of operations in the UAE</a>.</p><p>Events in the <a href=\"https://cointelegraph.com/news/sec-labels-61-cryptocurrencies-securities-after-binance-suit\">U.S this week are a stark contrast</a> to the experience at Money 20/20, where a plethora of household names in TradFi were interspersed with a handful of companies and service providers from the cryptocurrency and DeFi ecosystem including Ripple and USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) issuer Circle.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/766d5eda-1c48-41eb-b1e3-7cef7e9ab303.jpg\"  /><figcaption style=\"text-align: center;\">Cointelegraph's Gareth Jenkinson alongside 1inch Network co-founder Sergej Kunz at Money 20/20 in Amsterdam.</figcaption></figure><p>1inch Network, which has established itself as a notable DeFi aggregation protocol, also had a booth setup near the main entrance to the event. The company’s presence in the midst of so many TradFi players seems indicative of the latter’s growing interest in Web3.</p><p>Europe’s move to create solid regulatory standards for the cryptocurrency ecosystem <a href=\"https://cointelegraph.com/news/eu-council-approves-mica-regulations\">through the establishment</a> of the Markets in Crypto-Assets (MiCA) legislation is in stark contrast to the lack thereof across the Atlantic, where Web3 firms and proponents continue to <a href=\"https://cointelegraph.com/news/in-the-us-targeted-crypto-legislation-could-start-the-ball-rolling\">plead for more regulatory clarity.</a></p><p><a href=\"https://cointelegraph.com/news/3-takeaways-from-the-european-union-s-mica-regulations\"><strong><em>Related: 3 takeaways from the European Union's MiCA regulation</em></strong></a></p><p>Kunz said that while MiCA pertains more specifically to centralized exchanges, efforts to create frameworks for businesses to offer products and services across the continent have been positive for the wider Web3 ecosystem</p><p>He also revealed that countries like Switzerland and the UAE have adopted an open-minded, ‘how can we help’ approach that has put them far ahead of the likes of the U.S when it comes to DeFi considerations:</p><blockquote>“They say, ‘how we can help you’? If you have something that adds value, we can change the framework.”</blockquote><p>Kunz said that a major stumbling block for regulators is understanding how smart contracts and settlements work on blockchain systems. Players like 1inch have been communicating with key players in the Middle East to adjust regulatory frameworks pertaining to DeFi-related products and services.</p><blockquote>\"When I do a keynote I try to explain what is DeFi and Web3? How the settlement on smart contracts is more efficient than centralized settlement.\"</blockquote><p>Kunz added that events like the collapse of FTX are indicative of the risk of trusting a centralized party to hold their money or assets. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\">Crypto regulation: Does SEC Chair Gary Gensler have the final say?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-08T10:40:01.000Z",
    "title": "A big move is coming soon, according to Swissblock",
    "url": "https://cryptoslate.com/insights/a-big-move-is-coming-soon-according-to-swissblock/",
    "description": "<p>Quick Take Swissblock suggests that a big move is coming across the board due to historic lows in the VIX and BVOL. The VIX is an index representing the market&#8217;s expectation for volatility, which is currently priced at 14, which is at multi-year lows. However, the BVOL, the Bitcoin volatility index, is also at 14 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/a-big-move-is-coming-soon-according-to-swissblock/\">A big move is coming soon, according to Swissblock</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-08T10:47:26.000Z",
    "title": "Bitcoin (BTC) Price Watch: Daily Technical Analysis (BTC-USD) for 8 June 2023",
    "url": "https://www.cryptoglobe.com/latest/2023/06/bitcoin-btc-price-watch-daily-technical-analysis-btc-usd-for-8-june-2023/",
    "description": "Introduction In this daily technical analysis report, we will examine key indicators and interpret their values to provide insights into Bitcoin’s potential price targets. Current Price: $26,397.10 (as of 10:41 a.m. UTC on 8 June 2023) Technical Indicators Being Used Moving Averages: Moving averages help identify trends by smoothing out price fluctuations. The 5-day moving […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-08T10:55:00.000Z",
    "title": "US Judge Throws Out Lawsuit Against DeFi Startup PoolTogether",
    "url": "https://cryptodaily.co.uk/2023/06/us-judge-throws-out-lawsuit-against-defi-startup-pooltogether",
    "description": "<p>A federal judge has dismissed a lawsuit against PoolTogether, a decentralized finance (DeFi) startup.&nbsp;</p>\n<p>The lawsuit against PoolTogether was filed in 2021 and alleged that the platform operated in a way that allowed users to scam consumers and evade financial regulation.&nbsp;</p>\nLawsuit Against PoolTogether Dismissed&nbsp;\n<p>In the ruling dismissing the lawsuit, Judge Frederic Block stated that the federal court system was not the appropriate platform to air concerns related to PoolTogether and its operations. This means that many watchers who were anticipating how the courts would handle matters related to decentralized finance would likely have to wait longer. The lawsuit, filed in 2021 by software engineer Kent was among the first to turn to the courts to rule on how the law would apply to decentralized finance. The judge stated in the order,&nbsp;</p>\n\n<p>&ldquo;While Kent no doubt has genuine concerns about PoolTogether&mdash;including its legality under New York law&mdash;a suit in federal court is not an appropriate way to address them.&rdquo;</p>\n\n<p>DeFi protocols and applications are designed to be completely anonymous and are governed by a community of token holders instead of the entity or individual that creates them. In the lawsuit, Kent alleged that PoolTogether violated New York State&rsquo;s gambling laws and allowed users to evade financial regulations and scam customers. In the complaint against PoolTogether, Kent stated that the platform was essentially a lottery.</p>\nJudge Refuses To Be Drawn In&nbsp;\n<p>The judge refused to dive into the legal questions raised by the lawsuit, focusing instead on where it belonged. The judge asked Kent&rsquo;s lawyer if the case was better suited to a state court rather than a federal one. Furthermore, the judge&rsquo;s statements during the hearing for arguments over the motion to dismiss the lawsuit suggested he would rule in favor of PoolTogether and its investors.&nbsp;</p>\nPoolTogether Skeptical About Motives&nbsp;\n<p>PoolTogether and its founder, Leighton Cusack, disputed the lawsuit and, in a motion filed in 2022, sought to have Kent&rsquo;s claims dismissed or push him to arbitrate the matter. PoolTogether has also questioned whether Kent could bring in a lawsuit against the company in the first place. The platform and other defendants have also questioned Kent&rsquo;s motives behind the lawsuit, adding that he was not harmed by putting his digital assets. The Judge seemed to agree with these statements, stating that putting funds into PoolTogether was a matter of choice and that it was done willingly by the petitioner.&nbsp;</p>\n<p>However, the judge also seemed to acknowledge the validity of the questions raised in the lawsuit, stating,&nbsp;</p>\n\n<p>&ldquo;We&rsquo;re dealing with the exotic world we live in today. In this whole new area, there are lots of questions that haven&rsquo;t been answered.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-08T11:00:59.000Z",
    "title": "The $GORA Token IDO",
    "url": "https://news.bitcoin.com/the-gora-token-ido/",
    "description": "<img width=\"768\" height=\"434\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/img_20230608_135133_101-768x434.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/img_20230608_135133_101-300x170.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/img_20230608_135133_101-1024x579.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/img_20230608_135133_101-768x434.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/img_20230608_135133_101-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/img_20230608_135133_101-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/img_20230608_135133_101-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/img_20230608_135133_101.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. The highly anticipated $GORA token launch day Initial DEX Offering (IDO) for Goracle has finally arrived. This milestone marks a significant step forward in our journey to revolutionize the ecosystem through blockchain technology with our oracle innovative solution. At the core of our project lies a commitment to provide reliable and trustworthy data [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T11:00:00.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T10:44:51.000Z",
    "title": "Legendary TMS Network (TMSN) Is Dropping XRP (XRP) and Polygon (MATIC) in The Crypto Dirt",
    "url": "https://www.cryptopolitan.com/legendary-tms-network-tmsn-is-dropping-xrp-xrp-and-polygon-matic-in-the-crypto-dirt/",
    "description": "Currently, XRP (XRP), Polygon (MATIC), and other major crypto assets are facing a large amount of regulatory uncertainty due, in part, to the amount of centralization found in these projects. Meanwhile, the TMS Network (TMSN) token presale has been a rousing success, with more than $6 million already raised for the project as it continues ... <a title=\"Legendary TMS Network (TMSN) Is Dropping XRP (XRP) and Polygon (MATIC) in The Crypto Dirt\" class=\"read-more\" href=\"https://www.cryptopolitan.com/legendary-tms-network-tmsn-is-dropping-xrp-xrp-and-polygon-matic-in-the-crypto-dirt/\" aria-label=\"More on Legendary TMS Network (TMSN) Is Dropping XRP (XRP) and Polygon (MATIC) in The Crypto Dirt\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-08T11:00:59.000Z",
    "title": "Dogecoin’s price falls despite a growing number of holders",
    "url": "https://crypto.news/dogecoins-price-falls-despite-a-growing-number-of-holders/",
    "description": "The number of dogecoin (DOGE) holders has constantly been rising since the start of 2023, but the price couldn’t hold to the crucial $0.07 mark with the recent bearish market sentiment. Data provided by Blockchair shows that the number of&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-08T10:40:38.000Z",
    "title": "Do Kwon to face multiple jail terms in South Korea and US",
    "url": "https://crypto.news/do-kwon-to-face-multiple-jail-terms-in-south-korea-and-us/",
    "description": "In a recent interview, prosecutors have raised the possibility of dual jail time for Terraform Labs co-founder as legal complexities arise between the US and South Korea."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-08T11:00:45.000Z",
    "title": "3 Best Cryptocurrency for the June Bull Run",
    "url": "https://www.crypto-news-flash.com/3-best-cryptocurrency-for-the-june-bull-run/?utm_source=rss&utm_medium=rss&utm_campaign=3-best-cryptocurrency-for-the-june-bull-run",
    "description": "<p>The crypto market has been bearish for the majority of 2023. However, investors are getting ready for a potentially bullish June and are looking for suitable investments. Experts believe that the answer lies with Tradecurve (TCRV), Ripple (XRP), and Tron (TRX) as tokens that have shown big promise.  But which one offers the best returns [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/3-best-cryptocurrency-for-the-june-bull-run/\">3 Best Cryptocurrency for the June Bull Run</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-08T11:05:31.000Z",
    "title": "Crypto Lawyer John Deaton Bashes Gary Gensler, Calls Him a Bully",
    "url": "https://coinedition.com/crypto-lawyer-john-deaton-bashes-gary-gensler-calls-him-a-bully/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/John-E.-Deaton-Bashes-Gary-Gensler-Calls-Him-a-Bully-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/John-E.-Deaton-Bashes-Gary-Gensler-Calls-Him-a-Bully-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/John-E.-Deaton-Bashes-Gary-Gensler-Calls-Him-a-Bully-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/John-E.-Deaton-Bashes-Gary-Gensler-Calls-Him-a-Bully.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Prominent attorney and XRP enthusiast John E. Deaton bashed the Securities and Exchange Commission’s (SEC) chair, Gary Gensler, on the latter’s latest crackdown on global cryptocurrency exchanges Binance and Coinbase. The attorney accused Gensler of colluding with Sam Bankman-Fried (SBF), the founder of the bankrupt cryptocurrency exchange FTX, and deliberately granting FTX a regulatory advantage [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-lawyer-john-deaton-bashes-gary-gensler-calls-him-a-bully/\">Crypto Lawyer John Deaton Bashes Gary Gensler, Calls Him a Bully</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-08T10:42:56.000Z",
    "title": "Stablecoin Market Cap Has Steadily Been Decreasing: Report",
    "url": "https://coinedition.com/stablecoin-market-cap-has-steadily-been-decreasing-report/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/The_overall_stablecoin_market_cap_has_steadily_declined_for_about-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/The_overall_stablecoin_market_cap_has_steadily_declined_for_about-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/The_overall_stablecoin_market_cap_has_steadily_declined_for_about-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/The_overall_stablecoin_market_cap_has_steadily_declined_for_about.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Santiment, the blockchain intelligence firm, shared the highlights of their latest Insights report via a tweet published earlier today. According to the post, the overall stablecoin market cap has steadily declined for the past 15 months. However, sharks and whales holding stablecoins are currently holding a higher ratio of the supply. Santiment’s report suggested that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/stablecoin-market-cap-has-steadily-been-decreasing-report/\">Stablecoin Market Cap Has Steadily Been Decreasing: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]