[
  {
    "source": "CoinDesk",
    "date": "2023-08-23T06:23:23.000Z",
    "title": "Australia's CBDC Likely Some Years Away, Central Bank Says",
    "url": "https://www.coindesk.com/policy/2023/08/23/australias-cbdc-likely-some-years-away-central-bank-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Australia will not be making any decision on a central bank digital currency (CBDC) for some years due to several unresolved issues."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-23T06:12:39.000Z",
    "title": "Nearly 90% of Bitcoin Short-Term Holders Are Underwater, Onchain Data Show",
    "url": "https://www.coindesk.com/markets/2023/08/23/nearly-90-of-bitcoin-short-term-holders-are-underwater-onchain-data-show/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "\"Sharp upticks in short-term holder supply in loss tend to follow 'top heavy markets' such as May 2021, Dec 2021, and again this week,\" one observer said."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-23T06:25:00.000Z",
    "title": "What are the 3 assets most correlated with Bitcoin? ",
    "url": "https://cointelegraph.com/news/bitcoin-assets-most-correlated-assets-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/eef2eece-d6db-4935-a3b5-def13c2f843f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin price is closely linked to several financial assets but the reasons for correlation with certain precious metals and stocks can be quite different. </p>\n                    <p><p>The financial media often points out Bitcoin’s (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) correlation to big tech. “Bitcoin is trading like a tech stock” is a common narrative alongside BTC's often acute <a href=\"https://cointelegraph.com/news/bitcoin-s-inverse-correlation-with-us-dollar-hits-17-month-highs-what-s-next-for-btc\">inverse-relationship with the United States dollar</a>. </p><p>But are these correlations set in stone, and can they be useful for predicting future price moves? Let's take a closer look at several reports analyzing the relationship between Bitcoin and various asset types. </p><h2>Bitcoin's historic correlations vary across timeframes</h2><p>A <a href=\"https://www.mdpi.com/1099-4300/24/11/1565\" target=\"_blank\" rel=\"noopener nofollow\">report published in October 2022</a> by the Multidisciplinary Digital Publishing Institute arrived at several key conclusions regarding Bitcoin’s correlations with traditional financial assets, including: </p><ul><li>The extreme volatility of the Bitcoin market means that long-term correlations are stronger than short-term correlations;</li><li>The “positive linkage between Bitcoin and risk assets increases during extreme shocks” such as COVID-19;</li><li>Bitcoin can be positively correlated with risk assets and negatively correlated with the US dollar;</li><li>Bitcoin can serve as a hedge against the US dollar.</li></ul><p> While some of these points can be countered with newer price data over the last 9 to 10 months, such as a <a href=\"https://cointelegraph.com/news/bitcoin-btc-ether-eth-less-volatile-than-oil\">major drop in volatility</a>, insight can still be gained from examining them. In addition, other researchers have gone deeper into the relationship of specific assets to Bitcoin during set timeframes.</p><h2>Crypto-specific stocks </h2><p>A few crypto-related equities have been more correlated to Bitcoin than any other assets on the market. The 90-day correlation coefficient for BTC/MSTR, BTC/COIN, and BTC/RIOT have all remained near 1 for the last several months. The symbols \"BTC/xxxx\" indicate the correlation coefficient for each asset as measured against Bitcoin. </p><p>For MSTR, the coefficient has fallen no lower than 0.68 since September 2022. The coefficient for RIOT fell to roughly 0.75 in June 2023, while COIN trended near 0 for a time during May and June. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/a27ce092-2f0a-4bc9-9f02-6e15ffb8f849.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>COIN, ROIT, and MSTR  year-to-date chart with 90-day correlation coefficients compared to BTC. Source: TradingView</em></figcaption></figure><p>All of these stocks <a href=\"https://cointelegraph.com/news/bitcoin-mining-stocks-outperform-btc-in-2023-but-on-chain-data-points-to-a-potential-stall\">have outperformed</a> Bitcoin so far this year while also showing greater volatility. Investors may be using these assets as proxies for Bitcoin, which can't be bought through a brokerage account. </p><p>One reason these three stocks are so closely correlated to Bitcoin has to do with the balance sheet of their respective companies. They all have a substantial amount of Bitcoin holdings. </p><p>As seen in the table below, MSTR <a href=\"https://cointelegraph.com/news/microstrategy-earnings-profit-second-quarter-bitcoin\">has the most holdings</a> of any public company with 152,333 Bitcoin. COIN comes in 4th place with 10,766 Bitcoin, and RIOT is in 8th place with 7,094 Bitcoin.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/a33b0be7-9a4d-47d6-896a-bb70611c23b9.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin holdings by public companies. Source: CoinGecko</em></figcaption></figure><h2>Precious metals</h2><p>When it comes to correlation with commodities and precious metals, in particular, silver actually beats <a href=\"https://cointelegraph.com/news/bitcoin-vs-gold-are-market-cap-and-other-comparisons-actually-relevant-for-investors\">gold</a> in mirroring Bitcoin's price moves since 2019. </p><p>A November 2022 <a href=\"https://blogs.cfainstitute.org/investor/2022/11/16/how-do-cryptocurrencies-correlate-with-traditional-asset-classes\" target=\"_blank\" rel=\"noopener nofollow\">report</a> by Jordan Doyle and Urav Soni of the CFA Institute entitled “How do cryptocurrencies correlate with traditional asset classes?” shed some light on Bitcoin's most-correlated assets. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/a2e9c0ff-3ab5-4f39-850e-b6f9049a83bc.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto and Commodities correlation heat map. Source: CFA Institute</em></figcaption></figure><p>Silver has been the <a href=\"https://cointelegraph.com/news/commodity-tokenization-economic-aid-africa\">commodity</a> most closely-correlated to Bitcoin from October 2019 and to October 2022 with a correlation coefficient of 0.26, according to the report. Gold’s correlation, by comparison, was just 0.15, perhaps due to silver’s greater volatility. </p><p>The report notes:</p><blockquote>Silver has the highest correlation, peaking at 0.26 for silver and bitcoin. Bitcoin, the so-called 'digital gold,' exhibits only weak correlation with the precious metal.</blockquote><h2>Passive and active equity funds and bonds </h2><p>When speaking of stocks as a whole and their correlation to Bitcoin, looking at an index or <a href=\"https://cointelegraph.com/news/europe-first-bitcoin-etf-hits-euronext-amsterdam-exchange\">ETF </a>would be the most common way to make a comparison. This provides an overview of the asset class in general rather than zeroing in on one specific stock, which may have any number of factors affecting it. </p><p>As might be expected, growth funds tend to be more correlated with cryptocurrencies, presumably due to their more speculative nature. Notably: </p><blockquote>“Growth funds exhibit a stronger correlation to cryptocurrencies than value funds. The correlation coefficient between small-cap growth funds and bitcoin, for instance, is 0.41, compared to 0.35 for small-cap value funds and bitcoin.” </blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/b4502596-6cdf-42ff-aaf0-87ca674d6386.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto, equity funds, and bonds correlation heat map. Source: CFA Institute</em></figcaption></figure><p>In other words, crypto markets as a whole are “weakly sensitive to interest rate dynamics” that were at least partially <a href=\"https://cointelegraph.com/news/how-do-the-fed-s-interest-rates-impact-the-crypto-market\">responsible for a broad drawdown</a> in equities throughout 2022. </p><p>Finally, Bonds bear little to no relationship with Bitcoin. Passive bond funds showed a correlation of just 0.11, while active bond funds were just two basis points higher at 0.13. All data points are for the timeframe of October 2019-October 2022.</p><h2>Bitcoin's correlations are not a crystal ball</h2><p>Due to Bitcoin’s large price swings, all correlations can change at a moment’s notice. Still, the data used here provides an accurate picture of the assets most closely correlated to Bitcoin in the recent past. </p><p><u><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-and-correlations-examining-the-relationship-between-btc-gold-and-the-nasdaq\">Bitcoin and correlations: examining the relationship between btc, gold, and the nasdaq</a></em></strong></u></p><p>It's likely that crypto-specific stocks will continue having a strong correlation due to their Bitcoin holdings, while the correlation with commodities and equity funds <a href=\"https://cointelegraph.com/news/bitcoin-and-gold-short-lived-correlation-not-a-sign-of-comparability\">could quickly change course</a> going forward.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T06:12:45.000Z",
    "title": "Binance Pay’s Grand Entry into Brazil: Paving the Way for Cryptocurrency Payments",
    "url": "https://www.cryptopolitan.com/binance-pays-into-brazil-way-for-payments/",
    "description": "In a groundbreaking move, Binance, the world&#8217;s premier cryptocurrency exchange, has unveiled Binance Pay in Brazil. This innovative payment platform promises to offer local merchants a seamless, efficient, and cost-effective alternative to traditional payment methods, marking a significant shift in the country&#8217;s financial landscape. Binance Pay: A Revolutionary Payment Solution for Brazil Binance, a global ... <a title=\"Binance Pay&#8217;s Grand Entry into Brazil: Paving the Way for Cryptocurrency Payments\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-pays-into-brazil-way-for-payments/\" aria-label=\"More on Binance Pay&#8217;s Grand Entry into Brazil: Paving the Way for Cryptocurrency Payments\">Read more</a>"
  }
]