[
  {
    "source": "Crypto Daily",
    "date": "2023-12-26T17:36:29.000Z",
    "title": "7 Hottest Trending Altcoins to Buy This Week",
    "url": "https://cryptodaily.co.uk/2023/12/7-hottest-trending-altcoins-to-buy-this-week",
    "description": "Discover the top 7 trending altcoins this week. This comprehensive guide provides insights into the most promising alternative cryptocurrencies, offering expert analysis, market trends, and investment potential. Ideal for crypto enthusiasts and investors looking to diversify their portfolio with the hottest altcoins in the market."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-26T17:30:19.000Z",
    "title": "ORDI’s Record Rally — Leading the Charge in Bitcoin’s BRC20 Token Boom",
    "url": "https://news.bitcoin.com/ordis-record-rally-leading-the-charge-in-bitcoins-brc20-token-boom/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/hio90-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"ORDI&#039;s Record Rally — Leading the Charge in Bitcoin&#039;s BRC20 Token Boom\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/hio90-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hio90-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hio90-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hio90-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hio90-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hio90-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/hio90.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Dec. 26, 2023, the Bitcoin-based BRC20 token, ORDI, soared to a record $81.34 per coin before declining over 14% from its peak. BRC20s have emerged as significant players in the crypto asset arena, with several tokens mirroring ORDI&#8217;s trajectory. Bitcoin&#8217;s BRC20 Token ORDI Peaks and Dips as a New Era of Crypto Assets Is [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-26T17:30:24.000Z",
    "title": "Bitcoin Millionaires Rise By 246% In 2023, Here’s How Many There Are",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-millionaires-246-2023/",
    "description": "Bitcoin’s resurgence in 2023 has created wealth for many crypto investors, as there has been a significant rise in the number of Bitcoin millionaires. These Bitcoin millionaires happen to be wallet addresses whose BTC holdings equal $1 million or above.  Number Of Bitcoin Millionaires According to data from BitInfoCharts, there are currently 97,497 Bitcoin millionaires. This represents a significant increase from the beginning of the year when the number of wallet addresses equal to $1 million and above stood at 23,795, according to data from Glassnode.  Related Reading: Why Did The XRP Price Surge To $0.64 Today? This development is attributed to the resurgence in Bitcoin’s price this year, with the crypto token seeing over 158% gain year-to-date. At the beginning of the year, Bitcoin’s price stood at just over $16,000. However, as the flagship cryptocurrency’s price began to rise, so did its number of millionaires.  Further data from BitInfoCharts breaks down these Bitcoin millionaires into two categories. The number of addresses that are greater than $1 million stands at 90,040, while 7,457 wallet addresses hold $10 million or more.  Meanwhile, other addresses below $1 million have also seen enormous profits. Market intelligence platform Santiment recently reported that 89% of the total Bitcoin supply is in profits. 2024 could be a better year for these addresses, considering that the Bull market is expected to kickstart next year.  In the meantime, some of these Bitcoin millionaires and persons with significant holdings seem to be taking profits. NewsBTC recently reported how Bitcoin whales had sold around 50,000 BTC which equals to about $2.2 billion.  BTC price retraces to $42,600 &#124; Source: BTCUSD on Tradingview.com About Two Weeks To Go For Spot ETFs One of the biggest moments for Bitcoin and the crypto industry could come as early as January 10. This is around the period when experts are predicting that the Securities and Exchange Commission (SEC) will approve the pending Spot Bitcoin ETFs, and there is optimism in the air as many actions point to an approval happening.  Related Reading: Crypto Analyst Predicts XRP Price Will Hit $1.33 ‘Pretty Fast’ Crypto stakeholders have had their eyes fixed on developments revolving around these Spot Bitcoin ETFs. The reason isn’t farfetched, as these funds could unlock fresh liquidity into the Bitcoin ecosystem. Trading firm QCP Capital had highlighted this as the catalyst to Bitcoin hitting its all-time high (ATH) and possibly new ATHs.  At the same time, people like the former CEO of crypto exchange BitMEX, Arthur Hayes, will be hoping that these ETFs don’t achieve much success as he says they could lead to Bitcoin’s downfall.  At the time of writing, Bitcoin is trading at around $42,678.76, down over 1% in the last 24 hours according to data from CoinMarketCap. Featured image from Crypto News, chart from Tradingview.com"
  }
]