[
  {
    "source": "CoinDesk",
    "date": "2023-10-17T07:19:11.000Z",
    "title": "Bitcoin's Rising Dominance Rate Challenges Altcoin Boom From 2021",
    "url": "https://www.coindesk.com/markets/2023/10/17/bitcoins-rising-dominance-rate-challenges-altcoin-boom-from-2021/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The ascent in bitcoin's dominance rate is consistent with the bullish breakout in June, which marked the end of a prolonged range play between 38% and 48%."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-17T07:30:43.000Z",
    "title": "Jim Rickards Blasts US Congress Confiscation Initiatives: ‘The Drive to Create New Currencies Will Go Into Overdrive’",
    "url": "https://news.bitcoin.com/jim-rickards-blasts-us-congress-confiscation-initiatives-the-drive-to-create-new-currencies-will-go-into-overdrive/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/ebeb792d-aa54-4099-a32c-1b8745a9cb9f-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Jim Rickards Blasts US Congress Confiscation Initiatives: &#039;The Drive to Create New Currencies Will Go Into Overdrive&#039;\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/ebeb792d-aa54-4099-a32c-1b8745a9cb9f-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ebeb792d-aa54-4099-a32c-1b8745a9cb9f-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ebeb792d-aa54-4099-a32c-1b8745a9cb9f-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ebeb792d-aa54-4099-a32c-1b8745a9cb9f-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ebeb792d-aa54-4099-a32c-1b8745a9cb9f-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ebeb792d-aa54-4099-a32c-1b8745a9cb9f-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/ebeb792d-aa54-4099-a32c-1b8745a9cb9f.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Renowned economist and best-selling author Jim Rickards has warned about the effects of a new U.S. congressional initiative that proposes confiscating Russian assets to reimburse itself for the aid given to Ukraine. Rickards believes that, if passed, this legislation will alert the international community about the need for creating new currencies. Jim Rickards Explains Confiscating [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-17T07:30:43.000Z",
    "title": "Solana (SOL) Price Primed For 50% Surge: Bullish Pattern Emerges",
    "url": "https://www.newsbtc.com/news/solana/solana-sol-price-primed-50-surge/",
    "description": "Renowned crypto analyst Josh Olszewicz recently spotlighted an extremely bullish technical pattern for Solana (SOL) price, suggesting a potential significant uptrend for the cryptocurrency against the US dollar (SOL/USD). Olszewicz shared his analysis on X (formerly Twitter), commenting, “SOL iHS alert. Chart is the chart, love it or hate. Looks a helluva lot better than spot ETH that&#8217;s for sure.” Solana Poised For A 50%+ Rally? After reaching a peak of $260 in November 2021, the Solana price experienced a steep decline in value, plummeting to a low of $8 by the end of 2022. This decline mirrored the general downturn in the crypto market, which was further aggravated by the collapse of the crypto exchange FTX, with SOL being particularly affected. However, 2023 began with a positive twist for Solana. The price of SOL rebounded from its $8 low to almost $26 within the first half of January, setting the stage for the formation of an inverse head and shoulders (H&#38;S) pattern. Related Reading: FTX Estate Stakes $122 Million Solana (SOL), Quells Fear Of Token Sell-Off This inverse H&#38;S pattern, recognized as a typical bullish reversal signal, began taking shape in mid-January and extended through October 2023. By mid-March, the left shoulder was evident, with the head forming in early June, and the right shoulder becoming prominent in October. A significant feature of this pattern is the neckline resistance, identified at around the $25.81 mark. Solana&#8217;s price has already challenged this resistance multiple times, and a decisive breach above this threshold would serve as a strong indicator of a bullish trend reversal. Olszewicz, in his analysis, marked the stop loss (SL) for this trade idea just below the right shoulder, specifically around $19.30. Related Reading: Solana Outshines Bitcoin? A Dive Into Last Week’s Crypto Asset Inflows Using Fibonacci extensions, Olszewicz charted potential price trajectories for SOL, should it successfully surpass the $25.81 neckline. The targets are marked at the 1.618 ($33.85) and 2.0 ($38.82) Fibonacci levels. If these predictions hold, traders might be looking at potential profits ranging between 35% and 55% from the current price. VPVR Supports This Thesis For SOL Additional insights from the Volume Profile Visible Range (VPVR) reveal that the most substantial trading activity for SOL is clustered around the $14 to $15 bracket. Another volume cluster is situated between the $20.83 and $19.30 marks, aligning with Olszewicz&#8217;s stop loss placement. Another important takeaway is that should SOL break above the inverse H&#38;S pattern&#8217;s neckline, there is a large volume gap up to the first price target at $33.85 where the 1.618 Fibonacci level is situated, suggesting this area is of significant interest and potential resistance. In conclusion, while the inverse H&#38;S pattern&#8217;s emergence paints a super bullish picture for Solana&#8217;s price trajectory, it is essential to await a confirmed breakout above the $25.81 neckline, ideally supported by a substantial trading volume, before confirming the bullish projections laid out by Olszewicz. At press time, SOL rose above 200-day EMA and traded at $23.81. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-17T07:19:35.000Z",
    "title": "Tron’s TRX Takes Flight: Enters Top Ten Crypto List with 2.60% Surge",
    "url": "https://www.crypto-news-flash.com/trons-trx-takes-flight-enters-top-ten-crypto-list-with-2-60-surge/?utm_source=rss&utm_medium=rss&utm_campaign=trons-trx-takes-flight-enters-top-ten-crypto-list-with-2-60-surge",
    "description": "<img width=\"700\" height=\"350\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/03/TRON.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"TRON\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/03/TRON.jpg 700w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/TRON-300x150.jpg 300w\" sizes=\"(max-width: 700px) 100vw, 700px\" />Tron makes an incredible run to enter the top 10 largest cryptos by market cap with a 24-hour surge of 4 percent. Key metrics including moving averages indicate a positive outlook with a declined market volatility.  Tron (TRX) is currently trading at $0.087882 after surging by 3 percent in the last seven days and 4 [...]"
  }
]