[
  {
    "source": "Decrypt",
    "date": "2023-08-26T11:01:02.000Z",
    "title": "USDC Market Cap Plummets to 2-Year Low–Here's 4 Reasons Why",
    "url": "https://decrypt.co/153751/usdc-market-cap-plummets-2-year-low-heres-4-reasons-why",
    "description": "With the market's second-largest stablecoin USDC in something of a death spiral, experts weigh on in what's keeping the digital dollar down."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-26T11:00:50.000Z",
    "title": "Bitcoin market poised as heightened seller exhaustion indicates low-risk bottom",
    "url": "https://cryptoslate.com/insights/bitcoins-2023-market-poised-as-heightened-seller-exhaustion-indicates-low-risk-bottom/",
    "description": "<p>Quick Take The Bitcoin market in 2023 displays an interesting revelation: a marked escalation in seller exhaustion. To put it in perspective, this rare occurrence has only occurred roughly 15 times in Bitcoin&#8217;s history, with an unusual concentration of four incidences in 2023 alone. The metric, defined by the product of the Percentage Supply in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoins-2023-market-poised-as-heightened-seller-exhaustion-indicates-low-risk-bottom/\">Bitcoin market poised as heightened seller exhaustion indicates low-risk bottom</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-26T10:45:32.000Z",
    "title": "DeFi Education Fund CEO Slams U.S. Treasury’s “Confusing and Self-Refuting” Draft Regulations on Crypto",
    "url": "https://www.cryptoglobe.com/latest/2023/08/defi-education-fund-ceo-slams-u-s-treasurys-confusing-and-self-refuting-draft-regulations-on-crypto/",
    "description": "On 25 August 2023, the U.S. Department of the Treasury, in collaboration with the Internal Revenue Service (IRS), unveiled draft regulations aimed at tightening the reporting requirements for digital asset transactions. This move is part of the Biden-Harris Administration’s broader strategy to plug tax compliance loopholes and mitigate the risks of tax evasion in the […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-26T11:00:41.000Z",
    "title": "Jellyfish Mobile to Curb the SIM-Swap Menace That Led to Losses Worth $140 Million in Two Years",
    "url": "https://news.bitcoin.com/jellyfish-mobile-to-curb-the-sim-swap-menace-that-led-to-losses-worth-140-million-in-two-years/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/unnamed-98-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/unnamed-98-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/unnamed-98-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/unnamed-98-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/unnamed-98-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/unnamed-98-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/unnamed-98-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/unnamed-98.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. The cryptocurrency market lacks regulation, leading to potential risks for investors, including SIM-swap scams. By this technique, hackers manipulate mobile carrier customer service to gain access to a user&#x2019;s phone number, allowing them to bypass security measures and access accounts. Bart Stephens, co-founder of Blockchain Capital, fell victim to a SIM-swap attack, resulting [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-26T10:55:14.000Z",
    "title": "Shiba Inu Community Burn Sees Another 350 Million Meme Coins Incinerated",
    "url": "https://www.newsbtc.com/all/shiba-inu-community-burn-sees-another-350-million-meme-coins-incinerated/",
    "description": "The world of digital currency has brought some challenges to the Shiba Inu (SHIB) ecosystem. The ups and downs in this digital money landscape have caused the value of many coins connected to SHIB to drop, making things a bit shaky. But here&#8217;s something good: the SHIB token burn is happening faster than before. This means they&#8217;re getting rid of more tokens, which is a positive thing. It&#8217;s like a bright spot in the midst of all these changes, showing that there&#8217;s something strong and good still happening in the SHIB world. Based on the data provided by the Shibburn explorer, it is evident that the SHIB community has been effectively engaging in the process of burning substantial quantities of these meme coins, thereby transferring them to wallets that are rendered unspendable. Related Reading: Tron Reverses August Slump As TRX Open Interest Climbs Shiba Inu: Optimism Amid Market Volatility Even though the SHIB token has had some failures and its price has gone down, its burn rate has gone up by about 80% in the last 24 hours, according to Shibburn. Today, the SHIB army has successfully facilitated the removal of around 350 million Shiba Inu meme coins, which were previously rendered inaccessible and excluded from circulation. Source: Shibburn Last week, over 1.84 billion SHIB tokens were burned in approximately 255 transitions, according to Shibburn. This reduced the weekly SHIB consumption rate by 38.76%. It took 19 transfers for the community to successfully remove 349,012,147 SHIB during the course of the last 24 hours. Burns frequently involved two or three SHIB pieces and occurred virtually hourly. Increasing Scarcity And Value Burning tokens, or reducing the supply of a cryptocurrency, is a common practice in the blockchain and crypto communities. As the number of coins in circulation increases, both their demand and value tend to decrease. This activity is considered a deliberate method to increasing scarcity, which may lead to an increase in the value of the remaining tokens. This strategy is especially significant for Shiba Inu because of their abundant starting supply. SHIB market cap currently at $4.8 billion. Chart: TradingView.com Meanwhile, as the Shibarium relaunch draws near, Lucie, a Shiba Inu team representative, has revealed some exciting news. Related Reading: PEPE Token Tumbles 20% Amid Suspicious Activity – Details Lucie updates her followers on the status of Shibarium in a new tweet, letting them know that Shiba Inu Layer 2 is now operational and functioning well in private mode. 🚀 Exciting news from Shibarium (L2) update! 🎉 It&#8217;s officially live and running smoothly in private mode. The team just needs to make it public, and rest assured, all funds are safe! 🔒 Some people have already received their bridged $BONE #ShibariumUpdate #Shibarium pic.twitter.com/yk5L1ELMch — 𝐋𝐔𝐂𝐈𝐄 &#124; Summer of Shibarium (@LucieSHIB) August 24, 2023 The enormous flood of users forced Shibarium to suspend soon after its launch on August 16. The group got to work right away scaling its operations and starting network deep testing. SHIB price action today. Source: Coingecko At the time of writing, SHIB was trading at $0.00000818, down 1.4% in the last 24 hours and sustaining a 3.8% loss in the last seven days, data from crypto market tracker Coingecko shows. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Gothamist"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-26T10:57:00.000Z",
    "title": "PEPE To Create New Official Telegram as Ex-Members Steal 16T Tokens",
    "url": "https://coinedition.com/pepe-to-create-new-official-telegram-as-ex-members-steal-16t-tokens/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/PEPE-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"PEPE To Create New Official Telegram as Ex-Members Steal 16T Tokens\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/PEPE-4.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-4-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-4-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-4-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-4-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-4-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-4-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-4-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-4-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-4-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-4-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-4-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-4-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-4-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-4-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In an announcement, the PEPE admin confirmed that unexpected developments occurred on Thursday, where trillions of PEPE tokens went missing. Specifically, PEPE admin revealed on X that approximately 16 trillion PEPE tokens, equivalent to around $15 million, were moved from the PEPE multisig CEX Wallet.&#160; These tokens were transferred to several crypto exchanges, including OKX, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/pepe-to-create-new-official-telegram-as-ex-members-steal-16t-tokens/\">PEPE To Create New Official Telegram as Ex-Members Steal 16T Tokens</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]