[
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T18:06:38.000Z",
    "title": "Bitcoin takes backseat in El Salvador as bonds soar",
    "url": "https://www.cryptopolitan.com/bitcoin-takes-backseat-in-el-salvador/",
    "description": "El Salvador has experienced a notable shift in its financial landscape, with Bitcoin &#8211; the country&#8217;s recently adopted legal tender &#8211; momentarily playing second fiddle to a meteoric rise in the value of its bonds. Investors have enjoyed an impressive 60% return this year, prompting many to speculate whether this impressive rally has reached its ... <a title=\"Bitcoin takes backseat in El Salvador as bonds soar\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-takes-backseat-in-el-salvador/\" aria-label=\"More on Bitcoin takes backseat in El Salvador as bonds soar\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T17:55:39.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-19T18:00:39.000Z",
    "title": "OKX Wallet Introduces Staking Function For Bitcoin And BRC-20 Tokens",
    "url": "https://www.newsbtc.com/okb/okx-wallet-introduces-staking-function-for-bitcoin-and-brc-20-tokens/",
    "description": "Cryptocurrency exchange OKX, has announced that its multichain wallet will now allow users to lock up and stake their Bitcoin (BTC) and BRC-20 tokens. This function is described as a token reward system for holders of Bitcoin and BRC-20 tokens. OKX Unveils Staking System On Multichain Wallet On Tuesday, OKX unveiled a new functionality on its multichain digital asset wallet, which enables users to stake Bitcoin (BTC) and BRC-20 tokens. According to the company&#8217;s media release, this token reward system is possible due to the integration of OKX&#8217;s open-source BRC20-S protocol.  Related Reading: Pre-Mined Ethereum Worth $116M Moves After 8 Years: Is A Major Price Dip Imminent? This protocol is an extended version of the BRC-20 standard that integrates functionalities for staking operations, like depositing, minting, and withdrawing. It allows users to earn BRC20-S tokens through the OKX Web3 DeFi aggregator. Furthermore, the BRC20-S protocol enables decentralized finance (DeFi) developers and projects to create staking pools on OKX Wallet. With these staking pools, Bitcoin holders and BRC-20 token holders can receive BRC20-S tokens. Additionally, this will help DeFi projects drive up user engagement and community-building efforts, according to OKX&#8217;s press statement. Jason Lau, OKX’s Chief Innovation Officer, claims that the wallet is the first multichain digital asset storage to support Bitcoin and BRC-20 token staking. “We have heard from OKX Wallet users that they want more opportunities to participate in the ecosystem, and we are thrilled to deliver that for them,” the CIO said. This staking capability comes as an addition to an existing host of Web3 Earn products on the OKX wallet. In the announcement, the company also mentioned the future introduction of complementary features, like a marketplace for selling BRC20-S tokens. OKX Wallet Announces Integration With Kava Blockchain In a separate announcement, OKX Wallet disclosed its partnership with Kava, an EVM-compatible blockchain built with Cosmos’ SDK (Software Development Kit). This integration will reportedly enrich the users’ options for digital asset transfer and transactions on the wallet. This represents another positive move by OKX Wallet in pursuit of maximum customer satisfaction as only a few days ago, the multichain wallet unveiled a partnership with PulseChain, another blockchain platform. Related Reading: BNB Chain Unveils Beacon Update – What’s Its Bearing On Price? Despite these positive moves and collaborations, OKB, the utility token of the OKX ecosystem, has seen a negligible market performance. According to CoinGecko data, the token’s value has only increased by 0.3% in the last 24 hours, with a 0.7% dip in the past week. As of this writing, OKB is chasing hands at $43.14, with a daily trading volume of over $2.02 million. The token has a market cap of roughly $2.59 billion, making it the 29th-largest cryptocurrency in the industry. OKBUSD trading at $43.2 &#124; Source: OKBUSD chart from TradingView Featured image from OKX, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-19T18:05:45.000Z",
    "title": "Benjamin Cowen Issues Bitcoin Warning, Says History Suggesting BTC Heads Much Lower – Here’s His Outlook",
    "url": "https://dailyhodl.com/2023/07/19/benjamin-cowen-issues-bitcoin-warning-says-history-suggesting-btc-heads-much-lower-heres-his-outlook/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/Up-to-5100-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/Up-to-5100-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/Up-to-5100-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/Up-to-5100-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/Up-to-5100-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/Up-to-5100-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/Up-to-5100-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Widely followed crypto analyst Benjamin Cowen says that Bitcoin (BTC) and crypto markets don&#8217;t have history on their side right now, and are facing the threat of a hefty correction to the downside. Cowen tells his 751,000 Twitter followers that even with this year&#8217;s rally, BTC is still following the same bear market patterns of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/19/benjamin-cowen-issues-bitcoin-warning-says-history-suggesting-btc-heads-much-lower-heres-his-outlook/\">Benjamin Cowen Issues Bitcoin Warning, Says History Suggesting BTC Heads Much Lower – Here’s His Outlook</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]