[
  {
    "source": "CoinDesk",
    "date": "2023-06-13T12:01:00.000Z",
    "title": "First Mover Americas: eToro Delists 4 SEC Targeted Tokens for U.S. Customers ",
    "url": "https://www.coindesk.com/markets/2023/06/13/first-mover-americas-etoro-delists-4-sec-targeted-tokens-for-us-customers/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for June 13, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-13T11:41:58.000Z",
    "title": "UK Has No Plans for 'Crypto Tsar' Proposed by Some Lawmakers, Minister Says",
    "url": "https://www.coindesk.com/policy/2023/06/13/uk-has-no-plans-for-crypto-tsar-proposed-by-some-lawmakers-minister-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Economic Secretary to the Treasury Andrew Griffith reiterated the government's position that crypto should not be treated like gambling."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-13T11:54:54.000Z",
    "title": "Arianee's Key Focus for Big Brands? Building 'a Better NFT', Says CEO",
    "url": "https://decrypt.co/144358/arianee-key-focus-big-brands-building-better-nft-says-ceo",
    "description": "NFTs are becoming more dynamic, letting brands join Web3 to integrate their digital assets into their marketing stack, said Arianee’s CEO."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-13T11:43:29.000Z",
    "title": "Hong Kong and the US aim for stablecoin regulations by 2024  ",
    "url": "https://cointelegraph.com/news/hong-kong-united-states-stablecoin-regulations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/42e25d4c-9279-42de-83fa-ea7d97fef6ee.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The U.S. is another country currently working on stablecoin market regulations having introduced three drafts of the bill until June first week. </p>\n                    <p><p>The Hong Kong Monetary Authority has completed a public <a href=\"https://www.hkma.gov.hk/eng/regulatory-resources/consultations/closed/\" target=\"_blank\" rel=\"noopener nofollow\">consultation </a>on stablecoin regulations with an aim to introduce clear regulatory guidelines around the stablecoin market by the end of 2024.</p><p>Joseph Chan Ho-Lim, deputy director of the Hong Kong Financial Services and Treasury Bureau, said that over the past five years, Hong Kong has emerged as a growing destination for fintech firms. Chan added that the Hong Kong authorities are actively working to promote the Web 3 ecosystem with a focus on investor protection.</p><p>Hong Kong started its <a href=\"https://cointelegraph.com/news/hong-kong-begins-discussions-to-introduce-stablecoin-regulatory-framework\">stablecoin regulations in January 2022</a> where the KHMA has shared a list of eight questions to seek policy-related recommendations and cited five possible regulatory outcomes — no action, opt-in regime, risk-based regime, catch-all regime and blanket ban. A year later the <a href=\"https://cointelegraph.com/news/hong-kong-will-not-tolerate-algorithmic-stablecoins-in-new-regulation\">regulatory discussions outright prohibited the incorporation of algorithmic stablecoin</a> after the Terra-Luna debacle.</p><p>With the completion of the public consultation phase, the HKMA will be focusingon the areas of issuance, governance and stabilization.</p><p>Hong Kong this year alone has taken the crypto regulatory lead at a time when most of its Western counterparts are still taking a cautious approach to the nascent tech. The HKMA has not only opened crypto trading for retail traders but also started a licensing regime for crypto exchanges that require these businesses to adhere to strict anti-money laundering regulations.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/stablecoins-are-solution-to-crypto-s-banking-problem-exec-says\"><strong><em>Stablecoins are the solution to crypto’s banking problem, exec says</em></strong></a></p><p>Apart from Hong Kong, the United States House Committee is also looking to introduce formidable regulations around the stablecoin market. The U.S House Committee has introduced <a href=\"https://cointelegraph.com/news/us-house-committee-releases-new-stablecoin-bill-draft\">three draft stablecoin bills in 2023</a> with the latest one proposing key powers to the Federal Reserve with some power to state authorities to intervene. </p><p>The approach of local regulators in the two countries couldn’t have been different. On one hand, Hong Kong regulators are actively pursuing to make the country a crypto hub, the actions of US regulators might force many established businesses to move out including stablecoin issuers. The U.S. Securities and Exchange Commission has accused several stablecoin issuers of violating securities law and has filed a lawsuit against Binance and its <a href=\"https://cointelegraph.com/news/is-the-sec-s-action-against-busd-more-about-binance-than-stablecoins\">stablecoin BUSD issued by Paxos</a>.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\">Bitcoin is on a collision course with ‘Net Zero’ promises</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-13T11:48:53.000Z",
    "title": "XRP outperforms top 10 in stagnant market: CryptoSlate wMarket update",
    "url": "https://cryptoslate.com/xrp-outperforms-top-10-in-stagnant-market-cryptoslate-wmarket-update/",
    "description": "<p>The cryptocurrency market saw net inflows of $5.7 billion over the last 24 hours and currently stands at $1.06 trillion — up 0.5% from $1.06 trillion. During the reporting period, the market caps of Bitcoin (BTC) and Ethereum (ETH) grew 0.7% and 0.2% to $507.55 billion and $210.56 billion, respectively. Over the last 24 hours, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/xrp-outperforms-top-10-in-stagnant-market-cryptoslate-wmarket-update/\">XRP outperforms top 10 in stagnant market: CryptoSlate wMarket update</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-13T12:00:00.000Z",
    "title": "Top 3 crypto price prediction, BTC, ETH, TCRV: what's next?",
    "url": "https://cryptodaily.co.uk/2023/06/top-3-crypto-price-prediction-btc-eth-tcrv-whats-next",
    "description": "<p>After the lawsuits presented by Gensler and the SEC, the crypto market underwent a correction followed by a subsequent rebound to a lower level. Tradecurve is unaffected by the move, and the price is set to rise soon.</p>\n<p>&gt;&gt;BUY TCRV TOKENS NOW&lt;&lt;</p>\nBitcoin price action\n<p>Although the entire crypto market is down, including Bitcoin, BTC is the only coin that SEC chair Gary Gensler does not think is a security, based on the way the coins were mined and the level of decentralization. Nevertheless, Bitcoin still reacted to the news of the Binance and Coinbase lawsuits, on the 6th of June. Bitcoin&rsquo;s price fell as low as $25,600, before rebounding to $27,216, correcting again, and is now going back up, and is currently trading at $26,666.</p>\n<p>Based on the ongoing price action, Bitcoin exhibits a robust support level around $25,000, which closely aligns with the 61.8% Fibonacci retracement level derived from the rally spanning $10,000 to $65,000. Upholding its current level may catalyze a rebound, prompting Bitcoin to test resistance levels positioned at $30,000, $35,000, and $40,000. However, breaching this threshold could instigate a further sell-off, potentially pushing Bitcoin down to $20,000 or below.</p>\n<p>&gt;&gt;BUY TCRV TOKENS NOW&lt;&lt;</p>\nEthereum - shaken but not stirred (too much)\n<p>Ethereum was notably absent from the list of crypto currencies declared a security, and similarly saw a price reaction, falling to $1806 after the news, rebounding to $1895, and is, at time of writing, sitting at $1844.</p>\n<p>Therefore, just as we have seen support for Bitcoin, Ethereum demonstrates a comparable support level around $1,800 where the bulls jumped in, in proximity to the 61.8% Fibonacci retracement level obtained from the surge in its history from $300 to $4,400.&nbsp;</p>\n<p>If Ethereum upholds this level, it could trigger a recovery, propelling Ethereum towards resistance levels situated at $2,000, $2,500, and $3,000. Conversely, if this threshold is breached, Ethereum may experience a decline towards $1,500 or lower.</p>\n<p></p>\nTradecurve presents a solution needed now more than ever\n<p>In the wake of the SEC&rsquo;s targeting of two of the biggest centralized exchanges, a new solution is needed. DEXes like PancakeSwap, Uniswap and Curve have experienced huge inflows of money as people look to store and trade their crypto on-chain.</p>\n<p>However, although some of those exchanges offer things like leverage, none of them offer a professional trading terminal. Furthermore trades can be slow and slippage and spreads are sometimes quite high.</p>\n<p>Tradecurve is the answer here as it offers everything that these DEXes lack, and more, using its hybrid exchange model, and built on the Ethereum blockchain. Leverage of 500:1 is available by using crypto as collateral.&nbsp;</p>\n<p>Those who are worried about the recent attacks on centralized exchanges will be happy to know that as Tradecurve is built on the blockchain, it means your crypto is kept in your decentralized wallet, so no governmental agency can take it from you.</p>\n<p>As they are based outside of the US, they are not subject to the rules and regulations stipulated by the SEC, and as such, KYC free trading is possible. This gives freedom and anonymity to traders, in a world that the SEC is increasingly trying to control.</p>\n<p>TCRV is currently in presale at $0.015, having increased by 50% since stage 1. 50% is the magic number right now, or so it seems, as stage 3 is currently halfway sold out. The next stage of the presale will see it increase to $0.018. Crypto experts are predicting a rise of 80-100% after it leaves stage 8 of the presale.</p>\n<p>Visit the links to get more information about Tradecurve and the TCRV token:</p>\n<p>Click Here For Website</p>\n<p>Click Here To Buy TCRV Presale Tokens</p>\n<p>Follow Us Twitter</p>\n<p>Join Our Community on Telegram</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-13T12:00:00.000Z",
    "title": "Floki Inu (FLOKI) Price Prediction: Can FLOKI Recover and Catch Up to the High-Flying Uwerx (WERX) Presale?",
    "url": "https://cryptodaily.co.uk/2023/06/floki-inu-floki-price-prediction-can-floki-recover-and-catch-up-to-the-high-flying-uwerx-werx-presale",
    "description": "<p>Floki Inu (FLOKI) and Uwerx stand at the forefront of the battle for supremacy in the crypto world, each harboring its aspirations and potential. As the crypto world closely watches their contrasting journeys, questions arise regarding Floki Inu's (FLOKI) ability to rise from the ashes and challenge the soaring success of Uwerx's presale.</p>\nFloki Inu (FLOKI): Unleashing the Power of Utility\n<p>Floki Inu (FLOKI) stands out among the vast array of cryptocurrencies by offering compatibility with both Ethereum and Binance Smart Chain (BSC). This unique characteristic allows users to enjoy increased flexibility and accessibility in their transactions.&nbsp;</p>\n<p>Unlike many other meme coins, Floki Inu (FLOKI) sets itself apart by prioritizing utility. It has plans for a DeFi platform, a staking program, and a distinctively designed debit card featuring the beloved Floki motif.&nbsp;</p>\n<p>Priced at $0.000031, industry analysts predict that Floki Inu (FLOKI) could reach $0.001 by Q1 2024, positioning it as a promising meme coin. However, Uwerx, on the other hand, promises even greater value and potential for users.</p>\nUwerx's (WERX) Blockchain Revolution in Freelancing\n<p>Uwerx, an upcoming freelancing platform built on the Ethereum blockchain, is making waves with its innovative approach and commitment to delivering a seamless freelancing experience. By harnessing the power of blockchain technology, Uwerx aims to address the pain points faced by freelancers and clients, paving the way for a new era of decentralized and efficient collaboration.</p>\n<p>At the core of Uwerx's vision is providing greater decentralization and enhanced benefits for freelancers. Unlike traditional platforms that levy hefty transaction fees ranging from 10-20%, Uwerx disrupts the norm by charging a mere 1% transaction fee, ensuring that freelancers can reap the rewards of their hard work while enjoying access to exceptional freelancing services.</p>\n<p>Recognizing the significance of security and accountability, Uwerx has undergone rigorous auditing processes conducted by renowned firms SolidProof and InterFi Network. These audits testify to Uwerx's unwavering commitment to ensuring a secure platform for freelancers and clients.</p>\nUwerx (WERX): Sneak Peek into the Future\n<p>Uwerx's dedication to delivering an exceptional platform experience is exemplified by the recent unveiling of its Alpha platform. Through a tantalizing peek into the landing page and Sign-Up/Sign-In page, Uwerx showcases its user-friendly interface, enticing freelancers and clients to join its ecosystem. Marking a significant milestone in the journey of Uwerx, the final launch of the Alpha platform is scheduled for August 4th, heralding a new chapter in the world of freelancing.</p>\n<p>As anticipation builds, Uwerx is preparing to roll out a range of exciting features, including the login page, user dashboard, settings, posting jobs, and finding jobs. These additions facilitate a seamless transition to the Beta versions and allow users to provide valuable feedback, driving continuous improvement and refinement.</p>\n<p>Transparency and trust are pillars of Uwerx's philosophy, as evidenced by its plan to renounce contracts once the project is ready for launch on centralized exchanges. This commitment further reinforces Uwerx's dedication to creating an open and trustworthy ecosystem for all stakeholders.</p>\n<p>Uwerx's rapid growth is undeniable, with the platform recently surpassing the remarkable milestone of 5,500 sign-ups. The overwhelming response reflects the industry's growing demand for a platform that prioritizes transparency and user-friendly experiences, setting the stage for Uwerx's ascent as a prominent player in the freelancing market.</p>\nUwerx's (WERX) Journey Towards Presale Triumphs&nbsp;\n<p>Community support is pivotal in Uwerx's trajectory, evident in the 98.2% vote to conduct a Test Airdrop through a Twitter poll. Scheduled to occur after the presale on July 31st, this highly anticipated event aims to reward early participants and ignite excitement among token holders, driving the platform's growth.</p>\n<p>Solidifying its presence in the cryptocurrency market, Uwerx has secured a listing on CoinSniper, further bolstering its credibility and visibility. The upcoming listing on the renowned decentralized exchange, Uniswap, by August 1st promises to unlock new opportunities for trading and liquidity, propelling Uwerx to the forefront of the industry.</p>\n<p>With the hard-cap presale nearing completion, Uwerx remains unwavering in its commitment to its timeline. The team's diligent efforts to modify token allocations reflect their dedication to accommodating the presale's rapid pace and meeting the community's demands and expectations.</p>\n<p>As each presale stage sells out rapidly, Uwerx's journey is a testament to the community's trust and confidence in the platform's vision for the future of freelancing. In a remarkable feat, stage 1 of its presale concluded within 17 days, followed swiftly by stage 2, which reached its target in just 8 days.&nbsp;</p>\n<p>These impressive achievements serve as a testament to the overwhelming interest and trust that the community has placed in the Uwerx project. The presale of Uwerx tokens is in the midst of an enticing stage 5, offering tokens at a favorable price of $0.041 per token with a 15% bonus on every purchase.</p>\n<p>The transparent and well-structured approach to token distribution, exemplified by the substantial 25-year token lock approved by an overwhelming 82.8% vote, ensures long-term stability and security for Uwerx token holders.</p>\n<p>In a remarkable stride towards enhancing user engagement, Uwerx introduces the Uwerx Vault for storing WERX tokens. This secure vault enables users to store their tokens for various durations, akin to staking, and earn rewards based on platform variables, amplifying the benefits of participating in the Uwerx ecosystem.</p>\n<p>As Uwerx continues to rewrite the rules of freelancing, it beckons freelancers and clients alike to join its revolution, as together, they forge a future where transparency, efficiency, and empowerment reign supreme.</p>\n<p>Join the Presale using these links to enjoy a 15% bonus:</p>\n<p>Presale:&nbsp; invest.uwerx.network</p>\n<p>Telegram: https://t.me/uwerx_network</p>\n<p>Twitter: https://twitter.com/uwerx_network</p>\n<p>Website: https://www.uwerx.network/</p>\n\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-13T12:00:00.000Z",
    "title": "Solana Price Prediction: SOL Price to Reach $25, Tradecurve Price Could Increase Another 50%",
    "url": "https://cryptodaily.co.uk/2023/06/solana-price-prediction-sol-price-to-reach-25-tradecurve-price-could-increase-another-50",
    "description": "<p>Two digital currencies, Solana and Tradecurve, have been generating excitement recently within the crypto space. Although the Solana blockchain witnessed numerous shutdowns in 2022, the network has bounced back with several new developments in 2023 which could push SOL, its native token towards the $25 price level. Meanwhile, Tradecurve, a promising DeFi project, is poised for another huge price surge of about 50% as investors show huge interest in its token presale.</p>\n<p></p>\nSolana (SOL) Price To Reach $25\n<p>Solana has been on an upward trajectory, surpassing the $20 mark as it shows strong momentum. Factors contributing to its recent price gains include increased user engagement, notable upgrades such as the ChatGPT plugin integration, and positive remarks from the project's co-founder.&nbsp;</p>\n<p>Presently, Solana faces a resistance level of $21.40, which, if breached, could potentially propel the cryptocurrency toward a significant price rally, targeting the $25 price level. Trading expert Jimie (@Your_NLP_Coach) identifies the next resistance level at $26, emphasizing the need for Solana's price to close above $21.3 to confirm further upward movement.&nbsp;</p>\n<p></p>\n<p>Other market analysts have predicted that if Solana (SOL) breaks out of this resistance, the token could experience a 28% rally. If this happens, the price of Solana (SOL) could be priced as high as $28 in the next few weeks. According to data from CoinMarketCap, Solana is trading at $20.20, a 1.20% increase in the last 24 hours.&nbsp;</p>\n<p></p>\nTradecurve (TCRV) Price Could Increase Another 50%&nbsp;\n<p>As the bullish sentiment surrounding Solana increases, traders are preparing to test the resistance level at $21.50. Tradecurve is already in the midst of a bull market. In May, which was a bearish month for the crypto market, Tradecurve's governance token, TCRV, experienced a remarkable 50% surge amidst a spike in interest from both retail and institutional investors. Expert analysts even project that June could bring another rally for Tradecurve.&nbsp;</p>\n<p>Multiple factors could help TCRV record another 50% price hike. One of them is its utility. Also, Tradecurve is building a decentralized platform that will offer users access to different trading markets like cryptocurrencies, forex, CFDs, commodities, and stocks. These markets have huge potential and high trading volume. According to IMARC impactful insights, the global foreign exchange (FX) market was valued at $ 753.2 Billion in 2022.&nbsp;</p>\n<p>As the utility token that offers Tradecurve holders benefits like governance rights, staking rewards, and discounts on fees, TCRV has been primed to benefit from the growth of the platform. In addition to the 50% rally, experts foresee the price of the token increasing by as much as 100x when the platform hits the global market. Currently, TCRV is valued at $0.015 per token, presenting a promising investment opportunity for investors looking to expand their market portfolio and grow their assets.</p>\n<p>Visit the links to get more information about Tradecurve and the TCRV token:</p>\n<p>Click Here For Website</p>\n<p>Click Here To Buy TCRV Presale Tokens</p>\n<p>Follow Us Twitter</p>\n<p>Join Our Community on Telegram</p>\n<p>&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-13T11:55:00.000Z",
    "title": "Binance US Market Depth Down 76%, Crypto Daily TV 13/6/2023",
    "url": "https://cryptodaily.co.uk/2023/06/binance-us-market-depth-down-76-crypto-daily-tv-13-6-2023",
    "description": "In Todays Headline TV CryptoDaily News:\n<p></p>\n<p>Binance.US market depth declines 76%</p>\n<p>Binance.US is witnessing market makers and traders flee the exchange en masse following last week&rsquo;s U.S. SEC lawsuit against it, alleging multiple securities violations. Just one week after the lawsuit, liquidity, which is measured by aggregated market depth for 17 tokens on Binance.US, has dropped 76%.</p>\n<p>Crypto prices stabilize after plunging on SEC crackdown jitters</p>\n<p>Cardano&rsquo;s coin, the world&rsquo;s seventh most valuable cryptocurrency, rose more than 1%, while Ripple&rsquo;s XRP, ranked sixth, is up almost 1%, according to CoinMarketCap. Meanwhile, Binance&rsquo;s BNB token and Solana&rsquo;s SOL are still down 4% recently</p>\n<p>BTC investment funds see 8th straight week of outflows</p>\n<p>Digital asset investment products saw outflows of $88 million last week, the eighth straight week of money exiting crypto funds. Outflows over the eight-week run now total $417 million and coincide with sizable declines in prices across cryptocurrencies following a hot start to the year.</p>\nBTC/USD remained largely unchanged in the last session.\n<p>Bitcoin-Dollar price remained largely unchanged in the last session. The MACD is giving a negative signal. Support is at 25389.6667 and resistance at 26511.6667</p>\n<p>The MACD is currently in the negative zone.</p>\n<p></p>\nETH dropped 0.7% against USD in the last session.\n<p>The last session saw Ethereum fall 0.7% against the Dollar. The Stochastic-RSI indicates an oversold market. Support is at 1720.381 and resistance at 1791.981</p>\n<p>The Stochastic-RSI is signaling an oversold market.</p>\n<p></p>\nXRP/USD rose 0.8% in the last session.\n<p>The Ripple-Dollar pair gained 0.8% in the last session after rising as much as 1.3% during the session. The MACD is giving a negative signal. Support is at 0.4913 and resistance at 0.5438</p>\n<p>The MACD is currently in the negative zone.</p>\n<p></p>\nLTC/USD dropped 0.7% in the last session.\n<p>Litecoin dropped 0.7% against the Dollar in the last session. The Stochastic-RSI indicates an oversold market. Support is at 74.8367 and resistance at 80.3767</p>\n<p>The Stochastic-RSI points to an oversold market.</p>\n<p></p>\nDaily Economic Calendar:\n<p>US Consumer Price Index</p>\n<p>The Consumer Price Index measures price movements by comparing the retail prices of a representative shopping basket of goods and services.  The US Consumer Price Index will be released at 12:30 GMT, the US Consumer Price Index Core at 12:30 GMT, and the Eurozone's ZEW Survey &ndash; Economic Sentiment at 09:00 GMT.</p>\n<p>US Consumer Price Index Core</p>\n<p>The Core Consumer Price Index (CPI) measures the changes in the prices of goods and services, excluding food and energy.</p>\n<p>EMU ZEW Survey &ndash; Economic Sentiment</p>\n<p>The ZEW Survey - Economic Sentiment measures institutional investor sentiment, reflecting the difference between the optimistic and pessimistic investors' share.</p>\n<p>DE ZEW Survey &ndash; Current Situation</p>\n<p>The ZEW Survey - Current Situation measures the current institutional investor sentiment, reflecting the difference between the share of investors that are optimistic and are pessimistic. Germany's ZEW Survey &ndash; Current Situation will be released at 09:00 GMT, the UK's Claimant Count Change at 06:00 GMT, and the UK's ILO Unemployment Rate at 06:00 GMT.</p>\n<p>UK Claimant Count Change</p>\n<p>The Claimant Count Change presents the change in the number of unemployed people in the UK. </p>\n<p>UK ILO Unemployment Rate</p>\n<p>The ILO Unemployment Rate is the number of unemployed workers divided by the total civilian labor force. </p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T11:41:48.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? The live Aave price is $54.71, with a 24-hour trading volume of $36,528,267. AAVE is up 3.50% in the last 24 hours. The current CoinMarketCap ranking is #47, with a live market cap of $790,784,342. It has a circulating supply of 14,426,048 AAVE coins and a max. supply of 16,000,000 ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T11:40:15.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-13T11:55:46.000Z",
    "title": "Ripple Vs. SEC: Hinman Docs Are Out, XRP Is Up 8%",
    "url": "https://www.newsbtc.com/news/ripple/ripple-vs-sec-hinman-docs-are-out-xrp-is-up/",
    "description": "The eagerly awaited &#8220;Hinman documents&#8221; in the legal battle between Ripple Labs and the US Securities and Exchange Commission (SEC) have been published today! After the XRP price initially reacted moderately, the altcoin experienced a rise of about 6% at the time of writing. Just yesterday, Ripple CEO Brad Garlinghouse said that the Hinman docs will be worth the wait. He was alluding to their potential importance of the documents for the ongoing legal battle. And XRP investors seem to agree with him, although not all community members are euphoric. Ripple Vs. SEC: This Is What The Hinman Docs Reveal Bill Morgan, a popular lawyer in the XRP community, declared that Stuart Alderoty (Ripple&#8217;s Chief Legal Officer, CLO) and Brad Garlinghouse &#8220;were not exaggerating&#8221;. According to him, &#8220;#Ethgate is alive and kicking after all.&#8221; The documents reveal that Bill Hinman, the former director of the Division of Corporation Finance at the SEC, involved Ethereum founder Vitalik Buterin before his notorious speech in which he classified ETH as a non-security. Related Reading: XRP Could Be Set For A Breakout As Investment Inflows Continue In the run-up to his speech, Hinman called Buterin to confirm how Ethereum operates. The SEC&#8217;s internal documents also reveal that on May 31, 2018, opposition grew within the SEC to the recommendation to classify Ether with Bitcoin as a non-security. On June 4, Hinman shared a draft of his speech with the commission&#8217;s division directors. The document reveals that Hinman was planning his call with Buterin later that week. Nevertheless, the SEC&#8217;s Office of General Counsel (OGC) suggested deleting the mention of ETH in the draft. The OGC was concerned about the difficulties it would face if it took a different position on Ether in the future. As is well known, Hinman disobeyed this directive and made ETH a focal point of his speech. This is one reason why respected XRP community member Mr Huber is rather disappointed. According to him, the emails are a &#8220;nothing burger.&#8221; They only prove that Hinman was persistently warned to avoid any references to Ethereum to avoid market confusion. &#8220;Despite these warnings, Hinman not only neglected this advice and even doubled down, focusing his entire speech on giving ETH a regulatory monopoly. Such a clumsy director,&#8221; writes Mr Huber, who is one of Bill Hinman&#8217;s biggest critics and accuses him of conflicts of interest. Related Reading: SBI CEO Predicts Massive XRP Price Surge, Expects Ripple Verdict In Few Weeks But lawyer Bill Morgan also sees arguments that help Ripple in its defense against the SEC. For example, the lawyer discovered several passages in the Rule 56.1 statement that speak particularly in favor of Ripple&#8217;s fair notice defense. Several SEC communications indicate that SEC officials were well aware that the speech would lead to &#8220;greater confusion&#8221; and that they intentionally wanted to give industry participants &#8220;fewer details,&#8221; presumably to give the agency more leeway. In addition, the documents show that the regulator revised its own internal views on factors that the SEC staff had previously deemed &#8220;not relevant&#8221; or that even proved that an asset was not a security. Words that were not previously relevant were redacted, Morgan says. For example, in 2018, the SEC held that lockups were not relevant and were indicative of a non-security. After that, the agency changed its opinion. At press time, investors seemed to view the publications as positive for XRP. The price rose by 8% to $0.5609 since the Hinman docs were published. Featured image from Ryan, Swanson &#38; Cleveland, PLLC, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-13T12:01:08.000Z",
    "title": "Ethereum Makes History: Bank of China Issues $28M in Digital Structured Notes on Blockchain",
    "url": "https://www.crypto-news-flash.com/ethereum-makes-history-bank-of-china-issues-28m-in-digital-structured-notes-on-blockchain/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-makes-history-bank-of-china-issues-28m-in-digital-structured-notes-on-blockchain",
    "description": "BOCI becomes the first Chinese bank to issue tokenized security. It is also the first of its kind in the Asia Pacific.  Bank of China&#8217;s subsidiary, BOCI makes history after becoming the first Chinese financial institution to issue tokenized security in Hong Kong. According to the report, BOCI has issued CNH 200 million ($28 million) [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-13T11:46:18.000Z",
    "title": "Taiwan Mobile Explores Potential Investment in Local Crypto Platforms",
    "url": "https://coinedition.com/taiwan-mobile-explores-potential-investment-in-local-crypto-platforms/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Taiwan_Mobile_Explores_Potential_Investment_in_Local_Crypto_Platforms-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Taiwan_Mobile_Explores_Potential_Investment_in_Local_Crypto_Platforms-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Taiwan_Mobile_Explores_Potential_Investment_in_Local_Crypto_Platforms-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Taiwan_Mobile_Explores_Potential_Investment_in_Local_Crypto_Platforms.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In a move that could redefine the landscape of telecommunications and the crypto industry, Taiwan Mobile Co., the government-licensed wireless service provider, is actively exploring the realm of crypto. According to a recent report, Taiwan Mobile Co. is engaging in early-stage discussions with local crypto platforms to potentially invest in one of the ventures, setting [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/taiwan-mobile-explores-potential-investment-in-local-crypto-platforms/\">Taiwan Mobile Explores Potential Investment in Local Crypto Platforms</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-13T11:45:03.000Z",
    "title": "Bitcoin Whales Accumulating Nearly $26,000,000 in BTC per Day Amid Falling Prices: Analytics Firm Santiment",
    "url": "https://dailyhodl.com/2023/06/13/bitcoin-whales-accumulating-nearly-26000000-in-btc-per-day-amid-falling-prices-analytics-firm-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Accumulating-Nearly-26.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Accumulating-Nearly-26.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Accumulating-Nearly-26.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Accumulating-Nearly-26.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Accumulating-Nearly-26.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Accumulating-Nearly-26.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Whales-Accumulating-Nearly-26.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A leading analytics firm says that Bitcoin (BTC) whales are in heavy accumulation mode despite the crypto king&#8217;s weak price action over the last few months. Santiment says that Bitcoin whales have been adding nearly $26 million in BTC per day since April 9th when the crypto king traded close to $28,000. According to the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/13/bitcoin-whales-accumulating-nearly-26000000-in-btc-per-day-amid-falling-prices-analytics-firm-santiment/\">Bitcoin Whales Accumulating Nearly $26,000,000 in BTC per Day Amid Falling Prices: Analytics Firm Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]