[
  {
    "source": "Decrypt",
    "date": "2023-10-09T23:00:09.000Z",
    "title": "CrypToadz NFT Sells for $1.6 Million in Ethereum Linked to Tornado Cash",
    "url": "https://decrypt.co/200807/cryptoadz-nft-sale-1-6-million-ethereum-linked-tornado-cash",
    "description": "A painful “fat finger” mistake—or obvious money laundering? This seven-figure CrypToadz NFT purchase has sparked fierce speculation."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-09T22:40:45.000Z",
    "title": "Elon Musk faces uphill battle against SEC subpoena, experts say",
    "url": "https://cryptoslate.com/elon-musk-faces-uphill-battle-against-secs-subpoena-experts-say/",
    "description": "<p>Elon Musk faces a challenging scenario in his attempt to contest the U.S. Securities and Exchange Commission (SEC). On Oct. 5, the SEC announced legal action that aims to force Musk to comply with a subpoena and provide testimony regarding his acquisition of Twitter (now X). Musk received that subpoena in May and attempted to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/elon-musk-faces-uphill-battle-against-secs-subpoena-experts-say/\">Elon Musk faces uphill battle against SEC subpoena, experts say</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-09T23:00:23.000Z",
    "title": "Top 5 Altcoins For October 2023 That Could 20X Your Crypto Portfolio",
    "url": "https://www.newsbtc.com/altcoin/5-altcoins-october-2023-20x-crypto/",
    "description": "By now, Bitcoin has grown to the point where crypto investors do not expect very large returns from it and are now looking toward altcoins that could provide the kind of returns they seek. However, with thousands of altcoins circulating in the crypto market, it can become quite hard to pick the coins that could end up doing well. So here are five altcoins that are well-positioned to do well in the next bull market that could potentially 20x your crypto portfolio. Lido DAO (LDO) Is A Top Crypto Contender Lido DAO (LDO) has grown rapidly to dominate the Ethereum liquid staking game, accounting for over 30% of all staked ETH in LSD protocols. This has brought immense attention to its native token, LDO, which on its own has also seen a good run over the years. Related Reading: Crypto Investor Buying Power Just Reached A 6-Month High, What This Means However, at just a $1.4 billion market cap, LDO is still what can be referred to as undervalued given its standing in the decentralized finance (DeFi) sector. A bull market could easily see the market cap of LDO cross $30 billion, which would be a more than 20x return on investment from its current $1.61 price level. Arbitrum (ARB) Dominates Ethereum Layer 2 Altcoins Arbitrum (ARB) features on this list because of the network’s performance over the years. Of all the Ethereum Layer 2 networks currently in the game, Arbitrum leads the pack both in terms of Total Value Locked (TVL) and daily trade volume. This puts it ahead of the likes of Optimism (OP), Avalanche (AVAX), and Polygon (MATIC), all of which have been in the game just as long. However, of the 4 leading Ethereum L2s, Arbitrum has the lowest market cap. At $1.08 billion, it is yet to see the same kind of surge its competitors saw in 2021 due to the token launching in the bear market. Arbitrum’s performance even in a bear market shows that it could easily be a top 10 cryptocurrency in the bull market. Related Reading: Why You Should Pay Attention To The XRP Price Predictions Stacks (STX): The Crypto Child Of Bitcoin Currently, when crypto investors think of NFTs and DeFi on the Bitcoin network, they think of Stacks (STX). This is because Stacks is a Layer 2 network that allows the usage of smart contracts on Bitcoin. This means developers are able to build protocols as well as launch NFT collections on the Bitcoin network using Stacks (STX). STX’s market cap is still very low at just $715 million especially given what it enables developers to do on the Bitcoin network. This offering makes sure that Stacks is always on the radar of investors, making it a billion-dollar token that could easily bring 20x returns. Total market cap excluding Bitcoin is $514 billion &#124; Source: Crypto Total Market Cap Exclude BTC on Tradingview.com Kava (KAVA) Joins The Fun With Layer 1 Technology Kava (KAVA) has been building up into mainstream adoption despite competition with the biggest networks in the space. This Layer 1 blockchain is taking another route to interoperability by combining the best parts of the Ethereum and the Cosmos networks. Related Reading: LINK Price Primed For Meteoric Rise: Analyst Predicts 130% Rally To $18 Ethereum is known for its developer power, enabling developers to build pretty much anything, but still held down by slow transactions and high fees. On the other hand, Cosmos has some of the highest speeds and interoperability and when both of these are combined, it presents basically a supercharged Layer 1 blockchain equipped to handle almost anything. Its native token KAVA is already one of the most watched Layer 1 native tokens, and at a $500 million market cap, it’s fair to say that this altcoin is far from done. Altcoins Are Not Complete Without The Trust Wallet Token (TWT) With so many centralized exchanges running into issues such as hacks and bankruptcy, more crypto investors are choosing to self-custody their coins. The top 2 self-custody wallets that also allow users to take advantage of DeFi and NFTs are MetaMask and Trust Wallet. Since only the latter currently has a token, it has been able to corner that market share for itself. Related Reading: Brace For Impact As $200 Million In Crypto Is Being Unlocked In October Trust Wallet’s native TWT token rose in popularity when the FTX crypto exchange crashed in 2022 and has not stopped. Going into the bull market, self-custody is expected to be the main avenue to store coins and TWT’s current $411 million market cap could quickly turn into an $8 billion market cap in the bull market. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Finbold, chart from TradingView.com"
  }
]