[
  {
    "source": "Decrypt",
    "date": "2023-06-20T14:55:00.000Z",
    "title": "'Play-to-Earn Is Not Dead. It Will Never Die' Says Words with Friends Creator Paul Bettner",
    "url": "https://decrypt.co/videos/interviews/znmOo9vp/play-to-earn-is-not-dead-it-will-never-die-says-words-with-friends-creator-paul-bettner",
    "description": "Words With Friends and Wildcard Creator Paul Bettner tells Decrypt's Kate Irwin about his perspective on Axie Infinity and Web3 games."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-20T14:52:55.000Z",
    "title": "BlackRock Bitcoin ETF filing triggers wave of institutional interest",
    "url": "https://cryptoslate.com/blackrock-bitcoin-etf-filing-triggers-wave-of-institutional-interest/",
    "description": "<p>A survey of professional investors conducted by Nomura-backed &#8220;digital asset business&#8221; Laser Digital found 96% are &#8220;keen to invest in crypto.&#8221; Nomura is an investment bank and brokerage headquartered in Tokyo that spans 30 countries and holds ¥67.3 trillion ($475.4 billion) in assets under management. Renewed institutional crypto interest The survey comprised 303 professional investors [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/blackrock-bitcoin-etf-filing-triggers-wave-of-institutional-interest/\">BlackRock Bitcoin ETF filing triggers wave of institutional interest</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-20T15:00:00.000Z",
    "title": "BlackRock, Fidelity, Bank of America are buying Bitcoin, Tradecurve forming a bullish price pattern",
    "url": "https://cryptodaily.co.uk/2023/06/blackrock-fidelity-bank-of-america-are-buying-bitcoin-tradecurve-forming-a-bullish-price-pattern",
    "description": "<p class=\"s3\">Due to fear of attacks from the U.S. SEC, investors are selling cryptocurrencies, and some companies have begun utilizing this opportunity to aggressively increase their holdings of coins and tokens while their prices are low, hoping that after fears end, they will increase in value.</p>\n<p class=\"s3\">Now, big institutions are increasing their Bitcoin exposure even though the prices have begun plummeting toward the red zone. Alongside all of this, Tradecurve, an upcoming hybrid exchange, has been forming a bullish pattern.</p>\n<p>&gt;&gt;BUY TCRV TOKENS NOW&lt;&lt;</p>\n<p class=\"s7\">Why Large Companies Are Bullish on Bitcoin</p>\n<p class=\"s3\">Throughout the recent months, large corporations have injected huge amounts of liquidity into MicroStrategy, and some of the largest companies to do so include BlackRock and Fidelity, alongside Bank of America. For corporations that are not interested in buying Bitcoin directly, MicroStrategy shares typically serve as a reliable proxy investment, with the goal of getting exposure to the price performance of BItcoin. BlackRock and Fidelity are the top five stock owners of the company, as reported by CNN.</p>\n<p class=\"s3\">With all of that taken into consideration, Bitcoin has been trading at a value of $25,528.55 as of June 16, 2023. In the last week, the low point for the Bitcoin cryptocurrency was at $24,864.61, while the high point was at $26,653.24.</p>\n<p class=\"s3\">Moreover, the all-time high of Bitcoin occurred on November 10, 2021, at $69,044.77, indicating that the cryptocurrency now trades 62.96% under this point of value. In the last 30 days, Bitcoin decreased in value by 4.9%, while in the last 24 hours, it saw an increase of 2.4%.</p>\n<p class=\"s7\">Tradeucurve Has Begun Forming a Bullish Price Pattern</p>\n<p class=\"s3\">After the large accumulation of the Bitcoin cryptocurrency by BlackRock, Fidelity, and Bank of America, it is clear that interest in the blockchain space has spiked, and Tradecurve has also seen a bullish outlook as a direct result of this.</p>\n<p class=\"s3\">The TCRV token spiked by 20% in the previous week, and analysts predict that it can spike 50% by the end of June.</p>\n<p class=\"s3\">Tradecurve is an emerging player in the online trading ecosystem, and it is undergoing its presale run, offering a unique proposition for investors and traders. The platform combines derivatives and crypto trading within a single platform and eliminates any sign-up KYC checks, prioritizing privacy.</p>\n<p class=\"s3\">On Tradedcurve, users from all around the world can trade all derivatives from a single account just by opening one using their email, lining a crypto wallet, and making a deposit. What differentiates Tradecurve from its peers is also the implementation of features such as algorithmic trading using AI and its implementation of Proof of Reserves (PoR).</p>\n<p class=\"s3\">With PoR, transparency is prioritized, and with AI trading bots, trades can be executed a lot quicker and more efficiently when compared to manual trading. Analysts are bullish on the future of TCRV as well and predict a climb of 100x, especially when it gets listed on TIer-1 exchanges and on Uniswap.</p>\n<p class=\"s3\">During Stage 3 of the presale, TCRV traded at $0.015, and now at Stage 4, its price spiked by 20% to $0.018, indicating a bullish pattern. The presale stage kicked off with a flying start, as even after a day, 4,810,042 TCRV tokens have already been sold, indicating that interest is high in the project.</p>\n<p class=\"s3\">For more information about the Tradecurvepresale:</p>\n<p>Click Here For Website</p>\n<p>Click Here To Buy TCRV Presale Tokens</p>\n<p>Follow Us Twitter</p>\n<p>Join Our Community on Telegram</p>\n<p class=\"s3\">&nbsp;</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-20T14:45:00.000Z",
    "title": "Exploring MATIC's Decline & Uwerx’s Spectacular Presale",
    "url": "https://cryptodaily.co.uk/2023/06/exploring-matics-decline-uwerxs-spectacular-presale",
    "description": "<p>In recent times, Polygon (MATIC)&mdash;a layer-2 scaling solution for the Ethereum blockchain&mdash;has experienced a decline in its price following regulatory actions, raising concerns among investors.</p>\n<p>Meanwhile, Uwerx, a decentralized finance (DeFi) project, has been making waves with its impressive presale achievement.</p>\n<p>Let's delve into the current state of Polygon (MATIC) and Uwerx and explore the factors contributing to their respective performances.</p>\n<p class=\"s6\">Will Polygon (MATIC) Emerge Stronger Amidst Regulatory Hurdles?</p>\n<p>Polygon (MATIC)&mdash;previously known as Matic Network&mdash;is a groundbreaking platform designed to scale and develop Ethereum infrastructure effortlessly. Its cornerstone is the Polygon SDK, a versatile framework supporting various application types.</p>\n<p>By effectively transforming Ethereum into a comprehensive multi-chain system, Polygon (MATIC) introduces the concept of an Internet of Blockchains.</p>\n<p>However, the recent regulatory scrutiny by the SEC has cast a shadow on Polygon (MATIC)'s price and future prospects, leading to a decline in its value.</p>\n<p>Polygon (MATIC) is currently priced at $0.6473, with a trading volume of $386,410,068 in the last 24 hours. Despite a live market cap of over $6 billion, the value of Polygon (MATIC) has experienced an almost 25% decline during this period.</p>\n<p>Market predictions for Q4 2023 indicate a possible price of $1.27 for Polygon (MATIC).</p>\n<p class=\"s6\">SolidProof and InterFi Network Audits Validate Uwerx's (WERX) Trustworthiness</p>\n<p>Uwerx, the visionary force in the freelance landscape, is on the verge of a groundbreaking launch. Uwerx takes security to unparalleled heights, safeguarding the project's integrity. With team tokens securely locked for 9 months and plans to lock Token Liquidity locked for a remarkable 25 years, investors can rest assured that their investments are protected for the long haul.</p>\n<p>Uwerx champions decentralization and fairness, vowing to renounce contracts once the project is ready to be launched on centralized exchanges. Uwerx has diligently subjected itself to rigorous audits by leading firms such as SolidProof and InterFi Network. These thorough assessments validate Uwerx's credibility, ensuring a secure and reliable platform for investors to thrive.</p>\n<p>Setting a new industry standard, Uwerx boasts an incredibly low transaction fee of just 1%, starkly contrasting the hefty charges imposed by giants like Upwork and Fiverr. This fee reduction empowers freelancers to earn more while clients benefit from cost-effective services, creating a harmonious and rewarding ecosystem.</p>\n<p>Uwerx has already made waves with its listing on CoinSniper, and anticipation builds as it gears up for its highly anticipated debut on Uniswap by August 1st. These strategic listings unlock a world of possibilities, opening doors for investors to embark on an exciting journey of growth.</p>\n<p class=\"s6\">Uwerx (WERX) Presale: Unleashing a Wave of Excitement with Stage 5 Offerings</p>\n<p>Uwerx's presale is currently making waves in Stage 5, offering tokens at an enticing price of $0.041 each and a 15% bonus on every purchase. Uwerx has shattered records, seamlessly completing presale stages 1 to 4 at an astonishing pace. As the presale draws to a close on July 31st, Uwerx has captivating plans in store, including an exclusive Test Airdrop, giving users a tantalizing taste of the immense possibilities that lie ahead.</p>\n<p>Brace yourself for the game-changing Uwerx Vault, a haven for token holders seeking to optimize their earnings. By staking their WERX tokens securely, users unlock a world of rewards tied to platform variables.</p>\n<p>The Uwerx community flourishes, with over 5,500 sign-ups, 1,600 Twitter followers, and 1,600 Telegram members. The growing numbers testify to the overwhelming interest and support garnered by Uwerx's visionary approach, fueling the anticipation surrounding its transformative impact.</p>\n<p>Uwerx values community feedback as the driving force behind its evolution. In response to the community's needs and desires, token allocations have been thoughtfully adjusted. Share your thoughts and suggestions at feedback@uwerx.network.</p>\nUwerx (WERX) Alpha Platform: Redefining the Freelancing Experience\n<p>Uwerx has unleashed the Alpha version of its platform, showcasing its innovative prowess. This initial release offers users a glimpse into the platform's capabilities, with continuous updates and improvements planned to deliver an unparalleled user experience.</p>\n<p>Uwerx recently unveiled a comprehensive update on the Alpha platform in the form of a detailed and user-friendly PDF spanning ten impressive pages. Uwerx ensures a seamless and intuitive user experience, from the seamless signing-up process to the talent discovery journey. Excitement builds as Uwerx gears up for the transition from Alpha to Beta, signaling a significant milestone in the project's trajectory.</p>\n<p>Holders of Uwerx tokens can anticipate a meticulously designed 6-week vesting period following the conclusion of the presale. This gradual distribution schedule fosters stability and long-term commitment, with increasing percentages over time, allowing token holders to participate in Uwerx's success from day one.</p>\nJoin the presale and be a part of this extraordinary journey!\n<p>Take advantage of the 15% Bonus. Join the Uwerx Revolution Now!</p>\n<p>&nbsp;</p>\n<p class=\"s10\">Presale: &nbsp;invest.uwerx.network</p>\n<p class=\"s10\">Telegram: https://t.me/uwerx_network</p>\n<p class=\"s10\">Twitter: https://twitter.com/uwerx_network</p>\n<p class=\"s10\">Website: https://www.uwerx.network/</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T15:04:31.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T15:02:40.000Z",
    "title": "Germany’s largest bank wants to offer crypto custody services",
    "url": "https://www.cryptopolitan.com/germany-largest-bank-crypto-custody-services/",
    "description": "The financial landscape in Germany is poised for a significant shift, as the country&#8217;s largest banking institution, Deutsche Bank AG, makes strategic strides into the realm of cryptocurrency. With plans to establish a digital asset custody service, Deutsche Bank&#8217;s ambitions indicate an evolution in Germany&#8217;s already forward-thinking approach to crypto regulation. Navigating the future of ... <a title=\"Germany&#8217;s largest bank wants to offer crypto custody services\" class=\"read-more\" href=\"https://www.cryptopolitan.com/germany-largest-bank-crypto-custody-services/\" aria-label=\"More on Germany&#8217;s largest bank wants to offer crypto custody services\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T14:45:16.000Z",
    "title": "How to Use Blockchain to Help Combat Deepfakes and Misinformation",
    "url": "https://www.cryptopolitan.com/blockchain-deepfakes-and-misinformation/",
    "description": "In recent years, the rise of deepfakes and misinformation has become a pressing issue. With the exponential growth of the internet, it&#8217;s now easier than ever to manipulate videos, images, and other forms of digital media to influence public opinion. The public&#8217;s trust in traditional media has also declined, which has resulted in a rise ... <a title=\"How to Use Blockchain to Help Combat Deepfakes and Misinformation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blockchain-deepfakes-and-misinformation/\" aria-label=\"More on How to Use Blockchain to Help Combat Deepfakes and Misinformation\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T14:45:05.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T14:41:41.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years, and there is no stopping it anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. Various APE price highlights unfold in this ApeCoin Price Prediction. How much is ApeCoin ... <a title=\"ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-20T14:55:58.000Z",
    "title": "ASX report says 15% of Australian investors hold crypto",
    "url": "https://crypto.news/asx-report-says-15-of-australian-investors-hold-crypto/",
    "description": "The ASX’s Australian Investor Study 2023 report has revealed that 15% of investors in the country hold crypto. "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-20T15:00:52.000Z",
    "title": "Why Are Shiba Investors Turning To This New Meme Coin For 15,000%",
    "url": "https://www.crypto-news-flash.com/why-are-shiba-investors-turning-to-this-new-meme-coin-for-15000/?utm_source=rss&utm_medium=rss&utm_campaign=why-are-shiba-investors-turning-to-this-new-meme-coin-for-15000",
    "description": "Crypto pumps are like shooting stars—just a blink, and you miss them! That&#8217;s why crypto investors who know the game hop on board even before the hype train arrives. By getting in early, they not only secure the lowest prices but also position themselves for massive profits as the coin takes off. That was the [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-20T15:02:44.000Z",
    "title": "5 Coins to Buy In Market Crash",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/5-coins-to-buy-in-market-crash/",
    "description": "<p>The crypto market has been experiencing a prolonged bear market, characterized by price corrections and overall market decline. While this may cause anxiety for some investors. So, it&#8217;s essential to recognize that such market conditions present a unique opportunity to strategically complete and diversify our portfolios. In this article, we will delve into why we [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/5-coins-to-buy-in-market-crash/\">5 Coins to Buy In Market Crash</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-20T14:55:00.000Z",
    "title": "SEC’s Latest Actions Could Still Hit the Altcoin Market Hard",
    "url": "https://coinedition.com/secs-latest-actions-could-still-hit-the-altcoin-market-hard/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/06-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/06-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/06-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/06-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/06-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/06-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/06-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/06-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/06-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/06-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/06-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/06-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/06-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/06-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/06-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/06-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/06-1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The crypto news platform Crypto Banter warned that the altcoin market onslaught may not be over yet, and the next few weeks may be turbulent for smaller-capped coins. Altcoins such as Polygon (MATIC), Algorand (ALGO), Solana (SOL), and Cardano (ADA) were named as cryptos that could be at risk in their latest video. While the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/secs-latest-actions-could-still-hit-the-altcoin-market-hard/\">SEC’s Latest Actions Could Still Hit the Altcoin Market Hard</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]