[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-30T02:04:59.000Z",
    "title": "Crypto Industry Upheaval in 2023: Review of Layoffs and Bankruptcy",
    "url": "https://www.cryptopolitan.com/crypto-industry-upheaval-layoffs-bankruptcy/",
    "description": "The crypto industry is facing an unprecedented crisis. This crisis is a relentless wave of layoffs and bankruptcies, striking at the heart of even the most established players. In an industry known for its rapid evolution and potential for disruption, the prevalence of such distressing trends signifies a critical juncture for the entire blockchain economy. ... <a title=\"Crypto Industry Upheaval in 2023: Review of Layoffs and Bankruptcy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-industry-upheaval-layoffs-bankruptcy/\" aria-label=\"More on Crypto Industry Upheaval in 2023: Review of Layoffs and Bankruptcy\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-30T02:00:43.000Z",
    "title": "Base Network Gears Up For USDC Integration, Circle CEO Jeremy Allaire Confirms",
    "url": "https://www.newsbtc.com/news/base-network-gears-up-for-usdc-integration-circle-ceo-jeremy-allaire-confirms/",
    "description": "Circle’s CEO Jeremy Allaire has announced that USDC will be launched natively on the Base Network platform next week. Allaire took to social media platform X (formerly known as Twitter) to share this news, emphasizing the benefits and implications of this integration. Circle also confirmed the announcement, stating that USDC issued by Circle will be considered the official form of USDC for the Base Network ecosystem.  They further highlighted that native USDC will gradually replace the currently circulating bridged USDbC liquidity that originates from Ethereum. Base Network&#8217;s Native USDC Integration To Attract Capital? The integration of native USDC on Base Network offers numerous advantages for users and developers alike. Key among these benefits is the expansion of liquidity, as native USDC gains traction within the ecosystem.  Related Reading: Ethereum In Bleak Situation? Sharks &#38; Whales Continue 4-Month Long Selloff An important aspect of the integration is the potential replacement of bridged USDbC (USD Coin on Ethereum) liquidity. Base Network aims to establish a “self-sustaining” ecosystem, where transactions and value transfers occur natively within the network.  Per the announcement, by reducing reliance on external bridges, the integration of native USDC enhances efficiency, security, and scalability, resulting in a more streamlined and user-friendly experience. Notably, the migration process from bridged USDbC to native USDC will be managed by Base Network in collaboration with ecosystem apps to ensure a seamless transition of liquidity.  In addition to the expected boost to the network&#8217;s financial infrastructure, the integration of native USDC aims to create new opportunities for developers to leverage stablecoin functionality within their decentralized applications (dApps).  This integration is also expected to simplify the integration of fiat currency and cryptocurrency for institutional investors, further broadening the appeal and utility of Coinbase’s Base. Importantly, the integration of native USDC will not immediately impact Base Bridge, which will continue to operate “normally”, ensuring uninterrupted functionality for users, according to the announcement made on Monday. Overall, The impending integration of the stablecoin on the Base Network marks an important development for the decentralized ecosystem. The introduction of USDC brings potential benefits such as enhanced liquidity, streamlined value transfer, and increased opportunities for developers.  While the transition from bridged USDbC to native USDC may present challenges, Base Network is committed to managing the migration process effectively and addressing any concerns.  As the launch of native Circle USD on Base Network approaches, industry participants eagerly anticipate its potential impact on liquidity dynamics and the broader cryptocurrency landscape.  Related Reading: Long-Term Bitcoin Holders Keep The Faith: 40% Supply Remains Untouched For Over 3 Years While the integration holds promise, it remains to be seen how successful it will be in attracting users within the Base Network ecosystem. Featured image from iStock, chart from TradingView.com "
  }
]