[
  {
    "source": "CryptoGlobe",
    "date": "2023-11-19T16:56:49.000Z",
    "title": "China Slashes US Treasury Holdings by $518 Billion, Moody’s Lowers US Credit Outlook",
    "url": "https://www.cryptoglobe.com/latest/2023/11/china-slashes-us-treasury-holdings-by-491-billion-moodys-lowers-us-credit-outlook/",
    "description": "Over the past decade, China, the world’s second-largest economy, has been methodically reducing its holdings of US government-backed securities. This strategic move has resulted in China’s holdings of Treasury securities dropping to a level not seen in over 14 years, according to the latest data from the U.S. Treasury Department. According to an article by […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-19T16:59:44.000Z",
    "title": "While Bitcoin Dominance Shadows Altcoins, Could Polygon (MATIC) and Litecoin (LTC) Be Overlooked Treasures?",
    "url": "https://cryptodaily.co.uk/2023/11/while-bitcoin-dominance-shadows-altcoins-could-polygon-matic-and-litecoin-ltc-be-overlooked-treasures",
    "description": "Uncover the impact of Bitcoin's dominance on altcoins like Polygon (MATIC) and Litecoin (LTC) in our focused analysis. Our expert insights offer a concise yet comprehensive view on these cryptos, guiding investors through the complexities of the evolving digital currency landscape. Stay ahead with our analysis to understand if MATIC and LTC are overlooked opportunities or overshadowed assets in Bitcoin's climb."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-19T16:45:50.000Z",
    "title": "Van Gogh NFTs sell for millions as tokens moon again",
    "url": "https://crypto.news/van-gogh-nfts-sell-for-millions-as-tokens-moon-again/",
    "description": "Data from on-chain aggregator CryptoSlam.io shows that a non-fungible token (NFT) rendition of a painting by famed Dutch artist Vincent van Gogh has changed hands for $1.3 million. The transaction comes only a day after another Van Gogh-inspired NFT sold for $1.27 million."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-19T16:40:38.000Z",
    "title": "Hashkey-Affiliated Wallet Sells Over $90 Million ETH In 10 Days – Report",
    "url": "https://www.newsbtc.com/analysis/eth/hashkey-affiliated-wallet-sells-over-90-million-eth-in-10-days-report/",
    "description": "A wallet linked to Hong Kong-based crypto exchange Hashkey has reportedly sold over $90 million worth of Ethereum in the past 10 days. This massive selling activity appears to have triggered a slight decline in the ETH market, sparking speculations on the token’s price trajectory. Related Reading: Ethereum Price Holds Ground – Indicators Suggest Fresh Surge To $2,120 Crypto Whale Conducts Massive Ethereum Sell-Off According to a Sunday post on X  by blockchain analytics platform, Lookonchain, a crypto wallet with the address “0xD26e &#8221; sold off 50,115 ETH, valued at $97.7 million, within a period of 10 days. Lookonchain notes that this wallet is related to Hashkey, having received a majority of the sold-off ETH from the Hong Kong-based exchange.  At an average selling price of $2,047, wallet “0xD26e” conducted its ETH sell-off on the Binance and OKX exchanges, withdrawing $89.6 million USDT and $12.95 million USDC in return.  As earlier stated, ETH dipped by over 4% in the last week, which is likely in response to such massive selling pressure. However, the second-largest cryptocurrency has now found some stability, gaining by 0.92% in the last day, as it attempts to breach the $2000 mark again. Related Reading: Ethereum ETF Race: BlackRock Wants An Ether Spot ETF What&#8217;s Next For ETH?  Looking at ETH’s daily chart, it appears the selling spree by wallet “0xD26e” could be a precaution against an incoming significant decline in the token’s value.  After all, the Relative Strength Index indicates that ETH just left the overbought zone and could still experience more losses in the coming days.  Albeit, this downward trend is likely to be short-lived, considering the high level of investor interest currently around the altcoin due to the brimming Ether spot ETF race in the United States. On Friday, Fidelity Investments became the seventh and the latest asset management giant to join the brawl, having submitted its “Fidelity Ethereum Fund” proposal to the United States Securities and Exchange Commission (SEC). In addition to the Massachusetts-based company, other asset managers looking to launch an Ether Spot ETF include prominent names like  BlackRock, Hasdhdex, Grayscale, VanEck, and 21Shares and Ark.  It is expected that other asset managers will join the race over the next few weeks, which will lead to a rise in positive sentiments towards Ethereum.  While approval by the SEC is still very subjective and uncertain, the mere influx of Ether Spot ETF applications signals an increasing interest in the altcoin from traditional finance investors, which in turn boosts investments in any cryptocurrency.  For example, following reports of Blackrock’s filling on November 9, ETH gained by almost 13% to trade above the $2,130 mark in response to the buying pressure that followed. At the time of writing,  ETH trades at $1,950, with a 0.34% gain in the last hour, according to data from CoinMarketCap. Meanwhile, the token’s trading volume is down by 32.64% and valued at $7. 32 billion. ETH trading at $1.494 on the daily chart &#124; Source: ETHUSDT chart on Tradingview.com Featured image from Expert Investor, chart from Tradingview"
  }
]