[
  {
    "source": "CryptoSlate",
    "date": "2024-04-03T22:04:28.000Z",
    "title": "SEC opens request for comments on 3 spot Ethereum ETFs",
    "url": "https://cryptoslate.com/sec-opens-request-for-comments-on-three-spot-ethereum-etfs/",
    "description": "<p>The SEC has opened comments on Grayscale, Fidelity, and Bitwise&#8216;s applications to launch spot Ethereum exchange-traded funds (ETFs). The notices apply to proposed rule changes through which two exchanges — Cboe BZX and NYSE Arca — aim to list and trade shares of the three funds. Comments are open for 21 days following publication in [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/sec-opens-request-for-comments-on-three-spot-ethereum-etfs/\">SEC opens request for comments on 3 spot Ethereum ETFs</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-03T22:03:40.000Z",
    "title": "Goldman Sachs and its clients still don’t care about crypto",
    "url": "https://www.cryptopolitan.com/goldman-sachs-and-clients-dont-care-crypto/",
    "description": "Let&#8217;s get right into it, shall we? Goldman Sachs, the giant of Wall Street, is as uninterested in cryptocurrencies as I am in my neighbor&#8217;s opinion about my lawn. Despite the buzz, the hype, and the occasional skyrocketing prices that make headlines, Goldman Sachs and its esteemed clientele seem to be on a different frequency [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-03T21:58:42.000Z",
    "title": "Frax Finance and Noble’s Alliance: A New Era in DeFi with Cosmos Integration",
    "url": "https://www.cryptopolitan.com/frax-finance-noble-cosmos-integration/",
    "description": "Frax, a leading company in the line of decentralized finance (DeFi), has revealed a strategic partnership that Noble is engaged in, a step that has extended the company’s offerings into the Cosmos ecosystem. The collaboration would bring on board its tokens and some other Frax financial instruments to the Cosmos network &#8211; a vast network [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-03T21:52:47.000Z",
    "title": "Trump pledges tax cuts and economic boom if reelected president",
    "url": "https://www.cryptopolitan.com/trump-pledges-tax-cuts-and-economic-boom/",
    "description": "Donald Trump, aiming for a comeback, made a bold declaration to all you American people:- elect him again, and your wallets will fatten up with tax cuts while the nation enjoys an economic resurgence. This promise, coming from a man whose presidency was nothing if not eventful, raises eyebrows and questions in equal measure. Trump’s [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-03T22:00:33.000Z",
    "title": "Wormhole $617M Airdrop Ignites Valuation Surge To $3B, But W Price Stumbles 23%",
    "url": "https://www.newsbtc.com/news/wormhole-617m-airdrop-ignites-valuation-surge-to-3b-but-w-price-stumbles-23/",
    "description": "Wormhole, a cross-chain communication protocol enabling the transfer of assets between blockchains, recently launched an airdrop campaign for its newly issued governance token, W. Early users were rewarded with 617 million W tokens, and the protocol also released a roadmap outlining its plans. Wormhole Protocol Unveils Roadmap According to the protocol’s roadmap, W aims to become a native multi-chain token, leveraging the advantages of both the Solana and Ethereum Virtual Machine (EVM) chains.  Initially launched as a native SPL token on Solana, W will reportedly leverage Solana&#8217;s performance, offering increased performance, scalability, low transaction costs, and fast settlement times. Related Reading: Crypto Expert Encourages Investors To Buy The Dip As Bitcoin Price Falls To $64,000 After the Solana debut, W will be extended to all Wormhole-connected EVM chains using Wormhole Native Token Transfers (NTT). This framework allows W to continuously roll out across Solana, the Ethereum mainnet, and Layer 2 (L2s) without liquidity fragmentation. The open-source NTT framework allows projects to control token behavior on each chain, including token standards, metadata, ownership/upgradability, and custom features. Cross-Chain Governance System Wormhole also introduces a governance system where token holders on any supported chain can create, vote on, and implement governance proposals. This approach allows maximum participation in the Decentralized Autonomous Organization (DAO) by providing a frictionless user experience for token holders distributed across multiple chains.  As announced, W holders can lock and delegate their tokens on Solana and EVM chains, allowing them to participate in governance decisions. The Wormhole DAO, composed of W token holders, will oversee the Solana, Ethereum mainnet, and EVM L2s governance system. Wormhole, developed by Jump Crypto, a division of Jump Trading Group, has been under development for several years. Despite encountering challenges, including a significant hack in February 2022 resulting in a loss of approximately $320 million, the protocol has continued to evolve.  Furthermore, the recent listing of the W token on major exchanges such as Crypto.com and the future support planned by Coinbase on April 4 further validate its progress. W’s Debut On OpenBook The W token debuted on the Solana-based decentralized exchange (DEX) OpenBook at $1.66, with a market capitalization of $2.98 billion and a fully diluted value of $16.5 billion.  However, the token&#8217;s market capitalization and fully diluted value have since fallen to $2.2 billion and $12.5 billion, respectively, according to updated data from CoinGecko. Trading volume for W has remarkably increased, reaching $555,937,593 in the last 24 hours, representing a staggering 25,732,359.60% surge. Related Reading: Fear Grips XRP Market As Liquidations Top $6 Million – Details Following the airdrop, some users openly shared their sell-offs of the W token on social media platforms, resulting in a 23% price drop. At the time of writing, the token is trading at $1.32. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-04-03T21:55:00.000Z",
    "title": "Leading Analyst Identifies 10 Altcoins to Buy During this Market Dip",
    "url": "https://coinedition.com/leading-analyst-identifies-10-altcoins-to-buy-during-this-market-dip/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/How-Cardano-beat-5230-altcoins-to-this-major-position.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Experts Highlight 10 Altcoins To Buy This Current Crypto Dip\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/How-Cardano-beat-5230-altcoins-to-this-major-position.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/How-Cardano-beat-5230-altcoins-to-this-major-position-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/How-Cardano-beat-5230-altcoins-to-this-major-position-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Amid the recent market price correction, well-known Bitcoin analyst Michaël van de Poppe took to X to highlight ten altcoins he believes are worth investing in at current bargain prices. According to him, money is made during red markets with prevailing negative sentiments rather than when the market is pumped. Poppe first emphasized that the [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/leading-analyst-identifies-10-altcoins-to-buy-during-this-market-dip/\">Leading Analyst Identifies 10 Altcoins to Buy During this Market Dip</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-04-03T22:01:43.000Z",
    "title": "Wormhole (W) Debuts at Nearly $3,000,000,000 Market Cap After Big Airdrop Goes Live",
    "url": "https://dailyhodl.com/2024/04/03/wormhole-w-debuts-at-nearly-3000000000-market-cap-after-big-airdrop-goes-live/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/Scaling-Altcoin-and-Mid-Cap.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/Scaling-Altcoin-and-Mid-Cap.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/Scaling-Altcoin-and-Mid-Cap.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/Scaling-Altcoin-and-Mid-Cap.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/Scaling-Altcoin-and-Mid-Cap.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/Scaling-Altcoin-and-Mid-Cap.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/Scaling-Altcoin-and-Mid-Cap.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Cross-chain messaging protocol Wormhole (W) has debuted with its new token at a $3 billion market cap following its highly anticipated launch. On Tuesday, the biggest crypto exchanges in the industry announced they were launching support for W, including Binance, OKX, Bitget, Backpack and WOO X. With the token going live early on Wednesday, so did the airdrop, which distributed [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/04/03/wormhole-w-debuts-at-nearly-3000000000-market-cap-after-big-airdrop-goes-live/\">Wormhole (W) Debuts at Nearly $3,000,000,000 Market Cap After Big Airdrop Goes Live</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]