[
  {
    "source": "Cointelegraph",
    "date": "2024-02-02T14:00:00.000Z",
    "title": " UK police may be ‘ill-equipped to handle crypto crimes’ — Fraud victim ",
    "url": "https://cointelegraph.com/news/uk-police-may-be-ill-equipped-to-handle-crypto-crimes",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvODJjNDI5NzMtOTQ0My00YTRiLTk4MDItMWNiYTNmZjRlMDk2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A fraud victim in the U.K. claims that local police failed to request his stolen funds be frozen, even though the tokens were sent to a centralized app that could potentially recover them.</p>\n                    <p><p data-ct-non-breakable=\"true\">The United Kingdom’s National Fraud Intelligence Bureau (NFIB) may be “ill-equipped to handle crypto crimes against UK residents,” according to one resident who was a victim of crypto fraud. </p><p>The victim, Martin — a British national who spoke to Cointelegraph on the condition that his full identity be redacted — claims that he lost approximately $46,000 worth of crypto to a scammer who posed as a Ledger employee. However, after he alerted the NFIB to the fraud, the agency allegedly failed to take appropriate measures to retrieve his stolen funds. </p><p data-ct-non-breakable=\"true\">As told by Martin, the scammer contacted him by phone on Sept. 28, 2023, claiming to be a Ledger representative. The fake representative convinced him that a hacker had attempted to use his recovery phrase to steal his crypto. Martin was told that his Ledger device would be upgraded to “security level 3” if he took certain steps. But in reality, these steps consisted of cutting and pasting the scammer’s crypto addresses (which were sent through text) and confirming transactions to send his crypto to the scammer.</p><p><a href=\"https://cointelegraph.com/news/uk-police-may-be-ill-equipped-to-handle-crypto-crimes\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-02T14:00:00.000Z",
    "title": " US Gov’t surveys crypto mining’s impact on electricity use ",
    "url": "https://cointelegraph.com/news/us-crypto-mining-electricity-survey-energy-department",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvOWM2YzYyNTEtNDY4MS00NjRkLWE2NmQtZmVmMDY2ZWIzYjM1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The U.S. Energy Information Administration will conduct a six-month mandatory survey involving all commercial cryptocurrency proof-of-work mining companies in the country. </p>\n                    <p><p data-ct-non-breakable=\"true\">The United States Department of Energy (DOE) has begun a mandatory information collection drive to develop a “baseline snapshot” of the energy consumption of the country’s cryptocurrency mining industry.</p><p>As Cointelegraph previously reported, the DOE’s Energy Information Administration (EIA) will carry out a <a href=\"https://cointelegraph.com/news/bitcoin-pump-sees-emergency-survey-crypto-miner-energy\">provisional survey to measure the electricity usage</a> of local mining firms. The DOE’s statistics agency received approval for its “emergency request” to collect data in January 2024.</p><p>Cointelegraph contacted the EIA to confirm finer details of the data collection drive and its reasoning. EIA media relations representative Morgan Butterfield cited a memorandum from the agency’s Administrator, Joe DeCarolis, requesting emergency clearance, which outlines the organization’s belief that the resurgent price of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is driving increased mining activity in the United States:</p><p><a href=\"https://cointelegraph.com/news/us-crypto-mining-electricity-survey-energy-department\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-02T14:00:19.000Z",
    "title": "Bitcoin’s STH Realized Price nears $40,000, signaling strong market momentum",
    "url": "https://cryptoslate.com/insights/bitcoins-sth-realized-price-nears-40000-signaling-strong-market-momentum/",
    "description": "<p>Quick Take The Realized Price, a critical component in analyzing the behavior of Bitcoin investors, provides a snapshot of the aggregate price at which each coin was last spent on-chain. This metric allows for the distinction between Short-Term Holders (STH) and Long-Term Holders (LTH). The STH Realized Price, showcasing the average acquisition price for coins [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoins-sth-realized-price-nears-40000-signaling-strong-market-momentum/\">Bitcoin&#8217;s STH Realized Price nears $40,000, signaling strong market momentum</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-02T14:02:39.000Z",
    "title": "Zentu Genesis Crosses 100 million ABBC Milestone in No Time",
    "url": "https://cryptodaily.co.uk/2024/02/zentu-genesis-crosses-100-million-abbc-milestone-in-no-time",
    "description": "Zentu has reached remarkable heights, with the network genesis allocation totaling 100 million ABBC exchanged for ZENT in just a few weeks."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-02T13:53:45.000Z",
    "title": "Presale, Pushd’s (PUSHD) presale stage 4 still available as SUI (SUI) investors lump in big, amid Polygon (MATIC) future",
    "url": "https://cryptodaily.co.uk/2024/02/presale-pushds-pushd-presale-stage-4-still-available-as-sui-sui-investors-lump-in-big-amid-polygon-matic-future",
    "description": "Pushd (PUSHD) is taking over the blockchain economy and investors and investors are more than happy to let it."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-02T13:46:19.000Z",
    "title": "DeeStream (DST) could be the best investment in 2024 as Ripple (XRP) and Dogecoin (DOGE)",
    "url": "https://cryptodaily.co.uk/2024/02/deestream-dst-could-be-the-best-investment-in-2024-as-ripple-xrp-and-dogecoin-doge",
    "description": "In a situation where there are unclear movements of digital assets and notable actions from significant holders, uncertainties surround Ripple (XRP) and Dogecoin (DOGE)."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-02T13:40:11.000Z",
    "title": "Toncoin (TON) & Ethereum (ETH) Best Investment of 2024? We Say Yes To DeeStream (DST) With Potential To Rival Twitch & Youtube",
    "url": "https://cryptodaily.co.uk/2024/02/toncoin-ton-ethereum-eth-best-investment-of-2024-we-say-yes-to-deestream-dst-with-potential-to-rival-twitch-youtube",
    "description": "In a year of market changes, Toncoin (TON) remains stable. Ethereum (ETH) anticipates positive movement with ETF approval."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-02T14:09:10.000Z",
    "title": "The Rise of Deepfake Images on Social Media Raises Concerns and Legal Questions",
    "url": "https://www.cryptopolitan.com/rise-of-deepfake-images-on-social-media/",
    "description": "Deepfake images, which are photos, videos, or audio clips created by artificial intelligence to look and sound realistic, continue to proliferate on social media platforms, clouding the online landscape. Even individuals with expertise in digital media, like Carnegie Mellon University professor Ari Lightman, admit their vulnerability to falling for deepfake content. The ease with which [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-02T14:00:00.000Z",
    "title": "Dramatic Increase in NuggetRush (NUGX) Trade Volume Marks a Shift from Established Cryptos like Litecoin (LTC) and Chainlink (LINK)",
    "url": "https://www.cryptopolitan.com/dramatic-increase-in-nuggetrush-nugx-trade-volume-marks-a-shift-from-established-cryptos-like-litecoin-ltc-and-chainlink-link/",
    "description": "TLDR Transaction count on Litecoin (LTC) has soared, reaching 16 million in the first month of 2024. Chainlink’s (LINK) plan for asset tokenization has also increased user interest. Yet, NuggetRush (NUGX) continues to win hearts after its presale sold nearly 167 million tokens and raised over $2 million. Analysts agree that NuggetRush’s (NUGX) numbers are [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-02T14:00:00.000Z",
    "title": "Crypto Investor’s 2024 Playbook: The 6 Leading AI Tokens to Monitor",
    "url": "https://www.cryptopolitan.com/crypto-investors-2024-playbook-the-6-leading-ai-tokens-to-monitor/",
    "description": "2024 is shaping up to be a wild ride in the blockchain universe, and if you&#8217;re not keeping your eye on the AI token ball, you might just miss out. With innovation popping off left and right, here are six AI tokens that are totally reshaping the game. Whether you&#8217;re here to HODL, swap, or [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-02T13:55:24.000Z",
    "title": "Analysts Say New Cardano Alternative Now at $0.1 Could Repeat ADA’s 63000% annual Gains Seen in 2021",
    "url": "https://www.cryptopolitan.com/analysts-say-new-cardano-alternative-now-at-0-1-could-repeat-adas-63000-annual-gains-seen-in-2021/",
    "description": "Retik Finance (RETIK) has recently emerged as a project garnering attention. Analysts are drawing parallels between Retik Finance&#8217;s current position at $0.1 and Cardano&#8217;s (ADA) extraordinary annual gains of 63,000% witnessed in 2021.&#160; Understanding ADA&#8217;s 2021 Gains: Before delving into Retik Finance&#8217;s potential, it&#8217;s crucial to understand the factors that contributed to Cardano&#8217;s exceptional gains [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-02T13:55:18.000Z",
    "title": "Indicator responsible for the 1000% Solana rally in 2023 appears in Retik Finance (RETIK)",
    "url": "https://www.cryptopolitan.com/indicator-responsible-for-the-1000-solana-rally-in-2023-appears-in-retik-finance-retik/",
    "description": "Decentralized finance (DeFi) has undergone tremendous growth recently, with innovative crypto platforms aiming to transform traditional financial services. One such trailblazer grabbing attention is Retik Finance (RETIK) &#8211; a multi-product DeFi ecosystem featuring decentralized debit cards, a non-custodial wallet, and AI-powered P2P lending capabilities. Now, a key indicator is emerging within Retik that previously preceded [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-02T13:55:17.000Z",
    "title": "Bank of England Governor Expresses Optimism about AI’s Impact on Jobs",
    "url": "https://www.cryptopolitan.com/bank-of-england-optimism-about-ais-on-jobs/",
    "description": "Bank of England Governor Andrew Bailey has expressed optimism about the role of artificial intelligence (AI) in the job market, stating that he does not anticipate AI to be a &#8220;mass destroyer of jobs.&#8221; In a recent interview with the BBC, Bailey emphasized that UK financial institutions are recognizing the &#8220;great potential&#8221; of AI technology. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-02T13:44:08.000Z",
    "title": "AI ‘Friend’ Replika Helps Students Avoid Suicide, Stanford Study Reveals",
    "url": "https://www.cryptopolitan.com/ai-friend-helps-students-avoid-suicide/",
    "description": "In a recent study conducted by experts at Stanford University, it has been found that AI chatbots capable of impersonating real-life people and generating human-like responses can play a crucial role in helping struggling students avoid suicide. The research, published in Nature, focused on 1,006 students who used the Intelligent Social Agent (ISA) known as [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-02T13:44:30.000Z",
    "title": "DeeStream presale draws Litecoin and Solana holders",
    "url": "https://crypto.news/deestream-presale-draws-litecoin-and-solana-holders/",
    "description": "DeeStream is drawing Litecoin and Solana holders in the ongoing DST presale"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-02T14:00:31.000Z",
    "title": "Timeline For All Shiba Inu Projects Revealed As SHIB Price Readies To Soar",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-project-timelines-shib-price/",
    "description": "Shiba Inu marketing lead Lucie has given an insight into the timeline for the upcoming developments of the project, sending the SHIB army into a tizzy. Speaking via X (formerly Twitter), Lucie provided a glimpse into the roadmap after a meeting with the project&#8217;s lead, Shytoshi Kusama. Lucie stated, “After meeting with Shytoshi Kusama, I can&#8217;t reveal much, but I can say one thing: The goal is to have everything finished by the end of this year. The whole vision should be completed by 2024/2025. It&#8217;s not a promise, but that&#8217;s the goal.&#8221; This ambitious timeline suggests a rapid pace of development for the Shiba Inu ecosystem. The marketing lead emphasized the potential impact of these developments on the Shibarium, BONE, and the SHIB token itself, particularly highlighting the role of decentralized applications (dApps) and strategic partnerships. &#8220;With every dapp usage on Shibarium and many significant partnerships in the works, it should have an amazing impact on Shibarium, BONE, while also contributing to burning SHIB,&#8221; she said. Related Reading: Shiba Inu Prints Rare Bullish Signal, Eyes This Price Target Lucie further elaborated on the significance of the DAO, stating, &#8220;The Dao will showcase the real power of LEASH and Shiboshis.&#8221; Furthermore, the Shiba Inu team appears to be gearing up for another step forward with the SHIB Metaverse, with Lucie teasing, “As for the Shib the Metaverse&#8230; well, we will see. One world, one financial state. All hail to the real holders!” Shiba Inu Price On The Verge Of A Breakout? The SHIB cryptocurrency is currently exhibiting signs of consolidation within a descending channel pattern, hinting at a potential breakout in the near term. As of the latest data, SHIB trades at $0.00000904 against the US dollar on the Coinbase exchange, with a modest 1.8% decrease in the last 24-hours. Technical analysis of the SHIB/USD pair in the 4-hour indicates that the price is oscillating within a descending channel, which is typically considered a bearish pattern but can lead to a bullish breakout if the price breaches the upper boundary. The price has touched the larger trend line support derived from the weekly chart, suggesting a strong historical support level. The Exponential Moving Averages (EMAs) on the 4-hour chart provide key levels to watch. The 200-EMA ($0.00000938), 20-EMA, 50-EMA, and 100-EMA are layered above the current price, with the 200-EMA acting as the most important resistance. Related Reading: Crypto Analyst Predicts Shiba Inu Price To Surge Above $0.00001 Volume is quite low, which does not highlight significant buying or selling pressure at the moment. The Relative Strength Index (RSI) is hovering around the 49.69 mark, which is just below the neutral 50 level, indicating an equilibrium between buyers and sellers. A move above 50 in the RSI could signal increasing buying momentum, which might assist in a bullish breakout from the channel. Fibonacci retracement levels from the recent swing high to low show that the 0.236 level at $0.00000878 has been acting as the most crucial support recently, while the 0.382 level at $0.00001050 and the 0.5 level at $0.00001188 are potential upside resistance levels that come into focus when SHIB breaks out of the descending channel. For SHIB to confirm a bullish breakout, it needs to consistently close above the upper boundary of the descending channel and the 200-EMA. A decisive 4-hour candlestick close above these levels could encourage further buying, potentially leading to a test of the 0.382 Fibonacci level. Moreover, it&#8217;s crucial for bulls to maintain the price above the larger trend line support to avoid a bearish turnover that could see SHIB revisiting lower support levels. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-02T14:07:15.000Z",
    "title": "Shiba Inu’s Greed Factor Shines Amid Weekly Price Dips",
    "url": "https://www.crypto-news-flash.com/shiba-inus-greed-factor-shines-amid-weekly-price-dips/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-greed-factor-shines-amid-weekly-price-dips",
    "description": "<img width=\"2133\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-dark-yellow-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shiba-Inu-SHIB-logo-with-dark-yellow-background\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-dark-yellow-background.jpg 2133w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-dark-yellow-background-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-dark-yellow-background-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-dark-yellow-background-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-dark-yellow-background-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-dark-yellow-background-2048x1152.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-dark-yellow-background-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-dark-yellow-background-450x253.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Shiba-Inu-SHIB-logo-with-dark-yellow-background-1200x675.jpg 1200w\" sizes=\"(max-width: 2133px) 100vw, 2133px\" />Shiba Inu trading sentiment shows ‘Greed’ despite the current drawdown. The SHIB ecosystem is making plans for automatic token burning that might push prices higher. Shiba Inu (SHIB) has captured the attention of the crypto market with its resilient &#8220;Greed Factor&#8221; even in the face of the week-long decline in its price. Currently priced at [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-02T14:02:02.000Z",
    "title": "Gate.io and D3 Partner to Apply for and Obtain ‘.Gate’ Top-Level Domain",
    "url": "https://www.crypto-news-flash.com/gate-io-and-d3-partner-to-apply-for-and-obtain-gate-top-level-domain/?utm_source=rss&utm_medium=rss&utm_campaign=gate-io-and-d3-partner-to-apply-for-and-obtain-gate-top-level-domain",
    "description": "<img width=\"1200\" height=\"600\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/IMG_9310.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/IMG_9310.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/IMG_9310-300x150.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/IMG_9310-768x384.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/IMG_9310-150x75.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/IMG_9310-450x225.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Feb 2nd, Panama City &#8211; Gate.io, a leading cryptocurrency exchange and Web3 innovator, has announced its partnership with D3 Global, a next-gen domain name company developing interoperable digital identities, to apply for and obtain the &#8216;.gate&#8217; Top-Level Domain (TLD) during ICANN&#8217;s upcoming application window. This move makes Gate.io the first cryptocurrency exchange to express interest [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-02T13:50:07.000Z",
    "title": "Internet Computer (ICP) Price Prediction 2024-2030: Will ICP Price Hit $25 Soon?",
    "url": "https://coinedition.com/internet-computer-icp-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/Internet-Computer-ICP-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Internet Computer (ICP) Price Prediction 2022\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/Internet-Computer-ICP-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/Internet-Computer-ICP-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/Internet-Computer-ICP-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/Internet-Computer-ICP-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/Internet-Computer-ICP-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In addition to Bitcoin and Ethereum, the Internet Computer (ICP) is the third key invention in the blockchain technology space.&#160; Internet Computer is a collection of protocols that enables independent data centers around the world to collaborate and give a decentralized alternative to the present centralized internet cloud providers. The ICP token is utilized for [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/internet-computer-icp-price-prediction/\">Internet Computer (ICP) Price Prediction 2024-2030: Will ICP Price Hit $25 Soon?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]