[
  {
    "source": "BTCManager",
    "date": "2023-07-16T12:09:40.000Z",
    "title": "Fake LayerZero airdrop drains victims’ wallets",
    "url": "https://crypto.news/fake-layerzero-airdrop-drains-victims-wallets/",
    "description": "A recent phishing attack involving a fake LayerZero airdrop targeting Twitter users has drained multiple crypto wallets. In a recent tweet, the security firm Certik advised users to be careful about any airdrops. They further said that the fake giveaway&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-16T12:34:31.000Z",
    "title": "Synthetix (SNX) Up By 35% In Anticipation Of New Decentralized Exchange",
    "url": "https://www.newsbtc.com/snx/synthetix-snx-up-by-35-in-anticipation-of-new-decentralized-exchange/",
    "description": "SNX, the native token of the Synthetix Network, has been on the rise, gaining more than 35% in the past week. The cryptocurrency continues to exhibit strong bullish momentum, having registered a positive market performance over the past few weeks. SNX’s recent price surge has been linked to the positive sentiment surrounding the Synthetix network. A few days ago, the protocol announced its plan to release a new decentralized exchange (DEX). Related Reading: Dogecoin Engagement Fails To Impress, Raising Concerns About Broader Interest Synthetix Token Tallies 35% In One Week &#8211; Price Overview The cryptocurrency market experienced a jolt of positivity after the long-running battle between payments and technology firm Ripple &#8211; the company behind XRP &#8211; and the United States Securities and Exchange Commission (SEC) came to a positive conclusion on Thursday. US District Judge Annalisa Torres delivered a landmark judgment declaring the XRP token as non-security, thereby granting a decisive triumph for Ripple. However, unlike other cryptocurrencies, the price of SNX barely reacted to this piece of news. The token’s value increased by a mere 5% following the announcement of the court’s decision. SNX did experience a surge of its own the following day. On Friday, July 14, the token’s price jumped by nearly 40%, touching the $3 level before retracing back to $2.5. As of this writing, the Synthetix token is valued at $2.82, with an 8% price increase in the last 24 hours. With a market cap of $903.4 million, SNX ranks as the 47th-biggest cryptocurrency, according to CoinGecko data. SNXUSD trading at $2.738 &#124; Source: SNXUSD chart from TradingView The recent increase in SNX&#8217;s price is believed to have been triggered by the announcement of a new Synthetix trading product. In a blogpost released on Friday, the protocol&#8217;s founder Kain Warwick unveiled plans to introduce a new derivatives front-end called Infinex. What Is Infinex? Infinex is a new derivatives front-end to the decentralized trading infrastructure of Synthetix. The exchange is expected to be an improvement on the already-existing Kwenta, Synthetix’s derivatives decentralized exchange on Optimism. According to Kain Warwick, Infinex will remove the impediments to the growth of Synthetix&#8217;s decentralized trading ecosystem. Firstly, it will address the inconvenience of acquiring sUSD, Synthetix’s stablecoin, to begin trading on Kwenta. Also, it will eliminate the need to sign every action on the current platform. Warwick claims that the purpose of Infinex is to provide competition for centralized exchanges (CEXs) while eliminating any uncertainty surrounding decentralized perpetuals (Perps). The blogpost also revealed that Infinex will cater to users familiar with CEX platforms, providing its trading services through a username and password. With this, users would be able to generate a public-private key pair, which will be locally stored in the browser. It is worth noting that this key pair is not designed for fund withdrawals. Instead, it would be used to sign trades on the upcoming decentralized exchange. While the blogpost didn&#8217;t reveal the exact launch date of Infinex, it disclosed that the project’s introduction should come alongside the release of Synthetix’s Perps V3.  Related Reading: Stablecoin TrueUSD To Be Fully Controlled By Asian Owner Featured image from Adobe Stock, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-16T12:34:57.000Z",
    "title": "Multichain Shuts Down as CEO Detained: Alleged $220 Million Fund Movement by CEO’s Sister",
    "url": "https://www.crypto-news-flash.com/multichain-shuts-down-as-ceo-detained-alleged-220-million-fund-movement-by-ceos-sister/?utm_source=rss&utm_medium=rss&utm_campaign=multichain-shuts-down-as-ceo-detained-alleged-220-million-fund-movement-by-ceos-sister",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/10/police-g9a23f5412_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/10/police-g9a23f5412_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/police-g9a23f5412_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/police-g9a23f5412_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/police-g9a23f5412_1920-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/police-g9a23f5412_1920-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/police-g9a23f5412_1920-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/police-g9a23f5412_1920-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/police-g9a23f5412_1920-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/police-g9a23f5412_1920-48x32.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Zhaojun, the CEO of Multichain, was arrested by Chinese officials.  Zhaojun’s sister was also taken into custody, after allegedly tampering with users&#8217; funds.  Multichain, a leading cross-chain router protocol, has recently hit rock bottom, following a series of unfortunate events. The organization, which is most known for facilitating and deploying blockchain applications with speed, has [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-16T12:15:37.000Z",
    "title": "Circle CEO Warns: Protect Stablecoins or Risk Dollar’s Global Dominance, Stellar’s USDC Stablecoin Gains Momentum",
    "url": "https://www.crypto-news-flash.com/circle-ceo-warns-protect-stablecoins-or-risk-dollars-global-dominance-stellars-usdc-stablecoin-gains-momentum/?utm_source=rss&utm_medium=rss&utm_campaign=circle-ceo-warns-protect-stablecoins-or-risk-dollars-global-dominance-stellars-usdc-stablecoin-gains-momentum",
    "description": "<img width=\"640\" height=\"427\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/US-dollar-burn.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/US-dollar-burn.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/US-dollar-burn-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/US-dollar-burn-104x69.jpg 104w\" sizes=\"(max-width: 640px) 100vw, 640px\" />Circle CEO Jeremy Allaire warns that without protection and regulation of stablecoins, the US dollar&#8217;s position as the world reserve currency is at risk. Congress is preparing to vote on stablecoin legislation, with debates surrounding the authority of the Federal Reserve and oversight of stablecoin issuers. A Critical Vote on Stablecoin Laws Approaches Jeremy Allaire&#8217;s [...]"
  }
]