[
  {
    "source": "CoinDesk",
    "date": "2024-01-11T08:55:44.000Z",
    "title": "Bitcoin ETF Approval Marks Conclusion of a Decade-Long Journey",
    "url": "https://www.coindesk.com/markets/2024/01/11/bitcoin-etf-approval-marks-conclusion-of-a-decade-long-journey/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Much has changed since the Winklevoss filed unsuccessfully for the first Bitcoin ETF in July 2013."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-11T09:04:00.000Z",
    "title": " BlackRock SEC approval record at 576-1 post-BTC ETF nod — Is Ether ETF next? ",
    "url": "https://cointelegraph.com/news/blackrock-sec-approval-576-1-btc-etf-ether-etf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZjZjOTg0MjMtYjU2NC00YzU0LTkzNWMtNTM2ZWJmYTZlZTAwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>BlackRock filed for a spot Ether ETF in November 2023, with the final deadline for the SEC’s decision slated for May 2024. </p>\n                    <p><p data-ct-non-breakable=\"true\">The world’s largest asset manager, BlackRock and ten other institutional giants, got the Securities and Exchange Commission’s (SEC) approval to <a href=\"https://cointelegraph.com/news/300m-crypto-long-liquidations-5-things-bitcoin-this-week\">launch the first spot Bitcoin exchange-traded fund (ETF) </a>in the United States on Jan. 10.</p><p>The race for the spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) ETF began in June 2023, with <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-new-sec-filings-wisdomtree-invesco\">BlackRock joining the race with its filing in June</a>. BlackRock’s entry in the spot Bitcoin ETF race gave a new sense of optimism among crypto proponents not only because it’s the world’s largest asset manager with over $8 trillion in assets under management, but also given its impeccable ETF approval record.</p><p>BlackRock had a record of 575 approvals against one ETF rejection in its history, and with spot BTC approval, the record now stands at 576-1. This was one of the key reasons that made analysts and market pundits sure about a potential approval even before the actual approval came in. </p><p><a href=\"https://cointelegraph.com/news/blackrock-sec-approval-576-1-btc-etf-ether-etf\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-11T08:40:00.000Z",
    "title": " SEC bent rules for spot Bitcoin ETF approvals — Commissioner Uyeda ",
    "url": "https://cointelegraph.com/news/sec-bent-rules-for-spot-bitcoin-etf-approvals-commissioner-uyeda",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNzhjNDJiYWEtYWViYS00OGU4LWIxNmUtM2QyZDM2Zjg0MzA0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>SEC Commissioner Mark Uyeda cited “strong concerns” with three aspects of the spot Bitcoin ETF approval order.</p>\n                    <p><p data-ct-non-breakable=\"true\">Soon after the United States Securities and Exchange Commission (SEC) <a href=\"https://cointelegraph.com/news/sec-spot-bitcoin-etf-approvals\"></a><a href=\"https://cointelegraph.com/news/sec-spot-bitcoin-etf-approvals\">approved the applications</a> of several fund managers to list spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) <a href=\"https://cointelegraph.com/learn/bitcoin-etfs-a-beginners-guide-to-exchange-traded-funds\">exchange-traded funds (ETFs)</a>, SEC Commissioner Mark Uyeda published a statement revealing “strong concerns” with three aspects of the approval order.</p><p>Uyeda voted in favor of the landmark approvals of the Bitcoin ETF applications. However, he criticized the underlying analytical approach by which the commission reached its decision. Fearing that the SEC’s rationale and legal analysis could set a precedent for the future, Uyeda <a href=\"https://www.sec.gov/news/statement/uyeda-statement-spot-bitcoin-011023\" target=\"_blank\" rel=\"noopener nofollow\">stated</a>: </p><p data-ct-non-breakable=\"true\">According to Uyeda, the SEC missed out on the opportunity to treat Bitcoin like any other commodity. Instead, the commission historically singled out the Bitcoin ETFs after they failed to satisfy its novel “significant size” test. </p><p><a href=\"https://cointelegraph.com/news/sec-bent-rules-for-spot-bitcoin-etf-approvals-commissioner-uyeda\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-11T08:45:25.000Z",
    "title": "Solana Saga Smartphone Users Reap Rewards: Airdropped NFTs Surpass Phone’s Cost",
    "url": "https://www.cryptoglobe.com/latest/2024/01/solana-saga-smartphone-users-reap-rewards-airdropped-nfts-surpass-phones-cost/",
    "description": "Around mid-December 2023, sales of the Solana Mobile Saga smartphone saw a remarkable increase, primarily fueled by the excitement within the cryptocurrency community. This spike in sales was attributed to the realization that owning a Saga phone could be financially advantageous. Each Saga phone purchaser was eligible to receive an airdrop of 30 million Bonk […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-11T09:01:36.000Z",
    "title": "Polygon Set To Power The First TradFi-Focused Ethereum Layer-2",
    "url": "https://cryptodaily.co.uk/2024/01/polygon-set-to-power-the-first-tradfi-focused-ethereum-layer-2",
    "description": "Polygon Labs has unveiled the Libre Chain, a protocol powered by the Polygon CDK and backed by the biggest names in institutional blockchain adoption."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-11T09:00:54.000Z",
    "title": "Kelly Carlin Criticizes AI-Generated George Carlin Special",
    "url": "https://www.cryptopolitan.com/kelly-carlin-criticizes-ai-george-carlin/",
    "description": "Comedian George Carlin&#8217;s daughter, Kelly Carlin, has voiced her disapproval of an AI-generated comedy special that imitates her late father&#8217;s iconic style and voice. The AI, known as Dudesy, released an hour-long special titled &#8220;George Carlin: I&#8217;m Glad I&#8217;m Dead,&#8221; prompting Kelly Carlin to express her concerns on social media. This controversy raises questions about [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-11T08:45:49.000Z",
    "title": "Aave Price Prediction 2024-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2024-2032 How much is Aave worth today? Today’s live Aave price is $108.92, with a 24-hour trading volume of $247,669,595. Aave is up 10.04% in the last 24 hours. The current CoinMarketCap ranking is #51, with a live market cap of $1,602,451,980. It has a circulating supply of 14,705,089 AAVE coins and [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-11T08:55:47.000Z",
    "title": "First ETF Trading Day Could Blast Bitcoin Price Past $50,000: Here’s Why",
    "url": "https://www.newsbtc.com/news/bitcoin/first-etf-trading-day-bitcoin-price/",
    "description": "The crypto space witnessed a historic moment yesterday with the approval of 11 spot Bitcoin Exchange-Traded Funds (ETFs), a development that&#8217;s been eagerly anticipated since the Winklevoss twins filed for the first proposed Bitcoin ETF back on July 1, 2013. This pivotal event coincides with the 15th anniversary of Hal Finney&#8217;s tweet “Running Bitcoin,” marking a symbolic milestone in the digital currency&#8217;s journey. Despite the monumental approval by the US Securities and Exchange Commission (SEC), Bitcoin&#8217;s price reaction was muted, maintaining stability around the $46,000 mark. This suggests that the approval had already been factored into the market price. However, the landscape could shift dramatically with today&#8217;s commencement of trading for these ETFs. Spot ETFs, as opposed to future ETFs, necessitate the acquisition of physical Bitcoins by the issuers, thereby exerting direct buying pressure on the market. This aspect, combined with the high conviction among long-term investors (&#8220;hodlers&#8221;) and the historic low Bitcoin reserves on crypto exchanges, sets the stage for potentially volatile price movements. Staggering Bitcoin Inflow Projections For Day 1 Projections for ETF inflows are staggering. Bloomberg anticipates a record-breaking $4 billion inflow on the first trading day for spot Bitcoin ETFs, with issuers collectively contributing $312.8 million in Bitcoin seeding. BlackRock&#8217;s ETF is particularly notable, with an expected $2 billion in inflows, as per Bloomberg Intelligence. Related Reading: BREAKING: SEC Approves All 11 Spot Bitcoin ETFs, BTC Price Holds Steady At $46,000 Standard Chartered recently projected that 2024 could see $50-100 billion in spot Bitcoin ETF inflows, with a potential Bitcoin price reaching $200,000 by the end of 2025. Mike Alfred, a Bitcoin expert, commented on the potential scale of these inflows: Bitwise has confirmed they have $100M+ of investor commitments for tomorrow on day 1. I&#8217;m certain Blackrock is hoping for $3-4B. Invesco/Galaxy will also come out swinging. That&#8217;s a lot of corn. Hope the exchanges are ready. Tuur Demeester of Adamant Research highlighted the significance of the ongoing fee war among issuers, suggesting that the intense competition reflects expectations of substantial capital inflows. “The intensity of this Bitcoin ETF bidding war is telling me the issuers believe that the winner’s low fees will be compensated by HUGE $$ inflows,” he remarked. Related Reading: Sell The News: Bitcoin Short-Term Holders Participate In $2 Billion Selloff Alistair Milne from Altana Digital echoed these sentiments, anticipating record-breaking inflows and a resultant surge in global interest in Bitcoin. “Tune in tomorrow when we&#8217;ll try to break the record for first day ETF inflows, create global FOMO and initiate the Bitcoin supercycle,” Milne wrote via X. Meanwhile, on-chain analyst Axel Adler Jr. may have found a reason for Bitcoin’s lagging performance so far. He pointed out that “miners have decided to take advantage of the cash inflow into the market.” Next Target $50,000? Raghu Yarlagadda, CEO of FalconX, in an interview with Bloomberg Technology, emphasized the crucial impact of net inflows on BTC&#8217;s price in the coming week: What we&#8217;ve been hearing is most people are pricing in net inflows into Bitcoin in the first week or so at $1 to $2 billion. So if the net inflows are less $1 to $2 billion, it will have an adverse effect on price, and if it is more than $1 to $2 billion, it will have a positive effect on price. 1/ Based on customer conversations, $1 to $2 billion of spot #BitcoinETF inflows in the first week are priced into Bitcoin at $45K. Inflows could be more with ETF fee wars beginning this morning. 2024 is setup well for crypto with ETF approval, BTC halving, Ethereum upgrade, and… pic.twitter.com/L71Lkscfh5 &#8212; Raghu Yarlagadda (@2Ragu) January 8, 2024 British HODL, a known analyst on X, provided a deeper insight into the current market dynamics, explaining the lack of immediate price movement post-ETF approval and outlining scenarios for significant price changes depending on the inflows after the ETFs start trading. “For anyone wondering, Bitcoin price has not moved because: Leverage was wiped out yesterday, everyone who wanted in before the ETF, seems to be in. Only after 9.30am tomorrow can the ETFs actually start accepting capital and thus start acquiring Bitcoin,” he stated and added that if Bloomberg is right with $4 billion coming in on the first day, “we *could* see a price of $50k-$57k by close of trading on Friday. The buying pressure has not even STARTED yet.” At press time, BTC continued its sideways trend and traded at $46,267. Featured image created with DALL·E, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-11T09:00:48.000Z",
    "title": "Urgent Update for Cryptocurrency Investors: The Next Big Winners",
    "url": "https://www.crypto-news-flash.com/urgent-update-for-cryptocurrency-investors-the-next-big-winners/?utm_source=rss&utm_medium=rss&utm_campaign=urgent-update-for-cryptocurrency-investors-the-next-big-winners",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-78.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-78.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-78-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-78-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-78-450x300.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />For those who fear missing out on the next big thing in the crypto world, experts reveal three winners: Borroe Finance ($ROE), Aptos (APT), and Ordinals (ORDI). As Aptos announced its unlocking event, Ordinals Wallet announced support for BRC-420. In contrast, $ROE’s presale has been making significant strides. Let’s find out the best coins to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-11T08:46:47.000Z",
    "title": "Arbitrum’s Explosive Rise: Doubling TVL and ARB Price Surge – What Comes Next?",
    "url": "https://www.crypto-news-flash.com/arbitrums-explosive-rise-doubling-tvl-and-arb-price-surge-what-comes-nextarbitrums-explosive-rise-doubling-tvl-and-arb-price-surge-what-comes-next/?utm_source=rss&utm_medium=rss&utm_campaign=arbitrums-explosive-rise-doubling-tvl-and-arb-price-surge-what-comes-nextarbitrums-explosive-rise-doubling-tvl-and-arb-price-surge-what-comes-next",
    "description": "<img width=\"1200\" height=\"630\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Arbitrum-FI.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Arbitrum-FI.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Arbitrum-FI-300x158.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Arbitrum-FI-768x403.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Arbitrum-FI-150x79.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/Arbitrum-FI-450x236.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />The Arbitrum (ARB) network has become the leading L2 scaling solution for the Ethereum network with over $2.4 billion in TVL. ARB price action will closely follow Ethereum’s in the upcoming bull market cycle that is awaiting the final signal from Bitcoin’s fourth halving in April.  Arbitrum (ARB) network, a fast-growing Ethereum-based layer two scaling [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-11T08:56:27.000Z",
    "title": "Mantle Offers High Yield for Your ETH",
    "url": "https://www.altcoinbuzz.io/defi/mantle-offers-high-yield-for-your-eth/",
    "description": "<p>Having Ethereum in your portfolio is one thing. But how about putting your ETH to work to earn you passive income? Mantle is an L2 on Ethereum that gives you these options. Currently, they claim to offer the highest yield on the market for staking ETH. And there&#8217;s more, you get exposure to the Mantle [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/defi/mantle-offers-high-yield-for-your-eth/\">Mantle Offers High Yield for Your ETH</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]