[
  {
    "source": "Decrypt",
    "date": "2023-12-06T09:43:25.000Z",
    "title": "Dogecoin Marks 10th Anniversary, Hits $0.10 For First Time in a Year",
    "url": "https://decrypt.co/208813/dogecoin-marks-10th-anniversary-hits-0-10-for-first-time-in-a-year",
    "description": "Dog-themed meme coin Dogecoin marked its 10th anniversary with a double-digit surge that carried its price to a yearly high over $0.10."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-06T09:43:31.000Z",
    "title": "Bitcoin to US long bond ratio matches ATH last seen in 2021",
    "url": "https://cryptoslate.com/insights/bitcoin-to-us-long-bond-ratio-matches-ath-last-seen-in-2021/",
    "description": "<p>Quick Take As Bitcoin was catapulted into the ninth position in the global asset rank yesterday, notably ahead of Meta, its performance is juxtaposed with TLT, the US long bond ETF. Currently, Bitcoin stands at 36% short of its all-time high, while TLT, trading approximately at $95, is 49% away from its peak. However, a [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoin-to-us-long-bond-ratio-matches-ath-last-seen-in-2021/\">Bitcoin to US long bond ratio matches ATH last seen in 2021</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-06T10:00:18.000Z",
    "title": "Binance and CZ Settle With the DOJ and Other Federal Agencies",
    "url": "https://news.bitcoin.com/binance-and-cz-settle-with-the-doj-and-other-federal-agencies/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/xxtopaas666333-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/xxtopaas666333-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/xxtopaas666333-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/xxtopaas666333-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/xxtopaas666333-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/xxtopaas666333-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/xxtopaas666333-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/xxtopaas666333.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On November 21, 2023, the Commodity Futures Trading Commission (CFTC), the Department of Treasury’s Finance Crimes Enforcement Network (FinCEN), its Office of Foreign Assets Control (OFAC), and the Department of Justice (DOJ) all settled charges against Binance, the world’s largest cryptocurrency exchange, and its Chief Operating Officer, Changpeng Zhao (CZ). The settlement concerned a variety [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-06T09:51:24.000Z",
    "title": "Algorand Price Prediction 2023-2032: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices to consider when investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it ... <a title=\"Algorand Price Prediction 2023-2032: Resurgence possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Resurgence possible?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-06T09:40:46.000Z",
    "title": "XRP Greed Index Soars, Backed By Robust $1.3 Billion Volume – Good For Price?",
    "url": "https://www.newsbtc.com/news/xrp-greed-index-soars-backed-by-robust-1-3-billion-volume-good-for-price/",
    "description": "The price of XRP, the native token of the Ripple payment network, increased by 4% to $0.639999 over the course of the previous day. This occurred on a day when rising optimism caused the cryptocurrency market as a whole to rise by 5%. XRP has increased by 4% over the past month and by 1.5% in only one week. It is currently the fifth-largest token by market capitalization, having increased by a remarkable 80% since the start of the year. This demonstrates how, in the cryptocurrency world, XRP is moving to its own rhythm. Related Reading: Bitcoin Bulldozes Past $44,000 – Is $45K Next This Week? XRP Shows Renewed Vigor Thanks to the general surge in the cryptocurrency market, the token has emerged from a protracted hibernation with encouraging indicators. Even while it hasn&#8217;t fully restored to its former splendor, the remnants of its strength are beginning to flare once more. In the upcoming days, analysts project another 15% increase, bringing its value to $0.72. Technical indicators show cautious optimism, scoring 72 for &#8220;Greed&#8221; and neutral positive mood. XRP Greed Index at 72. Source: Coincodex When a cryptocurrency&#8217;s index is labeled &#8220;Greed,&#8221; it indicates a positive market sentiment where investors are optimistic and more willing to take risks. This sentiment is measured on a scale ranging from extreme fear to extreme greed, with a &#8220;Greed&#8221; leaning suggesting heightened confidence and positive expectations among market participants. A surge in buying demand might push XRP&#8217;s price higher and into the $0.65–$0.71 supply zone. Confirmation of the continuation of the intermediate trend would require a break and close above this order block&#8217;s midline, at $0.68. The price of XRP might then aim for the psychological level of $0.8000 if this order block were to flip into support. XRP market cap currently at $34.12 billion on the daily chart: TradingView.com With the approval of the Bitcoin ETF and probable rate cuts bringing about a potential full-fledged bull market next year, it is feasible that the market-wide surge of today marks the beginning of an end-of-year rally. If this is the case, Ripple&#8217;s recent wins over the SEC and the company&#8217;s recent expansion should assist XRP immensely. While XRP&#8217;s 24-hour trading volume has surpassed $1.3 billion, the altcoin&#8217;s support level is still rising gradually. This indicates that during that period, a sizable sum of XRP was bought and traded. Source: Changelly XRP&#8217;s Momentum: Rising Support, Increased Trading Signal Growth Positive sentiment is often associated with rising support levels since they show that more traders and investors are prepared to purchase XRP at higher prices, and bigger trading volumes signify more activity and liquidity in the market. This is still far below the $3 billion-plus levels observed at the beginning of November, but being a significant increase over the levels seen in September and early October. Put differently, there is ample opportunity for XRP&#8217;s current surge to continue and perhaps even pick up more momentum. #XRP &#8211; Last time MACD crossed 0 level, $XRP went PARABOLIC! Haven&#8217;t confirmed above, but we are getting VERY CLOSE&#8230; Glad we bought low using a calculated strategy! We will sell the top too using same strategy! No emotions! Retweet/Like for updates!https://t.co/FNuFN39RjM — JD 🇵🇭 (@jaydee_757) December 1, 2023 Meanwhile, in a post on his X platform, cryptocurrency expert JD stated that the MACD (Moving Average Convergence Divergence) was the catalyst for the market&#8217;s explosive rise. As JD noted, the &#8220;parabolic&#8221; spike in XRP occurred at the same moment that the MACD last moved above zero. Although it hasn&#8217;t happened this time, he says the market is quickly getting close to that point. Related Reading: PEPE Inks 46% Weekly Gain – Can It Leap To The $1 Jackpot? The big trading activity shows that a lot of people are involved in XRP, making it important in the crypto world. As the coin&#8217;s Greed index goes up, everyone is excited to see what happens next with XRP, as it sits on the edge of market changes driven by feelings and lots of trading. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-12-06T09:57:18.000Z",
    "title": "Trezor Enhances Security with New Metal Solution for 24-Word Seeds",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/trezor-enhances-security-with-new-metal-solution-for-24-word-seeds/",
    "description": "<p>The 24-word seed phrase is a crucial aspect of securing cryptocurrency holdings. Serving as the backup that can be used to restore access to funds in the event of a device loss or failure. Trezor&#8217;s decision to introduce a metal solution for these seed phrases adds an extra layer of durability and protection to this [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/trezor-enhances-security-with-new-metal-solution-for-24-word-seeds/\">Trezor Enhances Security with New Metal Solution for 24-Word Seeds</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-06T09:59:23.000Z",
    "title": "Bitcoin ETF: Investors’ Optimism High in Anticipation of an SEC Approval",
    "url": "https://coinedition.com/bitcoin-etf-investors-optimism-high-in-anticipation-of-an-sec-approval/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"First Bitcoin ETF in Europe Receives an ESG Label, Sparking Debate\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Spot-Bitcoin-ETF-Approval-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Since October, speculations around a spot Bitcoin Exchange-Trusted Fund (ETF) approval have catalyzed a broader market recovery. In that timeframe, Bitcoin notched a new annual high. Indeed, a noted change of attitude at the U.S. Securities and Exchange Commission (SEC) toward an ETF approval reportedly propelled the recent crypto market resurgence. While the earlier part [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/bitcoin-etf-investors-optimism-high-in-anticipation-of-an-sec-approval/\">Bitcoin ETF: Investors’ Optimism High in Anticipation of an SEC Approval</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]