[
  {
    "source": "Crypto Daily",
    "date": "2024-01-29T12:35:49.000Z",
    "title": "Over 6,000 investors go crazy for Pushd (PUSHD) presale over Polygon (MATIC) and Shiba Inu (SHIB)",
    "url": "https://cryptodaily.co.uk/2024/01/over-6000-investors-go-crazy-for-pushd-pushd-presale-over-polygon-matic-and-shiba-inu-shib",
    "description": "The crypto industry has seen its biggest decline to start the year and it hasn’t spared large cap meme coins like Shiba Inu (SHIB)"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-29T12:12:06.000Z",
    "title": "This Ripple Competitor, Currently at $0.01, is Predicted to Surpass XRP in 2024",
    "url": "https://cryptodaily.co.uk/2024/01/this-ripple-competitor-currently-at-001-is-predicted-to-surpass-xrp-in-2024",
    "description": "The crypto market remains volatile in 2024, with majors like Ripple's XRP token struggling to gain traction."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-29T12:19:23.000Z",
    "title": "Bitcoin whales accumulate $3 Billion worth of BTC as Bitcoin ETFs see net inflows",
    "url": "https://www.cryptopolitan.com/bitcoin-whales-accumulate-3-billion-worth/",
    "description": "Large investors, commonly called crypto whales, have significantly increased their holdings of Bitcoin (BTC) this month, accumulating approximately $3 billion worth of the leading cryptocurrency, according to data tracked by on-chain analytics firm IntoTheBlock.&#160; This substantial increase in whale activity comes as Bitcoin exchange-traded funds (ETFs) experienced net inflows of $820 million in the same [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-29T12:11:23.000Z",
    "title": "Chinese Investors Turn to Cryptocurrencies Amid Economic Uncertainty",
    "url": "https://www.cryptopolitan.com/chinese-investors-turn-to-cryptocurrencies/",
    "description": "In response to China&#8217;s economic downturn and a prolonged bearish trend in its stock market, Chinese investors are increasingly turning to cryptocurrencies as an alternative investment avenue. This shift reflects their perception of cryptocurrencies, particularly Bitcoin, as a safe haven asset akin to gold. Creative approaches to access cryptocurrencies Despite the cryptocurrency trading and mining [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-29T12:11:09.000Z",
    "title": "All eyes on the Evergrande liquidation – China and US economies are in trouble",
    "url": "https://www.cryptopolitan.com/all-eyes-on-the-evergrande-liquidation/",
    "description": "A Hong Kong court issued a liquidation order to China Evergrande Group, kicking off a difficult process to dismantle the greatest casualty of a property crisis that is upending the world&#8217;s second-largest economy. In June 2022, Top Shine Global Limited of Intershore Consult (Samoa) Ltd., a strategic homebuilder&#8217;s online sales platform investor, submitted the petition [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-29T12:30:56.000Z",
    "title": "Crypto Analyst Says February Will Be A Bullish Month For Bitcoin, Here’s Why",
    "url": "https://www.newsbtc.com/news/bitcoin/february-bullish-month-for-bitcoin/",
    "description": "Crypto analyst and long-term crypto investor Jelle has highlighted an interesting historical pattern that suggests that February could be bullish for Bitcoin. This would no doubt be a relief for BTC investors who have to deal with a bearish January for the flagship crypto token.  Why February Could Be Bullish For Bitcoin  Jelle stated in an X (formerly Twitter) post that “February should be strong” for Bitcoin “if history keeps repeating itself.” The history which he alludes to is the pattern where February turns out to be a green month for Bitcoin after it has seen a bearish January and had closed in the green for the last four months of the previous year.  Related Reading: XRP Price Will See 1,000% Rally When ‘Black Cloud’ Dissolves, What This Means Data from Coinglass shows that the only other times (2015 and 2016) BTC closed the last four months of the year in the green, it went on to record a bearish January and a bullish February after that. Last year, Bitcoin closed September, October, November, and December in the green, thanks largely to the frenzy around the Spot Bitcoin ETFs. Source: X Bearing the historical pattern in mind, Jelle expects that February will once again be a green month for Bitcoin. Interestingly, Bitcoin’s gains in February 2016 and 2017 were significant, recording 20% and 23%. As such, there isn’t only the possibility of this February being green for Bitcoin but also coming with huge gains for the crypto token. The Bull Market Stays On In a more recent X post, Jelle highlighted how Bitcoin was back above the $42,000 level and hinted that there could be more move to the upside as he stated that the “bull market stays on.” The crypto analyst is known to be a reputable trader, as he had previously mentioned how his strategies helped him catch the BTC bottom and sell the top.  Related Reading: Crypto Analyst Explains How XRP Could See Massive 4500% Jump To $27 From his X post, one could see that Jelle was predicting that the next significant upward movement from Bitcoin could see it rise to as high as $53,000. Interestingly, from the accompanying chart, there was a likelihood of this happening sometime in February. Such a move will once again establish that historical pattern which Jelle had earlier highlighted.  Whatever happens in February, Bitcoin investors can still take comfort in the fact that Bitcoin still has over 500 days of bullish momentum, according to crypto analyst Ali Martinez. Bitcoin whales have so far remained steadfast, with an increase in those holding 1,000 BTC or more despite the flagship crypto token’s recent price decline.  At the time of writing, BTC is trading just above $42,000, down over 1% in the last 24 hours, according to data from CoinMarketCap.  Featured image from The Financial Commission, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-29T12:12:00.000Z",
    "title": "SUI’s Rounding Bottom Signals Potential Breakout: Is a Rally Looming?",
    "url": "https://coinedition.com/sui-poised-to-breach-resistance-as-indicators-signal-rally/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/01/SUI-Poised-to-Breach-Resistance-as-Indicators-Signal-Rally.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SUI Poised to Breach Resistance as Indicators Signal Rally\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/01/SUI-Poised-to-Breach-Resistance-as-Indicators-Signal-Rally.png 730w, https://coinedition.com/wp-content/uploads/2024/01/SUI-Poised-to-Breach-Resistance-as-Indicators-Signal-Rally-300x169.png 300w, https://coinedition.com/wp-content/uploads/2024/01/SUI-Poised-to-Breach-Resistance-as-Indicators-Signal-Rally-380x214.png 380w, https://coinedition.com/wp-content/uploads/2024/01/SUI-Poised-to-Breach-Resistance-as-Indicators-Signal-Rally-696x392.png 696w, https://coinedition.com/wp-content/uploads/2024/01/SUI-Poised-to-Breach-Resistance-as-Indicators-Signal-Rally-159x89.png 159w, https://coinedition.com/wp-content/uploads/2024/01/SUI-Poised-to-Breach-Resistance-as-Indicators-Signal-Rally-255x143.png 255w, https://coinedition.com/wp-content/uploads/2024/01/SUI-Poised-to-Breach-Resistance-as-Indicators-Signal-Rally-313x175.png 313w, https://coinedition.com/wp-content/uploads/2024/01/SUI-Poised-to-Breach-Resistance-as-Indicators-Signal-Rally-440x247.png 440w, https://coinedition.com/wp-content/uploads/2024/01/SUI-Poised-to-Breach-Resistance-as-Indicators-Signal-Rally-414x233.png 414w, https://coinedition.com/wp-content/uploads/2024/01/SUI-Poised-to-Breach-Resistance-as-Indicators-Signal-Rally-293x165.png 293w, https://coinedition.com/wp-content/uploads/2024/01/SUI-Poised-to-Breach-Resistance-as-Indicators-Signal-Rally-375x211.png 375w, https://coinedition.com/wp-content/uploads/2024/01/SUI-Poised-to-Breach-Resistance-as-Indicators-Signal-Rally-328x185.png 328w, https://coinedition.com/wp-content/uploads/2024/01/SUI-Poised-to-Breach-Resistance-as-Indicators-Signal-Rally-144x81.png 144w, https://coinedition.com/wp-content/uploads/2024/01/SUI-Poised-to-Breach-Resistance-as-Indicators-Signal-Rally-123x70.png 123w, https://coinedition.com/wp-content/uploads/2024/01/SUI-Poised-to-Breach-Resistance-as-Indicators-Signal-Rally-129x73.png 129w, https://coinedition.com/wp-content/uploads/2024/01/SUI-Poised-to-Breach-Resistance-as-Indicators-Signal-Rally-355x200.png 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Sui (SUI) cryptocurrency has been in an uptrend, capturing the attention of investors and traders alike. Despite stiff resistance at the $1.50 mark, the digital asset exhibits bullish, solid momentum, hinting at potential future gains. In the last 24 hours, however, the SUI has experienced a slight price correction, causing some uncertainty among investors.  [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/sui-poised-to-breach-resistance-as-indicators-signal-rally/\">SUI&#8217;s Rounding Bottom Signals Potential Breakout: Is a Rally Looming?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]