[
  {
    "source": "CoinDesk",
    "date": "2023-09-14T03:30:00.000Z",
    "title": "Islamic Coin in Pact With CoinDesk Indices to Discuss Sharia-Compliant Benchmarks",
    "url": "https://www.coindesk.com/business/2023/09/14/coindesk-indices-expands-into-mena-region-in-mou-with-islamic-coin/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Islamic Coin is the native currency of HAQQ, a network focused on developing a Shariah-compliant financial ecosystem."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-14T01:42:02.000Z",
    "title": "Proposed California Legislation Would Protect Actors From AI Copycats",
    "url": "https://decrypt.co/156625/proposed-california-legislation-protect-actors-ai-copycats",
    "description": "Assemblymember Ash Kalra's bill targets vague contracts that exploit an actor's digital likeness without clear consent or representation."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-14T00:49:38.000Z",
    "title": "No Bubble Here: Goldman Sachs Says AI Still in Early Stages",
    "url": "https://decrypt.co/156626/no-bubble-here-goldman-sachs-says-ai-still-in-early-stages",
    "description": "Goldman Sachs foresees a promising future for AI investments, debunking bubble theories and projecting a bullish market."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-13T23:08:11.000Z",
    "title": "Game Developers Are 'Fucking Livid' Over Unity's New Fees",
    "url": "https://decrypt.co/156592/game-developers-fucking-livid-over-unity-new-fees",
    "description": "The popular game engine's new fees have left some developers feeling stuck, although Unity is trying to explain its way out of the unrest."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-13T22:16:46.000Z",
    "title": "5 Up-and-Coming Generative Artists to Keep Your Eye On",
    "url": "https://decrypt.co/155352/community-spotlight-generative-artists-keep-your-eye-on",
    "description": "The generative art world is thriving, and exciting new artists keep emerging all the time. Here are a few that you should know."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-14T02:56:56.000Z",
    "title": "Toughen up. Mt. Gox's ex-CEO only had a ‘little calculator’ to prepare for trial",
    "url": "https://cointelegraph.com/news/former-mtgox-ceo-had-calculator-in-prison-while-sam-bankman-fried-prepares-for-trial",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/ce7366ad-6a9a-4221-932b-fc66e611f8fe.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Mark Karpelès was seemingly drawing parallels to Sam Bankman-Fried's recent antics, claiming to have gotten through 20,000 pages of evidence in pre-trial detention with only a \"simple calculator.\"</p>\n                    <p><p>Mark Karpelès, the former CEO of the collapsed exchange Mt. Gox, seems to have little in the way of sympathy for former FTX CEO Sam Bankman-Fried, who’s been trying to get released from prison to prepare for his upcoming trial, citing poor internet. </p><p>“When I was arrested back in 2015, the most computing power I got was a simple calculator (+-*/√),” Karpelès wrote in a Sept. 13 post on X (formerly known as Twitter). </p><p>Karpeles was arrested on two separate occasions in 2015 for the alleged misappropriation of nearly $3 million of Mt. Gox customer funds.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">When I was arrested back in 2015, the most computing power I got was a simple calculator (+-*/√). Had 20000 pages of evidence including over 5000 pages of accounting. Calculation I did at the time helped me to earn release under bail and eventually be cleared of all embezzlement…</p>&mdash; Mark Karpelès (@MagicalTux) <a href=\"https://twitter.com/MagicalTux/status/1701758088360104261?ref_src=twsrc%5Etfw\">September 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Karpelès eventually earned release under bail using a trusty “little calculator” he bought from the prison commissary and was eventually cleared of all embezzlement and breach of trust charges.</p><p>“I spent a total of 11 months and 15 days in pre-trial detention, and didn't have access to any of the evidence until about 7 to 8 months in,” he said. </p><p>By using supplies he’d gotten from the jail's store, Karpelès used folders and stickers to create an index of all the evidence he’d been sent by his legal counsel, which was all squeezed into a very complex eight-page file, he said. </p><p>Karpelès said he was even initially going to brave it with an abacus — an ancient counting tool that uses sliding beads to add and subtract — which was the only item listed that could assist with calculations. Luckily, a prison guard told him that he could use a calculator for accounting cases and thus spared him the headache. </p><blockquote class=\"twitter-tweet\"><p lang=\"zxx\" dir=\"ltr\"><a href=\"https://t.co/XuNzAdBvsI\">pic.twitter.com/XuNzAdBvsI</a></p>&mdash; Mark Karpelès (@MagicalTux) <a href=\"https://twitter.com/MagicalTux/status/1702111783627198665?ref_src=twsrc%5Etfw\">September 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“I spent around $120 to buy the best calculator they had, which could do additions, subtractions, multiplications and divisions, square roots for some reason, and had buttons to add/remove consumption tax,” he explained. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/the-mess-that-was-mt-gox-four-years-on\"><strong><em>The Mess That Was Mt. Gox: Four Years On</em></strong></a></p><p>Finally, four years <a href=\"https://cointelegraph.com/news/aug-21-digest-mark-karpeles-re-arrested-in-japan-world-wide-web-consortium-to-launch-web-payments-working-group\">after his initial arrest in August 2015</a>, Karpelès was said he was cleared of all embezzlement and breach of trust charges, “all thanks to that little calculator” and “of course the tremendous work” done by his lawyers.</p><p>Karpelès’ comments come days after lawyers for Bankman-Fried <a href=\"https://cointelegraph.com/news/ftx-sam-bankman-fried-s-lawyers-request-pre-trial-release-citing-poor-internet-connection\">filed a request to have him released from prison</a>, claiming that his poor internet access was a significant impediment to the preparation for the upcoming trial. </p><p>District Court judge Lewis Kaplan <a href=\"https://cointelegraph.com/news/bankman-fried-request-temporary-release-denied-amid-upcoming-trial\">denied the request for temporary release on Sept. 12</a>, declaring that poor internet access wasn't sufficient grounds for release. </p><p>Bankman-Fried currently faces 12 criminal charges, which will be spread across two trials scheduled to begin on Oct. 2, 2023, and March 11, 2024. He has <a href=\"https://cointelegraph.com/news/sam-bankman-fried-enters-not-guilty-plea-for-all-counts-in-federal-court\">pleaded not guilty to all counts</a>.</p><p><strong><em>Big Questions: </em></strong><a href=\"https://cointelegraph.com/magazine/big-questions-crypto-deaths/\"><strong><em>What’s with all the crypto deaths? </em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-14T02:13:17.000Z",
    "title": "How OKX convinced F1 star Daniel Ricciardo it’s safe to promote crypto ",
    "url": "https://cointelegraph.com/news/how-okx-convinced-f1-star-daniel-ricciardo-it-s-safe-to-promote-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/7a706081-fb1c-4f3f-aa17-2bb9850279dc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Australian F1 driver Daniel Ricciardo said it took him a while to get comfortable with the idea of crypto, and that was before the collapse of FTX.</p>\n                    <p><p>Australian F1 driver Daniel Ricciardo and his Olympic snowboarder mate Scotty James say they always think long and hard about the risks of promoting the wrong thing. </p><p>And as brand ambassadors for crypto exchange OKX, that no doubt was at the forefront of their minds when FTX collapsed and markets crashed — mere months after they signed on.</p><p>The risks then became all too apparent in the acres of <a href=\"https://cointelegraph.com/news/crypto-ad-deals-for-super-bowl-lvii-fell-apart-after-ftx-collapse-report\">negative publicity and lawsuits</a> over comedian Larry David and retired NFL quarterback Tom Brady’s endorsement deals with FTX. </p><p>Even Hollywood nice guy Matt Damon faced blowback from everyone <a href=\"https://cointelegraph.com/news/south-park-destroys-matt-damon-s-crypto-com-ad-in-season-premiere\">from South Park to Stephen Colbert</a> as a result of his Superbowl commercial for Crypto.com, encouraging normies to buy crypto right before the market crash.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/daecf254-15d5-48dc-90e7-f26eaae95a94.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Daniel Ricciardo, Haider Rafique and Scotty James onstage at Token2049.</em></figcaption></figure><p>Crypto already had a pretty mixed reputation when Ricciardo signed up in May 2022, and he admits it took a while to get comfortable with the idea. </p><blockquote>\"I've been in the sport a long time where for sure, a lot of things get put in front of me, which is exciting.”</blockquote><p>“But you kind of also learn when to say ‘no, that’s not right for me,’\" he told Cointelegraph at Token2049, nursing a fractured hand that has taken him out of the Sept. 17 Singapore Grand Prix.</p><p>Ricciardo is one of the most popular F1 drivers in the world and has a team that ensures he doesn’t get into hot water. Minders struck out direct questions about FTX ahead of the chat, required approval for photos of the interview, and bustled him away after 10 minutes for his next appearance. </p><h3>Trust in crypto wavered after FTX blow-up</h3><p>OKX’s strategy to become the “first crypto lifestyle brand” was driven by Chief Marketing Officer Haider Rafique. The cryptexchange signed multi-million dollar sponsorship deals with sports franchises like F1 team McLaren and United Kingdom Premier League team Manchester United.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The streets of Manchester have officially been futurised by OKX and <a href=\"https://twitter.com/ManCity?ref_src=twsrc%5Etfw\">@mancity</a> fans <br><br>Explore Manchester and check ‘em out  Arndale and 60 Shudehill<br><br>Better Future: Game On! <a href=\"https://twitter.com/hashtag/OKXManCity?src=hash&amp;ref_src=twsrc%5Etfw\">#OKXManCity</a> <a href=\"https://t.co/Hae3Ug4n1f\">pic.twitter.com/Hae3Ug4n1f</a></p>&mdash; OKX (@okx) <a href=\"https://twitter.com/okx/status/1696085547008037067?ref_src=twsrc%5Etfw\">August 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“We certainly get those calls,\" Rafique said, “from McLaren or Man City. ‘Hey, is everything all right over there? Like the industry looks a little shaky?’ And we have to understand and put ourselves in their shoes and respond accordingly.” He says the exchange’s monthly proof of reserves reports are a big factor in gaining trust. </p><p>But even after getting his old team on board (Ricciardo now drives for AlphaTauri) Rafique still needed to gain the F1 driver's trust. “It wasn't a transactional relationship, it was a personal relationship,” he said. </p><p>Ricciardo explained it worked as Rafique did “a really good job to bring us in on personal level to educate us and inform us.”</p><blockquote>“I was curious and wanted to learn — I had a lot of comfort going in with them. I’ve seen enough now to know that this is good for me, and it’s safe for me to kind of get involved in this.” </blockquote><p>Unfortunately, as Damon’s ill-fated Crypto.com deal shows, due diligence can only take you so far. The exchange wasn’t accused of anything and didn’t collapse but Damon’s reputation took a hit as markets crashed. </p><p>“The thing that was probably blowback for them was the message and it was poorly timed: ‘Fortune favors the brave,’ and then the brave crashed,” said Rafique.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/okx-crypto-exchange-enters-final-stage-of-hong-kong-vasp-license-application\"><strong><em>OKX crypto exchange enters final preparation stage of Hong Kong VASP license application</em></strong></a></p><p>As a mate of Ricciardo’s, four-time Olympian James already had a personal connection when he signed on with OKX and was already interested in NFTs. But it still would have been a shock when FTX collapsed a month later. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/3661c7f4-c91a-4b41-afee-f7dda95a97ae.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Fans line up to get pics with Daniel Ricciardo and Scotty James at Token2049. </em></figcaption></figure><p>“Until you understand something 100% at its full capacity, naturally you’re going to have reservations,” he said, but added that the platform’s attempts to simplify and educate about crypto and trading put him at ease. </p><p>“I built trust over time with doing that, and we feel pretty good about it,” he said. “But to say 12 months ago, I would say the same thing? No.\"</p><p>James said that snowboarding was a lifestyle choice that appeals to a “young demographic\" and crypto is too due to its decentralization.</p><blockquote>“I think my generation and younger than me are the ones that are really going to change that narrative for investing, whether it’s in cryptocurrency or other investments moving forward.”</blockquote><p>While the pair joked about releasing NFTs during their onstage appearance at Token2049, that’s not going to happen until markets recover, said Rafique.</p><p>“For their NFTs, it's certainly not going to be about a speculative asset. It’s going to be baked into how we can bring their fans closer to them through this asset that they can own. So I don’t think it’s going to happen anytime soon.”</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/nft-collapse-and-monster-egos-feature-in-new-murakami-exhibition/\">NFT collapse and monster egos feature in new Murakami exhibition</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-14T01:50:55.000Z",
    "title": "Shrapnel Web3 shooter won't let US users cash out, thanks to Gensler",
    "url": "https://cointelegraph.com/news/blockchain-game-shrapnel-restrict-us-players-fearing-securities-laws",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/8e29b411-7904-4384-ae18-347dd13510af.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>As soon as a gamer cashes out an in-game asset, they realize monetary value, which is where the problem with the SEC comes in, a Shrapnel executive told Cointelegraph.</p>\n                    <p><p>The creators of blockchain game Shrapnel — an upcoming AAA first-person extraction shooter — will be cutting a part of its game for United States-based players, in order to avoid the potential ire of the country’s securities regulator. </p><p>The game, which is due to launch in early access in December, will be unrestricted for players from Europe and Asia but gamers from the U.S. will not be able to cash out at all, says Shrapnel Head of Economy Francis Brankin in a Sept. 13 interview with Cointelegraph at Token 2049.</p><blockquote>“They [U.S. users] can do everything every other player can do, but they can't cash out. Because that's what makes it a security to the U.S. player, as soon as they can realize monetary value, that’s where the problem comes in.”</blockquote><p>He hopes the issue will be temporary and that Neon — the team behind Shrapnel — will soon enable U.S. users to bridge capital accrued from Shrapnel to their bank accounts.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">〉Getting ready to extract. <a href=\"https://t.co/kq6B07Ub97\">pic.twitter.com/kq6B07Ub97</a></p>— SHRAPNEL  (@playSHRAPNEL) <a href=\"https://twitter.com/playSHRAPNEL/status/1702084574170267705?ref_src=twsrc%5Etfw\">September 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Shrapnel is a first-person extraction shooter set on 2038 Earth, where players scavenge for loot and attempt to extract their winnings — all the while being hunted by enemies and other players. </p><p>The game also allows gamers to build open economies and possess the intellectual property rights over in-game assets as opposed to merely creating value from the game itself, Brankin explained.</p><p>This was one of the main reasons why the firm’s CEO, Mark Long decided to go down the blockchain route. Users can <a href=\"https://cointelegraph.com/news/providing-value-to-gamers-in-a-changing-web3-landscape-interview-with-tokyo-beast\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/providing-value-to-gamers-in-a-changing-web3-landscape-interview-with-tokyo-beast/amp\">build a brand, create and then sell in-game assets</a> from the ground up. </p><p>“User generated content is clearly a big thing,” Brankin explained, pointing to Roblox and Minecraft as textbook examples.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">✦ SHRAPNEL INSIGNIA Beta is now available to the public! ✦<br><br>Create your own personalised designs and build out your unique brand!<br><br>From intricate emblems to eye-catching symbols, custom patterns and elaborate scenes – you can design whatever your imagination desires!<br><br> <a href=\"https://t.co/OVQju6PNdv\">https://t.co/OVQju6PNdv</a> <a href=\"https://t.co/wZkfyzbCmE\">pic.twitter.com/wZkfyzbCmE</a></p>— SHRAPNEL  (@playSHRAPNEL) <a href=\"https://twitter.com/playSHRAPNEL/status/1669750746491809793?ref_src=twsrc%5Etfw\">June 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Brankin said Neon chose Avalanche <a href=\"https://cointelegraph.com/news/avalanche-hyper-sdk-blockchain-upgrade-hits-143000-tps-on-testnet\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/avalanche-hyper-sdk-blockchain-upgrade-hits-143000-tps-on-testnet/amp\">because of its scaling capabilities. </a></p><p>Shrapnel can currently process 2 million transactions per hour (555 TPS) which is sufficient for the time being but over time it’ll be easier to scale up on Avalanche, Brankin explained.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/saudi-arabia-looks-to-blockchain-gaming-and-web3-to-diversify-economy\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/saudi-arabia-looks-to-blockchain-gaming-and-web3-to-diversify-economy/amp\"><strong><em>Saudi Arabia looks to blockchain gaming and Web3 to diversify economy</em></strong></a></p><p>Neon will launch an early access version of the game in December to paid users before it evolves into a free-to-play game.</p><p>While the limitations imposed on U.S. users serves as a roadblock for Shrapnel’s upcoming launch, the co-founder of Sandbox told Cointelegraph the metaverse (and gaming generally) is <a href=\"https://cointelegraph.com/news/metaverse-dead-united-states-thriving-asia-sandbox-sebastien-borget\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/metaverse-dead-united-states-thriving-asia-sandbox-sebastien-borget/amp\">dying in the U.S. but thriving in Asia</a> — particularly Hong Kong, South Korea and Japan.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/gta-owner-blockchain-game-bitcoin-casino-sunflower-land-review-web3-gamer/\"><strong><em>Web3 Gamer: GTA owner joins Web3, Bitcoin casino, Sunflower Land review</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-14T01:00:00.000Z",
    "title": "Web3 game Gods Unchained releases ‘Sealed Mode’ to mimic paper card games",
    "url": "https://cointelegraph.com/news/web3-game-gods-unchained-releases-sealed-mode-mimic-paper-card-games",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/cf03fc1d-c667-4b37-a562-65dc4d693eb6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Immutable’s Gods Unchained game launched a new tournament mode that allows players to build a deck with random cards.</p>\n                    <p><p>Web3 game Gods Unchained released a new gameplay format that allows players to compete with semi-random cards they receive at the start of a tournament. Called “Sealed Mode,” the format is intended to reward highly skilled players, even if they don’t have a large or expensive card collection. The new format was <a href=\"https://blog.godsunchained.com/2023/09/08/introducing-sealed-mode-only-the-skilled-dare-enter/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> via a blog post on Sept. 13.</p><p>“Sealed deck” tournaments are common in paper collectible trading card games such as Magic: The Gathering, but are relatively rare in digital trading card games.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">⚜️    ⚜️<br><br>    <br><br>Will you?<br><br>️ Coming Sept 14th 11am AET<br><br> Full details: <a href=\"https://t.co/mKSGSCrMW7\">https://t.co/mKSGSCrMW7</a> <a href=\"https://t.co/LHCdIs7LjK\">pic.twitter.com/LHCdIs7LjK</a></p>&mdash; Gods Unchained (@GodsUnchained) <a href=\"https://twitter.com/GodsUnchained/status/1699958292045255054?ref_src=twsrc%5Etfw\">September 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to the post, players can participate in sealed mode if they pay an entry fee of 15 Gods Unchained ($GODS) tokens, worth approximately $2.65 at the time of publication. Once they pay this fee, they receive a random selection of three gods they can choose to build a deck around. In addition, they receive 60 random cards drawn from multiple Gods Unchained card sets, including Etherbots, Mortal Judgement, Winter Wanderlands, and others.</p><p>Although the pool of cards is semi-random, it also contains a minimum number of cards of specific types to ensure that a viable deck can be built with it. For example, each pool has at least 12 cards that cost 3 mana or less.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/what-is-gods-unchained-and-how-to-play-it\"><strong>What is Gods Unchained, and how to play it</strong></a></em></p><p>Out of each player’s pool of 60 cards, they must build a minimum 30-card deck, the post stated. The players must build their decks entirely out of the cards provided and cannot use cards from their own personal collection.</p><p>After building a deck, players compete until they either lose three matches or win seven. The players with better records at the end of the tournament receive more rewards than the players who have worse records. Some cosmetic rewards are only available in sealed mode and can only be obtained by players who win four matches or more.</p><p>\"Sealed mode” in Gods Unchained is meant to be similar to “sealed deck” or “draft” tournaments for face-to-face card games like Yu-Gi-Oh!, Pokemon and Magic: The Gathering. Players of these games often use sealed formats to collect cards. However, because most digital card games do not allow players to \"own” their cards in any meaningful sense, sealed tournaments were virtually unknown in the digital card game world. In Gods Unchained, each card is represented by a nonfungible token stored on the Immutable X network, a layer-2 of Ethereum.</p><p>Gods Unchained was one of the first Web3 video games released by Immutable. In May, Immutable stated it was <a href=\"https://cointelegraph.com/news/new-tech-could-make-crypto-and-web3-wallets-more-convenient\">developing a wallet application</a> called “Passport” that would allow gamers to log in without needing to copy down seed words. On Aug. 15, Immutable <a href=\"https://cointelegraph.com/news/immutable-zkevm-begins-testnet-phase-with-polygon\">released its zkEVM testnet</a>, which it claimed will help scale Ethereum for video game players.</p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-14T00:00:34.000Z",
    "title": "Nasdaq executive says BlackRock’s first Bitcoin ETF rejection was ‘purely procedural,’ not final",
    "url": "https://cryptoslate.com/blackrocks-first-bitcoin-etf-rejection-was-purely-procedural-not-final/",
    "description": "<p>An early dismissal of BlackRock&#8217;s planned spot Bitcoin ETF should not affect its eventual success, according to statements from Nasdaq executive Giang Bui on Sept. 13. BlackRock filed an application for a spot Bitcoin exchange-traded fund (ETF) on June 15. While BlackRock filed Form S-1 to register its product, Nasdaq was responsible for filing Form [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/blackrocks-first-bitcoin-etf-rejection-was-purely-procedural-not-final/\">Nasdaq executive says BlackRock’s first Bitcoin ETF rejection was &#8216;purely procedural,&#8217; not final</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-13T22:40:32.000Z",
    "title": "European Parliament passes DAC8 crypto tax reporting requirements by ten-to-one margin",
    "url": "https://cryptoslate.com/european-parliament-passes-dac8-crypto-tax-reporting-requirements-by-ten-to-one-margin/",
    "description": "<p>The European Parliament has approved DAC8, a measure that introduces tax reporting requirements for crypto transactions across the European Union (EU). With a decisive vote of 535 in favor, 57 against, and 60 abstentions, the proposed rule has cleared its final legislative hurdle and is set to become law. The DAC8 rule, designed to amend [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/european-parliament-passes-dac8-crypto-tax-reporting-requirements-by-ten-to-one-margin/\">European Parliament passes DAC8 crypto tax reporting requirements by ten-to-one margin</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-14T03:02:00.000Z",
    "title": "Bitcoin ($BTC) Price Could Hit $100,000 After Halving, Canaan VP Predicts",
    "url": "https://www.cryptoglobe.com/latest/2023/09/bitcoin-btc-price-could-hit-100000-after-halving-canaan-vp-predicts/",
    "description": "The vice president of a major cryptocurrency mining firm, Canaan, has recently revealed that the price of the flagship cryptocurrency Bitcoin ($BTC) could top $100,000 after the cryptocurrency’s upcoming halving event, which will halve the block rewards miners currently receive. According to a report from Cointelegraph Canaan vice president Davis Hui, at a panel on Canaan’s […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-14T00:14:00.000Z",
    "title": "$SHIB Market Cap Falls by $2 Billion as Shibarium Network Reaches New Highs of Transactions",
    "url": "https://www.cryptoglobe.com/latest/2023/09/shib-market-cap-falls-by-2-billion-as-shibarium-network-reaches-new-highs-of-transactions/",
    "description": "The layer-2 scaling solution aiming to improving the Shiba Inu ($SHIB) ecosystem, Shibarium, has seen its transaction levels hit a new all-time high just a brief period after the network was reactivated. The new high comes at a time in which the market capitalization of SHIB dropped by around $2 billion. According to data from […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-13T22:42:00.000Z",
    "title": "$XRP Price ‘Explosion’ Will ‘Exceed All Expectations’, Crypto Influencer Predicts",
    "url": "https://www.cryptoglobe.com/latest/2023/09/xrp-price-explosion-will-exceed-all-expectations-crypto-influencer-predicts/",
    "description": "A popular cryptocurrency influencer has recently predicted that the price of the native token of the XRP Ledger, $XRP, is going to undergo an upward explosion that will “exceed all expectations.” In a post on the microblogging platform X (formerly known as Twitter), influencer John Squire noted that he believes the price of XRP has […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-14T02:00:06.000Z",
    "title": "Economist Peter Schiff Warns of ‘Massive Crisis’ and a Rush to Exit US Dollar",
    "url": "https://news.bitcoin.com/economist-peter-schiff-warns-of-massive-crisis-and-a-rush-to-exit-us-dollar/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/peter-schiff-us-dollar-exit-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Economist Peter Schiff Warns of &#039;Massive Crisis&#039; and a Rush to Exit US Dollar\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/peter-schiff-us-dollar-exit-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/peter-schiff-us-dollar-exit-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/peter-schiff-us-dollar-exit-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/peter-schiff-us-dollar-exit-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/peter-schiff-us-dollar-exit-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/peter-schiff-us-dollar-exit-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/peter-schiff-us-dollar-exit.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Economist Peter Schiff has warned of &#8220;a rush&#8221; to get out of the U.S. dollar. &#8220;There’s going to be a massive crisis,&#8221; he predicted, adding that &#8220;it&#8217;s going to send the economy into a tailspin and people are going to feel the economic pain.&#8221; Peter Schiff’s US Dollar Warning Economist and gold bug Peter Schiff [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-14T00:00:37.000Z",
    "title": "SEC Chair: Crypto Is a Field Rife With Fraud, Abuse, Misconduct — ‘It’s Daunting’",
    "url": "https://news.bitcoin.com/sec-chair-crypto-is-a-field-rife-with-fraud-abuse-misconduct-its-daunting/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/gensler-senate-hearing-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SEC Chair: Crypto Is a Field Rife With Fraud, Abuse, and Misconduct — &#039;It&#039;s Daunting&#039;\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/gensler-senate-hearing-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/gensler-senate-hearing-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/gensler-senate-hearing-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/gensler-senate-hearing-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/gensler-senate-hearing-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/gensler-senate-hearing-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/gensler-senate-hearing.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />U.S. Securities and Exchange Commission (SEC) Chair Gary Gensler testified before the Senate Banking Committee, stating that crypto is &#8220;a field which is rife with fraud, abuse, and misconduct.&#8221; He also stated that the securities regulator is still reviewing applications for spot bitcoin exchange-traded funds (ETFs). Gary Gensler’s Testimony Before Senate Committee The chairman of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T01:23:00.000Z",
    "title": "Elevate the Quality and Efficiency of Your Recruitment With Top AI Tools  – Exclusive Report",
    "url": "https://www.cryptopolitan.com/recruitment-with-top-ai-tools/",
    "description": "Talent acquisition is experiencing a dramatic transformation, mainly because of the integration of Artificial Intelligence technologies. If you&#8217;re still poring over endless stacks of resumes, juggling interview schedules, and spending hours evaluating potential hires, it&#8217;s time to modernize your approach. This comprehensive guide will explore the advantages of recruitment with top AI tools, and highlight ... <a title=\"Elevate the Quality and Efficiency of Your Recruitment With Top AI Tools  &#8211; Exclusive Report\" class=\"read-more\" href=\"https://www.cryptopolitan.com/recruitment-with-top-ai-tools/\" aria-label=\"More on Elevate the Quality and Efficiency of Your Recruitment With Top AI Tools  &#8211; Exclusive Report\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-09-13T22:39:10.000Z",
    "title": "Crypto Market Reacts Positively To August CPI Report",
    "url": "https://nulltx.com/crypto-market-reacts-positively-to-august-cpi-report/",
    "description": "In the cryptocurrency space, where market sentiment often dances to the tune of economic indicators, the recent release of the August Consumer Price Index (CPI) report has caused a ripple of optimism. The data showed a 3.7% increase, slightly surpassing the expected 3.6% rise, while the Core CPI, which excludes volatile food and energy prices, [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-14T03:24:28.000Z",
    "title": "Bitcoin Price Is Primed For Rally And Only 1 Thing is Holding it Back",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-rally-above-26500/",
    "description": "Bitcoin price is moving higher above the $26,200 resistance. BTC could gain bullish momentum if there is a daily close above the $26,500 resistance. Bitcoin is showing a few positive signs above the $26,200 level. The price is trading above $26,000 and the 100 hourly Simple moving average. There is a connecting bullish trend line forming with support near $26,050 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh rally if there is a close above $26,500 and then a move above $27,000. Bitcoin Price Eyes Upside Break Bitcoin price remained well-bid above the $25,500 support zone. BTC formed a base and recently started a fresh increase above the $26,000 resistance zone. There was a sharp spike above the $26,500 resistance zone. However, there was no close above the $26,500 resistance zone. The price traded as high as $27,212 and there was a nasty bearish reaction. The price reversed its gains and traded below the $26,650 level. There was a move below the 23.6% Fib retracement level of the upward move from the $24,925 swing low to the $27,212 high. Bitcoin is now trading above $26,000 and the 100 hourly Simple moving average. Besides, there is a connecting bullish trend line forming with support near $26,050 on the hourly chart of the BTC/USD pair. Immediate resistance on the upside is near the $26,500 level. The first major resistance is near the $26,650 level. Source: BTCUSD on TradingView.com The next key resistance could be near the $27,200 level. A proper close above the $26,500 level and then a break above $27,200 might start a decent increase. The next major resistance is near $28,000, above which the bulls could gain strength. In the stated case, the price could test the $28,800 level. Fresh Drop In BTC? If Bitcoin fails to start a fresh increase above the $26,500 resistance, it could continue to move down. Immediate support on the downside is near the $26,050 level and the trend line. The next major support is near the $25,800 level or the 61.8% Fib retracement level of the upward move from the $24,925 swing low to the $27,212 high. A downside break and close below the $25,800 level might send the price toward the key support at $25,550. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $26,050, followed by $25,800. Major Resistance Levels – $26,500, $26,650, and $27,200."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-14T01:00:48.000Z",
    "title": "Bitcoin Unprecedented Liquidity And Rate Reversal: A Perfect Storm For Market Correction?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-unprecedented-liquidity-and-rate-reversal-a-perfect-storm-for-market-correction/",
    "description": "Despite Bitcoin&#8217;s recent recovery to the key level of $26,100, signaling a crucial point for its future gains and preventing further decline, there are worrisome signals that could raise concerns for Bitcoin bulls in the short term. The combination of factors presents a potential perfect storm for a market correction. One contributing piece is the higher-than-expected US August headline inflation, coming in at 3.7% up from the previous month&#8217;s 3.2%. Although not a game-changer, it implies that the odds of another rate hike are marginally up, now standing at 53%. Jeroen Blokland, a multi-asset investor, highlights this development. Additionally, Bloomberg&#8217;s senior macro strategist, Mike McGlone, suggests that Bitcoin may be leading a downward trend. McGlone emphasizes that Bitcoin is an &#8220;exceptionally liquid&#8221; asset that has experienced significant appreciation without being tied to specific projects or liabilities.  However, since it emerged during a period of historically low-interest rates, its position as a potential frontrunner for a market reversion is noteworthy. US Inflation Data And Rising Interest Rates Pose Challenges For Bitcoin Bull Run One key indicator highlighted by McGlone is the rollover of Bitcoin&#8217;s 20-week moving average (MA), which has implications for all risk assets.  Related Reading: DCG And Gemini Ink A Plan: Users To Receive All Their Crypto? Being one of the best-performing assets in history, Bitcoin&#8217;s reversion lower is a significant observation. McGlone&#8217;s analysis reveals that federal funds futures for the next year hover above 5%, indicating limited expectations for liquidity from the Federal Reserve (Fed).  A similar pattern was observed in Bitcoin&#8217;s mean reversion at the beginning of 2022 when futures began pricing for the current tightening cycle. As the lower bound of the federal funds rate rapidly rises from zero to 5.2% and is expected to continue increasing, significant pressure on all risk assets, including Bitcoin, may ensue. McGlone also highlights the historical relationship between Bitcoin and the broader market. Following the liquidity injection resulting from the shift to zero interest rates in early 2020, Bitcoin&#8217;s 20-week moving average reached its bottom before the S&#38;P 500 experienced a similar trend in the third quarter of that year.  Mike McGlone&#8217;s analysis raises concerns about Bitcoin&#8217;s future performance amid changing interest rate dynamics and the potential impact on all risk assets. As Bitcoin&#8217;s 20-week moving average shows signs of rolling over, investors and market participants will closely monitor its price trajectory and its ability to withstand the pressures of rising interest rates.  BTC&#8217;s Battle With Resistance, Will It Break Through Or Face A Seven-Month Low? At the time of writing, the leading cryptocurrency in the market, Bitcoin (BTC), is facing a challenge in surpassing the resistance wall at $26,400, as highlighted by NewsBTC.  Over the past 24 hours, BTC has managed to gain a modest 0.3%, while the most significant gains in the last 30 days have occurred within the seven-day timeframe, with a modest surge of 1.9%. Should BTC succeed in surpassing its immediate resistance, it will encounter the formidable 200-day and 50-day moving averages (MA) at levels of $27,000 and $27,100, respectively. These levels pose significant hurdles for the cryptocurrency&#8217;s prospects and potential future gains. Related Reading: This Latest Move Suggests SEC Lawsuit Against Ripple Is Pushing The Crypto Firm Outside The US Conversely, if BTC experiences an extended decline and relinquishes its current modest gains, Bitcoin bulls must closely monitor the crucial threshold at the $25,150 level.  A breach of this level could potentially drive BTC down to a seven-month low of $22,000, jeopardizing the cryptocurrency&#8217;s bull run and the gains achieved since the beginning of the year."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-13T23:00:39.000Z",
    "title": "Bitcoin Wallet Activity Touches 5-Month High, Will BTC Price Follow?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-wallet-btc-price/",
    "description": "Despite the less-than-impressive performance over the last few months, Bitcoin investors are still digging their heels deeper into the digital asset. This is evidenced by the continuous rise in wallet activity that has been recorded during this time. Bitcoin Wallet Activity Hits Highest In 5 Months In a Tuesday post, on-chain data aggregator Santiment revealed that there has been a significant uptick in Bitcoin wallet activity despite the BTC price downtrend. Apparently, while the market had fluctuated heavily due to regulatory uncertainties, Bitcoin investors held their own, especially in terms of new wallet address activity. Related Reading: Institutional Investors Flee Ethereum Amid Plunge Toward $1,500 The Santiment reports show fluctuations in this metric over the months. However, the one consistent thing was the tendency to jump back up even after dipping significantly. In September alone, the metric has moved from a low of around 860,000 to over 1.1 million unique daily Bitcoin addresses active. Unique daily addresses hit 5-month high &#124; Source: Santiment on X Interestingly, this figure is the highest this metric has been since April, proving that the BTC price downtrend has not served as a deterrent for Bitcoin investors. Rather, it looks as if investors are using the current low prices as a way to increase their footprint. The uptick can also be explained by the euphoria triggered by asset manager Franklin Templeton filing for a Spot Bitcoin ETF. While the hype around the filing was short-lived, it triggered a brief uptick in the price of the digital asset, and likely aided the rising wallet activity rate as investors rushed to take advantage of the growth. Will BTC Price Follow Wallet Activity? Even though wallet activity is up, the BTC price is still straining below $26,000. This could suggest that this metric does not really have much bearing on the price of Bitcoin. Rather, it just points to investors not slowing down usage of the network despite low prices. BTC price recovers above $26,000 &#124; Source: BTCUSD on Tradingview.com Presently, investors are still eagerly awaiting a decision on the numerous Spot BTC ETFs that have been filed by fund managers. The outcome of these filings, whether rejected or accepted, will likely be the defining factor for the Bitcoin price going forward. Related Reading: Analysts Are Bullish On ADA But Price Keeps Tanking, What’s Going On? For now, there are no big moves to be expected for the digital asset, especially given the fact that it is still ranging below its 50-day and 100-day moving averages. Mounting resistance between $26,000-$27,000 suggests that Bitcoin might continue to trade sideways for the better part of September. At the time of writing, Bitcoin is treacherously holding above $26,000 with meager gains of 0.64% in the last day. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-14T00:04:58.000Z",
    "title": "US Cities Giving Away $14,940,000 With Zero Strings Attached in New Basic Income Trials",
    "url": "https://dailyhodl.com/2023/09/13/us-cities-giving-away-14940000-with-zero-strings-attached-in-new-basic-income-trials/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/cash-basic-dollar.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/cash-basic-dollar.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/cash-basic-dollar.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/cash-basic-dollar.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/cash-basic-dollar.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/cash-basic-dollar.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/cash-basic-dollar.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Cities across the US are spinning up basic income trials at a rapid rate. A total of $14.49 million will be handed out in new pilot programs to test just how effective it is to hand out money to people with low incomes. Applications are now open in Ann Arbor, Michigan for a pilot that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/13/us-cities-giving-away-14940000-with-zero-strings-attached-in-new-basic-income-trials/\">US Cities Giving Away $14,940,000 With Zero Strings Attached in New Basic Income Trials</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-14T00:00:17.000Z",
    "title": "Top Analyst Warns of Imminent Ethereum Collapse, Says ETH Flashing Failed Bullish Pattern",
    "url": "https://dailyhodl.com/2023/09/13/top-analyst-warns-of-imminent-ethereum-collapse-says-eth-flashing-failed-bullish-pattern/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/eth-flashing-failed-bullish.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/eth-flashing-failed-bullish.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/eth-flashing-failed-bullish.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/eth-flashing-failed-bullish.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/eth-flashing-failed-bullish.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/eth-flashing-failed-bullish.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/eth-flashing-failed-bullish.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst believes that a monumental collapse is in the cards for the smart contract platform Ethereum (ETH). In a new video, analyst Nicholas Merten tells his 512,000 YouTube subscribers that Ethereum had more than a year to break out from an ascending triangle pattern. According to Merten, Ethereum&#8217;s inability to convincingly [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/13/top-analyst-warns-of-imminent-ethereum-collapse-says-eth-flashing-failed-bullish-pattern/\">Top Analyst Warns of Imminent Ethereum Collapse, Says ETH Flashing Failed Bullish Pattern</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]