[
  {
    "source": "CoinDesk",
    "date": "2023-06-05T21:42:07.000Z",
    "title": "Genesis Bankruptcy Judge Extends Mediation Period Between Genesis, Creditors",
    "url": "https://www.coindesk.com/policy/2023/06/05/genesis-bankruptcy-judge-extends-mediation-period-between-genesis-creditors/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The insolvent lender will now have until August 2 to submit a plan to emerge from bankruptcy."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-05T21:45:00.000Z",
    "title": "SEC’s Binance suit contains heavy mix of predictable charges, novel revelations",
    "url": "https://cointelegraph.com/news/sec-s-binance-suit-contains-heady-mix-of-predictable-charges-novel-revelations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/f20f6c0b-cec8-4413-abe3-d43f593bec1f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The world’s largest crypto exchange has been hit with an SEC suit that many saw coming, but the details will be studied closely. </p>\n                    <p><p>The announcement of the United States Securities and Exchange Commission suit against Binance, Binance.US and Binance CEO Changpeng Zhao (CZ) may have surprised the crypto community, but the SEC’s focus on the exchange was well known. The suit’s contents were met with a variety of reactions.</p><p>CZ <a href=\"https://twitter.com/cz_binance/status/1665742100845961217\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> in a tweet on the morning of June 5 that “Media gets the info before we do,” and the company had not seen the SEC complaint then. Evidence of scrambling behind the scenes may be seen in the two statements Binance issued in response to the suit. </p><p>The exchange called the suit “disappointing” in a blog post and <a href=\"https://www.binance.com/en/blog/ecosystem/sec-complaint-aims-to-unilaterally-define-crypto-market-structure-8707489117122437402\" target=\"_blank\" rel=\"noopener nofollow\">emphasized</a> the SEC's failure to provide clarity and guidance, as well as its impact on financial innovation. A later statement distributed by email addressed legal issues more closely, claiming there was a lack of due process and promising a vigorous defense.</p><p>No one who was paying attention should have been taken unawares by the SEC’s complaint, Cory Klippsten, CEO of financial firm Swan Bitcoin, said of the allegations. He claimed in a statement to Cointelegraph:</p><blockquote>“These practices of Binance have essentially been open secrets, so no one who operates in the space will be surprised by any of the charges.”</blockquote><p>Some of the details will still raise eyebrows. The most quotable passage in the suit undoubtedly came from the unnamed Binance chief compliance office in 2018, who said in a message to another company officer: </p><blockquote>“We are operating as a fking unlicensed securities exchange in the USA bro.” </blockquote><p>More light was shed on Brian Books’ brief tenure as CEO of Binance.US. Brooks, former U.S. Comptroller of the Currency and CEO of Binance.US for three months in 2021, is also memorably quoted in the suit (as “CEO B” of BAM Trading). According to the SEC, Brooks said in testimony: </p><blockquote>“[W]hat became clear to me at a certain point was CZ was the CEO of BAM Trading, not me. […] I realized, huh, I’m not actually the one running this company, and the mission that I believe I signed up for isn’t the mission. And as soon as I realized that, I left.” </blockquote><p>The SEC has repeatedly claimed that nearly all cryptos are securities, so the list of 10 tokens may also be illuminating. There are familiar claims, such as that Filecoin (<a href=\"https://cointelegraph.com/filecoin-fil-price-index\">FIL</a>) <a href=\"https://cointelegraph.com/news/sec-filecoin-is-security-grayscale-investors\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-filecoin-is-security-grayscale-investors/amp\">is a security</a>. Algorand (<a href=\"https://cointelegraph.com/algorand-algo-price-index\">ALGO</a>) <a href=\"https://cointelegraph.com/news/video-of-sec-chair-praising-algorand-resurfaces-after-recently-deeming-it-a-security\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/video-of-sec-chair-praising-algorand-resurfaces-after-recently-deeming-it-a-security/amp\">has also been singled out</a> before. </p><p>Among the tokens listed as securities in the suit, for Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>), Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) and Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>), the Binance suit may be a warning shot, however. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">And guess which tokens are illegal securities offerings. Spoiler alert it includes Solana and Cardano.  <a href=\"https://t.co/wMdICfIE3j\">pic.twitter.com/wMdICfIE3j</a></p>— Stephen Diehl (@smdiehl) <a href=\"https://twitter.com/smdiehl/status/1665770189290459140?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>There were already signs that a shakeup was underway at the exchange. Nearly simultaneously with the news of the SEC’s complaint, Bloomberg reported Richard Teng may be favored to replace CZ as the exchange’s next CEO. The news service cited “persons with direct knowledge.” </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/binance-readies-checkbook-for-potential-fines-from-us-regulators-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-readies-checkbook-for-potential-fines-from-us-regulators-report/amp\">Binance readies checkbook for potential fines from US regulators: Report</a></em></strong></p><p>Teng was <a href=\"https://www.binance.com/en/feed/post/573027\" target=\"_blank\" rel=\"noopener nofollow\">appointed</a> to head all regional markets outside the United States on May 29. He joined Binance Singapore in August 2021, coming from the Financial Services Regulatory Authority at Abu Dhabi Global Market, where he was CEO, and “quickly rose through the ranks.”</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-wendy-on-trashing-the-sec-sexism-and-how-underdogs-can-win-hall-of-flame/\">Crypto Wendy on trashing the SEC, sexism, and how underdogs can win: Hall of Flame</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-05T22:08:41.000Z",
    "title": "Top 10 Blockchain Development Companies: Innovative Solutions Tailored to Your Business Needs",
    "url": "https://www.cryptopolitan.com/blockchain-development-companies-solutions/",
    "description": "In the digital age, blockchain technology is carving out a transformative path, enabling a decentralized, transparent, and secure method for transmitting and storing data. Fueled by the success of cryptocurrencies like Bitcoin, the application of blockchain technology has transcended beyond the confines of the financial sector and permeated various industries, from supply chain management to ... <a title=\"Top 10 Blockchain Development Companies: Innovative Solutions Tailored to Your Business Needs\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blockchain-development-companies-solutions/\" aria-label=\"More on Top 10 Blockchain Development Companies: Innovative Solutions Tailored to Your Business Needs\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-05T21:46:04.000Z",
    "title": "Top 10 Smart Contracts Audit Companies: How To Make Use of Their Effective Services",
    "url": "https://www.cryptopolitan.com/smart-contracts-audit-companies-services/",
    "description": "Smart contracts, the self-executing digital contracts based on blockchain technology, have become a cornerstone of the digital world, promising to automate processes, reduce costs, and heighten security in various sectors. While these contracts bear significant potential, they are not impervious to bugs, vulnerabilities, or design issues, necessitating the role of professional auditing services.&#160; These specialized ... <a title=\"Top 10 Smart Contracts Audit Companies: How To Make Use of Their Effective Services\" class=\"read-more\" href=\"https://www.cryptopolitan.com/smart-contracts-audit-companies-services/\" aria-label=\"More on Top 10 Smart Contracts Audit Companies: How To Make Use of Their Effective Services\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-05T22:00:50.000Z",
    "title": "US SEC Sues Binance, Fails To Mention Ripple (XRP) As Security",
    "url": "https://www.newsbtc.com/news/ripple/us-sec-sues-binance-fails-to-mention-ripple-xrp-as-security/",
    "description": "In a shock move that has forced the cryptocurrency markets lower, the United States Securities and Exchange Commission (SEC) on June 5 sued Binance, the world&#8217;s largest cryptocurrency exchange, accusing them of 13 charges, one of which is allegedly enabling the trading of unregistered securities. Top of the list, the regulator said, was that Binance allegedly allowed the trading of several crypto assets, including BNB, the platform&#8217;s native currency; Cardano&#8217;s ADA; and MATIC, the token priming the Polygon ecosystem. XRP Not A Security? The SEC didn&#8217;t mention payment company Ripple, the native currency of the XRP Ledger, a platform through which the company bases its flagship products. The two entities have been entangled in a legal fight since late 2020, when the regulator accused the payment company of allegedly selling an unregistered security, XRP.  It should be noted that despite the regulator mentioning XRP, the coin&#8217;s price is lower and weighed by the market-wide collapse that has so far wiped billions in value from the total crypto market capitalization, according to CoinMarketCap (CMC), a coin tracker. Related Reading: Ethereum Top 10 Whales Now Hold 31.8M ETH, A New All-Time High When writing on June 5, the total cryptocurrency market cap had contracted by over 5% to $1.09 trillion. During this time, the XRP price has been down 7% in the past 24 hours.  However, comparing the current performance to how XRP faired last week, the coin is the only one in the green territory, adding 3%. This means XRP has outperformed all the top-10 cryptocurrencies, including Ethereum and Bitcoin. The failure of the SEC to mention XRP in their lawsuit could be a huge boost for the token and its ecosystem in the days and weeks ahead. This is especially considering the ongoing case.  Ripple Supporters Remain Bullish Despite SEC&#8217;s Accusations The case is ongoing, but there have been rulings in recent weeks that make XRP supporters optimistic. The presiding judge has denied SEC&#8217;s motion to seal the Hinman documents.  Although the SEC vehemently campaigned for these documents to remain private, claiming they were deliberative and privileged, the judge said the public had the right to know since they are relevant to the case.  These documents are critical in the case as they detail internal communication by the SEC on how they classified XRP as a security.  Related Reading: Cardano (ADA) A Security? Price Collapses On SEC v. Binance Lawsuit Still, the judge is yet to make a ruling though the SEC, in March 2023, filed an amended complaint against Ripple, claiming they were engaged in market manipulation. Ripple has since filed a motion to dismiss the regulator&#8217;s amended complaint saying they are &#8220;baseless.&#8221; Feature Image From Canva, Chart From TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-05T22:01:11.000Z",
    "title": "JPMorgan Launches Pilot Program for Blockchain Settlement System With Six Banks From India: Report",
    "url": "https://dailyhodl.com/2023/06/05/jpmorgan-launches-pilot-program-for-blockchain-settlement-system-with-six-banks-from-india-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/jpmorgan-survey-says-soar.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/jpmorgan-survey-says-soar.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/jpmorgan-survey-says-soar.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/jpmorgan-survey-says-soar.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/jpmorgan-survey-says-soar.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/jpmorgan-survey-says-soar.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/jpmorgan-survey-says-soar.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>JPMorgan Chase &#38; Co. is partnering with six Indian banks to launch a blockchain-based platform for settling interbank dollar transactions in New Delhi&#8217;s trading center. According to a new Bloomberg report, the platform will be available 24/7 and will remove the need for manual intervention, which is expected to reduce settlement times and costs. New Delhi [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/05/jpmorgan-launches-pilot-program-for-blockchain-settlement-system-with-six-banks-from-india-report/\">JPMorgan Launches Pilot Program for Blockchain Settlement System With Six Banks From India: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]