[
  {
    "source": "CoinDesk",
    "date": "2023-07-17T20:54:06.000Z",
    "title": "Despite BlackRock, Don’t Expect a Flood of Spot-Bitcoin ETFs Soon: Experts",
    "url": "https://www.coindesk.com/consensus-magazine/2023/07/17/despite-blackrock-dont-expect-a-flood-of-spot-bitcoin-etfs-soon-experts/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "BlackRock’s recent application to start a Bitcoin ETF has raised hopes that the SEC would soon approve an instrument seen as key to crypto’s growth. But a range of market watchers contacted by CoinDesk said several roadblocks still lie ahead."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-17T20:54:44.000Z",
    "title": "Ripple court ruling makes call for regulation 'more compelling and more urgent' — former CFTC chair",
    "url": "https://cointelegraph.com/news/ripple-court-ruling-regulation-more-compelling-more-urgent-former-cftc-chair",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/1588a789-cbad-4338-849d-ef91fe8a10ee.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Former CFTC chair Timothy Massad said he thought it was unlikely the SEC and CFTC would change their pattern for pursuing enforcement cases even with a recent ruling in XRP's favor.</p>\n                    <p><p>Timothy Massad, former chair of the United States Commodity Futures Trading Commission (CFTC), has said though a Securities and Exchange Commission (SEC) v. Ripple court ruling may impact the way businesses and lawmakers address crypto, his call for regulatory clarity remains the same.</p><p>In a July 7 op-ed with The Wall Street Journal, Massad and former SEC chair Jay Clayton <a href=\"https://www.wsj.com/articles/regulating-crypto-markets-1e5ec5c5\" target=\"_blank\" rel=\"noopener nofollow\">suggested</a> that lawsuits brought by the SEC and CFTC against crypto firms were “unlikely to bring about a significant improvement in investor protection and market integrity quickly”. The comments came before a federal judge in the SEC v. Ripple case <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">issued a ruling</a> seemingly in the blockchain firm’s favor, by suggesting the XRP token was not a security.</p><p>Speaking to Cointelegraph on July 17, Massad argued that the court ruling didn’t necessarily limit the scope of the Howie test — the standard by which the SEC identifies a security — because the judge stated that institutional investors “reasonably expected that Ripple would use the capital it received from its sales to improve the XRP ecosystem and thereby increase the price of XRP”. In regards to any potential issues surrounding Ripple’s holdings, the former CFTC chair said the SEC could consider an appeal of the judge’s decision, or lawmakers could step in.</p><p>“This clearly shows that we cannot create a crypto regulatory framework solely through enforcement,” said the former CFTC chair.</p><p>Massad added that he thought it was unlikely for the number of enforcement cases brought by the SEC or CFTC to drop even with the ruling seemingly taking XRP out of their scope. He proposed that the two regulators should work together to develop standards on crypto aimed at providing investor and market protection, either directly or through a self-regulatory organization. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ripple-decision-is-troublesome-on-multiple-fronts-says-former-sec-official\"><strong><em>Ripple decision is ‘troublesome on multiple fronts,’ says former SEC official</em></strong></a></p><p>According to the former CFTC chair, the case could provide motivation for some U.S. lawmakers previously unwilling to consider legislation impacting the space. Representatives in the House Financial Services Committee are currently <a href=\"https://cointelegraph.com/news/crypto-u-s-industry-watchdogs-oppose-draft-bill-on-crypto-market-structure\">considering a draft</a> of a market structure bill, and Senators Cynthia Lummis and Kirsten Gillibrand <a href=\"https://cointelegraph.com/news/senators-reintroduce-crypto-bill-comprehensive-regulation\">reintroduced legislation aimed at creating</a> a comprehensive regulatory framework for digital assets on July 12.</p><blockquote>“[The Ripple ruling] has made our argument more compelling and more urgent, meaning that we can’t just rely on enforcement to get the kind of investor protection standards we need.\"</blockquote><p>Massad served as CFTC chair from 2014 to 2017 under U.S. President Barack Obama. He has previously spoken in favor of regulators approving a spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund, releasing a central bank digital currency for payments in the United States, and regulatory clarity as the crypto space continues to grow.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-17T20:41:51.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here&#8217;s a ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\">Read more</a>"
  }
]