[
  {
    "source": "Decrypt",
    "date": "2023-12-25T18:01:04.000Z",
    "title": "Emerge Weirdest News Stories of 2023",
    "url": "https://decrypt.co/210807/weirdest-emerging-tech-stories-of-2023",
    "description": "From beer made of vaginal yeast to toilets that know more about you than your doctor, these bizarre trends kept us from getting bored this year."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-12-25T18:01:55.000Z",
    "title": "Veteran Macro Investor Dan Tapiero Explains Why He is So Bullish on Bitcoin and Gold in 2024",
    "url": "https://www.cryptoglobe.com/latest/2023/12/veteran-macro-investor-dan-tapiero-explains-why-he-is-so-bullish-on-bitcoin-and-gold-in-2024/",
    "description": "Dan Tapiero, a seasoned macro investor, has shared his optimistic outlook for Bitcoin (BTC) in 2024, predicting a substantial upward trend. Bitcoin’s Projected Growth in 2024 Strong Year-to-Date Performance: Tapiero highlights Bitcoin’s remarkable growth, noting a 160% increase year-to-date and its approach towards a high year-end close. Institutional Investment Inevitability: He emphasizes that Bitcoin’s track […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-25T18:00:40.000Z",
    "title": "Dyson Finance Becomes Fastest-Growing DEX on Polygon zkEVM and Linea, Revolutionizing Liquidity Provision",
    "url": "https://news.bitcoin.com/dyson-finance-becomes-fastest-growing-dex-on-polygon-zkevm-and-linea-revolutionizing-liquidity-provision/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/frame-37018-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/frame-37018-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/frame-37018-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/frame-37018-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/frame-37018-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/frame-37018-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/frame-37018-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/frame-37018.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. TAIPEI, December 25th 2023 – Dyson Finance, the game-changer in Decentralized Exchanges (DEX), has made waves in the past quarter on Polygon zkEVM and Linea, challenging the norm of DEXs grappling with Liquidity Provider (LP) profitability. In an impressive feat, Dyson Finance has become the fastest-growing platform on both Layer2 chains within just [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-25T17:55:08.000Z",
    "title": "BRC-20 token ORDI jumps 30% on Christmas",
    "url": "https://crypto.news/brc-20-token-ordi-jumps-30-on-christmas/",
    "description": "The native token of Casey Rodarmor’s Ordinals Protocol recorded double-digit price gains in 24 hours during the holidays, along with other BRC-20 cryptocurrencies. ORDI rallied as much as 37% on Dec. 25, with its daily trading volume and market capitalization&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-25T17:42:57.000Z",
    "title": "Last Christmas’ $100 in Bitcoin and Ethereum is now significantly higher",
    "url": "https://crypto.news/last-christmas-100-in-bitcoin-and-ethereum-is-now-significantly-higher/",
    "description": "If you decided to invest $100 in each BTC and ETH last Christmas, how much would they be worth today? As the market is seemingly out of a prolonged crypto winter that began in early 2022, on Christmas day, we&#8217;re&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-25T18:01:05.000Z",
    "title": "A Crypto Christmas Special With Jlabs Digital: Past, Present, And Future",
    "url": "https://www.newsbtc.com/news/a-crypto-christmas-special-with-jlabs-digital-past-present-future/",
    "description": "Another year, another Crypto Christmas special for our team at NewsBTC. In the coming week, we’ll be unpacking 2023, its downs and ups, to reveal what the next months could bring for crypto and DeFi investors. Related Reading: A Crypto Holiday Special: Past, Present, And Future With Ben Lilly Like last year, we paid homage to Charles Dicke’s classic “A Christmas Carol” and gathered a group of experts to discuss the crypto market&#8217;s past, present, and future. In that way, our readers might discover clues that will allow them to transverse 2024 and its potential trends. Crypto Christmas: What&#8217;s Behind The Bitcoin Rally, And Which Coin Has The Most Potential? This year, we kicked off this special with JLabs Digital, formerly Jarvis Labs. One of the most prominent crypto analytics firm in the nascent sector. Their insight into the market dynamics has been popular due to their use of solid data and easy-to-follow style. Since 2022, the team at JLabs Digital has been expanding as they bring in new analysts, educational tools, and new ways to share their insights. Last year, we spoke to one of its founders, Ben Lilly, who was betting on crypto becoming &#8220;better&#8221; and more mature due to the lessons left by the fall of FTX and others. JJ walked us through the differences between this rally and previous years, the most undervalued coin in the sector, the potential twists in the market, and more. Q: In light of the prolonged bearish trends observed in 2022 and 2023, how do these periods compare to previous downturns in severity and impact? With Bitcoin now crossing the $40,000 threshold, does this signify a conclusive end to the bear market, or are there potential market twists investors should brace for? JJ: So with Bitcoin now crossing over the $40,000 threshold, does this signify a conclusive end to the bear market (&#8230;) I&#8217;m leaning towards the twist portion of that. I think most of this rally was really driven by disbelief and people shorting it to each pump, especially as we neared $30K, there was just a huge washout of shorts that had ated over the past year between options and derivatives. So that forced buying is really what set us up over $40,000 in my opinion. So now to sustain this, there&#8217;s going to have to be continued spot buying to see the price above, say $48,000 to $52,000. I think it&#8217;s possible we get up to that range, but I don&#8217;t think we&#8217;re just going to get to that range and keep ripping. I think sooner or later we&#8217;re going to come back down and retest that $30,000 mark. So that&#8217;s an eye investors and traders should have their eye on into 2024. I do think you&#8217;ll inevitably get that large leverage washout as is very typical in Bitcoin. Q: Right now, we are seeing Bitcoin reach new highs. Do you think we are in the early days of a full bull run? What has changed in the market that enabled the current price action; is it the Bitcoin spot ETF or the US Fed hinting at a loser policy or the upcoming Halving? What is the big narrative that will go on in 2024? JJ: I do think we&#8217;re entering a new bull market, but that said, there&#8217;s always going to be twists and turns and leverage liquidations. Keep that level in mind. $28K to $32K, think will be as good an entry as any if we get that opportunity in 2024. Anytime we see those big breakouts we saw in October, it&#8217;s just so typical Bitcoin to come back and retrace it. But what it first wants to do is engineer liquidity. So you have to realize the people that paint these charts are very sophisticated and they want to make you enter at less than optimal prices and sell less than optimal prices. So how they do that, they kind of coax you into buying at $40K. (They make you think) It&#8217;s never going to go back down again. And then next thing you know you&#8217;re holding onto those buys and it&#8217;s at $28,000 and you&#8217;re being forced to sell. I think this (rally) is much different. Basically if you look at 2021, we had (Microstrategy&#8217;s Michael) Sailor and Tesla buying (BTC), but outside of that, as we know, it was a lot of leverage to (investors) such as Three Arrows Capital, Grayscale, the Digital Currency Group that was overlooking it. All these people were getting access to massive amounts of leverage due to how cheap it was to borrow the dollars at the time, due to the interest rates being zero, they were using that to leverage themselves and basically pump Bitcoin artificially. And then we all saw that washout last year and as opposed to what we see now, this is actual institutional buying. So there&#8217;s been no doubt that I&#8217;m sure BlackRock, Fidelity, et cetera, they&#8217;re not buying now, they were buying below $20,000, they were buying throughout the $20,000 range. They&#8217;re not buying above $35,000 to $40,4K. So we do see a bit more strength at the bottom of the market, which is going to form a better base for 2024. But that said, there&#8217;s always going to be those ups and downs, but I think long-term, the fact that we saw that capitulation from kind of the leverage deigns to institutional players who know how to organize and manage these trades more efficiently, I think it&#8217;s very bullish for Bitcoin and definitely regime shift. I think it&#8217;s kind of forming. I mean as of right now, the future&#8217;s kind of unpredictable, but the things I see, we have this ETF coming. Do I think it&#8217;s going to be like the moment it&#8217;s approved, Bitcoin&#8217;s just going to take off? No, there&#8217;s a lot of complications with that. Like the Grayscale BTC trust, I think they hold over 600,000 BTC that&#8217;s going to have to get distributed. I&#8217;m not sure that there&#8217;s enough demand as of yet to just soak up all that supply that&#8217;ll be coming onto the market. But as we go down the line a few months later, these ETFs are rolling. BlackRock has their team of thousands of advisors out there selling this because they&#8217;re incentivized to. And at the same time we have &#8220;The Halving&#8221; where supply cuts down on the amount of emissions miners able to readily sell as supply. So you&#8217;ll have this massive influx. It&#8217;s very hard to be overstated the amount of new demand that will be coming online because of the ETF. At the same time we have &#8220;The Halving&#8221; event which is going to cut down on the amount of supply available for sale. I think that&#8217;s kind of forming a perfect storm in of itself. And then you look at the dollar, the DXY index, this is something I hit on a lot in my articles and the videos that we do on YouTube, and you see it&#8217;s (the DXY) been on a downtrend throughout 2023. It looks like it&#8217;s getting worse into 2024. We just had the Fed signaling that they&#8217;re thinking about rate cuts, which is usually as good a sign as any that those rate cuts will be happening. So the dollar will be weakening. At the same time we have this massive new demand for Bitcoin. At the same time the supply of Bitcoin&#8217;s dropping down. So you can see that all the stars are aligning for new all time highs, a hundred thousand plus targets. But it&#8217;s going to be a tricky road there. Like I said, I think we&#8217;re going to inevitably go back down to that $28 to $30K range, and then probably in the second half of the year we&#8217;ll really see it defy expectations to the upside. Q: Last year, we spoke about the most resilient sectors during the Crypto Winter. Which sectors and coins will likely benefit from a new Bull Run? We are seeing the Solana ecosystem bloom along with the NFT market; what trends could benefit in the coming months? JJ: It&#8217;s hard to say. As of right now, the narratives that&#8217;ll take hold, there&#8217;s going to be some crazy pumps on things and there&#8217;s going to be wild narratives like we saw with DeFi in 2021, what those are right now, we could guess, but there&#8217;s nothing definitive in my mind that it seems like, I think a lot of it&#8217;s being priced in now, actually. You see kind of these wild altcoin pumps over the past month. I don&#8217;t know how sustainable that is over the near term, but I think one thing people are overlooking is if this BTC ETF gets approved, we&#8217;ve kind of set the legal precedent that what the SEC did in approving the Bitcoin ETF, the futures ETF, but not approving the spot was illegal. Related Reading: Ethereum Price Dips Again – Is This Bulls Trap or Technical Correction? They&#8217;ve already approved Ethereum futures ETFs and now there&#8217;s a bunch of spot Ethereum ETFs open for application. So I think it&#8217;s inevitable that those will get approved and I think Ethereum is wildly underpriced. Not to say we won&#8217;t get pullbacks from here, but those are pullbacks you should be looking to buy because I think an Ethereum spot ETF is almost a hundred percent likely in the second half of 2024. And I think we&#8217;ll see some coins that were probably overpriced compared to Ethereum. If you factor that in, and I think we&#8217;ll see Ethereum and its use cases really start to take life in 2024. You see a flight to value at some point there, rather than the wild speculation that happens on other alts. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-25T18:00:28.000Z",
    "title": "Solana Breaks New Record, Will This Send SOL Price To $200?",
    "url": "https://www.newsbtc.com/news/solana/solana-sol-price-to-200/",
    "description": "Solana recently reached a new milestone in December, as the crypto continues its trend of massive gains this year. Solana&#8217;s price has almost doubled its price at the beginning of the month, increasing appeal among users. In line with this trend, the Solana blockchain has attracted an extraordinary increase in user engagement this month.  Although there is still one week remaining in the month, the monthly activity level of Solana&#8217;s addresses has surpassed its previous greatest point this year, reaching a new milestone of over 16.45 million in December.  At the same time, on-chain data reveals the blockchain has broken past 7.23 million new addresses created this month alone. This surge of new users flocking to the network could be a sign that SOL&#8217;s price may be heading to $200 soon. Solana’s Growing Activity And Network Usage Solana&#8217;s popularity has grown this year than most would expect. As a result, Solana grew in market cap, displacing both XRP and BNB in the top crypto rankings in quick succession.  Related Reading: Bitcoin Downfall: Arthur Hayes Reveals What Will Make The Pioneer Crypto Fail According to on-chain data from The Block, Solana&#8217;s active addresses have been growing since October, reaching a yearly high of 981,380 daily transactions on December 21. Meanwhile, transactions in December are now at a yearly high of 16.45 million, already surpassing January&#8217;s count of 15.24 million.  Source: HELLOMOON Solana&#8217;s trading volume this month is now at $183.99 billion, a 111% increase from the $86.86 billion trading volume in November. The blockchain also recently surpassed Ethereum in 7-day DEX volume for the first time in history. DeFiLlama puts the total value locked on Solana&#8217;s DeFi protocols at $1.492 billion, a 580% increase from $210.47 million on January 1. Source: HELLOMOON How Increased Network Usage Could Impact The Solana Price With more people interacting with the network each day, Solana’s popularity and value are skyrocketing. As the active addresses perform transactions, stake SOL, and interact with dApps on the blockchain, it boosts Solana’s utility and makes the SOL token more useful and valuable.  Related Reading: Crypto Veterans Team Up With New Proposal To Send LUNC And USTC To $1 This growth is particularly evident in BONK, Solana&#8217;s first dog-themed meme token, whose price has grown 314% in a 30-day timeframe. Solana, on the other hand, recently reached a yearly high of $117.  Reaching $200 would be a huge milestone for SOL, as the crypto hasn&#8217;t reached this price level since November 2021. However, while the current metrics point to increased activity to reach this price point soon, the first resistance is at the $116 price level and the next around $136.  A strong break over $136 and a strong general crypto market bullish sentiment in 2024 would give Solana free rein to continue climbing higher. SOL looking to finish 2023 on a high note &#124; Source: SOLUSD on Tradingview.com Featured image from The Independent, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-25T18:00:00.000Z",
    "title": "Ethereum Will Outperform Bitcoin in Next Bull Market, Says Analyst",
    "url": "https://coinedition.com/ethereum-will-outperform-bitcoin-in-next-bull-market-says-analyst-2/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/ETHBTC-Reaching-0.071-Will-Confirm-an-Alt-Market-Breakout.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"ETHBTC Reaching 0.071 Will Confirm an Alt Market Breakout\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/ETHBTC-Reaching-0.071-Will-Confirm-an-Alt-Market-Breakout.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/ETHBTC-Reaching-0.071-Will-Confirm-an-Alt-Market-Breakout-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/ETHBTC-Reaching-0.071-Will-Confirm-an-Alt-Market-Breakout-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/ETHBTC-Reaching-0.071-Will-Confirm-an-Alt-Market-Breakout-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/ETHBTC-Reaching-0.071-Will-Confirm-an-Alt-Market-Breakout-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/ETHBTC-Reaching-0.071-Will-Confirm-an-Alt-Market-Breakout-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Influencer and cryptocurrency analyst Lark Davis expressed his optimism that Ether (ETH), the second-largest digital asset by market cap, will outperform Bitcoin (BTC) in the anticipated bull market.  Davis made this statement in a recent interview where he argued that Ethereum’s performance will be buoyed by a number of factors. “If you were to invest [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/ethereum-will-outperform-bitcoin-in-next-bull-market-says-analyst-2/\">Ethereum Will Outperform Bitcoin in Next Bull Market, Says Analyst</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-25T17:55:32.000Z",
    "title": "Ripple’s Chief Legal Officer Reveals SEC Approached Payments Firm With a Deal Before Filing Lawsuit",
    "url": "https://dailyhodl.com/2023/12/25/ripples-chief-legal-officer-reveals-sec-approached-payments-firm-with-a-deal-before-filing-lawsuit/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/07/judge-removes-ripple.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/07/judge-removes-ripple.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/07/judge-removes-ripple.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/07/judge-removes-ripple.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/07/judge-removes-ripple.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/07/judge-removes-ripple.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/07/judge-removes-ripple.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Ripple&#8217;s chief legal officer says the U.S. Securities and Exchange Commission (SEC) made moves in an effort to declare the digital asset XRP a security. Stuart Alderoty says on the social media platform X that before commencing the lawsuit against Ripple, the regulator approached the company with a settlement that would have changed the trajectory [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/25/ripples-chief-legal-officer-reveals-sec-approached-payments-firm-with-a-deal-before-filing-lawsuit/\">Ripple’s Chief Legal Officer Reveals SEC Approached Payments Firm With a Deal Before Filing Lawsuit</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]