[
  {
    "source": "CryptoGlobe",
    "date": "2023-09-01T04:29:46.000Z",
    "title": "SWIFT and Chainlink Conduct Experiments to Facilitate Global Tokenized Asset Transfers",
    "url": "https://www.cryptoglobe.com/latest/2023/09/swift-and-chainlink-conduct-experiments-to-facilitate-global-tokenized-asset-transfers/",
    "description": "SWIFT, the global financial messaging network, has released the results of a series of experiments that demonstrate its ability to facilitate the transfer of tokenized assets across multiple blockchains. Conducted in partnership with Chainlink, a leading Web3 services platform, the experiments also involved a consortium of major financial institutions, including ANZ, BNP Paribas, BNY Mellon, […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-01T04:11:45.000Z",
    "title": "Top China banks slash deposit rates – Will it help though?",
    "url": "https://www.cryptopolitan.com/top-china-banks-slash-deposit-rates/",
    "description": "In a desperate attempt to buffer their diminishing margins, five of China&#8217;s premier banks recently cut deposit rates. This seemingly coordinated effort appears to be a move towards reviving a beleaguered property sector and an economy on the ropes. But as with any drastic action, it begs the question: will this tactic actually provide the ... <a title=\"Top China banks slash deposit rates &#8211; Will it help though?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-china-banks-slash-deposit-rates/\" aria-label=\"More on Top China banks slash deposit rates &#8211; Will it help though?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-01T04:21:10.000Z",
    "title": "Ethereum Faces Rejection Yet Again, Can Bulls Protect This Key Support?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-faces-rejection-1750/",
    "description": "Ethereum price failed to reclaim $1,750 and trimmed all gains against the US Dollar. ETH could accelerate lower if it breaks the $1,630 support. Ethereum started a fresh decline below the $1,700 level. The price is trading below $1,700 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance near $1,690 on the hourly chart of ETH/USD (data feed via Kraken). The pair could extend its decline if there is a close below the $1,630 support. Ethereum Price Trimmed Gains Ethereum’s price failed to settle above the $1,700 level. ETH started a fresh decline and gained bearish momentum below the $1,700 level, like Bitcoin. There was a clear move below the $1,665 level and the price spiked below the $1,640 level. It tested the $1,630 support and is currently consolidating losses. Ether is now trading below $1,700 and the 100-hourly Simple Moving Average. Besides, there is a key bearish trend line forming with resistance near $1,690 on the hourly chart of ETH/USD. On the upside, the price might face resistance near the $1,660 level and the 23.6% Fib retracement level of the recent decline from the $1,747 swing high to the $1,630 low. The next resistance is near the $1,680 level. The main resistance is now forming near the trend line and $1,700. It is close to the 50% Fib retracement level of the recent decline from the $1,747 swing high to the $1,630 low. Source: ETHUSD on TradingView.com A close above the $1,700 level might send the price toward the $1,750 zone. If there is a clear move above $1,750, Ethereum could climb toward the $1,800 resistance. Any more gains might send the price toward the $1,850 resistance. More Losses in ETH? If Ethereum fails to clear the $1,700 resistance, it could continue to move down. Initial support on the downside is near the $1,640 level. The first key support is close to $1,630. The next major support is near the $1,600 level. If there is a downside break below $1,600, the price could extend its decline toward the $1,540 level. Any more losses might send the price toward the $1,480 level in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,630 Major Resistance Level – $1,700"
  }
]