[
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T13:30:00.000Z",
    "title": "Deposit risk: What do crypto exchanges really do with your money?",
    "url": "https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/magazine-Is-decentralized-blockchain-gaming-even-possible-scaled.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>While depositing may be easy, what some crypto exchanges do with your money behind the scenes can range from concerning to criminal.</p>\n                    <p><p><strong>So, youve deposited some cryptocurrency onto an exchange. You expect that these funds will be held in your name as a liability, with safeguards in place to make sure that you can withdraw them when you wish.<br><br>However, this is not necessarily the case.</strong><br><br>Sitting down with Magazine, Simon Dixon, CEO of global online investment platform BnkToTheFuture, warns that the murky lines between regulations in the crypto industry mean that customers must be extremely cautious about where they stash their crypto.</p><blockquote class=\"wp-block-quote\"><p>[The cryptocurrency industry] was created by businesses that want to build financial institutions, and robust financial history has shown that if you leave them to their own devices, they wont respect client money.</p></blockquote><p>Take FTX for example. Dixon notes that <a href=\"https://cointelegraph.com/news/how-to-keep-your-cryptocurrency-safe-after-the-ftx-collapse\" target=\"_blank\" rel=\"nofollow\" >former FTX CEO</a> Sam Bankman-Fried allegedly treated customer funds as if they were his own, tipping billions into Alameda Research.</p><p>FTX would use those assets for their sister company hedge fund and then find themselves in a position where the hedge fund had lost all of their money, Dixon says, emphasizing that this led to there being no assets for clients to withdraw.</p><p>Dixon has invested more than<a href=\"https://cointelegraph.com/magazine/bitcoin-og-simon-dixon-bankruptcies-elon-musk-crypto-twitter-hall-of-flame/#:~:text=Simon%20Dixon%20is%20a%20true,Labs%20and%20%E2%80%94%20err%20%E2%80%94%20Celsius.\" target=\"_blank\" rel=\"nofollow\" > $1 billion</a> in over 100 different crypto companies, including Kraken and Ripple Labs. One of the projects BnkToTheFuture raised money for turned out to be one of the biggest crypto disasters in recent times: bankrupt crypto lending platform Celsius.</p><p><br>Before its collapse in July 2022, Celsius was allegedly using money from new customers to pay off attractive yields promised to other existing customers. He says Celsius caught investors and customers off guard by treating their client money as if it were their own.</p><p>Crypto opponents like United States Representative Brad Sherman characterized this behavior as endemic to the cryptocurrency ecosystem:</p><figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"><div class=\"wp-block-embed__wrapper\"><blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">During the <a href=\"https://twitter.com/hashtag/SBF?src=hash&ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >#SBF</a> saga, I said the supporters of <a href=\"https://twitter.com/hashtag/crypto?src=hash&ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >#crypto</a> will say that Sam Bankman-Fried was just one snake in a crypto Garden of Eden. But in reality, crypto was a Garden of Snakes.<br><br>Since then, we seem to catch another snake every few weeks.<a href=\"https://twitter.com/hashtag/Celsius?src=hash&ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >#Celsius</a> <a href=\"https://t.co/0Fgz6yYj7D\" target=\"_blank\" rel=\"nofollow\" >https://t.co/0Fgz6yYj7D</a></p>— Congressman Brad Sherman (@BradSherman) <a href=\"https://twitter.com/BradSherman/status/1679568766496043009?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >July 13, 2023</a></blockquote><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></figure><p>So, what are all the other crypto exchanges actually doing with your money? Even if theyre not outright frauds, can you trust exchanges to safeguard your funds?</p><p>There are hundreds of crypto exchanges across the globe, spanning from more trustworthy to outright fraudulent. </p><p>Crypto market tracker CoinMarketCap tracks 227 of <a href=\"https://coinmarketcap.com/rankings/exchanges/\" target=\"_blank\" rel=\"nofollow\" >these exchanges</a>, which among them have an approximate 24-hour trading volume in July of around $181 billion (if you ignore accusations of rampant wash trading).</p><p>Adrian Przelozny, CEO of Australian crypto exchange Independent Reserve, tells Magazine that consumers should always be mindful of the distinction between the business model of an exchange versus a broker.</p><p>An exchange usually keeps its customers assets directly in its own storage. This means they cant really use those assets to make extra profit for themselves. Przelozny explains that Independent Reserve has enough liquidity on the platform so that when you place an order on the exchange you are trading against another customer.</p><p>On the flip side, brokers may entail counterparty risks to other exchanges by holding customers crypto assets on the exchange to earn some extra money.<br><br>This helps the broker rake in more funds, but it also puts the customer at risk. Przelozny emphasizes that brokers cannot earn a return using clients assets without taking a risk.</p><p>He warns that with a brokerage-type business model, when you place an order, that platform has to essentially run off in the background to acquire the asset you want.</p><blockquote class=\"wp-block-quote\"><p>The platform has to get the liquidity from another exchange, so they place the order on behalf of the customer and then that customer is actually exposed to counterparty risk.</p></blockquote><p>A counterparty risk is when there is a chance that another party involved in a contract might not hold up their end of the deal. It gets riskier when a broker keeps customer funds or assets on another exchange because if that exchange goes bust, the customer assets could go down the drain as well.</p><p>Its a word that would probably send shivers down the spines of the executives at Australian-based crypto broker Digital Surge, which found itself in hot water right after FTX went down.</p><p>The Australia-based broker went into administration after it had transferred $23.4 million worth of its assets to FTX, just two weeks before the whole collapse happened in November 2022.</p><p>Digital Surge managed to pull off a lucky escape <a href=\"https://cointelegraph.com/news/crypto-exchange-digital-surge-emerges-as-a-rare-survivor-of-ftx-fallout\" target=\"_blank\" rel=\"nofollow\" >with a bailout plan</a>; however, it did involve directors Daniel Rutter and Josh Lehman personally chucking $1 million into the mix.</p><p>Crypto lender BlockFi and crypto exchange Genesis werent so lucky: Both ended up filing for Chapter 11 bankruptcy due to being exposed to the FTX mess.</p><figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"><div class=\"wp-block-embed__wrapper\"><blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Genesis?src=hash&ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >#Genesis</a> was an institutional crypto lending platform for other crypto lenders so here are the publicly disclosed Chapter 11 creditors. Expect <a href=\"https://twitter.com/hashtag/Gemini?src=hash&ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >#Gemini</a> to file Chapter 11 with $765m exposure.  Also listed is <a href=\"https://twitter.com/hashtag/Abra?src=hash&ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >#Abra</a> $30m & <a href=\"https://twitter.com/hashtag/Ripio?src=hash&ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >#Ripio</a> $27m. Full disclosure I am a shareholder in Abra. <a href=\"https://t.co/xkFlNaZGrP\" target=\"_blank\" rel=\"nofollow\" >pic.twitter.com/xkFlNaZGrP</a></p>— Simon Dixon (@SimonDixonTwitt) <a href=\"https://twitter.com/SimonDixonTwitt/status/1616389082502008832?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >January 20, 2023</a></blockquote><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></div></figure><p>So, while an exchange has fewer avenues to generate profits compared to a broker, it prioritizes the safety of funds. </p><p>Dixon explains that if a crypto broker is storing client assets on another exchange, such as Binance, for example, the broker should be transparent with the client that if anything were to go wrong with Binance, the assets would be hard to retrieve. </p><p>In the case of the crypto exchange side of BnkToTheFuture, Dixon makes it clear that as a registered virtual asset service provider, it has to have disaster recovery, and all clients assets need to be distributable at all times, even if the parent company goes down.</p><p>We actually cant use [client assets] in any way shape or form as per our [securities] registration, Dixon says.</p><p>He explains that a securities registration holds an exchange to a higher standard, as it sets policies in place that need to be tested against them regularly.</p><p>A securities registration basically requires an exchange to hold those assets and maintain comprehensive records verifying the customer as the real owner of those assets, as well as the exchange being subject to regulatory inspections.</p><p>Coinbases and Binances recent legal troubles with the United States Securities and Exchange Commission stem from allegations of operating as unlicensed securities exchanges, meaning both werent held to the recordkeeping and safeguard requirements that a license would mandate.</p><h2 id=\"h-what-happens-after-i-deposit-funds-into-a-crypto-exchange\"><strong>What happens after I deposit funds into a crypto exchange?</strong></h2><p>So, what actually happens when you deposit $50 or $50,000 <a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\" target=\"_blank\" rel=\"nofollow\" >into an exchange and buy some crypto</a>?</p><p>In the exchange model, where users trade directly with one another, its like a one-on-one deal. When your digital asset order is executed, your money goes straight to the person youre buying from. The assets stay within the exchange throughout the whole transaction.</p><p>When it comes to a brokerage-type model, youre buying the asset from the broker directly.</p><p>So, the money goes into the brokers trust account first. Then, the broker takes that money and uses it to acquire the assets you want. Essentially, theyre playing matchmaker between your money and assets. The asset is then generally held on another exchange.</p><section class=\"adv-banner adbutler-ad adbutler-ad__desktop\"><div class=\"container\"><!-- 1456x180 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><section class=\"adv-banner adbutler-ad adbutler-ad__mobile\"><div class=\"container\"><!-- 600x500 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><p>Regardless of whether your assets are hanging out on the exchange where you bought them, or with a counterparty linked to the broker you used, they will call home either a hot wallet or a cold wallet.</p><p>Hugh Brooks, director of security operations at crypto audit firm CertiK, explains to Magazine that most major exchanges store customer assets in a combination of hot and cold wallets.</p><p><br>A hot wallet is a cryptocurrency wallet that is connected to the internet and allows for quick transactions. On the other hand, a cold wallet is stored offline, is secure and keeps your crypto safe from hackers.</p><figure class=\"wp-block-image aligncenter size-large is-resized\"><img decoding=\"async\" src=\"https://s3.cointelegraph.com/uploads/2023-05/cee39971-c6f7-4328-b4aa-8a1a7bb477e9.png\" alt=\"\" width=\"847\" height=\"657\" /></figure><p>While having 100% of customer assets in a cold wallet would be ideal for safety reasons, it is not feasible for liquidity reasons. Brooks says: </p><blockquote class=\"wp-block-quote\"><p>While hot wallets provide convenience in terms of easy and fast transactions, they are also more susceptible to potential security threats, such as hacking due to their internet connection. Hence, exchanges usually keep only a fraction of their total assets in hot wallets to facilitate daily trading volume.</p></blockquote><p>Przelozny says that, in the case of Independent Reserve, 98% is held offline in a cold storage vault managed by the exchange, and the rest is in a hot wallet in the exchange.</p><p>James Elia, general manager of exchange CoinJar, tells Magazine that his exchange similarly keeps the vast majority of assets in cold storage or private multisig wallets and maintains full currency reserves at all times.</p><p>He says that CoinJar uses a mix of multisig cold and hot wallets through BitGo and Fireblocks to store customer funds.</p><p>Crypto.com is unusual in that it offers customers both a custodial and noncustodial option.</p><p>The Crypto.com DeFi Wallet is a noncustodial option, a spokesman says in comments to Magazine. This means its customers have full control of their private keys. Meanwhile, the Crypto.com App is a digital currency brokerage that acts as a custodian and stores cryptocurrencies for customers. The spokesperson says that its crypto assets are safely held in institutional grade reserve accounts and are fully backed 1:1.</p><h2 id=\"h-further-solutions\"><strong>Further solutions</strong></h2><p>However, relying solely on accounts that claim to be secure is no longer sufficient in the unpredictable world of crypto.</p><p>In line with many other major crypto exchanges, such as Binance, Gemini, Coinbase, Bittrex, Independent Reserve, CoinJar and Kraken, Crypto.com has also adopted a self-custody infrastructure platform called Fireblocks.</p><p>Fireblocks focuses on ensuring the exchange securely stores and manages customers digital assets in an advanced and secure way. The firm <a href=\"https://cointelegraph.com/news/metamask-institutional-to-integrate-with-fireblocks-mpc-platform\" target=\"_blank\" rel=\"nofollow\" >utilizes multi-party technology computation (MPC technology)</a>, which is similar to a multisig wallet and is never held or created in a single place. </p><p>While the infrastructure custody platform doesnt hold any assets itself, which remain on the exchange, it can incorporate features such as multisignature authentication and encryption into the exchange. This is done to minimize the risk of fraud, misuse of funds and malicious attacks.</p><p>It also makes it a lot harder for a sneaky employee to authorize a dodgy transaction or, even worse, drain customer assets out of the exchange. </p><p>Shane Verner, director of sales for Australia and New Zealand for Fireblocks, tells Magazine that initially, Fireblocks will shard the exchanges crypto wallet private keys into three parts.</p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/unique-amazing-south-koreas-cryptoverse/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>South Koreas unique and amazing crypto universe</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/what-the-hell-is-web3-anyway/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>What the hell is Web3 anyway?</p>                        </a>                    </div></div></div><p>A wallets private key is similar to a password or a PIN and is a combination of letters and numbers serving as the sole requirement to sign transactions and manage digital assets.</p><p>On the other hand, a wallets public key is the address you give for people to send you crypto, like a bank BSB and account number.</p><p>One shard of the private key is given to the exchange, while Fireblocks safeguards the other two shards in encrypted hardware in geographically discrete data centers. Essentially, it involves splitting the secret code into three pieces and hiding each piece in a different spot.</p><p>Every large transaction on a crypto exchange integrated then requires the three shards to come together to approve the transaction.</p><p>The three shards only unite when the exchange fulfills the obligations set out by Fireblocks for the transaction approval process. Verner says this is the most critical part of the integration.</p><p>Dixon says this manages risk in a much better way, as Fireblocks allows exchanges to write rules into transactions.</p><p>An example of these rules is the exchange setting a required number of employees to sign off on transactions. This can be modified as the customer list grows.</p><p>For example, lets say the exchange used to allow three employees to sign off on transactions of $10,000 and above but then decide that isnt enough, and they increase the requirement to five employees. The number of employees required to approve a particular transaction depends on the size of the transaction.</p><p>Within exchanges, there are then employees assigned with the task of manually approving large transactions. Verner explains that the number of employees in the various quorums increases in proportion to the size of the transaction.</p><p>They all register their face ID on their mobile phone. They all put in their authorization code as well. So, its two-factor, and everything gets approved, Verner says.</p><p>Then that goes into the Fireblocks infrastructure, where our two shards have been told that they can come together and authorize the transaction, he further explains.</p><p>While pointing out that every exchange is different, he says that small transactions up to a certain amount of money can automatically go through and do not require human approval.</p><p>Its entirely at the discretion of the exchange in question, but its critical, says Verner, adding, They might say every transaction between $100 and $1,000 is automatic.</p><p>The limits imposed by exchanges vary depending on their specific demographic. Exchanges catered to retail investors are going to have lower limits because<a href=\"https://cointelegraph.com/magazine/cryptocurrency-trading-addiction-what-to-look-out-for-and-how-it-is-treated/\" target=\"_blank\" rel=\"nofollow\" > it wouldnt expect</a> to see many $10,000+ transfers.</p><p>However, if you start sending large amounts, you may find yourself attracting more attention than you anticipated.</p><p>The larger the amount, the greater the number of approvals required. For example, for $1 million <a href=\"https://cointelegraph.com/magazine/layah-heilpern-bitcoin-honesty-bullshit-chinese-state-media-journalist/\" target=\"_blank\" rel=\"nofollow\" >worth of Bitcoin</a>, you may need a quorum of eight to 10 authorized approvers within the business to enable that transaction.</p><p>If one says no, they all say no, Verner says.</p><blockquote class=\"wp-block-quote\"><p>Effectively, really big amounts are always going to require human intervention because you dont want somebody taking $1 million off their exchange without a bunch of approvers within your organization approving.</p></blockquote><h2 id=\"h-fox-in-the-henhouse\"><strong>Fox in the henhouse</strong></h2><p>Verner warns that none of the above security matters mean anything if a crook runs the exchange.</p><p>If the head of an exchange is prepared to corrupt the governance layer, then all the security measures put in place become essentially useless.</p><p>He runs through a simple example of a dubious CEO controlling all the authorizers in the quorum, and then doing as they please. In such a scenario, the CEO can act freely to his own desires.</p><p> <br>In the case of FTX, Bankman-Fried allegedly demanded that his co-founder Gary Wang create a hidden way for his trading firm Alameda to borrow $65 billion of client funds from the exchange without anyone knowing. </p><figure class=\"wp-block-image aligncenter size-large is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Sam-Bankman-Fried-at-the-Congressional-hearing-e1639499848545-1024x577.webp\" alt=\"\" class=\"wp-image-22540\" width=\"710\" height=\"400\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Sam-Bankman-Fried-at-the-Congressional-hearing-e1639499848545-1024x577.webp 1024w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Sam-Bankman-Fried-at-the-Congressional-hearing-e1639499848545-300x169.webp 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Sam-Bankman-Fried-at-the-Congressional-hearing-e1639499848545-770x434.webp 770w, https://cointelegraph.com/magazine/wp-content/uploads/2023/08/Sam-Bankman-Fried-at-the-Congressional-hearing-e1639499848545.webp 1200w\" sizes=\"(max-width: 710px) 100vw, 710px\" /><figcaption class=\"wp-element-caption\"><em>In November last year, Bankman-Fried was called before Congress to testify about the exchange’s collapse.</em> (C-SPAN)<br></figcaption></figure><p>Wang allegedly sneaked in a single number into millions of lines of code for the exchange. This sly move created a line of credit from FTX to Alameda without customers ever giving their consent to such an arrangement.</p><p>To avoid foul play from someone on the inside, many exchanges are putting more security measures in place as the industry matures.</p><p>Elia says that all CoinJar employees must pass a criminal background check before joining the company and are required to take part in ongoing security and Anti-Money Laundering training.</p><p>He says that multilevel data encryption, ongoing security audits and institutional-grade organization security to protect customer accounts are also employed. CoinJar also uses advanced machine learning to recognize suspicious logins, account takeovers and financial fraud.</p><h2 id=\"h-how-do-you-conduct-due-diligence-on-an-exchange\"><strong>How do you conduct due diligence on an exchange?</strong></h2><p>The phrase do your own research has become somewhat of a rallying cry in the crypto space when it comes to investment, and many believe the same should apply for choosing your exchange. </p><p>Przelozny emphasizes that consumers should always research any exchange before depositing funds and not expect others to do due diligence for them. </p><p>The United States Commodity Futures Trading Commission <a href=\"https://www.cftc.gov/sites/default/files/2023-04/SpotFraudSites.pdf\" target=\"_blank\" rel=\"nofollow\" >advises</a> on its website that you should look to see if the crypto exchange actually has a physical address. </p><p>Most countries now require cryptocurrency exchanges to obtain licenses, with regulators providing public info on digital currency exchange license requirements and providing databases of registered entities. </p><p>Users can also check social media and independent review websites (not the exchange itself) to see what customers are saying.<br><br>Przelozny says that customers should scrutinize the terms and conditions of the exchange meticulously, paying close attention to anything that suggests the exchange will earn a yield on clients assets, as that means the exchange has every right to do that.</p><p><br>He adds that investors should not flock to an exchange just because their favorite athlete is promoting it. The $1-billion lawsuit taken against influencers who promoted FTX and <a href=\"https://cointelegraph.com/news/ftx-influencers-face-1-billion-class-action-lawsuit-over-alleged-crypto-fraud-promotion\" target=\"_blank\" rel=\"nofollow\" >failed to disclose compensation</a> should serve as a cautionary tale.</p><figure class=\"wp-block-image alignright size-large is-resized\"><img decoding=\"async\" src=\"https://i0.wp.com/www.goingconcern.com/wp-content/uploads/2022/10/Kim-Kardashian-crypto-promotion.webp?w=750&ssl=1\" alt=\"\" width=\"347\" height=\"617\" /><figcaption class=\"wp-element-caption\"><em>Kim Kardashian settled a lawsuit for $1.26 million for promoting an unregistered security on Instagram.</em> <em>(Going Concern)</em></figcaption></figure><p>Dixon similarly advises investors not to get sucked in by the advertising or marketing schemes and instead focus on the fundamentals.</p><p>I think affiliate marketing and financial products should never be combined, Dixon says, noting he does not sign up influencers or celebrities to promote BnkToTheFuture or online shills. We wont actively incentivize people to talk about our business because theyll get it wrong, and theyll get us in trouble.</p><p>That said, Dixon finds that authentic word of mouth between friends and family remains an incredibly powerful means of establishing trust in exchanges. </p><p>Dixon explains that while there may be uncertainty about how exchanges handle consumer funds, the situation is not fundamentally different from traditional banks: I think if the banks were doing their jobs, when you deposit the money with the bank, [it would be disclosed that] youre not the legal owner of the money.</p><p>The banks can leverage it up and put it at risk, Dixon emphasizes and warns that there is little disclosure from the banks saying they may need to go to the FDIC to get a bailout if the loans go bad.</p><blockquote class=\"wp-block-quote\"><p>I think those are probably buried in the terms and conditions, but I dont think theyve given a good user experience to let consumers know that, actually, theres quite a lot of risk in your bank account.</p></blockquote><div class=\"subscribe subscribe--inner\"><div class=\"container\"><div class=\"subscribe__inner\"><div class=\"subscribe__content\">    <div class=\"subscribe__title display2\">Subscribe</div>    <div class=\"subscribe__desc text-l\">The most engaging reads in blockchain. Delivered once a        week.</div>        <div class=\"wpcf7 no-js\" id=\"wpcf7-f13672-o1\" lang=\"en-US\" dir=\"ltr\"><div class=\"screen-reader-response\"><p role=\"status\" aria-live=\"polite\" aria-atomic=\"true\"></p> <ul></ul></div><form action=\"/magazine/wp-json/wp/v2/posts?_embed&per_page=100#wpcf7-f13672-o1\" method=\"post\" class=\"wpcf7-form init subscribe__form demo\" aria-label=\"Contact form\" novalidate=\"novalidate\" data-status=\"init\"><div style=\"display: none;\"><input type=\"hidden\" name=\"_wpcf7\" value=\"13672\" /><input type=\"hidden\" name=\"_wpcf7_version\" value=\"5.7.4\" /><input type=\"hidden\" name=\"_wpcf7_locale\" value=\"en_US\" /><input type=\"hidden\" name=\"_wpcf7_unit_tag\" value=\"wpcf7-f13672-o1\" /><input type=\"hidden\" name=\"_wpcf7_container_post\" value=\"0\" /><input type=\"hidden\" name=\"_wpcf7_posted_data_hash\" value=\"\" /></div><fieldset class=\"form-group\"><p><input size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-email wpcf7-validates-as-required wpcf7-validates-as-email\" id=\"footer-subscribe\" aria-required=\"true\" aria-invalid=\"false\" value=\"\" type=\"email\" name=\"your-email\" /><label for=\"footer-subscribe\">Email address</label></p></fieldset><p><button class=\"subscribe__btn btn btn-white\">SUBSCRIBE</button></p><div class=\"wpcf7-response-output\" aria-hidden=\"true\"></div></form></div></div><div class=\"subscribe__img\">    <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2022/10/reading-copy.png\" alt=\"Subscribe to Magazine by Cointelegraph Newsletter.\" /></div></div></div></div></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T13:21:11.000Z",
    "title": "Worldcoin to allow government and businesses to use ID system: Report ",
    "url": "https://cointelegraph.com/news/worldcoin-to-allow-government-and-businesses-to-use-id-system",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/46bcd53a-f6e4-4a3c-8192-b4396a7321bc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>New reports reveal that Worldcoin plans to expand its operations to sign up more users by allowing organizations and governments to access its technology.</p>\n                    <p><p><a href=\"https://cointelegraph.com/explained/what-is-worldcoin-and-how-does-it-help-preserve-world-id\">Worldcoin</a> plans to expand its operations to allow governments and businesses to utilize its iris-scanning and identity-verifying technology in an effort to sign up more users, according to a Reuters <a href=\"https://www.reuters.com/technology/worldcoin-says-will-allow-companies-governments-use-its-id-system-2023-08-02/\" target=\"_blank\" rel=\"noopener nofollow\">report</a>.</p><p>According to the report, Ricardo Macieira, the general manager for Europe at Tools For Humanity, which is behind the Worldcoin project, said that the company is on a mission of “building the biggest financial and identity community” possible. </p><blockquote>\"The idea is that as we build this infrastructure and that we allow other third parties to use the technology.\"</blockquote><p>Macieria added that it plans to open source the technology that powers the iris-scanning orbs to allow for wider use of the product. Recently, other reports have circulated of <a href=\"https://cointelegraph.com/news/crypto-worldcoin-struggles-scan-iris\">Worldcoin struggling to sign up</a> users post-launch. </p><p>Though the project’s co-founder, Sam Altman, has opposed those claims with posts on X showing a <a href=\"https://twitter.com/sama/status/1684297687708098565\" target=\"_blank\" rel=\"noopener nofollow\">video</a> of people queuing for iris scans. Macieira says in the future orbs will be even more community-centric. </p><blockquote>\"The idea is that anyone can in the future build their own orb and use it to benefit the community that it's aiming for.”</blockquote><p>He continued to say that he doesn’t believe Worldcoin will be the generator of universal basic income, though they would be “very happy” to be the ones providing the infrastructure for governments and other entities to do so. </p><p>Additionally, the Reuters report reads that Macieira explained how Worldcoin intends for companies to pay to use its digital identity system if they wanted to implement some sort of localized system without the need to gather personal data. </p><p>Cointelegraph reached out to Worldcoin for further comment on the developments reported by Reuters and has yet to receive an answer. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/worldcoin-releases-audit-reports-showing-resolved-security-issues\"><strong><em>Worldcoin releases audit reports showing resolved security issues</em></strong></a></p><p>However, Worldcoin’s data collection methods have already been under scrutiny from regulators around the world. </p><p><a href=\"https://cointelegraph.com/news/french-privacy-watchdog-questions-worldcoin-s-data-collection-method-report\">France’s privacy watchdog</a> has already stated it finds them “questionable,” while German regulators<a href=\"https://cointelegraph.com/news/german-government-watchdog-launched-worldcoin-probe\"> launched a probe into Worldcoin’s operations</a> back in 2022. Regulators in the United Kingdom are also <a href=\"https://cointelegraph.com/news/worldcoin-may-face-uk-data-regulators-enquiry-days-after-launch-report\">considering opening an inquiry</a> into the company. </p><p>Though, Worldcoin's website claims it is \"completely private\" and that users can choose to have their biometric data stored in encrypted form, or else be deleted.</p><p>Most recently, on Aug. 2 Kenya’s minister of internal security announced that <a href=\"https://cointelegraph.com/news/worldcoin-kenya-suspends-local-activities-of-worldcoin\">Worldcoin is banned</a> from operating in the country. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-human-digital-souls-agi-alignment-problem-replika/\"><strong><em>Experts want to give AI human ‘souls’ so they don’t kill us all</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T13:11:24.000Z",
    "title": "ETF analyst raises spot Bitcoin ETF approval chances in the US to 65% ",
    "url": "https://cointelegraph.com/news/spot-bitcoin-etf-approval-chances-65",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/3fa9e4f7-bf1b-4217-be46-561440409cd6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The ETF analyst predicted that recent developments in the Ripple vs SEC case and the upcoming Grayscale lawsuit would be crucial to first spot Bitcoin ETF approval. </p>\n                    <p><p>The chances of approval of a spot Bitcoin exchange-traded fund (ETF) in the United States have now increased to 65% from a mere 1% just a couple of months ago.</p><p>Bloomberg ETF analysts Eric Balchunas and James Seyffart said in a recent statement that the chances of approval for a Bitcoin ETF have increased significantly over the past month owing to various new developments around the crypto market and the refiling of ETF applications by the likes of Blackrock.</p><p>Seyffart noted that a lot will depend on the timing of the Grayscale case dates and their recent boost in approval will depend on Grayscale's victory over the SEC in Federal court. He added that Grayscale’s win against SEC could set trigger a series of simultaneous approval for all spit Bitcoin ETF filings by the end of the fourth quarter later this year.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The lynchpin for this current thesis is a Grayscale victory over the SEC in Federal court. Which COULD set things up for a wave of SEC approvals sometime in the 4th quarter? All depends on how much Gensler wants to fight here.</p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1686710022468706304?ref_src=twsrc%5Etfw\">August 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Seyffart believes that the BlackRock and the Coinbase surveillance sharing agreement (SSA) drastically changed the spot Bitcoin ETF analysis. Not to mention the ripple case which is less important but still relevant. We update our views and opinions as new information comes to light. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/asset-managers-file-ethereum-futures-etf-applications\"><strong><em>Ether ETFs pending — Grayscale, VanEck and others file SEC applications</em></strong></a></p><p>The spot Bitcoin ETF filing spree began with <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">BlackRock’s filing with the SEC</a> on June 16. <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-new-sec-filings-wisdomtree-invesco\">WisdomTree, Invesco</a> and <a href=\"https://cointelegraph.com/news/valkyrie-submits-btc-spot-etf-application-to-go-with-its-futures-miners-etfs\">Valkyrie</a> along with several other institutional giants followed suit. The recent slew of filings in the second quarter of 2023 comes despite the Securities and Exchange Commission rejecting all spot ETF filings earlier. Many market analysts believe 2023 could prove crucial for the spot Bitcoin ETF.</p><p>The spot Bitcoin ETF race has garnered attention from some of the biggest traditional financial institutions and analysts such as <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-could-unlock-30-trillion-worth-of-wealth-bloomberg-analyst-says\">Balchunas believe that the interest of institutional giants like Blackrock</a> could be the best possible chance for approval of a spot Bitcoin ETF.</p><p><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/national-defense-bill-problem-for-usdc-stablecoins-berenberg&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a> to preserve this moment in history and show your support for independent journalism in the crypto space.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/elegant-and-ass-backward-jameson-lopps-first-impression-of-bitcoin/\"><strong><em>‘Elegant and ass-backward’: Jameson Lopp’s first impression of Bitcoin</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-08-02T13:30:00.000Z",
    "title": "Deposit risk: What do crypto exchanges really do with your money?",
    "url": "https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/08/magazine-Is-decentralized-blockchain-gaming-even-possible-scaled.jpg\"></p><p>While depositing may be easy, what some crypto exchanges do with your money behind the scenes can range from concerning to criminal.</p>\n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T13:27:10.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T13:22:33.000Z",
    "title": "RoboMapper Revolutionizes Perovskite Solar Cell Development with Efficiency Surpassing 30%",
    "url": "https://www.cryptopolitan.com/robomapper-perovskite-solar-cell/",
    "description": "Solar cells have seen remarkable progress in integrating perovskite crystals, enabling them to break efficiency records in converting sunlight to electricity. North Carolina State University&#8217;s groundbreaking invention, the RoboMapper, is set to accelerate this progress further. The RoboMapper is an automated system that can analyze perovskite performance in solar cells with unparalleled speed, cost-effectiveness, and ... <a title=\"RoboMapper Revolutionizes Perovskite Solar Cell Development with Efficiency Surpassing 30%\" class=\"read-more\" href=\"https://www.cryptopolitan.com/robomapper-perovskite-solar-cell/\" aria-label=\"More on RoboMapper Revolutionizes Perovskite Solar Cell Development with Efficiency Surpassing 30%\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T13:18:07.000Z",
    "title": "Ripple CEO criticizes SEC’s use of XRP markets report as evidence in the ongoing case",
    "url": "https://www.cryptopolitan.com/ripple-ceo-criticizes-secs-use-of-xrp-markets-report-as-evidence-in-the-ongoing-case/",
    "description": "Ripple has recently released its XRP Markets Report for Q2, 2023, aiming to enhance industry transparency by disclosing its XRP reserves and on-ledger escrow activity. The report revealed that Ripple&#8217;s total XRP holdings as of the end of the third quarter were 5,551,119,094, showing an increase of approximately 45 million from the previous quarter. However, ... <a title=\"Ripple CEO criticizes SEC&#8217;s use of XRP markets report as evidence in the ongoing case\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-ceo-criticizes-secs-use-of-xrp-markets-report-as-evidence-in-the-ongoing-case/\" aria-label=\"More on Ripple CEO criticizes SEC&#8217;s use of XRP markets report as evidence in the ongoing case\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-02T13:13:50.000Z",
    "title": "Ethereum Layer-2 Revival, Optimism Pumps 10%, InQubeta’s QUBE Set For Spike",
    "url": "https://www.crypto-news-flash.com/ethereum-layer-2-revival-optimism-pumps-10-inqubetas-qube-set-for-spike/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-layer-2-revival-optimism-pumps-10-inqubetas-qube-set-for-spike",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T112244.691.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T112244.691.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T112244.691-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T112244.691-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T112244.691-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T112244.691-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ethereum Layer-2 technology has been witnessing a remarkable revival, with Optimism&#8217;s recent surge by 10% showcasing its potential for scalability and efficiency. Amidst this exciting development, InQubeta&#8217;s native token, $QUBE, is primed for a significant spike as it continues to empower the world&#8217;s first crypto crowdfunding platform for AI startups. Ethereum Layer-2 Revival: Scaling Solutions [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-02T13:35:20.000Z",
    "title": "Curve DAO Token Price Prediction 2023-2030: Will CRV Price Hit $1 Soon?",
    "url": "https://coinedition.com/curve-dao-token-crv-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/Curve-DAO-Token-CRV-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Curve-DAO-Token-CRV-Price-Prediction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/Curve-DAO-Token-CRV-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/Curve-DAO-Token-CRV-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/Curve-DAO-Token-CRV-Price-Prediction-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/Curve-DAO-Token-CRV-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/Curve-DAO-Token-CRV-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/Curve-DAO-Token-CRV-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bullish Curve DAO Token (CRV) price prediction ranges from $0.799 to $0.8334. Analysis suggests CRV price might also reach $1 this 2023. CRV’s bearish market price prediction for 2023 is $0.509. Curve (CRV) is an Ethereum token used to power Curve.fi, a decentralized exchange, and automated market maker protocol. The protocol is intended to make it [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/curve-dao-token-crv-price-prediction/\">Curve DAO Token Price Prediction 2023-2030: Will CRV Price Hit $1 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-02T13:23:00.000Z",
    "title": "AI Has “Huge Trust Problem,” Crypto to Save — CoinFund CEO",
    "url": "https://coinedition.com/ai-has-huge-trust-problem-crypto-to-save-coinfund-ceo/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Crypto-to-Save-CoinFund-CEO.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Crypto to Save CoinFund CEO\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Crypto-to-Save-CoinFund-CEO.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-to-Save-CoinFund-CEO-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-to-Save-CoinFund-CEO-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-to-Save-CoinFund-CEO-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-to-Save-CoinFund-CEO-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-to-Save-CoinFund-CEO-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-to-Save-CoinFund-CEO-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-to-Save-CoinFund-CEO-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-to-Save-CoinFund-CEO-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-to-Save-CoinFund-CEO-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-to-Save-CoinFund-CEO-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-to-Save-CoinFund-CEO-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-to-Save-CoinFund-CEO-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-to-Save-CoinFund-CEO-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-to-Save-CoinFund-CEO-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Crypto-to-Save-CoinFund-CEO-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In contrast to popular belief, Jake Brukhman, CEO of CoinFund, believed that blockchain and cryptocurrency could benefit artificial intelligence (AI) and not the other way around.  Laura Shin, in her latest podcast episode, Unchained, discussed AI and blockchain intersections with Brukhman and CoinFund President Chris Perkins. The asset management company CoinFund specializes in decentralization technologies. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ai-has-huge-trust-problem-crypto-to-save-coinfund-ceo/\">AI Has “Huge Trust Problem,” Crypto to Save — CoinFund CEO</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]