[
  {
    "source": "Cryptopolitan",
    "date": "2024-03-02T07:37:29.000Z",
    "title": "Which crypto exchange made it to Hong Kong’s license application deadline?",
    "url": "https://www.cryptopolitan.com/crypto-exchange-that-made-hong-kong-licenses/",
    "description": "Hong Kong has recently emerged as a significant hub for the crypto industry, evidenced by the substantial interest from companies seeking to operate digital asset exchanges within its jurisdiction. Despite fierce competition from other global financial centers, Hong Kong has attracted 24 applicants for crypto exchange permits.&#160; Major crypto exchanges, including Binance, have chosen to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-02T07:31:55.000Z",
    "title": "Binance recovers $4.4 Billion amid deposit woes",
    "url": "https://www.cryptopolitan.com/binance-recovers-4-4-billion-deposit/",
    "description": "Binance, the world&#8217;s leading crypto exchange, has successfully reclaimed $4.4 billion worth of digital assets for its users amidst deposit errors. This significant recovery addresses major challenges faced by users in the cryptocurrency space.&#160; The recovered assets, totaling $4.4 billion, were distributed among 381,616 users who were affected by mishandled deposits over the past two [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-02T07:26:01.000Z",
    "title": "Nigeria asks Binance for $10 billion",
    "url": "https://www.cryptopolitan.com/nigeria-asks-binance-for-10-billion/",
    "description": "Nigeria&#8217;s government is demanding a jaw-dropping $10 billion in penalties from Binance, the world&#8217;s leading cryptocurrency exchange, due to allegations of them causing significant financial losses in the country by manipulating exchange rates. This claim centers around accusations that Binance&#8217;s activities have led to a drastic depreciation of the Naira, Nigeria&#8217;s currency, by nearly 70% [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-02T07:13:08.000Z",
    "title": "Are Elon Musk’s Motives in the Lawsuit Linked to Regret Over Leaving OpenAI?",
    "url": "https://www.cryptopolitan.com/elon-musks-lawsuit-regret-leaving-openai/",
    "description": "In a recent development in the AI sector, top executives at OpenAI have responded to a lawsuit filed by Elon Musk, the billionaire entrepreneur. The lawsuit, which alleges deviation from OpenAI&#8217;s founding mission, prompted a strong rebuttal from the company&#8217;s leadership. Central to their response is the assertion that Musk&#8217;s actions may be fueled by [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-02T07:12:32.000Z",
    "title": "AI Surpasses Humans in Creative Thinking Tasks, Study Finds",
    "url": "https://www.cryptopolitan.com/ai-surpasses-humans-in-creative-thinking/",
    "description": "Artificial intelligence continues to make strides in various domains, and the latest triumph comes in creativity. In a recent study published in Scientific Reports, researchers from the University of A demonstrated that the AI model, ChatGPT-4, outperformed human participants in tests designed to measure divergent thinking, a key aspect of creative thought. The study, led [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-02T07:12:21.000Z",
    "title": "Crypto chaos ahead: Galaxy Digital CEO forecasts Bitcoin correction",
    "url": "https://www.cryptopolitan.com/galaxy-digital-ceo-sees-bitcoin-correction/",
    "description": "Galaxy Digital CEO Mike Novogratz has offered insights into the trajectory of Bitcoin, suggesting a forthcoming correction before a potential resumption of its upward trend. This prediction aligns with the current market sentiment, which anticipates adjustments in Bitcoin&#8217;s value amidst its overall positive trajectory.&#160; Novogratz&#8217;s analysis sheds light on the cyclical nature of Bitcoin&#8217;s price [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-02T07:11:23.000Z",
    "title": "Bill Gates Discusses AI Advancements and Potential Impact on Work Week",
    "url": "https://www.cryptopolitan.com/bill-gates-discusses-ai-advancements/",
    "description": "In a recent interview with the Times of India, Microsoft founder Bill Gates discussed the rapid advancements in artificial intelligence (AI) and its potential to revolutionize various sectors, including healthcare and education. Gates, who is currently in India to attend the wedding of Mukesh Ambani&#8217;s son, Anant Ambani, emphasized the significant role AI could play [&#8230;]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-02T07:29:00.000Z",
    "title": "State Attorneys General Question the SEC’s ‘Regulatory Power Grab’",
    "url": "https://coinedition.com/state-attorneys-general-question-the-secs-regulatory-power-grab/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Ripple-CLO-to-SEC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"State Attorneys General Question the SEC’s ‘Regulatory Power Grab’\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Ripple-CLO-to-SEC.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Ripple-CLO-to-SEC-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Ripple-CLO-to-SEC-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Ripple-CLO-to-SEC-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Ripple-CLO-to-SEC-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Ripple-CLO-to-SEC-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Eight state attorneys general in the United States filed an amicus brief, questioning the SEC’s “regulatory power grab.” The lawyers warn that the SEC’s undelegated authority puts consumers at risk. Kraken’s Chief Legal Officer Marco Santori points out the inconsistency in the SEC’s definition of investment contracts. In a novel turn in the Kraken-SEC legal [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/state-attorneys-general-question-the-secs-regulatory-power-grab/\">State Attorneys General Question the SEC’s ‘Regulatory Power Grab’</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]