[
  {
    "source": "CoinDesk",
    "date": "2023-07-26T14:58:32.000Z",
    "title": "Canada Unveils New Bank Capital Rules for Crypto Holdings",
    "url": "https://www.coindesk.com/policy/2023/07/26/canada-unveils-new-bank-capital-rules-for-crypto-holdings/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "New rules for banks and insurers are based on international norms, regulators said"
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-26T14:45:20.000Z",
    "title": "Bitcoin Miners Buy up Rigs as Prices Near All-Time Lows ",
    "url": "https://www.coindesk.com/consensus-magazine/2023/07/26/bitcoin-miners-buy-up-rigs-as-prices-near-all-time-lows/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Despite mining’s doldrums, miners are prioritizing the inclusion of next-generation mining rigs in their operations to prepare for the next Bitcoin halving."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T14:40:59.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-26T15:00:54.000Z",
    "title": "Bitcoin Exchange Supply Only Slips Further Despite Price Decline",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-exchange-supply-only-slips-further-despite-price-decline/",
    "description": "On-chain data shows that the Bitcoin exchange supply has only continued to slip further recently despite the price drop to the $29,200 that BTC has observed. Bitcoin Exchange Supply Has Declined To Just 1.17 Million BTC Now According to data from the on-chain analytics firm Santiment, the latest decline in the price doesn&#8217;t look to have triggered a severe reaction from the market yet. The relevant indicator here is the &#8220;supply on exchanges,&#8221; which measures the total amount of Bitcoin supply that&#8217;s currently being stored in the wallets of all centralized exchanges. When the value of this metric goes up, it means that the investors are making a net amount of deposits to these platforms right now. As one of the main reasons why the holders would transfer their coins to exchanges is for selling-related purposes, this kind of trend can have bearish consequences for the price. On the other hand, the indicator&#8217;s value decreasing suggests the investors are taking coins off to self-custodial wallets, potentially to hold onto them for extended periods. Naturally, such accumulation can have a bullish effect on the asset in the long term. Now, here is a chart that shows the trend in the Bitcoin supply on exchanges over the past few months: The value of the metric seems to have been going down in recent weeks &#124; Source: Santiment on Twitter As displayed in the above graph, the Bitcoin supply on exchanges has observed a constant downtrend during the last few months or so. This means that the investors have been consistently taking their coins off these platforms during this period despite price declines. Related Reading: Bitcoin Coinbase Premium Turns Red, US Institutions Disinterested? Interestingly, this decline in the indicator continued even when the rally above $30,000 had occurred in the middle of June. Generally, during such sharp price surges, it&#8217;s not rare to see the metric rise, as some investors would be looking to harvest their profits. But not only had deposits not occurred in this rally, but the supply on exchanges had also instead plunged especially hard back then, suggesting that there may have been some heavy buying taking place in the market, which would have acted as fuel for the surge. In the past week, Bitcoin has registered a decline towards the low $29,000 level, but the indicator has still only continued to head down, implying that this price drop hasn&#8217;t been enough to trigger a mass panic-selling reaction from investors. The current trend in this metric is naturally a positive sign for the cryptocurrency&#8217;s value, as it means that at least another selloff may not be probable to take place in the immediate future. Related Reading: Will Bitcoin Rebound? This Metric May Be The One To Watch With the latest downward move in the supply on exchanges, only 1.17 million BTC is left in the wallets of these platforms now. This value is around 12% lower than back during the beginning of May, which is a significant drop. BTC Price At the time of writing, Bitcoin is trading around $29,200, down 2% in the last week. BTC has plunged during the last few days &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-26T15:00:50.000Z",
    "title": "Anarchy (ANA) Presale is Making Waves in the Crypto Market, Even Dogecoin Investors Can’t Resist the Potentials",
    "url": "https://www.crypto-news-flash.com/anarchy-ana-presale-is-making-waves-in-the-crypto-market-even-dogecoin-investors-cant-resist-the-potentials/?utm_source=rss&utm_medium=rss&utm_campaign=anarchy-ana-presale-is-making-waves-in-the-crypto-market-even-dogecoin-investors-cant-resist-the-potentials",
    "description": "<img width=\"512\" height=\"286\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T161425.571.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T161425.571.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T161425.571-300x168.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Anarchy&#8217;s been the star of the summer so far, causing so much trouble for pioneer meme coins with its bold ambitions and even more spectacular presale. The figures are there for all to see, with the presale crossing the million-dollar milestone after only a few weeks of selling.  Anarchy&#8217;s massive success has been hard to [...]"
  }
]