[
  {
    "source": "Crypto Briefing",
    "date": "2023-11-14T18:49:59.000Z",
    "title": "OKX Unveils New Ethereum L2 Network Powered by Polygon",
    "url": "https://cryptobriefing.com/okx-unveils-ethereum-l2-network-powered-polygon/?utm_source=feed&utm_medium=rss",
    "description": "OKX partners with Polygon to launch X1, an Ethereum Layer 2 network, leveraging OKX's 50 million user base to fuel growth."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-14T18:50:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Binance coin and the entire crypto market have seen little gains in the past few days, as prices have been consolidating in tight regions. BNB prices have dropped by 14.11% since touching $248.9 in August 2023. What does the future hold for Binance Coin? How much is BNB worth? The ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-14T18:46:06.000Z",
    "title": "FDIC employees to testify before the Senate",
    "url": "https://www.cryptopolitan.com/fdic-employees-to-testify-before-the-senate/",
    "description": "A damning report revealing a pervasive culture of sexual harassment, misogyny, and inappropriate behavior at the Federal Deposit Insurance Corp. (FDIC) has raised concerns and sparked reactions within the crypto industry. Published by the Wall Street Journal, the report detailed instances of female FDIC employees facing propositions for sex, workplace harassment, pressure to engage in ... <a title=\"FDIC employees to testify before the Senate\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fdic-employees-to-testify-before-the-senate/\" aria-label=\"More on FDIC employees to testify before the Senate\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-14T18:47:45.000Z",
    "title": "Cathie Wood charts course for ARK’s crypto future",
    "url": "https://crypto.news/cathie-wood-charts-course-for-arks-crypto-future/",
    "description": "Sensing fair winds from the SEC, Ark CEO Cathie Wood is unleashing a fleet of crypto-focused funds."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-14T19:00:03.000Z",
    "title": "Cardano: Midnight Devnet Goes Live – Trigger For New ADA Rally?",
    "url": "https://www.newsbtc.com/news/cardano/cardano-midnight-devnet-live-trigger-ada-rally/",
    "description": "The Midnight team, a subsidiary of Input Output Global (IOG) &#8211; the brains behind the Cardano blockchain, made a major announcement yesterday on X (formerly known as Twitter. The statement read: “Here’s the news you’ve all been waiting for – the Midnight Network devnet is now LIVE. We can’t wait to hear your feedback and see what the community will build on. Let’s go!&#8221; This announcement heralds the beginning of a new era for the Cardano ecosystem, introducing the Midnight Network, a privacy-centric blockchain designed to address growing concerns over digital privacy. The devnet&#8217;s launch is a strategic move, emphasizing IOG&#8217;s commitment to enhancing data protection in blockchain technology. A key highlight of this initiative is the selection of 100 &#8216;Midnight Pioneers,&#8217; chosen to access the early alpha release of the blockchain. These pioneers are tasked with developing data protection applications on a private network, thereby playing a pivotal role in refining Midnight&#8217;s capabilities. Related Reading: Analyst Predicts 8800% Ascent to $35 Cardano (ADA), Here’s When In their announcement, the Midnight team also emphasized community engagement, promising future events like live webinars, Q&#38;A sessions, and additional opportunities for developers to access the devnet. They also highlighted future opportunities for a broader spectrum of developers to access the devnet, hinting at an expansion of the devnet once initial progress is made. Alongside the Midnight blockchain, a new token named DUST will be introduced. DUST is integral to the functioning of the Midnight network, and its role and utility are emerging as key topics of discussion in the cryptocurrency community. Several high-ranked Cardano community members recently teased the possibility of a DUST airdrop to ADA holders. Impact On Cardano (ADA) Price The crypto market often witnesses significant price movements in response to major developments such as new project launches or airdrops. For Cardano, the launch of the Midnight Network and the introduction of the DUST token could have a potential impact on ADA&#8217;s price. Historically, announcing airdrops has led to a substantial increase in demand for the original cryptocurrency. This is primarily because token holders receive new tokens for free, incentivizing investors to buy e.g., ADA, in hopes of qualifying for the airdrop. Additionally, such announcements generate substantial media buzz and attract new investors, temporarily boosting the cryptocurrency price. Related Reading: Cardano October Whale Frenzy – What Lies Ahead For November? This phenomenon was observed in several instances, for example, with the Flare Network&#8217;s airdrop to XRP holders, which led to a spike in XRP&#8217;s price as investors bought in to qualify for the free Spark tokens. Similarly, Uniswap&#8217;s UNI airdrop in September 2020 led to a significant surge in both the trading volume and price of UNI, as it garnered considerable attention and value in the market. In light of these precedents, the launch of the Midnight Network and the introduction of DUST could potentially trigger a similar effect on the Cardano price. While an official announcement on the airdrop and a snapshot date is still open, it could catalyze a new rally in Cardano’s price. At press time, ADA traded at $0.3665. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-14T19:08:57.000Z",
    "title": "What is the most trusted online casino in Canada?",
    "url": "https://www.crypto-news-flash.com/what-is-the-most-trusted-online-casino-in-canada/?utm_source=rss&utm_medium=rss&utm_campaign=what-is-the-most-trusted-online-casino-in-canada",
    "description": "<img width=\"999\" height=\"562\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/What-is-the-most-trusted-online-casino-in-Canada.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"What is the most trusted online casino in Canada?\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/What-is-the-most-trusted-online-casino-in-Canada.jpg 999w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/What-is-the-most-trusted-online-casino-in-Canada-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/What-is-the-most-trusted-online-casino-in-Canada-768x432.jpg 768w\" sizes=\"(max-width: 999px) 100vw, 999px\" />The most trusted online casinos in Canada are Bodog and Jokersino. These titans of the online gaming world have mastered the art of delivering exceptional gambling experiences, ensuring each moment spent on their platforms is filled with excitement and safety. With a laser focus on meeting the needs and expectations of Canadian players, Bodog and [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-14T19:05:10.000Z",
    "title": "Here’s the ‘Home Run’ Trade for Crypto’s Next Cycle That Could Print 5-10X Gains, According to Investor Arthur Cheong",
    "url": "https://dailyhodl.com/2023/11/14/heres-the-home-run-trade-for-cryptos-next-cycle-that-could-print-5-10x-gains-according-to-investor-arthur-cheong/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Top-Trader-Says-He.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Top-Trader-Says-He.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Top-Trader-Says-He.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Top-Trader-Says-He.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Top-Trader-Says-He.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Top-Trader-Says-He.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Top-Trader-Says-He.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Veteran crypto investor Arthur Cheong says he has his eye on one potential &#8220;home run&#8221; play for digital asset markets looking out over the next market cycle. In a new interview with crypto podcaster Taiki Maeda, Cheong says that he has his eye locked on the decentralized derivatives trading sector. Cheong, who heads DeFiance Capital, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/14/heres-the-home-run-trade-for-cryptos-next-cycle-that-could-print-5-10x-gains-according-to-investor-arthur-cheong/\">Here’s the ‘Home Run’ Trade for Crypto’s Next Cycle That Could Print 5-10X Gains, According to Investor Arthur Cheong</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]