[
  {
    "source": "Cointelegraph",
    "date": "2023-10-14T03:03:14.000Z",
    "title": "Secret Alameda recording reveals exact moment staff learned about FTX deposits",
    "url": "https://cointelegraph.com/news/secret-recording-caroline-ellison-alameda-sbf-trial",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/699ab751-856f-4a42-971c-2dd0038422db.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A 75-minute recording obtained by Cointelegraph shows the exact moment former Alameda Research CEO Caroline Ellison told employees about their use of FTX customer deposits.</p>\n                    <p><p>A 75-minute secretly recorded audio clip of Caroline Ellison has revealed the exact moment 15 former Alameda Research staff found out the trading firm was “borrowing” user funds from FTX. </p><p>The full-length recording obtained by Cointelegraph provides fresh insights into the palpable tension Ellison and Alameda staff felt <a href=\"https://cointelegraph.com/news/ftx-collapse-the-crypto-industry-s-lehman-brothers-moment#:~:text=Eric%20Chen%2C%20CEO%20and%20co,liabilities%20far%20exceeded%20their%20assets.\">in the lead-up to FTX’s collapse</a>. </p><p>“Alameda was kind of borrowing a bunch of money via open-term loans and using that to make various illiquid investments. So like a bunch of FTX and FTX US equity [...] Most of Alameda’s loans got called in in order to meet those recalls,” Ellison explained during an all-hands meeting in Hong Kong on Nov. 9, 2022. </p><blockquote>“We ended up borrowing a bunch of funds from FTX, which led to FTX having a shortfall in user funds.”</blockquote><p>“[FTX] basically always allowed Alameda to borrow users’ funds,” she added, speaking to the 15 or so staff in the meeting. </p><p>Select segments of the audio recording of the meeting were also played before the court on the eighth day of Sam Bankman-Fried’s criminal trial on Oct. 12, which was part of witness testimony from Christian Drappi, a former software engineer at Alameda. </p><p>Drappi’s appearance on the witness stand came immediately <a href=\"https://cointelegraph.com/news/caroline-ellison-alternative-balance-sheets-alameda-exposure-ftx\">following nearly three days of Ellison’s testimony</a>. It is understood that before the meeting, Drappi and many other Alameda employees had no idea that the hedge fund had allegedly been using FTX customer deposits to prop up its trading activity. </p><p>In the recording, Drappi is also overheard asking Ellison when she became aware that Alameda was misusing FTX user deposits and who else at the company had known about it. </p><p>Initially, Ellison shied away from answering, but Drappi pressed again: </p><blockquote>“I’m sure this wasn’t, like, a YOLO thing, right?”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/changpeng-zhao-tweet-ftx-collapse-caroline-ellison\"><strong><em>Changpeng Zhao’s tweet ‘contributed’ to collapse of FTX, claims Caroline Ellison</em></strong></a></p><p>According to court reporting from the trial, the playback of this audio led to one of the more humorous moments in court, where Drappi had to explain the term “YOLO” to everyone in attendance, saying that he wanted Ellison to confirm that the use of FTX deposits hadn’t just been a “spontaneous” decision. </p><p>In his testimony, Drappi also described Ellison’s conduct at the meeting as “sunken” and didn’t display much in the way of confidence to Alameda employees. He said he was “stunned” to learn about the extent of the relationship between FTX and Alameda and quit the next day. </p><p>Speaking to Cointelegraph, Alameda Research engineer Aditya Baradwaj, who was also present at the meeting, said the room was “extremely tense,” with Ellison surfacing a wealth of new information that had “never been discussed internally” — <a href=\"https://cointelegraph.com/news/binance-s-ftx-acquisition-seen-as-chess-move-by-crypto-community\">including the later-abandoned acquisition of FTX</a> by its then-largest competitor Binance. </p><p>“It became pretty clear that there was no future for the company and that we all had to leave. And we did that right after,” said Baradwaj.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/secret-recording-caroline-ellison-alameda-sbf-trial&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-14T03:08:34.000Z",
    "title": "$81,000,000,000 in Bank Transfers Abruptly Halted As JPMorgan Chase and Big Banks Encounter Major Glitch in Japan: Report",
    "url": "https://dailyhodl.com/2023/10/13/81000000000-in-bank-transfers-abruptly-halted-as-jpmorgan-chase-and-big-banks-encounter-major-glitch-in-japan-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/bank-transfers-frozen-dollar.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/bank-transfers-frozen-dollar.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/bank-transfers-frozen-dollar.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/bank-transfers-frozen-dollar.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/bank-transfers-frozen-dollar.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/bank-transfers-frozen-dollar.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/bank-transfers-frozen-dollar.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Engineers are investigating a banking glitch that triggered a total shutdown of billions upon billions of dollars in bank transfers in Japan. The glitch began on Tuesday and lasted more than a day, leaving more than one million customers unable to move their money. The glitch halted $81 billion in transfers and according to UPI, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/13/81000000000-in-bank-transfers-abruptly-halted-as-jpmorgan-chase-and-big-banks-encounter-major-glitch-in-japan-report/\">$81,000,000,000 in Bank Transfers Abruptly Halted As JPMorgan Chase and Big Banks Encounter Major Glitch in Japan: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]