[
  {
    "source": "CoinDesk",
    "date": "2023-06-06T22:48:01.000Z",
    "title": "Atomic Wallet Was Breached by North Korean Hackers: Elliptic",
    "url": "https://www.coindesk.com/consensus-magazine/2023/06/06/atomic-wallet-was-breached-by-north-korean-hackers-elliptic/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Wallets that siphoned Atomic users' funds are connected to the known Lazarus group's addresses, crypto tracing firm said."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-06T22:52:48.000Z",
    "title": "Binance, Coinbase CEOs together lost $1.7B of personal wealth after SEC charges",
    "url": "https://cryptoslate.com/binance-coinbase-ceos-together-lost-1-7b-of-personal-wealth-after-sec-charges/",
    "description": "<p>The CEOs of Binance and Coinbase lost part of their personal wealth in the aftermath of SEC charges, Bloomberg said on June 6. Execs gained billions before latest loss The U.S. Securities and Exchange Commission sued Binance on June 5 and sued Coinbase on June 6, alleging that both companies violated securities regulations. Those events [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-coinbase-ceos-together-lost-1-7b-of-personal-wealth-after-sec-charges/\">Binance, Coinbase CEOs together lost $1.7B of personal wealth after SEC charges</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-06T22:53:00.000Z",
    "title": "Crypto Whales Buy the Dip After SEC Sues Binance",
    "url": "https://www.cryptoglobe.com/latest/2023/06/crypto-whales-buy-the-dip-after-sec-sues-binance/",
    "description": "After the U.S. Securities and Exchange Commission (SEC) filed a lawsuit against leading cryptocurrency exchange Binance, cryptocurrency prices plunged amid a wave of fear, uncertainty and doubt (FUD), smart money investors have quickly started buying the dip. According to data from popular blockchain analytics platform Lookonchain, significant movements of Circle’s stablecoin pegged to the U.S. […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-06T23:00:31.000Z",
    "title": "Former Twitter CEO Claims Ethereum Is A Security, Will This Affect Prices?",
    "url": "https://www.newsbtc.com/news/ethereum/former-twitter-ceo-ethereum-security-affect-prices/",
    "description": "Jack Dorsey, the former CEO of Twitter, while replying to a comment on June 6, alleged that Ethereum (ETH), the world’s second-largest cryptocurrency exchange, is a security under United States laws.  This controversially implies that holders of ETH should, as directed by law, comply with rules enforced by the Securities and Exchange Commission (SEC). Dorsey Claims Ethereum Is A Security Dorsey, a known Bitcoin supporter and the CEO of Square Inc, a financial service company that owns Cash App, has been vocal about BTC&#8217;s underlying technology.  In his assessment, Dorsey thinks Bitcoin can change how money is exchanged.  Amid this, Bitcoin, as a network and a payment solution, can help create a more equitable financial system.  Square is already invested in Bitcoin. On the other hand, Cash App continues to process billions worth of BTC transactions.  SEC officials and the Commodity Futures Trading Commission (CFTC) have been recorded saying BTC, the native currency of the Bitcoin network, is a commodity and not an investment contract.  Related Reading: Cardano Founder Unveils SEC Motivation For Suing Binance The SEC and CFTC are two of the leading regulators in the United States tasked with regulating the securities and derivatives markets.  However, considering their broad scopes, their jurisdictions can overlap. Still, their endorsement of Bitcoin as a commodity can further drive adoption and boost liquidity. Dorsey’s statement comes as a regulatory storm in recent days threatens to draw ETH into the mix for several reasons.  The SEC’s chair, Gary Gensler, during a congressional hearing in early February specified that tokens like Ethereum are sold as investments, subsequently generating profits solely from the efforts of others.  Therefore, in the agency’s perception, it may be an investment contract or security subject to federal securities law.  All the same, the commission, he added, was reviewing the crypto markets, including those of Bitcoin and Ethereum, to ensure they are efficient and fair.  While before the House Financial Services Committee in mid-April, Gensler also failed to clarify whether ETH was a security or a commodity.  ETH Remains Sensitive To Regulatory Developments The SEC has brought enforcement actions against several companies that mint tokens on the Ethereum platform.  Leading influencers have also been accused by the SEC of promoting tokens they claim are registered securities.  Despite this, the SEC is yet to issue an official statement on the classification of this cryptocurrency. At the end, the commission could choose not to regulate ETH as a security after it has reviewed all relevant factors. Related Reading: Coinbase Caught In SEC Legal Crossfire, COIN Price Suffers With the regulator calling tokens of competing smart contract platforms like Cardano and Algorand as securities, ETH prices sold off on June 5 only to reverse losses today.  Whether the dump of June 5 was an overreaction from the crypto market is yet to be seen.  What’s clear is that ETH remains sensitive to regulatory actions, and bulls have since failed to break above 2023 highs of $2,100. Feature Image From Canva, Chart From TradingView"
  }
]