[
  {
    "source": "NullTX",
    "date": "2024-03-30T03:34:18.000Z",
    "title": "Shark Cat Memecoin Surges, Traders Make Massive Profits",
    "url": "https://nulltx.com/shark-cat-memecoin-surges-traders-make-massive-profits/",
    "description": "In the realm of Solana memecoins, Shark Cat has emerged as a standout performer, providing traders with significant gains over the past 24 hours. As of the latest update, the price of Shark Cat (SC/SOL) has surged by an impressive 49.71% within the last day. The coin reached its peak [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-30T03:28:55.000Z",
    "title": "Smart Investor Bullish On BOME, Predicts Bright Future Despite Recent Dip",
    "url": "https://nulltx.com/smart-investor-bullish-on-bome-predicts-bright-future-despite-recent-dip/",
    "description": "A savvy investor, who withdrew $2.3 million from Binance to purchase 314 million BOME tokens just before the coin was listed on the exchange, has taken to Twitter to share his bullish outlook on the cryptocurrency. In a recent tweet, the investor revealed his unwavering confidence in BOME, likening its [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-30T03:22:51.000Z",
    "title": "MakerDAO Token Sees Surge Amidst Onchain Activity",
    "url": "https://nulltx.com/makerdao-token-sees-surge-amidst-onchain-activity/",
    "description": "The Maker DAO governance token MKR has witnessed a notable surge in recent days, with gains of 15% recorded over the past week. However, recent onchain activity has brought some volatility to the market. In a significant move, a whale recently offloaded 4,753 MKR tokens in exchange for 17.3M DAI, [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-30T03:17:03.000Z",
    "title": "Worldcoin Faces Regulatory Scrutiny Despite Technological Advances",
    "url": "https://nulltx.com/worldcoin-faces-regulatory-scrutiny-despite-technological-advances/",
    "description": "Worldcoin, a leading player on the Optimism Network, has garnered significant attention with its average weekly transaction volume surpassing 1 billion and boasting over 2.5 million holders. However, despite its technological prowess, the cryptocurrency has encountered regulatory hurdles worldwide. Worldcoin leads on the Optimism Network with an average weekly transaction [&#8230;]"
  }
]