[
  {
    "source": "CoinDesk",
    "date": "2023-11-28T20:57:30.000Z",
    "title": "Big Tech Has Put Our Future At Risk. It’s Time To Fight Back",
    "url": "https://www.coindesk.com/consensus-magazine/2023/11/28/big-tech-has-put-our-future-at-risk-its-time-to-fight-back/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The internet was supposed to make us more liberated and healthier. Instead, it stole our data, freedom and mental health, says Project Liberty Founder Frank McCourt, who’s advancing a new digital infrastructure to support a better web and better world."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-28T20:42:37.000Z",
    "title": "Coinbase Stock Is Soaring—What Does That Mean for Crypto?",
    "url": "https://decrypt.co/207738/coinbase-stock-soaring-what-that-means-for-crypto",
    "description": "Coinbase stock just hit a yearly high, outperforming Bitcoin, Ethereum, and most other related investments. Is the crypto proxy a safer bet than digital assets?"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-28T20:51:23.000Z",
    "title": "Coinbase warns customers about subpoena in apparent CFTC Bybit probe",
    "url": "http://cointelegraph.com/news/coinbase-warns-customers-subpoena-cftc-bybit-probe",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/9d89a127-4aa1-4162-9102-77f1cf6b27b3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cryptocurrency exchange Bybit restricts use in the United States, although it may be possible to get around it.</p>\n                    <p><p>Coinbase is warning that it has received a subpoena from the United States Commodity Futures Trading Commission (CFTC), according to X (formerly Twitter) users who have posted copies of the message. The CFTC is seeking information about the Bybit cryptocurrency exchange.</p><p>Recipients have speculated that any Coinbase customer who also used Bybit received the message. Coinbase may provide information on users’ accounts and transaction activities to the CFTC unless the subpoena is reversed by a court by Nov. 30, according to the Nov. 27 message.</p><p>Dubai-based Bybit <a href=\"https://www.bybit.com/en/help-center/article/Service-Restricted-Countries\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> earlier this year in its terms of service that it does not provide service in the United States, but it is reportedly accessible <a href=\"https://coincodecap.com/bybit-in-the-usa#:~:text=Bybit%20is%20not%20legal%20in,follow%20the%20USA%20government%27s%20norms.\" target=\"_blank\" rel=\"noopener nofollow\">using</a> a virtual private network (VPN).</p><p>The day following Coinbase’s communication, Bybit <a href=\"https://www.prnewswire.co.uk/news-releases/bybit-celebrates-5-years-of-disrupting-the-game-with-20-million-users-milestone-301998925.html\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that it had reached 20 million users. It described itself as a “top-three cryptocurrency exchange.” According to the exchange’s statement:</p><blockquote>“Prudent risk management and enhanced AML [Anti-Money Laundering] compliance have led Bybit to gain licenses in the UAE, Kazakhstan, and Cyprus.”</blockquote><p>Bybit announced it would be imposing Know Your Customer (KYC) verification on users in July 2021, although it is not clear when that took place. Bybit posted KYC instructions for its customers in September 2022. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/opyn-de-fi-protocol-founders-leaving-cryptocurrency-cftc-crackdown\">Opyn DeFi protocol founders are leaving crypto after CFTC crackdown</a></em></strong></p><p>In September, Bybit said it <a href=\"https://cointelegraph.com/news/bybit-suspend-uk-services-following-regulator-warning\">would leave the United Kingdom market</a> in October when new Financial Conduct Authority rules came into force. It <a href=\"https://cointelegraph.com/news/okx-bybit-remove-russian-banks-from-payments-list\">removed two sanctioned Russian banks</a> from its payments list in August.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I&#39;ve been off Twitter watching some football. One of my friends sent me this email he received from Coinbase. I do not know how many people are subject to this, what the scope is, etc. However, it looks like Coinbase and ByBit do not mix well together! <a href=\"https://t.co/L3qqDBp2TN\">pic.twitter.com/L3qqDBp2TN</a></p>&mdash; Suitman (Clinically Insane) (@NotSuitman) <a href=\"https://twitter.com/NotSuitman/status/1729314997749080163?ref_src=twsrc%5Etfw\">November 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p>The CFTC <a href=\"https://cointelegraph.com/news/premier-crypto-cop-cftc-digital-asset-enforcement-2023\">labeled itself the “premier” enforcement agency</a> for crypto in its roundup of fiscal year 2023 cases. It initiated 47 cases in the digital assets sector in that period, representing 49% of the cases filed. Among those cases were suits against FTX, Celsius, <a href=\"https://cointelegraph.com/news/cftc-action-former-voyager-digital-ceo\">Voyager Digital CEO Stephen Ehrlich</a> and <a href=\"https://cointelegraph.com/news/us-officials-announce-binance-settlement\">Binance</a>.</p><p>Neither Coinbase nor Bybit responded to Cointelegraph requests for comment. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\">Crypto regulation: Does SEC Chair Gary Gensler have the final say?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-28T20:45:52.000Z",
    "title": "Stablecoin balances on exchanges surge, hinting at crypto liquidity rebound",
    "url": "https://cryptoslate.com/insights/stablecoin-balances-on-exchanges-surge-hinting-at-crypto-liquidity-rebound/",
    "description": "<p>Quick Take The balance of stablecoins on crypto exchanges has seen an uptick, marking a potential turning point in a year characterized by declining liquidity. Yesterday, Nov. 27, the exchange balance of stablecoins surged by an impressive 750 million, placing the day among the top five in 2023 for such increases. A retrospective look at [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/stablecoin-balances-on-exchanges-surge-hinting-at-crypto-liquidity-rebound/\">Stablecoin balances on exchanges surge, hinting at crypto liquidity rebound</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-11-28T20:42:42.000Z",
    "title": "SEC Delays Franklin Templeton & Hashdex Bitcoin ETFs, Lining Up Wave of Approvals",
    "url": "https://cryptobriefing.com/sec-delays-franklin-templeton-hashdex-bitcoin-etfs-lining-batch-approvals/?utm_source=feed&utm_medium=rss",
    "description": "SEC delays ruling on Franklin, Hashdex Bitcoin ETFs, potentially lining up a wave of crypto fund approvals after extended review."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-28T20:57:49.000Z",
    "title": "Tesla’s Cybertruck: Bloomberg’s Dana Hull on Challenges in High-Volume Manufacturing",
    "url": "https://www.cryptoglobe.com/latest/2023/11/teslas-cybertruck-bloombergs-dana-hull-on-challenges-in-high-volume-manufacturing/",
    "description": "The Tesla Cybertruck is an electric pickup truck that was unveiled by Tesla in November 2019. It is designed to be a rugged and durable truck that can withstand a variety of challenges, including off-road driving and heavy payloads. The Cybertruck is also designed to be stylish and futuristic, with a sleek, angular design that […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-28T21:00:08.000Z",
    "title": "XRP, BNB Among Altcoins Losing Correlation With Bitcoin: Data",
    "url": "https://www.newsbtc.com/xrp-news/xrp-bnb-altcoins-losing-correlation-bitcoin/",
    "description": "Data shows altcoins have been losing correlation with Bitcoin recently, and among them, XRP and BNB have seen particularly pronounced decoupling. XRP &#38; BNB Have Seen Largest Drops In 60-Day Correlation To Bitcoin As pointed out by an analyst in a post on X, BTC has recently seen a drop in correlation with the altcoins. The &#8220;correlation&#8221; here refers to an indicator that keeps track of how tied the prices of any two assets are right now. When the value of this metric is positive, it means that the given assets respond to moves in each other&#8217;s price by moving in the same direction. The closer the indicator&#8217;s value is to 100%, the stronger this correlation is. Related Reading: Bitcoin Bull Run Is Only Just Starting, According To This Metric On the other hand, negative values imply that there is a negative correlation between the assets, as their prices are moving opposite to each other. In this case, the extreme is -100%, so the more negative the value, the more tight the relationship is. The 0% mark represents the point where no correlation exists between the prices, implying that movements in one have no bearing on how the other might perform. Now, here is a chart that shows what the 60-day correlation between Bitcoin&#8217;s daily log returns and various altcoins looks like right now, as well as how it compared a year back: Looks like XRP has seen the strongest decoupling out of these coins &#124; Source: @CryptoBusy on X As displayed in the above graph, the 60-day correlation between Bitcoin and XRP appears to have significantly decreased in this period, as it has plunged from nearly 80% to almost 40%. This means that XRP&#8217;s price has been moving much more independently of BTC during the past 60 days. BNB (BNB), Avalanche (AVAX), and Solana (SOL) have also seen some decoupling from the original cryptocurrency. Still, these alts have seen the indicator decline by much less than XRP has observed. Cardano (ADA) and Dogecoin (DOGE) are the altcoins that have observed the least amount of change. However, in the case of the memecoin the correlation was lesser than the other assets to begin with, so even with the small decoupling, its correlation level is still matching that of BNB. Generally, correlation is something to watch for whenever an investor is trying to diversify their portfolio, as two assets with significant correlation wouldn&#8217;t provide much safety. Related Reading: Santiment Reveals Trigger Behind Bitcoin Rally: Will This Signal Reignite? Thus, as XRP is currently the cryptocurrency least correlated with Bitcoin on this list, it might be a better diversification option than coins like Ethereum (ETH) or Polygon (MATIC), which have the 60-day value of the indicator at relatively high levels still. XRP Price Just a few days back, XRP had revisited the territory above the $0.63 mark, but it wasn&#8217;t long before it slipped again and went under the $0.60 level. Since this low, though, the cryptocurrency has seen some recovery, as it has now neared $0.61 once again. XRP seems to have gone through a tumble recently &#124; Source: XRPUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Kaiko.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-28T21:00:41.000Z",
    "title": "Trader Predicts Explosive Move for Bitcoin, Says BTC Crawling Now So It Can Sprint Later",
    "url": "https://dailyhodl.com/2023/11/28/trader-predicts-explosive-move-for-bitcoin-says-btc-crawling-now-so-it-can-sprint-later/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/trader-predicts-explosive-move.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/trader-predicts-explosive-move.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/trader-predicts-explosive-move.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/trader-predicts-explosive-move.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/trader-predicts-explosive-move.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/trader-predicts-explosive-move.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/trader-predicts-explosive-move.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist believes that Bitcoin (BTC) is setting up for a big move to the upside. Pseudonymous crypto analyst Credible Crypto tells his 354,100 followers on the social media platform X that he thinks Bitcoin is on the path of a slow grind up before a burst to the upside. According to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/28/trader-predicts-explosive-move-for-bitcoin-says-btc-crawling-now-so-it-can-sprint-later/\">Trader Predicts Explosive Move for Bitcoin, Says BTC Crawling Now So It Can Sprint Later</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-28T20:55:46.000Z",
    "title": "Top Trader Names Two Altcoin Plays for Current Crypto Market, Lays Out ETF Approval Scenario",
    "url": "https://dailyhodl.com/2023/11/28/top-trader-names-two-altcoin-plays-for-current-crypto-market-lays-out-etf-approval-scenario/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/on-Altcoins-Updates-Outlook.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/on-Altcoins-Updates-Outlook.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/on-Altcoins-Updates-Outlook.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/on-Altcoins-Updates-Outlook.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/on-Altcoins-Updates-Outlook.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/on-Altcoins-Updates-Outlook.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/on-Altcoins-Updates-Outlook.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is naming two altcoins he’s bullish on as Bitcoin (BTC) reclaims the $38,000 range. Pseudonymous trader The Flow Horse tells his 188,00 followers on the social media platform X that he believes there is further upside potential for blockchain oracle provider Chainlink (LINK) and Ethereum (ETH) competitor Solana (SOL). “Things [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/28/top-trader-names-two-altcoin-plays-for-current-crypto-market-lays-out-etf-approval-scenario/\">Top Trader Names Two Altcoin Plays for Current Crypto Market, Lays Out ETF Approval Scenario</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]