[
  {
    "source": "CoinDesk",
    "date": "2023-10-31T15:00:00.000Z",
    "title": "Coinbase-Backed Advocacy Group Enlists Crypto Masses, Raises $2M From 80,000",
    "url": "https://www.coindesk.com/policy/2023/10/31/coinbase-backed-advocacy-group-enlists-crypto-masses-raises-2m-from-80000/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A Coinbase (COIN) effort to drum up a cross-country swell of amateur crypto advocates – the nonprofit Stand With Crypto – has paid off with a surge of more than 100,000 individuals getting involved in the opening weeks, organizers say."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-31T15:37:00.000Z",
    "title": "Celestia Airdrops TIA Token as Network Goes Live, Claims Start of 'Modular Era'",
    "url": "https://www.coindesk.com/business/2023/10/31/celestia-mainnet-goes-live-as-580000-users-receive-airdrop/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Celestia's mainnet beta is live following the issuance of its native token, TIA."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-31T14:49:27.000Z",
    "title": "SBF says spending FTX customers' money was part of 'risk management': Report",
    "url": "http://cointelegraph.com/news/sbf-says-spending-ftx-customers-money-risk-management-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/94c3af39-6ba6-4fef-88f7-f1f7ea278980.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>At the time of bankruptcy, FTX faced a shortfall of $8 billion owing to its customers. </p>\n                    <p><p>Sam Bankman-Fried (SBF), the founder of cryptocurrency exchange FTX, claims that spending clients' fiat deposits was just part of \"risk management\" for his intertwined crypto hedge fund Alameda Research.</p><p>During the former crypto executive's court <a href=\"https://twitter.com/innercitypress/status/1719355551572726072\" target=\"_blank\" rel=\"noopener nofollow\">testimony</a> on October 31, prosecutor Danielle Sassoon of the Southern District of New York asked SBF if he believed that it was permissible to spend $8 billion of FTX customers' fiat money. \"I thought it was folded into risk management,\" he said. \"As CEO of Alameda, I was concerned with their portfolio. At FTX, I was paying attention but not as much as I should have been.\"</p><p>As told by SBF, during his tenure as both CEO of FTX and Alameda, no individuals were fired for allegedly siphoning $8 billion worth of clients' money for speculative trading. \"I don't remember knowing anything about particular employees,\" replied SBF to a question by Sassoon.</p><p>Bankman-Fried also disclosed during the proceedings that the now-defunct exchange, which was headquartered in the Bahamas, had close ties with the island country's government. \"You gave the Bahamas Prime Minister floor side seats at the Miami Heat Arena,\" asked Sassoon. \"I don't remember that,\" replied SBF. \"Here's a message where you say he is in FTX's courtside seats with his wife,\" said Sassoon.</p><p>Allegedly, SBF talked with the Bahamian prime minister, Philip Davis, about paying off his nation's debt. Although the crypto executive denies it, he admits to helping Davis' son secure a job. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-updates\">Sam Bankman-Fried trial [Day 15] — latest update: Live coverage</a></em></strong></p><p>Just before the exchange collapsed last November, FTX announced that Bahamian users would be made whole and that it would process their withdrawal requests in priority. The FTX trial <a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-updates\">remains ongoing</a> and is expected to wrap up before the end of next week. </p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-31T15:00:09.000Z",
    "title": "“The Finals” Delivers Crossplay Support for PC, PS5, and Xbox Series Consoles",
    "url": "https://www.cryptopolitan.com/finals-crossplay-pc-ps5-and-xbox-series/",
    "description": "The Finals, an eagerly anticipated first-person shooter (FPS) developed by Embark Studios, has recently entered the gaming scene with its open beta launch. Gamers around the world are eager to dive into this unique FPS experience, but one question has been on their minds: Does The Finals support crossplay? Crossplay enabled: PC, PS5, and Xbox ... <a title=\"&#8220;The Finals&#8221; Delivers Crossplay Support for PC, PS5, and Xbox Series Consoles\" class=\"read-more\" href=\"https://www.cryptopolitan.com/finals-crossplay-pc-ps5-and-xbox-series/\" aria-label=\"More on &#8220;The Finals&#8221; Delivers Crossplay Support for PC, PS5, and Xbox Series Consoles\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-31T14:54:08.000Z",
    "title": "The Challenge of AI Document Translations to Understanding Reader Responses",
    "url": "https://www.cryptopolitan.com/the-challenge-of-ai-document-translations/",
    "description": "When it comes to AI-powered document translations, many people harbor the misconception that it&#8217;s a straightforward process of substituting words with their equivalents in the target language. In simple scenarios, like ordering wine at a restaurant, this may hold true, but the reality is far more complex, particularly when dealing with documents containing more than ... <a title=\"The Challenge of AI Document Translations to Understanding Reader Responses\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-challenge-of-ai-document-translations/\" aria-label=\"More on The Challenge of AI Document Translations to Understanding Reader Responses\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-31T14:50:24.000Z",
    "title": "AI Model Developed to Enhance Efficiency of Mobile Networks",
    "url": "https://www.cryptopolitan.com/ai-to-enhance-efficiency-of-mobile-networks/",
    "description": "Researchers at the University of Surrey have developed a new artificial intelligence (AI) model that could significantly improve the efficiency of the UK&#8217;s telecommunications network. This innovative model has the potential to save up to 76% in network resources compared to existing Open Radio Access Network (O-RAN) systems while also contributing to the environmental sustainability ... <a title=\"AI Model Developed to Enhance Efficiency of Mobile Networks\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-to-enhance-efficiency-of-mobile-networks/\" aria-label=\"More on AI Model Developed to Enhance Efficiency of Mobile Networks\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-31T14:44:51.000Z",
    "title": "Binance introduces innovative dual investment products: A comprehensive look",
    "url": "https://www.cryptopolitan.com/binance-introduces-dual-investment-products/",
    "description": "Binance, the world&#8217;s leading cryptocurrency exchange, made headlines today with the launch of its latest batch of Dual Investment products. These novel offerings are aimed at empowering traders with more flexibility in maneuvering the volatile crypto market. Let&#8217;s delve deeper into what these products entail and the implications for the crypto industry. Binance&#8217;s new dual ... <a title=\"Binance introduces innovative dual investment products: A comprehensive look\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-introduces-dual-investment-products/\" aria-label=\"More on Binance introduces innovative dual investment products: A comprehensive look\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-31T14:54:25.000Z",
    "title": "Stocks down, gold and crypto up as market correlations shift",
    "url": "https://crypto.news/stocks-down-gold-and-crypto-up-as-market-correlations-shift/",
    "description": "The correlation between Bitcoin, gold, and major stock indices like NASDAQ and S&#038;P500 changed dramatically in October.  Here is what it means."
  },
  {
    "source": "Kraken Blog",
    "date": "2023-10-31T14:44:27.000Z",
    "title": "Kraken Pro presents: Futures Market Masters 2023",
    "url": "https://blog.kraken.com/product/kraken-futures/kraken-pro-presents-futures-market-masters-2023",
    "description": "Show off your trading skills and win big. $100k big. It’s time — our 30-day futures trading contest has launched. Whether you&#8217;re an experienced pro or just starting out, it&#8217;s your chance to show off your futures trading skills and win a share of the $100,000 USD prize pool. When is the competition? The competition [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-31T15:00:57.000Z",
    "title": "Can PEPE Build On Its 60% Rise? Here’s What On-Chain Data Says",
    "url": "https://www.newsbtc.com/meme-coin/pepe-build-60-rise-what-on-chain-data-says/",
    "description": "PEPE has observed an impressive 60% rally recently. Here&#8217;s what on-chain data says regarding whether this rise can continue. PEPE Has Seen Some On-Chain Metrics Light Up Recently In a new post on X, the market intelligence platform IntoTheBlock has discussed how PEPE is looking in terms of its on-chain indicators currently. The first metric of interest here is the profit/loss breakdown of the memecoin&#8217;s user base. The distribution of the PEPE holders based on whether they are in loss or profit &#124; Source: IntoTheBlock on X As displayed above, about 35% of the holders/addresses of the cryptocurrency are carrying their coins with some net unrealized profit right now. On the other hand, the loss investors amount to 51% of the network&#8217;s user base, meaning that the majority of the holders are in the red currently. Related Reading: Is Bitcoin Top Here? This Metric Would Say Otherwise The remaining 14% of the addresses are breaking even at the current price levels of the asset. Generally, the investors carrying profits are more likely to sell their coins to harvest their gains, which means that if there are many holders in profit, significant selling pressure could arise in the market. In the current scenario, however, more than 50% of the investors are still carrying their coins at a loss despite the recent 60% surge that PEPE has enjoyed. Thus, the potential selling pressure in the sector may not be too much yet. This could certainly be a positive sign for the rally&#8217;s sustainability. Next, IntoTheBlock has pointed out how the address activity related to PEPE has observed a significant boost recently. Looks like the metrics have registered high values in recent days &#124; Source: IntoTheBlock on X According to the analytics firm, the active addresses jumped 372% between October 19th and 25th, while the new addresses increased by 440% in the same period. The &#8220;active addresses&#8221; metric keeps track of the daily number of addresses participating in some transaction activity on the blockchain. In contrast, the new addresses indicator measures the daily number of wallets coming online on the network for the first time. The sharp growth in these indicators would imply that network activity has been high recently, both in terms of usage and adoption. Historically, rallies have thrived in such conditions, as a large number of active traders is what such moves require to be sustainable. Lastly, IntoTheBlock has pointed out that while the PEPE whales haven&#8217;t shown concrete signs of accumulation yet, they have been potentially becoming active recently. The metric has seen some uptick recently &#124; Source: IntoTheBlock on X From the chart, it&#8217;s visible that the &#8220;large transactions volume&#8221; has observed some rise recently. The large transactions refer to transactions worth at least $100,000 in value, usually made by the whales and institutional entities. Related Reading: Bitcoin Solid Above $34,000 Despite High Short-Term Holder Profit-Taking While the uptick in the activity of these humongous investors hasn&#8217;t been that much, it&#8217;s still an optimistic sign that these investors have been showing at least some interest in PEPE during this rally. PEPE Price Since its sharp rise, PEPE has gone stale in the last few days as its price continues to trade around $0.0000011672. The memecoin has been trading sideways in the past week &#124; Source: PEPEUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com, IntoTheBlock.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-31T15:02:41.000Z",
    "title": "Bitcoin’s Road to $3 Million: Unleashing Hyperbolic Potential and Future Value",
    "url": "https://www.crypto-news-flash.com/bitcoins-road-to-3-million-unleashing-hyperbolic-potential-and-future-value/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoins-road-to-3-million-unleashing-hyperbolic-potential-and-future-value",
    "description": "<img width=\"960\" height=\"640\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BTCX.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BTCX.png 960w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BTCX-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BTCX-768x512.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/BTCX-104x69.png 104w\" sizes=\"(max-width: 960px) 100vw, 960px\" />Analysts suggest that with 10% global adoption, Bitcoin&#8217;s price could reach $3 million, highlighting that market cap follows price. The analyst&#8217;s projection aligns with Bitcoin&#8217;s historical growth and positions it as a low-risk, high-reward asset. The world&#8217;s largest cryptocurrency Bitcoin (BTC) has been consolidating around $34,500 levels after gaining strong momentum from the Bitcoin ETF [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-31T15:03:27.000Z",
    "title": "Uncovered Gems From Top Web3 Investors – Part 2",
    "url": "https://www.altcoinbuzz.io/spotlight/uncovered-gems-from-top-web3-investors-part-2/",
    "description": "<p>The last few days have been all smiles for crypto holders. First, Bitcoin recorded an impressive price surge caused by the news that the SEC could approve a spot Bitcoin ETF. For the first time in several months, crypto users are optimistic about investing again. But what are the best projects to invest in? Let&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/spotlight/uncovered-gems-from-top-web3-investors-part-2/\">Uncovered Gems From Top Web3 Investors &#8211; Part 2</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-31T14:55:00.000Z",
    "title": "Satoshi Nakamoto Released Bitcoin White Paper 15 Years Ago Today",
    "url": "https://coinedition.com/satoshi-nakamoto-released-bitcoin-white-paper-15-years-ago-today/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-BTC-Could-Soon.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin BTC Could Soon\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-BTC-Could-Soon.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-BTC-Could-Soon-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-BTC-Could-Soon-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-BTC-Could-Soon-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-BTC-Could-Soon-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-BTC-Could-Soon-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-BTC-Could-Soon-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-BTC-Could-Soon-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-BTC-Could-Soon-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-BTC-Could-Soon-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-BTC-Could-Soon-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-BTC-Could-Soon-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-BTC-Could-Soon-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-BTC-Could-Soon-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-BTC-Could-Soon-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin-BTC-Could-Soon-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Today, October 31st, marks the 15th anniversary of Satoshi Nakamoto’s release of the Bitcoin white paper. The white paper release marked the first time the digital asset was mentioned publicly. The anonymous creator, on October 31, 2008, released the white paper titled “Bitcoin: A Peer-to-Peer Electronic Cash System.” The release came at a time when [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/satoshi-nakamoto-released-bitcoin-white-paper-15-years-ago-today/\">Satoshi Nakamoto Released Bitcoin White Paper 15 Years Ago Today</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]