[
  {
    "source": "CoinDesk",
    "date": "2024-03-07T14:06:36.000Z",
    "title": "Fireblocks Prepares for Bull Market by Adding New Executive After New CFO Hire",
    "url": "https://www.coindesk.com/business/2024/03/07/fireblocks-prepares-for-bull-market-by-adding-new-executive-after-new-cfo-hire/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Chief marketing officer Michal Ferguson joins from cybersecurity platform Snyk, following the appointment of new CFO Michael Levine, and chief customer officer Madan Gadde."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-07T14:00:00.000Z",
    "title": "Protocol Village: Dfinity Releases 'DocuTrack' for Sending Encrypted Documents",
    "url": "https://www.coindesk.com/tech/2024/03/06/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of March 7-March 13."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-07T14:01:17.000Z",
    "title": "Pantera Capital eyes $250 million SOL purchase from FTX estate",
    "url": "https://cryptobriefing.com/pantera-capital-250-million-sol-purchase-ftx/",
    "description": "Pantera has opened a fundraising program to potentially scoop up $250 worth of Solana (SOL) tokens from the FTX estate."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-07T14:00:22.000Z",
    "title": "Fireblocks announces Michal Ferguson as its new CMO in a push for growth",
    "url": "https://cryptobriefing.com/fireblocks-new-cmo-michal-ferguson-market-growth/",
    "description": "Fireblocks appoints Michal Ferguson as CMO to lead its market expansion and enhance its blockchain and digital asset management platform."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-07T14:07:11.000Z",
    "title": "ShapeShift Settles SEC Charges From Pre-DAO Days",
    "url": "https://cryptodaily.co.uk/2024/03/shapeshift-settles-sec-charges-from-pre-dao-days",
    "description": "Despite shutting down its crypto exchange in 2021, ShapeShift was still charged by the US Securities and Exchange Commission (SEC) with selling unregistered securities. The company chose to settle on the SEC’s terms instead of taking the matter to court."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-07T13:41:35.000Z",
    "title": "Chainlink (LINK) Could Shape Bitcoin ETF Success, Litecoin’s (LTC) Market Twist Shocks Investors – Get the Scoop!",
    "url": "https://cryptodaily.co.uk/2024/03/chainlink-link-could-shape-bitcoin-etf-success-litecoins-ltc-market-twist-shocks-investors-get-the-scoop",
    "description": "Discover how Chainlink's (LINK) role in a high-profile Bitcoin ETF and Litecoin's (LTC) dramatic trading volume surge are reshaping the crypto market. Stay ahead in the rapidly evolving world of cryptocurrencies with these latest insights on LINK and LTC!"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T13:55:12.000Z",
    "title": "SAP Sees Cloud Revenue Growth Hinging on AI Adoption",
    "url": "https://www.cryptopolitan.com/sap-sees-cloud-revenue-growth-hinging-on-ai/",
    "description": "SAP SE, a global leader in enterprise software, is banking on artificial intelligence (AI) to propel its growth trajectory in cloud revenues. The company has recently appointed Philipp Herzig as its Chief AI Officer, signaling a strategic shift towards harnessing AI capabilities across its services. In an exclusive interview, Herzig emphasized the company&#8217;s commitment to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T13:48:15.000Z",
    "title": "Bitcoin bulls rejoice as MicroStrategy raises convertible debt to $700M",
    "url": "https://www.cryptopolitan.com/microstrategy-raises-convertible-debt-to700m/",
    "description": "MicroStrategy the prominent corporate entity known for its significant Bitcoin holdings has unveiled plans to augment its convertible debt offering to $700 million.  This development comes swiftly after an initial announcement indicating a $600 million offering earlier this week. MicroStrategy&#8217;s $700M convertible notes offering The augmented offering consists of $700 million in aggregate principal amount [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T13:43:49.000Z",
    "title": "Microsoft to Announce New Surface AI PCs, Copilot Features This Month",
    "url": "https://www.cryptopolitan.com/microsoft-to-announce-new-surface-ai-pcs/",
    "description": "Microsoft is planning to make new product announcements with a key focus on AI. The company published on Thursday that it will hold a digital event titled “New Era of Work” on March 21, wherein it will unveil special upgrades to Copilot, Windows, and Surface. What to Expect From Microsoft Event on March 21 The [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T13:42:00.000Z",
    "title": "Seychelles Parliament Discuss a Bill to Tackle AI",
    "url": "https://www.cryptopolitan.com/seychelles-parliament-tackle-ai/",
    "description": "Explore how Seychelles is steering the complex intersection of technology and human rights with a proposed bill aimed at regulating AI and tech. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-07T14:00:52.000Z",
    "title": "Super Tuesday Crypto Craze: Biden-Related Memecoin Stuns Markets With 5,000% Surge",
    "url": "https://www.newsbtc.com/news/super-tuesday-crypto-craze-biden-related-memecoin-stuns-markets-with-5000-surge/",
    "description": "The memecoin frenzy has struck again, and this time it&#8217;s centered around the likeness of US President Joe Biden. BODEN, a token named after the president, has experienced &#8211; at one point &#8211; a mind-boggling surge in value, skyrocketing by a jaw-dropping 5,000%, according to CoinMarketCap. Related Reading: Don’t Miss Out: XRP Bull Flag Signals Explosive Price Movement BODEN&#8217;s meteoric rise is just one example of the wider trend of meme coins seeking to capitalize on the popularity of prominent figures, be they politicians or celebrities. These tokens aim to attract investors seeking quick profits by leveraging the fame of their namesakes. Memecoin Fever: BODEN Makes Big Noise Trading data from CoinMarketCap reveals that BODEN, a Solana-based meme coin, has seen an astronomical rise of over 2,400% within the last 24 hours, marking a milestone in the crypto world. With a trading price of approximately $0.018, this quirky digital asset has amassed a staggering market volume of $24 million in a mere day. BODEN token price. Source: CoinMarketCap The surge in BODEN&#8217;s value has ushered in a new wave of meme coins, as developers seize the opportunity to capitalize on the hype and allure investors seeking swift gains. Trump Memecoin Also In The Spotlight Meanwhile, the cryptocurrency TRUMP, associated with Donald Trump, recently dropped to $8.08, although it still maintains a considerably higher value compared to its year-end price. Despite not being directly linked to politicians, Trump had previously received over 579,000 TRUMP tokens from the project team. Total crypto market cap at $2.44 trillion on the daily chart: TradingView.com The asset experienced a significant surge in January 2024, reaching a value of $4 million in Trump&#8217;s wallet, compared to trading between $0.01 and $0.08 in November 2023. The price increase is attributed to political victories by both Biden and Trump during the Super Tuesday contests, with Trump winning in 14 out of 15 states as the Republican candidate. BODEN Flexes Muscles However, BODEN has taken center stage this week, surpassing even the beloved Dogecoin (DOGE), the pioneer meme coin on Solana. BODEN&#8217;s performance has even outshined dogwifhat (WIF) and Bonk&#8217;s BONK, solidifying its dominance in the meme coin realm. Related Reading: Can DOGE Avoid A Dive? Sell Pressure Puts Memecoin To The Test Amidst the meme coin frenzy, let&#8217;s not forget the reigning king of the crypto world—Bitcoin (BTC). The leading digital currency experienced a fleeting moment of glory as it soared to a new all-time high of $69,300, a record not seen since 2021. However, the excitement was short-lived as BTC quickly retracted to as low as $60,000, causing a billion-dollar wipeout in the market. Featured image from AFP; Getty Images, chart from TradingView"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-07T13:59:28.000Z",
    "title": "Binance Launches Futures NEXT: Predicting Token Listings",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/binance-launches-futures-next-predicting-token-listings/",
    "description": "<p>This platform lets users predict future Binance Futures listings for rewards, leveraging their market insight. Futures NEXT is not just another addition to the Binance ecosystem. It represents a significant leap forward in democratizing the process of token listings. Predict Listings, Earn Rewards with Futures NEXT Binance empowers its community by letting users nominate and [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/binance-launches-futures-next-predicting-token-listings/\">Binance Launches Futures NEXT: Predicting Token Listings</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]