[
  {
    "source": "CoinDesk",
    "date": "2023-06-27T12:18:14.000Z",
    "title": "First Mover Americas: Crypto Funds See Largest Inflow in a Year ",
    "url": "https://www.coindesk.com/markets/2023/06/27/first-mover-americas-crypto-funds-see-largest-inflow-in-a-year/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for June 27, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-27T12:10:33.000Z",
    "title": "Chibi Finance Rug Pulls Users for $1M, CHIBI Falls 98%",
    "url": "https://www.coindesk.com/tech/2023/06/27/chibi-finance-rug-pulls-users-for-1m-chibi-falls-98/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Over 555 stolen ether were swapped from Arbitrum from Ethereum, a security firm said."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-27T12:16:40.000Z",
    "title": "Staked ETH surpasses exchange balances with 19% of supply locked",
    "url": "https://cryptoslate.com/staked-eth-surpasses-exchange-balances-with-19-of-supply-locked/",
    "description": "<p>Ethereum (ETH) staked by investors has outstripped the ETH balance on centralized exchanges, including Binance and Coinbase, Nansen data indicates. As of June 26, 2023, 23.36 million ETH worth nearly $44 billion, which represents 19.4% of the current supply, was staked, according to Nansen data. Comparatively, Ethereum held by centralized exchanges fell short at 23.35 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/staked-eth-surpasses-exchange-balances-with-19-of-supply-locked/\">Staked ETH surpasses exchange balances with 19% of supply locked</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-27T12:12:00.000Z",
    "title": "Voyager Victims Can Claim Funds On Gemini",
    "url": "https://cryptodaily.co.uk/2023/06/voyager-victims-can-claim-funds-on-gemini",
    "description": "<p>Affected Voyager customers can now open a Gemini account until July 23, 2023, and withdraw their cryptocurrencies directly in accordance with the distribution process claims.</p>\nGemini Enables Voyager Funds Recovery\n<p>In a statement posted on Sunday, June 25, the Gemini team announced a fund recovery program for those affected by the Voyager bankruptcy. The customers who hope to reclaim their lost funds will need to join the Gemini platform and will have time till July 23, 2023, to avail of the offer.&nbsp;</p>\n<p>Additionally, the team is also presenting a promotional offer of $5 BTC for every new verified Voyager customer from the United States who joins the Gemini platform.&nbsp;</p>\n<p>The statement reads,&nbsp;</p>\n\n<p>&ldquo;Through July 23, 2023, Voyager customers impacted by the Voyager bankruptcy can create a Gemini account to withdraw their crypto in-kind, pursuant to the claims of the distribution process. We are pleased to offer a promotional welcome to all Voyager customers who join Gemini. New U.S. customers from Voyager will receive $5 in BTC after they sign up and become verified within 30 days of opening their account.&rdquo;</p>\n\nCustomers To Recover Gemini-Supported Tokens\n<p>Gemini has been powering through the current crypto landscape, especially seeking expansion opportunities in the APAC countries. The company has, in fact, applied for its UAE license.&nbsp;</p>\n<p>It has now taken on the responsibility of being the full-reserve exchange and custodian for all client funds on the Voyager platform.&nbsp;</p>\n<p>The company also clarified that the fund recovery would only be applicable to tokens supported by Gemini. If a Voyager customer sends tokens not supported by the Gemini platform, they might be lost and completely unrecoverable. A similar loss of funds might affect the transition of tokens to Gemini over an unsupported network.&nbsp;&nbsp;</p>\n<p>Furthermore, if users do not withdraw their funds from the Voyager platform within the stipulated time, they will be liquidated and distributed back in cash.&nbsp;</p>\nVoyager&rsquo;s Bankruptcy Struggles\n<p>Just a few weeks ago, there were reports of a Voyager bankruptcy plan which claimed that the bankrupt firm was going to restart customer withdrawals to refund 35.72% of what was owed.&nbsp;</p>\n<p>After facing financial difficulties and declaring bankruptcy almost a year ago, Voyager Digital struggled with securing deals to reopen customer withdrawals. In fact, the company had two prior unsuccessful attempts.&nbsp;</p>\n<p>The first was the $1.4 billion deal with FTX US that fell through when the latter&rsquo;s bankruptcy scandal broke. Voyager&rsquo;s second attempt was a $1 billion deal with the US division of prominent cryptocurrency firm Binance. However, this, too, failed to materialize as Binance withdrew from the agreement, citing concerns over a \"hostile and uncertain regulatory climate\" in the United States.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice. </p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T12:36:27.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T12:32:29.000Z",
    "title": "IMF drops bombshell on central banks in inflation battle",
    "url": "https://www.cryptopolitan.com/imf-drops-bombshell-central-banks-inflation/",
    "description": "The fight against inflation by central banks worldwide could be facing a significant shift in strategy, according to recent comments by the deputy head of the International Monetary Fund (IMF). As an influential financial authority, the IMF&#8217;s perspective could significantly impact the tactics central banks use to combat rising inflation rates. Enduring inflation to ward ... <a title=\"IMF drops bombshell on central banks in inflation battle\" class=\"read-more\" href=\"https://www.cryptopolitan.com/imf-drops-bombshell-central-banks-inflation/\" aria-label=\"More on IMF drops bombshell on central banks in inflation battle\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T12:26:04.000Z",
    "title": "US SEC advisory group urges rebranding of leveraged ETFs",
    "url": "https://www.cryptopolitan.com/sec-advisory-group-rebranding-leveraged-etfs/",
    "description": "The Investor Advisory Committee (IAC), an arm of the Securities and Exchange Commission (SEC), is urging a rebranding for single-stock ETFs and other non-traditional exchange traded products (ETPs). According to the committee, the current naming conventions have led to significant investor confusion, primarily because these products function differently from traditional ETFs. Divergent from traditional ETFs ... <a title=\"US SEC advisory group urges rebranding of leveraged ETFs\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-advisory-group-rebranding-leveraged-etfs/\" aria-label=\"More on US SEC advisory group urges rebranding of leveraged ETFs\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T12:15:23.000Z",
    "title": "Legal battle erupts over EU’s groundbreaking digital rules",
    "url": "https://www.cryptopolitan.com/legal-battle-erupts-over-eu-digital-rules/",
    "description": "The vanguard legislation of the European Union (EU) crafted to impose stringent regulations on major technology companies, compelling them to intensify content monitoring on their platforms, is now caught in the crosshairs of its maiden legal tussle. The dispute arose from a claim made by Europe&#8217;s premier online fashion powerhouse that it is being disproportionately ... <a title=\"Legal battle erupts over EU&#8217;s groundbreaking digital rules\" class=\"read-more\" href=\"https://www.cryptopolitan.com/legal-battle-erupts-over-eu-digital-rules/\" aria-label=\"More on Legal battle erupts over EU&#8217;s groundbreaking digital rules\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-27T12:10:19.000Z",
    "title": "Ethscriptions vs Ordinals: a deep dive into the new web3 phenomena",
    "url": "https://crypto.news/ethscriptions-vs-ordinals-a-deep-dive-into-the-new-web3-phenomena/",
    "description": "Ethscriptions and Ordinals may change how we interact with blockchain technology. Discover how they work and their impacts on the world of crypto. In January 2023, the introduction of Bitcoin Ordinal Inscriptions (Ordinals) significantly impacted the web3 space. These inscriptions&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-27T12:30:52.000Z",
    "title": "Ethereum Classic (ETC) Soars 22% In One Week, Is $20 Possible?",
    "url": "https://www.newsbtc.com/analysis/etc/ethereum-classic-etc-soars-22-in-one-week-is-20-possible/",
    "description": "Ethereum Classic (ETC) bulls have been active over the past week, bullishly pushing the token&#8217;s price with significant gains in the last seven days. An over 22% seven-day price increase saw ETC smash the $15.79 resistance level to $18.74 at press time. Bullish signals point to more rallies for Ethereum Classic as the global market cap rallies, gradually propelling Bitcoin toward the $31,000 mark. The token could be charging up momentum to conquer the $20 mark in the coming days. Ethereum Classic’s Price Swings Ethereum Classic (ETC) launched in July 2016 as a hard fork of Ethereum that supports decentralized applications (DApps). The main aim of Ethereum Classic&#8217;s launch is to preserve the Ethereum blockchain&#8217;s originality. Earlier in June, ETC’s price retraced from its key support level of $18.25. It plunged into a bearish swing that caused severe losses for the token.  Related Reading: XRP Traders Show Capitulation, Why This Could Be Bullish ETC’s price rapidly nosedived from over $18 on June 4 to less than $15 in mid-June. The token traded sideways between June 10 and June 20 before shooting up to $19.17 on June 24, with an over 27% price increase. Fortunately, ETC recovered momentum after several days of bearish movement. And Ethereum Classic was among the coins that benefited from the buzz generated by multiple Bitcoin ETF filings by leading US-based asset managers.  The token shows bullish signs as the market slightly rebounded today after a brief correction in the last 24 hours. As of the time of writing, ETC trades at $18.74, with a 24-hour price increase of 2.52% and a 22.89% seven-day growth in value. Can Ethereum Classic Bulls Defend The Ongoing Rally? Buyers took charge of the market between June 23 and 24. The increasing buying pressure pushed the trading volume from $151.66 million to over $500 million on June 24. Though there was a pullback, another uptick in trading volume is noticeable, with a 43.29% increase in the last 24 hours. This suggests the bulls are determined to claim the $20 level and could achieve the target if the uptick in trading volume continues.  Ethereum Classic&#8217;s key support level currently stands at $18.42 on its TradingView daily chart. The bulls are working with the $19.44 resistance level in mind. But the ETC price may shoot above $20 once the bulls successfully push the token off the $19.44 resistance. Related Reading: How High Can Bitcoin Price Rise Due To Spot ETFs? Running The Numbers The cryptocurrency market outlook shows recovery signs as most coins trade in the green zone. But the overall market outlook suggests a mixed investor reaction since some coin prices are still red.  Bitcoin, the chief cryptocurrency, has increased by 0.91% in 24 hours with a 14.20% seven-day gain, while Ethereum still fluctuates between the red and green zones.  Chances are high that ETC would sustain its rally if the market sentiment becomes fully bullish. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T12:30:01.000Z",
    "title": "NEAR Protocol feels a boost following Alibaba Cloud partnership, Alex The Doge (ALEX) Recreates Sega’s Alex 2.0 version",
    "url": "https://www.crypto-news-flash.com/near-protocol-feels-a-boost-following-alibaba-cloud-partnership-alex-the-doge-alex-recreates-segas-alex-2-0-version/?utm_source=rss&utm_medium=rss&utm_campaign=near-protocol-feels-a-boost-following-alibaba-cloud-partnership-alex-the-doge-alex-recreates-segas-alex-2-0-version",
    "description": "As we continue to chart the ever-dynamic terrain of the crypto landscape, we find ourselves focusing on two notable events. NEAR Protocol is experiencing a surge following a partnership with Alibaba Cloud, while Alex The Doge (ALEX), an emerging GameFi token, is turning heads as it recreates a 2.0 version of the beloved Sega game, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-27T12:32:00.000Z",
    "title": "Ripple Attorney Withdraws From Legal Defense Team In SEC Lawsuit",
    "url": "https://coinedition.com/ripple-attorney-withdraws-from-legal-defense-team-in-sec-lawsuit/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/‘Someone-Wants-To-Orchestrate-A-Pump-For-XRP-Says-John-Deaton.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple Attorney Withdraws From Legal Defense Team In SEC Lawsuit\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/‘Someone-Wants-To-Orchestrate-A-Pump-For-XRP-Says-John-Deaton.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/‘Someone-Wants-To-Orchestrate-A-Pump-For-XRP-Says-John-Deaton-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/‘Someone-Wants-To-Orchestrate-A-Pump-For-XRP-Says-John-Deaton-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/‘Someone-Wants-To-Orchestrate-A-Pump-For-XRP-Says-John-Deaton-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/‘Someone-Wants-To-Orchestrate-A-Pump-For-XRP-Says-John-Deaton-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/‘Someone-Wants-To-Orchestrate-A-Pump-For-XRP-Says-John-Deaton-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Attorney Clayton J. Masterman has withdrawn from Ripple’s legal defense team in the lawsuit filed by the U.S. Securities and Exchange Commission (SEC). While the online sentiment indicated that Masterman’s departure dealt a considerable blow to Ripple, crypto lawyer John Deaton believes that the attorney’s departure holds no significance in the case. John Deaton took [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ripple-attorney-withdraws-from-legal-defense-team-in-sec-lawsuit/\">Ripple Attorney Withdraws From Legal Defense Team In SEC Lawsuit</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]