[
  {
    "source": "CryptoSlate",
    "date": "2023-12-09T01:00:08.000Z",
    "title": "Ex-Binance CEO Changpeng Zhao faces potential deposition in billion-dollar class action lawsuit",
    "url": "https://cryptoslate.com/ex-binance-ceo-changpeng-zhao-faces-potential-deposition-in-billion-dollar-class-action-lawsuit/",
    "description": "<p>A court filing submitted on Dec. 8 indicates that former Binance CEO Changpeng Zhao could be deposed in the class action suit Sizemore v. Zhao, in which plaintiffs seek over $1 billion in damages. The latest filing indicates that plaintiffs have moved for leave to take one deposition of Zhao, who is also a defendant in [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ex-binance-ceo-changpeng-zhao-faces-potential-deposition-in-billion-dollar-class-action-lawsuit/\">Ex-Binance CEO Changpeng Zhao faces potential deposition in billion-dollar class action lawsuit</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-09T01:02:12.000Z",
    "title": "India’s crypto regulations delayed until 2025",
    "url": "https://cryptobriefing.com/indias-crypto-regulations-delayed-until-2025/?utm_source=feed&utm_medium=rss",
    "description": "India is not in a hurry to introduce crypto and Web3 legislation, as it waits for global clarity and local innovation."
  },
  {
    "source": "NullTX",
    "date": "2023-12-09T00:46:56.000Z",
    "title": "Chainlink Gains Momentum As Binance Funding Rate Tilts Favorably With Over 50% Spike In Trading Volume ",
    "url": "https://nulltx.com/chainlink-gains-momentum-as-binance-funding-rate-tilts-favorably-with-over-50-spike-in-trading-volume/",
    "description": "Chainlink, the decentralized oracle network, is experiencing a positive shift in its Binance funding rate, predominantly favoring long positions. This development, reaching the highest level in four weeks, coincides with Chainlink&#8217;s surge in value, surpassing the $16 threshold and advancing toward $20 with minimal resistance, according to insights from market [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-09T01:00:17.000Z",
    "title": "Bitcoin and Ethereum Fees Rise By Over 50%: Will BTC Conquer $69k?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-ethereum-fees-rise-over-50-btc-conquer-69k/",
    "description": "There is a spike in crypto on-chain activity if transaction fees lead. According to IntoTheBlock data on December 8, Bitcoin transaction fees are up by over 60%, while &#8220;gas&#8221; in Ethereum has climbed by nearly 50% in the past week.  Bitcoin And Ethereum Transaction Fees Rise By Double-Digits This surge in activity can be pinned to multiple factors, mainly growing user interest and the ongoing crypto bull market. To illustrate, Bitcoin and Ethereum prices are trending at 2023 highs above $43,500 and $2,300 when writing. Even so, the crypto community expects these coins to extend gains in the coming weeks and months, partly because of expected institutional capital, projected to be in their billions, flowing to the sphere. Related Reading: XRP Price To Go Parabolic? Crypto Analyst Confirms 1000% Golden Cross Has Returned According to IntoTheBlock data, cumulative fees collected in Bitcoin this week stand at $43.8 million, up 61%. On the other hand, $83.3 million in fees has been accrued from Ethereum.  Looking at the historical transaction fees trend, transacting on Ethereum, despite its relatively high transaction processing speeds (TPS), is more expensive than Bitcoin. This can be due to Ethereum&#8217;s role in decentralized finance (DeFi), non-fungible token (NFT) minting, and more. Bitcoin is a transactional layer and doesn&#8217;t inherently support smart contracts. Usually, rising on-chain transaction fees are bullish for price and indicate that their respective ecosystem is thriving from increasing adoption. With transaction fees rising in the two leading blockchain ecosystems, more people want to interact with the project. Subsequently, this could support prices since BTC or ETH is used for paying transaction fees.  Will BTC Ease Past 2021 Highs Of $70,000? As BTC is currently trading above $43,500 and ETH recently broke above $2,300, the possibility of these coins retesting and easing past their all-time highs of $70,000 and $4,800, respectively, cannot be discounted. One of the key drivers of the surge in on-chain activity is the ongoing bull market. With crypto rising, more people are looking to position themselves, hoping to profit from further price appreciation. This wave of fear of missing out (FOMO) has pushed higher fees and prices. The demand for liquid and SEC-recognized digital assets will likely increase once the Securities and Exchange Commission (SEC) goes ahead and authorizes the first Bitcoin ETF. This derivative product will allow institutions to invest in Bitcoin confidently through a regulated solution.  Related Reading: Binance Founder Ordered To Stay Put In The US In Ongoing Probe As the odds of the SEC approving this product rose from early Q4 2023, BTC and ETH prices started rising in sync. Still, how prices will react once the spot Bitcoin ETF is approved remains to be seen. Once the SEC green-lights a spot Bitcoin ETF, the crypto market will begin looking at Ethereum and whether the agency will approve a similar solution. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-09T01:04:37.000Z",
    "title": "Criminal Drains 95 Year-Old Woman’s Bank of America Account – Now Bank Wants $4,237 in Overdraft Fees",
    "url": "https://dailyhodl.com/2023/12/08/criminal-drains-95-year-old-womans-bank-of-america-account-now-bank-wants-4237-in-overdraft-fees/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/bank-overdraft-dollar.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/bank-overdraft-dollar.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/12/bank-overdraft-dollar.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/12/bank-overdraft-dollar.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/12/bank-overdraft-dollar.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/bank-overdraft-dollar.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/12/bank-overdraft-dollar.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A 95 year-old woman says she&#8217;s going through a nightmare scenario, with scammers draining her account and the bank demanding she repay thousands of dollars stemming from the criminal&#8217;s spending spree. Florida resident Virginia Weimer initially lost $13,000 after a scammer gained access to her BofA checking account, reports the NBC-affiliated news station WFLA. Although [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/08/criminal-drains-95-year-old-womans-bank-of-america-account-now-bank-wants-4237-in-overdraft-fees/\">Criminal Drains 95 Year-Old Woman’s Bank of America Account – Now Bank Wants $4,237 in Overdraft Fees</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-09T01:00:31.000Z",
    "title": "Top-100 Web3 Altcoin Surges by 67% This Week Amid Wallet Update, New Partnership and Token Relisting",
    "url": "https://dailyhodl.com/2023/12/08/top-100-web3-altcoin-surges-by-67-this-week-amid-wallet-update-new-partnership-and-token-relisting/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/web3-wallet-update-surges.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/web3-wallet-update-surges.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/12/web3-wallet-update-surges.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/12/web3-wallet-update-surges.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/12/web3-wallet-update-surges.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/web3-wallet-update-surges.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/12/web3-wallet-update-surges.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A top-100 web3 altcoin has surged by more than 67% this week amid a wallet update, a new partnership and a relisting on a Korean exchange. WEMIX, a subsidiary of South Korean video game developer Wemade, aims to build a web3 ecosystem that focuses on experience-based services. The project&#8217;s native token is trading at $3.91 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/08/top-100-web3-altcoin-surges-by-67-this-week-amid-wallet-update-new-partnership-and-token-relisting/\">Top-100 Web3 Altcoin Surges by 67% This Week Amid Wallet Update, New Partnership and Token Relisting</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]