[
  {
    "source": "CoinDesk",
    "date": "2023-07-27T09:01:34.000Z",
    "title": "XRP, Stellar and Solana Products See Increased Institutional Investments This Year",
    "url": "https://www.coindesk.com/markets/2023/07/27/xrp-stellar-and-solana-products-see-increased-institutional-investments-this-year/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Products focused on XLM saw nearly 63% higher inflows this year."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-27T09:01:06.000Z",
    "title": "FOMC meeting is catalyst for higher move in crypto",
    "url": "https://cryptodaily.co.uk/2023/07/fomc-meeting-is-catalyst-for-higher-move-in-crypto",
    "description": "<p>Wednesday&rsquo;s announcement of the widely expected 25 basis point rise in the interest rate led to a higher move in cryptocurrencies.</p>\nNo surprises in FOMC meeting\n<p>There was probably never going to be any surprises yesterday for the interest rate or indeed for Fed Chairman Jerome Powell&rsquo;s performance afterwards. The 25 basis point rate rise was announced, and Powell didn&rsquo;t say anything to make markets jittery.</p>\n<p>Powell commented on what he saw as &ldquo;robust&rdquo; job gains over recent months leading to low unemployment. However, he did remark that the Fed &ldquo;remains highly attentive to inflation risks&rdquo;, no doubt taking into account the rise in energy prices once again.</p>\n<p>Therefore, from a crypto point of view, things were quite stable and prices moved up as a result, albeit not in a particularly strong fashion. After a bit of a dump on Monday, the trend has remained to the upside.</p>\n<p>Bitcoin is continuing to follow an up channel on the short time frame, although having fallen out of the range it has been in for the last month, the current move may just be to confirm the bottom of this range as new resistance.</p>\nAltcoin breakouts\n<p>Given that they have been trending lower for quite a few days now, certain altcoins look to have taken a lot more advantage than Bitcoin of the fairly meek and mild FOMC meeting.&nbsp;</p>\n<p>Solana ($SOL) broke out of its downtrend and recorded a strong 8% surge on the day. The move has broken through the resistance at $25 and so it now remains to be seen if this can be held, giving $SOL a firm base on which to move higher.</p>\n<p>Chainlink ($LINK) was another vigorous mover. The oracle play shifted 4.8% to the upside yesterday, and has continued the positive price action so far today with a further 2.4%. Traversing in a range since early May, $LINK looks to be regaining the mid-point of this range before perhaps attempting the range top at $9.50.</p>\n<p>Dogecoin ($DOGE) was one of the only cryptocurrencies to sink on Wednesday, down 4.75% on the day. However, this was on the back of a very strong surge from Elon Musk&rsquo;s favoured coin which had taken it as far as 19% up at one point on Tuesday.&nbsp;</p>\n<p>Thursday&rsquo;s price action is positive once more. A bounce from the 200-day moving average has sent it to test the resistance at $0.078 once again.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T08:51:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-27T09:04:57.000Z",
    "title": "Can Ripple (XRP) Keep Up With Tradecurve’s Presale Pump After SEC Ruling?",
    "url": "https://www.crypto-news-flash.com/can-ripple-xrp-keep-up-with-tradecurves-presale-pump-after-sec-ruling/?utm_source=rss&utm_medium=rss&utm_campaign=can-ripple-xrp-keep-up-with-tradecurves-presale-pump-after-sec-ruling",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-27T120420.245.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-27T120420.245.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-27T120420.245-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-27T120420.245-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The SEC has declared that Ripple (XRP) is NOT a security, but a currency. This ruling has sent shockwaves throughout the cryptocurrency community as it opens up new possibilities for the future of Ripple (XRP). But can it keep up with the pump Tradecurve (TCRV) is currently having during the presale phase of discounted tokens? [...]"
  }
]