[
  {
    "source": "Cointelegraph",
    "date": "2023-12-06T22:53:09.000Z",
    "title": " Judge accepts Binance CEO CZ’s guilty plea, with sentencing in Feb ",
    "url": "https://cointelegraph.com/news/binance-founder-cz-changpeng-zhao-guilty-plea-accepted",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYWU1NzRjNWMtZDhkZS00OTlhLWE1ZDUtYjM5NzljNmQwMzAzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>This court “hereby accepts the guilty plea of the defendant to the charge [...] and the defendant is adjudged guilty of such offense,” wrote Judge Richard Jones.</p>\n                    <p><p>A federal judge accepted Binance founder Changpang \"CZ\" Zhao's guilty plea to money laundering, but hasn't decided if he can leave the United States before his February sentencing date.</p><p>In a Dec. 6 filing to a Seattle District Court, Judge Richard Jones said he accepted Zhao’s guilty plea to <a href=\"https://cointelegraph.com/news/binance-indictment-unsealed-cz-guilty-plea\">one count of Bank Secrecy Act violations</a>, which the Binance founder submitted over two weeks ago on Nov. 21 alongside his exchange’s <a href=\"https://cointelegraph.com/news/us-officials-announce-binance-settlement\">$4.3 billion settlement</a> with the U.S.</p><p>Part of the settlement deal saw Zhao step down as CEO of Binance and pay $150 million to regulators.</p><p><a href=\"https://cointelegraph.com/news/binance-founder-cz-changpeng-zhao-guilty-plea-accepted\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-06T22:55:29.000Z",
    "title": "Seattle court approves guilty plea of ex-Binance CEO Changpeng Zhao",
    "url": "https://www.cryptopolitan.com/court-approves-guilty-plea-ex-binance-ceo/",
    "description": "Binance Holdings and its former chief, Changpeng Zhao, have reached a resolution with U.S. authorities. Judge Richard Jones approved the plea agreements, as revealed in recent court documents in the U.S. District Court for the Western District of Washington in Seattle. This conclusion follows Binance&#8217;s admission of guilt for contravening U.S. anti-money laundering and sanctions ... <a title=\"Seattle court approves guilty plea of ex-Binance CEO Changpeng Zhao\" class=\"read-more\" href=\"https://www.cryptopolitan.com/court-approves-guilty-plea-ex-binance-ceo/\" aria-label=\"More on Seattle court approves guilty plea of ex-Binance CEO Changpeng Zhao\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-06T23:00:25.000Z",
    "title": "Bitcoin Bullish Fractal Returns: Analyst Predicts Another Leg-Up With Price Target",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-bullish-fractal-returns/",
    "description": "The recent Bitcoin rally has brought a number of things to the forefront and one of those is a bullish Bitcoin fractal that has not returned in two years. Crypto analyst FieryTrading was the one to point this out in a recent analysis of the leading cryptocurrency as something that could serve as evidence that the rally will continue. Bitcoin Bullish Fractal Makes A Comeback The crypto analyst pointed to a previously identified channel in the Bitcoin price that could suggest a bullish continuation. This channel often results after a big pump and given that BTC has added around $15,000 to its price in the space of a month, it doesn’t get bigger than this. As a result of this, the channel has returned, suggesting that the BTC price could stick to this historical fractal. Related Reading: 8 Green Candles: Here’s What Happened To Bitcoin The Last Time It Appeared FieryTrading identified that the fractal had appeared back in 2019 when the price jumped from around $4,100 to $5,800. After this, the fractal had completed the move, causing the BTC price to rise above the $6,800 level. Source: Tradingview.com Then again in 2020, the fractal would reappear after the BTC price rose from around $11,000 and ended around $14,200. And just like in 2019, when the fractal was confirmed, it saw a continuation of the bullish rally which pushed the Bitcoin price above $16,000. Most recently, after Bitcoin’s price rose from $28,000 to $41,000, the fractal has reappeared once more. “The pattern that I&#8217;m talking about is a bullish channel after a big pump that results in another big pump,” FieryTrading explains. BTC price mounts recovery &#124; Source: BTCUSD on Tradingview.com Where Does This Put BTC’s Price? Following the previous performances of the Bitcoin price whenever this fractal has appeared, it suggests that there is still a lot of runway for the current rally. The crypto analyst used this historical performance to map out a likely path for the crypto’s price, putting the top of the fractal at $48,000. Related Reading: LUNC Stuns With 300% Gains, Can It Reach Its Previous ATH Market Cap? “Seeing how the market historically behaved, I made the assumption that BTC would follow this fractal and break out of the channel in the near future. One week later, and BTC has successfully broken out of the channel, as predicted by this fractal analysis,” FieryTrading stated. “As described in my analysis below, I&#8217;m currently looking at 48k as the next target. Seeing how these fractals historically behaved, 48k should be fairly easily reached?” If this fractal does play out the way the analyst expects, then the BTC price can be expected to add another $6,000 to its value from here before the recovery trend ends. This means that the leading crypto might see another 10% jump from its current price. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Web-Mind, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-06T23:01:59.000Z",
    "title": "European Central Bank Says Crypto Assets May Be Acting As Legitimate Story of Value in New Report",
    "url": "https://dailyhodl.com/2023/12/06/european-central-bank-says-crypto-assets-may-be-acting-as-legitimate-story-of-value-in-new-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/10/guru-undervalued-projects.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/10/guru-undervalued-projects.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/10/guru-undervalued-projects.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/10/guru-undervalued-projects.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/10/guru-undervalued-projects.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/10/guru-undervalued-projects.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/10/guru-undervalued-projects.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The European Central Bank (ECB) says that Bitcoin (BTC) and other digital assets have been playing the role of a store of value for many people around the world. In a new report on the global and local drivers of Bitcoin and crypto, the ECB names three things that are driving the adoption of digital [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/06/european-central-bank-says-crypto-assets-may-be-acting-as-legitimate-story-of-value-in-new-report/\">European Central Bank Says Crypto Assets May Be Acting As Legitimate Story of Value in New Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]