[
  {
    "source": "CryptoSlate",
    "date": "2024-02-01T01:00:41.000Z",
    "title": "Coinbase has donated $25M to crypto super-PAC Fairshake; Ripple has given $20M",
    "url": "https://cryptoslate.com/coinbase-has-donated-25m-to-crypto-super-pac-fairshake-ripple-has-given-20m/",
    "description": "<p>Coinbase and Ripple are among the largest donors to a super PAC that aims to support pro-crypto politicians, Bloomberg reported on Jan. 31. Coinbase has contributed $24.5 million to Fairshake, PAC spokesperson Josh Vlasto told Bloomberg. Coinbase CEO Brian Armstrong has also personally given $1 million to the PAC. Those donations make up about one-third [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/coinbase-has-donated-25m-to-crypto-super-pac-fairshake-ripple-has-given-20m/\">Coinbase has donated $25M to crypto super-PAC Fairshake; Ripple has given $20M</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-01T01:00:11.000Z",
    "title": "Billionaire Tim Draper Doubles Down on Bitcoin — Foresees Moment When People Won’t Want Dollars Anymore",
    "url": "https://news.bitcoin.com/billionaire-tim-draper-doubles-down-on-bitcoin-foresees-moment-when-people-wont-want-dollars-anymore/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/tim-draper-bitcoin-price-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Billionaire Tim Draper Doubles Down on Bitcoin — Foresees Moment When People Won&#039;t Want Dollars Anymore\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/tim-draper-bitcoin-price-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/tim-draper-bitcoin-price-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/tim-draper-bitcoin-price-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/tim-draper-bitcoin-price-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/tim-draper-bitcoin-price-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/tim-draper-bitcoin-price-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/tim-draper-bitcoin-price.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Billionaire venture capitalist Tim Draper has doubled down on bitcoin and his price prediction of the crypto. &#x201C;I think that there&#x2019;s going to be a moment where there&#x2019;s a run on the banks,&#x201D; he cautioned, adding: &#x201C;I actually think that there will be a moment in time when I can buy my food, clothing, and [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-01T01:00:55.000Z",
    "title": "Bitfinex Securities Starts Operations In El Salvador – Here Are The Details",
    "url": "https://www.newsbtc.com/bitcoin-news/bitfinex-securities-starts-operations-in-el-salvador-here-are-the-details/",
    "description": "Over the last few years, El Salvador has been making considerable efforts to become Latin America’s crypto hub. Today, two and a half years after adopting Bitcoin as a legal currency in the country, Bitfinex Securities announced the launch of Bitfinex Securities El Salvador S.A., the first platform to offer tokenized securities. Related Reading: Bitcoin Long Positions Surge On Bitfinex: Whales Add 4,230 BTC, Signaling Potential Price Reversal Launching The First Licensed Digital Asset Platform In El Salvador On January 31, 2024, Bitfinex Securities officially became the first registered and licensed digital assets service provider to launch in El Salvador, and it’s now accepting customer applications.  Last year, El Salvador approved the Digital Asset Securities Law, allowing Bitfinex Securities to apply for and receive approval for the first digital assets license under this regulatory framework. This new law, as Juan Carlos Reyes, President of the National Commission of Digital Assets (NCDA), explained: (&#8230;) carved out digital assets regulation from the traditional financial regulator and created the national commission of digital assets, that oversees the supervision and regulation of the ecosystem. Additionally, the NCDA Chair recalled the positive experience with the firm and praised it for its ‘regulatory high standards’ and ‘world-class’ knowledge of compliance. In the announcement, Bitfinex Securities highlighted the “substantial leap for financial innovation in Latin America” that the development of the tokenized securities industry in El Salvador suggests. The firm also announced it has established a pipeline of potential issuances that it expects to come to the market throughout the year. Bitcoin ETF Approval Provides An Optimistic Outlook “We are delighted to be able to announce the launch of Bitfinex Securities in El Salvador,” said Paolo Ardoino, Chief Technology Officer of Bitfinex Securities. He expressed his excitement to take part in the “forefront of this financial revolution,” stating: This is not only an important market for Bitfinex given its adoption of Bitcoin as legal tender and the fostering of a Bitcoin-based economy, but it also gives El Salvador the opportunity to attract global investment flows, as issuers put out competitively priced securities offerings. The launch of the Bitfinex Securities El Salvador platform follows the approval of the spot Bitcoin Exchange-Traded Funds (ETFs) by the US Securities and Exchange Commission (SEC) on January 10. The successful launch of Bitcoin-based ETFs in the US makes the firm expect a significant demand for exposure to other regulated digital asset services. Jesse Knutson, Bitfinex Securities Head of Operation, highlighted in his statement the progress that El Salvador has made since 2021: Following up on El Salvador’s groundbreaking policy work and legislative frameworks over the past two and a half years, the official launch of Bitfinex Securities El Salvador is another important step in the evolution of capital markets and an important global proof of concept. Knutson also expressed optimism over the &#8220;recent surge of institutional investor interest in Bitcoin-focused financial products.&#8221; Related Reading: Bitcoin ETFs Experience Day 12 Reversal, GBTC Selling Slows, Fidelity And Blackrock Garner $400 Million Bitcoin is trading at $43,343.6 in the hourly chart. Source: BTCUSDT on TradingView.com Featured image from www.slon.pics on Freepik, Chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-01T01:00:22.000Z",
    "title": "Top Analyst Warns Solana Flashing Bearish Signals, Updates Forecast on Sei and One Dogecoin Rival",
    "url": "https://dailyhodl.com/2024/01/31/top-analyst-warns-solana-flashing-bearish-signals-updates-forecast-on-sei-and-one-dogecoin-rival/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/top-solana-flashing.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/top-solana-flashing.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/top-solana-flashing.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/top-solana-flashing.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/top-solana-flashing.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/top-solana-flashing.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/top-solana-flashing.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto analyst who accurately called Bitcoin&#8217;s (BTC) price floor during the 2018 bear market is suddenly flipping bearish on Solana (SOL). Pseudonymous analyst Bluntz tells his 239,000 followers on the social media platform X that Solana is flashing multiple bearish signals on the daily chart after rallying to a seven-day high of around $106. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/31/top-analyst-warns-solana-flashing-bearish-signals-updates-forecast-on-sei-and-one-dogecoin-rival/\">Top Analyst Warns Solana Flashing Bearish Signals, Updates Forecast on Sei and One Dogecoin Rival</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]