[
  {
    "source": "Cointelegraph",
    "date": "2024-02-07T00:06:00.000Z",
    "title": " MicroStrategy buys $37M Bitcoin bringing holdings to 190,000 BTC ",
    "url": "https://cointelegraph.com/news/microstrategy-q4-earnings-buys-850-bitcoin-michael-saylor",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMTQyYTIyZTAtOGU2MS00NmYxLTllZjYtYjc0MjlmOTg2NDI4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>MicroStrategy snapped up another 850 Bitcoin in January, increasing its total BTC holdings to a value of $8.1 billion.</p>\n                    <p><p>MicroStrategy, the largest publicly traded holder of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), says it acquired an additional 850 BTC in January bringing its total holdings to 190,000 BTC — worth $8.1 billion.</p><p>In its Q4 2023 Feb. 6 earnings <a href=\"https://microstrategy.zoom.us/webinar/register/WN_ugA0ofpdTvKIw6m4ng3sVQ#/registration\" target=\"_blank\" rel=\"noopener nofollow\">call</a>, the business software firm’s chief financial officer, Andrew Kang, said it acquired 56,650 BTC throughout 2023 at an average price of $33,580.</p><p>Overall, MicroStrategy posted a net income of $89.1 million, compared with a loss of $249.7 million in the year prior. The company’s revenue decreased 6.1% to $124.5 million within the same time frame, according to a Feb. 6 earnings <a href=\"https://www.businesswire.com/news/home/20240206684972/en/MicroStrategy-Announces-Fourth-Quarter-2023-Financial-Results-Now-Holds-190000-BTC\" target=\"_blank\" rel=\"noopener nofollow\">statement</a>. </p><p><a href=\"https://cointelegraph.com/news/microstrategy-q4-earnings-buys-850-bitcoin-michael-saylor\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-06T23:57:00.000Z",
    "title": "Ripple Exec Teases Major XRP-Powered Updates for Ripple’s U.S. Market Expansion",
    "url": "https://www.cryptoglobe.com/latest/2024/02/ripple-exec-teases-major-xrp-powered-updates-for-ripples-u-s-market-expansion/",
    "description": "Oliver Segovia, a Senior Director and the head of Product Market for payments at Ripple, has recently hinted at a major announcement for the company’s customers and users in the US. Segovia revealed, as first reported by CryptoPotato that Ripple is set to launch new product updates in the U.S., leveraging its money transmitter licenses […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-07T00:00:22.000Z",
    "title": "New Milestone For Google And MultiversX, Partners Launch New Data Integration",
    "url": "https://www.newsbtc.com/news/new-milestone-for-google-and-multiversx-partners-launch-new-data-integration/",
    "description": "In a new development for their partnership, MultiversX has announced its integration with Google BigQuery, marking a significant milestone in making blockchain data more accessible and insightful, per an official post. Related Reading: xDay 2023 Day 2: Google And MultiversX Join Hands, How The Big Tech Giant Will Support The Community MultiversX Ecosystem Gains a Boost With BigQuery Integration This integration hints at potential growth for the MultiversX ecosystem, underscoring the network&#8217;s commitment to enhancing the user experience and assisting its developer community by providing them with new tools. With this latest collaboration, Google replicates its role as the internet&#8217;s information custodian by making MultiversX&#8217;s blockchain data readily accessible through BigQuery. This platform operates as an enterprise-grade cloud data warehouse. The official post claims this move will &#8220;democratize access to blockchain insights, offering unprecedented transparency and analysis capability to users and developers alike.&#8221; Integrating BigQuery enables anyone with an account to delve into the MultiversX network&#8217;s intricacies without needing specialized software or the lengthy process of syncing the ledger. Users can now easily query the network&#8217;s data, including details about the top 100 block producers, daily transaction counts, and much more, as seen in the chart below. This capability is expected to drive further innovation and development within the MultiversX ecosystem. Lucian Mincu, CIO of the MultiversX Foundation, highlighted the significance of this development, stating: Analyzing and interpreting data to reveal useful insights about product usage is a science barely explored in the web3 space. Having Google resolve a big part of the hassle for MultiversX projects is an important step towards making dApps better, more useful, and more appealing to the masses. Google Support Accelerates MultiversX Development In addition to data accessibility, the partnership between MultiversX and Google Cloud encompasses a wide range of initiatives to accelerate Web3 adoption and ecosystem expansion. As announced during the xDay 2023 Conference in Bucharest, Romania. These include a startup accelerator program, hackathons, developer initiatives, and joint business developments. MultiversX&#8217;s presence at the company&#8217;s booth at GITEX Global in Dubai in 2023 exemplifies the partnership&#8217;s deepening collaboration. The partnership also shows Google Cloud&#8217;s commitment to supporting the blockchain community, as highlighted by Daniel Rood, Head of Web3 EMEA for Google Cloud. The partnership aims to drive adoption, &#8220;accelerating&#8221; the growth of the MultiversX ecosystem and, by extension, the broader Web3 space. With Google&#8217;s backing, MultiversX is poised for accelerated growth, bringing new opportunities for users and developers. Related Reading: Solana Suffers 11th Outage In 2 Years, SOL Price Drops 3% As blockchain technology continues to evolve, partnerships between MultiversX and Google BigQuery are pivotal in shaping the future of digital assets and Web3. By enhancing data accessibility and supporting the development community, MultiversX and Google are setting new standards for innovation and collaboration in the blockchain space. Chart from Tradingview"
  }
]