[
  {
    "source": "CoinDesk",
    "date": "2023-09-01T09:15:52.000Z",
    "title": "HashKey Capital's $100M Digital Asset Fund to Invest Significantly in Altcoins: Reuters",
    "url": "https://www.coindesk.com/business/2023/09/01/hashkey-capitals-100m-digital-asset-fund-to-invest-significantly-in-altcoins-reuters/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Less than half of the fund's investments will be in bitcoin (BTC) and ether (ETH), the two largest cryptocurrencies, with the aim of diversifying allocations to smaller cap assets."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-01T09:31:09.000Z",
    "title": "Bitcoin, Ethereum Drop After SEC Delays ETF Decision",
    "url": "https://decrypt.co/154565/bitcoin-ethereum-drop-sec-delays-etf-decision",
    "description": "Bitcoin puked gains from earlier this week after Grayscale's legal victory, as the SEC again punted on several spot Bitcoin ETF applications."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-01T09:32:02.000Z",
    "title": "OKX plans to enter India, hire local employees for Web3 exploration ",
    "url": "https://cointelegraph.com/news/okx-plans-to-enter-india",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/5e5a9e82-d08f-476a-a605-d1c83daf730c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The CMO of OKX says the company is looking into its entrance in the Indian market through hiring local employees and “understanding the culture.”  </p>\n                    <p><p><a href=\"https://www.coindesk.com/business/2023/09/01/okx-planning-web3-foray-into-india-chief-marketing-officer-says/\" target=\"_blank\" rel=\"noopener nofollow\">report</a>The cryptocurrency exchange OKX plans to enter the Indian market and recruit local employees in an effort to expand its possibilities of Web3 applications, according to a CoinDesk report. </p><p>OKX’s CMO, Haider Rafique, said it plans to scale up its wallet services “exponentially” via entrance into India’s developer community. He continued, saying there are currently 200,000 OKX user wallets in India, which equates to barely 5% of India’s Web3 users. </p><blockquote>\"We're going to learn about the community. We're going to work with local folks. Figure out where we can add value.\"</blockquote><p>OKX is the 6th largest cryptocurrency exchange worldwide in terms of volume, according to current <a href=\"https://coinmarketcap.com/rankings/exchanges/\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from CoinMarketCap. It also does not have a global headquarters, rather works out of regional hubs in Singapore, Dubai, Hong Kong and the Bahamas. </p><p>Rafique said the company isn’t planning to open an office in India but will depend on local employees to lead its efforts in the country. </p><blockquote>\"We're trying to identify who's who in the zoo and what is their contribution. There's a large developer community. How do we help them, build a relationship with them.” </blockquote><p>He commented that by taking the community approach, it could highlight the right way to enter the local market. </p><p>Recently, OKX partnered with the blockchain platform Neo for an APAC Hackathon in the southern Indian city of Bengaluru. Haider called this move a test to validate assumptions, understand the culture and support the local Web3 ecosystem. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/basis-trading-simplified-and-how-exchanges-adapt-to-institutional-needs-qa-with-okx\"><strong><em>Basis trading, simplified, and how exchanges adapt to institutional needs — Q&amp;A with OKX</em></strong></a></p><p>Trading cryptocurrencies is legal in India, though there are currently no set regulations in place by a central authority and are traded and used at the risk of the investor. While they are not banned they also do not have any status as legal tender nor can they be used for banking purposes. The country currently imposes a 30% tax on crypto. </p><p>On July 27,<a href=\"https://cointelegraph.com/news/cryto-india-supreme-court-union-gov-crypto-regulations\"> India’s Supreme Court reprimanded</a> the Union government for the lack of crypto regulations. It pushed the government to reveal if it has any plans for upcoming regulations of digital currencies due to<a href=\"https://cointelegraph.com/news/crypto-p2p-scams-india\"> a rise in criminal activities</a> involving cryptocurrencies.</p><p>Rafique said he thinks regulators there are beginning to separate Web3 from centralized financial (CeFi). \"They're more concerned about venues that have fiat on-ramps, which we do but we don't offer it in India,\" he said.</p><blockquote>\" Once India comes up with a regulatory framework for crypto then we would like to be the front runners.\"</blockquote><p>While OKX plans to hire on-the-ground staff in India, Indian cryptocurrency exchanges CoinSwitch and CoinDCX have recently <a href=\"https://cointelegraph.com/news/coinswitch-coindcx-indian-crypto-exchanges-coin-switch-coin-dcx-cut-staff-amid-bear-market\">had to lay off staff </a>at the hands of the current market slump. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-01T09:31:23.000Z",
    "title": "StarkWare, Herodotus launch tech to verify data from any point in Ethereum's history ",
    "url": "https://cointelegraph.com/news/stark-ware-herodotus-launch-tech-to-verify-data-from-ethereum-blockchain",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/02f40006-5eb8-45a8-a300-d0665ce5cd5c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Storage Proofs could prove useful for services like account recovery tapping into the ability to access and verify historical Ethereum data. </p>\n                    <p><p>A new zero-knowledge proof (<a href=\"https://cointelegraph.com/explained/zero-knowledge-proofs-explained\">ZK-proof</a>) technology is set to improve the ability to access and verify historical data from the Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) blockchain, with deep chain validation cited as a usability barrier of the network.</p><p>Technology firm Herodotus has released its on-chain accumulator which uses storage proof cryptography, allowing users to verify data from any point of Ethereum’s blockchain without the need of a third-party. The solution makes use of StarkWare’s STARK proving, the ZK-proof technology co-invented by mathematician Eli Ben-Sasson.</p><p>StarkWare presented Herodotus with a custom built instance of its shared prover service SHARP, which enables advanced scaling efficiency using <a href=\"https://medium.com/starkware/recursive-starks-78f8dd401025\" target=\"_blank\" rel=\"noopener nofollow\">recursive proofs</a>. The latter allows for a virtual machine to provide “proofs of proofs”, by generating proofs of transactions or blocks in parallel and real time and batching them into a subsequent proof.</p><p><a href=\"https://cointelegraph.com/news/more-tps-less-gas-ethereum-layer-2-starknet-outlines-performance-upgrades\"><strong><em>Related: More TPS, less gas: Ethereum L2 Starknet outlines performance upgrades</em></strong></a></p><p>At a slightly more technical level, the accumulator acts as a cache that stores block headers. If the accumulator has a header in its cache, the respective storage proof computation can use it for validation. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/a9fb83c6-21f9-473a-9f89-84999bf178be.png\"  /><figcaption style=\"text-align: center;\">A visual representation of the possible use of recursive proofs to batchs a variety of information into subsequent verified and cached proofs. Source: StarkWare.</figcaption></figure><p>If the header is not cached, then the prover has to generate a proof to cover the requested block range, add the block header to the accumulator and then complete the requested storage proof computation.</p><p>As the name suggests, the on-chain accumulator essentially accumulates proofs that roll-up prior proofs, drastically reducing the time it takes to verify the Ethereum blockchain and associated data at any point in the network’s history.</p><p>Herodotus chief technology officer Marcello Bardus notes that the technology removes the need to traverse the entire blockchain on the blockchain itself:</p><blockquote>“We can do it off chain, generate an accumulator and just cherrypick one specific block without iterating from the entire chain on the chain itself.”</blockquote><p>Starkware notes that Storage Proofs could prove to be groundbreaking as an alternative to cross-chain bridges that need to rely on third-party oracles to track and verify data. </p><p><a href=\"https://cointelegraph.com/news/starknet-overhauls-cairo-programming-language-to-drive-developer-adoption\"><strong><em>Related: StarkNet overhauls Cairo programming language to drive developer adoption</em></strong></a></p><p>Herodotus co-founder Kacper Koziol added that the accumulator is an innovation that Ethereum has long needed to align with blockchain principles of transparency and accessibility. The technology will essentially allow any use to access any point in Ethereum’s history.</p><blockquote>“This will be very powerful. For the first time in the history of blockchains people are going to be able to prove the correctness of any aspect of anyone’s on-chain information.”</blockquote><p>The two teams highlight the potential for storage proofs to build “Web2 equivalent applications” tapping into the pioneering ability to access and verify Ethereum blockchain data autonomously. </p><p>Account recovery is touted as one potential use case, where the ability to verify on-chain data could be used to trigger a proverbial dead man’s switch, or to automate insurance protocols that use historical on-chain events to trigger smart contract payouts.</p><p><em>Magazine: <a href=\"https://cointelegraph.com/magazine/recursive-inscriptions-bitcoin-supercomputer-defi-aws-possible/\">Recursive inscriptions: Bitcoin ‘supercomputer’ and BTC DeFi coming soon</a></em></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-01T09:16:35.000Z",
    "title": "Exploits, hacks and scams stole almost $1B in 2023: Report",
    "url": "https://cointelegraph.com/news/exploits-hacks-and-scams-stole-almost-1b-in-2023-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/dfc77cf9-6ed9-4fdd-8107-5ebaf6898068.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cybersecurity firm CertiK reported that as of August, over $997 million was lost to flash loan attacks, exit scams and exploits in 2023.</p>\n                    <p><p>Malicious actors targeting the crypto space have taken more than $45 million in digital assets from their victims in the month of August alone and a total of $997 million year-to-date (YTD), according to a report shared by the blockchain security firm CertiK.</p><p>In the report, CertiK <a href=\"https://twitter.com/CertiKAlert/status/1697187776641249518\" target=\"_blank\" rel=\"noopener nofollow\">highlighted</a> that exit scams took around $26 million, flash loan attacks took $6.4 million and exploits took $13.5 million from their victims in August 2023. The cybersecurity firm confirmed that the total losses amounted to over $45 million.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/87d2e69c-96fd-47da-b2ca-651777fbd511.png\"  /><figcaption style=\"text-align: center;\"><em>Major incidents that happened in August. Source: CertiK</em></figcaption></figure><p>CertiK pointed out that some of the major incidents that contributed to the amount lost include the <a href=\"https://cointelegraph.com/news/zunami-protocol-confirms-stablecoin-pools-attacked-in-exploit\">Zunami Protocol attack</a>, which led to $2.2 million in losses; the <a href=\"https://cointelegraph.com/news/defi-protocols-exactly-harbor-hacked-separate-attacks\">Exactly Protocol exploit</a>, which took $7.3 million; and the PEPE (<a href=\"https://cointelegraph.com/pepe-price-index\">PEPE</a>) <a href=\"https://cointelegraph.com/news/rogue-pepecoin-team-members-blamed-for-pepe-multsig-withdrawal\">withdrawal incident</a>, which led to $13.2 million in losses.</p><p>According to CertiK, more than $997 million has been lost to exploits, hacks and scams in 2023 so far. This includes around $261 million lost to flash loan attacks, over $137 million lost to exit scams and more than $596 million lost to exploits. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/certik-drops-findings-on-alleged-scammer-who-stole-1m-in-crypto\"><strong><em>CertiK drops findings on alleged scammer who stole $1M in crypto</em></strong></a></p><p>While the losses in August are still high, the amount is significantly lower compared to the losses incurred in the previous month. In July 2023, <a href=\"https://cointelegraph.com/news/crypto-market-loses-486m-in-july-most-since-2022-report\">around $486 million in total losses</a> were recorded by Web3 data outlet De.Fi, with <a href=\"https://cointelegraph.com/news/multichain-mpc-bridge-sees-millions-in-outflows-exploit-feared\">the Multichain exploit</a> alone contributing around $231 million to the total amount lost. </p><p>With various factors at play, Multichain officially <a href=\"https://cointelegraph.com/news/multichain-stops-operations-over-lack-of-funds\">announced the halting of its operations</a> on July 14. The team cited a lack of funding for operations and a lack of alternative sources of information as the reasons for its shutdown. According to the team, it was unable to contact the CEO since he was taken into custody by Chinese authorities.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/3-4-billion-bitcoin-popcorn-tin-silk-road-hacker/\"><strong><em>$3.4B of Bitcoin in a popcorn tin — The Silk Road hacker’s story</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-09-01T09:32:02.000Z",
    "title": "OKX plans to enter India, hire local employees for Web3 exploration ",
    "url": "https://cointelegraph.com/news/okx-plans-to-enter-india",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/5e5a9e82-d08f-476a-a605-d1c83daf730c.jpg\"></p><p>The CMO of OKX says the company is looking into its entrance in the Indian market through hiring local employees and “understanding the culture.”  </p>\n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-01T09:10:56.000Z",
    "title": "Jais to Empower Arabic’s Digital Future Through Generative AI",
    "url": "https://www.cryptopolitan.com/jais-to-empower-arabics-digital-future/",
    "description": "With its rich history and widespread significance, Arabic has long held a prominent place in the world. As one of the most widely spoken languages, it is a cornerstone of global cultural, religious, and diplomatic interactions. However, its representation in the digital realm has been disproportionately low, hindering its potential to flourish in the modern ... <a title=\"Jais to Empower Arabic&#8217;s Digital Future Through Generative AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/jais-to-empower-arabics-digital-future/\" aria-label=\"More on Jais to Empower Arabic&#8217;s Digital Future Through Generative AI\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-01T09:18:22.000Z",
    "title": "Shiba Inu Ecosystem Flourishes with 698,421 Transactions and 634,461 Wallets as Billion-Dollar Giants Build on Shibarium",
    "url": "https://www.crypto-news-flash.com/shiba-inu-ecosystem-flourishes-with-698421-transactions-and-634461-wallets-as-billion-dollar-giants-build-on-shibarium/",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shibarium\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/shiba-inu-coin-6766779-2048x1152.jpg 2048w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Shibarium has seen remarkable resilience, with 600,000 wallets engaging in over 700,000 transactions within a week. The SHIB community continues its efforts to reduce the circulating supply, with a significant increase in token burns by 151 percent in the past 24 hours. Approximately 600,000 wallets have engaged in over 700,000 transactions on the Shibarium network [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-01T09:36:04.000Z",
    "title": "Crypto PASSIVE INCOME upto 35%",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/crypto-passive-income-upto-35/",
    "description": "<p>Smart money always gets in the earliest to great projects. And it sucks for us little guys, right? I mean how can we compete with a16z or Pantera Capital? We can’t. So we can’t earn what they do. But, there are some early smart money opportunities we DO have access to now. One of crypto’s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/crypto-passive-income-upto-35/\">Crypto PASSIVE INCOME upto 35%</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-01T09:15:55.000Z",
    "title": "Here’s How High Bitcoin Could Surge if a Spot ETF Gets Approved, According to Top Crypto Analyst",
    "url": "https://dailyhodl.com/2023/09/01/heres-how-high-btc-could-surge-if-a-spot-bitcoin-etf-gets-approved-in-the-us-according-to-top-crypto-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/High-BTC-Could-Surge.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/High-BTC-Could-Surge.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/High-BTC-Could-Surge.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/High-BTC-Could-Surge.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/High-BTC-Could-Surge.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/High-BTC-Could-Surge.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/High-BTC-Could-Surge.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A top crypto trader is revealing his forecast for the flagship crypto asset if a hotly anticipated Bitcoin (BTC) investment product gets the regulatory nod. Pseudonymous analyst DonAlt tells 53,000 subscribers of the TechnicalRoundup YouTube channel that Bitcoin could rally modestly if a spot BTC exchange-traded fund (ETF) is authorized in the United States. &#8220;If [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/01/heres-how-high-btc-could-surge-if-a-spot-bitcoin-etf-gets-approved-in-the-us-according-to-top-crypto-analyst/\">Here’s How High Bitcoin Could Surge if a Spot ETF Gets Approved, According to Top Crypto Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]