[
  {
    "source": "Crypto Daily",
    "date": "2023-07-12T03:23:39.000Z",
    "title": "LBank Exchange Lists Three New Tokens",
    "url": "https://cryptodaily.co.uk/2023/07/lbank-exchange-lists-three-new-tokens",
    "description": "<p>Road Town, BVI., July 12th, 2023, Chainwire</p><p>As a leading digital asset exchange, LBank is focused on providing its users with quality tokens to trade. This week it is listing three new assets: SFL, AGF, and USHA.</p><p></p><p>On July 10, LBank listed SFL, the native token of Shuffle. Shuffle is an O2O hybrid blockchain-based mobile payment solution operated by THE HUMANPLUS Inc., a system integration and development company headquartered in Seoul, Korea. Shuffle is striving to create new economic opportunities by connecting FinTech and blockchain. SFL is its mainnet coin, with the network based on a fork of EVMOS.</p><p>On the same day, LBank listed AGF, a Sharia-compliant utility token targeting the Halal economy and based on gold assets. This ERC20 token is geared at the market of 2 billion people in the halal economic zone. It will operate as an Asian economic token that will be developed in cooperation with the Indonesian government and the Indonesian royal family.</p><p>On July 16, the next asset to be listed on LBank will be USHA. uShark (USHA) is striving to become the cryptocurrency equivalent of Nasdaq, serving as a universal exchange for numerous companies worldwide in the angel, pre-seed, and seed stages, while offering exceptional opportunities for its investors.</p><p>For the week running from July 3-9, LBank listed multiple tokens including GPX, WOOO, and BOBO. The latter climbed 92% after opening for trading on LBank. DOGE20, another new asset, also did well, climbing 25% in a week, while VMPX soared an impressive 47%. Other newly listed assets that hit the ground running include SHIB2 (73%), PIG2 (52%), WPEPE, and PENDLE (86%). Finally, last week saw LBank list LBR (63%), LINA (103%), TYPE (an incredible 24,864%) and Naxion&rsquo;s NXN.</p><p>About LBank</p><p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge growing platform that ensures the integrity of users' funds and aims to contribute to the global adoption of cryptocurrencies.</p><p>Start Trading Now: lbank.com</p><p>Community &amp; Social Media:&nbsp;</p><p>&nbsp;Telegram l Twitter l&nbsp;&nbsp;Facebook l&nbsp;LinkedIn l&nbsp;Instagram l&nbsp;YouTube</p><p>&nbsp;</p>ContactLBK Blockchain Co. Limitedmarketing@lbank.info"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-12T03:30:52.000Z",
    "title": "Russia’s Central Bank: BRICS Currency Requires Consent of Many Parties, Faces Implementation Challenges",
    "url": "https://news.bitcoin.com/russias-central-bank-brics-currency-requires-consent-of-many-parties-faces-implementation-challenges/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/bank-of-russia-brics-currency-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Russia’s Central Bank Chief Says BRICS Currency Requires Consent of Many Parties — Expects Implementation Challenges\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/bank-of-russia-brics-currency-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/bank-of-russia-brics-currency-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/bank-of-russia-brics-currency-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/bank-of-russia-brics-currency-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/bank-of-russia-brics-currency-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/bank-of-russia-brics-currency-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/bank-of-russia-brics-currency.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The governor of Russia&#8217;s central bank says the creation of a common BRICS currency &#8220;requires the consent of many parties.&#8221; While emphasizing that the proposed BRICS currency “deserves attention,” the Russian central bank chief cautioned that this project is challenging and “will be quite difficult to implement.” Bank of Russia Governor on BRICS Currency Bank [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-12T03:09:53.000Z",
    "title": "Bitcoin Bulls Keep Pushing, Why BTC Could Soon Attempt To Surpass $31K",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-bulls-keep-pushing-31k/",
    "description": "Bitcoin price is moving higher above the $30,500 level. BTC is showing signs of a fresh move toward the $31,000 resistance zone. Bitcoin is slowly moving higher above the $30,500 support zone. The price is trading above $30,400 and the 100 hourly Simple moving average. There is a key bullish trend line forming with support near $30,500 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could rise further toward the $31,000 resistance and then $31,400. Bitcoin Price Holds Ground Bitcoin price remained stable above the $30,000 support zone. A base was formed and BTC started a decent increase above the $30,200 level. The price was able to spike a couple of times above the 50% Fib retracement level of the downward move from the $31,020 high to the $30,215 low. However, the bears seem to be active near the $30,700 resistance zone. There is also a key bullish trend line forming with support near $30,500 on the hourly chart of the BTC/USD pair. Bitcoin price is now trading above $30,400 and the 100 hourly Simple moving average. Immediate resistance on the upside is seen near the $30,720 level. It is close to the 61.8% Fib retracement level of the downward move from the $31,020 high to the $30,215 low. Source: BTCUSD on TradingView.com The next resistance is near the $31,000 zone, above which the price could gain bullish momentum. In the stated case, BTC might rise toward the $31,400 resistance. The next major resistance is near the $32,000 level. Any more gains could open the doors for a move toward the $32,500 resistance zone. Another Decline in BTC? If Bitcoin’s price fails to clear the $30,700 resistance, it could start another decline. Immediate support on the downside is near the $30,500 level and the trend line. The next major support is near the $30,300 level and the 100 hourly Simple moving average, below which there could be a drop toward the $30,000 support zone. Any more losses might send the price toward the $29,850 level in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $30,500, followed by $30,300. Major Resistance Levels – $30,700, $31,000, and $31,400."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-12T03:23:44.000Z",
    "title": "LBank Exchange Lists Three New Tokens",
    "url": "https://www.crypto-news-flash.com/lbank-exchange-lists-three-new-tokens/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-exchange-lists-three-new-tokens",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/this_week_20230710_1689095676oNxnCX1TwM.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/this_week_20230710_1689095676oNxnCX1TwM.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/this_week_20230710_1689095676oNxnCX1TwM-300x180.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/this_week_20230710_1689095676oNxnCX1TwM-1024x614.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/this_week_20230710_1689095676oNxnCX1TwM-768x461.jpeg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Road Town, BVI., July 12th, 2023, Chainwire As a leading digital asset exchange, LBank is focused on providing its users with quality tokens to trade. This week it is listing three new assets: SFL, AGF, and USHA. On July 10, LBank listed SFL, the native token of Shuffle. Shuffle is an O2O hybrid blockchain-based mobile [...]"
  }
]