[
  {
    "source": "CoinDesk",
    "date": "2023-07-05T08:07:48.000Z",
    "title": "Binance Australia’s Offices Searched by Financial Regulator: Bloomberg",
    "url": "https://www.coindesk.com/policy/2023/07/05/binance-australias-offices-searched-by-financial-regulator-bloomberg/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The company, also under investigation in the U.S. and France, ceased its Australian derivatives business following regulatory warnings"
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-05T07:53:44.000Z",
    "title": "Crypto Custodian Cobo Argus Scores $100M in Value Locked One Week After Going Live",
    "url": "https://www.coindesk.com/business/2023/07/05/crypto-custodian-cobo-argus-scores-100m-in-value-locked-one-week-after-going-live/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Argus V2 supports all open-source DeFi protocols and lets traders utilize DeFi bots to automatically monetize farming rewards, compounding and token swapping."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T08:18:04.000Z",
    "title": "South Africa to mandate crypto exchange licenses by year-end: Report",
    "url": "https://cointelegraph.com/news/crypto-exchange-licences-south-africa-by-year-end",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/7c892a9e-5fe1-4421-b56f-5d86aea4e1e9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>South Africa reportedly becomes the first country on the continent to require that digital asset exchanges secure licenses.</p>\n                    <p><p>South Africa's financial regulator has announced that all crypto exchanges in the country will be required to obtain licenses by the end of the year, according to a report by Bloomberg.</p><p>Financial Sector Conduct Authority (FSCA) Commissioner Unathi Kamlana stated that the FSCA has received approximately 20 license applications since its recent opening, and expects more before the November 30 deadline, Bloomberg reported. </p><p>Kamlana further mentioned that if crypto exchanges continue to operate without a license after the deadline, the regulator intends to take \"enforcement action,\" which may involve fines or closure of the non-compliant firms, according to the report.</p><p>The report quoted Kamlana as saying that introducing a regulatory framework for crypto products is a sensible approach due to the potential risk of serious harm to financial customers. According to Bloomberg, he expressed the need for time to determine the effectiveness of their measures and assured ongoing collaboration with the industry to refine and implement necessary changes.</p><p>This initiative means South Africa becomes the first country on the continent to require that digital asset exchanges secure licenses as crypto regulators and policymakers around the world continue to tighten the regulation belt around cryptocurrency.</p><p>The move affects several major trading venues that originated from South Africa, including Luno, owned by Digital Currency Group and Pantera-backed VALR. Global platforms such as Binance that operate in the country will also need to secure licenses.</p><p>The FSCA has been involved in crypto and fintech regulations, collaborating with an \"inter-governmental fintech working group\" consisting of major financial sector regulators and policymakers, including the National Treasury and the South African Reserve Bank.</p><p>The trend of intensifying regulations is not confined to South Africa alone. On July 3, the Monetary Authority of Singapore (MAS) announced that crypto service providers in Singapore are <a href=\"https://cointelegraph.com/news/singapore-to-require-crypto-firms-to-put-user-assets-into-trusts-by-year-end\">required to place customer assets into a statutory trust</a> by the end of the year for secure storage. This action underscores a global shift towards more stringent regulation in the cryptocurrency sector. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-exchange-roqqu-receives-south-african-approval-to-expand-operations\"><strong><em>Crypto exchange Roqqu receives South African approval to expand operations</em></strong></a></p><p>Cointelegraph has reached out to the FSCA for more information on this development and is yet to receive feedback at the time of publication.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-senegal-why-how-african-country-using-btc/\"><strong><em>Bitcoin in Senegal: Why is this African country using BTC?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-05T07:50:22.000Z",
    "title": "Bitcoin analysis agrees BTC price may stall at $35K",
    "url": "https://cointelegraph.com/news/bitcoin-analysis-btc-price-stall-35k",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/6a0467da-cc53-4396-9e4b-41db8e343245.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC price will have trouble breaking above $35,000, various analysts warn, as major resistance appears on Binance.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) bulls face a tough task to bring BTC price action past $35,000, fresh analysis predicts.</p><p>In its latest market <a href=\"https://qcp.capital/market-updates/market-update-5-jul-23/\" target=\"_blank\" rel=\"noopener nofollow\">update</a> on July 5, trading firm QCP Capital flagged the mid-$30,000 range as a potential cooling-off point for the Bitcoin bull market.</p><h2>Bitcoin homes in on post-FTX rally peak</h2><p>With BTC price stagnating around $30,000, <a href=\"https://cointelegraph.com/news/bitcoin-traders-breakout-28k-dip-btc-price-stalls\">concerns are mounting</a> that the majority of its gains have already materialized.</p><p>The area between $35,000 and $40,000 is now particularly popular among market participants seeking to catch a local top, and QCP is one of them.</p><p>“Tactically (short-term), our favoured trade to play this is selling end-Sep 33k to 35k calls, and using the premiums to buy 30k puts,” it summarized about its plans for H2 trading.</p><p>QCP highlighted incoming resistance for the moving average convergence/divergence (MACD) indicator — designed to measure price strength at given levels during a market trend — at $35,000.</p><p>“The top-side levels work well as any rally from here would be considered the ending 5th wave from the November FTX lows,” it continued. </p><blockquote>“The 33-35k level is also where we see wedge resistance as well as MACD hitting 3-year triangle resistance.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/0eb15ee1-b146-4ab1-842b-1e1a381991a5.jpg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD charts with MACD triangle. Source: QCP Capital</em></figcaption></figure><p>The update also referenced a cooling macroeconomic environment potentially offering few volatility cues for markets.</p><p>The United States Federal Reserve remains hawkish, and officials have maintained that further interest rate hikes will come this year despite inflation showing a consistent downtrend.</p><p>“On the macro side, the Fed looks locked into another hike this month (although this is largely priced by markets), and inflation appears likely to stagnate around 3-4% until year-end, with positive base effects from the oil price decline ending this quarter, and high frequency rent prices turning back up,” it explained.</p><blockquote>“This means that while falling inflation has been getting the market excited, for the Fed with their 2% inflation target blinkers on - its close but probably still not enough for rate cuts.”</blockquote><p>When it comes to the principal catalyst for BTC price strength over the past month — the potential U.S. approval of the first Bitcoin spot-based exchange-traded fund (ETF) — there is likewise no imminent decision due, QCP added.</p><h2>$30 million Binance ask sparks concerns</h2><p>Elsewhere, traders on the day continually raised the possibility of a fresh BTC price correction.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-price-analyst-32-5-k-launchpad-btc\">Bitcoin analyst flags $32.5K launchpad zone for BTC price</a></em></strong></p><p>William Clemente, a co-founder of Reflexivity Research, revealed data showing that futures traders were far from universally bullish on Bitcoin.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">&quot;Everyone is bullish&quot; <br><br>Quarterly futures basis says otherwise <a href=\"https://t.co/eXRa36LwS2\">pic.twitter.com/eXRa36LwS2</a></p>&mdash; Will Clemente (@WClementeIII) <a href=\"https://twitter.com/WClementeIII/status/1676349470945030144?ref_src=twsrc%5Etfw\">July 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Keith Alan, a co-founder of monitoring resource Material Indicators, said he was “expecting a pullback” as a new block of resistance appeared on the Binance order book at $36,000.</p><p>“Not sure bulls will make it to $36k, but don’t think this rally is over yet. I could be wrong. Watching charts for clues,“ part of the commentary <a href=\"https://twitter.com/KAProductions/status/1676257086282293248\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> alongside a chart showing the $30 million ask wall.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/394085da-b676-4138-bf84-296def112708.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD order book data on Binance. Source: Keith Alan/Twitter</em></figcaption></figure><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> showed BTC/USD trading near $30,800 at the time of writing.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/a5269bd7-4bd7-4c26-9c45-4b880b0a1914.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\">How smart people invest in dumb memecoins: 3-point plan for success</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-05T08:36:38.000Z",
    "title": "Binance Australia searched in probe of former derivatives activities",
    "url": "https://cryptoslate.com/binance-australia-searched-in-probe-of-former-derivatives-activities/",
    "description": "<p>Binance Australia has come under further regulatory scrutiny, with a particular focus on its former derivatives activities, as reported by Bloomberg on July 4. Bloomberg reported that the Australian Securities and Investments Commission (ASIC), an integrated regulator for the country&#8217;s financial markets, searched various Binance Australia locations on the day of the report. The probe [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-australia-searched-in-probe-of-former-derivatives-activities/\">Binance Australia searched in probe of former derivatives activities</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-05T07:50:00.000Z",
    "title": "Law Firm Bills Voyager $5 Million In Legal Fees For March-May",
    "url": "https://cryptodaily.co.uk/2023/07/law-firm-bills-voyager-5-million-in-legal-fees-for-march-may",
    "description": "<p>McDermott Will &amp; Emery, the law firm representing Voyager&rsquo;s committee of unsecured creditors, has sent the group a staggering bill of over $5 million for the work it has done between the months of March and May.</p>\n<p>The latest bill reinforces the perception in crypto circles that legal firms are raking in the money at the expense of the creditors they are representing.</p>\nA Hefty Legal Bill\n<p>The bill for legal services provided by the law firm was revealed in a legal filing submitted to the United States Bankruptcy Court of New York&rsquo;s Southern District on the 3rd of July, 2022. The latest bill brings the total compensation charged to the group of creditors to over $16 million, significantly above the $11.2 million initially budgeted as part of the restructuring process. The creditors have so far paid $8.9 million in legal fees to the firm. According to the filing, the blended hourly rate for all timekeepers stands at $1026.76.</p>\n<p>Some of the biggest areas of billing from attorneys of McDermott Will &amp; Emery for the stipulated months in question include $1 million billed for nearly 917 hours of work on plan and disclosure settlement. This includes discussing sale options with debtors, meeting potential buyers, and examining objections that other stakeholders have presented. In previous fee periods, significant work was carried out on plan and disclosure settlement during a potential sale of Voyager assets to FTX. However, this deal collapsed when FTX itself filed for bankruptcy. This legal bill comes over, and above a $1.1 million bill that Voyager paid to the law firm Kirkland &amp; Ellis for work it completed when representing the exchange.</p>\nLaw Firms Make Merry\n<p>The market downturn has led to many crypto firms going bankrupt, something that has been highly profitable for law firms. Voyager itself had filed for bankruptcy in 2022 after the firm revealed it had considerable exposure to Three Arrows Capital, the collapsed crypto hedge fund. Voyager then tried to broker deals with several entities, including FTX and Binance. However, the FTX deal fell through after the Sam Bankman-Fried-led exchange filed for Chapter 11 bankruptcy. The FTX bankruptcy was the largest bankruptcy in the crypto industry thus far.</p>\n<p>Following these developments, Binance backed out of the potential deal in April 2023, citing a hostile regulatory climate prevailing in the United States, thanks to the position taken on crypto by current United States Securities and Exchange Commission (SEC) Chair Gary Gensler. The United States Bankruptcy Court for the Southern District of New York approved a liquidation plan for Voyager which would see its customers being reimbursed $1.33 billion in digital assets.</p>\n<p>The entire legal process has resulted in Voyager having to spend a fortune on legal fees. Last week, reports emerged that Kirkland &amp; Ellis, the law firm representing Voyager, charged the company $1.1 million for work it had completed in April of this year.</p>\nOne Man&rsquo;s Loss Is Another&rsquo;s Gain\n<p>The crypto winter, which started with the de-pegging of Terra&rsquo;s algorithmic stablecoin UST and the collapse of its entire ecosystem, set off a domino effect in the crypto space. As a result of the collapse, the contagion spread, leading to the collapse of several prominent crypto entities. This list includes Vauld, Celsius, Hodlnaut, BlockFi, Voyager, and FTX, entities that were considered leading lights in the crypto space.</p>\n<p>Lawyers and legal firms have taken full advantage, making a significant amount from the beleaguered firms in the form of legal fees. In December 2022, lawyers representing bankrupt crypto lender Celsius, one of the first casualties of the crypto winter, billed the firm nearly $53 million in legal fees for the period beginning since the firm filed for bankruptcy until October of the same year. Celsius had filed for Chapter 11 in Mid-July, 2022.</p>\n<p>FTX, the biggest casualty of the crypto winter, has run up a legal bill of over $200 million since the time it filed for bankruptcy in November 2022. It is also worth noting that FTX going bankrupt impacted over 130 entities that were affiliated with the exchange.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T08:00:45.000Z",
    "title": "AI Is The Most Profound Platform Shift That Can Positively Impact People’s Lives, Google Report",
    "url": "https://www.cryptopolitan.com/ai-is-the-most-profound-platform-shift/",
    "description": "The rise of artificial intelligence (AI) represents the most profound technological shift of our time, with far-reaching implications for all aspects of life. Google asserts in a ground-breaking report. According to the report, AI has the potential to drive the UK&#8217;s economy to new heights, turbocharging growth and adding £400 billion by 2030, with an ... <a title=\"AI Is The Most Profound Platform Shift That Can Positively Impact People&#8217;s Lives, Google Report\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-is-the-most-profound-platform-shift/\" aria-label=\"More on AI Is The Most Profound Platform Shift That Can Positively Impact People&#8217;s Lives, Google Report\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T08:00:00.000Z",
    "title": "Is Shiba Memu a Good Investment? Five Reasons Investors Are Rushing To Get In Early",
    "url": "https://www.cryptopolitan.com/is-shiba-memu-a-good-investment-five-reasons-investors-are-rushing-to-get-in-early/",
    "description": "Presale cryptos can be as tempting as a litter of puppies, with investors being drawn to the cuteness and not thinking about everything involved in owning a dog — or in this case, investing in crypto. However, no presale crypto presale has generated as much early buzz as Shiba Memu, as the project plans to ... <a title=\"Is Shiba Memu a Good Investment? Five Reasons Investors Are Rushing To Get In Early\" class=\"read-more\" href=\"https://www.cryptopolitan.com/is-shiba-memu-a-good-investment-five-reasons-investors-are-rushing-to-get-in-early/\" aria-label=\"More on Is Shiba Memu a Good Investment? Five Reasons Investors Are Rushing To Get In Early\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T07:56:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-05T07:46:31.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? The current price of WazirX is $0.0987. Over the past 24 hours, it has seen a trading volume of $1.30M and its market cap stands at $38.03M. Despite its market dominance being 0.00%, the WRX price has experienced a 0.32% increase in the last 24 hours. ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-05T08:37:44.000Z",
    "title": "Addressing Fraud and Innovation: Finding a Balance in Belarus’ Crypto Landscape",
    "url": "https://nulltx.com/addressing-fraud-and-innovation-finding-a-balance-in-belarus-crypto-landscape/",
    "description": "The decision by Belarus to ban peer-to-peer (P2P) crypto transactions in an effort to combat fraud raises concerns about stifling innovation in the cryptocurrency space. While it is important to address fraudulent activities, it is equally important to foster an environment that encourages technological advancements and supports legitimate use cases for cryptocurrencies. Instead of resorting [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-05T08:15:46.000Z",
    "title": "STORJ price skyrockets amid recent market-wide recovery",
    "url": "https://crypto.news/storj-price-skyrockets-amid-recent-market-wide-recovery/",
    "description": "Storj (STORJ) has moved downward over the past 19 months. With the recent altcoin bull run, it could recover back to the top 150 assets on CoinMarketCap. STORJ hit an all-time high (ATH) of $3.9 in March 2021 — currently&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-05T07:55:18.000Z",
    "title": "What’s Next For Bitcoin Price? Bulls Aren’t Running Out Of Steam Yet",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-bulls-arent-running-out-of-steam/",
    "description": "After Bitcoin reached a new yearly high at $31,413, the buy side has so far failed to initiate a trend-following move north. Although the bulls fended off a sell-off last Friday in the wake of the SEC&#8217;s perceived concerns over a Bitcoin spot ETF approval, the momentum seems to be increasingly flattening, or isn&#8217;t it? What&#8217;s Next For The Bitcoin Price? As the market awaits an approval from the Security and Exchange Commission (SEC) regarding a spot Bitcoin exchange-traded fund (ETF), investors are seemingly exercising caution. While open interest in the Bitcoin futures market continues to rise, activity in the spot market has recently declined. This shift indicates that price action in recent days has been primarily influenced by futures traders. Analyst @52Skew noted on Twitter, &#8220;$BTC Spot CVDs &#38; Delta: Quite a bit of spot still being dumped on the market + no limit chasing today from coinbase buyers. Spot bid liquidity $30.5K.&#8221; Related Reading: Bitcoin Bulls Stampede: Bitfinex Report Points To Early Signs Of Bull Market This observation underscores the reluctance of investors in the spot market who may be waiting for a decisive move by the SEC. However, it should be noted that US markets were closed yesterday for the 4th of July holiday. Most recently, huge spot buying volume came from Coinbase, pushing the market up. So today will be interesting to watch if yesterday&#8217;s retracement is bought today by US investors. Bitcoin dominance, which had risen to resistance at 52.15%, has now consolidated somewhat, dropping to 51.25%. This consolidation, combined with the entry of investors into the altcoin sector, reinforces the prevailing wait-and-see attitude among investors. Analyzing the Bitcoin price, it is clear that the market is currently facing strong resistance in the $31,300 to $31,416 range. The support area at $30,700 is currently proving to be a critical mark to watch. Holding above this support could give buyers the opportunity to launch a renewed offense. If the Bitcoin price can break out dynamically above the year-to-date high, the next major chart hurdle awaits at $32,500. Yet, a temporary retracement to the support area at $29,800 could be acceptable to gain momentum for the next breakout attempt. Related Reading: 75% Of Bitcoin Supply Now In Profit, Will A Drop Happen Here? So far, the bears have lacked follow-through. The sell side also failed in its attempt to sell off the BTC price in the higher time frames back below the psychologically important $30,000 level in recent days. The goal of the bears must be to push Bitcoin permanently below $29,800. Experts Remain Bullish For Now Renowned analyst Josh Rager believes the pullbacks won&#8217;t be as deep as many experts expect, suggesting that ETF approval, particularly from BlackRock, is a real possibility. He says, &#8220;Only an ETF rejection can cause pain, but I think BlackRock will be approved this time,&#8221; adding: The $24k, then up sentiment seems to be quite popular. I think people are overthinking it. Similar was said about Bitcoin needing to sweep $20k first. IMO, pullbacks won&#8217;t be this deep now and if we manage to see $25k again it won&#8217;t be until later on in the year after more upside before so. Similarly, NewsBTC lead analyst Tony &#8220;The Bull&#8221; believes in the bullish case for BTC in the near term. However, he stresses the importance of Bitcoin&#8217;s Relative Strength Index (RSI) entering overbought territory, as a failure to do so could indicate a lack of strong upside momentum: I want to see Bitcoin RSI push into overbought conditions by week end, or else I worry that this isn&#8217;t an impulse yet. We have a doji on the weekly, which signals indecision. We need to see follow through this week, or more correction becomes more probable w/ possible bear div. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-05T08:30:35.000Z",
    "title": "Hong Kong Government to Launch Stablecoin to Challenge Tether, USD Coin, Binance USD, and TrueUSD",
    "url": "https://www.crypto-news-flash.com/hong-kong-government-to-launch-stablecoin-to-challenge-tether-usd-coin-binance-usd-and-trueusd/?utm_source=rss&utm_medium=rss&utm_campaign=hong-kong-government-to-launch-stablecoin-to-challenge-tether-usd-coin-binance-usd-and-trueusd",
    "description": "<img width=\"1920\" height=\"1272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/hong-kong-376777_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/hong-kong-376777_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/hong-kong-376777_1920-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/hong-kong-376777_1920-1024x678.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/hong-kong-376777_1920-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Hong Kong to launch a stablecoin pegged to the region&#8217;s dollar in a bid to compete and challenge the dominance of the US dollar. This comes in response to several calls on the government to create a stablecoin to leverage its numerous benefits.  In a bid to seal its leadership in the crypto and blockchain [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-05T08:00:48.000Z",
    "title": "Will InQubeta (QUBE) Surpass Ethereum (ETH) in Price? Analysts Think So",
    "url": "https://www.crypto-news-flash.com/will-inqubeta-qube-surpass-ethereum-eth-in-price-analysts-think-so/?utm_source=rss&utm_medium=rss&utm_campaign=will-inqubeta-qube-surpass-ethereum-eth-in-price-analysts-think-so",
    "description": "<img width=\"512\" height=\"336\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-05T104453.916.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-05T104453.916.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-05T104453.916-300x197.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-05T104453.916-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-05T104453.916-214x140.jpg 214w\" sizes=\"(max-width: 512px) 100vw, 512px\" />After the massive initial success of InQubeta’s beta presale, crypto analysts are anticipating it will surpass Ethereum in price by 2025.  InQubeta (QUBE) has emerged as the biggest trend in the AI industry, creating headlines and attracting the attention of crypto lovers and expert investors. This has generated buzz among enthusiasts, with many hedging their [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-05T07:52:03.000Z",
    "title": "Bitcoin Holds Steady Above $30,750 as BlackRock Refiles for Bitcoin ETF with Coinbase as New Partner – When Will BTC Price Reach a New ATH of $100,000?",
    "url": "https://www.crypto-news-flash.com/bitcoin-holds-steady-above-30750-as-blackrock-refiles-for-bitcoin-etf-with-coinbase-as-new-partner-when-will-btc-price-reach-a-new-ath-of-100000/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-holds-steady-above-30750-as-blackrock-refiles-for-bitcoin-etf-with-coinbase-as-new-partner-when-will-btc-price-reach-a-new-ath-of-100000",
    "description": "<img width=\"2560\" height=\"1633\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-3137984-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-3137984-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-3137984-300x191.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-3137984-1024x653.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-3137984-312x198.jpg 312w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />The bullish sentiment around Bitcoin remains strong among investors but liquidity remains a major concern. Last week, the Bitcoin investment products saw inflows of $123 million with short-Bitcoin products seeing net outflows. After hitting its 2023 high earlier this week on July 3, the world&#8217;s largest cryptocurrency Bitcoin (BTC) has been holding strongly above the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-05T07:45:31.000Z",
    "title": "Shiba Inu: SHIB to Skyrocket by 550% as Burning Rate Explodes and Shibarium Launch Inches Closer",
    "url": "https://www.crypto-news-flash.com/shiba-inu-shib-to-skyrocket-by-550-as-burning-rate-explodes-and-shibarium-launch-inches-closer/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-shib-to-skyrocket-by-550-as-burning-rate-explodes-and-shibarium-launch-inches-closer",
    "description": "<img width=\"600\" height=\"285\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Shiba-Inu-price-rally.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Shiba-Inu-price-rally.jpeg 600w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/Shiba-Inu-price-rally-300x143.jpeg 300w\" sizes=\"(max-width: 600px) 100vw, 600px\" />SHIB, the popular meme coin, is predicted to decrease its decimal places significantly by 2025, with experts foreseeing a rise in value to approximately $0.00004930. SHIB&#8217;s price has shown volatility, characterized by sudden surges influenced by hype and market sentiment. Currently trading at $0.000007638, it experienced a 2.06% daily surge but a weekly decline of [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-05T08:23:36.000Z",
    "title": "How to Earn Crypto Setting up Your Node?",
    "url": "https://www.altcoinbuzz.io/masternode/how-to-earn-crypto-setting-up-your-node/",
    "description": "<p>In today’s crypto world, there are a ton of ways to make money. You can trade anything from altcoins to NFTs. You could dabble in derivatives, futures, and options. On top of that, you could stake your altcoins for a nice yearly return. Or you could deposit your altcoins as collateral or liquidity for similar [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/masternode/how-to-earn-crypto-setting-up-your-node/\">How to Earn Crypto Setting up Your Node?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-05T07:54:02.000Z",
    "title": "A Fundamental Analysis of Litecoin (LTC)",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/a-fundamental-analysis-of-litecoin-ltc/",
    "description": "<p>The Litecoin project was developed by computer scientist Charles Lee and other members of the Bitcoin community. The project was launched to address some of the perceived shortcomings of the Bitcoin blockchain.  Litecoin (LTC) is a peer-to-peer cryptocurrency. It seeks to enable fast transactions at low rates. Litecoin differs from Bitcoin in several areas. For [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/a-fundamental-analysis-of-litecoin-ltc/\">A Fundamental Analysis of Litecoin (LTC)</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-05T08:32:47.000Z",
    "title": "APT and ARB May Topple Other New Coins: Crypto Analyst",
    "url": "https://coinedition.com/apt-and-arb-may-topple-other-new-coins-crypto-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-5.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-5.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-5-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-5-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-5-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-5-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-5-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-5-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-5-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-5-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-5-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-5-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-5-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-5-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-5-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-5-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/PRICE-A-5-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Popular analyst and founder of MN Trading Michaël van de Poppe told his 660,000 followers that Arbitrum (ARB) and Aptos (APT) may be the biggest gainers of the next bull cycle. According to the analyst, the narrative around new cryptocurrencies could play a big role in the move. Although ARB and APT are newly-launched cryptocurrencies, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/apt-and-arb-may-topple-other-new-coins-crypto-analyst/\">APT and ARB May Topple Other New Coins: Crypto Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-05T08:10:22.000Z",
    "title": "BTC’s Next Challenge at $31K May Result in a Breakout: Trader",
    "url": "https://coinedition.com/btcs-next-challenge-at-31k-may-result-in-a-breakout-trader/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/BTC-71.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/BTC-71.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/BTC-71-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/BTC-71-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/BTC-71-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/BTC-71-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/BTC-71-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/BTC-71-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/BTC-71-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/BTC-71-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/BTC-71-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/BTC-71-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/BTC-71-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/BTC-71-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/BTC-71-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/BTC-71-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/BTC-71-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The crypto trader and educator Michael Pizzino noted in a tweet yesterday that Bitcoin (BTC) failed to break above $31K again. In addition, he stated that the past 100 days in the stock market have been lackluster with nothing more than “minor reversals.” As a result, the trader speculated that it is only a matter [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/btcs-next-challenge-at-31k-may-result-in-a-breakout-trader/\">BTC’s Next Challenge at $31K May Result in a Breakout: Trader</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]