[
  {
    "source": "Decrypt",
    "date": "2024-03-01T21:46:07.000Z",
    "title": "Minecraft Banned NFTs—So ‘NFT Worlds’ Built Its Own Crypto Game Instead",
    "url": "https://decrypt.co/219923/minecraft-banned-nfts-worlds-built-crypto-game-instead",
    "description": "NFT Worlds was forced to pivot away from Minecraft, but now called Hytopia, the project is about to launch the game on its own chain."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-01T22:00:06.000Z",
    "title": "Crypto losses hit $67 million in February, pushing yearly losses to $200 million – Immunefi",
    "url": "https://cryptoslate.com/crypto-losses-hit-67-million-in-february-pushing-yearly-losses-to-200-million-immunefi/",
    "description": "<p>Crypto industry losses amounted to $67 million in February over 12 incidents, with hacks accounting for 97.54% of funds stolen, according to Immunefi&#8217;s latest crypto losses report. Meanwhile, the remaining 2.46% of the funds stolen were lost due to fraud. Despite the significant losses during the month, there was a notable decrease compared to January [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/crypto-losses-hit-67-million-in-february-pushing-yearly-losses-to-200-million-immunefi/\">Crypto losses hit $67 million in February, pushing yearly losses to $200 million – Immunefi</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-01T22:06:18.000Z",
    "title": "Google Cloud Integrates AI into Data Analytics Strategies",
    "url": "https://www.cryptopolitan.com/google-cloud-integrates-ai-in-data-analytics/",
    "description": "Google strategically enhances its data analytics capabilities by placing artificial intelligence (AI) at the forefront of its plans to bridge the gap between structured and unstructured data. Gerrit Kazmaier, Vice President and General Manager for Database, Data Analytics, and Looker at Google Cloud, asserts that AI is set to play a pivotal role in extracting [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-01T21:58:41.000Z",
    "title": "Elon Musk sues OpenAI and Sam Altman over agreement breach",
    "url": "https://www.cryptopolitan.com/elon-musk-sues-openai-sam-altman-breach/",
    "description": "Elon Musk, the visionary entrepreneur behind companies like SpaceX and Tesla, finds himself embroiled in a legal battle with OpenAI and its CEO, Sam Altman. Musk contends that OpenAI has strayed from its original mission of advancing open-source artificial general intelligence (AGI) for the betterment of humanity. This legal dispute has unfolded in the Superior [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-01T21:50:14.000Z",
    "title": "Bitcoin analyst says bulls entering the market are late",
    "url": "https://www.cryptopolitan.com/bitcoin-analyst-bulls-entering-bitcoin-late/",
    "description": "In recent weeks, Bitcoin (BTC) has experienced a remarkable surge, climbing over 40% within just four weeks and inching tantalizingly close to its previous all-time high of nearly $69,000. Such a dramatic rise often attracts short-term traders and speculators eager to capitalize on the momentum. Bitcoin analyst chides latecomers Many of these traders, who may [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-01T21:42:19.000Z",
    "title": "Portal’s gaming token hits $425 million in market cap",
    "url": "https://www.cryptopolitan.com/portals-token-hits-425-million-in-market-cap/",
    "description": "A highly anticipated gaming token and cross-chain platform known as Portal made its debut recently, amid excitement from airdrop participants and Binance token stakers. The token, named PORTAL and built on the Ethereum blockchain, initially hit the market at $2.54 per token, with approximately 167 million tokens available, representing about 17% of the total supply [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-01T21:40:15.000Z",
    "title": "Market Projections Global AI Set to Surpass $1 Trillion by 2030 Driven by Deep Learning Innovation",
    "url": "https://www.cryptopolitan.com/market-global-ai-set-to-surpass-1-trillion/",
    "description": "Market projections signal a surge in Artificial Intelligence (AI), propelling the global AI market to surpass the remarkable $1 trillion mark by 2030, as indicated by the latest findings from Research and Markets. The comprehensive analysis illuminates pivotal industry trends, forecasting a substantial Compound Annual Growth Rate (CAGR) of 33.81% between 2024 and 2030. The [&#8230;]"
  }
]