[
  {
    "source": "CryptoSlate",
    "date": "2023-05-31T09:37:08.000Z",
    "title": "US lawmakers introduce bill to prevent digital dollar pilot program",
    "url": "https://cryptoslate.com/us-lawmakers-introduce-bill-to-prevent-digital-dollar-pilot-program/",
    "description": "<p>U.S. lawmaker Alex Mooney has introduced a new bill, the Digital Dollar Pilot Prevention Act, which aims to ban the government from launching a pilot program to test central bank digital currency (CBDC) operability in the country. The lawmaker&#8217;s website stated that the bill was explicitly developed to close the pilot program loophole. This means [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/us-lawmakers-introduce-bill-to-prevent-digital-dollar-pilot-program/\">US lawmakers introduce bill to prevent digital dollar pilot program</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-31T09:34:42.000Z",
    "title": "Data suggests bull run for bitcoin despite the price decline",
    "url": "https://crypto.news/data-suggests-bull-run-for-bitcoin-despite-the-price-decline/",
    "description": "Bitcoin (BTC) has been moving in uncertainties as the exchange reserves started declining in the first week of May. New data, however, suggests that a bull run might be on the way for the digital gold. According to data from&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-31T09:13:14.000Z",
    "title": "Bybit becomes the latest crypto company to leave Canada",
    "url": "https://crypto.news/bybit-becomes-the-latest-crypto-company-to-leave-canada/",
    "description": "Major crypto derivatives exchange Bybit has decided to cease offering its products and services to customers in Canada, with the company stating that it would leave the Canadian market.  Bybit informed new and existing users in Canada that the company&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-31T09:11:41.000Z",
    "title": "XRP Flows Strong With 13% Gain, Fueled By Bullish Market Indicators",
    "url": "https://www.newsbtc.com/news/xrp-flows-strong-with-13-gain/",
    "description": "Ripple&#8217;s XRP is once again in the spotlight as it stages a remarkable comeback. In a surprising turn of events, XRP has tallied a decent 13% rally, leaving investors and enthusiasts impressed by its resurgence.  This sudden surge in value can be attributed to an array of bullish market indicators that have reignited optimism among traders and reignited interest in the digital asset.  As XRP bounces back with vigor, it signals a potential shift in the tides for this cryptocurrency, prompting speculation about its future trajectory in the ever-evolving world of digital currencies. Related Reading: Shiba Inu Price Faces Dilemma As New Addresses Take Conflicting Positions XRP Surges With Price Rally, Record-Breaking Network Activity Riding the wave of a promising price of $0.523726 on CoinGecko, Ripple&#8217;s XRP cryptocurrency has ignited excitement with a remarkable 24-hour rally of 6.3% and an impressive seven-day rally of 12.7%. However, the surge in price is not the only aspect fueling the enthusiasm surrounding XRP, as recent network activity has reached unprecedented levels. Source: Coingecko According to Santiment&#8217;s tweet, the blockchain has experienced a significant spike in daily active addresses. In fact, XRP recently witnessed its second-largest address activity day in its history, with over 490,000 addresses actively engaging with the network. The last time such a substantial increase in activity occurred was back in March, which resulted in a staggering price rally of over 45%. 😮 #XRPNetwork has now had its 2nd &#38; 3rd largest address activity spikes of all time these past 2 days. A mild +4% decoupling has emerged between $XRP &#38; the #altcoin pack, and if history repeats itself from the March 18th activity spike, it could be more. https://t.co/601m4SYUOy pic.twitter.com/AF8k4qtPQv — Santiment (@santimentfeed) May 30, 2023 The combination of a bullish price action and this surge in network activity has set the stage for heightened anticipation, prompting speculation about the potential implications for XRP&#8217;s future trajectory in the dynamic landscape of cryptocurrencies. XRP has a market cap of a little over $26 billion as of today. Chart: TradingView.com Bulls Take The Reins The current rally is bolstered by a broader positive sentiment in the cryptocurrency market. As Bitcoin and other major cryptocurrencies experience their own upward momentum, XRP has been able to benefit from the overall bullish market trend. This alignment of positive market factors has created a fertile ground for XRP&#8217;s price rally to flourish. Related Reading: Pepecoin Eyes Rebound As It Finds Support In Strong Algorithm Data Score The surge in XRP&#8217;s price and the accompanying market indicators have reignited discussions about the future trajectory of this digital asset. While it is essential to remain cautious and consider the inherent volatility of the cryptocurrency market, the recent bullish developments surrounding XRP have injected renewed optimism among its supporters. XRP Market Sentiment Improves Over the past week, there’s also been a noticeable improvement in sentiment surrounding XRP. The weighted sentiment of the token has experienced an uptick, reflecting an increase in confidence among investors and participants in the cryptocurrency market. Additionally, the social volume of XRP has also witnessed a rise, indicating a growing level of engagement and discussions surrounding the token. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk) -Featured image from Elephango"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-31T09:37:35.000Z",
    "title": "Litecoin (LTC) Achieves Massive Milestone as Anticipation Builds for Halving Event and Potential Price Surge",
    "url": "https://www.crypto-news-flash.com/litecoin-ltc-achieves-massive-milestone-as-anticipation-builds-for-halving-event-and-potential-price-surge/?utm_source=rss&utm_medium=rss&utm_campaign=litecoin-ltc-achieves-massive-milestone-as-anticipation-builds-for-halving-event-and-potential-price-surge",
    "description": "<p>Litecoin (LTC) is experiencing massive network growth as key players brace themselves for the upcoming Litecoin halving.  Halving is expected to push Litecoin’s price up to new highs, Litecoin (LTC) addresses have begun to skyrocket.  The Litecoin network has been on fire this month. As the halving draws near, it appears that the adoption for [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/litecoin-ltc-achieves-massive-milestone-as-anticipation-builds-for-halving-event-and-potential-price-surge/\">Litecoin (LTC) Achieves Massive Milestone as Anticipation Builds for Halving Event and Potential Price Surge</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-05-31T09:32:50.000Z",
    "title": "Beginner’s Guide to Kusama Network",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/beginners-guide-to-kusama-network/",
    "description": "<p>We cover a lot of projects to give our readers a broad view of the market. With a bull market anticipated anytime soon, we realized that some of our new readers might need an introduction to some projects. So, we&#8217;ve been doing a guide to good projects. These guides are not investment advice. Instead, they [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/beginners-guide-to-kusama-network/\">Beginner&#8217;s Guide to Kusama Network</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-31T09:15:29.000Z",
    "title": "Two Crypto Sectors Will Reward Those Who Pay Attention, Says DeFi Veteran Arthur Cheong",
    "url": "https://dailyhodl.com/2023/05/31/two-crypto-sectors-will-reward-those-who-pay-attention-says-defi-veteran-arthur-cheong/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Those-Who-Pay-Attention.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Those-Who-Pay-Attention.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/Those-Who-Pay-Attention.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Those-Who-Pay-Attention.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/Those-Who-Pay-Attention.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/Those-Who-Pay-Attention.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/Those-Who-Pay-Attention.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Two crypto sectors are thriving despite tepid market conditions, according to venture capitalist Arthur Cheong. Cheong, the founder of DeFiance Capital, tells his 147,500 Twitter followers that liquid staking and decentralized derivatives exchanges are worth paying attention to. &#8220;There are two sectors in crypto that are still growing rapidly despite the slow market conditions. Those [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/31/two-crypto-sectors-will-reward-those-who-pay-attention-says-defi-veteran-arthur-cheong/\">Two Crypto Sectors Will Reward Those Who Pay Attention, Says DeFi Veteran Arthur Cheong</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]