[
  {
    "source": "Cointelegraph",
    "date": "2023-08-08T18:54:05.000Z",
    "title": "Why is Bitcoin price stuck?",
    "url": "https://cointelegraph.com/news/why-is-bitcoin-price-stuck",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/afc8ec08-4768-417a-a371-a46442344ea8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin price is stuck today, but several data points suggest it won’t be for too much longer</p>\n                    <p><p>The price of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is stuck, fluctuating inside a narrow trading range with futures markets remaining flat nearing all-time lows. </p><h2>Why is Bitcoin price stuck?</h2><p>Bitcoin price is going through an unusually calm period, with several volatility indicators reaching near-record lows. Currently, Bitcoin price is up nearly 2% hitting an intraday high of $29,735, but the upward BTC price move remains within the flat market trend where the price has been trading in the <a href=\"https://cointelegraph.com/news/bitcoin-spot-selling-btc-price-dips-below-28-7k\">$28,670</a> – $31,000 range.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/3694db98-d917-4dd0-b22c-6095fd95a28d.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">Bitcoin price. Source: <a href=\"https://www.tradingview.com/\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a></figcaption></figure><p>Let’s dig into a few reasons why Bitcoin price is stuck in its current tight range.</p><h2>Bitcoin price sees record-low volatility</h2><p>While Bitcoin has had similar periods of sideways trading during the 2016 and 2019 cycles, the realized volatility of 2023 has reached multi-year lows. The 1-year realized volatility metric hit levels not witnessed for Bitcoin price since December 2016.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/9f4d8b48-f19e-4a6e-822d-12c91d491675.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin price realized volatility. Source: Glassnode</em></figcaption></figure><p>Lowered realized volatility is coinciding with muted BTC futures and options trading volume. Bitcoin derivatives are not the only major crypto asset approaching all-time lows in volume. Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) derivatives markets fell below Jan. 2023 lows in August. With Bitcoin only seeing $19 billion in aggregate derivatives trade volume, it is nearing the Jan. 2023 low. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/5d6e826b-cef5-48f8-a1ce-4f13e16796f2.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin and Ether derivatives trade volume. Source: Glassnode</em></figcaption></figure><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/btc-price-cpi-volatility-collapses-5-things-bitcoin\"><strong><em>BTC price meets CPI as volatility ‘collapses’ — 5 things to know in Bitcoin this week</em></strong></a></p><h2>What’s next for Bitcoin price?</h2><p>From a technical standpoint, Bitcoin’s market price is holding above multiple key long-term moving averages. The trend follows similar patterns of previous Bitcoin cycles. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/17d4b60a-3d20-45db-8322-c2084525883b.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin pricing models. Source: Glassnode</em></figcaption></figure><p>Despite the current low volatility and condensed range of Bitcoin price, Conor Ryder the head of research and data at Ethena Labs does not expect it to last long. Ryder told Cointelegraph,</p><blockquote>“Market depth for BTC is pushing yearly lows, and in periods of low liquidity, we tend to see more short-term volatility, both to the upside and the downside. As always, we have to step back and examine the bigger picture. Looking further ahead, the setup for a rally as we head into the next BTC is halving is certainly there. All the fundamentals are looking positive when examined on a longer timeframe, and coupled with the potential of a spot ETF approval, sentiment could definitely pick up. But until then, I expect there to be periods of boring market action alongside some illiquidity-induced short-term moves.”</blockquote><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-08T18:42:36.000Z",
    "title": "Prosecutors will still consider Sam Bankman-Fried's alleged campaign finance scheme at trial",
    "url": "https://cointelegraph.com/news/prosecutors-consider-sam-bankman-fried-alleged-campaign-finance-scheme-trial",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/f2b269a6-7f26-482d-85f2-7420b76742d1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Rather than reinstating a count on campaign finance violations to SBF’s indictment, the Justice Department said it will consider the evidence as part of a wire fraud charge.</p>\n                    <p><p>The United States Attorneys’ offices has announced another superseding indictment against former FTX CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried</a> (SBF) which will include considering an allegedly illegal campaign finance scheme.</p><p>In an Aug. 8 letter to Judge Lewis Kaplan, U.S. Attorney Damian Williams <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590939/gov.uscourts.nysd.590939.195.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the Department of Justice plans to pursue seven charges against SBF in its trial scheduled to begin in October. Though the DoJ said it was “prevented by its treaty obligations to the Bahamas” in adding an eighth count to SBF’s indictment on violations of campaign finance law, prosecutors would consider evidence of the alleged scheme as part of an existing wire fraud charge.  </p><p>“The superseding indictment will make clear that Mr. Bankman-Fried remains charged with conducting an illegal campaign finance scheme as part of the fraud and money laundering schemes originally charged,” said Williams. “The defendant’s use of customer deposits to conduct a political influence campaign was part of the wire fraud scheme charged in the original indictment. And as part of the originally charged money laundering scheme, the defendant also concealed the source of his fraudulent proceeds through political straw donations.”</p><p>Bankman-Fried was arrested in the Bahamas in December 2022 and later extradited to the U.S. to face charges related to the collapse of crypto exchange FTX. DoJ officials originally announced eight charges against the former FTX CEO, then added another five in separate superseding indictments in February and March 2023. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-beind-bald-memecoin-base-conspiracy\"><strong><em>Is SBF secretly behind BALD? Crypto Twitter debates latest conspiracy</em></strong></a></p><p>The charge involving illegal campaign donations — part of the original eight — was dropped in July after prosecutors <a href=\"https://cointelegraph.com/news/sam-bankman-fried-campaign-contribution-charge-dropped-by-prosecutors\">agreed with a defense motion</a> that it was not a part of the extradition agreement with the Bahamas. Bankman-Fried’s first trial with the seven charges will begin in October 2023, while a second trial with five <a href=\"https://cointelegraph.com/news/sam-bankman-fried-pleads-not-guilty-to-bribery-charges-from-superseding-indictment\">charges from the superseding indictments</a> is scheduled to start in March 2024.</p><p>Since his arraignment, Bankman-Fried has largely been confined to his parents’ California home on a $250-million bond. However, prosecutors are <a href=\"https://cointelegraph.com/news/doj-seeks-sbf-bail-revocation-over-tampering-diary-leak-allegations\">seeking to revoke his bail</a> after he spoke to New York Times reporters and provided details from former Alameda Research CEO Caroline Ellison’s private journals in an alleged attempt to intimidate her. Ellison, Bankman-Fried’s former colleague and girlfriend, will be a witness at his October trial.</p><p>A hearing has been scheduled for Aug. 11 in which Judge Kaplan will hear arguments regarding the U.S. government's motion to revoke SBF's bail.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-08T18:45:38.000Z",
    "title": "Adjusting Bitcoin’s price for US liquidity reveals key indicator for bull run",
    "url": "https://cryptoslate.com/analyzing-bitcoins-correlation-with-the-m1-money-supply/",
    "description": "<p>The M1 money supply, a key economic indicator, represents the total amount of physical currency in circulation, including coins, notes, traveler&#8217;s checks, and demand deposits. Essentially, it measures an economy&#8217;s liquidity and the public&#8217;s spending power. In the context of the cryptocurrency market, comparing Bitcoin&#8217;s spot price to the M1 money supply provides an interesting [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/analyzing-bitcoins-correlation-with-the-m1-money-supply/\">Adjusting Bitcoin&#8217;s price for US liquidity reveals key indicator for bull run</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-08T19:06:19.000Z",
    "title": "Chainlink’s Price Feeds Land on Base, Bringing More Precise Crypto Pricing",
    "url": "https://cryptobriefing.com/chainlinks-price-feeds-land-on-base/?utm_source=feed&utm_medium=rss",
    "description": "Chainlink's industry-standard Price Feeds find a new home in Base's layer-2 blockchain for DeFi ecosystem's growth potential."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T18:59:12.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain‘s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T18:42:22.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and platform they need to build blockchain solutions. At this time, we can only make educated guesses about ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T18:41:18.000Z",
    "title": "Worldcoin Price Prediction 2023 – 2030: How High Will WLD Go?",
    "url": "https://www.cryptopolitan.com/worldcoin-price-prediction/",
    "description": "Worldcoin, spearheaded by OpenAI chief Sam Altman,&#160;launched&#160;on Monday, 24 July 2023, after years in development, promising to verify users’ identity by iris-scanning and potentially solving one of the more pressing problems posed by recent advances in artificial intelligence. When it surged in price as an opening salvo, there was a flurry of criticisms about it, ... <a title=\"Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/worldcoin-price-prediction/\" aria-label=\"More on Worldcoin Price Prediction 2023 &#8211; 2030: How High Will WLD Go?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-08T18:49:27.000Z",
    "title": "More crypto traders tracking BNB, Litecoin, Pomerdoge",
    "url": "https://crypto.news/more-crypto-traders-tracking-bnb-litecoin-pomerdoge/",
    "description": "More traders are analyzing BNB, Litecoin, and Pomerdoge amid the ongoing presale of POMD"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-08T19:00:07.000Z",
    "title": "HBAR Token Scores Impressive Gains As Major Cryptos Nosedive",
    "url": "https://www.newsbtc.com/news/hbar-token-scores-impressive-gains-as-major-cryptos-nosedive/",
    "description": "Hedera Hashgraph’s native cryptocurrency, HBAR, is shining following the slight boost in the crypto market today, August 8. Hedera briefly broke through the one-month-long $0.5 resistance, climbing above $0.6, while top coins like Bitcoin bleed with losses. Even though the overall crypto market cap gain affected many assets positively, HBAR owes most of its gains to the latest ecosystem developments and partnerships. HBAR Price Performance Amid Impressive Ecosystem Updates Despite a drop in trading volume, HBAR has soared over 6%, attaining a peak of $0.06032 on Tuesday morning. This sharp spike represents a nearly 10% increase from the day low of $0.05483. But the token has now receded from its peak value and currently trades at $0.05951.  Related Reading: Valkyrie Unveils Double-Barreled Approach To Launch An Ethereum ETF Alongside A Bitcoin ETF Moreover, the HBAR price has soared over 16% in a week, bucking the bearish trend that snatched all of Bitcoin and Ethereum’s past week’s gains. The token’s value is now over 22% higher than the price recorded 30 days ago. However, HBAR&#8217;s trading volume is south of its price trajectory. The over 16% decline in 24-hour trading volume raises questions about whether the bulls had reached saturation and capitulated to the bears even before the rally grew strong. Strategic Partnerships Drive HBAR&#8217;s Rally Hedera’s network advancements and strategic partnerships have helped to boost HBAR&#8217;s current market position. In August, the Hedera network recorded notable deals with leading banking and financial institutions and automobile companies.  On August 2, Korean automobile firms Hyundai and KIA announced the launch of a new blockchain and AI-powered Supplier co2 Emission Monitoring System (SCEMS) on the Hedera network. This integration allows Hedera to record the carbon emission data from suppliers while AI will predict future emissions following the data provided.  Similarly, on August 4, Hedera announced a partnership with FreshSupplyCoAu in a groundbreaking move that could reshape the digital finance landscape. The strategic partnership allows users to connect with conventional banking and the Mastercard network for a seamless, safe, and wider range of cross-border payments.  Through Mastercard’s payment gateway, Hedera will connect traditional banking infrastructure with decentralized finance technology, bridging the gap between blockchain and traditional finance. These strategic partnerships mark significant milestones for the network. They could boost HBAR&#8217;s usability and trading activity as more investors adopt the token. This move could amplify HBAR&#8217;s reach and market presence, potentially increasing network activities and the token&#8217;s price. HBAR Market Outlook, Will The Bulls Sustain? Hedera’s dwindling 24-hour trading volume, however, raises questions about the longevity of the ongoing rally since a trading volume decline often signifies bearish market activities.  The HBAR&#8217;s price chart reveals that technical indicators suggest a bearish trend reversal for HBAR as the token trades above the 50-day moving average, confirming the bullish momentum on its price today.  But the Relative Strength Index has receded from 62 to 57, demonstrating weakening momentum as buyers exit the market. Related Reading: PayPal’s PYUSD Launch Triggers Calls For Stablecoin Bill Also, the Moving Average Convergence/Divergence has converged with the signal line and now moves below, while the faded green histogram bars have birthed red ones.  This observation shows HBAR could face downturns in the next few hours unless the bulls regain control. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-08T19:03:22.000Z",
    "title": "Dogecoin Popularity on The Rise as Meme King Makes Appearance in Popular TV Show – DOGE Entry Zone Revealed",
    "url": "https://www.crypto-news-flash.com/dogecoin-popularity-on-the-rise-as-meme-king-makes-appearance-in-popular-tv-show-doge-entry-zone-revealed/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-popularity-on-the-rise-as-meme-king-makes-appearance-in-popular-tv-show-doge-entry-zone-revealed",
    "description": "<img width=\"1800\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/stanslavs-Dogecoin3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"dogecoin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/stanslavs-Dogecoin3.jpg 1800w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/stanslavs-Dogecoin3-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/stanslavs-Dogecoin3-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/stanslavs-Dogecoin3-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/stanslavs-Dogecoin3-104x69.jpg 104w\" sizes=\"(max-width: 1800px) 100vw, 1800px\" />Dogecoin makes an interesting appearance in Season 11, Episode 3 of the Futurama TV show.  A popular crypto analyst has advised crypto investors to purchase DOGE at $0.06982. Dogecoin (DOGE) is the latest cryptocurrency to make an appearance in the Futurama show, joining Bitcoin and Ethereum which have on multiple occasions been mentioned in different TV [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-08T18:50:32.000Z",
    "title": "Shiba Inu Witnesses a Massive 2,200% Whale Inflow  – Is a Big SHIB Jump Coming?",
    "url": "https://www.crypto-news-flash.com/shiba-inu-witnesses-a-massive-2200-whale-inflow-is-a-big-shib-jump-coming/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-witnesses-a-massive-2200-whale-inflow-is-a-big-shib-jump-coming",
    "description": "<img width=\"1920\" height=\"1080\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/11/shiba-inu-coin-g61b088f51_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/11/shiba-inu-coin-g61b088f51_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/shiba-inu-coin-g61b088f51_1920-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/shiba-inu-coin-g61b088f51_1920-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/shiba-inu-coin-g61b088f51_1920-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/shiba-inu-coin-g61b088f51_1920-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/shiba-inu-coin-g61b088f51_1920-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/shiba-inu-coin-g61b088f51_1920-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/shiba-inu-coin-g61b088f51_1920-48x27.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Shiba Inu (SHIB) has seen a massive surge in large holders&#8217; inflows in the last seven days. Data from IntoTheBlock shows that the inflows from large holders jumped by more than 2,200%, signifying remarkable growth in recent times. Impact of Shiba Inu Whale Buyup Usually, the large holders&#8217; inflow metric is used to monitor the [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-08T18:45:53.000Z",
    "title": "DeFi Platform Curve Offering $1,850,000 Bounty for Identity of Hacker",
    "url": "https://dailyhodl.com/2023/08/08/defi-platform-curve-offering-1850000-bounty-for-identity-of-hacker/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/defi-curve-bounty.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/defi-curve-bounty.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/defi-curve-bounty.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/defi-curve-bounty.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/defi-curve-bounty.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/defi-curve-bounty.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/defi-curve-bounty.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Curve (CRV) is putting up a bounty to smoke out the hacker who drained the decentralized finance (DeFi) platform of tens of millions of dollars in crypto assets over a week ago. In a note posted on the Ethereum (ETH) blockchain explorer Etherscan, Curve says that it is now offering a $1.85 million bounty to anyone [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/08/defi-platform-curve-offering-1850000-bounty-for-identity-of-hacker/\">DeFi Platform Curve Offering $1,850,000 Bounty for Identity of Hacker</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-08T18:41:05.000Z",
    "title": "Billionaire Mike Novogratz Says Traditional Finance Institutions Reappearing in Crypto Space: Report",
    "url": "https://dailyhodl.com/2023/08/08/billionaire-mike-novogratz-says-traditional-finance-institutions-reappearing-in-crypto-space-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/algorithmic-stablecoins-else.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/algorithmic-stablecoins-else.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/algorithmic-stablecoins-else.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/algorithmic-stablecoins-else.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/algorithmic-stablecoins-else.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/algorithmic-stablecoins-else.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/algorithmic-stablecoins-else.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Galaxy Investment Partners CEO Mike Novogratz believes major traditional financial players are starting to stake their claims on the blockchain. According to a new Bloomberg report, Novogratz says that institutional investors are starting to invest in the crypto markets again after last year&#8217;s major volatility. “Institutions have come back some in the immediate term. They’ve come [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/08/billionaire-mike-novogratz-says-traditional-finance-institutions-reappearing-in-crypto-space-report/\">Billionaire Mike Novogratz Says Traditional Finance Institutions Reappearing in Crypto Space: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]