[
  {
    "source": "Cryptopolitan",
    "date": "2024-01-18T09:24:57.000Z",
    "title": "Thailand SEC updates rules for digital token investments",
    "url": "https://www.cryptopolitan.com/thailand-sec-updates-rules-for-digital-token/",
    "description": "Thailand’s Securities and Exchange Commission (SEC) has recently updated its investment criteria for digital tokens. This revision, effective from January 16, 2024, marks a pivotal shift in the regulatory landscape for digital assets in Thailand, balancing investor protection with market development. Relaxation of investment limits The SEC has removed certain investment limitations that previously applied [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-18T09:32:42.000Z",
    "title": "ETH growth leads Bitcoin as investors deploy $1 billion",
    "url": "https://crypto.news/eth-growth-leads-bitcoin-as-investors-deploy-1-billion/",
    "description": "Ethereum on-chain analysis explores how the drop in selling pressure could amplify ETH price gains in the days ahead."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-18T09:14:24.000Z",
    "title": "Singapore’s MAS cautions investors against buying spot Bitcoin ETFs",
    "url": "https://crypto.news/singapores-mas-cautions-investors-against-buying-spot-bitcoin-etfs/",
    "description": "The Monetary Authority of Singapore has warned retail investors against buying spot Bitcoin ETFs following U.S. approval. The Monetary Authority of Singapore (MAS) has cautioned retail investors in the country against purchasing spot Bitcoin exchange-traded funds (ETFs) following the recent&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-18T09:31:01.000Z",
    "title": "Robinhood Goes Shiba Crazy, Buys 230 Billion SHIB In 24 Hours – Here’s The Scoop",
    "url": "https://www.newsbtc.com/news/robinhood-goes-shiba-crazy-buys-230-billion-shib-in-24-hours-heres-the-scoop/",
    "description": "On the widely-used trading platform Robinhood, Shiba Inu, frequently hailed as the &#8220;Dogecoin slayer,&#8221; has sparked a surge of enthusiasm within the cryptocurrency realm. In a remarkable turn of events, Robinhood amassed a staggering 231 billion tokens within a mere 24 hours, boldly proclaiming its presence in the crypto arena. This surge in popularity, according to crypto enthusiast Lola in her latest analysis, has catapulted SHIB to the coveted third position on Robinhood&#8217;s crypto podium, leaving established players like Litecoin and XRP trailing in its wake. Related Reading: Will X Unleash The Doge? Platform Users Eager To Embrace The Meme Coin Robinhood Stuffs More SHIB To Its Cart The Robinhood platform is not the sole arena where Shiba&#8217;s charm is proving irresistible. Based on insights from the crypto intelligence firm Arkham, in alignment with Lola&#8217;s observations, Robinhood&#8217;s SHIB holdings have expanded significantly to a jaw-dropping 36.684 trillion tokens, with an estimated value of approximately $350 million. My #Robinhood Tweet yesterday shows 36.454 Trillion #SHIB by Robinhood from data provided by Arkham and now in less than 24 hours , they have 36.684 Trillion $SHIB . 231 Billion Shiba INU added on that exchange They are accumulating while #TRADEFI accumulating #Bitcoin… — Lola (@CryptoLollla) January 17, 2024 This data, coupled with information from IntoTheBlock, paints a vivid picture of a full-blown Shiba stampede that is reshaping the crypto landscape. Whales, considered the apex predators in the vast ocean of cryptocurrencies, seem to have fallen head over flippers for the meme coin. IntoTheBlock&#8217;s metric tracking &#8220;Large Holders Netflow&#8221; has recorded an astonishing spike of 1,542%, indicating a substantial accumulation of SHIB by these influential market players. Related Reading: Shibarium Shatters Records: 2 Million Transactions In A Day – Details Whale Appetite Soars This whale enthusiasm extends to a remarkable 181% surge in &#8220;Large Holder Inflow&#8221; and a staggering 551% increase in the &#8220;Whale Activity Index.&#8221; The collective movement of these whales resembles a synchronized swimming routine of the crypto elite, all with their synchronized wallets pointed towards SHIB. Fresh whale wallets accumulated $SHIB, #BIGTIME, $MKR and $RNDR today! 0xF633 withdrew 1.44T $SHIB($13.36M) and 3M #BIGTIME($1.2M) from #Binance and #Gateio in the past 2 days.https://t.co/OkHSaNTFV9 0xAdf5 withdrew 1,075 $MKR($1.9M) from #Binance 4 hours ago.… pic.twitter.com/b83nvDsP8g — Lookonchain (@lookonchain) January 9, 2024 The feeding frenzy intensifies with the emergence of a new Shiba whale, devouring a substantial 1.44 trillion tokens. SHIBUSD currently trading at $0.00000955 on the daily chart: TradingView.com The Robinhood-Shiba rendezvous and the orchestrated dance of the whales suggest a potential boom for the canine coin. Yet, the sustainability of this upward climb remains uncertain. Shiba Inu, with the backing of Robinhood, Arkham, and the formidable whales, is no longer merely chasing Dogecoin&#8217;s tail. It is emphatically staking its claim on the crypto landscape, capturing the attention of the entire world. Will Shiba Inu continue its upward climb? Only time will reveal the answer. Nevertheless, in the unpredictable realm of crypto, this underdog has undeniably earned its place at the table and is unafraid to bare its teeth in the face of potential growth and challenges alike. Featured image from Shutterstock"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-18T09:16:00.000Z",
    "title": "MATIC Dump? Blockchain Firm Accuses Polygon of Suspicious Transfers",
    "url": "https://coinedition.com/matic-dump-blockchain-firm-accuses-polygon-of-suspicious-transfers/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Why-the-MATIC-price-could-fall-toward-0.60-in-October.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"MATIC Dump? Blockchain Firm Accuses Polygon of Suspicious Transfers\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Why-the-MATIC-price-could-fall-toward-0.60-in-October.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Why-the-MATIC-price-could-fall-toward-0.60-in-October-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Why-the-MATIC-price-could-fall-toward-0.60-in-October-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Why-the-MATIC-price-could-fall-toward-0.60-in-October-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Why-the-MATIC-price-could-fall-toward-0.60-in-October-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to ChainArgos, a blockchain intelligence firm, there have been several suspicious flows to exchanges from Polygon. The firm shared details of its allegations in a follow-up thread on X (formerly Twitter), claiming that the Polygon network has not sustained its original token allocation plan. On January 15, the blockchain intelligence firm shared information about [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/matic-dump-blockchain-firm-accuses-polygon-of-suspicious-transfers/\">MATIC Dump? Blockchain Firm Accuses Polygon of Suspicious Transfers</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]