[
  {
    "source": "Decrypt",
    "date": "2023-12-05T23:54:56.000Z",
    "title": "Flying High: Why Bitcoin Fans Are Buzzing About Hitting $42,069",
    "url": "https://decrypt.co/208727/flying-high-why-bitcoin-fans-buzzing-hitting-42069",
    "description": "Bitcoin broke past the fabled meme number this week, sparking hopes that the cryptocurrency might soon ascend to the promised land of $69,420."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-05T23:45:21.000Z",
    "title": "A Law Drafted by ChatGPT Was Unanimously Approved in Brazil",
    "url": "https://cryptobriefing.com/a-law-drafted-by-chatgpt-was-unanimously-approved-in-brazil/?utm_source=feed&utm_medium=rss",
    "description": "A law drafted by ChatGPT was unanimously approved in Brazil, marking a milestone in the history of legislation and artificial intelligence."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-06T00:00:13.000Z",
    "title": "Sleeping Bitcoin Giants Wake Up: Pattern Mirrors 2021 Bull Run",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-giants-pattern-mirrors-2021-bull-run/",
    "description": "On-chain data shows the dormant Bitcoin whales have been becoming active again recently in a fashion that&#8217;s reminiscent of the 2021 bull run. Bitcoin Whales Dormant Since 10+ Years Ago Are Waking Up In a new CryptoQuant Quicktake post, analyst Maartunn has talked about a pattern forming in Bitcoin that looks similar to what happened back in 2021, during the last bull run The indicator of interest here is the amount of Bitcoin being moved on the blockchain that was dormant since at least ten years ago before the transaction took place. Ten years is naturally a very long stretch of time, so whenever wallets holding BTC this old activate again, it&#8217;s always something that ignites discussion in the community. Related Reading: Analyst Says Solana At Risk Of Pullback: Here Is The Target In many cases, coins reach such an old age only because they became lost at some point. A lot of this supply would never be involved in transactions again, because of the wallets carrying them being lost to the point that they can&#8217;t be rediscovered by any means possible. Some of the supply may simply be forgotten about, rather than lost, and might get found once more. When this happens, the finder (who may or may not be the original owner of the coins) could decide to shift the coins immediately, cashing in on them by selling, or perhaps, they may just decide to hold off a bit more, finding the appropriate price timing to offload the Bitcoin. The below chart notes the instances where coins dormant since 10 years ago showed some movement during the past few years. Looks like these old coins have moved again recently &#124; Source: CryptoQuant From the graph, it&#8217;s visible that the Bitcoin bull run back during the first half of 2021 saw many instances where large amounts of such dormant BTC stacks broke their silence. Some of these whales who woke up could have been those who remembered their old BTC wallets after seeing the cryptocurrency making waves on the news, while others might have been those who had already rediscovered their old coins a while back, but had since been waiting for this profitable selling opportunity. The 10 years old coins had mostly remained dormant in the second half of the bull run and the 2022 bear market, making only a few large moves. Among these, two in particular were quite interesting, as they coincided with bottoms in the asset&#8217;s price. Maartunn has highlighted these instances in the chart. According to the analyst, it&#8217;s possible that these were whales who were panic selling after seeing the cryptocurrency decline to the lows. As is apparent from the chart, dormant whale activity has heated up once again recently. &#8220;Looking at the past few months, there have been more than 13 similar transactions. It&#8217;s striking that this is happening during the uptrend, as Bitcoin is rising due to news about the emerging ETF,&#8221; notes Maartunn. The latest of these transactions was just yesterday, when a 1,000 BTC stack more than 10 years old became involved in a move. In a post on X, the same analyst has explained that this whale is a retired miner, as many of the inputs that their wallet received came directly from the network&#8217;s block reward. Related Reading: Crypto Analyst Says It’s “Not Too Late” To Buy Ethereum, Here’s Why It would appear that the latest rally in the cryptocurrency is creating a similar effect as the 2021 bull run, attracting these dormant whales to finally move their coins. BTC Price At the time of writing, Bitcoin is trading around $42,400, up 13% in the past week. The price of the asset appears to have shot up during the last few days &#124; Source: BTCUSD on TradingView Featured image from Todd Cravens on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  }
]