[
  {
    "source": "Decrypt",
    "date": "2023-10-26T12:50:10.000Z",
    "title": "Trezor Safe 3 Review: A Hardware Wallet for Bitcoin Newcomers",
    "url": "https://decrypt.co/202808/trezor-safe-3-review-hardware-wallet-bitcoin-newcomers",
    "description": "The latest addition to Trezor’s lineup is aimed at “new entrants to crypto.” Does it make getting started simple?"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-26T13:01:00.000Z",
    "title": "How Google’s AI legal protections can change art and copyright protections",
    "url": "http://cointelegraph.com/news/google-ai-law-art-copyright",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/57e5382d-531f-4e61-80a2-5b6530d4e54c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Amid myriad legal accusations surrounding its AI services, Google stands its ground, vowing to protect its users.</p>\n                    <p><p>Google has been <a href=\"https://cointelegraph.com/news/google-seeks-dismissal-ai-data-scraping-lawsuit\">facing a wave of litigation recently</a> as the implications of generative artificial intelligence (AI) on copyright and privacy rights become clearer.</p><p>Amid the ever-intensifying debate, Google has not only defended its AI training practices but also <a href=\"https://cointelegraph.com/news/google-protect-users-ai-copyright-accusations\">pledged to shield users</a> of its generative AI products from accusations of copyright violations. </p><p>However, Google’s protective umbrella only spans seven specified products with generative AI attributes and conspicuously leaves out Google’s Bard search tool. The move, although a solace to some, opens a Pandora’s box of questions around accountability, the protection of creative rights and the burgeoning field of AI.</p><p>Moreover, the initiative is also being perceived as more than just a mere reactive measure from Google, but rather a meticulously crafted strategy to indemnify the blossoming AI landscape.</p><h2>AI’s legal cloud </h2><p>The surge of generative AI over the last couple of years has rekindled the age-old flame of copyright debates with a modern twist. The bone of contention currently pivots around whether the data used to train AI models and the output generated by them violate propriety intellectual property (IP) affiliated with private entities.</p><p>In this regard, the accusations against Google consist of just this and, if proven, could not only cost Google a lot of money but also set a precedent that could throttle the growth of generative AI as a whole​. </p><p>Google’s legal strategy, meticulously designed to instill confidence among its clientele, <a href=\"https://www.maginative.com/article/google-to-indemnify-workspace-and-cloud-customers-for-ai-copyright-issues/\" target=\"_blank\" rel=\"noopener nofollow\">stands</a> on two primary pillars, i.e., the indemnification of its training data and its generated output. To elaborate, Google has committed to bearing legal responsibility should the data employed to devise its AI models face allegations of IP violations. </p><p>Not only that, but the tech giant is also looking to protect users against claims that the text, images or other content engendered by its AI services do not infringe upon anyone else’s personal data — encapsulating a wide array of its services, including Google Docs, Slides and Cloud Vertex AI.</p><p>Google has argued that the utilization of publicly available information for training AI systems is not tantamount to stealing, invasion of privacy or copyright infringement. </p><p>However, this assertion is under severe scrutiny as a slew of lawsuits accuse Google of misusing personal and copyrighted information to feed its AI models. One of the <a href=\"https://www.reuters.com/legal/litigation/google-hit-with-class-action-lawsuit-over-ai-data-scraping-2023-07-11/\" target=\"_blank\" rel=\"noopener nofollow\">proposed</a> class-action lawsuits even alleges that Google has built its entire AI prowess on the back of secretly purloined data from millions of internet users.</p><p>Therefore, the legal battle seems to be more than just a confrontation between Google and the aggrieved parties; it underlines a much larger ideological conundrum, namely: “Who truly owns the data on the internet? And to what extent can this data be used to train AI models, especially when these models churn out commercially lucrative outputs?” </p><h2>An artist’s perspective</h2><p>The dynamic between generative AI and protecting intellectual property rights is a landscape that seems to be evolving rapidly. </p><p>Nonfungible token artist Amitra Sethi told Cointelegraph that Google’s recent announcement is a significant and welcome development, adding:</p><blockquote>“Google’s policy, which extends legal protection to users who may face copyright infringement claims due to AI-generated content, reflects a growing awareness of the potential challenges posed by AI in the creative field.”</blockquote><p>However, Sethi believes that it is important to have a nuanced understanding of this policy. While it acts as a shield against unintentional infringement, it might not cover all possible scenarios. In her view, the protective efficacy of the policy could hinge on the unique circumstances of each case. </p><p>When an AI-generated piece loosely mirrors an artist’s original work, Sethi believes the policy might offer some recourse. But in instances of “intentional plagiarism through AI,” the legal scenario could get murkier. Therefore, she believes that it is up to the artists themselves to remain proactive in ensuring the full protection of their creative output.</p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/gaming-immutable-guild-of-guardians-blockchain\">Game review: Immutable’s Guild of Guardians offers mobile dungeon adventures</a></em></strong></p><p>Sethi said that she recently copyrighted her unique art genre, “SoundBYTE,” so as to highlight the importance of artists taking active measures to secure their work. “By registering my copyright, I’ve established a clear legal claim to my creative expressions, making it easier to assert my rights if they are ever challenged,” she added.</p><p>In the wake of such developments, the global artist community seems to be coming together to raise awareness and advocate for clearer laws and regulations governing AI-generated content​​. </p><p>Tools like Glaze and Nightshade have also appeared to protect artists’ creations. Glaze <a href=\"https://towardsai.net/p/machine-learning/paint-pixels-and-plagiarism-the-rise-of-generative-ai-and-the-uncertain-future-of-art#:~:text=There%20have%20been%20recent%20efforts,level%2C%20which%20makes%20it\" target=\"_blank\" rel=\"noopener nofollow\">applies</a> minor changes to artwork that, while practically imperceptible to the human eye, feeds incorrect or bad data to AI art generators. Similarly, Nightshade lets artists <a href=\"https://slashdot.org/story/23/10/24/0057214/new-data-poisoning-tool-lets-artists-fight-back-against-generative-ai\" target=\"_blank\" rel=\"noopener nofollow\">add</a> invisible changes to the pixels within their pieces, thereby “poisoning the data” for AI scrapers.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/894df177-5d97-4eab-a37e-d08c985e29db.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Examples of how “poisoned” artworks can produce an incorrect image from an AI query. Source: MIT</em></figcaption></figure><h2>Industry-wide implications </h2><p>The existing narrative is not limited to Google and its product suite. Other tech majors like Microsoft and Adobe have also made overtures to protect their clients against similar copyright claims.</p><p>Microsoft, for instance, has put forth a robust defense strategy to <a href=\"https://www.legaldive.com/news/microsoft-copilot-user-copyright-legal-indemnification-ip-law/693163/#:~:text=Dive%20Brief%3A%20Microsoft%20says%20it,with%20Microsoft%20President%20Brad%20Smith\" target=\"_blank\" rel=\"noopener nofollow\">shield</a> users of its generative AI tool, Copilot. Since its launch, the company has staunchly defended the legality of Copilot’s training data and its generated information, asserting that the system merely serves as a means for developers to write new code in a more efficient fashion​. </p><p>Adobe has <a href=\"https://www.adobe.com/legal/terms.html\" target=\"_blank\" rel=\"noopener nofollow\">incorporated</a> guidelines within its AI tools to ensure users are not unwittingly embroiled in copyright disputes and is also offering AI services <a href=\"https://news.bloomberglaw.com/artificial-intelligence/adobe-offers-generative-ai-product-with-copyright-protection#:~:text=Adobe%20Inc,images%20from%20a%20prompt\" target=\"_blank\" rel=\"noopener nofollow\">bundled</a> with legal assurances against any external infringements. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ethereum-restaking-blockchain-dangerous/\">Ethereum restaking: Blockchain innovation or dangerous house of cards?</a></em></strong></p><p>The inevitable court cases that will appear regarding AI will undoubtedly shape not only legal frameworks but also the ethical foundations upon which future AI systems will operate. </p><p>Tomi Fyrqvist, co-founder and chief financial officer for decentralized social app Phaver, told Cointelegraph that in the coming years, it would not be surprising to see more lawsuits of this nature coming to the fore: </p><blockquote>“There is always going to be someone suing someone. Most likely, there will be a lot of lawsuits that are opportunistic, but some will be legit.”</blockquote><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-26T12:43:00.000Z",
    "title": "US Q3 GDP growth beats expectations as ECB holds steady",
    "url": "https://cryptoslate.com/insights/us-q3-gdp-growth-beats-expectations/",
    "description": "<p>Quick Take Recent macroeconomic data highlights significant events in the international fiscal landscape. The European Central Bank (ECB) held its gun, maintaining the interest rate at the anticipated 4.5%. This decision, widely expected by the market, maintains a status quo in Europe&#8217;s monetary policy. Notably, the European currency remained relatively stable against the DXY (US [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/us-q3-gdp-growth-beats-expectations/\">US Q3 GDP growth beats expectations as ECB holds steady</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-26T12:40:38.000Z",
    "title": "In a week where every high-volume digital asset is up, stablecoins lead losses with a mere 0.12% decline",
    "url": "https://cryptoslate.com/in-a-week-where-every-high-volume-digital-asset-is-up-stablecoins-lead-losses-with-a-mere-0-12-decline/",
    "description": "<p>In a bullish indicator for the broader cryptocurrency market, six stablecoins have technically led industry losses over the past 7 days, with the largest decline at 0.12%, underscoring the overall strength of the market. The market remains robust, with stablecoins&#8217; high trade volumes highlighting their fundamental role in the crypto ecosystem, holding their peg within [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/in-a-week-where-every-high-volume-digital-asset-is-up-stablecoins-lead-losses-with-a-mere-0-12-decline/\">In a week where every high-volume digital asset is up, stablecoins lead losses with a mere 0.12% decline</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-26T13:04:35.000Z",
    "title": "Peter Brandt foresees Bitcoin’s rocky road to new highs",
    "url": "https://crypto.news/peter-brandt-foresees-bitcoins-rocky-road-to-new-highs/",
    "description": "Veteran trader Peter Brandt believes that although Bitcoin has hit its floor, market participants should prepare for a rocky ascent to a new record high. On Oct. 26, Brandt shared with his 660,000 followers on X, formerly Twitter, that Bitcoin&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-26T12:57:34.000Z",
    "title": "Scaramucci predicts Sam Bankman-Fried will be ‘skinned alive’ at trial",
    "url": "https://crypto.news/scaramucci-predicts-sam-bankman-fried-will-be-skinned-alive-at-trial/",
    "description": "Anthony Scaramucci, founder of SkyBridge Capital, anticipates a challenging criminal trial for Sam Bankman-Fried, predicting that experienced prosecutors will find weaknesses in his defense. In an Oct. 25 interview on CNBC&#8217;s Last Call, Scaramucci expressed his belief that the United&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-26T12:43:02.000Z",
    "title": "Top investors remain bullish on web3 despite crypto winter",
    "url": "https://crypto.news/top-investors-remain-bullish-on-web3-despite-crypto-winter/",
    "description": "Major blockchain investors believe Web3 innovations will drive growth despite Bitcoin crashing, platforms imploding, and capital drying up."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-26T13:00:13.000Z",
    "title": "Anatomy Of A Bull Market: The Bitcoin Roadmap To $70,000",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-roadmap-to-70000/",
    "description": "Through bull and bear rallies, crypto analysts have always given their forecast for where the price of a crypto like bitcoin might end up. Mostly, this is the norm, but one analyst has taken a deeper dive into the coin to give an in-depth analysis of Bitcoin’s upward rally. The analysis touches on multiple indicators, as well as the widespread acceptance that BTC has been gaining recently. Bitcoin Price To $70,000 The analysis shared on TradingView shows a different side of the market that has previously been untapped. The analyst who goes by ArShevelev identifies the period between March and August as the ‘Stealth Phase’, which is likely where most of the accumulation occurred. Related Reading: A Chance At Redemption: Analyst Puts MATIC Price At $1.5 Next, the crypto entered into the ‘EW Channel’ which looks like it served as a bounce-off point for the rally. From here, it has been an easy coasting upward reaching above the $34,000 mark. But this is where things start to get interesting. At this level, the analyst predicts a pullback in the price. This pullback from $34,000 sends the price falling back down to as low as $31,000 before the rally starts up again. The end of this retest leads to the top of the third wave where the price reaches as high as $50,000, before another pullback again. This sent the price back down to the $35,000 mark once more to mark the fourth wave before bouncing up again into the fifth wave. Now, at this point, the analyst sees ‘Media Attention’ entering the game (presumably mainstream and traditional finance media), and the lift-off from this level reaches the $70,000 mark. Roadmap to BTC at $70,000 &#124; Source: Tradingview.com Factors To Drive The Momentum The crypto analyst presents seven major factors that are behind the predicted Bitcoin momentum leading into a bull market. For starters, the first is the same as everyone expects &#8211; the almighty Bitcoin Halving. This event is undoubtedly the most bullish in Bitcoin’s history and a repeat of it is expected to kickstart the bull market. Next on the list is the Impulse Structure and Rising Channel where the analyst believes that the BTC price is “painting a compelling picture on the daily timeframe.” This leads to the Third Wave Speculation as already explained above. The analyst believes the market is in the third wave, with the fourth being a pullback and the fifth leading above $70,000. Fourth on the list is the Wyckoff Accumulation Pattern in which Bitcoin is already showing strength. Then there is the Bollinger Bands Width Squeeze which has dropped to 2014 levels. “This rarity accentuates Bitcoin&#8217;s growth potential, serving as a strong indicator for investors,” ArShevelev says. Related Reading: Shiba Inu Burn Rate Falls 80%, Is It Time To Sell? The sixth factor is the Historical Comparisons where the current price action is compared to previous market trends. The 2023 bear market looks more like the 2015 bear market as the analyst points out, and this could see an almost 100% jump in price as it did in 2015. This would put the Bitcoin price above $50,000. Last but not least is Institutional Interest which has been on the rise lately. Mostly, this has been driven by the enthusiasm around BlackRock, the world’s largest asset manager, filing for a Spot Bitcoin ETF and possibly bringing Bitcoin into its over $8 trillion portfolio. ArShevelev explains that a Spot Bitcoin ETF “promises to be a game-changer” due to its ability to bridge TradFi to crypto and allow more money to flow into Bitcoin. “The ETF&#8217;s advent not only signifies regulatory acknowledgment but also invites a wave of retail participation,” the crypto analyst said. “The anticipation is that as we approach the holiday season, institutional investors will further solidify this upward trajectory.” BTC falls to $34,398 &#124; Source: BTCUSD on Tradingview.com Featured image from The Crypto Basic, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-26T13:00:26.000Z",
    "title": "Maximize Your Portfolio Returns By Holding Bitcoin Spark, MATIC, And LINK",
    "url": "https://www.crypto-news-flash.com/maximize-your-portfolio-returns-by-holding-bitcoin-spark-matic-and-link/?utm_source=rss&utm_medium=rss&utm_campaign=maximize-your-portfolio-returns-by-holding-bitcoin-spark-matic-and-link",
    "description": "Holding cryptocurrencies for long durations has historically been proven to massively reward investors. While major projects like Bitcoin are great assets for investors to hold, newer and less famous utility projects are the ones that give investors massive gains. To bring things to context, utility projects with smaller market capitalization heavily explode in prices as [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-26T12:45:00.000Z",
    "title": "Ripple Eyes U.S. Expansion: Ripple Payments Set to Launch with Uphold Partnership",
    "url": "https://www.crypto-news-flash.com/ripple-eyes-u-s-expansion-ripple-payments-set-to-launch-with-uphold-partnership/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-eyes-u-s-expansion-ripple-payments-set-to-launch-with-uphold-partnership",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-1-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-1-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-1-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-1-1-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ripple is poised to initiate its Ripple Payments services in the U.S., leveraging Uphold for XRP sales within the country. The Ripple-Uphold partnership is a strategic move to bolster Ripple’s cross-border payment services and navigate the complexities of the U.S. market. In an innovative stride, Ripple is on the verge of expanding its Ripple Payments [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-26T13:03:32.000Z",
    "title": "How to Earn Crypto with Yield Farming & Lending",
    "url": "https://www.altcoinbuzz.io/defi/how-to-earn-crypto-with-yield-farming-lending/",
    "description": "<p>There are different types of lending platforms such as Decentralised lending platforms (DLP), Centralized, and Peer-to-Peer (P2P) Lending. The best option on the table is likely to be yield farming or lending. Let&#8217;s start with the former, which offers a way to generate passive income by lending idle cryptocurrencies to a decentralized exchange. In this [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/defi/how-to-earn-crypto-with-yield-farming-lending/\">How to Earn Crypto with Yield Farming &#038; Lending</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-26T12:57:00.000Z",
    "title": "Avalanche (AVAX) Is Primed To Catch Up to BTC, Predicts Analyst",
    "url": "https://coinedition.com/avalanche-avax-is-primed-to-catch-up-to-btc-predicts-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bears Capture AVAX Market After Bulls Fail to Breach $21.84 Resistance\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The cryptocurrency analyst and investor CryptoKaleo shared on X earlier today that the Avalanche (AVAX) and Bitcoin (BTC) trading pair could start making a move upwards soon. According to the post, the pair is starting to bounce off of a bottom on the 4-hour chart. The AVAX/BTC pair rebounded from a low of 0.0002982 BTC [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/avalanche-avax-is-primed-to-catch-up-to-btc-predicts-analyst/\">Avalanche (AVAX) Is Primed To Catch Up to BTC, Predicts Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]