[
  {
    "source": "Decrypt",
    "date": "2023-11-01T18:01:15.000Z",
    "title": "Atari Revives Retro Members Only Jackets for NFT Collectors",
    "url": "https://decrypt.co/203986/atari-revives-retro-members-only-jackets-nft-collectors",
    "description": "Atari is keeping its retro feel while pushing further into blockchain gaming and crypto integrations—and avoiding the \"play-to-earn\" label."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-01T17:54:28.000Z",
    "title": "Price analysis 11/1: BTC, ETH, BNB, XRP, SOL, ADA, DOGE, TON, LINK, MATIC",
    "url": "http://cointelegraph.com/news/price-analysis-11-1-btc-eth-bnb-xrp-sol-ada-doge-ton-link-matic",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/57bb5f3c-871f-4a14-8eda-9e00781b523e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin is struggling to clear the hurdle at $35,000, signaling the possibility of a short-term pullback.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) skyrocketed 28.5% in October, its second-best monthly gain of the year behind the 40% rally in January. After the strong showing in October, the next question on investors’ minds is, could the bullish momentum continue and Bitcoin extend its recovery going forward?</p><p>Bernstein said in a note on Oct. 31 that Bitcoin could <a href=\"https://www.cnbc.com/2023/10/31/bitcoin-could-hit-150000-by-2025-predicts-bernstein.html\" target=\"_blank\" rel=\"noopener nofollow\">rally </a>to $150,000 by 2025. The firm believes that the United States Securities and Exchange Commission will approve a spot Bitcoin exchange-traded fund by the first quarter of 2024 and the ETFs may attract up to 10% of Bitcoin’s circulating supply.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/0d7c2983-7571-49c2-bcae-ddeb006df89a.png\"  /><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>While the long-term looks bullish, the volatility may pick up in the near term. On-chain monitoring resource Material Indicators believes that the <a href=\"https://cointelegraph.com/news/btc-price-36k-fomc-target-bitcoin-uptober\">bullish momentum is weakening</a> and may result in a retest of $33,000 but before that, they anticipate an attempt at $36,000.</p><p>Will Bitcoin break above or below the current range? Could altcoins rally when Bitcoin consolidates?</p><p>Let’s analyze the charts of the top 10 cryptocurrencies to find out.</p><h2>Bitcoin price analysis</h2><p>The bulls tried to propel Bitcoin above $35,280 on Nov. 1 but the bears did not relent. This suggests profit-booking at higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/687817d4-28c5-45c0-a73d-228688b8cec5.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The relative strength index (RSI) is still in the overbought zone, indicating that the consolidation may extend for a few more days. The important level to watch on the upside is $35,280 and on the downside is $33,390.</p><p>If the price breaks below the support, the BTC/USDT pair could drop to the 20-day exponential moving average ($32,012). This level may witness a tough battle between the bulls and the bears.</p><p>On the upside, a break and close above the overhead resistance of $35,280 will signal the resumption of the uptrend. The pair may then climb to $40,000.</p><h2>Ether price analysis</h2><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) has been holding above the breakout level of $1,746 but the bulls are struggling to start the next leg of the uptrend. This suggests that the bears are trying to get back in the game.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/8be71791-7fdb-4589-802f-b9f5d5b84013.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AETHUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The crucial level to watch on the downside is $1,746. If bulls flip this level into support, it will indicate that the sentiment has turned positive. That will enhance the prospects of a break above $1,865. The ETH/USDT pair may then surge to $2,000. The bears are expected to mount a strong defense at this level.</p><p>If bears want to gain the upper hand, they will have to tug the price back below the 20-day EMA ($1,723). That may catch the aggressive bulls on the wrong foot, leading to long liquidation. The pair may then slump to the 50-day SMA ($1,648).</p><h2>BNB price analysis</h2><p>The bulls are finding it difficult to maintain BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) above $230, indicating that buying dries up at higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/9c2983ad-d4b0-4748-8eaa-8877aab745ed.png\"  /><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ABNBUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The BNB/USDT pair has turned down and reached the breakout level of $223. Buyers are likely to defend the zone between $223 and the 20-day EMA ($220). If the price rebounds off this zone, the bulls will again attempt to kick the pair toward the overhead resistance of $235.</p><p>On the contrary, if the price continues lower and breaks below the 20-day EMA, it will suggest that the bears are back in control. The pair may then tumble to the 50-day SMA ($214).</p><h2>XRP price analysis</h2><p>XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) broke and closed above the overhead resistance of $0.56 on Oct. 30. This indicates the start of a new up-move.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/4cd72fa6-3696-49af-bbea-4c651155d3c1.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AXRPUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The 20-day EMA ($0.54) has turned up and the RSI is in the overbought zone, indicating that the bulls have a slight edge. Buyers will try to build upon the advantage and push the price to $0.67.</p><p>Conversely, the bears will try to pull the price back below the breakout level of $0.56 and the 20-day EMA. If they manage to do that, the XRP/USDT pair may fall to the 50-day SMA ($0.52). </p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) has been in a strong recovery. After hesitating for a few days near $34, the bulls asserted their supremacy and rose above the resistance on Oct. 30.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/f889a6eb-98e7-4b53-bc5e-c9c647f5508c.png\"  /><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ASOLUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The buying continued and the bulls overcame the obstacle at the overhead resistance at $38.79 on Nov. 1. If buyers maintain the price above $38.79, the SOL/USDT pair could next attempt a rally to $48.</p><p>While the trend remains up, the overbought levels on the RSI suggest that the rally is overheated in the near term. That may make it difficult for the bulls to continue the up-move. A break and close below $38.79 may tempt short-term traders to book profits. That may sink the pair to $34.</p><h2>Cardano price analysis</h2><p>Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) turned down from the minor resistance at $0.30 on Oct. 31, indicating that the short-term traders are booking profits.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/eb064f23-b29e-414b-9da8-39ff56e0ed70.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AADAUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The nearby support on the downside is the 20-day EMA ($0.28). Buyers are expected to defend this level with vigor. If the price rebounds off the 20-day EMA, it will suggest that the sentiment has turned positive and traders are buying at lower levels. The ADA/USDT pair may then once again reach $0.30.</p><p>This view will be invalidated if the price continues lower and plummets below the 20-day EMA. Such a move will suggest that the pair may oscillate between $0.24 and $0.30 for a while longer.</p><h2>Dogecoin price analysis</h2><p>The bulls have been struggling to sustain Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) above the $0.07 resistance, suggesting that higher levels are attracting sellers. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/7ceaf3b2-65e8-4936-a0b0-9a2eb82938df.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ADOGEUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The bulls bought the dip to the 20-day EMA ($0.06) on Oct. 31 as seen from the long tail on the candlestick but they could not build upon this strength. Sellers are again trying to yank the price back below the 20-day EMA. If they succeed, it will suggest that bulls are losing their grip. The DOGE/USDT pair may then slump toward $0.06.</p><p>Alternatively, if the price once again rebounds off the 20-day EMA with strength, it will suggest that bulls are buying on dips. The bulls will then again try to clear the overhead hurdle at $0.07 and start the up-move to $0.08.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-halving-crash-stablecoin-2019-top-warning\"><strong><em>Bitcoin crash pre-halving? Stablecoin metric that marked 2019 top flashes warning</em></strong></a></p><h2>Toncoin price analysis</h2><p>Toncoin (TON) has formed a range between $1.89 and $2.31 for the past few days. The price turned down from $2.27 on Oct. 31 indicating that the bears continue to sell near the resistance.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/24825c1a-19d7-41b8-9a91-c04b07438b92.png\"  /><figcaption style=\"text-align: center;\"><em>TON/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3ALTCUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The TON/USDT pair has slipped to the immediate support at the moving averages. If the price rebounds off this level with force, it will suggest that the sentiment has turned positive and traders are viewing the dips as a buying opportunity. That will improve the prospects of a rally above the overhead resistance at $2.31. The pair may then surge to $2.59.</p><p>Contrarily, if the price continues lower and breaks below the moving averages, it will suggest that the range-bound action may continue for a few more days.</p><h2>Chainlink price analysis</h2><p>The bulls have been attempting to propel and sustain Chainlink (<a href=\"https://cointelegraph.com/chainlink-price-index\">LINK</a>) above the overhead resistance at $11.50 but the long wick on the candlesticks shows that the bears are active at higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/c419685c-c176-4874-b2e2-186d26343152.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>LINK/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AlinkUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>The drop on Nov. 1, indicates that the bears are trying to pull the price to the 20-day EMA ($9.80), which is an important level to watch out for. If the price rebounds off this level, the bulls will again try to push the LINK/USDT pair above $11.50. If they do that, the pair may rise to $13.50 and then to $15.</p><p>On the other hand, sellers will be back in the driver’s seat if they sink and sustain the price below $9.50. That may open the doors for a further fall to the 50-day SMA ($8.06).</p><h2>Polygon price analysis</h2><p>Buyers tried to propel Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) above the overhead resistance of $0.66 on Oct. 31 but the bears held their ground.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/d9b5d712-3d72-4d4a-8049-f0972f901156.png\"  /><figcaption style=\"text-align: center;\"><em>MATIC/USDT daily chart. Source: </em><a href=\"https://www.tradingview.com/chart/?symbol=BINANCE%3AMATICUSDT\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>This suggests that the MATIC/USDT pair could consolidate in a tight range between $0.60 and $0.66 for some time. The rising moving averages and the RSI in the positive territory indicate advantage to the bulls.</p><p>If buyers shove the price above $0.66, the pair could start the next leg of the relief rally toward $0.77. However, the bears are likely to have other plans. They will try to sink the price back below $0.60 and trap the aggressive bulls.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-01T17:53:09.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "http://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>SafeMoon executive team charged with multiple fraud counts, arrests made. PayPal has received approval from the Financial Conduct Authority (FCA) to offer crypto services in the United Kingdom. Meanwhile, the ticker for Invesco and Galaxy Digital’s spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund (ETF) has appeared on the DTCC’s website. </p><h2>SafeMoon executive team charged with multiple fraud counts, arrests made</h2><p>The U.S. SEC has charged SafeMoon and three of its executives with fraud and unregistered securities sales in connection with its SafeMoon token.</p><p>According to unsealed documents released on Nov. 1, SafeMoon creator Kyle Nagy, CEO John Karony and chief technology officer Thomas Smith withdrew assets worth $200 million from the project and misappropriated investor funds. </p><p>The Justice Department’s announcement indicates that, as of the time of publishing, both <a href=\"https://cointelegraph.com/news/safe-moon-executive-team-charged-multiple-fraud-counts-arrests-made\">Karony and Smith have been arrested while Nagy remains at large</a>.</p><h3>PayPal scores UK crypto license after brief local Bitcoin buy halt</h3><p>Global payment giant PayPal has received approval from the Financial Conduct Authority (FCA) to offer crypto services in the United Kingdom.</p><p>According to official FCA data, PayPal has been registered to offer “certain crypto asset activities” in the U.K. since Oct. 31, 2023.</p><p>According to the register, PayPal has requirements or restrictions placed on the financial services activities that it can operate.</p><p>“This includes, but is not limited to, ceasing on-boarding new customers and restricting existing customers to hold and sell functionality,” the information on the FCA register reads.</p><p>“The firm cannot expand its current offering in crypto assets,” the register notes, adding that it’s “including, but not limited” to crypto exchange services, participation in initial coin offerings, staking, peer-to-peer exchange and decentralized finance activities such as lending and borrowing.</p><h3>Invesco and Galaxy’s spot Bitcoin ETF pops up on DTCC site </h3><p>BTCO, the ticker for the Invesco Galaxy Bitcoin ETF, <a href=\"https://cointelegraph.com/news/invesco-galaxy-spot-bitcoin-etf-added-to-dtcc-website\">has appeared</a> on the Depository Trust and Clearing Corporation’s (DTCC) website.</p><p>The ETF was added to the list sometime in the last six days as the web archiver WayBack Machine shows the BTCO listing wasn't present on Oct. 25.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/916d5c2e-ca9a-4c30-b5b4-8f9d1e19b9a2.png\"  /><figcaption style=\"text-align: center;\"><em>Invesco Galaxy Bitcoin ETF listed on the DTCC's site. Source: DTCC</em></figcaption></figure><p>The appearance of the ticker marks a step forward in the application process for the joint fund from Invesco and Galaxy Digital, but it’s not a guarantee of its future approval.</p><p>It’s standard practice for the DTCC to add securities to the NSCC security eligibility file “in preparation for the launch of a new ETF to the market,” a <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-ibtc-relisted-dtcc\">DTCC spokesperson said</a>.</p><p>“Appearing  on the list is not indicative of an outcome for any outstanding regulatory or other approval processes,” they added.</p><p>The application for Invesco and Galaxy’s joint spot Bitcoin ETF was reactivated with the Securities and Exchange Commission on June 21 amid a <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-new-sec-filings-wisdomtree-invesco\">flurry of similar ETF filings</a> including one from investment giant BlackRock. </p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-01T18:05:40.000Z",
    "title": "Bitcoin remains above $34,000 as Fed keeps rates steady",
    "url": "https://cryptoslate.com/insights/bitcoin-remains-above-34000-as-fed-keeps-rates-steady/",
    "description": "<p>Quick Take In accordance with market expectations, the Federal Reserve maintained a steady stance in its recent meeting, holding the federal funds rate constant between 5.25 and 5.50. A significant takeaway from this meeting is the indication of the monetary policy&#8217;s direction for the near future. With one more Fed meeting scheduled for 2023, the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-remains-above-34000-as-fed-keeps-rates-steady/\">Bitcoin remains above $34,000 as Fed keeps rates steady</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-01T17:50:00.000Z",
    "title": "Legendary Billionaire Investor Stanley Druckenmiller Wishes He’d Bet on Bitcoin: Insights from a Wall Street Titan",
    "url": "https://www.cryptoglobe.com/latest/2023/11/legendary-billionaire-investor-stanley-druckenmiller-wishes-hed-bet-on-bitcoin-insights-from-a-wall-street-titan/",
    "description": "This year’s Robin Hood Investors Conference (sponsored by J.P. Morgan) was held October 24-25 in New York City. On day one of the two-day conference, there was a fireside chat that caught the attention of many, especially those in the crypto investment community. During this chat, billionaire hedge fund manager Paul Tudor Jones II interviewed […]\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-01T18:04:38.000Z",
    "title": "Taiwanese officials confiscate $320m in nation’s biggest crypto money laundering operation",
    "url": "https://crypto.news/taiwanese-officials-confiscate-320m-in-nations-biggest-crypto-money-laundering-operation/",
    "description": "Taiwanese authorities have arrested an individual suspected of laundering a record $320 million through digital assets, marking the largest case of crypto-related money laundering in the country's history."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-01T17:58:25.000Z",
    "title": "Bitcoin holds strong with higher market cap than Tesla despite bear market",
    "url": "https://crypto.news/bitcoin-holds-strong-with-higher-market-cap-than-tesla-despite-bear-market/",
    "description": "Bitcoin has maintained a higher market capitalization than electric vehicle powerhouse Tesla, despite about 50% below its all-time high."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-01T18:00:03.000Z",
    "title": "XRP Price Rally Threatened As Ripple Unlocks 1 Billion Tokens",
    "url": "https://www.newsbtc.com/xrp-news/xrp-price-rally-threatened-as-ripple-unlocks-1-billion-tokens/",
    "description": "The XRP price rallied as recent reports from leading on-chain crypto tracker Whale Alert have revealed that Ripple Labs, the blockchain-based payment firm, has unlocked another 1 billion XRP as part of its monthly token unlock program. Origin Of Ripple Customary 1 Billion XRP Routine Today, the firm has unlocked yet another 1 billion tokens, performed in three separate transactions. Crypto tracker Whale Alert took to X (formerly Twitter) to share the alert with the crypto community, as each whale transaction was made one after the other. Related Reading: Ripples Returns 80% Of Unlocked XRP For August Back To Escrow According to data from Whale Alert, the first transaction performed with the escrow account unlatched a significant 100 million XRP tokens, valued at approximately $59.98 million. The second transaction made by the escrow account was 400 million XRP, valued at around $239.92 million. Meanwhile, the last transaction saw a total of 500 million XRP valued at approximately $299.9 million, making it a whopping 1 billion XRP valued at around $599.8 million. The price of XRP temporarily dropped in reaction to this announcement, which saw the token falling by about 3% that same day. But this decline was soon overcome, and as of right now, the digital assets are trading at a slight discount of 0.8% to its closing price from the previous day, according to CoinmarketCap. However, it is noteworthy that XRP had a strong day before the day before the unlocking, rising as high as 10.5% at one point and finishing the day with a 3.74% price increase. Currently, it is roughly trading at $0.6, presenting its highest price since August. Related Reading: XRP Whale Transactions Spike To 3-Month High As Smart Money Buys So far, the company has yet to announce its initial plan for the recently released 1 billion XRP. In light of last’s month 1 billion XRP release, Ripple immediately removed 800 million (80%) of the total XRP tokens unlocked. Notably, the crypto firm spent approximately 205 million tokens ($112.75 million) from its primary address, &#8220;Ripple 1,&#8221; in October, even though it reserved about 200 million XRP. Due to this, Ripple used about five million XRP in its balance from earlier this month. Recent Partnership Set To Boost XRP The company&#8217;s recent partnership with the web3 platform is expected to elevate the XRP holdings on Uphold, thereby boosting the token&#8217;s price. This is because Uphold has asserted that it will utilize its expertise to buttress XRP on the market while leaving its current customers&#8217; XRP holdings untouched.  In addition, the platform will also give Ripple the liquidity it needs to handle cross-border transactions. Ripple&#8217;s partnership with Uphold indicates increased interest from the web3 financial platform in the XRPL ecosystem and its utility token XRP, which powers transactions on Ripple Payments.  Featured image from Ripple, chart by Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-01T18:02:54.000Z",
    "title": "1000x Potential Altcoins? High Growth Altcoins of 2023 and New Meme Coins to Buy in the Bull Run",
    "url": "https://www.crypto-news-flash.com/1000x-potential-altcoins-high-growth-altcoins-of-2023-and-new-meme-coins-to-buy-in-the-bull-run/?utm_source=rss&utm_medium=rss&utm_campaign=1000x-potential-altcoins-high-growth-altcoins-of-2023-and-new-meme-coins-to-buy-in-the-bull-run",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the digital currency marketplace of 2023, crypto buyers are scanning the horizon for the next high-growth crypto tokens, with a special focus on altcoins that might mirror or even surpass past crypto successes. As the bull run whispers grow louder, one token catching the eye is ApeMax, a burgeoning presence in the meme coin [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-01T18:05:07.000Z",
    "title": "Arthur Hayes Makes Crypto Bull Run Prediction, Says ‘Something New’ Coming to Digital Asset Markets",
    "url": "https://dailyhodl.com/2023/11/01/arthur-hayes-makes-crypto-bull-run-prediction-says-something-new-coming-to-digital-asset-markets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/bitcoin-hayes-forecast.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/bitcoin-hayes-forecast.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/bitcoin-hayes-forecast.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/bitcoin-hayes-forecast.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/bitcoin-hayes-forecast.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/bitcoin-hayes-forecast.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/bitcoin-hayes-forecast.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>BitMEX founder Arthur Hayes is laying out a forecast for how the next crypto bull run could unfold. In a new interview on the Blockworks Macro YouTube channel, Hayes says that there will always be &#8220;the new new thing&#8221; in crypto, which he argues will likely influence an upcoming market expansion. &#8220;There&#8217;s always going to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/01/arthur-hayes-makes-crypto-bull-run-prediction-says-something-new-coming-to-digital-asset-markets/\">Arthur Hayes Makes Crypto Bull Run Prediction, Says ‘Something New’ Coming to Digital Asset Markets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]