[
  {
    "source": "Cointelegraph",
    "date": "2023-09-08T08:12:41.000Z",
    "title": "Blockchain could have prevented Nigeria's naira scarcity effects - Local experts",
    "url": "https://cointelegraph.com/news/blockchain-would-prevent-nigeria-naira-scarcity-effects-local-experts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/92de024d-03bc-4579-a30a-d41e31cf38d6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to local stakeholders, the decision to print new naira notes could have occurred via DeFi, involving Nigerians and aiding readiness for the change</p>\n                    <p><p>A group of local blockchain experts discussed how blockchain technology can help solve economic problems in Nigeria and throughout the African continent. In their discussion, Nigeria's naira flow shortage was used as a case study.</p><p>At the Stakeholders in Blockchain Technology Association of Nigeria (SIBAN)’s Digital Assets Summit 2023, held in Abuja, the nation’s capital, stakeholders discussed the decision by the past government to mint new naira notes and Nigeria’s recent efforts to increase its <a href=\"https://cointelegraph.com/learn/what-is-a-cbdc-why-central-banks-want-to-get-into-digital-currencies\">Central Bank Digital Currency (CBDC)</a> adoption which all led to a shortage in the flow of naira at the time. </p><p>According to Christopher Eniayemo, Co-Founder of Sahara ICP Hub West Africa, the decision to print new naira notes could have been made within the <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> system, thereby ensuring Nigerians have a say and helping them prepare better for the switch. </p><blockquote>“Bringing blockchain system to Nigeria and Africa as a whole will help promote the advancement of DeFi and give citizens control over their own monies and economy”</blockquote><p>Blockchain technology provides the technical infrastructure and principles that empower DeFi to operate in a decentralized, transparent and secure manner, offering a wide array of financial services to users without the need for traditional financial intermediaries.</p><p>However, the current Nigerian President, Bola Tinubu <a href=\"https://cointelegraph.com/news/nigerian-president-elect-aims-to-use-blockchain-technology-in-the-banking-sector\">released a manifesto</a> during his campaign which, if implemented, would enable the use of blockchain technology and cryptocurrencies in the nation’s banking and finance sector. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blockchain-cbn-missed-opportunity-blockchain-regulation-in-2021-convexity-ceo\"><strong><em>Nigeria central bank missed opportunity for blockchain regulation in 2021 — Convexity CEO</em></strong></a></p><p>The manifesto <a href=\"https://apc.com.ng/img/apc_renewed_hope.pdf\" target=\"_blank\" rel=\"noopener nofollow\">suggests</a> reviewing existing Nigerian Security Exchange Commission (SEC) regulations on digital assets to make them more business-friendly. The new regulation provides a framework for regulating digital assets like cryptocurrencies and other digital tokens in Nigeria.</p><p>Nigeria drastically <a href=\"https://cointelegraph.com/public/index.php/news/nigeria-bans-atm-cash-withdrawals-over-225-a-week-to-force-use-of-cbdc/amp\">reduced the amount of cash individuals and businesses can withdraw</a> in its attempt to push the \"cashless-Nigeria\" policy and increase the use of its CBDC – eNaira in Dec. 2023.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-08T08:14:52.000Z",
    "title": "How to get the best out of Claude Pro as Anthropic increases access to 100k token model",
    "url": "https://cryptoslate.com/how-to-get-the-best-out-of-claude-pro-as-anthropic-increase-access-to-100k-token-model/",
    "description": "<p>Artificial intelligence startup Anthropic has launched its much anticipated paid subscription service Claude Pro to offer more usage of its 100k token conversational AI assistant Claude. The San Francisco-based company introduced the $20 per month service on Sept. 7 as a way for power users to get more productivity from Claude&#8217;s large language model capabilities [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/how-to-get-the-best-out-of-claude-pro-as-anthropic-increase-access-to-100k-token-model/\">How to get the best out of Claude Pro as Anthropic increases access to 100k token model</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T08:33:09.000Z",
    "title": "U.S CFTC commissioner proposes innovative Time-Limited crypto pilot program",
    "url": "https://www.cryptopolitan.com/u-s-cftc-commissioner-crypto-pilot-program/",
    "description": "In a recent development, CFTC Commissioner Caroline D. Pham has introduced an idea that could reshape the way cryptocurrency is regulated in the U.S. This proposal, termed as a time-limited crypto pilot program, aims to foster the growth and regulation of digital assets and tokens. While this is Pham&#8217;s viewpoint and doesn&#8217;t represent the stance ... <a title=\"U.S CFTC commissioner proposes innovative Time-Limited crypto pilot program\" class=\"read-more\" href=\"https://www.cryptopolitan.com/u-s-cftc-commissioner-crypto-pilot-program/\" aria-label=\"More on U.S CFTC commissioner proposes innovative Time-Limited crypto pilot program\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T08:27:39.000Z",
    "title": "Apple’s Ambitious Pursuit of AI Dominance",
    "url": "https://www.cryptopolitan.com/apples-ambitious-pursuit-of-ai-dominance/",
    "description": "Apple Inc., the tech giant renowned for its innovative products and software ecosystems, is gearing up to significantly impact the world of artificial intelligence (AI). With daily investments in the millions, Apple is steering its resources towards developing AI models across various teams, setting the stage to challenge established AI leaders like OpenAI and Google. ... <a title=\"Apple&#8217;s Ambitious Pursuit of AI Dominance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apples-ambitious-pursuit-of-ai-dominance/\" aria-label=\"More on Apple&#8217;s Ambitious Pursuit of AI Dominance\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-08T08:22:14.000Z",
    "title": "Binance CEO Changpeng Zhao addresses rumors amidst market uncertainty",
    "url": "https://www.cryptopolitan.com/binance-ceo-changpeng-zhao-addresses-rumors/",
    "description": "In an era of volatility and unpredictability, Binance, one of the world&#8217;s premier cryptocurrency exchanges, finds itself at the epicentre of numerous rumours and speculations. Amidst this backdrop of uncertainty, Binance&#8217;s co-founder and CEO, Changpeng &#8220;CZ&#8221; Zhao, has emerged as a beacon of clarity, addressing concerns and setting the record straight. As whispers of bank ... <a title=\"Binance CEO Changpeng Zhao addresses rumors amidst market uncertainty\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-ceo-changpeng-zhao-addresses-rumors/\" aria-label=\"More on Binance CEO Changpeng Zhao addresses rumors amidst market uncertainty\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-08T08:10:47.000Z",
    "title": "Bitcoin Analysis: Why 2024 Will Be The Highest Returning Year This Cycle",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-analysis-2024-highest-returning-year-cycle/",
    "description": "In a recent comprehensive report by Capriole Investments, Charles Edwards presents a compelling case for why 2024 will be a pivotal year for Bitcoin, potentially offering the highest returns in its current four-year cycle. The report delves into multiple facets of Bitcoin&#8217;s future, including its role as an inflation hedge, the upcoming Halving event, and the impact of imminent ETF approvals. A Confluence Of Catalysts For Bitcoin Edwards begins by addressing the skepticism surrounding Bitcoin&#8217;s performance as an inflation hedge. &#8220;Bitcoin gets a hard rep for its performance coming out of 2021 amidst growing inflation,&#8221; he notes. Contrary to popular belief, Edwards asserts, &#8220;Bitcoin was a great inflation hedge – it was when it needed to be.&#8221; Related Reading: Bitcoin Drop Before Halving Expected, Will It Get Worse In September? He emphasizes Bitcoin&#8217;s impressive 1000% rise from Q1-2020 to Q1-2021, outpacing all other asset classes. This surge, he explains, was a direct response to the Federal Reserve&#8217;s multi-trillion-dollar QE packages announced in March 2020. &#8220;Markets today move incredibly fast and are forward looking. As soon as macro announcements are made, the pricing-in begins,&#8221; Edwards states. Drawing a comparison between Bitcoin and traditional hedges, Edwards points out that Bitcoin&#8217;s performance during the liquidity boom was unparalleled. &#8220;There is no doubt that Bitcoin dominated the crisis as the best inflation hedge,&#8221; he asserts, adding, &#8220;There is no second best. Bitcoin was the greatest inflation hedge we have ever seen.&#8221; The second crucial catalyst for Bitcoin is the upcoming halving in April 2024. Edwards highlights the gravity of this event, stating, &#8220;The upcoming Bitcoin halving in April will drop Bitcoin’s supply growth rate to 0.8% p.a. and below that of Gold (1.6%) for the first time ever.&#8221; This means that &#8220;In April 2024, Bitcoin will for the first time become harder than Gold.&#8221; Addressing the common argument that the Halving is already priced in, Edwards counters, &#8220;If there is one thing we have learnt from Bitcoin’s past it’s that the halving is never priced in.&#8221; He argues that 80% cycle drawdowns reset all interest in Bitcoin. Furthermore, Edwards draws parallels to previous cycles, noting that many on-chain metrics indicate that the current cycle mirrors those of 2019 and 2015 exactly. Third, Edwards also touches upon the regulatory landscape, highlighting the clarity brought about by the CFTC&#8217;s classification of Bitcoin as a commodity in 2021. He also mentions the significant announcement of Blackrock&#8217;s Bitcoin ETF application and the federal appeals court&#8217;s order for the SEC to reconsider its rejection of the Grayscale spot ETF. His base case expectation is that the SEC will approve the spot ETF either in October 2023 or January 2024. Related Reading: JPMorgan Adjusts Bitcoin’s Production Cost: What This Means For BTC And Its Miners? Discussing the potential impact of ETFs on Bitcoin, Edwards draws a parallel to Gold, noting the significant bull run that followed the approval of the Gold ETF in 2004. “When the Gold ETF approval hit, what followed was a massive +350% return, seven-year bull-run,” the analyst remarked, adding, “so, we have three incredible catalysts on the very near horizon,&#8221; he states, listing the upcoming halving, imminent ETF approvals, and Bitcoin&#8217;s status as the best inflation hedge. In conclusion, Edwards presents a bullish yet cautious outlook. While he acknowledges the short-term bearish signals, he remains optimistic about the long-term prospects. &#8220;In Bitcoin’s four-year cycles, there’s typically 12-18 months where 90% of returns happen, followed by 2-3 years of sideways and down,&#8221; he observes, adding, &#8220;I am expecting that the single highest returning year of this cycle will be 2024 and I believe the data supports that thesis.&#8221; At press time, BTC surged to $26,246, up 1.8% in the last 24 hours. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-08T08:17:43.000Z",
    "title": "Shiba Inu’s Shibarium Explodes with 1,357,164 Transactions, 1,119,473 Wallets, and Massive New Bullish Updates – Can it Drive SHIB Price to $0.00001?",
    "url": "https://www.crypto-news-flash.com/shiba-inus-shibarium-explodes-with-1357164-transactions-1119473-wallets-and-massive-new-bullish-updates-can-it-drive-shib-price-to-0-00001/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inus-shibarium-explodes-with-1357164-transactions-1119473-wallets-and-massive-new-bullish-updates-can-it-drive-shib-price-to-0-00001",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T093610.708.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shibarium mainnet&#039;s triumphant launch overwhelmed the network with traffic, necessitating user updates.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T093610.708.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T093610.708-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Shiba Inu (SHIB) and its gas token, BONE, set new records with increasing total addresses. Shibarium, the Shiba Inu Layer 2 blockchain, gains traction, hosting over 100 tokens. Shiba Inu (SHIB) and its associated gas token, BONE, are making waves in the crypto space by setting new records. As blockchain technology continues to evolve, these [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-08T08:18:23.000Z",
    "title": "XRP Lawyers Stand With LBRY in Federal Court Ruling Appeal",
    "url": "https://coinedition.com/xrp-lawyers-stand-with-lbry-in-federal-court-ruling-appeal/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Prominent_XRP_Lawyers_Seek_Withdrawal_From_Ripple_vs_SEC_Case.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Prominent_XRP_Lawyers_Seek_Withdrawal_From_Ripple_vs_SEC_Case.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Prominent_XRP_Lawyers_Seek_Withdrawal_From_Ripple_vs_SEC_Case-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Prominent_XRP_Lawyers_Seek_Withdrawal_From_Ripple_vs_SEC_Case-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Prominent_XRP_Lawyers_Seek_Withdrawal_From_Ripple_vs_SEC_Case-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Prominent_XRP_Lawyers_Seek_Withdrawal_From_Ripple_vs_SEC_Case-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Prominent_XRP_Lawyers_Seek_Withdrawal_From_Ripple_vs_SEC_Case-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Prominent_XRP_Lawyers_Seek_Withdrawal_From_Ripple_vs_SEC_Case-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Prominent_XRP_Lawyers_Seek_Withdrawal_From_Ripple_vs_SEC_Case-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Prominent_XRP_Lawyers_Seek_Withdrawal_From_Ripple_vs_SEC_Case-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Prominent_XRP_Lawyers_Seek_Withdrawal_From_Ripple_vs_SEC_Case-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Prominent_XRP_Lawyers_Seek_Withdrawal_From_Ripple_vs_SEC_Case-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Prominent_XRP_Lawyers_Seek_Withdrawal_From_Ripple_vs_SEC_Case-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Prominent_XRP_Lawyers_Seek_Withdrawal_From_Ripple_vs_SEC_Case-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Prominent_XRP_Lawyers_Seek_Withdrawal_From_Ripple_vs_SEC_Case-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Prominent_XRP_Lawyers_Seek_Withdrawal_From_Ripple_vs_SEC_Case-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Prominent_XRP_Lawyers_Seek_Withdrawal_From_Ripple_vs_SEC_Case-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Blockchain-based file-sharing and payment network LBRY has received widespread support after it announced its intention to appeal after a federal judge ruled in favor of the United States Securities and Exchange Commission (SEC) in the regulator’s lawsuit against LBRY in July. Bill Morgan, a crypto lawyer well-known in the industry, expressed his unwavering support for [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrp-lawyers-stand-with-lbry-in-federal-court-ruling-appeal/\">XRP Lawyers Stand With LBRY in Federal Court Ruling Appeal</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]