[
  {
    "source": "Cointelegraph",
    "date": "2023-10-25T20:53:17.000Z",
    "title": "Why is Bitcoin price up today?",
    "url": "http://cointelegraph.com/news/why-is-bitcoin-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2022-10/2975699c-abdd-4f7b-bd35-74267a570117.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin price is up today, briefly recapturing the $35,000 level as bullish investor sentiment provides BTC with a much-needed tailwind.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price is up today, rising to an intra-day high of $35,121. The Bitcoin price <a href=\"https://cointelegraph.com/news/price-analysis-10-25-btc-eth-bnb-xrp-sol-ada-doge-ton-link-matic\">increase today</a> comes as hype around a spot BTC exchange-traded fund (<a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-nasdaq-clearing-firm\">ETF</a>) resulted in an increase in spot and CME BTC volumes and this <a href=\"https://cointelegraph.com/news/crypto-sentiment-high-point-btc-record-high\">bullish momentum</a> continues to push prices across the crypto market higher. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/9a05ba37-ff87-4075-8e7f-823634f16614.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin price. Source: </em><a href=\"https://www.tradingview.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p>Although Bitcoin price is encountering some hurdles at the $35,000 level, the reasons for this week’s price move could be a <a href=\"https://cointelegraph.com/news/bitcoin-45000-year-end-matrixport-predicts\">hint</a> at the rally’s sustainability. </p><p>Let’s look into the reasons why Bitcoin price is up today. </p><h2>Institutional interest in Bitcoin boosts market sentiment </h2><p>Despite a bevy of macro headwinds, Bitcoin price has topped the key $35,000 level two times in the past 2-days. The bullish momentum sent the Crypto Fear and Greed index to its highest level since Bitcoin price hit the $69,789 all-time high in November 2021. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/46bbf1ec-2c44-4255-b931-5e99c44da17d.png\"  /><figcaption style=\"text-align: center;\"><em>Fear and Greed Index. Source: Newhedge</em></figcaption></figure><p>Despite a rush of spot <a href=\"https://cointelegraph.com/news/bitcoin-price-holds-as-institutional-investor-boosts-sentiment\">Bitcoin ETF amendments</a> in mid-October, the BlackRock iBTC fund is the first to be <a href=\"https://cointelegraph.com/news/ark-21shares-spot-bitcoin-etf-not-dtcc-listed\">listed</a> by a Nasdaq clearing firm.</p><p>To date, the SEC has refused to approve a spot Bitcoin ETF despite numerous applicants including <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">BlackRock</a>, Fidelity, <a href=\"https://cointelegraph.com/news/third-time-s-the-charm-ark-and-21shares-again-file-with-sec-for-bitcoin-etf\">ARK</a> Invest and 21Shares which has filed for approval three times. On Oct. 14, Grayscale scored a <a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\">major victory</a> after the SEC announced that it would not appeal the U.S. <a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\">Court of Appeals</a> Circuit Judge Neomi Rao’s decision. The decision led Grayscale to file a new <a href=\"https://cointelegraph.com/news/grayscale-new-spot-bitcoin-etf-nyse\">spot Bitcoin ETF</a> application on Oct. 19</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/magazine/5050-bitcoin-for-5-dollars-2009-helsinki-claim-to-crypto-fame-crypto-city-guide/\"><strong><em>5,050 Bitcoin for $5 in 2009: Helsinki’s claim to crypto fame</em></strong></a></p><h2>What does a spot ETF mean for BTC?</h2><p>Analysts continue to speculate what a spot Bitcoin ETF approval could do for BTC price. According to reports, an approval may <a href=\"https://cointelegraph.com/news/bitcoin-etfs-600-billion-tipping-point-crypto\">generate $600 billion</a> in new demand. CryptoQuant analysts believe that an ETF approval will lead to a $1 trillion increase in Bitcoin’s <a href=\"https://cointelegraph.com/tags/market-capitalization\">market capitalization</a>.</p><p>On Oct. 24, Galaxy Digital released a report showing that when Bitcoin ETFs are approved, BTC could see a minimum of $14.4 billion of inflows in the first year, growing to $38.6 billion by year three. The fund also predicts a 74% <a href=\"https://cointelegraph.com/news/galaxy-digital-soaring-bitcoin-price-increase-after-etf-launch\">price increase</a> in the first year after a spot BTC ETF launch. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/4ef21eb5-35d2-4250-b595-d3bc8e64c94d.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Assumed Bitcoin inflows after a spot BTC ETF approval. Source: Galaxy Digital</em></figcaption></figure><p>Charles Edwards, the founder of Capriole Investments, also suggested that gold sprung out of a bear market to generate a 350% return after a Gold ETF was approved. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/db3b1b1a-f91b-44d6-823f-88a3ddc62293.png\"  /><figcaption style=\"text-align: center;\"><em>Gold performance. Source: </em><a href=\"https://www.tradingview.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>TradingView</em></a></figcaption></figure><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/trigger-arthur-hayes-bet-on-bitcoin\"><strong><em>‘This is the trigger’ — Arthur Hayes says it’s time to bet on Bitcoin</em></strong></a></p><h2>Bitcoin volumes are the metric to keep an eye on </h2><p>Coinciding with <a href=\"https://cointelegraph.com/news/bitcoin-price-asset-outflow-crypto-exchanges\">Bitcoin’s price gains</a>, exchanges continue to see an exodus of BTC. The market perceives coins leaving crypto exchanges as a bullish signal, given traders withdraw their BTC typically when they want to hold it in self-custody long-term. </p><p>Despite the increase in Bitcoin leaving exchanges, spot volume has greatly increased. Trading volume on Oct. 25 surged above $35 billion for the first time since March 20. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/65a68d70-ea9c-498b-b3c7-350507490990.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto marketing trading volume and Bitcoin price. Source: Newhedge</em></figcaption></figure><p>In comments to Cointelegraph, JLabs Digital co-founder Ben Lilly explained that a notable feature of the price breakout was the sustained spot volumes.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/989377e1-4e38-4dbb-b7a2-62a8cf008f8a.jpg\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin’s Cumulative Volume Delta. Source: JLabs Digital</em></figcaption></figure><blockquote>“There were a lot of factors at play here. Conditions were ripe for the market to expose how one-sided the options market was getting. What I find interesting here is the big push didn't originate from futures, but more on the spot. And I believe this is in part why we didn't see a quick unwind in the days that followed from the options market normalizing.\" </blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/ecb1e3d1-8352-4b60-8860-c011340c5b38.jpg\"  /><figcaption style=\"text-align: center;\"><em>Net longs and net shorts. Source: JLabs Digital</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/why-is-bitcoin-price-up-today&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-10-25T20:48:42.000Z",
    "title": "Elliptic debunks WSJ article on Hamas crypto fundraising",
    "url": "https://crypto.news/elliptic-debunks-wsj-article-on-hamas-crypto-fundraising/",
    "description": "Blockchain analytics provider Elliptic refuted claims made in a Wall Street Journal article that misinterpreted its data and incorrectly said Hamas raised millions in cryptocurrencies. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-25T21:00:28.000Z",
    "title": "Crypto’s Red Alert: Is War Pushing Bitcoin To $1 Million? Arthur Hayes Weighs In",
    "url": "https://www.newsbtc.com/bitcoin-news/cryptos-red-alert-is-war-pushing-bitcoin-to-1-million/",
    "description": "Arthur Hayes, the former CEO of BitMEX, a prominent cryptocurrency exchange, has recently shared his viewpoint, signaling a watershed moment for Bitcoin (BTC). With a world grappling with heightened geopolitical tensions and economic uncertainties, Hayes has delved into how these macro factors can impact the trajectory of Bitcoin. His recent blog post, “The Periphery,” casts light on the potential future Bitcoin is hinting at. Related Reading: Bitcoin’s Surge Shakes Up ETF World: Who’s Soaring And Who’s Crashing? Wartime Economics And Bitcoin’s Rise Hayes underscores the geopolitical risks posed by the United States&#8217; growing involvement in two new wars. According to the former CEO of BitMEX, the ripple effects of such escalations could have vast implications for the global economy. Tying this to the domestic financial scene, Hayes points out the notable halt in interest rate hikes by the United States Federal Reserve despite the looming inflation. Hayes identifies this as a possible &#8220;bear steepener&#8221; for the economy when long-term interest rates increase faster than short-term interest rates. Hayes further elucidates the intricate relationship between banks’ structural hedging needs and the borrowing necessities of the US war machine, which are both interlinked in the US Treasury market. The former CEO poses a thought-provoking argument: if long-term US Treasury bonds don&#8217;t offer the security investors traditionally expect, where will the money flow? Hayes further postulates that assets like gold, and more pivotally, Bitcoin, would surge, driven by genuine fears of &#8220;global wartime inflation.&#8221; Bitcoin Response To Geopolitical Instabilities Hayes observes that gold and Bitcoin are witnessing an upward momentum, contrasting with a pronounced selloff in &#8220;long-end US Treasuries.&#8221; The former CEO of BitMEX stresses that this movement isn&#8217;t a speculative response to potential spot Exchange-Traded Fund (ETF) approvals. Instead, Bitcoin is a &#8220;barometer,&#8221; indicating an imminent &#8220;inflationary global wartime situation.&#8221; One of the culminating points Hayes touches upon in “The Periphery” is the possible eventuality where the Federal Reserve would no longer mask the true nature of the US Treasury market. According to Hayes, instead of portraying it as a free market, it would reveal its genuine form: a &#8220;Potemkin village&#8221; where the Federal Reserve sets interest levels based on political convenience. As revealed by Hayes, this epiphany would be a pivotal moment, propelling Bitcoin and the broader crypto market into a full-fledged bull phase. The former CEO of BitMEX further concludes: &#8220;This is the trigger,&#8221; suggesting a strategic pivot from short-term US Treasury bills towards cryptocurrency. Related Reading: From $35,000 To $500,000? The Bitcoin Rollercoaster This Expert Sees Ahead When Hayes published “The Periphery,” Bitcoin continued to move in a bullish trend. The asset is up 2.6% in the past 24 hours and more than 20% in the past week. BTC is trading for $34,890 at the time of writing. Featured image from iStock, Chart from TradingView"
  }
]