[
  {
    "source": "CoinDesk",
    "date": "2023-08-10T15:45:00.000Z",
    "title": "What in the World Is Going on With Crypto Regulation?",
    "url": "https://www.coindesk.com/coindesk-indices/2023/08/10/what-in-the-world-is-going-on-with-crypto-regulation/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Regulatory clarity has fueled crypto bull markets, demonstrated by Japan's 2016 adoption of crypto as payment and OCC's 2020 endorsement of crypto engagement. While global strides in clear crypto regulations are evident, particularly in Hong Kong, EU and UK, the US lags, emphasizing the need for enhanced regulatory certainty in the industry's advancement."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-10T16:04:00.000Z",
    "title": "Alex Mashinsky faces electronic monitoring while on bail, judge signs off on protective order",
    "url": "https://cointelegraph.com/news/alex-mashinsky-electronic-monitoring-bail-judge-signs-protective-order",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/98426794-8f10-42c5-adb6-eba8eaf851c7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Prosecutors and defense lawyers agreed to a bail modification having the former Celsius CEO under electronic monitoring and largely be restricted from moving funds over $10,000.</p>\n                    <p><p>A federal judge has approved a joint request from lawyers for <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/su-zhu-and-alex-mashinsky\">Alex Mashinsky</a> and the United States Department of Justice modifying the former Celsius CEO’s bail conditions to include electronic monitoring.</p><p>In an Aug. 8 filing in U.S. District Court for the Southern District of New York, Judge Gabriel Gorenstein signed off on a modification to Mashinsky’s $40-million bond ensured by his brokerage account at First Republic Bank and his New York home. Prosecutors and defense lawyers jointly signed a request to have Mashinsky under electronic monitoring and be restricted from withdrawing, transferring, or receiving more than $10,000 without prior approval from the court. The bail modification would remove the need to use Mashinsky’s First Republic account to ensure the bond.</p><p>Following a motion from prosecutors with the consent of Mashinsky’s legal team, Judge John Koeltl ordered on Aug. 9 that most of the trial materials not publicly available could not be disclosed by any involved party, specifically mentioning social media posts on Facebook or Twitter — now X. The order included concerns of information being released that could lead to witnesses being intimidated.</p><p>Mashinsky, who was the CEO of the crypto lending platform Celsius Network until September 2022, faces charges for securities fraud, commodities fraud, and wire fraud for allegedly misleading and defrauding users. Following his <a href=\"https://cointelegraph.com/news/celsius-ceo-alex-mashinsky-arrested\">arrest on July 13</a>, he pleaded not guilty to all counts and was largely not allowed to travel as part of his bail conditions.</p><p>It's unclear what form of electronic monitoring Mashinsky could have. The bail condition often comes with a wrist or ankle monitor that alerts authorities to a subject's location at all times. Former FTX CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried</a> is under similar restrictions, but also largely confined to his parents' California home. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/everything-that-s-happened-with-celsius-and-alex-mashinsky-so-far\"><strong><em>Everything that’s happened with Celsius and Alex Mashinsky so far</em></strong></a></p><p>Celsius filed for Chapter 11 bankruptcy in July 2022 prior to Mashinsky’s departure. The U.S. Commodity Futures Trading Commission and Securities and Exchange Commission later <a href=\"https://cointelegraph.com/news/celsius-alex-mashinsky-us-sec-files-lawsuit-against-celsius-and-alex-mashinsky-report\">filed civil cases</a> against the platform and former CEO, with the Federal Trade Commission fining Celsius $4.7 billion for “duping” users.</p><p>Roni Cohen-Pavon, the former chief revenue officer of the lending platform and Israeli citizen, faces similar charges for his alleged involvement in activities at Celsius. However, at the time of Mashinsky’s arrest he was not in U.S. custody.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tiffany-fong-flames-celsius-ftx-and-ny-post-hall-of-flame/\"><strong><em>Tiffany Fong flames Celsius, FTX and NY Post: Hall of Flame</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-10T16:00:31.000Z",
    "title": "Bitcoin shatters ‘digital gold’ narrative with new independent trading pattern",
    "url": "https://cryptoslate.com/insights/bitcoin-shatters-digital-gold-narrative-with-new-independent-trading-pattern/",
    "description": "<p>Quick Take In a striking shift from established patterns, Bitcoin&#8217;s correlation with both Ethereum and Gold has significantly decreased in the past 90 days. Historically, Bitcoin has, at times, mirrored the performance of major assets like US equities, trading one-to-one in the post-Covid era. Its similar trading correlation to gold after the March banking crisis [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-shatters-digital-gold-narrative-with-new-independent-trading-pattern/\">Bitcoin shatters &#8216;digital gold&#8217; narrative with new independent trading pattern</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-10T15:42:54.000Z",
    "title": "Biggest Movers: LINK Retreats From 2-Week High, as XRP Drops 5%",
    "url": "https://news.bitcoin.com/biggest-movers-link-retreats-from-2-week-high-as-xrp-drops-5/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2130621119-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers: LINK Retreats From 2-Week High, as XRP Drop 5%\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2130621119-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2130621119-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2130621119-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2130621119-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2130621119-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2130621119-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2130621119.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Chainlink declined from a recent two-week high on Thursday, as market uncertainty rose around the latest U.S. inflation report. As consumer prices rose to a reading of 3.2% in July, traders so far seem unsure on how to process this data. XRP fell by nearly 5% today. Chainlink (LINK) Chainlink (LINK) was back in the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T16:09:07.000Z",
    "title": "China responds to Biden’s investment restrictions",
    "url": "https://www.cryptopolitan.com/china-responds-biden-investment-restrictions/",
    "description": "China has boldly come forward, openly criticizing the Biden administration&#8217;s recent endeavors to curtail U.S. investment in the technological sphere. To some, it might seem like a mere economic play, but scratch the surface, and you realize the undercurrents run deeper, touching upon themes of political posturing and global supremacy. Economic power play or political ... <a title=\"China responds to Biden&#8217;s investment restrictions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-responds-biden-investment-restrictions/\" aria-label=\"More on China responds to Biden&#8217;s investment restrictions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T15:59:24.000Z",
    "title": "China has a deflation dilemma – Is there a way out?",
    "url": "https://www.cryptopolitan.com/china-has-a-deflation-dilemma-a-way-out/",
    "description": "The recent stirrings in the economic cauldron have all eyes on China, as the nation navigates its way through a troubling deflationary period. With the world&#8217;s second-largest economy seemingly teetering on the brink, the global implications are hard to ignore. So, the burning question remains: Can China find a way out of its deflation quagmire, ... <a title=\"China has a deflation dilemma &#8211; Is there a way out?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-has-a-deflation-dilemma-a-way-out/\" aria-label=\"More on China has a deflation dilemma &#8211; Is there a way out?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T15:57:45.000Z",
    "title": "SEC reveals intention to appeal court decision in XRP lawsuit",
    "url": "https://www.cryptopolitan.com/sec-reveals-appeal-decision-in-xrp-lawsuit/",
    "description": "The United States Securities and Exchange Commission (SEC) has revealed its intention to challenge a recent court ruling that determined XRP, a cryptocurrency, may not inherently qualify as a security. In response, the agency is seeking an interlocutory appeal, aiming to secure a review of the court’s decision while the case remains ongoing. SEC seeks ... <a title=\"SEC reveals intention to appeal court decision in XRP lawsuit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-reveals-appeal-decision-in-xrp-lawsuit/\" aria-label=\"More on SEC reveals intention to appeal court decision in XRP lawsuit\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T15:48:14.000Z",
    "title": "Why is Japan in the middle of US-China rivalry",
    "url": "https://www.cryptopolitan.com/japan-in-the-middle-of-us-china-rivalry/",
    "description": "Japan, the historical titan of the East, now finds itself caught in the midst of a modern-day superpower showdown between the US and China. Both the Pacific giants view Japan as a pivotal player in their global chess match, yet Japan&#8217;s stance remains as enigmatic as ever. What&#8217;s behind this intense spotlight on Japan? Tokyo&#8217;s ... <a title=\"Why is Japan in the middle of US-China rivalry\" class=\"read-more\" href=\"https://www.cryptopolitan.com/japan-in-the-middle-of-us-china-rivalry/\" aria-label=\"More on Why is Japan in the middle of US-China rivalry\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T15:42:53.000Z",
    "title": "Riot Platforms narrows losses in an improved Q2 performance",
    "url": "https://www.cryptopolitan.com/riot-platforms-narrows-losses-improved-q2/",
    "description": "Colorado-based Bitcoin mining company Riot Platforms has reported a significant reduction in its net loss for the second quarter of 2023, marking a positive turn in its financial performance. The firm’s strategic efforts to ramp up Bitcoin production and enhance hash rate capacity contributed to this improved outlook. Riot Platforms posts a net loss of ... <a title=\"Riot Platforms narrows losses in an improved Q2 performance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/riot-platforms-narrows-losses-improved-q2/\" aria-label=\"More on Riot Platforms narrows losses in an improved Q2 performance\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T15:40:55.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Kraken Blog",
    "date": "2023-08-10T15:49:36.000Z",
    "title": "Trading for Sei (SEI) starts August 15 — deposit now!",
    "url": "https://blog.kraken.com/product/trading-for-sei-sei-starts-august-15-deposit-now",
    "description": "We’re thrilled to announce that funding for Sei (SEI) is now available on Kraken! SEI will start trading on Kraken on Aug. 15. Funding your account Add SEI to your Kraken account by navigating to Funding, selecting the asset, and hitting Deposit. &#160;Only deposit SEI on the Sei network. Deposits using other networks will be [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-10T16:05:17.000Z",
    "title": "Rising Star Hedera (HBAR) And Its 11% Climb – A Closer Look",
    "url": "https://www.newsbtc.com/all/rising-star-hedera-hbar-and-its-11-climb-a-closer-look/",
    "description": "Hedera (HBAR), currently ranked as the 31st cryptocurrency asset in terms of market capitalization, has recently witnessed a remarkable surge in its price, captivating the attention of investors and enthusiasts alike.  A surge in an asset&#8217;s social engagement often serves as a precursor to a rally in its price. In the case of HBAR, this correlation seems to be playing out vividly. As the cryptocurrency landscape continues to evolve, HBAR&#8217;s notable growth over the past few weeks has raised eyebrows and prompted discussions about its potential. Related Reading: XRP Price: Breaking This Key Resistance Could Propel Crypto To $21 By 2025 – Analyst Surge In Social Activity Sparks Price Rally Speculation In the ever-dynamic world of cryptocurrencies, there exists a symbiotic relationship between social activity and price movements.  With its current price listed at $0.058907 according to CoinGecko, the cryptocurrency experienced a slight 5.5% decline over a 24-hour period. However, what has truly caught the attention of market observers is its impressive seven-day surge of 11.8%. These figures, though significant, only hint at the larger story unfolding around HBAR. Keep a close eye on @hedera&#8216;s social engagement. Here&#8217;s what we are noticing&#8230;#Hedera&#8216;s social activity has been soaring with 30.68M engagements (+243.9%) over the past week. The social engagement metric measures community participation in social posts, measured by likes,… pic.twitter.com/FJFNFOkgz8 — LunarCrush (@LunarCrush) August 8, 2023 Lunar Crush, a platform that monitors social media activity surrounding cryptocurrencies, reported a staggering increase of over 200% in Hedera&#8217;s social engagement metric within the last week. This surge in online discussions, mentions, and interactions reflects a heightened level of interest and curiosity surrounding HBAR.  As the cryptocurrency community buzzes with conversations about HBAR&#8217;s potential, it becomes evident that this surge in social engagement has played a pivotal role in driving its recent price rally. As of today, the market cap of cryptocurrencies reached $1.13 trillion. Chart: TradingView.com Hedera: Technical Indicators Paint A Complex Picture Peering into the technical aspects of HBAR&#8217;s recent price surge, key momentum indicators reveal interesting insights. According to a recent price analysis, these indicators have maintained a position above their neutral center lines since the start of August, underscoring the ongoing bullish sentiment.  Source: Banknote World However, caution flags are raised by the Relative Strength Index (RSI), which presently hovers above the 70-mark. This could suggest that HBAR is venturing into overbought territory, possibly indicating a need for a corrective pullback. Similarly, the Money Flow Index (MFI) stands at 72.63, drawing closer to the overbought region. These indicators collectively invite a nuanced interpretation of HBAR&#8217;s current price trajectory. Related Reading: Cardano False Breakdown: Could It Set The Stage For A 26% Climb? In a market that thrives on speculation and anticipation, HBAR&#8217;s recent price surge and the corresponding surge in social activity have ignited intriguing conversations. As HBAR continues to make its presence felt among cryptocurrency enthusiasts and investors, its journey forward remains one to watch closely.  (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from NPR"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-10T15:50:29.000Z",
    "title": "Heavy Accumulation by Top Ethereum Addresses: Will it Trigger an ETH Price Rally?",
    "url": "https://www.crypto-news-flash.com/heavy-accumulation-by-top-ethereum-addresses-will-it-trigger-an-eth-price-rally/?utm_source=rss&utm_medium=rss&utm_campaign=heavy-accumulation-by-top-ethereum-addresses-will-it-trigger-an-eth-price-rally",
    "description": "<img width=\"1920\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/ethereum-7190848_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/ethereum-7190848_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/ethereum-7190848_1920-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/ethereum-7190848_1920-1024x768.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/ethereum-7190848_1920-768x576.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/ethereum-7190848_1920-1536x1152.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Whales are reportedly accumulating Ethereum (ETH) despite its lack of major catalysts since the 2022 Merge.  Analysts have also observed that there is a negative sentiment in the market which could take the price down to $1,700.  Ethereum (ETH) has for the past few months failed to make any significant jump as the price keenly [...]"
  }
]