[
  {
    "source": "CoinDesk",
    "date": "2023-11-10T05:26:19.000Z",
    "title": "CME Topples Binance as Top Bitcoin Futures Exchange as Crypto ETF Excitement Soars",
    "url": "https://www.coindesk.com/markets/2023/11/10/cme-topples-binance-as-top-bitcoin-futures-exchange-as-crypto-etf-excitement-soars/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "CME's rise to the top rank highlights the growing institutional demand for bitcoin, as the venue is almost exclusively used by large traditional financial institutions, one analyst noted."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-10T05:32:28.000Z",
    "title": "Hong Kong ‘ready’ to capitalize on crypto’s next bull run: Hashkey Capital",
    "url": "http://cointelegraph.com/news/hong-kong-mass-crypto-adoption-hashkey-capital-jupiter-zheng",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/ef578bef-644b-4971-8bf9-42955c097c49.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Hashkey Capital partner of liquids funds and research, Jupiter Zheng, says the crypto sector in Hong Kong is now primed for significant growth over the next four to five years.</p>\n                    <p><p>Hong Kong is “very ready” for the next wave of mass crypto adoption, with an influx of crypto talent that has been spilling into the aspiring digital asset hub, says Jupiter Zheng, a partner at Hashkey Capital. </p><p>Speaking to Cointelegraph, Zheng, partner of liquid funds and research at the investment arm of Hong Kong crypto firm HashKey Group — explained that the combination of <a href=\"https://cointelegraph.com/news/hong-kong-says-cyberport-attracted-150-web3-firms-in-a-year\">new Web3 projects</a> along with <a href=\"https://cointelegraph.com/news/not-like-china-hong-kong-reportedly-wants-to-legalize-crypto-trading\">crypto-positive regulatory developments</a> has primed Hong Kong for significant growth in the next four to five years.</p><blockquote>“You’ve got all of these new, different projects, with their founders and teams here, which is all real GDP by the way. These teams are already boosting both banking and capital market activities.\"</blockquote><p>Zheng added that while crypto prices haven’t reflected it, the level of sophistication being developed in the sector over the past 18 months had been striking. </p><p>“The actual technological improvement we’ve seen throughout the bear market has been quite astonishing. So I think from the technology side, we are very ready for the next wave of larger mass adoption in the crypto world,” said Zheng. </p><p>The reason for his bullishness for the region was based on h belief that the Hong Kong government is in dire need of a new economic driver, something that Zheng believes the crypto sector is ready to offer. </p><p>“The GDP in Hong Kong in recent years hasn’t been looking so good — largely due to Covid. So it needs a new driver,” Zheng said. “So it’s my theory that crypto and Web3 are the new drivers here.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/mar2424?ref_src=twsrc%5Etfw\">@mar2424</a> Jupiter Zheng, HashKey Capital&#39;s Partner of Liquid Funds and Research, spoke at a panel discussion at CVCF last week with the theme &quot;Navigating the Web3 Investment Landscape: Emerging Trends to Watch in 2023–24&quot;. <a href=\"https://t.co/P5Yg1StzfI\">pic.twitter.com/P5Yg1StzfI</a></p>&mdash; HashKey Capital (@HashKey_Capital) <a href=\"https://twitter.com/HashKey_Capital/status/1721347459002277919?ref_src=twsrc%5Etfw\">November 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On Aug. 3 this year, Hashkey <a href=\"https://cointelegraph.com/news/hong-kong-welcomes-first-licensed-retail-crypto-exchange-hashkey\">became the first crypto exchange</a> in Hong Kong to receive a specific license that allowed them to offer crypto assets to retail investors. </p><p>Zheng admitted that while he’s not directly involved in the exchange arm of Hashkey, he expects the demand for crypto products from local Hong Kong residents to grow as the government continues to shore up investor concerns by outlining its regulatory scheme for the sector.</p><p>“The recent policy changes give retail investors safety because now you’ve got insurance legal protections,” he said.</p><blockquote>“You don't have to use online wallets to do self-custody. All you need to do is open an account on an exchange, and then you can use your Hong Kong dollars to buy Bitcoins and other crypto. It's quite easy.”</blockquote><p>“For now it's still a bear market, but when the bull market comes back, we can assume that people’s outlook will change quickly. Retail will definitely be coming back, especially when they have a lot of opportunities to buy securely with licensed exchanges.”</p><p>Overall, Zheng predicts that Web3 in Asia and Hong Kong will witness a similar pattern of development to that of <a href=\"https://cointelegraph.com/news/axie-infinity-re-engineering-its-destiny-in-the-gamefi-landscape\">the GameFi sector in South East Asia in 2021</a>, which saw Axie Infinity briefly <a href=\"https://cointelegraph.com/news/axie-infinity-player-count-falls-back-to-jan-2021-levels\">become one of the most-played games</a> in the world. </p><p>In Zheng’s view, while Axie was prone to massive speculation, the underlying model of development would be similar — projects that are developed in the U.S. and Europe could easily find a welcoming market in Asia. </p><p>“I think in the future Asia will still follow the same pattern. Protocols and infrastructure projects that are developed in the United States or Europe or Australia may not witness massive adoption where they’re developed — but if they want to find a market they can go to Asia.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/swiss-crypto-bank-seba-hong-kong-sfc-license\"><strong><em>Swiss crypto bank SEBA gets Hong Kong SFC license</em></strong></a></p><p>Zheng conceded that while growth will be less feverish than once seen in South East Asia, there’ll be more of a sober and well-regulated focus on protocols and blockchain infrastructure <a href=\"https://cointelegraph.com/news/axie-infinity-play-to-earn-phillippine-police\">instead of rampant speculation on gaming</a>.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Hong Kong&#39;s burgeoning virtual asset policy is paving the way for the future of <a href=\"https://twitter.com/hashtag/Web3?src=hash&amp;ref_src=twsrc%5Etfw\">#Web3</a> <br><br>Our Partner of Liquid Funds and Research, <a href=\"https://twitter.com/mar2424?ref_src=twsrc%5Etfw\">@mar2424</a> shares his insights into the developments and opportunities that are reshaping the industry and the rest of the world at large.<br><br>Read more:</p>&mdash; HashKey Capital (@HashKey_Capital) <a href=\"https://twitter.com/HashKey_Capital/status/1721823551446229421?ref_src=twsrc%5Etfw\">November 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>It’s worth noting that Hong Kong was <a href=\"https://cointelegraph.com/news/jpex-scandal-fraud-hong-kong-arrests-sfc-masterminds\">rocked by a crypto exchange scandal</a> in September, in which an unlicensed exchange called JPEX allegedly swindled investors out of some $165 million. The fallout has since been described as the <a href=\"https://cointelegraph.com/news/jpex-crypto-exchange-dividend-plan-users-cry-foul-ca\">one of the worst financial crises</a> to have ever hit the region. </p><p>Despite the debacle, Hong Kong’s secretary for financial services and the treasury Christian Hui assured a crowd of investors, government officials and other regulators at HK Fintech week that the JPEX drama hadn’t affected the government’s aspirations to turn Hong Kong into Asia’s crypto hub. </p><p>Hong Kong also pledged to <a href=\"https://cointelegraph.com/news/crypto-rules-hong-kong-tightened-after-jpex-fraud-case\">tighten</a> its crypto regulations after JPEX’s alleged actions. The SFC also set up a <a href=\"https://cointelegraph.com/news/hong-kong-police-sfc-crypto-task-force-jpex-scandal\">task force with the police</a> to deal with illicit crypto exchange activities and <a href=\"https://cointelegraph.com/news/hong-kong-regulator-changes-crypto-policies\">updated its policies</a> on crypto sales and requirements.</p><p><strong><em>Asia Express: </em></strong><a href=\"https://cointelegraph.com/magazine/chinese-police-web3-blockchain-centralization-continues-asia-express/?doing_wp_cron=1691052881.1558809280395507812500\"><strong><em>Chinese police vs. Web3, blockchain centralization continues</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-10T05:22:37.000Z",
    "title": "Ethereum Price Surges 10%, Here’s Why ETH Could Pump 5% More",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-surges-10-pc-2120/",
    "description": "Ethereum price is up over 10% and surpassed the $2,000 resistance. ETH is outperforming Bitcoin and might rise further toward the $2,200 resistance. Ethereum rallied above the $2,000 and $2,050 levels. The price is trading above $2,050 and the 100-hourly Simple Moving Average. There is a short-term rising channel forming with support near $2,115 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to move higher toward the $2,200 resistance in the near term. Ethereum Price Regains Strength In the past 2-3 analyses, we discussed high chances of Ethereum surging toward the $2,000 level. ETH did start a strong increase and broke many hurdles near $1,920. It even surged above the $2,000 resistance, outperforming Bitcoin. It is up over 10% and consolidating near $2,125. A new multi-week high is formed near $2,137 and the price is now showing more positive signs. There is also a short-term rising channel forming with support near $2,115 on the hourly chart of ETH/USD. It is trading above $2,050 and the 100-hourly Simple Moving Average. The price is also above the 23.6% Fib retracement level of the recent rally from the $1,905 swing low to the $2,137 high. Source: ETHUSD on TradingView.com On the upside, the price is facing resistance near the $2,135 level. The next major resistance sits at $2,150, above which the price could accelerate higher. In the stated case, the price could rally toward the $2,200 resistance. The next key resistance is near $2,250, above which the price could aim for a move toward the $2,320 level. Buy Dips in ETH? If Ethereum fails to clear the $2,135 resistance, it could start a downside correction. Initial support on the downside is near the $2,115 level and the channel’s trend line. The next key support is $2,080. The main support sits at $2,000 or the 61.8% Fib retracement level of the recent rally from the $1,905 swing low to the $2,137 high. A downside break below the $2,000 support might spark bearish moves. In the stated case, Ether could drop toward the 100-hourly Simple Moving Average or even $1,920 in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $2,080 Major Resistance Level – $2,150"
  }
]