[
  {
    "source": "CoinDesk",
    "date": "2023-11-06T13:48:36.000Z",
    "title": "5 Strategies for Acquiring Users On-Chain",
    "url": "https://www.coindesk.com/consensus-magazine/2023/11/06/5-strategies-for-acquiring-users-on-chain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "From airdrops to advertising, CoinList's Alex Topchishvili examines the effective ways crypto projects entice crypto traders to become longterm customers."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-06T13:44:26.000Z",
    "title": "DAOs Are the New Degen: Crypto Traders Can Copy-Trade Token Treasuries for Fun and Profit",
    "url": "https://www.coindesk.com/consensus-magazine/2023/11/06/daos-are-the-new-degen-crypto-traders-can-copy-trade-token-treasuries-for-fun-and-profit/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Whether they’re bona-fide on-chain investment funds or otherwise, DAOs token allocations and treasuries approximate crypto market sentiment and can act as a valuable signal for traders of all levels."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-06T13:47:00.000Z",
    "title": "Telegram Wallet avoided self-custody to ease crypto onboarding, COO says",
    "url": "http://cointelegraph.com/news/telegram-wallet-avoided-self-custody",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/1a5a396d-d240-4424-a259-7edb805df818.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>As Telegram prepares to roll out Telegram Wallet as a native setting on the messenger in November, it’s important to understand why Wallet opted for custody over self-custody.</p>\n                    <p><p>Telegram Wallet, a major Telegram bot allowing users to buy and sell cryptocurrencies like Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), has chosen custody over self-custody to chase easier onboarding goals, according to a senior executive.</p><p>In July 2023, crypto-friendly Telegram messenger <a href=\"https://cointelegraph.com/news/ton-telegram-integrates-ton-crypto-wallet-ton-price-jumps-7\">officially announced the integration</a> of the custodial crypto wallet, Telegram Wallet, to allow users to access the wallet directly from the messenger’s settings. </p><p>Though Telegram has enabled existing Wallet users to see the wallet bot directly in the messenger, those who have never used the bot are still not seeing the crypto wallet in their settings section of the messenger.</p><p>According to Telegram Wallet chief operating officer Halil Mirakhmed, the full Wallet rollout is expected to begin sometime in November 2023, starting with “several African and Latin American countries.” With the rollout, Telegram users in select countries can access the Wallet and start buying, selling and transacting cryptocurrencies like Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>).</p><p>“The rollout will continue throughout MENA, South East Asia, Central Asia, and Eastern Europe,” Mirakhmed told Cointelegraph, adding:</p><blockquote>“Once the global rollout has concluded, Wallet will become available in the Telegram settings menu throughout the world, with the exception of the jurisdictions in which Wallet does not operate.”</blockquote><p>As Telegram Wallet anticipates the soon-to-come rollout of its crypto wallet to millions of Telegram users, it's important to note that the wallet bot is not self-custodial.</p><p><a href=\"https://cointelegraph.com/news/self-custody-is-key-during-extreme-market-conditions-here-s-what-experts-say\">Unlike major self-custodial wallets</a>, like MetaMask, the <a href=\"https://cointelegraph.com/news/telegram-wallet-bot-enables-in-app-payments-in-bitcoin-usdt-and-ton\">Telegram Wallet bot operates a custodial wallet</a> currently, meaning that users entrust their coins to a third party and do not own their assets directly. For example, to withdraw Bitcoin from the Telegram Wallet, users must have enough BTC to cover Telegram Wallet’s fees, which may sometimes be more expensive than the native fees on the Bitcoin network.</p><p>According to Telegram Wallet’s chief operating officer, the wallet bot platform opted for a custodial solution instead of a self-custodial one for several reasons, including easy onboarding of new users.</p><p>“If you want to introduce as many people as possible to crypto, self-custody becomes exceedingly difficult,” Mirakhmed said in an interview with Cointelegraph.</p><p>“Imagine if you’ve never used crypto before and your go-to solution for now, let’s say, is a non-custodial wallet on Ether,” the chief operating officer said. The exec stressed that before using a self-custodial wallet, one has to sort out how to store the seed phrase and figure out how to deal with the wallet, whether it’s a Chrome extension or an app.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/fake-ledger-live-app-sneaks-into-microsoft-app-store-as-victims-lose-half-a-million\"><strong><em>Fake Ledger Live app sneaks into Microsoft’s app store, $588K stolen</em></strong></a></p><p>One should also be ready to pay gas fees to transact Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), which adds too much complexity to a non-crypto native user, Telegram Wallet COO believes.</p><p>In contrast to self-custodial wallets, Telegram Wallet aims to help users start using crypto the exact moment they click on Wallet on their Telegram settings, Mirakhmed said:</p><blockquote>“First of all, the onboarding is very simple. Secondly, you already have a few chains on there. And thirdly, when you want to send someone any assets, you just use a telephone contact. So I can send money to you on Telegram rather than having to know what your address is. It all happens within Telegram.”</blockquote><p>Cointelegraph previously reported on the issue of understanding cryptocurrency custody and <a href=\"https://cointelegraph.com/innovation-circle/understanding-crypto-custody-what-different-solutions-entail-for-investors-and-businesses\">choosing between custodial wallet solutions and self-custodial ones</a>. Long story short, custodial wallets are more convenient but significantly less safe, while self-custodial, or non-custodial wallets, are less convenient but more secure. The biggest issue of using a self-custodial solution is the <a href=\"https://cointelegraph.com/news/what-happens-if-you-lose-or-break-your-hardware-crypto-wallet\">user's sole responsibility to keep the private key, or the seed phrase, safe</a>, in order to keep owning a crypto asset.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-06T13:43:39.000Z",
    "title": "Grimes collaboration with music platform makes 200+ AI songs available for creators ",
    "url": "http://cointelegraph.com/news/grimes-collaboration-with-ai-music-platform-makes-200-songs-available-creators",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/67811051-1001-4031-98fe-c524b1d7e272.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Grimes’ manager Daouda Leonard and music platform Slip.stream explain the importance of artists owning their data and controlling their rights to stay ahead in their approach to AI.  </p>\n                    <p><p>The rapid emergence of artificial intelligence (AI) into the public sector has proven to be one of the biggest developments of the year on a global scale. </p><p>Major industries have been <a href=\"https://cointelegraph.com/magazine/ai-killed-translation-industry-easytranslate-boss-change-human-jobs/\">turned upside down</a> with AI now on the scene. In the creative sectors, the music industry in particular, AI is often seen as a double-edged sword: a creativity kickstarter and a <a href=\"https://cointelegraph.com/news/open-ai-microsoft-accused-stealing-data-train-chat-gpt-artificial-intelligence-lawsuit\">thief in the night of copyrights</a>. </p><p>The popular musician and producer Grimes, however, has had a different approach to being an artist in the time of emerging AI. She was one of the first artists to be vocal about the technology after its explosion in popularity in late 2022 with the release of ChatGPT. </p><p>In April, Grimes famously said she would <a href=\"https://cointelegraph.com/news/musician-grimes-willing-to-split-50-royalties-with-ai-generated-music\">split 50% of the royalties</a> with the creators generating AI music using her vocals. It was after this that Grimes announced her new platform elf.tech, an open-source software program solely dedicated to legally replicating her voice for music creation.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">HOW TO MAKE MUSIC FEAT GrimesAI <br>- we can distribute it for you and you can earn royalties from your work: <a href=\"https://t.co/p598CXaXnD\">https://t.co/p598CXaXnD</a></p>&mdash; Grimes (@Grimezsz) <a href=\"https://twitter.com/Grimezsz/status/1652696738820689921?ref_src=twsrc%5Etfw\">April 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In September, Grimes was <a href=\"https://time.com/collection/time100-ai/6309464/grimes/\" target=\"_blank\" rel=\"noopener nofollow\">included</a> as one of Time Magazine’s Top 100 People in AI. Recently, Grimes and her team partnered with music creation platform Slip.stream to make 200+ GrimesAI songs available for use by creators. </p><p>Cointelegraph spoke with Grimes’ manager and CEO of research studio for musician’s IP rights CreateSafe, Daouda Leonard, along with the team behind Slip.stream, to understand how creatives can get ahead in their approach to AI. </p><p>Daouda pinpointed the current moment on the timeline of the technological revolution as the “DARQ ages (Distributed, Artificial, Reality and Quantum). “The only way through it is to use it,” he said. “I think all industry executives, artists, and companies need to be experimenting with new emergent technologies.”</p><blockquote>“By rights holders allowing new technology platforms to train with their data, they can be proactive about striking lucrative deals for their artists and catalogs.”</blockquote><p>With AI, creators can now utilize artists’ voices, for example, in their own creations, and AI companies are taking creative data to train their systems. Therefore, a strong content management system and royalties mechanism need to be a priority. </p><p>Grimes’ management said it’s also using another emerging technology, smart contracts, to make this happen and manage metadata information about “who did what, when and what they’re owed.”</p><p>Slip.stream, being the platform that houses the available Grimes AI tracks, echoed the sentiment saying: </p><blockquote>“It’s up to forward-thinking artists, executives, and companies to dream up and experiment with its applications to better protect their clients and capture any upside… It takes guts to zig when others zag.”</blockquote><p>When artists and management don’t manage to stay on top of such things, it could become too late. </p><p>Lawsuits against AI companies have been springing up throughout the year, be it the Author’s Guild launching a <a href=\"https://cointelegraph.com/news/authors-guild-class-action-lawsuit-open-ai\">class-action lawsuit against OpenAI</a> - the creator of ChatGPT- or Universal Music Group (UMG) <a href=\"https://cointelegraph.com/news/universal-music-group-sues-anthropic-ai-copyright-infringement\">suing Anthropic AI</a>, both over creative copyright infringement. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/universal-music-google-negotiate-ai-deep-fakes\"><strong><em>Universal Music and Google in talks over deal to combat AI deep fakes: Report</em></strong></a></p><p>Leading by example, Grimes is showing the industry what is possible when artists both own their data and control the rights to it.</p><p>“Owning your masters and publishing is only good if you know what to do with it,” said Daouda. “I don’t know if there is a perfect artist to do such a move. Grimes felt that it was important to experiment and see what’s possible.”</p><blockquote>“I think every artist who is open to taking risks and curious about how technology can be a benefit to their career is the perfect for doing this, so I’m sure there are a lot of them.” </blockquote><p>Many industry insiders who have wrapped their heads around the possibilities AI can present to artists and are trying to proactively find ways to reap the benefits without losing sovereignty have touted the technology as a <a href=\"https://cointelegraph.com/news/ai-grammys-recording-academy-ceo-harvey-mason-jr\">“creative amplifier”</a> of sorts. </p><p>Slip.stream said when artists are proactive with their rights and content shows that “AI is not about replacing humans with robots, but establishing new norms and structures for artistic collaboration that were unavailable to the masses before CreateSafe and Grimes.”</p><blockquote>“To give anyone in the world the ability to collaborate with their favorite artist, opens up groundbreaking possibilities for creative output and fan engagement.”</blockquote><p>Grimes herself posted a similar sentiment on X, formerly known as Twitter, a few days after the announcement of her collaboration with Slip.stream: </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Basically now is the time to transition from being competitive to being collaborative</p>&mdash; GrimesAI (@GRIMES_V1) <a href=\"https://twitter.com/GRIMES_V1/status/1717737581117681856?ref_src=twsrc%5Etfw\">October 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Daouda ended by saying that he believes what is happening with AI is even bigger than samples and collaborations. </p><p>“Generative AI or computational creativity makes it possible for people to go from idea to distribution in minutes, maybe even seconds,” he said. </p><p>“Whether that’s a good or bad thing is subjective, but what is objective is that now a lot of people can do it and it opens up modes of expression that ultimately could lead to a certain type of healing that many people can participate in. Music is healing and when we can participate in it that’s powerful.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/biticulture-fine-art-on-solana-ai-music-podcast-book-reviews/\"><strong><em>BitCulture: Fine art on Solana, AI music, podcast + book reviews</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-06T14:05:15.000Z",
    "title": "Maestro Trading Bot Refunds 610 ETH to Users Following Router Exploit",
    "url": "https://cryptodaily.co.uk/2023/11/maestro-trading-bot-refunds-610-eth-to-users-following-router-exploit",
    "description": "Maestro Trading Bot Refunds 610 ETH to Users Following Router Exploit"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-06T13:56:20.000Z",
    "title": "Nintendo’s Second-Quarter Net Profit Drops by 35%",
    "url": "https://www.cryptopolitan.com/nintendos-net-profit-expected-to-drops-by-35/",
    "description": "Gaming giant Nintendo's Q2 earnings expected to reveal a 35% drop in net profit, along with a 9.1% revenue decrease. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-06T14:00:56.000Z",
    "title": "Expert Predicts Date For Next Bitcoin Cycle High Of $130,000",
    "url": "https://www.newsbtc.com/news/bitcoin/expert-predicts-date-next-bitcoin-cycle-high-130000/",
    "description": "CryptoCon, a figure in the crypto analysis community, has presented a detailed chart that anticipates the next Bitcoin cycle peak to be in the vicinity of $130,000. According to the analyst, the date for the next cycle high will be November 28, 2025, with a possible deviation of 21 days. This projection is based on the Halving Cycles Theory, which aligns the Bitcoin price movement with the dates of its halving events. Bitcoin Halving Cycle Theory The chart delineates Bitcoin&#8217;s historical and projected price trajectory across four color-coded cycles, each representing a different market phase postulated by CryptoCon. The &#8220;Green Year&#8221; indicates periods of accumulation, with the best cycle buying prices and a return to the median, which is half of the previous all-time high (ATH). The &#8220;Blue Year&#8221; is identified as a preparatory phase where the price gravitates around the median before climbing towards new ATHs at the end of the year. The &#8220;Red Year&#8221; heralds new ATHs, while the &#8220;Orange Year&#8221; suggests a bear market where the price becomes undervalued and bottoms out at the end of the year. CryptoCon&#8217;s theory is grounded in the historical patterns observed around Bitcoin&#8217;s halving events—the first on November 28, 2012, and the second on July 9, 2016. The analyst asserts, &#8220;Every prediction of this model has remained precisely on track since its creation in Jan of this year.&#8221; Related Reading: Bitcoin Falls Under $35,000 But 86% Of Supply Remains Unmoved – Temporary Setback? Despite criticisms regarding the exact timing of past cycle peaks, CryptoCon maintains confidence in the model, stating, &#8220;The biggest critique I have seen of this model is that the technical top came in April 2021 and not November. But you can&#8217;t argue with the numbers, the price was higher.&#8221; Early Top, Top, And Bottom For The Next BTC Cycle The analyst&#8217;s approach combines various price experiments and a Trend Pattern Price model, leading to a consensus target of $130,000. The shared chart also specifies that Bitcoin is on the cusp of a &#8220;Blue Year.” According to CryptoCon, the next early top for Bitcoin is anticipated to occur within a 21-day window around July 9th, 2024, with an expected price range of $42,000 to $48,000. Related Reading: Bitcoin Price Plunge To $12,000 Is Not Foreseeable – Analyst Explains Why The chart analysis goes on to forecast the next cycle top, which is expected to fall within a similar 21-day margin around November 28, 2025. The projected price range for this peak is notably bullish, setting the target between $90,000 to $130,000. CryptoCon&#8217;s tweet underscores this prediction, stating: &#8220;Nothing has changed about my time frame or expected price for the next Bitcoin cycle top. 90 &#8211; 130k +/- 21 days from Nov 28th, 2025.&#8221; Remarkably, Cryptocon is also providing insights into the next cycle bottom. His forecast suggests a price floor of approximately $27,000, again within a 21-day range from November 28th, 2026. This aligns with the model&#8217;s &#8216;Orange Year,&#8217; which is typically characterized as a bear market period where the price is expected to bottom out by the end of the year. At press time, BTC traded at $35,229. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-06T14:04:00.000Z",
    "title": "Arbitrum (ARB) Could Be Destined to Stay Above $1, Here’s Why",
    "url": "https://coinedition.com/arbitrum-arb-could-be-destined-to-stay-above-1-heres-why/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/arbitrum51.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/arbitrum51.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/arbitrum51-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/arbitrum51-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/arbitrum51-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/arbitrum51-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/arbitrum51-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/arbitrum51-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/arbitrum51-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/arbitrum51-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/arbitrum51-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/arbitrum51-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/arbitrum51-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/arbitrum51-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/arbitrum51-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/arbitrum51-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/arbitrum51-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The price of Arbitrum (ARB) in the last seven days has grown by 15.56%, according to data from price tracking platform CoinMarketCap. While the growth may be connected to the rising tide of altcoin prices of late, there are also some underlying factors that have kept ARB on the upside. For one crypto researcher known [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/arbitrum-arb-could-be-destined-to-stay-above-1-heres-why/\">Arbitrum (ARB) Could Be Destined to Stay Above $1, Here’s Why</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-06T14:00:00.000Z",
    "title": "Bitget to Invest in Indian Blockchain Startups under its $10M Fund",
    "url": "https://coinedition.com/bitget-to-invest-in-indian-blockchain-startups-under-its-10m-fund/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/Bitget_Launches_10M_Initiative_To_Boost_Indian_Web3_Startups.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/Bitget_Launches_10M_Initiative_To_Boost_Indian_Web3_Startups.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/Bitget_Launches_10M_Initiative_To_Boost_Indian_Web3_Startups-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/Bitget_Launches_10M_Initiative_To_Boost_Indian_Web3_Startups-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/Bitget_Launches_10M_Initiative_To_Boost_Indian_Web3_Startups-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/Bitget_Launches_10M_Initiative_To_Boost_Indian_Web3_Startups-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/Bitget_Launches_10M_Initiative_To_Boost_Indian_Web3_Startups-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/Bitget_Launches_10M_Initiative_To_Boost_Indian_Web3_Startups-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/Bitget_Launches_10M_Initiative_To_Boost_Indian_Web3_Startups-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/Bitget_Launches_10M_Initiative_To_Boost_Indian_Web3_Startups-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/Bitget_Launches_10M_Initiative_To_Boost_Indian_Web3_Startups-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/Bitget_Launches_10M_Initiative_To_Boost_Indian_Web3_Startups-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/Bitget_Launches_10M_Initiative_To_Boost_Indian_Web3_Startups-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/Bitget_Launches_10M_Initiative_To_Boost_Indian_Web3_Startups-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/Bitget_Launches_10M_Initiative_To_Boost_Indian_Web3_Startups-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/Bitget_Launches_10M_Initiative_To_Boost_Indian_Web3_Startups-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/Bitget_Launches_10M_Initiative_To_Boost_Indian_Web3_Startups-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The renowned crypto derivatives and copy trading platform Bitget has made public its intent to channel significant investments into Indian-based blockchain startups. The exchange proclaimed this development in a recent statement, noting that it is part of Bitget’s Blockchain4Youth (B4Y) initiative, which has earmarked $10 million for Web3-focused projects. According to the notification, the initiative [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/bitget-to-invest-in-indian-blockchain-startups-under-its-10m-fund/\">Bitget to Invest in Indian Blockchain Startups under its $10M Fund</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-06T13:45:07.000Z",
    "title": "Big Time (BIGTIME) Price Prediction 2023-2030: Will BIGTIME Price Hit $0.25 Soon?",
    "url": "https://coinedition.com/big-time-bigtime-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Big-Time-(BIGTIME)-PRICE-PREDICTION\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION.jpg 730w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/11/Big-Time-BIGTIME-PRICE-PREDICTION-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>What is Big Time (BIGTIME)? Big Time is a free-to-play action-adventure massive multiplayer online role-playing game (MMORPG) powered by “Openloot,” a provider of decentralized solutions for web3 games, offering marketplaces, NFT management platforms, and support services. The blockchain-based game offers players a chance to earn NFT rewards and BIGTIME tokens as they embark on their [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/big-time-bigtime-price-prediction/\">Big Time (BIGTIME) Price Prediction 2023-2030: Will BIGTIME Price Hit $0.25 Soon?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]