[
  {
    "source": "Bitcoin.com",
    "date": "2023-12-27T01:30:09.000Z",
    "title": "Rich Dad Poor Dad Author Robert Kiyosaki Shares How He Made Most of His Money",
    "url": "https://news.bitcoin.com/rich-dad-poor-dad-author-robert-kiyosaki-shares-how-he-made-most-of-his-money/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/kiyosaki-resources-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Rich Dad Poor Dad Author Robert Kiyosaki Shares How He Made Most of His Money\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/kiyosaki-resources-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/kiyosaki-resources-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/kiyosaki-resources-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/kiyosaki-resources-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/kiyosaki-resources-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/kiyosaki-resources-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/kiyosaki-resources-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The famous author of Rich Dad Poor Dad, Robert Kiyosaki, has shared how he made most of his money. He stressed that the future of stock and bond markets will depend on startups in resources, not Silicon Valley technology startups, predicting that resources will be &#x201C;the coming boom in the investment world.&#x201D; How Robert Kiyosaki [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-27T01:30:29.000Z",
    "title": "Fantom (FTM) To Rocket Up To $1.60 If This Happens: Analyst",
    "url": "https://www.newsbtc.com/fantom/fantom-ftm-rocket-up-1-60-happens-analyst/",
    "description": "Fantom appears to be forming a double bottom pattern currently, a confirmation of which could lead to a break towards $1.60 according to an analyst. Fantom Might Be Forming A &#8220;W&#8221; Pattern In Its Weekly Chart As explained by analyst Ali in a new post on X, FTM&#8217;s weekly price chart has appeared to have been forming a &#8220;W&#8221; pattern recently. A W or double bottom refers to a pattern in technical analysis that ends with a bullish resurgence for the asset. The pattern forms when the price forms two consecutive bottoms after going through some significant downtrend and finally reverses its direction with a sharp bullish move. Related Reading: Polkadot Shows Bearish Signal, Analyst Predicts Drawdown To This Target While the pattern is known for its resemblance to the letter &#8220;W&#8221; from the English alphabet, the pattern can still form even if the &#8220;W&#8221; shape doesn&#8217;t quite look as symmetrical. Like this pattern, there is also the &#8220;M&#8221; or double top pattern, which forms when two consecutive tops follow an uptrend and the price subsequently shifts towards a downwards trajectory. Now, here is the chart shared by the analyst that shows how a potential W pattern may be forming for the weekly price of Fantom: The possible pattern forming in the asset's price &#124; Source: @ali_charts on X As is apparent in the above graph, the Fantom weekly price formed its second bottom in October and has since been sharply going up. The pattern is indeed starting to resemble a W now, but it&#8217;s still not fully confirmed yet. In the chart, Ali has also highlighted the $0.57 level at which the coin hit the top between the two bottoms and it seems like the weekly price has been approaching this line recently. &#8220;If $FTM sustains a weekly close above $0.57, it will confirm this bullish formation and march toward $1.60!&#8221; notes the analyst. From the current spot price of the cryptocurrency, a rally towards this level would mean an increase of almost 192%. It now remains to be seen if the asset can confirm this pattern and go on a run like this or not. A few days back, the same analyst had discussed about the on-chain support and resistance levels for Fantom, revealing that the coin has little in terms of obstacles until the $0.66 level. The cost basis distribution around the various FTM ranges &#124; Source: @ali_charts on X In the above chart, the data for each FTM price range in terms of the number of investors or addresses who bought their coins at them is displayed. The $0.45 to $0.47 range was filled with investors, but the asset has already cleared it. Generally, investors tend to show a selling reaction whenever the price of the asset retests their cost basis from below, as they might be tempted to just exit at their break-even point, rather than risk going into losses again. Related Reading: Worldcoin Shows Bullish Breakout, Analyst Predicts 80% Rally Ali had noted that with the dense zone clear, there were no more supply walls in sight for the cryptocurrency. The asset has been making its way up since then, mowing through these centers of relatively weak resistance. With the path appearing clear in terms of on-chain resistance and a W pattern beginning to form, a move towards higher levels may be coming for the asset. FTM Price At the time of writing, Fantom is trading around the $0.548 level, up 34% in the past week. Looks like the price of the coin has been going up recently &#124; Source: FTMUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com, Santiment.net"
  }
]