[
  {
    "source": "Decrypt",
    "date": "2023-06-25T18:45:53.000Z",
    "title": "Ogimi Founder David Gull on Why AI Should Be Your Meditation Coach",
    "url": "https://decrypt.co/videos/interviews/DnNqBruk/ogimi-founder-david-gull-on-why-ai-should-be-your-meditation-coach",
    "description": "Ogimi founder David Gull speaks with Decrypt's Jason Nelson about its AI-driven meditation guides and how the technology can enable a more unique, custom-tailored meditation experience for users."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-25T18:45:00.000Z",
    "title": "Bitcoin trades above $30K, boosting traders’ interest in ETH, ARB, VET and STX",
    "url": "https://cointelegraph.com/news/bitcoin-trades-above-30k-boosting-traders-interest-in-eth-arb-vet-and-stx",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/71733320-140a-4956-8bc4-fc537602c1d2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin and Ether’s recovery has improved traders' sentiment, which could trigger buying in ARB, VET, and STX.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) made a new 52-week high on June 23, indicating that bulls are on fire. Buyers have managed to hold onto a large part of the gains made during the week, signaling that they are in no hurry to book profits. Bitcoin climbed 16% this week, outperforming the S&amp;P 500 Index, which fell 1.39%.</p><p>Not only Bitcoin but even Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) is showing signs of starting a bullish move. Glassnode data shows that <a href=\"https://cointelegraph.com/news/ethereum-price-eyes-3k-as-exchanges-eth-balances-drop-to-an-all-time-low\">Ether balances on exchanges dropped sharply</a> in the past 30 days and hit a new low of 12.6%. </p><p>A similar dip in Ether exchange balances happened in November 2022, which was followed by a sharp rally of 33%. Although a rally is possible, traders need to be cautious because the fall in exchange balances this time may have been triggered by the U.S. Securities and Exchange Commission’s <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">actions against Binance and Coinbase</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/79ea743b-ef4f-4356-b19d-18b618da4019.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto market data daily view. Source:</em><em> </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>The crypto recovery is not limited to Bitcoin and Ether. Several altcoins have risen sharply from their respective lows, indicating solid buying at lower levels. This implies that the bearish sentiment may be waning.</p><p>Could the return of the buyers start a new bull move in cryptocurrencies, or will higher levels attract selling by the bears? Let’s study the charts of the top-five cryptocurrencies that may rise in the short term.</p><h2>Bitcoin price analysis</h2><p>Bitcoin has been trading near the $31,000 level for the past four days. This suggests that the bears are protecting this level, but the bulls have not given up. Usually, a tight consolidation near a major resistance level tends to resolve to the upside.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/7fb07fa7-2450-4e02-afd8-efa5ce81cd72.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The upsloping 20-day exponential moving average ($28,085) and the RSI in the overbought area indicate advantage to the bulls. If buyers kick and sustain the price above $31,000, the BTC/USDT pair could start the next leg of the up-move. There is a resistance at $32,400, but that is likely to be crossed. The pair may then skyrocket toward $40,000.</p><p>The first sign of weakness will be a break and close below $29,500. If that happens, the pair may slide to the 20-day EMA. This remains the key level to keep an eye on because if it gives way, the pair may drop to the 50-day simple moving average ($27,199). </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/eb417d68-edb4-45dc-ad2e-16baeb897c82.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The pair is stuck between the 20-day EMA and $31,000, but this tight-range trading is unlikely to continue for long. A range break above the $31,000-to-$31,500 zone could start the next leg of the uptrend.</p><p>Conversely, if the price dips and sustains below the 20-day EMA, it may trigger the stops of the short-term traders. The pair could then descend to $29,500, where the bulls are expected to mount a strong defense. A break below this level could open the doors for a potential fall to the 50-day SMA.</p><h2>Ether price analysis</h2><p>Ether has been facing selling at the $1,928 level for the past three days, but the bulls are not willing to cede ground to the bears. This indicates that buyers expect the resistance to be broken.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/2ca9b592-ff76-4589-ab37-f47f51cfbd22.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The moving averages are on the verge of a bullish crossover and the RSI is in positive territory, indicating that the bulls are in command. If buyers overcome the barrier at $1,928, the ETH/USDT pair may surge to the overhead zone between $2,148 and $2,200.</p><p>If bears want to prevent the rally, they will have to quickly drag the price below the moving averages. That may hit the stops of the aggressive bulls, resulting in a correction to the strong support at $1,700.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/ce633e16-cb12-4117-b6db-7e7d415cf2c7.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The four-hour chart shows that the price is stuck inside the range between $1,936 and $1,861. The rising moving averages and the RSI in the positive zone suggest that the path of least resistance is to the upside. If buyers propel the price above the range, the pair could start its march to the psychological level of $2,000.</p><p>Instead, if the price turns down and breaks below the $1,861 support, it will tilt the short-term advantage in favor of the bears. The pair may then tumble to the 50-SMA and later to $1,750.</p><h2>Arbitrum price analysis</h2><p>Arbitrum (ARB) rose above the breakdown level of $1 on June 19 and followed that up with a sharp rally on June 20. This indicates rejection of the recent breakdown.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/15d7c525-a07d-4b33-8b8e-382faeaceec1.png\"  /><figcaption style=\"text-align: center;\"><em>ARB/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bears are trying to stall the recovery at the 50-day SMA ($1.12), but a positive sign is that the bulls have successfully defended the 20-day EMA ($1.07). This narrow-range trading is unlikely to continue for long, and a breakout may be expected soon.</p><p>A break and close above $1.18 could suggest the start of a new up-move. The ARB/USDT pair could first rise to $1.28 and, subsequently, to $1.54. This bullish view will be negated if the price turns down and plunges below the $1-to-$0.90 support zone.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/644bff7a-814e-44e9-8faf-ac51c57230d1.png\"  /><figcaption style=\"text-align: center;\"><em>ARB/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The four-hour chart shows that the bulls are struggling to overcome the obstacle at $1.18. This indicates that bears are active at higher levels. Sellers pulled the price below the 20-day EMA, but they could not crack the 50-day SMA. </p><p>The 20-day EMA is flattening out and the RSI is near the midpoint, indicating a balance between buyers and sellers. If bulls drive the price above $1.18, it will indicate the start of a strong recovery. Contrarily, a break and close below the 50-day SMA may result in a slump to $1.</p><p><em>Related: </em><a href=\"https://cointelegraph.com/news/bitcoin-price-new-all-time-highs-3-countries-btc-31k\"><em>Bitcoin sees new all-time highs in 3 countries as BTC price pokes $31K</em></a></p><h2>VeChain price analysis</h2><p>VeChain (<a href=\"https://cointelegraph.com/vechain-price-index\">VET</a>) turned down from the resistance line on June 23, but the bears are struggling to sustain the price below the 50-day SMA ($0.018). This suggests that traders are buying the dips.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/fba09624-2a82-42db-a552-62e011cbd089.png\"  /><figcaption style=\"text-align: center;\"><em>VET/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The bulls will once again try to propel the price above the resistance line. If they succeed, it will indicate that the downtrend has ended. The VET/USDT pair could then start its upward move toward $0.026.</p><p>Contrary to this assumption, if the price once again turns down from the resistance line, it will suggest that the bears remain in control. They will then try to sink the pair below the moving averages and challenge the support at $0.013.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/c4df48cc-d149-47a1-b2d3-abe651a71298.png\"  /><figcaption style=\"text-align: center;\"><em>VET/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The four-hour chart shows that the price reversed direction from the resistance line but is finding support at the 20-day EMA. This suggests that the sentiment is turning positive and traders are viewing the dips as a buying opportunity.</p><p>The bulls will again attempt to propel the price above the resistance line. If they manage to do that, the pair could climb to $0.021. This level may again act as a hurdle but if crossed, the up-move may begin. The first support on the downside is the 20-day EMA, and next is the 50-day SMA.</p><h2>Stacks price analysis</h2><p>Stacks (STX) soared above the moving averages on June 20, signaling a potential trend change. The corrective phase started on June 22, but a positive sign is that the price remains above the moving averages. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/73bf0103-8913-4c41-bf01-134e497df947.png\"  /><figcaption style=\"text-align: center;\"><em>STX/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The moving averages have completed a bullish crossover and the RSI is in positive territory, indicating that bulls have the upper hand. If the price turns up from the current level or rebounds off the 20-day EMA ($0.65), it will suggest buying on dips. That will enhance the prospects of a break above $0.89. </p><p>If that happens, the STX/USDT pair could rally to $1.10 and, thereafter, to $1.30. This positive view will be invalidated if the price turns lower and plummets below the moving averages. Such a move will suggest that the bears have not yet given up and will continue to sell on rallies.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/6a7ecec0-8549-493b-9f6c-db0b52a8773e.png\"  /><figcaption style=\"text-align: center;\"><em>STX/USDT 4-hour chart. Source: TradingView</em></figcaption></figure><p>The four-hour chart shows that the pair is in a corrective phase. The bears pulled the price below the 20-day EMA, but the bulls are defending the 50% Fibonacci retracement level of $0.71. Buyers will have to drive the price above the downtrend line to open the doors for a possible rally to $0.88. </p><p>Alternatively, if the price turns down from the downtrend line, it will suggest that bears are trying to gain the upper hand. A break and close below the 61.8% retracement level of $0.67 could indicate that the bears are back in the game.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-25T19:05:49.000Z",
    "title": "Amazon invests $100 million in AI education",
    "url": "https://www.cryptopolitan.com/amazon-invests-100-million-in-ai-education/",
    "description": "As one of the world&#8217;s foremost e-commerce giants, Amazon is launching an ambitious endeavor into the realm of artificial intelligence (AI). With a significant investment of $100 million, Amazon Web Services (AWS) has announced the establishment of the AWS Generative AI Innovation Center. This novel initiative is designed to aid customers in creating and implementing ... <a title=\"Amazon invests $100 million in AI education\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amazon-invests-100-million-in-ai-education/\" aria-label=\"More on Amazon invests $100 million in AI education\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-25T18:55:39.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and the platform they need to build blockchain solutions. At this time, we can only make educated guesses ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-25T18:41:54.000Z",
    "title": "Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?",
    "url": "https://www.cryptopolitan.com/ethereum-price-prediction/",
    "description": "Ethereum Price Prediction 2023-2032 &#8220;The Merge did not change anything for holders/users.&#8221; Is that a fact? Crypto prices are unlikely to see a major recovery without new or returning investors bringing cash back into the market.&#160;Unless the retail people enter the market, Ethereum won&#8217;t strongly blast above ATH. Maybe something sparks retail, though, like Coinbase, ... <a title=\"Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-price-prediction/\" aria-label=\"More on Ethereum Price Prediction 2023-2032: Will ETH reach $8000 soon?\">Read more</a>"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-25T18:45:13.000Z",
    "title": "$2,300,000,000,000 Asset Management Giant Registers for Crypto Custody License in France",
    "url": "https://dailyhodl.com/2023/06/25/2300000000000-asset-management-giant-registers-for-crypto-custody-license-in-france/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/Files-Trademark-crypto-wallet.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/Files-Trademark-crypto-wallet.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/Files-Trademark-crypto-wallet.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/Files-Trademark-crypto-wallet.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/Files-Trademark-crypto-wallet.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/Files-Trademark-crypto-wallet.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/Files-Trademark-crypto-wallet.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>One of Europe’s largest asset-servicing groups has recently been granted the license by the financial market regulator Autorité des Marchés Financiers (AMF) to provide crypto custody services in France.  According to a new press release, CACEIS Bank, the CACEIS group&#8217;s banking arm in France, just received PSAN (Prestataires de Services sur Actifs Numériques) status from [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/25/2300000000000-asset-management-giant-registers-for-crypto-custody-license-in-france/\">$2,300,000,000,000 Asset Management Giant Registers for Crypto Custody License in France</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]