[
  {
    "source": "CryptoGlobe",
    "date": "2023-07-22T14:40:40.000Z",
    "title": "Anchorage Digital Sees Unstoppable Institutional Crypto Boom Amid Regulatory Challenges",
    "url": "https://www.cryptoglobe.com/latest/2023/07/anchorage-digital-sees-unstoppable-institutional-crypto-boom-amid-regulatory-challenges/",
    "description": "Anchorage Digital, a pioneering crypto platform offering comprehensive financial services and infrastructure solutions, is experiencing a remarkable upswing in institutional interest in the crypto sector. As shared in an interview with The Block, Diogo Mónica, the co-founder and president of Anchorage Digital, disclosed that the firm’s assets have swelled by 80% in Q1 2023, despite […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-22T15:00:00.000Z",
    "title": "Bitcoin Price Analysis:  Risks Below 29768 - 23 July 2023",
    "url": "https://cryptodaily.co.uk/2023/07/bitcoin-price-analysis-risks-below-29768-23-july-2023",
    "description": "<p>BTC/USD Breach of 29768 at Risk:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 23 July 2023</p>\n<p>Bitcoin (BTC/USD) has been unable to sustain upward traction early in the Asian session as the pair remains pressured below the 30000 figure after recently topping out around the 30060.28 level, right around an upside price objective associated with recent buying pressure around the 29525 and 30059.95 levels.&nbsp; &nbsp;Following the print around 30060, downside price pressures reversed at the 29768.19 area, right around a downside price objective associated with recent selling pressure around the 30421 and 30281 levels.&nbsp; Additional downside price objectives include the 29403, 29089, 28775, 28386, and 27757 levels.&nbsp; Below current price activity, the 28095.44 area represents the 23.6% retracement of the historical depreciating range from 69000 to 15460.&nbsp;&nbsp;</p>\n<p>Following recent upside activity, areas of technical support and potential buying pressure include the 28306, 27466, 26428, and 26272 levels.&nbsp; Above the market, upside price objectives include the 30526, 30611, 30762, and 31145 areas.&nbsp; Upside price objectives related to other levels of buying pressure include the 32125 and 33569 areas, and Stops are cited above additional upside price objectives around the 32043, 34531, 34658, and 35912 areas.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;above the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 100-bar MA (hourly) and below the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;200-bar MA&nbsp;(4-hourly) at 29954.91 and the&nbsp;50-bar MA&nbsp;(Hourly) at 29869.83.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  }
]