[
  {
    "source": "Decrypt",
    "date": "2024-03-19T01:44:14.000Z",
    "title": "NVIDIA Unveils Project Gr00t for Robotic AI, Apple Vision Pro Integration",
    "url": "https://decrypt.co/222282/nvidia-project-groot-ai-robots-blackwell-gpu-apple-vision-pro",
    "description": "CEO Jensen Huang showed off the \"very, very big\" Blackwell AI GPU and real-world AI use cases from Mercedes and Siemens."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-19T02:00:35.000Z",
    "title": "Super Micro Computer’s Steadfastness Amidst Contemporary Stock Market Fluctuations 1",
    "url": "https://www.cryptopolitan.com/super-micro-computer-steadfastness-due-to-ai/",
    "description": "In the ever-evolving landscape of financial markets, Super Micro Computer&#160; stands as a beacon of resilience amidst recent stock market fluctuations. Due to the unpredictable nature of market dynamics, the company&#8217;s unwavering commitment to innovation and excellence has fortified its position as a stalwart in the AI industry. This landmark event initially fueled optimism, driving [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-19T02:00:49.000Z",
    "title": "Ether.fi $210M Airdrop Sparks Market Turbulence, ETHFI Value Drops By 35%",
    "url": "https://www.newsbtc.com/news/ether-fi-210m-airdrop-sparks-market-turbulence-ethfi-value-drops-by-35/",
    "description": "ETHFI, the governance token of the decentralized liquid staking protocol Ether.fi, debuted for $4.13 following its distribution through its airdrop on March 18.  However, since the $210 million airdrop, the value of ETHFI has experienced a significant decline, plummeting over 35% to its current trading price of $3.05, according to CoinGecko data. ETHFI Airdrop Attracts 20,000 Participants Market expert Tom Wan has provided a summary of the ETHFI airdrop. Out of the total supply of 16.8 million ETHFI tokens, approximately 28% have been claimed by participants.  Related Reading: Standard Chartered Predicts Bitcoin At $150,000, ETH At $8,000 By Year-End The airdrop attracted around 20,000 claimers, showcasing considerable interest in the token distribution. Notably, the top wallets, accounting for 1.67% of the total distribution, have the potential to receive between 10,000 and 25,000 ETHFI tokens, reflecting substantial holdings. Most claimers, comprising approximately 67% of participants, are expected to receive a lower allocation of ETHFI tokens, ranging from 175 to 500.  This distribution strategy aims to ensure a broader and more equitable dispersion of the tokens among participants. However, an interesting observation is that 76% of claimers have transferred their ETHFI tokens to other wallets, indicating a potential desire for liquidity or trading activities. Furthermore, it is noteworthy that 38% of the token receivers are new wallets, suggesting an expansion of the ETHFI user base as of May 1, 2023. This influx of new participants showcases a growing interest in the governance and utility offered by Ether.Fi&#8217;s protocol. Ether.fi Witnesses Surge In Total Value Locked Ether.fi has experienced notable growth in net deposits and Total Value Locked (TVL), as evidenced by data provided by Token Terminal. However, the platform has faced fluctuations in its active user base.  According to Token Terminal, net deposits on Ether.fi have significantly increased, reaching $2.99 billion over the past 30 days alone. This marks a significant growth rate of 136.9%. Simultaneously, the TVL on Ether.fi has mirrored the surge in net deposits, which also amount to $2.99 billion over the same 30-day period. This metric represents the total value of assets, predominantly cryptocurrency, locked within the protocol.  However, while Ether.fi has witnessed robust growth in net deposits and TVL, the platform has experienced fluctuations in its active user base. Daily active users have shown a considerable decline of 54.3% over the past 30 days, currently standing at 506.  Similarly, weekly active users have experienced a more moderate decline of 3.5%, currently standing at 5,780. This suggests that while there has been a slight reduction in user engagement every week, a significant portion of the user base remains actively involved with the protocol. The most substantial decline in user activity is observed in monthly active users, with a notable drop of 68.9% over the past 30 days. The figure currently stands at 14,740 users.  Related Reading: Solana Memecoin Presale Gone Wrong: Creator Accidentally Burns $10M, Whale Makes Huge Profit Overall, the distribution of the ETHFI token through the airdrop has garnered significant attention and participation. At the same time, the token&#8217;s value has experienced a decline since its initial listing, the long-term potential and impact of ETHFI within the Ether.Fi ecosystems are yet to be fully realized. Featured image from Shutterstock, chart from TradingView.com"
  }
]