[
  {
    "source": "Cointelegraph",
    "date": "2023-11-03T19:47:32.000Z",
    "title": "FTX advisers sharing customers’ data with FBI: Report ",
    "url": "http://cointelegraph.com/news/ftx-advisers-sharing-customers-data-with-fbi-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/100f7847-ba7c-4274-ae32-d6096ff22093.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>FTX advisers have complied with subpoenas from multiple FBI field offices in recent months, providing law enforcement with records of some customers’ trades. </p>\n                    <p><p>Advisers for bankrupt crypto exchange FTX have been <a href=\"https://www.bloomberg.com/news/articles/2023-11-03/ftx-bankruptcy-advisers-provided-customer-trading-data-to-fbi#xj4y7vzkg\" target=\"_blank\" rel=\"noopener nofollow\">disclosing</a> data from customers’ transactions and accounts with the Federal Bureau of Investigation (FBI), according to court documents seen by Bloomberg. </p><p>In response to subpoenas issued by several FBI field offices during the past few months, FTX consultants turned over to law enforcement records of specific customers’ trades on the bankrupt crypto exchange. </p><p>The FBI’s requests were disclosed on billing records from Alvarez and Marsal, a consultancy serving as financial advisers for FTX. Over the past few months, the firm’s staff extracted information from some customers’ trades for FBI offices in Portland, Philadelphia, Oakland, Minneapolis, and Cleveland.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/4555fe71-8813-457c-b26e-62362e0fc3c3.png\"  /><figcaption style=\"text-align: center;\"><em>Screenshot of monthly fee statement of Alvarez and Marsal. Source: Kroll</em></figcaption></figure><p>The billing records did not reveal what type of investigation the FBI conducted or who the target was, although a grand jury subpoena is mentioned in one of the records. </p><p>In a court filing, Alvarez and Marsal reported that it shared transaction data from FTX's cloud computing provider in September in response to a subpoena issued by the FBI’s Philadelphia office. It also conducted investigations into customer accounts and transactions in July, following a request from the FBI’s Oakland office. Additionally, in August, the firm extracted customer information related to specific transactions, in compliance with a subpoena from the FBI's Portland office. </p><p>FTX customers will ultimately pay for the work. According to Bloomberg, in July, August, and September, two advisers invoiced more than $21,000 for FBI-related services. In total, Alvarez and Marsal have charged almost $100 million in fees from FTX since November 2022, court records show. The money will be reduced from recoveries for FTX customers. </p><p>FTX’s new CEO, John J. Ray III, recently<a href=\"https://cointelegraph.com/news/ftx-bankruptcy-proceedings-customer-assets-clawback-shortfall-claim\"> revealed that the exchange's customers</a> could receive over 90% of their assets by the end of 2024 as a result of a proposed settlement between FTX creditors and debtors.</p><p><strong><em>Magazine:</em></strong> <a href=\"https://cointelegraph.com/magazine/ethereum-restaking-blockchain-dangerous/\"><strong><em>Ethereum restaking — Blockchain innovation or dangerous house of cards?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-03T19:40:48.000Z",
    "title": "US Treasury sanctions Russian national for helping oligarchs evade sanctions with crypto, cash, and real estate",
    "url": "https://cryptoslate.com/us-treasury-sanctions-russian-national-for-helping-oligarchs-evade-sanctions-with-crypto/",
    "description": "<p>The U.S. Department of the Treasury and its Office of Foreign Assets Control (OFAC) sanctioned a Russian businesswoman on Nov. 3. The agency said that Russian national Ekaterina Zhdanova helped the country&#8217;s elites launder and move funds using virtual currency and other methods. The Treasury said that Zhdanova used virtual currency to perform large cross-border [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/us-treasury-sanctions-russian-national-for-helping-oligarchs-evade-sanctions-with-crypto/\">US Treasury sanctions Russian national for helping oligarchs evade sanctions with crypto, cash, and real estate</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-03T20:00:26.000Z",
    "title": "Abu Dhabi launches first global digital ledger technology regulations ",
    "url": "https://crypto.news/abu-dhabi-launches-first-global-digital-ledger-technology-regulations/",
    "description": "Abu Dhabi introduces a trailblazing DLT regulatory framework, setting global standards for blockchain foundations and DAOs."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-03T19:47:19.000Z",
    "title": "Tellor account compromised after price surge",
    "url": "https://crypto.news/tellor-account-compromised-after-price-surge/",
    "description": "Tellor reports double-digit gains in the past 24 hours, where it currently sits at $112.21."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-03T20:00:57.000Z",
    "title": "Will Cardano Replicate Solana’s Surge? Analyst Reveals Similarities For 80% Rise",
    "url": "https://www.newsbtc.com/news/cardano/cardano-replicate-solana-80-rise/",
    "description": "Cardano (ADA) has returned to the radar of crypto investors after an interesting run brought its price up above $0.3. This price level has been elusive for a while but eventually, the bulls have gotten a hold of it. As the market faces an impending downturn, Cardano’s run-up could be threatened. However, one crypto analyst believes that ADA could have gone the way of Solana over the past few days. Cardano Doing A Solana Run In a TradingView post, crypto analyst Alan Santana revealed their expectations for the Cardano price. The initial post which was made on October 30 used the daily timeframe of the coin’s performance to figure out what could be ahead for it. Santana points out that ADA continued to show bullish consolidation for the prior week which no doubt contributed to its rising prices. Eventually, the price did break out and ADA made a run for the $0.3 resistance and ended up beating it. But even this achievement is small fish compared to Solana’s 80% run. Related Reading: Legal Expert Explains Why Ripple Will Always Back XRP The analyst pointed out that ADA did not retrace as expected by the bullish consolidation continued on the way up instead. Like with any consolidation in an asset, this helped Cardano to gather strength and momentum that could trigger a price pump. Santana was proven right when ADA did eventually bear $0.3 and ran up as high as $0.31, after which came the update to the initial post. Here, the crypto analyst alludes to the correct market correction that brought Bitcoin back below $35,000 and noted that major altcoins will follow any retracement made by the market. Source: Tradingview.com However, for Cardano, the analyst noted that it is moving in the same way that Solana did to hit a new yearly high. In the last few days, the SOL price moved independently of Bitcoin and Cardano is starting to do the same. While Bitcoin is down 1.94% in the last day, Cardano is seeing 5% gains in the same time frame. If this breakout continues, then ADA could break away from the Bitcoin trend completely and form its own. Following Solana’s rise, such a rally would put ADA well on the path toward the $0.4 resistance. “When the market is set to continue straight up, while some pairs will retrace a little bit others will continue growing with force,” the analyst said. Santana’s chart points to a possible rise to $0.35 at the top of the rally. This would mean an 80% rise in price from the initial price at the time the analysis was made. Thus, a very similar rally pattern to that of Solana. ADA Investors Take The Lead Cardano’s rise over the last few days has not gone unnoticed and a recent report from on-chain tracker Santiment has hinted at what could be the possible driver behind it. According to the post, ADA whale and address activity rose quickly and touched 32% in the last three weeks. This brought the on-chain activity to a new three-month high. Related Reading: ProShares Goes Short On Ethereum With New ETF Launch The price which seems to be hell-bent on pulling a Solana also rose 36% in a two-week period, making it one of the top winners during this time. A continuation of this on-chain activity trend will push the price further in the coming weeks. Source: Santiment on X However, with the price having risen so much, some level of profit-taking is expected. This would inadvertently lead to a price dip. But as long as demand stays up, it’ll only be a temporary setback. ADA price clears $0.32 &#124; Source: ADAUSD On Tradingview.com Featured image from Bitcoin News, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-03T19:41:46.000Z",
    "title": "Bitcoin Soars in Anticipation of its Halving Event; InQubeta Set to Be at the Forefront of the Next Bullish Wave",
    "url": "https://www.crypto-news-flash.com/bitcoin-soars-in-anticipation-of-its-halving-event-inqubeta-set-to-be-at-the-forefront-of-the-next-bullish-wave/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-soars-in-anticipation-of-its-halving-event-inqubeta-set-to-be-at-the-forefront-of-the-next-bullish-wave",
    "description": "<img width=\"512\" height=\"256\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-2.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-2.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-2-300x150.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The entire crypto community and landscape are abuzz as they anticipate the Bitcoin (BTC) halving event and the resulting surge. With only a few months to go, Bitcoin has been rising sharply in anticipation of the event. InQubeta (QUBE), a different project, is simultaneously gathering momentum. Its unique concept is expected to lead the next [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-03T20:00:56.000Z",
    "title": "Crypto Strategist Says He’s Bullish on Ethereum Rivals Solana and Avalanche – Here Are His Targets",
    "url": "https://dailyhodl.com/2023/11/03/crypto-strategist-says-hes-bullish-on-ethereum-rivals-solana-and-avalanche-here-are-his-targets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/strategist-bullish-on-rivals.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/strategist-bullish-on-rivals.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/strategist-bullish-on-rivals.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/strategist-bullish-on-rivals.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/strategist-bullish-on-rivals.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/strategist-bullish-on-rivals.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/strategist-bullish-on-rivals.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular cryptocurrency analyst is expressing a bullish outlook toward two of Ethereum&#8217;s (ETH) biggest competitors. Pseudonymous crypto trader Altcoin Sherpa tells his 197,500 followers on the social media platform X that Solana (SOL) and Avalanche (AVAX) are both setting the stage for another leg up. According to the trader, Solana could increase more than [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/03/crypto-strategist-says-hes-bullish-on-ethereum-rivals-solana-and-avalanche-here-are-his-targets/\">Crypto Strategist Says He’s Bullish on Ethereum Rivals Solana and Avalanche – Here Are His Targets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-03T19:55:47.000Z",
    "title": "Trader Says Market Behavior Signaling Bitcoin (BTC) Could Squeeze to the Upside – Here’s Why",
    "url": "https://dailyhodl.com/2023/11/03/trader-says-market-behavior-signaling-bitcoin-btc-could-squeeze-to-the-upside-but-theres-a-catch/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/market-behavior-squeeze-upside.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/market-behavior-squeeze-upside.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/market-behavior-squeeze-upside.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/market-behavior-squeeze-upside.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/market-behavior-squeeze-upside.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/market-behavior-squeeze-upside.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/market-behavior-squeeze-upside.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst says that market behavior is signaling a breakout to the upside for Bitcoin (BTC). In a new thread, pseudonymous crypto strategist Credible Crypto tells his 349,500 followers on the social media platform X that the king crypto should surge as long as overeager short sellers unload into BTC’s support level. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/03/trader-says-market-behavior-signaling-bitcoin-btc-could-squeeze-to-the-upside-but-theres-a-catch/\">Trader Says Market Behavior Signaling Bitcoin (BTC) Could Squeeze to the Upside – Here&#8217;s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-03T19:55:19.000Z",
    "title": "Crypto Trader Updates Dogecoin and Solana Outlook, Sees ‘Moment of Truth’ for Bitcoin Layer-2 Project",
    "url": "https://dailyhodl.com/2023/11/03/crypto-trader-updates-dogecoin-and-solana-outlook-sees-moment-of-truth-for-bitcoin-layer-2-project/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/Solana-Dogecoin-and-These.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/Solana-Dogecoin-and-These.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/Solana-Dogecoin-and-These.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/Solana-Dogecoin-and-These.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/Solana-Dogecoin-and-These.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/Solana-Dogecoin-and-These.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/Solana-Dogecoin-and-These.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader is taking a deep dive into the exploding altcoin markets, starting with Dogecoin (DOGE). Pseudonymous crypto analyst Rekt Capital tells his 364,700 followers on the social media platform X that DOGE&#8217;s weekly close will be the most important signal of what&#8217;s to come. &#8220;That &#8216;buy-the-dip&#8217; behavior we saw yesterday is looking like [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/03/crypto-trader-updates-dogecoin-and-solana-outlook-sees-moment-of-truth-for-bitcoin-layer-2-project/\">Crypto Trader Updates Dogecoin and Solana Outlook, Sees ‘Moment of Truth’ for Bitcoin Layer-2 Project</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]