[
  {
    "source": "CoinDesk",
    "date": "2023-09-05T05:43:04.000Z",
    "title": "Multibillion Dollar Oracle Tool Chronicle To Expand Outside of MakerDAO Ecosystem",
    "url": "https://www.coindesk.com/tech/2023/09/05/multibillion-dollar-oracle-tool-chronicle-to-expand-outside-of-makerdao-ecosystem/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Chronicle is said to safeguard over $5 billion in assets held on Maker by ensuring pricing data is in line with the general market."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-05T05:58:59.000Z",
    "title": "Vitalik Buterin on fix for Ethereum centralization — make running nodes easier",
    "url": "https://cointelegraph.com/news/vitalik-buterin-ethereum-centralization-issues-running-nodes-easier",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/c30d0fe7-1890-46ad-982f-af91295cd340.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ethereum co-founder Vitalik Buterin says node centralization is one of Ethereum's main challenges but the perfect solution may not come for another 20 years.</p>\n                    <p><p>The centralization of nodes is one of the biggest problems facing the Ethereum network and should be addressed by making the running of nodes cheaper and easier, according to Ethereum co-founder Vitalik Buterin.</p><p>At current, the majority of the 5,901 active Ethereum nodes are being run through centralized web providers like Amazon Web Services (AWS), which many experts claim leaves the Ethereum blockchain exposed to a centralized point of failure. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/bede3088-5291-46bd-8829-5184c01c6d33.png\"  /><figcaption style=\"text-align: center;\"><em>Distribution of Ethereum nodes from web service providers. Source: Ethernodes</em></figcaption></figure><p>Speaking at Korea Blockchain Week, Buterin outlined six key problems that need addressing to solve centralization but highlighted that the node issue was a “big piece of the puzzle” to ensure the Ethereum network remains decentralized in the long run. </p><p>“One of those six things is making it technically easier for people to run nodes and statelessness is one of the really important technologies in doing that right,” he explained. </p><blockquote>“Today, it takes hundreds of gigabytes of data to run a node. With stateless clients, you can run a node on basically zero.”</blockquote><p>The concept of statelessness refers to removing the reliance on centralized service providers to verify activity on the network. According to the Ethereum <a href=\"https://ethereum.org/en/roadmap/statelessness/\" target=\"_blank\" rel=\"noopener nofollow\">foundation</a>, true decentralization is not possible until node operators can run Ethereum on “modest” and inexpensive hardware. </p><p>As Buterin noted, statelessness forms a key component of the Ethereum roadmap, with major steps towards statelessness being made in “The Verge” and “The Purge” stages:</p><blockquote>“In the longer term there’s a plan to maintain fully verified Ethereum nodes where you could literally it on your phone.”</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Updated roadmap diagram! <a href=\"https://t.co/MT9BKgYcJH\">pic.twitter.com/MT9BKgYcJH</a></p>&mdash; vitalik.eth (@VitalikButerin) <a href=\"https://twitter.com/VitalikButerin/status/1588669782471368704?ref_src=twsrc%5Etfw\">November 4, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Despite statelessness forming a core part of the Ethereum roadmap, Buterin admitted that these highly-technical concerns were unlikely to be addressed any time in the immediate future. </p><p>“These technical problems will have to be addressed eventually — maybe a 10-year timescale, maybe a 20-year timescale,” he said. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ethereum-staking-services-agree-self-limit-validators\"><strong><em>Ethereum staking services agree to 22% limit of all validators</em></strong></a></p><p>Outside of statelessness, Buterin said the next-most significant moves towards decreasing Ethereum centralization included, making documentation easier, lowering barriers to distributed staking, ensuring staking was more secure and more broadly; making it more convenient to stake Ether (ETH) in general.</p><p>Ultimately however, Buterin concluded that the most time-sensitive and pressing concern for Ethereum as whole was achieving higher levels of scalability.</p><p>At present, Ethereum scaling protocols <a href=\"https://cointelegraph.com/news/ethereum-scaling-protocols-drive-zero-knowledge-proof-use-2023\">dominate the use of zero-knowledge (ZK) rollups</a>. </p><p>ZK-rollups have been lauded by many within the Ethereum community as a key tool to achieving scalability, as ZK rollups work to improve throughput on the main Ethereum chain by moving computation and state-storage off chain. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethereums-layer-2-zk-rollups-can-become-interoperable/\"><strong><em>Here’s how Ethereum’s ZK-rollups can become interoperable</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-05T05:48:01.000Z",
    "title": "Swyftx launches ‘Earn and Learn’ — paying Aussies to learn about crypto scams",
    "url": "https://cointelegraph.com/news/swyftx-launches-earn-and-learn-rewards-learn-crypto-scams",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/2ae4e127-ff0c-43d0-99cc-33f10e4af90f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Australian crypto exchange Swyftx said it had identified a rise in demand for crypto education during the bear market as the reason for its launch.</p>\n                    <p><p>Australian crypto exchange Swyftx is launching a new “Earn and Learn” crypto education platform, aimed at rewarding its users for completing courses covering an array of crypto scams. </p><p>The new educational platform will launch on Sept. 6 and comes amid <a href=\"https://cointelegraph.com/news/australian-crypto-scams-increased-by-over-162-with-nearly-150m-lost\">heightened attention over crypto-related scams</a> in Australia. </p><p>Swyftx’s head of corporate affairs, Tom Matthews, said the aim is to better equip the public with knowledge until such a time the industry is fully regulated. It would also serve to help people better understand the crypto market and reduce their susceptibility to scam coins.</p><p>In comments to Cointelegraph, Matthews said that the platform will help users identify different scams such as those involving spurious tokens, social media scams such as <a href=\"https://cointelegraph.com/public/index.php/news/binance-tinder-pig-butchering-lawsuit/amp\">pig butchering</a>, and pump-and-dump schemes. </p><blockquote>“Cryptocurrency scams exist but there’s frustration within the industry around how often this term is bandied about when what people are actually talking about are traditional scams, which happen to involve digital assets.”</blockquote><p>Additionally, the courses will give users an “at a glance” checklist to consider when looking at tokens to assess their utility, he said, adding:</p><blockquote>“This includes areas like the background of their founding teams, the strength of their tokenomics, any weaknesses in the project, the strength and profile of their VC backing, the financials and tokenomics, and understanding the project’s goals and relevance.” </blockquote><p>The exchange, which claims to have 660,000 customers, identified a big rise in demand for crypto <a href=\"https://cointelegraph.com/learn\">education</a> during the bear market. </p><p>The first 4,000 people to successfully complete the first course on fundamental analysis will receive $3.20 (5 Australian dollars) in <a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a> with $64.30 (100 Australian dollars) in total rewards available to each participant over the next 12 months.</p><p>The firm is anticipating up to 80,000 Australians to participate, he said.</p><p>Meanwhile, Matthews added that the demand for more education has been largely driven by the high level of grassroots crypto adoption in Australia, before commenting: </p><blockquote>“The demand for quality educational resources is close to exponential at the moment. The next market cycle will be driven by knowledge, not hype and people are now far more aware of the risks around token scams or failures in the wake of Terra/Luna.”</blockquote><p>Zac Povolny, co-founder of Australian investor education and research platform Investified, who is contributing to some of the courses said, “With thousands of digital asset opportunities to invest in, it's important to have the skillset and education to cut through and identify assets with real utility and staying power.”</p><p>Many lack the fundamentals necessary for a sustainable project, he added. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-and-blockchain-education-becomes-priority-at-top-universities\"><strong><em>Crypto and blockchain education becomes priority at top universities</em></strong></a></p><p>Globally, several major exchanges such as Coinbase have <a href=\"https://cointelegraph.com/news/coinbase-launches-program-to-educate-users-about-crypto-beyond-bitcoin\">launched</a> similar educational platforms with crypto incentives. Binance also offers crypto-earning opportunities through its Academy section. </p><p>Coinbase Earn went live in late 2018 offering a handful of altcoins such as ZRX, ZTX, GRT, and COMP for completing short educational courses on the respective assets, however, it was often over-subscribed at the time. </p><p><strong><em>Magazine:</em></strong><a href=\"https://cointelegraph.com/magazine/wolf-of-all-streets-world-bitcoin-hits-1m-1-million-hall-of-flame/\"><strong><em> </em></strong><strong><em>Hall of Flame: Wolf Of All Streets worries about a world where Bitcoin hits $1M</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-05T06:07:52.000Z",
    "title": "Researchers Develop LNMesh, Enabling Offline Bitcoin Payments via Lightning Network",
    "url": "https://cryptodaily.co.uk/2023/09/researchers-develop-lnmesh-enabling-offline-bitcoin-payments-via-lightning-network",
    "description": "This concept employs localized mesh networks wherein nodes are directly connected through Bluetooth and WiFi, rather than the internet."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T05:52:41.000Z",
    "title": "Chinese Tech Giants Announce Public Availability of AI Models",
    "url": "https://www.cryptopolitan.com/china-announce-availability-of-ai-models/",
    "description": "In a significant development in China&#8217;s technology sector, two prominent tech companies, iFlytek and 360 Security Technology, have recently unveiled their artificial intelligence (AI) models for public use. Notably, the regulatory landscape in China for AI products is distinct from that of many other countries. It mandates that companies undergo security assessments and obtain government ... <a title=\"Chinese Tech Giants Announce Public Availability of AI Models\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-announce-availability-of-ai-models/\" aria-label=\"More on Chinese Tech Giants Announce Public Availability of AI Models\">Read more</a>"
  }
]