[
  {
    "source": "Cointelegraph",
    "date": "2024-03-17T05:58:02.000Z",
    "title": " Pro-XRP lawyer confident he can win senate bid, sets $1M campaign goal  ",
    "url": "https://cointelegraph.com/news/john-deaton-senator-elizabeth-warren-massachusetts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNmYwNGVmYjMtYmE5NS00YjQ4LThiNTktMjEzZmYxZTlmMDU2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The pro-XRP lawyer shared with his online following that he's covered half of the campaign funds and asked if they could pitch in the rest via cash or crypto.</p>\n                    <p><p>Pro-XRP lawyer John Deaton has claimed he is ready to take on cryptocurrency critic Senator Elizabeth Warren in the Massachusetts Senate race, urging his large crypto-friendly social media following to financially back his campaign.</p><p>In a post on X (formerly Twitter), Deaton told his 324,100 followers that he invested $500,000 of his own money into the senate campaign. He further shared that he is optimistic he can challenge Warren, even though she's held the position in Massachusetts for 11 years.</p><p>The election is scheduled for September 3. Although Deaton has contributed 50% of the campaign funds, he has called on his followers to help raise an additional $500,000, which can be donated in either cash or crypto.</p><p><a href=\"https://cointelegraph.com/news/john-deaton-senator-elizabeth-warren-massachusetts\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2024-03-17T06:06:58.000Z",
    "title": "DeFi Platform Mozaic Finance Suffers $2.4 Million Hack",
    "url": "https://nulltx.com/defi-platform-mozaic-finance-suffers-2-4-million-hack/",
    "description": "Mozaic Finance, a decentralized finance (DeFi) platform, recently fell victim to a hack on the Arbitrum network, resulting in the loss of $2.4 million.  The breach occurred due to a vulnerability in a private key, allowing the attacker to exploit a specific contract function called &#8220;bridgeViaLifi,&#8221; accessible only by a [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-17T05:49:20.000Z",
    "title": "$BOME Memecoin Surges After Binance Listing Announcement",
    "url": "https://nulltx.com/bome-memecoin-surges-after-binance-listing-announcement/",
    "description": "$BOME, a memecoin recently launched by renowned Pepe Meme artist Darkfarms, has witnessed a remarkable surge in its price and market capitalization following a significant announcement from Binance. Today, Binance revealed its plan to list BOOK OF MEME (BOME) and commence spot trading for this cryptocurrency at 12:30 (UTC) on [&#8230;]"
  }
]