[
  {
    "source": "NewsBTC",
    "date": "2023-12-27T00:00:58.000Z",
    "title": "Forget High Gas Fee Challenges, Ethereum Remains Bullish: Time To Buy More?",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-remains-bullish-gas-fees/",
    "description": "Despite concerns over network congestion and high gas fees, Ethereum remains bullish in the long term, according to borovik.eth&#8211;a partner at Rollbit, who posted on X on December 26. The key factors driving the positive outlook are pointing to Ethereum&#8217;s developer ecosystem, its role in the broader blockchain ecosystem, and the launch of numerous Layer-2 solutions (L2s).  Will Layer-2 Activity Drive ETH To New Highs? Borovik.eth remained deviant and optimistic about ETH, even with Solana (OSL) and other layer-1 coins like Cardano (ADA) soaring in 2023. In the analyst&#8217;s view, Ethereum&#8217;s scaling challenges are manageable, believing that developers will find ways of &#8220;resolving this concern permanently over the long term.&#8221; Related Reading: Worldcoin Shows Bullish Breakout, Analyst Predicts 80% Rally Based on this optimism, the Rollbit partner believes that ETH will likely recover strongly in the coming sessions considering the level of development, especially of layer-2 scaling options meant for the pioneer smart contract platform. According to Borovik.eth, the development of layer-2 off-chain options backed by massive companies, for instance, Coinbase, a crypto exchange, and venture capitalists (VCs), positions Ethereum (ETH) favorably for a bull run. As of December 26, ETH remains in an uptrend but is cooling off after solid gains in Q4 2023. At spot rates, ETH is underperforming most layer-1 platforms like Injective Protocol (INJ) and Solana (SOL), whose prices rallied, reaching new 2023 highs. ETH prices are still trending below $2,400, a critical resistance level. If bulls overcome this line, ETH may fly towards $3,500 or better in the months ahead. The spike in SOL&#8217;s valuation, especially in H2 2023, has led to a comparison with ETH. Even so, most traders are optimistic. Arthur Hayes recently stated that users should begin rotating funds from SOL to ETH, an endorsement of the second most valuable coin by market cap. Ethereum Layer-2s Manage Over $18.8 Billion While Ethereum faces challenges around on-chain scaling, developers have been working hard to resolve this issue. The release of layer-2 off-chain options using rollups has been key in this drive. Most of these solutions, including Arbitrum and Optimism, have been critical in alleviating pressure from the mainnet, thus reducing gas fees. According to L2Beat, layer-2 protocols manage over $18 billion as total value locked (TVL). There are also 34 active projects, with 23 more being developed. Among the big companies hitching the layer-2 ride is Coinbase, where through Base, users can transact cheaply while relying on the Ethereum mainnet for security. According to Borovik.eth, over 60% of Base&#8217;s revenue is from rollup fees charged, highlighting the importance of their scaling solution and the role Ethereum plays in all this.  Related Reading: Shiba Inu Whale Moves $45 Million In SHIB, Bullish? The upcoming Dencun Upgrade set for integration next year will further slash layer-2 fees. Developers plan to release this update in the Goerli test network as early as mid-January 2024. Feature image from Canva, chart from TradingView"
  }
]