[
  {
    "source": "Cointelegraph",
    "date": "2024-02-18T23:25:21.000Z",
    "title": " Curb your enthusiasm — crypto prices aren&#039;t going to move as quickly as you think ",
    "url": "https://cointelegraph.com/news/curb-your-enthusiasm-crypto-prices-move-quickly-you-think",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMjMyMjhmOWItZWFlMi00YWE2LWI4ZDItYzM1MjY3OGE0NGNlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A $100,000 target for Bitcoin isn't off the table for 2024 — but it could be a slow and steady rise rather than the quick one you might be anticipating. </p>\n                    <p><p>February has been great for Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) — there’s no denying it. Even the most cautious, poker-faced of investors would have found it hard to contain their excitement as BTC stormed past the $50,000 milestone. </p><p>So optimistic was the sentiment that prices barely even flinched at the January CPI report — a 2% drop is nothing in crypto terms. Comparisons to the 2021 bull run were naturally drawn, fueling a fresh set of “<a href=\"https://cointelegraph.com/news/dont-undervalue-bitcoin-etf-influence-says-adam-back\">Bitcoin at $100,000</a>” predictions.</p><p>This excitement, however, should be tempered. On close examination, the current rally appears to be largely psychologically driven. The bigger picture indicates we’re in for a lot more of the boring price action that preceded it, and that 2024 will be altogether different from the euphoria of 2021.</p><p><a href=\"https://cointelegraph.com/news/curb-your-enthusiasm-crypto-prices-move-quickly-you-think\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2024-02-18T23:30:00.000Z",
    "title": "DeeStream draws Solana and Ethereum investment after market surge",
    "url": "https://crypto.news/deestream-draws-solana-and-ethereum-investment-after-market-surge/",
    "description": "Market surges as ETH &#38; SOL grow, but DeeStream steals the spotlight with potential 30x returns, becoming a prime investment focus. There has been an all-round increase across the cryptocurrency market. Ethereum (ETH) looks set to reach previous highs, and&#8230;"
  }
]