[
  {
    "source": "CryptoGlobe",
    "date": "2023-12-10T11:00:17.000Z",
    "title": "Samsung and Mastercard Partner to Enhance Digital Wallet Offerings with Wallet Express: ‘More Choice for UK Consumers to Pay Their Way’",
    "url": "https://www.cryptoglobe.com/latest/2023/12/samsung-and-mastercard-partner-to-enhance-digital-wallet-offerings-with-wallet-express-more-choice-for-uk-consumers-to-pay-their-way/",
    "description": "Samsung Electronics and Mastercard have announced a new partnership centered around Mastercard’s Wallet Express program. This collaboration aims to streamline and enhance digital wallet services for banks and card issuers, offering a more efficient way to expand their digital offerings. The partnership allows issuers to integrate Samsung Wallet into their services, providing consumers with a […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-12-10T10:48:54.000Z",
    "title": "BTC Developer Luke Dashjr: 2024 Bitcoin Core Update Will Disrupt Ordinals and BRC-20 Tokens",
    "url": "https://www.cryptoglobe.com/latest/2023/12/btc-developer-luke-dashjr-2024-bitcoin-core-update-will-disrupt-ordinals-and-brc-20-tokens/",
    "description": "Understanding Ordinals Ordinals are a novel application within the Bitcoin blockchain, allowing for the inscription of data, such as text, images, and videos, onto individual satoshis, the smallest unit of Bitcoin. This process transforms these satoshis into unique, non-fungible tokens (NFTs), each with its distinct data imprint. Ordinals have expanded the utility of Bitcoin, traditionally […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-10T10:45:46.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now: how will this affect our Cosmos Price Prediction? How ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-10T10:45:00.000Z",
    "title": "Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better ... <a title=\"Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fantom-price-prediction/\" aria-label=\"More on Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\">Read more</a>"
  }
]