[
  {
    "source": "Decrypt",
    "date": "2023-06-30T22:25:40.000Z",
    "title": "Logan Paul Still Hasn't Refunded CryptoZoo NFT Buyers Six Months Later",
    "url": "https://decrypt.co/146954/logan-paul-still-hasnt-refunded-cryptozoo-nft-buyers-six-months-later",
    "description": "In January, Logan Paul said he would burn his ZOO tokens and commit $1.8 million to refund buyers of his NFT game project. What happened?"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-30T22:30:00.000Z",
    "title": "FedNow “early adopter” list contains no blockchains, but some may integrate later",
    "url": "https://cointelegraph.com/news/fednow-early-adopter-list-contains-no-blockchains-but-some-may-integrate-later",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/d0b6d9de-8e78-4a39-936b-3f5a500f5989.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Two blockchain networks had previously announced integration with the Fed’s instant payment service, but they were not found on a new list of certified providers.</p>\n                    <p><p>The Federal Reserve’s upcoming instant payment system, FedNow, <a href=\"https://www.frbservices.org/financial-services/fednow/organizations-certified\" target=\"_blank\" rel=\"noopener nofollow\">released</a> its list of certified “early adopters” on June 29. The organizations on the list have been certified as ready to connect with the platform when it launches in late July. No blockchain networks are on the list, despite at least two having previously announced that they would connect to the instant payment system.</p><p>The FedNow service stated that some organizations not on the list may be integrated later, and Metal Blockchain said it still intends to connect with the platform once it gains “the appropriate bank sponsor.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/3f763297-2657-4d8b-8279-f516680ac7a0.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>List of organizations certified with the FedNow Service. Source: Federal Reserve Board Services</em></figcaption></figure><p>FedNow is an instant payment service in development by the United States Federal Reserve. The Federal Reserve claims that the service will allow for instant transfers between banks in the U.S., similar to the United Kingdom’s Faster Payments and Europe’s Single Euro Payments Area systems.</p><p>Currently, bank transfers within the U.S. can only be done through ACH or wire transfers, which are not settled instantly. FedNow is <a href=\"https://cointelegraph.com/news/federal-reserve-confirms-july-launch-for-fednow-instant-payment-service\">scheduled to launch in July</a>.</p><p>At least two blockchain networks have announced that they will be “connecting” to FedNow when it launches. One is Metallicus’ Metal Blockchain. The Metallicus team stated in May that its network <a href=\"https://cointelegraph.com/news/federal-reserve-s-fednow-will-integrate-with-metal-blockchain\">will allow instant conversion of cash to stablecoins</a> through a connection with FedNow. At the time, FedNow’s official website also listed Metallicus in its “service provider showcase,” providing further evidence that the integration was going to occur.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/49718def-6009-4698-ba9a-557cfdb07471.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Metal Blockchain’s listing in the FedNow “service provider showcase” on May 11, which was subsequently removed. Source: FedNow website on May 11</em></figcaption></figure><p>This listing was removed within a few days of the announcement being made. On May 15, Twitter user JeffXRP <a href=\"https://twitter.com/jeff_xrp/status/1658069707843416064\" target=\"_blank\" rel=\"noopener nofollow\"></a><a href=\"https://twitter.com/jeff_xrp/status/1658069707843416064\" target=\"_blank\" rel=\"noopener nofollow\">remarked</a> on the strangeness of its sudden removal. </p><p>The list of “service providers” released on June 29 includes ACI Worldwide, ECS Fin, FPS Gold, Open Payment Network and 11 other payment providers, but neither Metallicus nor Metal Blockchain are on it.</p><p>In a conversation with Cointelegraph, Metallicus co-founder and CEO Marshall Hayner claimed that the company still intends to integrate Metal Blockchain with FedNow once it obtains the proper bank sponsorship, stating:</p><blockquote>“Metallicus is currently in communication with the Federal Reserve and the FedNow program administrators while we seek the appropriate bank sponsor and stay focused on building our bank chain technology.”</blockquote><p>The other blockchain network that had announced integration with FedNow was Tassat, creator of the TassatPay service and Digital Interbank Network. Tassat claims its network is a business-to-business private blockchain for commercial banks. In March, it announced that it <a href=\"https://cointelegraph.com/news/tassat-blockchain-to-join-fednow-service-with-b2b-onramp-as-pilot-prepares-for-launch\">will connect its digital B2B payment platform</a> to the upcoming FedNow service.</p><p>Tassat was listed on the FedNow website’s “service provider showcase” as of June 30.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/04798985-cf81-4332-b704-e3c8631c2465.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>TassatPay listing in the FedNow service provider showcase, June 30. Source: FedNow</em></figcaption></figure><p>However, Tassat is not listed as a certified service provider in the June 30 list of “early adopters.” Cointelegraph reached out to the Tassat team through email but did not receive a response by the time of publication. </p><p>In the Federal Reserve’s announcement, it explained that some organizations not on the list may become service providers in the future:</p><blockquote>“In addition to the initial adopters, the Federal Reserve continues to work with and onboard financial institutions and service providers planning to join later in 2023 and beyond, as the initial step to growing a robust network aimed at reaching all 10,000 U.S. financial institutions.”</blockquote><p>FedNow has been criticized by some blockchain users for allegedly being a step toward a central bank digital currency (CBDC). U.S. presidential candidate Robert F. Kennedy Jr. has claimed that it <a href=\"https://cointelegraph.com/news/white-house-hopeful-rfk-jr-says-instant-payments-may-lead-to-financial-slavery\">will lead to “financial slavery.”</a> In April, the Federal Reserve issued a statement <a href=\"https://www.federalreserve.gov/faqs/is-fednow-replacing-cash-is-it-a-central-bank-digital-currency.htm\" target=\"_blank\" rel=\"noopener nofollow\">denying</a> that FedNow is related to a CBDC.</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-30T22:15:43.000Z",
    "title": "Fidelity, VanEck, and more refile spot Bitcoin ETF applications after reports of SEC rejections",
    "url": "https://cryptoslate.com/fidelity-vaneck-and-more-refile-spot-bitcoin-etf-applications-after-reports-of-sec-rejections/",
    "description": "<p>Several asset managers have resubmitted applications for their spot Bitcoin ETFs following this morning&#8217;s reports that those applications did not meet the U.S. Securities and Exchange Commission&#8217;s (SEC) standards over language surrounding surveillance-sharing agreements. The Wall Street Journal reported on June 30, 2023, that spot Bitcoin ETF applications submitted by Fidelity, WisdomTree, VanEck, Invesco, and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/fidelity-vaneck-and-more-refile-spot-bitcoin-etf-applications-after-reports-of-sec-rejections/\">Fidelity, VanEck, and more refile spot Bitcoin ETF applications after reports of SEC rejections</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-30T22:30:02.000Z",
    "title": "Slovakia to Lower Tax on Income From Crypto Holdings",
    "url": "https://news.bitcoin.com/slovakia-to-lower-tax-on-income-from-crypto-holdings/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2142827489-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Slovakia to Lower Tax on Income From Crypto Holdings\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2142827489-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2142827489-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2142827489-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2142827489-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2142827489-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2142827489-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2142827489.jpg 1281w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Lawmakers in Slovakia have adopted legislation that will reduce the tax burden for cryptocurrency holders in the country. Income derived from long-term investments in digital assets will also be relieved from healthcare taxes, the parliamentarians decided. Investors in Slovakia to Pay 7% Tax on Income From Crypto Held More Than a Year Members of the [&#8230;]"
  }
]