[
  {
    "source": "Decrypt",
    "date": "2023-08-10T12:05:11.000Z",
    "title": "Maker Founder Proposes ‘Pre-Farming Airdrop’ for Spark Lending Platform",
    "url": "https://decrypt.co/152000/maker-founder-proposes-pre-farming-airdrop-for-spark-lending-platform",
    "description": "The airdrop proposal is aimed at increasing borrowing activity through Spark, and allowing early users to “secure early SPK tokens.”"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-10T11:55:00.000Z",
    "title": "US bank reveals $170M in crypto holdings: Q2 earnings report",
    "url": "https://cointelegraph.com/news/us-bank-170-million-crypto-q2-earnings-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/61e36af8-8c47-4fcc-a7d2-ef4038130500.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> Sofi started offering crypto services even before it became a bank and its banking license might change the way it hodl crypto.  </p>\n                    <p><p>San Fransico-based Sofi Bank revealed it holds $170 million in crypto on its balance sheet in the Q2 earning <a href=\"https://s27.q4cdn.com/749715820/files/doc_financials/2023/q2/835cd043-7d0b-4939-96ef-7489876a4ec3.pdf\" target=\"_blank\" rel=\"noopener nofollow\">report</a>. The United States bank that serves over 6 million customers has seen a significant increase in its crypto holdings compared to the last quarter.</p><p>The bank holds Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>), Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>), Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>), Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) and Ethereum Classic (<a href=\"https://cointelegraph.com/etc-price-index\">ETC</a>). Out of the total $170 million investment, the bank holds $82 million worth of BTC followed by $55 million worth of ETH, DOGE took the third spot with $5 million and ADA is fourth with $4.5 million. An investor presentation also revealed that SoFi onboarded over 500,000 customers and now supports trading for over 22 cryptocurrencies. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/9c386b27-9496-43b9-bcf0-f87585b95d74.png\"  /><figcaption style=\"text-align: center;\"><em>SoFi bank crypto holdings, Q2 2023. Source: SoFi Bank</em></figcaption></figure><p>Sofi Bank not only hodl crypto but also allow customers to buy and sell various cryptocurrencies but doesn’t offer any form of staking services. The U.S. bank started offering <a href=\"https://cointelegraph.com/news/sofi-launches-zero-fee-crypto-trading-for-bitcoin-ether-litecoin\">crypto services to its customers in September 2019</a> in partnership with the Coinbase crypto exchange. </p><p>However, it wasn’t a bank when it first started offering crypto services and only obtained the license in February 2022, making it one of the few full banks to offer crypto services.</p><p>Sofi Bank’s crypto offering however has not gone down well with the Federal Reserve and lawmakers. In Nov 2022, a U.S. <a href=\"https://cointelegraph.com/news/senate-banking-committee-democrats-warn-sofi-about-meeting-its-compliance-deadline\">Senate committee questioned Sofi’s banking law compliance</a>, while reminding it of the January 2024 deadline. Cointelegraph reached out to Sofi Bank to get clarity on its compliance deadline and how it would change its crypto holdings, but didn't receive a response at press time. </p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/bitcoin-etfs-even-worse-for-crypto-than-central-exchanges\"><strong>Bitcoin ETFs: Even worse for crypto than central exchanges</strong></a></p><p>Crypto’s association with mainstream banking was seen as a crucial step for mass adoption. However, the downfall of several crypto giants followed by the collapse of crypto-friendly banks has cast a shadow of doubt on the future of such associations. </p><p>The U.S. lawmakers rushed to contain the damage and save customers' funds but definitely put a dent in such partnerships for the future as regulators <a href=\"https://www.americanbanker.com/news/secs-gensler-directly-links-crypto-and-bank-failures\" target=\"_blank\" rel=\"noopener nofollow\">blamed </a>crypto for the bank's collapse.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-10T12:00:00.000Z",
    "title": "Mango Markets Struggles: Legal Funding Request Rejected",
    "url": "https://cryptodaily.co.uk/2023/08/mango-markets-struggles-legal-funding-request-rejected",
    "description": "<p>Stakeholders of blockchain-based trading protocol Mango Markets are grappling with financial challenges as the platform faces mounting legal expenses in the aftermath of a significant crypto market manipulation incident.</p>\nStakeholders Reluctant to Foot the Bill\n<p>About a year ago, crypto market manipulator, Avi Eisenberg, had reportedly raided Mango Markets for over $100 million. He was arrested soon after confessing to the exploit, and the company has been pursuing legal action against him since then. However, the platform's stakeholders are now finding it difficult to cover the escalating legal costs.</p>\n<p>A proposal by Mango Labs, the company responsible for developing the Solana blockchain-based exchange, sought approval for an additional $2 million in funding for legal expenses. The proposal was put to a vote within Mango DAO, the decentralized autonomous organization overseeing the protocol.&nbsp;</p>\n<p>Initial voting results indicate that Mango DAO voters are hesitant to provide the requested funds. The proposal was rejected by the voters over the weekend, with one individual referring to the situation as a \"money pit.\"&nbsp;</p>\nStrained Resources and Legal Battles\n<p>Project insiders have demanded greater transparency regarding budget management from the company. Despite the availability of approximately $89 million in the Mango DAO treasury, most of these funds are tied up in illiquid MNGO tokens, making quick liquidation a challenge. The primary source for potential funding lies in a stash of dollar-linked stablecoins valued at $15.3 million, denominated mostly in USDC.</p>\n<p>The platform's financial constraints have arisen after Mango Labs exhausted its 2023 budget of nearly $2 million, significantly ahead of schedule. The company is actively pursuing a costly civil suit against Avi Eisenberg, who still claims that he did nothing wrong and was only participating in regular market strategies.&nbsp;</p>\n<p>However, things do not look so well for Eisenberg, as other than the Mango Markets lawsuit, he has also been slapped with market manipulation charges by the CFTC and fraud charges by the SEC.&nbsp;</p>\nFounder's Dilemma and Second Funding Proposal\n<p>Mango Labs' founder, Daffy Durairaj, personally holds enough MNGO governance tokens that could influence the vote's outcome. However, due to scrutiny from regulatory bodies like the SEC regarding the centralization of Mango's governance token, Durairaj might be cautious about leveraging his tokens to secure the funds. Despite the initial setback, Durairaj has initiated a second funding proposal identical to the first, indicating the company's persistence in seeking financial support for legal expenses.</p>\n<p>He stated,&nbsp;</p>\n\n<p>&ldquo;This funding is necessary to handle legal costs of regulatory inquiries that have arisen after the exploit last year, cooperation with law enforcement and regulators and pursuing legal claims against Avi Eisenberg to help recover funds for the DAO.&rdquo;&nbsp;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-10T11:45:00.000Z",
    "title": "Bitcoin Price Analysis:  Peaks Around 30222 - 10 August 2023",
    "url": "https://cryptodaily.co.uk/2023/08/bitcoin-price-analysis-peaks-around-30222-10-august-2023",
    "description": "<p>BTC/USD Peaks Around 30222:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 10 August 2023</p>\n<p>Bitcoin (BTC/USD) experienced improving momentum early in the Asian session as the pair orbited the 30000 figure after peaking around the 30222 area, representing a test of the 76.4% retracement of the appreciating range from 29715.87 to 31862.21.&nbsp; Stops were also elected above the 30183.73 area during the move, representing the 23.6% retracement of the wider appreciating range from 24750 to 31862.21.&nbsp; &nbsp;Large Stops are cited below the 27991.29 area, representing the 23.6% retracement of the broader appreciating range from 15460 to 31862.21.&nbsp;&nbsp; Additional areas of technical support and potential buying pressure in these appreciating ranges include the 27466, 27166, 26428, 26272, and 25715 areas.</p>\n<p>Above the market, upside price objectives include the 30526, 30611, 30762, and 31145 areas.&nbsp; Upside price objectives related to other levels of buying pressure include the 32125 and 33569 areas, and Stops are cited above additional upside price objectives around the 32043, 34531, 34658, and 35912 areas.&nbsp; &nbsp;Additional downside price objectives linked to recent selling pressure include the 28432, 28213, 28137, 27979, 27757, 27430, 27409, 27338, 27312, 27246, 26501, 26348, and 26199 levels.&nbsp; Also, the 28095.44 area represents the 23.6% retracement of the historic depreciating range from 69000 to 15460.&nbsp;&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bullishly indicating above the 100-bar MA (hourly) and above the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;200-bar MA&nbsp;(4-hourly) at 29808.11 and the&nbsp;50-bar MA&nbsp;(Hourly) at 29468.03.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T11:43:34.000Z",
    "title": "Nigeria adopts blockchain to fight certificate fraud",
    "url": "https://www.cryptopolitan.com/nigeria-adopts-blockchain-for-certificates/",
    "description": "Kashifu Inuwa Abdullahi, the Director-General of Nigeria&#8217;s National Information Technology Development Agency (NITDA), has unveiled plans to integrate blockchain technology into the issuance and verification process of National Youth Service Corps (NYSC) certificates in the country. The NYSC program mandates university graduates below the age of 30 to partake in a year-long national service, engaging ... <a title=\"Nigeria adopts blockchain to fight certificate fraud\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nigeria-adopts-blockchain-for-certificates/\" aria-label=\"More on Nigeria adopts blockchain to fight certificate fraud\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-10T11:43:50.000Z",
    "title": "Cardano and Chiliz look to rebound, Tradecurve presale in progress",
    "url": "https://crypto.news/cardano-and-chiliz-look-to-rebound-tradecurve-presale-in-progress/",
    "description": "Amidst the uncertainty in crypto, Tradecurve is firm. The platform has diverse use cases and a clear roadmap. TCRV presale is in progress"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-10T12:00:41.000Z",
    "title": "US Congresswoman Raises Concerns About Paypal Stablecoin In The Absence Of Regulation",
    "url": "https://www.newsbtc.com/stablecoin/us-congresswoman-raises-concerns-about-paypal-pyusd-stablecoin/",
    "description": "Earlier this week, popular American payment giant Paypal unveiled the launch of its USD-pegged PYUSD stablecoins to investors. In response, Democrat congresswoman Maxine Waters has raised palpable concerns that may or may not threaten the stablecoin’s operations. Waters Raises Regulatory Concerns Reacting to the news of Paypal’s PYUSD stablecoin launch, congresswoman Maxine Waters noted that the launch comes at a time when there was no legislative mechanism to regulate these assets.  She stated that “given PayPal’s size and reach, federal oversight and enforcement of its stablecoin operations is essential in order to guarantee consumer protections and alleviate financial stability concerns.” She further noted that “stablecoins represent the issuance of a new form of money, making it integral that there are federal guardrails.”  Related Reading: Solana Beats Out Ethereum To Emerge As Best Performer In Terms Of TVL Waters’ recent comments are in contrast with those of the House Financial Services Committee Rep. Patrick McHenry, who had earlier lauded PayPal’s launch. According to him, the recent announcement was “a clear signal that stablecoin, if issued under a clear regulatory framework, holds promise as a pillar of our 21st century payment system” Last month, the US House Financial Services Committee also introduced a bill to set up a federal regulatory framework for stablecoins, focusing on guidelines for registration and licensing for stablecoin issuers.  Although stablecoins have been around for several years, they have not been able to enjoy significant attention within the mainstream consumer payment ecosystem. Similar efforts by popular non-cryptocurrency firms, such as Meta Platforms, to launch stablecoin services faced harsh resistance from policymakers and global financial regulators.  In the face of regulatory uncertainty, it is always critical whenever a lawmaker has something to say about virtual currencies. PYPL price remains volatile amid regulatory concerns &#124; Source: PayPal Holdings, Inc. on Tradingview.com PayPal To Expand Into The Growing Stablecoin Industry According to a report published on August 9 by popular market analyst Bernstein, the stablecoin industry is projected to reach a $2.8 trillion valuation in the next five years. This represents a whooping 22x increase from the present $125 billion valuation of the industry, and PayPal is looking to take advantage of this expected increase through its recent release of the PYUSD stablecoin.  Related Reading: Billionaire Investor Wishes He Bought Bitcoin Early On, Here’s Why The leading payment giant revealed that the stablecoin will be “100% backed by US dollar deposits, short-term US Treasuries, and similar cash equivalents.” The coins will be redeemable 1:1 for US dollars and issued by US-based Paxos Trust Co. Consumers will also be able to convert any crypto supported by PayPal to and from PayPal USD (PYUSD).   However, aside from the current legislative tussle, PayPal will also face competition from existing players such as Tether and Circle. Tether’s USDT and Circle’s USDC are the largest stablecoins, with market caps of over $83 billion and $26 billion, respectively.  Featured image from Unsplash, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-10T12:06:01.000Z",
    "title": "US Lawmaker Raises Significant Concerns Over PayPal’s Stablecoin Launch",
    "url": "https://www.crypto-news-flash.com/us-lawmaker-raises-significant-concerns-over-paypals-stablecoin-launch/?utm_source=rss&utm_medium=rss&utm_campaign=us-lawmaker-raises-significant-concerns-over-paypals-stablecoin-launch",
    "description": "<img width=\"599\" height=\"443\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Surprisingly, despite the SEC&#039;s lawsuit against issuer Paxos as part of its crackdown on crypto, Binance USD (BUSD) received an &#039;A&#039; rating from Bluechip.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins.png 599w, https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins-300x222.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins-24x18.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins-36x27.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/03/Stablecoins-48x35.png 48w\" sizes=\"(max-width: 599px) 100vw, 599px\" />Maxine Waters said that the lack of federal oversight over PayPal&#8217;s PYUSD stablecoin is concerning. PayPal claims that they have conducted extensive discussions with stablecoin issuers for launching the PYUSD stablecoin. PayPal&#8217;s launch of PYUSD stablecoin earlier this week create much uproar in the crypto community. The American multinational giant has shown its intentions to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-10T11:57:28.000Z",
    "title": "Near Protocol (NEAR) and Mina (MINA) Traders Are Moving Their Funds to Pomerdoge (POMD) for Higher ROI",
    "url": "https://www.crypto-news-flash.com/near-protocol-near-and-mina-mina-traders-are-moving-their-funds-to-pomerdoge-pomd-for-higher-roi/?utm_source=rss&utm_medium=rss&utm_campaign=near-protocol-near-and-mina-mina-traders-are-moving-their-funds-to-pomerdoge-pomd-for-higher-roi",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/lilo.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/lilo.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/lilo-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/lilo-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Pomerdoge (POMD)  has been on the radar of investors due to the promising potential that the project harbors. At the moment, investors of Near Protocol (NEAR) as well as those from Mina (MINA) coin are buying into the presale of Pomerdoge. This is due to the projection of Pomerdoge yielding a massive ROI in the [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-10T12:03:28.000Z",
    "title": "The Biggest Web3 Festival In Asia Starts on August 24th",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/the-biggest-web3-festival-in-asia-starts-on-august-24/",
    "description": "<p>This event is expected to draw around 3,000 people, the vast majority of whom will be from outside the country. This makes Coinfest Asia the largest web3 festival event in Asia this year, particularly in Indonesia. Coinfest Asia will feature over 100 speakers from the web2 and web3 industries. The speakers will participate in a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/the-biggest-web3-festival-in-asia-starts-on-august-24/\">The Biggest Web3 Festival In Asia Starts on August 24th</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-10T12:00:04.000Z",
    "title": "The Fintech Festival Asia Announced Stellar Sponsors.",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/the-fintech-festival-asia-announced-stellar-sponsors/",
    "description": "<p>The FinTech Festival Asia (FTF) 2023 event is a big one that will study current trends. And unveil the dynamic landscape of the fintech sector. This event will highlight the most recent industry developments, innovations, and technologies. As well as investigate their impact on the fintech industry and the wider ecosystem. The highly anticipated FinTech [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/the-fintech-festival-asia-announced-stellar-sponsors/\">The Fintech Festival Asia Announced Stellar Sponsors.</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-10T11:53:47.000Z",
    "title": "3 Low Risk Insane Gain Altcoins for Crypto Bullrun",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/3-low-risk-insane-gain-altcoins-for-crypto-bullrun/",
    "description": "<p>The biggest returns in crypto may be with coins that have high-risk levels. But that is not my cup of tea. I am one of those people who is happy with low-risk, and good gain-return investments. If you are also such a person, this video is for you.  In this article, I am covering 3 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/3-low-risk-insane-gain-altcoins-for-crypto-bullrun/\">3 Low Risk Insane Gain Altcoins for Crypto Bullrun</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-10T12:05:00.000Z",
    "title": "Solana Mobile Announces Reduction in the Price Of Saga",
    "url": "https://coinedition.com/solana-mobile-announces-reduction-in-the-price-of-saga/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/0512.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/0512.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/0512-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/0512-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/0512-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/0512-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/0512-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/0512-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/0512-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/0512-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/0512-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/0512-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/0512-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/0512-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/0512-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/0512-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/0512-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Solana Mobile shared on Twitter earlier today that it has reduced the price of Saga, Solana’s Web3 mobile phone. The phone will now cost people $599, according to the post. Solana Mobile also shared that Saga users have embraced the new technology over the past four months, and that they are still working on improving [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/solana-mobile-announces-reduction-in-the-price-of-saga/\">Solana Mobile Announces Reduction in the Price Of Saga</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-10T11:43:13.000Z",
    "title": "Bearish Momentum Grips FTM Market: Will Bulls Stage a Rally?",
    "url": "https://coinedition.com/bearish-momentum-grips-ftm-market-will-bulls-stage-a-rally/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Bearish-Momentum-Grips-FTM-Market-Will-Bulls-Stage-a-Rally.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Bearish-Momentum-Grips-FTM-Market-Will-Bulls-Stage-a-Rally.png 730w, https://coinedition.com/wp-content/uploads/2023/08/Bearish-Momentum-Grips-FTM-Market-Will-Bulls-Stage-a-Rally-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/08/Bearish-Momentum-Grips-FTM-Market-Will-Bulls-Stage-a-Rally-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/08/Bearish-Momentum-Grips-FTM-Market-Will-Bulls-Stage-a-Rally-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/08/Bearish-Momentum-Grips-FTM-Market-Will-Bulls-Stage-a-Rally-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/08/Bearish-Momentum-Grips-FTM-Market-Will-Bulls-Stage-a-Rally-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/08/Bearish-Momentum-Grips-FTM-Market-Will-Bulls-Stage-a-Rally-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/08/Bearish-Momentum-Grips-FTM-Market-Will-Bulls-Stage-a-Rally-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/08/Bearish-Momentum-Grips-FTM-Market-Will-Bulls-Stage-a-Rally-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/08/Bearish-Momentum-Grips-FTM-Market-Will-Bulls-Stage-a-Rally-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/08/Bearish-Momentum-Grips-FTM-Market-Will-Bulls-Stage-a-Rally-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/08/Bearish-Momentum-Grips-FTM-Market-Will-Bulls-Stage-a-Rally-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/08/Bearish-Momentum-Grips-FTM-Market-Will-Bulls-Stage-a-Rally-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/08/Bearish-Momentum-Grips-FTM-Market-Will-Bulls-Stage-a-Rally-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/08/Bearish-Momentum-Grips-FTM-Market-Will-Bulls-Stage-a-Rally-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/08/Bearish-Momentum-Grips-FTM-Market-Will-Bulls-Stage-a-Rally-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bullish momentum in the Fantom (FTM) market has waned as bulls paused due to resistance at the intraday high of $0.241.&#160; This pessimism is fueled, in part, by the closure of SpiritSwap, a decentralized exchange (DEX) based on the Fantom Opera Chain. As a result, bears drove the FTM price down to a 24-hour low [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bearish-momentum-grips-ftm-market-will-bulls-stage-a-rally/\">Bearish Momentum Grips FTM Market: Will Bulls Stage a Rally?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-10T11:45:46.000Z",
    "title": "Whales Move Over $380,000,000 in Bitcoin, Ethereum, Dogecoin and Gnosis – Here’s Where the Crypto’s Headed",
    "url": "https://dailyhodl.com/2023/08/10/whales-move-over-380000000-in-bitcoin-ethereum-dogecoin-and-gnosis-heres-where-the-cryptos-headed/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Whales-Move-Over-380.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Whales-Move-Over-380.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Whales-Move-Over-380.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Whales-Move-Over-380.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Whales-Move-Over-380.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Whales-Move-Over-380.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Whales-Move-Over-380.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Whales moved more than $380 million worth of Bitcoin (BTC), Ethereum (ETH), Dogecoin (DOGE) and Gnosis (GNO) in a single day on Wednesday. A handful of whales moved huge sums of BTC onto or off exchanges, according to the blockchain-tracking platform Whale Alert. Top US crypto exchange Coinbase transferred 2,500 Bitcoin worth more than $74.3 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/10/whales-move-over-380000000-in-bitcoin-ethereum-dogecoin-and-gnosis-heres-where-the-cryptos-headed/\">Whales Move Over $380,000,000 in Bitcoin, Ethereum, Dogecoin and Gnosis – Here’s Where the Crypto’s Headed</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]