[
  {
    "source": "Decrypt",
    "date": "2024-03-20T19:48:26.000Z",
    "title": "Greenpeace Catches Hell for Its ‘Explosive’ Bitcoin Mining Report",
    "url": "https://decrypt.co/222655/greenpeace-bitcoin-energy-environmental-debate",
    "description": "Bitcoin mining firms have collectively slammed the U.S. group’s accusations about their impact on the environment."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-20T20:08:46.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Today in crypto, the United States Securities and Exchange Commission (SEC) is reportedly trying to have Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) classified as a security. Apple’s co-founder had a court ruling overturned against YouTube over the use of doctored videos featuring his likeness. Meanwhile, the SEC handed down delay orders on several pending spot Ether exchange-traded fund (ETF) applications.</p><p>According to a March 20 report by Fortune, the SEC has issued several subpoenas to companies related to attempts to label Ether as a security. </p><p>The report indicated that the <a href=\"https://cointelegraph.com/news/sec-ether-security-classification\">SEC could have grounds</a> to label ETH a security due to its ongoing investigation of the Ethereum Foundation. Meanwhile, the foundation has seemingly acknowledged that it may be <a href=\"https://cointelegraph.com/news/sec-ether-security-classification\">under investigation</a> “from a state authority.”</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-20T19:46:56.000Z",
    "title": " SEC pushes deadline on VanEck spot Ether ETF application ",
    "url": "https://cointelegraph.com/news/sec-pushes-deadline-vaneck-spot-ether-etf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNDJlYTczY2MtMTg5Ni00YmExLTk2NzQtZTFiZGMyN2M5YTFiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The commission's delay on VanEck’s application to May 23 opened the proposal to public comment.</p>\n                    <p><p>The United States Securities and Exchange Commission (SEC) has postponed a potential decision of an application for a spot Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) exchange-traded fund (ETF) from asset manager VanEck.</p><p>In a March 20 notice, the SEC <a href=\"https://www.sec.gov/files/rules/sro/cboebzx/2024/34-99782.pdf\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it had extended the time period on approval or disapproval for the Cboe BZX Exchange to list and trade shares of the VanEck Ethereum ETF. The commission will have until May 23 for its final decision on the investment vehicle.</p><p>“The Commission finds that it is appropriate to designate a longer period within which to issue an order approving or disapproving the proposed rule change so that it has sufficient time to consider the proposed rule change,” said the SEC. </p><p><a href=\"https://cointelegraph.com/news/sec-pushes-deadline-vaneck-spot-ether-etf\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-20T19:45:25.000Z",
    "title": "Web3 Base Layer – Mystiko.Network Completes a 18 Million USD Seed Funding Round",
    "url": "https://www.cryptoglobe.com/latest/2024/03/web3-base-layer-mystiko-network-completes-a-18-million-usd-seed-funding-round/",
    "description": "BVI, BVI, March 20th, 2024, Chainwire Mystiko.Network, the leading Base Layer of Web3, has completed a 18 Million USD seed funding round led by Sequoia Capital India/SEA (now known as Peak XV Partners), with participation from Samsung Next, Hashkey, Mirana, Signum, Coinlist, Naval Ravikant, Sandeep Nailwal, Gokul Rajaram, Tribe Capital, Morningstar Ventures, etc.  In less […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-20T20:03:31.000Z",
    "title": "Game Changer: How Cryptocurrency is Revolutionizing the Sports Industry",
    "url": "https://cryptodaily.co.uk/2024/03/game-changer-how-cryptocurrency-is-revolutionizing-the-sports-industry",
    "description": "The sports industry consistently finds ways to implement and utilize new technology. Click here to find out more about how crypto is changing the game."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-20T19:55:19.000Z",
    "title": "Filecoin (FIL) Gains From Tie-ups; SUI (SUI) Drops As Investors Flock To Algotech (ALGT) Presale",
    "url": "https://cryptodaily.co.uk/2024/03/filecoin-fil-gains-from-tie-ups-sui-sui-drops-as-investors-flock-to-algotech-algt-presale",
    "description": "The crypto market is witnessing a significant improvement. The article will focus on Filecoin (FIL), SUI (SUI), and Algotech (ALGT)."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-20T19:41:19.000Z",
    "title": "Technologies That Are Revolutionizing Online Gambling",
    "url": "https://cryptodaily.co.uk/2024/03/technologies-that-are-revolutionizing-online-gambling",
    "description": "Just like in other industries, online gambling is experiencing its own technological revolution. The adoption of innovative technologies in the online gambling industry is driven by the desire to provide a superior gaming experience, maintain competitiveness, and safeguard the interests of players."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-20T19:55:51.000Z",
    "title": "Sweden’s Central Bank, The Riksbank, wraps up E-Krona pilot with focus on offline transactions",
    "url": "https://www.cryptopolitan.com/the-riksbank-wraps-up-e-krona-pilot/",
    "description": "The Riksbank, Sweden&#8217;s central bank, unveiled its fourth and concluding report on the e-krona pilot project on March 20, presenting detailed insights into the digital currency&#8217;s offline functionality.&#160; This last phase of the project diverged from its Phase 2 proposition, which primarily used mobile phones for storing offline transaction data. The central bank evaluated an [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-20T20:00:38.000Z",
    "title": "Top 3 Solana Meme Coins To Buy Amid The Bitcoin Crash That Could 10x",
    "url": "https://www.newsbtc.com/meme-coins/top-3-solana-meme-coins/",
    "description": "As the Bitcoin price crash has ravaged the crypto market and left altcoins suffering, it has presented a unique buying opportunity for meme coins that may never come after this time. So here are the top 3 meme coins that could 10x your portfolio from here. Solana-Based Myro Leads Meme Coins With Potential Solana-based meme coins have been all the rave over the past year and with good reason as well. These meme coins have done so well in such a short time, coming up to compete with established Ethereum-based meme coins which have been around for years. Related Reading: Dogecoin Growth Hits Roadblock As Holder Activity Enters Dreaded Period Of Stagnancy With the likes of WIF and BONK already crossing the $1 billion market cap market, the hunt is on for other Solana-based meme coins that could achieve this same feat, and that is where the Myro token comes in. Myro currently has a $200 million market cap, which makes it a prime candidate for crossing $1 billion. However, its most bullish developments have been its exchange listings. Myro scored a Binance perpetual listing last month, which pushed its market cap above $400 million for the first time. It has since retraced, but this retracement is similar to what was seen with WIF, which fell back down to $180 million at a point. If Myro follows the WIF playbook, then its next leg up could see it rise more than 5x above the $1 billion mark. Popcat: Another Solana Meme Coin On The Rise Popcat is another Solana meme coin that has made waves in the space over the past few months. After a long stretch of consolidation, the price had eventually broken out in February to reach a new all-time high price of $0.37 in mid-March. The price has since retraced a little over 50% since then and is now back to $0.17 with a market cap of $167 million. As with the majority of other meme coins, the total supply of the token is in circulation, which means there are no more unlocks coming up. At the current market cap, reaching the $1 billion mark would be an over 500% increase for the meme coin. And with the bull market coming up, the price of Popcat could rally higher, bringing a more than 10x return for investors. Wen (WEN) Meme Coin Wen (WEN) is another Solana-based meme coin that has hit the crypto space in the last few months. Starting out as an airdrop for users of the Solana-based Jupiter decentralized exchange, it has quickly grown among meme coin investors as one of the more stable investments. Related Reading: Bitcoin Halving Retrace Spooks Investors: What Is It And Why Does It Matter? Just like the other meme coins on this list, the WEN token shows a lot of promise because it is still under a $200 million market cap. This puts it at an at least 5x move to $1 billion, with a possible 10x when it reaches the $2 billion market cap mark. SOL price shoots to $176 &#124; Source: SOLUSD on Tradingview.com Featured image from Blockgeeks, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-20T20:00:58.000Z",
    "title": "Judge Says SEC Abused Its Power, Made False and Misleading Representations in Case Against Crypto Firm",
    "url": "https://dailyhodl.com/2024/03/20/judge-says-sec-abused-its-power-made-false-and-misleading-representations-in-case-against-crypto-firm/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/03/jusge-sec-made-false.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/03/jusge-sec-made-false.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/03/jusge-sec-made-false.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/03/jusge-sec-made-false.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/03/jusge-sec-made-false.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/03/jusge-sec-made-false.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/03/jusge-sec-made-false.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A federal judge in Utah has sanctioned the U.S. Securities and Exchange Commission (SEC) after the regulator copped to making an inaccurate statement in a crypto fraud case. In an order filed on Monday, US District Court Judge Robert Shelby accused the SEC of &#8220;bad faith conduct in obtaining, maintaining, and defending&#8221; a temporary restraining [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/20/judge-says-sec-abused-its-power-made-false-and-misleading-representations-in-case-against-crypto-firm/\">Judge Says SEC Abused Its Power, Made False and Misleading Representations in Case Against Crypto Firm</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-20T19:55:34.000Z",
    "title": "Bitcoin Hasn’t Seen Its Top and is Still in Middle of Bull Market, Says CryptoQuant CEO – Here’s Why",
    "url": "https://dailyhodl.com/2024/03/20/bitcoin-hasnt-seen-its-top-and-is-still-in-middle-of-bull-market-says-cryptoquant-ceo-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/treasury-sanctions-btc-ransonware.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/treasury-sanctions-btc-ransonware.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/treasury-sanctions-btc-ransonware.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/treasury-sanctions-btc-ransonware.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/treasury-sanctions-btc-ransonware.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/treasury-sanctions-btc-ransonware.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/treasury-sanctions-btc-ransonware.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Chief executive of analytics platform CryptoQuant believes the bull market is far from over despite Bitcoin&#8217;s (BTC) latest dip after hitting new all-time highs this month. Ki Young Ju tells his 339,800 followers on the social media platform X that Bitcoin has yet to reach a cycle top, but is undergoing a short-term correction after [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/20/bitcoin-hasnt-seen-its-top-and-is-still-in-middle-of-bull-market-says-cryptoquant-ceo-heres-why/\">Bitcoin Hasn&#8217;t Seen Its Top and is Still in Middle of Bull Market, Says CryptoQuant CEO – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]