[
  {
    "source": "CoinDesk",
    "date": "2024-03-25T14:59:27.000Z",
    "title": "Bitcoin Pumps Above $69K as Crypto Rally Resumes",
    "url": "https://www.coindesk.com/markets/2024/03/25/bitcoin-pumps-above-69k-as-crypto-rally-resumes/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The rally was broad-based, with SOL and AVAX advancing nearly 10% over the past 24 hours."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-25T15:00:02.000Z",
    "title": "Solana Gets New NFT Standard, Metaplex Will Give Fees to DAO for Potential MPLX Rewards",
    "url": "https://decrypt.co/223245/metaplex-solana-core-nft-standard-fees-mplx-dao",
    "description": "Solana’s new NFT standard is cheaper and more efficient, plus Metaplex is giving half of all-time protocol fees in MPLX to the DAO."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-25T14:52:14.000Z",
    "title": "Bitcoin’s price rally above $69,000 leads to widespread market liquidations",
    "url": "https://cryptoslate.com/insights/bitcoins-price-rally-above-69000-leads-to-widespread-market-liquidations/",
    "description": "<p>Quick Take Bitcoin has started the week strong with a push above $69,000—up more than 3% today and marking its highest value since March 16. The move triggered a flood of liquidations in the digital asset ecosystem. These liquidations stem partly from the digital assets strong rally, peaking at an impressive $69,400. Coinglass data shows [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/bitcoins-price-rally-above-69000-leads-to-widespread-market-liquidations/\">Bitcoin&#8217;s price rally above $69,000 leads to widespread market liquidations</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-25T14:40:10.000Z",
    "title": "$9 billion in Bitcoin options set to expire on March 29",
    "url": "https://cryptoslate.com/insights/9-billion-in-bitcoin-options-set-to-expire-on-march-29/",
    "description": "<p>Quick Take Deribit data indicates that nearly $9 billion worth of Bitcoin (BTC) options are due to expire on March 29, the last Friday of the month, with the total open interest amounting to 133,914 BTC. The put/call ratio is reported at 0.80, signifying more calls in circulation compared to puts, and reflects bullish market [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/9-billion-in-bitcoin-options-set-to-expire-on-march-29/\">$9 billion in Bitcoin options set to expire on March 29</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-25T14:48:56.000Z",
    "title": "Floki ($FLOKI) Unveils 2024 Roadmap, Featuring Digital Banking and DeFi Integration",
    "url": "https://www.cryptoglobe.com/latest/2024/03/floki-floki-unveils-2024-roadmap-featuring-digital-banking-and-defi-integration/",
    "description": "The team behind the meme-inspired cryptocurrency Floki (FLOKI) has released an extensive roadmap for 2024, outlining a series of developments designed to increase the token’s utility and expand its ecosystem. Floki ($FLOKI) started as a meme-inspired cryptocurrency based on Elon Musk’s Shiba Inu dog, quickly evolving into a comprehensive ecosystem backed by an engaged community. […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-25T15:06:13.000Z",
    "title": "Solana (SOL) Investors Flock To New Cryptocurrency Raboo (RABT) and Bonk (BONK) Amid Recent Price Surge",
    "url": "https://cryptodaily.co.uk/2024/03/solana-sol-investors-flock-to-new-cryptocurrency-raboo-rabt-and-bonk-bonk-amid-recent-price-surge",
    "description": "In the fast-paced world of cryptocurrency, two names are currently on everyone's lips: Raboo (RABT), the new cryptocurrency, and Bonk (BONK), with the former especially making waves in its presale."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-25T15:00:17.000Z",
    "title": "Top Game-Fi Token Shows Explosive Returns: Can KangaMoon (KANG) Outperform Floki (FLOKI)?",
    "url": "https://cryptodaily.co.uk/2024/03/top-game-fi-token-shows-explosive-returns-can-kangamoon-kang-outperform-floki-floki",
    "description": "In this article, we will examine two popular game-fi tokens — KangaMoon (KANG) and Floki (FLOKI)— and analyze their market performance. KangaMoon has shown explosive gains during a presale event, but can it continue outperforming Floki in the long run? Let's dive in and explore these tokens further."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-25T14:49:10.000Z",
    "title": "ARKMining cloud mining provider gives users more opportunities to earn passive income",
    "url": "https://cryptodaily.co.uk/2024/03/arkmining-cloud-mining-provider-gives-users-more-opportunities-to-earn-passive-income",
    "description": "In the wake of COVID-19 and all global crises, most people have started looking for ways to earn a passive income because, in a crisis like this, even long-lasting and reliable jobs can disappear anytime. Among the many options, we bring you the best. Here, let’s learn how to earn passive income with the best free cloud mining in 2024."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-25T14:43:00.000Z",
    "title": "Stage 1’s Exclusive Offer Bitcoin Cash (BCH) and Arbitrum (ARB) Holders Act Fast to Join Koala Coin (KLC) Presale",
    "url": "https://cryptodaily.co.uk/2024/03/stage-1s-exclusive-offer-bitcoin-cash-bch-and-arbitrum-arb-holders-act-fast-to-join-koala-coin-klc-presale",
    "description": "Imagine a future where your digital wallet's whimsy impacts your wealth, where the charm of memes meets market might. Enter the Koala Coin (KLC) presale, exclusive to Bitcoin Cash (BCH) and Arbitrum (ARB) holders in stage one at just $0.014. Seize this fleeting chance. Let FOMO be your guide to join the eucalyptus revolution."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-25T14:45:11.000Z",
    "title": "B2Broker Introduces B2Trader – An Innovative Crypto Spot Brokerage Platform",
    "url": "https://news.bitcoin.com/b2broker-introduces-b2trader-an-innovative-crypto-spot-brokerage-platform/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/photo_5190560955124274761_y-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/photo_5190560955124274761_y-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/photo_5190560955124274761_y-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/photo_5190560955124274761_y-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/photo_5190560955124274761_y-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/photo_5190560955124274761_y-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/photo_5190560955124274761_y-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/photo_5190560955124274761_y.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />With Bitcoin reaching record highs and the overall market capitalisation of cryptocurrencies surpassing $2.37T, the cryptocurrency market is seeing remarkable development. This is in line with the June 30, 2024, implementation of the MiCA rule, which will be followed by another wave on December 30, 2024, with the goal of promoting broader use of cryptocurrencies [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-25T15:02:49.000Z",
    "title": "Magic Square Launches $SQR Staking Program for Token Holders",
    "url": "https://www.cryptopolitan.com/magic-square-launches-sqr-staking-program-for-token-holders/",
    "description": "Road Town, BVI, March 25th, 2024, Chainwire Following its acquisition of TruePNL earlier this year, Magic Square, the Binance Labs backed Web3 app store, has launched a staking program for holders of its $SQR token. This initiative aims to enhance the utility of the $SQR token and incentivize the Magic Square community to support the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-25T14:48:29.000Z",
    "title": "Next-Gen Blockchain Breakthroughs: L2 Projects to Watch",
    "url": "https://www.cryptopolitan.com/next-gen-blockchain-breakthroughs-l2-projects-to-watch/",
    "description": "Bitcoin&#8217;s value could rise after its next halving. Experts think it might go up a lot. This event makes people look at new blockchain updates. These updates, called L2 projects, are the next big step for blockchains. They make things faster and safer. Our article looks at these exciting projects on the rise. BlastUP Presale [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-25T14:48:27.000Z",
    "title": "Crypto Profit Picks: 30X Potential Altcoins Pre-Altcoin Rally",
    "url": "https://www.cryptopolitan.com/crypto-profit-picks-30x-potential-altcoins-pre-altcoin-rally/",
    "description": "Bitcoin enthusiasts are buzzing about the post-halving surge. History suggests a big rise in prices could be on the horizon. In the shadow of this event, altcoins are also making waves. Analysts believe select altcoins have the potential to soar. As the crypto world anticipates Bitcoin&#8217;s leap, these alternative coins may be gearing up for [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-25T14:48:25.000Z",
    "title": "BlastUP (BLP) at $0.055 Recaptures the Early Investment Magic of Ethereum (ETH) at $20 According to Market Experts",
    "url": "https://www.cryptopolitan.com/blastup-blp-at-0-055-recaptures-the-early-investment-magic-of-ethereum-eth-at-20-according-to-market-experts/",
    "description": "Wishing you had bought Ethereum at $20? Ethereum&#8217;s meteoric rise has since made it a pillar of the cryptocurrency world, with its wide use for decentralized apps and smart contracts suggesting those low prices are a thing of the past. Yet, as the world of crypto continues to evolve, the spotlight is moving towards BlastUP [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-25T14:48:22.000Z",
    "title": "Best Crypto Under $1",
    "url": "https://www.cryptopolitan.com/best-crypto-under-1/",
    "description": "Bitcoin&#8217;s future looks bright, as experts predict a surge in value following the next halving event. This optimism around Bitcoin&#8217;s potential uplifts the entire crypto market. In light of such events, attention is also drawn to promising cryptocurrencies priced under $1, which could offer accessible investment opportunities and carry their own potential for significant returns. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-25T14:48:20.000Z",
    "title": "🌟 5 Altcoins Poised for Substantial Growth",
    "url": "https://www.cryptopolitan.com/%f0%9f%8c%9f-5-altcoins-poised-for-substantial-growth/",
    "description": "Bitcoin enthusiasts have reasons to smile as predictions surface about a post-halving price surge. Historical patterns hint at a potential 200% increase in Bitcoin value, sparking optimism across the crypto community. Amidst this positive outlook for the king of cryptocurrencies, attention also veers towards alternative coins. Some altcoins are gearing up for significant growth, shining [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-25T14:43:52.000Z",
    "title": "Solana (SOL) signals bullish momentum, eyes all-time high",
    "url": "https://www.cryptopolitan.com/solana-sol-rockets-toward-target/",
    "description": "Solana (SOL), one of the fastest-growing cryptocurrencies, has achieved a significant milestone in its recent performance, flipping a major resistance level into support.&#160; This development comes as a result of meticulous analysis by prominent crypto analyst Jelle, whose insights have garnered attention within the cryptocurrency community.&#160; According to Jelle&#8217;s latest analysis, Solana&#8217;s ability to transform [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-25T14:40:58.000Z",
    "title": "Investor’s Dilemma: SLERF, Shiba Inu, or BEFE Coin—Which Holds the Most Promise?",
    "url": "https://www.cryptopolitan.com/investors-dilemma-slerf-shiba-inu-or-befe-coin-which-holds-the-most-promise/",
    "description": "Memecoins are known for giving significant returns to crypto investors. Though meme coins come with a lot of volatility factors, volatility helps investors accumulate more in dips. As Bitcoin and major altcoins do not give massive returns, investors look for opportunities in meme tokens. But the issue is, which meme token should I buy now? [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-25T14:40:53.000Z",
    "title": "Decoding the Hype: Which Crypto – SLERF, Shiba Inu, or BEFE Coin – Reigns Supreme?",
    "url": "https://www.cryptopolitan.com/decoding-the-hype-which-crypto-slerf-shiba-inu-or-befe-coin-reigns-supreme/",
    "description": "In the meme coin market, SLERF (SLERF), Shiba Inu (SHIB), and BEFE (BEFE) have been captivating all the headlines. As the three are fighting to achieve new milestones, investors are eagerly watching. However, analysts suggest that BEFE would potentially take over other meme coins like SLERF and Shiba Inu. BEFE As per CoinMarketCap, BEFE over [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-25T14:40:51.000Z",
    "title": "Shiba Inu, PEPE Coin, or Bitgert Coin: Which Cryptocurrency Reigns Supreme?",
    "url": "https://www.cryptopolitan.com/shiba-inu-pepe-coin-or-bitgert-coin-which-cryptocurrency-reigns-supreme/",
    "description": "Bitgert’s BRISE coin outperforms other currencies in the bear market to indicate great returns for investors.&#160; The start of 2024 brought about a surprising bull run for the cryptocurrency market. But right now, the market is back to its correction stage with currencies trickling down. If you were to invest $100 in a currency now, [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-25T14:46:21.000Z",
    "title": "BITCOIN PRICE ANALYSIS & PREDICTION (March 25) – BTC Volume Is Low Amid Fresh Increase, Will This Pressure Last Long?",
    "url": "https://nulltx.com/bitcoin-price-analysis-prediction-march-25-btc-volume-is-low-amid-fresh-increase-will-this-pressure-last-long/",
    "description": "Bitcoin recently found support and is slowly climbing back after providing a 15% discount last week. Currently, buying volume appears insufficient to bring the bulls back on track as they face key resistance.   In the mid-month, Bitcoin encountered resistance and had a stopover at around $73.7k after almost doubling its [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-25T14:41:56.000Z",
    "title": "INTERNET COMPUTER PRICE ANALYSIS & PREDICTION (March 25) – $24 Is The Next Target To Watch If ICP Successfully Breaks Out",
    "url": "https://nulltx.com/internet-computer-price-analysis-prediction-march-25-24-is-the-next-target-to-watch-if-icp-successfully-breaks-out/",
    "description": "Last week saw ICP through a major bounce after forming a double-bottom pattern above a solid support level. The price has reached a key resistance, which now lies as the major obstacle in the ongoing surge. ICP has been on a buying spree for days, surging through several key levels [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-25T14:45:05.000Z",
    "title": "Pepe and Book of Meme see bullish rises as new meme coin ICO hits $8.5M",
    "url": "https://crypto.news/pepe-and-book-of-meme-see-bullish-rises-as-new-meme-coin-ico-hits-8-5m/",
    "description": "Amidst a fervent market, Pepe and Book of Meme tokens surge by 4% and 8%, respectively. Dogecoin20, a new presale meme coin, crosses $8 million as its IEO approaches. #partnercontent"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-25T15:00:18.000Z",
    "title": "Bitcoin Retests Resistance: Here’s The Level A Break Could Lead To",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-retests-resistance-level-break-lead/",
    "description": "Data shows Bitcoin is currently retesting a major on-chain resistance level, and a break above which can potentially lead to a surge in its price. Bitcoin Has Major On-Chain Resistance Around $67,000 As pointed out by analyst Ali in a post on X, BTC may be able to see a rise towards the $72,900 level if the asset can break the current on-chain resistance barrier. Related Reading: Bitcoin Long-Term Holders &#38; Price Top: Glassnode Reveals Pattern In on-chain analysis, any level&#8217;s potential to act as support or resistance is measured using the amount of Bitcoin that was acquired/bought by the investors around said level. The analyst has shared the chart for the &#8220;UTXO Realized Price Distribution&#8221; (URPD) indicator from Glassnode, that reveals how the various levels around the current spot value of BTC are looking like right now based on the density of supply that was last bought at them. Looks like there is significant resistance coming up ahead at the $72,900 mark &#124; Source: @ali_charts on X The URPD here is &#8220;ATH partitioned,&#8221; which means that the price ranges here are defined by dividing the levels between zero and the current all-time high (ATH) into 100 equal partitions. From the chart, it&#8217;s visible that the partition around the $66,990 level carries the cost basis of a notable amount of the supply right now (1.3%). This also happens to be the range BTC is retesting at the moment. Generally, the cost basis is a special level for investors, and thus, they tend to be more likely to show some reaction when a retest takes place. If a large number of holders share their cost basis inside the same narrow range, then this reaction may result in a scale that could be relevant for the market. As for what direction this reaction from the holders would be probable to happen depends on the side the retest is happening from. A retest from under (meaning that these holders had been in loss prior to the retest) could lead to a selling reaction in the market. This is because these investors may not want to risk the cryptocurrency declining again in the future, so exiting while they have the opportunity to at their break-even might be tempting. Related Reading: This Bitcoin Halving May Not Result In Supply Squeeze: Glassnode As such, retests like these can lead to the asset feeling some degree of resistance. In the current case, the range is notably filled up with coins, so it&#8217;s possible that the strength of this resistance would be just as powerful. From the chart, it&#8217;s visible that after this range, the asset potentially faces no strong on-chain resistance barriers until the $72,879 level, which hosts the cost basis of about 1.61% of the supply. &#8220;If Bitcoin can break past $66,990, it will likely rise toward $72,880!&#8221; says Ali. BTC Price Bitcoin has been climbing up in the past day, with its price now reaching the $67,200 level. Should this surge be sustained, the asset would be through the current resistance block. The price of the coin appears to have been going up over the past couple of days &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, Glassnode.com, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-25T15:02:28.000Z",
    "title": "Magic Square Launches $SQR Staking Program for Token Holders",
    "url": "https://www.crypto-news-flash.com/magic-square-launches-sqr-staking-program-for-token-holders/?utm_source=rss&utm_medium=rss&utm_campaign=magic-square-launches-sqr-staking-program-for-token-holders",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/2024-03-25_162515_1711376737NxSgCgwpWE.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/2024-03-25_162515_1711376737NxSgCgwpWE.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/2024-03-25_162515_1711376737NxSgCgwpWE-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/2024-03-25_162515_1711376737NxSgCgwpWE-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/2024-03-25_162515_1711376737NxSgCgwpWE-150x90.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/2024-03-25_162515_1711376737NxSgCgwpWE-450x270.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Road Town, BVI, March 25th, 2024, Chainwire Following its acquisition of TruePNL earlier this year, Magic Square, the Binance Labs backed Web3 app store, has launched a staking program for holders of its $SQR token. This initiative aims to enhance the utility of the $SQR token and incentivize the Magic Square community to support the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-25T15:00:09.000Z",
    "title": "Fantom, Maker, $GFOX and Sui — 4 Coins to Watch This Week",
    "url": "https://www.crypto-news-flash.com/fantom-maker-gfox-and-sui-4-coins-to-watch-this-week/?utm_source=rss&utm_medium=rss&utm_campaign=fantom-maker-gfox-and-sui-4-coins-to-watch-this-week",
    "description": "<img width=\"1200\" height=\"801\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-25T020410.267.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-25T020410.267.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-25T020410.267-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-25T020410.267-768x513.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-25T020410.267-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-25T020410.267-450x300.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />This week, the general crypto market seems to be finding its direction as Bitcoin recovers slightly amid its upcoming halving event. As a result, investors are closely monitoring altcoins like, $FTM, $MKR, $SUI due to their strong potential to rally along with the market. Interestingly, $GFOX, the presale token set to launch soon, is also [...]"
  }
]