[
  {
    "source": "CoinDesk",
    "date": "2023-07-03T20:31:21.000Z",
    "title": "Three Arrows Founders to Donate Future Earnings to Creditors in Spirit of 'Karma'  ",
    "url": "https://www.coindesk.com/business/2023/07/03/three-arrows-founders-to-donate-future-earnings-to-creditors-in-spirit-of-karma/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The founders of the hedge fund that filed for bankruptcy last year have started an exchange for creditor claims, which is seeing $50 million in trading volume, said Davies."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-03T20:14:49.000Z",
    "title": "Price analysis 7/3: SPX, DXY, BTC, ETH, BNB, XRP, ADA, DOGE, SOL, LTC",
    "url": "https://cointelegraph.com/news/price-analysis-7-3-spx-dxy-btc-eth-bnb-xrp-ada-doge-sol-ltc",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/535c2117-f4fb-4769-ba9a-06eca4836016.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The bulls are trying to nudge Bitcoin above the critical resistance of $31,000, which may start a broad-based crypto rally.</p>\n                    <p><p>The United States equity markets have witnessed a <a href=\"https://www.cnbc.com/2023/06/29/stock-market-today-live-updates.html\" target=\"_blank\" rel=\"noopener nofollow\">solid</a> year so far. The Nasdaq Composite has soared 31.7%, its best first-half performance since 1983. Similarly, the S&amp;P 500 Index’s (SPX) 15.9% gain is its best first half since 2019. This suggests that risky assets remain in demand.</p><p>In the cryptocurrency markets, Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) has led the recovery from the front, rising 20% in Q2 2023. An encouraging sign is that the rise has not tempted the Bitcoin hodlers to book profits. Glassnode’s Illiquid Supply Change metric <a href=\"https://cointelegraph.com/news/btc-miners-millions-crypto-exchanges-5-things-bitcoin\">is near cycle highs</a>, indicating hodler conviction.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/cfc24eb7-b29b-4286-805e-535c9100b083.png\"  /><figcaption style=\"text-align: center;\"><em>Daily cryptocurrency market performance. Source: </em><a href=\"https://coin360.com/\" target=\"_blank\" rel=\"noopener nofollow\"><em>Coin360</em></a></figcaption></figure><p>Usually, the leader is the first to emerge from a bear market. If the rally sustains, the sentiment among the traders improves and they start looking at other buying opportunities. After Bitcoin’s rally, the altcoins have started to show signs of life. If the trend continues, several altcoins may rally over the next few weeks. </p><p>Will the U.S. equities markets continue their march higher? Could Bitcoin and the major altcoins continue their recovery? Let’s analyze the charts to find out.</p><h2>S&P 500 Index price analysis</h2><p>The S&amp;P 500 Index bounced off the breakout level of 4,325 on June 26, indicating that the bulls have flipped the level into support.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/686b8313-9afc-48d2-8f5a-55159286748a.png\"  /><figcaption style=\"text-align: center;\"><em>SPX daily chart. Source: TradingView</em></figcaption></figure><p>Buyers continued their purchases at higher levels which pushed the index above the immediate resistance at 4,448. This indicates the resumption of the uptrend. The bears are likely to pose a strong challenge at 4,500 but the likelihood of this level holding is low. If the index rises above this resistance, the rally could reach 4,650.</p><p>If bulls want to prevent the up-move, they will have to quickly yank the price below 4,325. If they do that, the selling could pick up momentum and the index may plummet to 4,200.</p><h2>U.S. dollar index price analysis</h2><p>The bulls pushed the U.S. dollar index (DXY) above the 20-day exponential moving average (103) on June 28, indicating strength. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/6669ab01-3a86-444a-a0b1-718c6a135bfb.png\"  /><figcaption style=\"text-align: center;\"><em>DXY daily chart. Source: TradingView</em></figcaption></figure><p>The bears tried to pull the price back below the moving averages on June 30 but the bulls did not relent. This suggests that lower levels are attracting buyers. The bulls will then try to push the price to the downtrend line.</p><p>Contrary to this assumption, if the price turns down and breaks below the moving averages, it will suggest that bears are selling on minor rallies. That could pull the price down to the immediate support at 102.</p><h2>Bitcoin price analysis</h2><p>The long tail on Bitcoin’s July 2 candlestick shows that the bulls are buying the intraday dips. The buyers will try to strengthen their position by driving and sustaining the price above the overhead resistance at $31,000.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/1cd6526e-84a3-466e-88c7-381944ba4c5e.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>If they manage to do that, the BTC/USDT pair could pick up momentum and start its northward march toward $40,000. The $32,400 level may act as a minor roadblock but it is likely to be crossed.</p><p>The rising 20-day EMA ($29,446) and the relative strength index (RSI) near the overbought zone indicate advantage to buyers. Sellers will have to sink the price below the 20-day EMA to gain the upper hand in the near term. The pair may then drop to the 50-day simple moving average ($27,704).</p><h2>Ether price analysis</h2><p>The bears tried to tug Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) toward the 20-day EMA ($1,866) on July 2 but the long tail on the candlestick shows that the bulls are buying on minor dips.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/65a50417-3173-4590-adb1-ac946892327f.png\"  /><figcaption style=\"text-align: center;\"><em>ETH/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The 20-day EMA has turned up and the RSI is above 62, indicating that the bulls have the edge. There is a minor resistance at $2,000 but that is likely to be crossed. The ETH/USDT pair could then rally to the overhead resistance zone between $2,142 and $2,200. Sellers are expected to guard this zone with vigor.</p><p>This positive view will invalidate in the near term if the price turns down from $2,000 and slumps below the moving averages. The pair may then continue its range-bound action between $1,626 and $2,000 for some more time.</p><h2>BNB price analysis</h2><p>BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) rose above the 20-day EMA ($245) on July 1, indicating that the selling pressure is reducing.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/fe28c036-99d8-4031-9158-70520afb0a4a.png\"  /><figcaption style=\"text-align: center;\"><em>BNB/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The 20-day EMA has flattened out and the RSI has climbed near the midpoint, indicating that the BNB/USDT pair may consolidate between $220 and $265 for a few more days. If the price sustains above the 20-day EMA, the pair may climb to the overhead resistance at $265. The bears are expected to fiercely guard this level.</p><p>Alternatively, if the price turns down and breaks below the 20-day EMA, it will suggest that every recovery attempt is being sold. The pair may then tumble to the strong support at $220.</p><h2>XRP price analysis</h2><p>The bulls are trying to propel XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) above the 20-day EMA ($0.48) but the bears are aggressively defending the level.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/cc0bcf36-71f7-4abb-9359-54d1082cbaa9.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USDT daily chart. Source: TradingView</em></figcaption></figure><p>If buyers do not allow the price to slip much below the current level, it will increase the likelihood of a break above the 20-day EMA. The XRP/USDT pair may then start its northward march toward $0.53 and then $0.58.</p><p>Conversely, if the price turns down sharply from the current level, it will suggest solid selling near the 20-day EMA. The bears will have to sink the price below $0.44 to gain the upper hand. The pair may then tumble to $0.41.</p><h2>Cardano price analysis </h2><p>The bears successfully defended the $0.30 resistance on June 30 but they could not sustain Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) below the 20-day EMA ($0.29). This suggests that every minor dip is being purchased.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/8b9e7e9c-bc4c-4b30-befc-1a20ed90eff0.png\"  /><figcaption style=\"text-align: center;\"><em>ADA/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The 20-day EMA has flattened out and the RSI is near the midpoint, indicating that the bears may be losing their grip. Buyers will try to strengthen their position by kicking the price above $0.30. If they can pull it off, it will signal the start of a strong relief rally. The 50-day SMA ($0.32) may act as a barrier but it is likely to be overcome.</p><p>This positive view will invalidate in the near term if the price turns down sharply from the current level. That could keep the pair inside the $0.30 to $0.24 range for some more time.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-traders-breakout-28k-dip-btc-price-stalls\"><em>Bitcoin traders torn between breakout and $28K dip as BTC price stalls</em></a></p><h2>Dogecoin price analysis</h2><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) surged above the overhead resistance at $0.07 on July 1 but the long wick on the candlestick shows selling at higher levels.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/07d23461-30e9-44c6-b79b-8e699df39cff.png\"  /><figcaption style=\"text-align: center;\"><em>DOGE/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The failure to sustain the price above the overhead resistance indicates that the DOGE/USDT pair remains stuck inside the range between $0.06 and $0.07. Buyers will have to push and sustain the price above $0.07 to signal the start of a sustained recovery. The pair may then rally to $0.08.</p><p>On the downside, the $0.06 level remains the key support to watch out for. A break and close below this level could open the doors for a further decline to $0.05. </p><h2>Solana price analysis</h2><p>Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) has been trading between the 20-day EMA ($17.61) and the downtrend line for the past three days. This suggests that the bears are selling near the downtrend line and the bulls are buying the dips.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/d213e8ac-ece0-4c94-b37a-344d4035efa1.png\"  /><figcaption style=\"text-align: center;\"><em>SOL/USDT daily chart. Source: TradingView</em></figcaption></figure><p>The 20-day EMA has started to slope up and the RSI has risen into the positive territory, indicating that bulls are in the driver’s seat. That increases the possibility of a break above the downtrend line. If that happens, the SOL/USDT pair could rally to $22 and thereafter to $24.</p><p>If the price turns down sharply from the current level and breaks below the 20-day EMA, it will suggest that the sentiment remains negative and traders are selling on rallies. That could sink the pair to the $16.18 to $15.28 support zone.</p><h2>Litecoin price analysis</h2><p>Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) broke above the overhead resistance at $106 on June 30 and the bulls have managed to sustain the price above this level.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/3e47184e-55fa-4a16-8b3b-aa16829df2b3.png\"  /><figcaption style=\"text-align: center;\"><em>LTC/USDT daily chart. Source: TradingView</em></figcaption></figure><p>However, the bears have not given up and they are trying to stall the up-move at the next resistance at $115. If bulls sustain the price above $106, it will enhance the prospects of the continuation of the uptrend. The LTC/USDT pair may then soar to the overhead zone between $134 and $144.</p><p>The first support on the downside is $106. If this level gives way, it will indicate that the short-term bulls may be booking profits. That could drag the price down to the 20-day EMA ($93).</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T20:27:54.000Z",
    "title": "Take These Next Steps To Distinguish Recession vs Depression",
    "url": "https://www.cryptopolitan.com/distinguish-recession-vs-depression/",
    "description": "The ebb and flow of an economy often set the tone for many important decisions at both micro and macro levels. Whether it is a multinational corporation strategizing its financial trajectory or a household planning its budget, the state of the economy significantly impacts these choices. Therefore, an understanding of different economic conditions, such as ... <a title=\"Take These Next Steps To Distinguish Recession vs Depression\" class=\"read-more\" href=\"https://www.cryptopolitan.com/distinguish-recession-vs-depression/\" aria-label=\"More on Take These Next Steps To Distinguish Recession vs Depression\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T20:25:56.000Z",
    "title": "UBS ramps up hiring to serve affluent US investors",
    "url": "https://www.cryptopolitan.com/ubs-hiring-to-serve-affluent-us-investors/",
    "description": "Unmistakably, UBS is making strides in strengthening its footing in the highly lucrative U.S. wealth market. In a bold move, UBS intensifies hiring wealth managers to cater to the affluent American populace, a move unfolding even as the financial giant mulls over shedding up to a third of its workforce globally, following the acquisition of ... <a title=\"UBS ramps up hiring to serve affluent US investors\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ubs-hiring-to-serve-affluent-us-investors/\" aria-label=\"More on UBS ramps up hiring to serve affluent US investors\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T20:16:39.000Z",
    "title": "Musk is going to sabotage Yaccarino’s plans for Twitter",
    "url": "https://www.cryptopolitan.com/musk-sabotage-yaccarinos-plans-for-twitter/",
    "description": "There&#8217;s an unexpected, yet not surprising, storm brewing in the Twitter-verse. Elon Musk, known for his spontaneous and at times destabilizing decisions, has ignited a clash of titans within the realm of social media and advertising. This time, his aim is focused on Twitter, a platform he recently took over, with ramifications that might just ... <a title=\"Musk is going to sabotage Yaccarino&#8217;s plans for Twitter\" class=\"read-more\" href=\"https://www.cryptopolitan.com/musk-sabotage-yaccarinos-plans-for-twitter/\" aria-label=\"More on Musk is going to sabotage Yaccarino&#8217;s plans for Twitter\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T20:09:30.000Z",
    "title": "BlackRock sparks intense ETF price battle",
    "url": "https://www.cryptopolitan.com/blackrock-sparks-intense-etf-price-battle/",
    "description": "Opening up the frontline of a fierce financial battle, BlackRock&#8217;s strategic leap into the US buffered exchange-traded fund (ETF) realm has begun to intensify the competition on pricing. The financial titan introduced two ETFs, specifically designed to provide investors a safety net against market downturns, fundamentally reshaping the competitive landscape and pressuring competitors to rethink ... <a title=\"BlackRock sparks intense ETF price battle\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blackrock-sparks-intense-etf-price-battle/\" aria-label=\"More on BlackRock sparks intense ETF price battle\">Read more</a>"
  }
]