[
  {
    "source": "CoinDesk",
    "date": "2023-08-10T02:36:29.000Z",
    "title": "Y00ts NFT Collection is Migrating to Ethereum After Accepting $3M Grant From Polygon",
    "url": "https://www.coindesk.com/web3/2023/08/10/y00ts-nft-collection-is-migrating-to-ethereum-after-accepting-3m-grant-from-polygon/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "DeGods project leader Rohun Vora, known as Frank, said that the move aims to \"unite the DeGods and y00ts communities\" on the same blockchain. Polygon said it would re-deploy some of the returned funds to support its native builders and creators."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-10T01:52:30.000Z",
    "title": "First Mover Asia: SEC Appealing XRP Ruling Isn't Moving Markets",
    "url": "https://www.coindesk.com/markets/2023/08/10/first-mover-asia-sec-appealing-xrp-ruling-isnt-moving-markets/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Ripple's partial victory over the Securities and Exchange Commission pushed up the layer 1 and altcoin market, as many of these tokens had been accused of being securities."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-10T01:42:13.000Z",
    "title": "Google Hungers for More Data to Train Its AI—But At What Cost?",
    "url": "https://decrypt.co/151970/google-ai-web-scraping-australia-investigation-training-data",
    "description": "Google stands ready to use your online content to train its AI models, unless it's told to stop."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-10T02:23:45.000Z",
    "title": "Aptos token rises 11.6% after Microsoft deal to marry AI with blockchain",
    "url": "https://cointelegraph.com/news/aptos-token-surges-after-partner-microsoft",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/2a09209b-d993-41e1-80fc-0b496f9a7dbe.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>APT pumped 17.6% within the first 50 minutes before cooling off to $7.51 — still 11.6% above pre-announcement levels.</p>\n                    <p><p>Aptos (<a href=\"https://cointelegraph.com/aptos-apt-price-index\">APT</a>), the cryptocurrency powering layer-1 blockchain Aptos Network, is up approximately 11.6% since announcing it will leverage Microsoft’s suite of artificial intelligence tools to advance Web3 adoption among banks and financial enterprises.</p><p>This will be achieved by enabling the Aptos Network to tap into Microsoft’s Azure OpenAI service to explore innovations in asset tokenization, on-chain payments and central bank digital currencies, <a href=\"https://twitter.com/AptosLabs/status/1689261171118088192\" target=\"_blank\" rel=\"noopener nofollow\">Aptos</a> explained in an Aug. 9 statement.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today, we&#39;re making Aptos history.<a href=\"https://twitter.com/AptosLabs?ref_src=twsrc%5Etfw\">@AptosLabs</a> is partnering with <a href=\"https://twitter.com/Microsoft?ref_src=twsrc%5Etfw\">@Microsoft</a> to unlock Web3 on the <a href=\"https://twitter.com/Aptos_Network?ref_src=twsrc%5Etfw\">@Aptos_Network</a>.<br><br>As an <a href=\"https://twitter.com/msPartner?ref_src=twsrc%5Etfw\">@msPartner</a>, our joint suite of AI-supported tools will offer developers and users around the world effortless access to Web3. (1/6) <a href=\"https://t.co/zWsrVWhSql\">pic.twitter.com/zWsrVWhSql</a></p>&mdash; Aptos Labs (@AptosLabs) <a href=\"https://twitter.com/AptosLabs/status/1689261166663766016?ref_src=twsrc%5Etfw\">August 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Mo Shaikh, the CEO of Aptos Labs who previously worked at Meta and BlackRock, signaled high hopes for AI-powered blockchain solutions:</p><blockquote>\"Artificial Intelligence and blockchain technologies are quickly converging for one important reason: they are both generational breakthroughs that profoundly impact the evolution of the internet and shape society.”</blockquote><p>One of the new tools, Aptos Assistant — a ChatGPT-powered chatbot — will aim to help users navigate from Web2 to Web3 by offering virtual guidance with the onboarding process.</p><p>Microsoft will also boost the security of <a href=\"https://cointelegraph.com/news/aptos-user-growth-900-percent-integration-social-media-app-chingari\">the Aptos Network</a> by allowing Aptos Labs to run validator nodes on Azure, <a href=\"https://twitter.com/AptosLabs/status/1689261172368064513\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to the cryptocurrency firm.</p><p>The <a href=\"https://aptoslabs.com/blog\" target=\"_blank\" rel=\"noopener nofollow\">news</a> — which was unveiled on Aug. 9, 12:30 pm UTC — immediately pushed APT up 17.6% to $7.92 within the first 50 minutes before cooling off to $7.51 at the time of writing, <a href=\"https://www.coingecko.com/en/coins/aptos\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to CoinGecko.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/12d40553-eda2-4b9c-a3d8-4cd18b361bd9.png\"  /><figcaption style=\"text-align: center;\"><em>APT pumped nearly 18% after the announcement. Source: CoinGecko.</em></figcaption></figure><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/press-releases/superblock-raises-8m-for-over-protocol-a-new-layer-1-blockchain-gocusing-on-lightweight-full-nodes\"><strong><em>Superblock raises $8M for “Over Protocol,” a new layer 1 blockchain focusing on lightweight full nodes</em></strong></a></p><p>Despite the price pump, the Aptos token is still down 62.9% from its <a href=\"https://cointelegraph.com/news/5-reasons-why-the-aptos-apt-rally-could-still-have-wings\">all-time high price</a> of $19.92 on Jan. 26, 2023, according to CoinGecko. </p><p>The <a href=\"https://cointelegraph.com/news/performing-as-expected-aptos-labs-defends-day-1-criticism\">Aptos Network launched on Oct. 17</a> after four years of development. Aptos was founded by former Meta employees Mo Shaikh and Avery Ching, who also had a role in Meta’s failed Diem project. </p><p>It closed <a href=\"https://cointelegraph.com/news/aptos-labs-raises-150m-more-than-doubling-valuation\">$150 million in funding in July 2022</a> and <a href=\"https://cointelegraph.com/news/diem-team-members-raise-200m-to-launch-blockchain-derived-from-it\">$200 million in March 2022</a> from the likes of Andreessen Horowitz, Coinbase Ventures and FTX Ventures.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/chinas-blockchain-satellite-in-space-hong-kongs-mcnuggets-metaverse-asia-express/\"><strong><em>China’s blockchain satellite in space, Hong Kong’s McNuggets Metaverse: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-10T01:49:59.000Z",
    "title": "Fireblocks discloses massive vulnerability affecting crypto wallets",
    "url": "https://cointelegraph.com/news/fireblocks-identifies-crypto-wallet-bitforge-vulnerability",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/ae3db08b-5e50-44b4-a404-d03eab558e7b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Fireblocks said the vulnerabilities affecting Coinbase, Binance, and Zengo have since been fixed and has reached out to more than 12 others still at risk.</p>\n                    <p><p>Over 15 widely-used crypto wallet providers and projects have gaping vulnerabilities that could potentially see millions of crypto wallets drained, according to digital asset infrastructure firm Fireblocks.</p><p>In an Aug. 9 press <a href=\"https://www.prnewswire.com/news-releases/fireblocks-researchers-uncover-vulnerabilities-impacting-dozens-of-major-wallet-providers-301897357.html\" target=\"_blank\" rel=\"noopener nofollow\">release</a>, Fireblocks said the series of vulnerabilities, dubbed BitForge, are affecting wallets using multi-party computation (MPC) technology, which allows for multiple parties to control and manage cryptocurrency holdings.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ The Fireblocks research team has uncovered BitForge, a set of vulnerabilities in some of the most widely adopted MPC protocols, that allow an attacker to retrieve a private key from a single device. Read on → <a href=\"https://t.co/xo2r9zgCvj\">https://t.co/xo2r9zgCvj</a> <a href=\"https://t.co/7q1nEeVBwO\">pic.twitter.com/7q1nEeVBwO</a></p>&mdash; Fireblocks (@FireblocksHQ) <a href=\"https://twitter.com/FireblocksHQ/status/1689389347274162178?ref_src=twsrc%5Etfw\">August 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The identified issues were disclosed as “zero day” vulnerabilities — meaning that the flaws had not previously been identified by the projects. </p><blockquote>“If left unremediated, the exposures would allow attackers and malicious insiders to drain funds from the wallets of millions of retail and institutional customers in seconds, with no knowledge to the user or vendor.”</blockquote><p>The firm disclosed that the BitForge vulnerabilities affected many of the top wallet providers, including Coinbase, Zengo and Binance. Following an industry-standard “90 day disclosure period” from Fireblocks, the three firms have since resolved the identified issues. </p><p>In a statement, Coinbase chief information security officer Jeff Lunglhofer thanked Fireblocks for identifying and responsibly disclosing the issue, adding that Coinbase customers and funds were never at risk. Zengo CTO Tal Be'ery noted that the issue was promptly fixed and no user funds were affected.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">3/ We want to extend our gratitude to the researchers at Fireblocks for identifying this issue, conducting an ethical disclosure, and helping to improve the security of the ecosystem.</p>&mdash; Coinbase Cloud ️ (@CoinbaseCloud) <a href=\"https://twitter.com/CoinbaseCloud/status/1689400685140574217?ref_src=twsrc%5Etfw\">August 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Fireblocks said it has worked to identify other firms that may be implicated in similar security concerns and have reached out to them. </p><p>MPC wallets encrypt a user’s private key and share it between several parties — typically comprised of the wallet owner, a wallet provider, and another third party. Theoretically, no one of these entities should be able to unlock the wallet without first communicating with the others. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-fireblocks-tel-aviv-stock-exchange-to-offer-crypto-services-via-fireblocks-pact\"><strong><em>Tel Aviv Stock Exchange to offer crypto services via Fireblocks pact</em></strong></a></p><p>However, according to Fireblocks’ technical <a href=\"https://www.fireblocks.com/blog/lindell17-abort-vulnerability-technical-report\" target=\"_blank\" rel=\"noopener nofollow\">reports</a> on the BitForge vulnerabilities, the vulnerabilities would have allowed hackers to “extract the full private key if they were able to compromise only one device.”</p><p>“While we are encouraged to see that MPC is now ubiquitous within the digital asset industry, it is evident from our findings — and our subsequent disclosure process — that not all MPC developers and teams are created equal,” said Fireblocks CTO and co-founder Pavel Berengoltz.</p><p>“Companies leveraging Web3 technology should work closely with security experts with the know-how and resources to stay ahead of and mitigate vulnerabilities,” he added. </p><p><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-10T02:00:24.000Z",
    "title": "Russian central bank to launch digital ruble pilot Aug. 15",
    "url": "https://cryptoslate.com/russian-central-bank-to-launch-digital-ruble-pilot-aug-15/",
    "description": "<p>Russia&#8217;s central bank announced on Aug. 9 that it will initiate testing its digital ruble with banks, consumers, and businesses in mid-August. Olga Skorobogatova, First Deputy Governor of the Bank of Russia, said: &#8220;The launch of pilot operations with real digital rubles is the most important stage of the project. This will allow us to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/russian-central-bank-to-launch-digital-ruble-pilot-aug-15/\">Russian central bank to launch digital ruble pilot Aug. 15</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-10T02:30:39.000Z",
    "title": "UBS Expects US Dollar Dominance to Persist for ‘Years to Come’",
    "url": "https://news.bitcoin.com/ubs-expects-us-dollar-dominance-to-persist-for-years-to-come/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/ubs-dollar-dominance-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"UBS Expects US Dollar Dominance to Persist for &#039;Years to Come&#039;\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/ubs-dollar-dominance-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ubs-dollar-dominance-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ubs-dollar-dominance-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ubs-dollar-dominance-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ubs-dollar-dominance-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ubs-dollar-dominance-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ubs-dollar-dominance.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Swiss investment banking giant UBS expects the U.S. dollar’s reign to live on. &#8220;We firmly believe we will be living in a U.S. dollar-centric world for years to come,&#8221; the bank&#8217;s executive said, adding that there will be some room for competitors. UBS on US Dollar’s Dominance Switzerland-headquartered investment bank UBS has argued that the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-10T03:00:38.000Z",
    "title": "Litecoin Hash Rate Steady Despite Dismal Price Action: Will This Change?",
    "url": "https://www.newsbtc.com/news/litecoin/litecoin-hash-rate-steady-dismal-price-action/",
    "description": "One week after the highly anticipated Litecoin halving event on August 2, on-chain data reveals that the network&#8217;s hash rate, a key measure of computing power channeled to the network, is steady but erratic. As of August 9, trackers indicate that the Litecoin network&#8217;s hash rate is hovering around 760 TH/s, a notable decrease from the all-time peak of 816 TH/s recorded in late July 2023. Litecoin Prices Steady But Lower, Rally Incoming? Litecoin prices, on the other hand, are firm but down in the previous week of trading. CoinMarketCap data on August 9 shows that LTC is changing hands at $83, down 5% over the past week. What&#8217;s clear is that prices are moving tightly inside a consolidation range. Despite this dip, LTC is relatively resilient, up 17% from June 2023 lows. However, from a top-down preview, the coin is down 26% from the 2023 highs. In the medium term, LTC remains bullish since bears have failed to unwind gains posted from mid-June to mid-July 2023. Whether bulls will maintain control after halving, however, is also unclear. If past performance guides, there is a glimmer of hope for bulls. The previous Litecoin halving in August 2019 was several months before LTC ripped to $400 in 2021. Even so, before this spike, LTC prices nearly halved from $66 to $35 in December 2019. Related Reading: Cardano-Native MuesliSwap To Refund Users After “Slippage” Misunderstanding Unlike previous halvings, the crypto space has matured, and regulatory clarity has improved, particularly concerning Bitcoin—the foundational protocol from which Litecoin emerged. For instance, while most US regulators consider Bitcoin a commodity, the Securities and Exchange Commission (SEC) is cautious toward other altcoins. Tracking On-Chain Metrics To Gauge Interest Considering the above challenges and regulatory uncertainty, the interconnection between hash rate and spot prices is actively monitored. Litecoin relies on decentralized miners for security and transaction confirmation.  The network&#8217;s security is evaluated via the hash rate metric, which risks crashing since miners must allocate more resources after the network halved rewards to 6.25 LTC. A potential price decline could trigger a corresponding reduction in hash rate, forcing the network to adjust the difficulty.  Related Reading: MakerDAO Debates New EDSR Optimization Plan As MKR Bears Retain Market Control How this evolves remains to be seen, and the network remains stable at spot rates. Besides the hash rate near all-time highs, the network&#8217;s activity seems unaffected. According to IntoTheBlock data, the network&#8217;s average growth is steady despite sentiment on LTC being generally negative. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-10T03:00:36.000Z",
    "title": "XRP Could Experience Nearly 10% Surge Upon Immediate Break Of These Key Levels",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-could-experience-nearly-10-surge-upon-immediate-break-of-these-key-levels/",
    "description": "XRP has halted its decline by rising above the $0.60 price level. In the past 24 hours, its value increased by nearly 6%. However, XRP hasn&#8217;t yet shown significant gains on the weekly chart. Related Reading: Ethereum Crosses $1,800, But How Long Will Bullish Revival Last? The technical analysis suggests a positive trend for XRP, but there&#8217;s a chance that the coin could face more downward movement in the upcoming trading sessions. If buyers push the price higher, XRP might maintain its position above the current price level. Moreover, breaking through two crucial resistance levels could lead to a potential surge of over 9%. For XRP to keep rising, the broader market must provide support, particularly Bitcoin&#8217;s movement beyond the $30,000 zone. If buying momentum doesn&#8217;t recover, XRP might experience a decline and drop below its local support line. The increasing market capitalization of XRP indicates active buyer participation at the present moment. XRP Price Analysis: One-Day Chart At the time of writing, the altcoin was priced at $0.65. This value has presented significant resistance for the altcoin in recent weeks. The upcoming trading sessions hold critical importance as XRP must effectively surpass this level. Failing to achieve this could trigger a subsequent decline in the price. Furthermore, overhead resistance levels are $0.67, followed by $0.69. Should XRP successfully breach the $0.69 mark, the altcoin might trade around the $0.72 range. Conversely, a local support level is positioned at $0.63. Should the price dip below this threshold, it could potentially descend to $0.60, ultimately pausing the overall bullish sentiment. Technical Analysis For demand, XRP&#8217;s chart indicates its current state as overbought. The Relative Strength Index has reached 70, indicating buyers currently influence the price direction. This could imply the potential for a price correction in the upcoming trading sessions. While such a correction might not be prolonged, any drop in XRP&#8217;s value below $0.63 might reduce buyer activity. The asset&#8217;s price remained positioned above the 20-Simple Moving Average line. This observation signifies an increasing demand and emphasizes buyers&#8217; role in steering the market&#8217;s price dynamics. Furthermore, the altcoin has generated buy signals in response to the rising demand. These buy signals are represented by the emergence of green histograms in the Moving Average Convergence Divergence indicator, signaling a bullish sentiment. Additionally, the Directional Movement Index presents a positive outlook, with the +DI (blue) line positioned above the -DI (orange) line, indicating a favorable price trajectory. Related Reading: Bitcoin Price Losses Steam Above $30K But The Bulls Are Not Done Yet Moreover, the Average Directional Index (Red) has crossed the 40 mark, implying an increase in the strength of the price trend. This development suggests XRP could yield additional gains in the near-term trading sessions. Featured image from Finbold, charts from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-10T02:23:00.000Z",
    "title": "SpiritSwap Announces Shutdown Following Multichain Exploit, Seeks New Team",
    "url": "https://coinedition.com/spiritswap-announces-shutdown-following-multichain-exploit-seeks-new-team/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/SpiritSwap-Announces-Shutdown-Following-Multichain-Exploit-Seeks-New-Team.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SpiritSwap Announces Shutdown Following Multichain Exploit, Seeks New Team\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/SpiritSwap-Announces-Shutdown-Following-Multichain-Exploit-Seeks-New-Team.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/SpiritSwap-Announces-Shutdown-Following-Multichain-Exploit-Seeks-New-Team-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/SpiritSwap-Announces-Shutdown-Following-Multichain-Exploit-Seeks-New-Team-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/SpiritSwap-Announces-Shutdown-Following-Multichain-Exploit-Seeks-New-Team-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/SpiritSwap-Announces-Shutdown-Following-Multichain-Exploit-Seeks-New-Team-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/SpiritSwap-Announces-Shutdown-Following-Multichain-Exploit-Seeks-New-Team-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/SpiritSwap-Announces-Shutdown-Following-Multichain-Exploit-Seeks-New-Team-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/SpiritSwap-Announces-Shutdown-Following-Multichain-Exploit-Seeks-New-Team-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/SpiritSwap-Announces-Shutdown-Following-Multichain-Exploit-Seeks-New-Team-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/SpiritSwap-Announces-Shutdown-Following-Multichain-Exploit-Seeks-New-Team-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/SpiritSwap-Announces-Shutdown-Following-Multichain-Exploit-Seeks-New-Team-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/SpiritSwap-Announces-Shutdown-Following-Multichain-Exploit-Seeks-New-Team-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/SpiritSwap-Announces-Shutdown-Following-Multichain-Exploit-Seeks-New-Team-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/SpiritSwap-Announces-Shutdown-Following-Multichain-Exploit-Seeks-New-Team-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/SpiritSwap-Announces-Shutdown-Following-Multichain-Exploit-Seeks-New-Team-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/SpiritSwap-Announces-Shutdown-Following-Multichain-Exploit-Seeks-New-Team-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>SpiritSwap, pioneering DEX on Fantom Opera Chain, announces winding down its operations. Community has until September 1 to withdraw liquidity. SPIRIT price drops by 36% in 24 hours to $0.0008 from $0.0012. In a letter addressed to the SpiritSwap Community, the pioneering decentralized exchange (DEX) built on the Fantom Opera Chain, SpiritSwap, has officially announced [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/spiritswap-announces-shutdown-following-multichain-exploit-seeks-new-team/\">SpiritSwap Announces Shutdown Following Multichain Exploit, Seeks New Team</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]