[
  {
    "source": "Cointelegraph",
    "date": "2023-11-17T11:42:20.000Z",
    "title": "Bitcoin bull market FOMO absent as BTC price nears key $39K profit zone",
    "url": "http://cointelegraph.com/news/bitcoin-bull-market-fomo-btc-price-39k-profit-zone",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/a7a44fa8-e66b-4219-9cf8-cc8bc6566900.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>\"We're still early,\" analyst says as Bitcoin profitability dynamics reveal a shift in BTC supply profitability on the horizon.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) bull market “FOMO” has yet to appear despite BTC price being up 120% this year.</p><p>Data from statistics platform <a href=\"https://www.lookintobitcoin.com/charts/realized-cap-hodl-waves/\" target=\"_blank\" rel=\"noopener nofollow\">Look Into Bitcoin</a> shows that on-chain transactions are only starting to involve “younger” bitcoins.</p><h2>Bitcoin bull market analysis: \"We're still early\"</h2><p>Bitcoin remains near 18-month highs and well beyond its bear market trading range and several key resistance levels.</p><p>While the <a href=\"https://twitter.com/santimentfeed/status/1725412046383259719?s=20\" target=\"_blank\" rel=\"noopener nofollow\">number of smaller wallets</a> is increasing, there has not been a major return to the network from speculators — those holding BTC for short periods of time.</p><p>In an <a href=\"https://twitter.com/PositiveCrypto/status/1725074771434504329/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">X post</a> on Nov. 16, Look Into Bitcoin creator Philip Swift flagged the Realized Cap HODL Waves metric, also known as RHODL Waves, as proof.</p><p>RHODL splits the existing HODL Waves metric, which divides BTC by age group of the supply, and compares it to the price at which they last moved on-chain.</p><p>The result is a spike in coins, which move frequently during bull market phases, and the opposite in bear markets, where investors are afraid to sell or are in the red on their holdings.</p><p>“Warmer colour low timeframe waves are only just starting to increase as coins are transferred on-chain,” Swift commented on the current state of RHODL. </p><blockquote>“No FOMO yet. We're still early.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/59887d87-187f-42d0-a226-8d9f6024a69a.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin RHODL Waves chart. Source: Look Into Bitcoin</em></figcaption></figure><h2>Bitcoin profitability nears \"potential breakeven point\"</h2><p>Continuing the examination of Bitcoin supply “age bands,” Onchained, a contributor to on-chain analytics platform CryptoQuant, stressed that those who increased BTC exposure in the run-up to the 2021 all-time highs remain underwater.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-institutional-inflows-1b-2023-btc-supply-squeeze\">Bitcoin institutional inflows top $1B in 2023 amid BTC supply squeeze</a></em></strong></p><p>He did so using the Net Unrealized Profit/Loss (NUPL) indicator, which offers profitability ratios for cohorts of stored coins.</p><p>Coming soon, however, is a key line in the sand for bull market hodlers.</p><p>“Considering NUPL across different age bands provides insights into profitability dynamics. Notably, the depicted graph reveals all UTXO age bands currently in a profitable state, except for holders with bitcoins held for 18 months to 3 years,” Onchained wrote in one of CryptoQuant’s <a href=\"https://cryptoquant.com/insights/quicktake/655619799f083845a43b582a-Bitcoin-NUPL-Analysis-and-UTXO-Age-Bands\" target=\"_blank\" rel=\"noopener nofollow\">Quicktake market updates</a> on Nov. 16. </p><blockquote>“This aligns with their entry during the Bitcoin price rally to $67,000. Their NUPL nearing the profitability benchmark of 0 suggests a potential break-even point if Bitcoin continues its rally beyond $39,000.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/529e2d5d-6c90-4130-af5e-6e419f327baf.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin UTXOs in loss % chart. Source: CryptoQuant</em></figcaption></figure><p>CryptoQuant data shows that the overall proportion of unspent transaction outputs, or UTXOs, currently at a loss is now just 11.6%.</p><p>As Cointelegraph reported, whale entities have been <a href=\"https://cointelegraph.com/news/btc-price-1-week-lows-bitcoin-whales-sell-35k\">increasing BTC selling</a> at current prices.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-17T12:00:59.000Z",
    "title": "Global securities regulators push for worldwide digital asset oversight with 18 new policy recommendations",
    "url": "https://cryptoslate.com/global-securities-regulators-push-for-worldwide-digital-asset-oversight-with-18-new-policy-recommendations/",
    "description": "<p>The International Organization of Securities Commissions (IOSCO) has released the final report of its 18 policy recommendations for digital assets designed to bring uniformity and robust oversight. IOSCO is a global cooperative of securities regulatory agencies that aims to maintain fair and efficient markets. It was established in 1983, and its membership regulates more than [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/global-securities-regulators-push-for-worldwide-digital-asset-oversight-with-18-new-policy-recommendations/\">Global securities regulators push for worldwide digital asset oversight with 18 new policy recommendations</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-17T11:45:05.000Z",
    "title": "Federal Reserve accelerates balance sheet reduction with $46 billion cut in a week",
    "url": "https://cryptoslate.com/insights/federal-reserve-accelerates-balance-sheet-reduction-with-46-billion-cut-in-a-week/",
    "description": "<p>Quick Take The Federal Reserve&#8217;s balance sheet contraction continues at a heightened pace, according to recent data. In the last week, the Fed drew down its balance sheet by $46 billion, a substantial increase from the $6 billion reduction the previous week. As a result of this quantitative tightening, the balance sheet now stands at [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/federal-reserve-accelerates-balance-sheet-reduction-with-46-billion-cut-in-a-week/\">Federal Reserve accelerates balance sheet reduction with $46 billion cut in a week</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-17T11:50:57.000Z",
    "title": "SEC Gensler says we will not prejudge",
    "url": "https://cryptodaily.co.uk/2023/11/sec-gensler-says-we-will-not-prejudge",
    "description": "Gary Gensler, chairman of the Securities and Exchange Commission (SEC) was forthright in a speech, saying that the SEC is not a prosecutor of honest business, and neither will it prejudge."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-17T12:00:24.000Z",
    "title": "Star Atlas: A New Era in Gaming and Blockchain",
    "url": "https://news.bitcoin.com/star-atlas-a-new-era-in-gaming-and-blockchain/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/unnamed-2023-11-17t130054-003-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/unnamed-2023-11-17t130054-003-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/unnamed-2023-11-17t130054-003-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/unnamed-2023-11-17t130054-003-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/unnamed-2023-11-17t130054-003-1536x864.jpg 1536w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/unnamed-2023-11-17t130054-003-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/unnamed-2023-11-17t130054-003-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/unnamed-2023-11-17t130054-003-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/unnamed-2023-11-17t130054-003-1520x855.jpg 1520w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/unnamed-2023-11-17t130054-003-1280x720.jpg 1280w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/unnamed-2023-11-17t130054-003.jpg 1600w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. Launching with LBank: A Promising Beginning Star Atlas, a pioneering force in the fusion of gaming and blockchain, has taken a significant leap forward with the listing of its ATLAS token on LBank. This milestone not only marks a new chapter in its journey but has also sparked a notable surge in market [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-17T12:09:51.000Z",
    "title": "WaveDancer and Firefly Neuroscience Announce Merger to Advance BNA Platform for Mental Health Diagnosis",
    "url": "https://www.cryptopolitan.com/wavedancer-advance-for-mental-health/",
    "description": "WaveDancer, a NASDAQ-listed medical technology company, has announced a definitive merger agreement with Firefly Neuroscience, a pioneer in AI-driven healthcare solutions. This all-stock deal aims to bring Firefly&#8217;s cutting-edge Brain Network Analytics (BNA) platform to the forefront of mental disease and cognitive disorder diagnosis. This partnership is set to transform the landscape of brain health ... <a title=\"WaveDancer and Firefly Neuroscience Announce Merger to Advance BNA Platform for Mental Health Diagnosis\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wavedancer-advance-for-mental-health/\" aria-label=\"More on WaveDancer and Firefly Neuroscience Announce Merger to Advance BNA Platform for Mental Health Diagnosis\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-17T11:53:11.000Z",
    "title": "NPCs Come to Life in GTA 6 Thanks to AI ",
    "url": "https://www.cryptopolitan.com/npcs-come-to-life-in-gta6/",
    "description": "\nDiscover the potential AI revolution in GTA 6, with smarter NPCs, autonomous gameplay, and realistic traffic movements, all hinted at in this article."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-17T11:45:04.000Z",
    "title": "Monopoly GO Surpasses $1 Billion Milestone in Mobile Gaming",
    "url": "https://www.cryptopolitan.com/monopoly-go-surpasses-1-billion-milestone/",
    "description": "Mobile board game Monopoly GO has made waves in the gaming industry, achieving a remarkable milestone of over $1 billion in spending within just seven months post-launch. Developed by Scopely in collaboration with major US toy manufacturer Hasbro, Monopoly GO has emerged as the biggest mobile game launch of 2023. The game&#8217;s success is marked ... <a title=\"Monopoly GO Surpasses $1 Billion Milestone in Mobile Gaming\" class=\"read-more\" href=\"https://www.cryptopolitan.com/monopoly-go-surpasses-1-billion-milestone/\" aria-label=\"More on Monopoly GO Surpasses $1 Billion Milestone in Mobile Gaming\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-17T11:41:16.000Z",
    "title": "Crypto winter over, Cardano, Meme Moguls, and Fantom rallying",
    "url": "https://crypto.news/crypto-winter-over-cardano-meme-moguls-and-fantom-rallying/",
    "description": "Altcoins, including Cardano (ADA), Meme Moguls (MGLS), and Fantom (FTM), have also been trending higher, following Bitcoin"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-17T11:40:06.000Z",
    "title": "XREX receives approval for crypto payment services in Singapore",
    "url": "https://crypto.news/xrex-receives-approval-for-crypto-payment-services-in-singapore/",
    "description": "XREX, a crypto exchange in Asia focusing on cross-border payments, has secured in-principle approval for a Major Payment Institution (MPI) license in Singapore. On Nov. 17, XREX announced on X (formerly Twitter) that it had received initial approval from the&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-17T11:45:24.000Z",
    "title": "Options Frenzy: Bitcoin Rally To $37,000 Sparks Explosive Open Interest Surge",
    "url": "https://www.newsbtc.com/news/options-frenzy-bitcoin-rally-to-37000-sparks-explosive-open-interest-surge/",
    "description": "An apparent increase in demand for safe-haven assets, rising interest in Bitcoin ETFs in the US, and anticipation of a more accommodating position from the Federal Reserve were the purported drivers of the cryptocurrency market&#8217;s recovery this year, which led to a significant gain in the value of Bitcoin. While the spot and futures markets for bitcoin were at the center of attention at first, options related to the cryptocurrency have recently come to the fore. By introducing a new facet to the market dynamics, these options give a convenient way to speculate on possible price swings. According to figures from Glassnode, the open interest in Bitcoin&#8217;s options has reached a new high point by exceeding $16 billion. This big increase in open interest happens at the same time that Bitcoin&#8217;s price successfully reclaimed the $37,000 mark on November 15. Options Open Interest On The Rise The rise in open interest for options shows that the market is more active and investors are interested in Bitcoin futures. The $16 billion figure shows how important options trading is becoming as a major part of the bitcoin market. On November 10, the Options Open Interest, a measure of the total amount of money invested in options contracts, reached a record high of $18.05 billion, or 491,000 Bitcoin, Coinglass data shows. Deribit, which has contributed about $14.5 billion, is mostly responsible for this surge, according to Coinglass. Related Reading: Litecoin Sustains 4-Month Run With 37% Gain, Beating Most Of Its Peers – Details The cryptocurrency derivatives exchange has also disclosed a nearly peak value of $14.6 billion for its entire open interest notional value. Source: Coinglass Bitcoin was trading at $36,550 at the time of publishing. Using statistics from CoinMarketCap, the last time BTC traded at the $37K price was in May 2022. The coin has gained 5% in value over the past day. In a noteworthy development, BTC options open interest has outpaced that of BTC futures, marking a significant stride in what Deribit described as &#8220;increasing market sophistication.&#8221; The platform reported this shift earlier in the week, with Deribit&#8217;s Chief Commercial Officer, Luuk Strijers, emphasizing that the surpassing of BTC options open interest over futures open interest serves as a clear indicator of the market&#8217;s maturation. BTCUSD trading a little over $36K today. Chart: TradingView.com Bitcoin And The Broader Shift In Market Dynamics According to Strijers, this transition suggests a growing inclination among participants to leverage options as strategic instruments for positioning, hedging, or capitalizing on the recent surge in implied volatility. This evolution underscores a &#8220;broader shift in market dynamics,&#8221; reflecting an enhanced understanding and utilization of financial instruments within the cryptocurrency space. Related Reading: Altcoin Delight: Solana Balloons To 50%, Nearly Triples In A Month – Here’s Why Meanwhile, adding to the upbeat narrative, the eagerly anticipated Bitcoin halving scheduled for April 2024 emerges as a beacon of positivity. With a historical track record of instigating a scarcity effect by halving miners&#8217; rewards, this event has consistently propelled upward momentum in Bitcoin&#8217;s price. Analysts and enthusiasts alike are brimming with optimism, viewing the upcoming halving as a potential catalyst that could robustly reinforce Bitcoin&#8217;s position and intrinsic value within the market, paving the way for heightened anticipation and market dynamics. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Freepik"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-17T11:45:04.000Z",
    "title": "Bitcoin (BTC) Price Slips: Consolidation Before Another Breakout?",
    "url": "https://coinedition.com/bitcoin-btc-price-slips-consolidation-before-another-breakout/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/Bitcoin-Mean-Transaction-Volume-Reaches-New-23-Month-Low.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin Mean Transaction Volume Reaches New 23-Month Low\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/Bitcoin-Mean-Transaction-Volume-Reaches-New-23-Month-Low.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/Bitcoin-Mean-Transaction-Volume-Reaches-New-23-Month-Low-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/Bitcoin-Mean-Transaction-Volume-Reaches-New-23-Month-Low-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/Bitcoin-Mean-Transaction-Volume-Reaches-New-23-Month-Low-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/Bitcoin-Mean-Transaction-Volume-Reaches-New-23-Month-Low-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/Bitcoin-Mean-Transaction-Volume-Reaches-New-23-Month-Low-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Daan Crypto, a trader and analyst, told his 349,200 followers on X that the current market shakeout and Bitcoin (BTC) correction should not dampen the community’s spirit. According to Daan, corrections are normal, especially when upticks have had an extended period of stay. While preaching caution, he also mentioned that another breakout may be on [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/bitcoin-btc-price-slips-consolidation-before-another-breakout/\">Bitcoin (BTC) Price Slips: Consolidation Before Another Breakout?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]