[
  {
    "source": "CoinDesk",
    "date": "2023-07-19T11:11:40.000Z",
    "title": "BNB Chain Burns Nearly $500M Worth of BNB Tokens",
    "url": "https://www.coindesk.com/markets/2023/07/19/bnb-chain-burns-nearly-500m-worth-of-bnb-tokens/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The burned tokens are now permanently destroyed, which makes circulating tokens more valuable if demand increases."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-19T11:36:13.000Z",
    "title": "Hong Kong would not go crypto without China’s approval: Animoca exec",
    "url": "https://cointelegraph.com/news/crypto-web3-animoca-hong-kong-would-not-go-crypto-without-approval-of-china-says-animoca-exec",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/48c56bfa-b0fd-4fdb-8278-5ceef2b1ac7c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>China looks at Web3 as a powerful tool to challenge the United States’ technological and economic hegemony, Animoca co-founder said.</p>\n                    <p><p>Hong Kong’s rapid adoption of cryptocurrencies and Web3 is a sign of some “big moves” happening in mainland China, a co-founder of the local game software firm Animoca believes. </p><p>The current crypto trend in Hong Kong is “not really just about” the city-state, but about wider China, despite mainland China banning crypto, according to Animoca co-founder <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/yat-siu\">Yat Siu</a>.</p><p>Speaking at the EthCC conference on July 19, Siu mentioned that <a href=\"https://cointelegraph.com/news/beijing-releases-white-paper-for-web3-innovation-and-development\">China released its Web3 white paper</a> in May, in which the government “basically indicated that Web3 is the future of the internet.” It should not be underestimated that the news came just a few days after Hong Kong officially announced plans to <a href=\"https://cointelegraph.com/news/hong-kong-crypto-exchanges-to-serve-retail-in-june\">allow retail crypto investments</a>, the exec stressed.</p><p>Although China’s Web3 white paper did not mention crypto, it’s also still important that mainland China is putting out a budget towards progressing with Web3, Siu said.</p><p>He claimed that the news about Hong Kong’s crypto developments was ubiquitous in China, including in a notice on the national TV channel, China Central Television.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/d8634acc-1ba9-46c3-b7d6-1fa70de7d5b4.png\"  /><figcaption style=\"text-align: center;\"><em>Animoca co-founder Yat Siu at EthCC 2023. Source: EthCC.io</em></figcaption></figure><p>“So every Chinese person basically in China got to see this,” Siu noted, adding:</p><blockquote>“This is interesting because it's not just about it's not really just about what's happening in Hong Kong. It's really a message that's coming from, you could say, high above. And Hong Kong wouldn't do anything without the approval of China.”</blockquote><p>In his keynote speech, Siu also argued that Web3 is a powerful tool to “push a new technology paradigm” away from the United States’ tech hegemony. He specifically referred to potentially detrimental security risks of nations’ dependence on tech giants like Google, Apple and Facebook, stating:</p><blockquote>“That's actually another big agenda item, which is why Japan, Korea, China, all these places are pushing Web3 in a really big way because they see that as an opportunity to break away from basically U.S.-dominant technologies.”</blockquote><p>Siu went on to say that challenging the U.S. hegemony is particularly important for places like China, which is focused on de-dollarization.</p><p>“It's another reason why Web3 is being pushed in these places. Less dependency on the dollar. The dollar is, of course, as we know, the global currency of the world,” Siu stated.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/advocates-call-hong-kong-government-stablecoin\"><strong><em>Advocates call for Hong Kong govt stablecoin to compete with Tether and USD Coin</em></strong></a></p><p>As previously reported by Cointelegraph, the People’s Bank of China officially announced another <a href=\"https://cointelegraph.com/news/chinese-regulators-unite-forces-to-crack-down-on-crypto\">ban on virtually all crypto activity</a> in September 2021. It’s worth noting, however, that mainland <a href=\"https://cointelegraph.com/news/china-returns-as-2nd-top-bitcoin-mining-hub-despite-the-crypto-ban\">China remained one of the world’s largest crypto mining hubs</a> even despite the ban.</p><p>With the news about Hong Kong proactively adopting crypto-friendly regulations, many crypto observers expressed hope that China could potentially lift its years-long ban on crypto. </p><p>However, several state-related executives, including CPIC Investment Management CEO Chenggang Zhou, have recently reiterated that <a href=\"https://cointelegraph.com/news/china-s-crypto-stance-unchanged-by-moves-in-hong-kong-says-exec\">China remains and will remain anti-crypto</a> in the near future.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/china-expands-cbdcs-tentacles-malaysia-is-hks-new-crypto-rival-asia-express/\"><strong><em>Asia Express: China expands CBDC’s tentacles, Malaysia is HK’s new crypto rival</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-19T11:20:25.000Z",
    "title": "ASIC cancels FTX Australia’s license amid escalating crypto regulation",
    "url": "https://cryptoslate.com/asic-cancels-ftx-australias-license-amid-escalating-crypto-regulation/",
    "description": "<p>According to a statement released on July 19, the Australian Securities and Investments Commission (ASIC) canceled the Australian Financial Services (AFS) license held by FTX, a subsidiary operating in Australia, on July 14. The license cancelation does not impact FTX Australia&#8217;s arrangements to compensate its retail clients and its continued Australian Financial Complaints Authority membership. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/asic-cancels-ftx-australias-license-amid-escalating-crypto-regulation/\">ASIC cancels FTX Australia&#8217;s license amid escalating crypto regulation</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-19T11:18:09.000Z",
    "title": "Exploring Bitcoin’s hedged and unhedged shorts dynamics",
    "url": "https://cryptoslate.com/insights/exploring-bitcoins-hedged-and-unhedged-shorts-dynamics/",
    "description": "<p>Quick Take Diving into the complex world of Bitcoin (BTC) shorts, both hedged and unhedged, we are presented with an in-depth data visualization by Datamish, an in-depth look into the dynamics of hedged and unhedged Bitcoin (BTC) shorts. Here is a breakdown of what the chart illustrates: The yellow line represents the quantity of BTC [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/exploring-bitcoins-hedged-and-unhedged-shorts-dynamics/\">Exploring Bitcoin&#8217;s hedged and unhedged shorts dynamics</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-19T11:14:18.000Z",
    "title": "Pre-Mining Era ETH Worth $116M Moves Wallets",
    "url": "https://cryptobriefing.com/pre-mining-era-eth-worth-116m-moves-wallets/?utm_source=feed&utm_medium=rss",
    "description": "A wallet holding pre-mined Ethereum worth a massive $116 million that lay dormant for eight years made an unexpected move on July 18. It transferred all its 61,216 Ether to..."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-19T11:19:44.000Z",
    "title": "XRP Futures Open Interest Skyrockets: A New Record High in 2023",
    "url": "https://www.cryptoglobe.com/latest/2023/07/xrp-futures-open-interest-skyrockets-a-new-record-high-in-2023/",
    "description": "Open interest on XRP-tracked futures has reportedly been climbing above $1.13 billion in the past 24 hours. According to an article by CoinDesk published earlier today, this figure surpasses the $1 billion level reached last week, setting a new record high for the year. This surge in open interest comes as XRP tokens themselves have […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-19T11:30:52.000Z",
    "title": "Nigeria Declares Food Emergency After Sixth Consecutive Increase in Inflation Rate",
    "url": "https://news.bitcoin.com/nigeria-declares-food-emergency-after-sixth-consecutive-increase-in-inflation-rate/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/78dhhfnn-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Nigeria Declares Food Emergency After Sixth Consecutive Increase in Inflation Rate\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/78dhhfnn-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/78dhhfnn-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/78dhhfnn-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/78dhhfnn-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/78dhhfnn-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/78dhhfnn-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/78dhhfnn.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Nigerian government declared a food price emergency after the latest data from the National Bureau of Statistics (NBS) showed that the country&#8217;s inflation rate had gone up by 0.38% to 22.79%. The NBS said the June inflation figure does not &#8220;fully capture the impact of the fuel subsidy removal and the unification of the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T11:39:34.000Z",
    "title": "M16 Chief Finds Real Value In Secrets Beyond the Reach of AI Capabilities",
    "url": "https://www.cryptopolitan.com/m16-real-value-in-secrets-ai-capabilities/",
    "description": "Richard Moore, the head of Britain&#8217;s MI6 intelligence agency, has stated that while artificial intelligence (AI) will revolutionize the world of espionage, it will not replace human spies. In a forthcoming speech in Prague, Moore will discuss evolving threats from Russia and Iran, highlighting the crucial role of the &#8220;human factor&#8221; in an era of ... <a title=\"M16 Chief Finds Real Value In Secrets Beyond the Reach of AI Capabilities\" class=\"read-more\" href=\"https://www.cryptopolitan.com/m16-real-value-in-secrets-ai-capabilities/\" aria-label=\"More on M16 Chief Finds Real Value In Secrets Beyond the Reach of AI Capabilities\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T11:35:11.000Z",
    "title": "ISO 20022 Crypto: List of Compliant Coins in 2023",
    "url": "https://www.cryptopolitan.com/iso-20022-compliant-crypto-list/",
    "description": "The ISO 20022 crypto-list is a collection of compliant digital coins and tokens that satisfy the standards of the International Organization for Standardization (ISO) standards 20022. Many cryptocurrencies will be integrated into this new financial system, referred to as ISO 20022-compliant cryptocurrencies and there is much speculation these cryptocurrencies will soar in price once the standard is implemented. Digital ... <a title=\"ISO 20022 Crypto: List of Compliant Coins in 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/iso-20022-compliant-crypto-list/\" aria-label=\"More on ISO 20022 Crypto: List of Compliant Coins in 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T11:16:24.000Z",
    "title": "Dormant wallet springs back to life; moves pre-mined Ethereum stash worth $116m",
    "url": "https://www.cryptopolitan.com/dormant-wallet-springs-back-to-life-moves-pre-mined-ethereum-stash-worth-116m/",
    "description": "A historic crypto transaction occurred a few hours ago when a crypto wallet transferred over 61,000 Ether (ETH), currently worth $116 million, after a long slumber of eight years. This dormant account awoke with a splash, stirring the crypto community with speculation and curiosity. Journey of a dormant giant The crypto wallet, 0x8b, had been ... <a title=\"Dormant wallet springs back to life; moves pre-mined Ethereum stash worth $116m\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dormant-wallet-springs-back-to-life-moves-pre-mined-ethereum-stash-worth-116m/\" aria-label=\"More on Dormant wallet springs back to life; moves pre-mined Ethereum stash worth $116m\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T11:10:38.000Z",
    "title": "Chinese Envoy Advocates True Multilateralism in AI Governance for Global Benefit",
    "url": "https://www.cryptopolitan.com/chinese-advocates-true-multilateralism-in-ai/",
    "description": "Chinese envoy Zhang Jun urged for genuine multilateralism in the development of artificial intelligence (AI) governance during a UN Security Council briefing on Tuesday. Acknowledging the dual nature of AI as a potential boon or bane, Zhang emphasized the importance of regulation, the balance between development and security, and putting ethics first. He called for ... <a title=\"Chinese Envoy Advocates True Multilateralism in AI Governance for Global Benefit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chinese-advocates-true-multilateralism-in-ai/\" aria-label=\"More on Chinese Envoy Advocates True Multilateralism in AI Governance for Global Benefit\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-19T11:24:56.000Z",
    "title": "XRP Price Resumes Rally – Here’s Why It Could Surpass $1 This Time",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-resumes-rally-0-84/",
    "description": "Ripple’s token price is moving higher from $0.6650 against the US Dollar. XRP price might gain bullish momentum if it clears the $0.8065 resistance zone. Ripple’s token price is moving higher toward the $0.8065 resistance against the US dollar. The price is now trading above $0.75 and the 100 simple moving average (4 hours). There is a key bullish trend line forming with support near $0.760 on the 4-hour chart of the XRP/USD pair (data source from Kraken). The pair might continue to rise if it clears the $0.8065 resistance in the near term. Ripple’s Token Price Starts Fresh Rally After a strong rally, Ripple’s XRP saw a downside correction from the $0.9500 resistance against the US Dollar. It dipped below the $0.820 support zone. The price even spiked below the $0.70 support. A low is formed near $0.6655 and the price is now rising, unlike Bitcoin and Ethereum. There was a move above the $0.70 and $0.72 resistance levels. XRP surpassed the 23.6% Fib retracement level of the downward move from the $0.9479 swing high to the $0.6655 low. XRP price is now trading above $0.70 and the 100 simple moving average (4 hours). There is also a key bullish trend line forming with support near $0.760 on the 4-hour chart of the XRP/USD pair. Initial resistance on the upside is near the $0.8065 zone. It is close to the 50% Fib retracement level of the downward move from the $0.9479 swing high to the $0.6655 low. The next major resistance is near the $0.840 level. Source: XRPUSD on TradingView.com A successful break above the $0.84 resistance level might send the price toward the $0.90 resistance. Any more gains might call for a test of the $1 resistance. Fresh Decline in XRP? If ripple fails to clear the $0.8065 resistance zone, it could start another decline. Initial support on the downside is near the $0.75 zone and the trend line. The next major support is near $0.70. If there is a downside break and a close below the $0.70 level, XRP’s price could extend losses. In the stated case, the price could retest the $0.62 support zone. Technical Indicators 4-Hours MACD – The MACD for XRP/USD is now gaining pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $0.75, $0.72, and $0.70. Major Resistance Levels – $0.8065, $0.84, and $0.95."
  }
]