[
  {
    "source": "Decrypt",
    "date": "2023-06-25T17:56:42.000Z",
    "title": "AI Guides Enlisted as One-on-One Meditation Coaches",
    "url": "https://decrypt.co/146108/ai-meditation-guides-teacher-coach-ogimi",
    "description": "Ogimi promises personalized, one-on-one pathways to peace via artificial intelligence instructors."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-25T17:42:35.000Z",
    "title": "US Treasury yields are rising — What does it mean for Bitcoin price? ",
    "url": "https://cointelegraph.com/news/us-treasury-yields-are-rising-what-does-it-mean-for-bitcoin-price",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/ed5cdd25-40bd-4b8f-aa47-0e3a2ae0cbe4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The 5-year U.S. Treasury yield reached its highest level in 3 months, but the typical inverse correlation-based price action with Bitcoin might not work this time.</p>\n                    <p><p>United States Government bonds, or Treasurys, have a tremendous influence across all tradeable markets, including Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>). In that sense, risk calculation in finance is relative, so every loan, mortgage and even cryptocurrency derivatives depend on the cost of capital attributed to U.S. dollars.</p><p>Assuming the worst-case scenario of the <a href=\"https://cointelegraph.com/learn/what-happens-when-a-country-defaults\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/what-happens-when-a-country-defaults/amp\">U.S. government eventually defaulting on its own debt</a>, what happens to the families, businesses and countries holding those bonds? The lack of interest debt payments would likely cause a global shortage of U.S. dollars, triggering a cascading effect.</p><p>But, even if that scenario comes to fruition, history shows us that cryptocurrencies may work as a hedge during periods of uncertainty. For instance, Bitcoin vastly outperformed traditional wealth preservation assets <a href=\"https://cointelegraph.com/news/grayscale-bitcoin-gained-47-in-us-china-trade-war-drawdown\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/grayscale-bitcoin-gained-47-in-us-china-trade-war-drawdown/amp\">during the U.S.-China trade war in May 2021</a>. Bitcoin gained 47% between May 5 and May 31, 2021, while the Nasdaq Composite shed 8.7%.</p><p>As the general public owns over $29 trillion in the U.S. Treasury, they are deemed the lowest risk in existence. Still, the price for each of those government bonds, or the yield traded, will vary depending on the contract maturity. Assuming there’s no counterparty risk for this asset class, the single most important pricing factor is the inflation expectation. </p><p>Let’s explore whether Bitcoin’s and Ether’s price will be impacted by the growing demand for U.S. Treasurys.</p><h2>Higher demand for government bonds leads to lower yields</h2><p>If one believes that inflation will not be restrained anytime soon, this investor is likely to seek a higher yield when trading the Treasury. On the other hand, if the U.S. government is actively devaluing its currency or there's an expectation for additional inflation, investors will tend to seek refuge in US Treasurys, causing a lower yield.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/2547a2d3-81b7-44f5-b0cf-c812a0c0efa8.png\"><figcaption style=\"text-align: center;\"><em>U.S. 5-year government bond yield. Source: TradingView</em></figcaption></figure><p>Notice how the 5-year Treasury yield reached 4.05% on June 22, the highest level in more than three months. This movement happened while the U.S. Consumer Price Index (CPI) for May came in at 4.0% on a year-over-year basis, the lowest growth since March 2021.</p><p>A 4.05% yield indicates that investors are not expecting inflation to drop below the central bank's 2% target anytime soon, but it also shows confidence that the 9.1% peak CPI data from June 2022 is behind us. However, that’s not how Treasury pricing works because investors are willing to forego rewards in exchange for the security of owning the lowest-risk asset.</p><p>U.S. Treasury yields are a great tool for comparing other countries and corporate debt, but not in absolute terms. These government bonds will reflect inflation expectations, but they may be severely constrained if a global recession becomes more likely.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/f8a4c972-8de1-409f-9a47-517e0a4d13bd.png\"><figcaption style=\"text-align: center;\"><em>U.S. 5-year government bond yield vs. Bitcoin/USD (orange). Source: TradingView</em></figcaption></figure><p>The typical inverse correlation between Bitcoin and the U.S. Treasury yield has been invalidated in the past 10 days, most likely because investors are desperately buying government bonds for their safety regardless of the yield being lower than inflation expectations.</p><p>The S&P 500 index, which measures the U.S. stock market, hit 4,430 on June 16, just 7.6% below its all-time high, which also explains the higher yields. While investors typically seek scarce and inflation protected assets ahead of turbulent times, their appetite for excessive equity valuations is limited.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-price-data-suggest-bulls-with-succeed-in-holding-30k-as-support-this-time\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-price-data-suggest-bulls-with-succeed-in-holding-30k-as-support-this-time/amp\"><strong><em>Bitcoin price data suggests bulls will succeed in holding $30K as support this time</em></strong></a></p><h2>Recession risks could have distorted the yield data</h2><p>The only certain thing at the moment is that investors’ expectations for a recession are becoming more evident. Aside from the Treasury's yield, the U.S. Conference Board's leading indicators declined for 14 consecutive months, as described by Charlie Bilello:</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The Conference Board's Leading Economic Index declined in May for the 14th month in a row.<br><br>\"We project that the US economy will contract over the Q3 2023 to Q1 2024 period. The recession likely will be due to continued tightness in monetary policy and lower government spending.”… <a href=\"https://t.co/wQfy8a3DVq\">pic.twitter.com/wQfy8a3DVq</a></p>— Charlie Bilello (@charliebilello) <a href=\"https://twitter.com/charliebilello/status/1672308010738171904?ref_src=twsrc%5Etfw\">June 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Consequently, those betting that Bitcoin’s recent decoupling from the U.S. Treasury's yield inverse correlation will quickly revert might come out disappointed. Data confirms that government bond yields are higher than normal due to increased expectations of a recession and economic crisis ahead.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-25T17:42:01.000Z",
    "title": "Japan’s token issuers are now exempt from corporate tax on unrealized gains",
    "url": "https://cryptoslate.com/japans-token-issuers-are-now-exempt-from-corporate-tax-on-unrealized-gains/",
    "description": "<p>Japan&#8217;s National Tax Agency revised the corporate tax rules for cryptocurrency issuers earlier this week. The revised rules exempt crypto token issuers from paying corporate tax on unrealized gains for their holdings. The exemptions are applicable under two conditions, according to a local news report. Firstly, the tokens must be issued by the firm itself [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/japans-token-issuers-are-now-exempt-from-corporate-tax-on-unrealized-gains/\">Japan&#8217;s token issuers are now exempt from corporate tax on unrealized gains</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-25T18:07:14.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 While the crypto market navigated the fallout from the&#160;collapse&#160;of FTX in late 2022, Ava Labs says it dodged the bullet. Ava Labs founder and CEO Emin Gün Sirer assure its stakeholders that FTX impacts very little the companies and projects operating in the Avalanche ecosystem. The company had an account on ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-25T18:02:15.000Z",
    "title": "American film star faces $50,000 crypto scam charges",
    "url": "https://crypto.news/american-film-star-faces-50000-crypto-scam-charges/",
    "description": "Zachery Ty Bryan, who played Brad Taylor on \"Home Improvement,\" faces accusations of involvement in a $50,000 cryptocurrency scam"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-25T17:50:11.000Z",
    "title": "Unconfirmed reports say Ripple considering buying back 10 billion XRP, skeptics doubtful",
    "url": "https://crypto.news/unconfirmed-reports-say-ripple-considering-buying-back-10-billion-xrp-skeptics-doubtful/",
    "description": "Rumors are circulating that Ripple, a San Francisco-based fintech company, may be considering a buyback of 10 billion XRP"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-25T17:50:29.000Z",
    "title": "Trillion-Dollar Bank MUFG to Issue Stablecoins on DLT Platform – Is It Based on Stellar or Litecoin for Super Fast Transactions?",
    "url": "https://www.crypto-news-flash.com/trillion-dollar-bank-mufg-to-issue-stablecoins-on-dlt-platform-is-it-based-on-stellar-or-litecoin-for-super-fast-transactions/?utm_source=rss&utm_medium=rss&utm_campaign=trillion-dollar-bank-mufg-to-issue-stablecoins-on-dlt-platform-is-it-based-on-stellar-or-litecoin-for-super-fast-transactions",
    "description": "Japan&#8217;s biggest bank announces its intention to issue fiat-backed stablecoin following recent crypto regulations by local authorities.  Japan is seeking to petition the local regulators to soften restrictions on marginal trading.  The biggest bank in Japan, MUFG has reportedly commenced negotiations to issue its stablecoin backed by the US Dollar and other global fiat currencies. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-25T17:48:03.000Z",
    "title": "Shiba Inu Token Burn Skyrockets Over 6,000% as SHIB Price Continues Uptrend",
    "url": "https://www.crypto-news-flash.com/shiba-inu-token-burn-skyrockets-over-6000-as-shib-price-continues-uptrend/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-token-burn-skyrockets-over-6000-as-shib-price-continues-uptrend",
    "description": "The Shiba Inu token burn witnesses a 6,936% surge within 24 hours, sparking a significant uptick in SHIB prices. The Shiba Inu community, the SHIB Army, demonstrates the power of collective effort as their continued token-burning activities lead to increased SHIB value. A sharp increase in the burn rate of Shiba Inu tokens has given [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-25T17:47:31.000Z",
    "title": "Finally: True Transparency With Spectra (SPCT) – How It’s Positioned to Rival BNB (BNB) And ApeCoin (APE)",
    "url": "https://www.crypto-news-flash.com/finally-true-transparency-with-spectra-spct-how-its-positioned-to-rival-bnb-bnb-and-apecoin-ape/?utm_source=rss&utm_medium=rss&utm_campaign=finally-true-transparency-with-spectra-spct-how-its-positioned-to-rival-bnb-bnb-and-apecoin-ape",
    "description": "BNB (BNB) is still going strong on its bearish trend as the SEC lawsuits loom over it. ApeCoin (APE) is battling with potential investors looking everywhere but ApeCoin (APE). On the other hand, Spectra (SPCT) is stealing the show with its transparent decentralized investment opportunities. Crypto Whales Hit BNB (BNB) Before SEC Decision BNB (BNB) [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-25T17:41:16.000Z",
    "title": "Cardano Surges in Thriving Bull Run, But How Long Will the Momentum Last?",
    "url": "https://www.crypto-news-flash.com/cardano-surges-in-thriving-bull-run-but-how-long-will-the-momentum-last/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-surges-in-thriving-bull-run-but-how-long-will-the-momentum-last",
    "description": "Cardano&#8217;s value has risen by over 20% since the start of this week, signaling a positive shift in market sentiment. The surge in Cardano&#8217;s price may be more attributed to broader market trends driven by growing institutional interest in Bitcoin rather than token-specific developments. In the midst of a resurgent cryptocurrency market this week, numerous [...]"
  }
]