[
  {
    "source": "Cointelegraph",
    "date": "2023-06-04T06:27:39.000Z",
    "title": "FTX debtors object Genesis' 'critical' claim estimate of '$0.00'",
    "url": "https://cointelegraph.com/news/ftx-objects-genesis-critical-claim-estimate-0-00",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/ccb8a048-1414-4745-bd7a-5863fd845f00.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The FTX debtors alleged that the claim was filed \"without any advance notice,\" and they were not invited to participate in the mediation.</p>\n                    <p><p>Just a month after bankrupt cryptocurrency exchange FTX was seeking $4 billion from the also bankrupt crypto lender Genesis, it is now contesting a claim that it is entitled to nothing.</p><p>According to a June 2 court <a href=\"https://assets.bwbx.io/documents/users/iqjWHBFdfxIU/reIlzLM9ae4Q/v0\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> in a New York Bankruptcy Court, the FTX debtors have raised an objection to Genesis’ estimation that they are entitled to claims totalling ‘$0.00’ – which was filed by Genesis in an estimation procedures motion on June 1.</p><p>FTX debtors alleged they were not “invited to participate” in the mediation and the motion was filed “without any advance notice to the FTX debtors.”</p><p>FTX reiterated that the zero-dollar claim estimation, as outlined in the motion, was deemed “critical” by the Genesis debtors to prevent any delays, and promptly move forward with the “confirmation of a Chapter 11 plan.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/09e30669-96a4-4e4e-ac64-114d1bb91ec0.png\"  /><figcaption style=\"text-align: center;\"><em>June 2 court filing in the United States Bankruptcy Court for the Southern District of New York. </em></figcaption></figure><p>FTX debtors refuted a statement made by Genesis debtors that they worked with “all parties” of interest to create a plan structure. It stated:</p><blockquote>“The mediation is a waste of estate resources without the inclusion of the FTX Debtors and should not continue without the FTX Debtors’ involvement.”</blockquote><p>On May 3, lawyers for FTX were seeking <a href=\"https://cointelegraph.com/news/ftx-seeks-to-claw-back-4b-from-genesis-in-a-battle-of-the-bankrupt\">almost $4 billion from</a> Genesis in a New York Bankruptcy Court, under bankruptcy laws which allow it to recoup “avoidable transfers” that occur in a 90-day period before a company declares bankruptcy.</p><p>The FTX Debtors have filed a motion for relief from the stay – requesting that the court lift the automatic stay, pausing legal proceedings against Genesis, when it filed for bankruptcy.</p><p>It was requested that the motion is set to be heart by the court on June 15.</p><p><strong><em>Related: </em></strong><strong><em><a href=\"https://cointelegraph.com/news/sbf-wants-to-subpoena-documents-from-old-ftx-alameda-law-firm-to-use-in-his-defense\">SBF wants to subpoena documents from old FTX/Alameda law firm to use in his defense</a></em></strong><strong><em></em></strong></p><p>The most recent update regarding the reimbursement of creditors, came from Digital Currency Group (DCG), the parent company of crypto firm Genesis Capital.</p><p>It had reported no solution to its “outstanding intercompany obligations” that could help reimburse creditors.</p><p>During this period, DCG was engaged in a mediation period with Genesis in response to demands made by creditors.</p><p>Back in February, the firm had put forward a settlement plan, anticipating that Genesis creditors would receive an 80% recovery of funds after the company filed for Chapter 11 bankruptcy.</p><p><strong><em>Magazine:</em></strong><strong><em> <a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\">Can you trust crypto exchanges after the collapse of FTX?</a></em></strong><strong><em></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-04T06:17:59.000Z",
    "title": "Hooked Protocol price analysis: Bulls make their presence felt as the price jumps to $1.469",
    "url": "https://www.cryptopolitan.com/hooked-protocol-price-analysis-2023-06-04/",
    "description": "The recent Hooked Protocol price analysis indicates a bullish trend for the day, with the price experiencing a notable recovery. Bulls have made a strong comeback, raising the chances of further increase in cryptocurrency value. Although the price had dropped to a crucial level by May 31, 2023, today&#8217;s market trend has shifted in favor ... <a title=\"Hooked Protocol price analysis: Bulls make their presence felt as the price jumps to $1.469\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hooked-protocol-price-analysis-2023-06-04/\" aria-label=\"More on Hooked Protocol price analysis: Bulls make their presence felt as the price jumps to $1.469\">Read more</a>"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-04T06:27:35.000Z",
    "title": "Is Peter Schiff Now a Bitcoiner?",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/is-peter-schiff-now-a-bitcoiner/",
    "description": "<p>Peter Schiff has a reputation for bashing cryptocurrencies, especially Bitcoin. However, a recent report revealed that Schiff has delved into the NFT market, relying on the Bitcoin blockchain. This indeed comes as a surprise to many. What is Happening with Peter Schiff? Schiff recently wrote on Twitter that &#8220;I’m pleased to announce an art project [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/is-peter-schiff-now-a-bitcoiner/\">Is Peter Schiff Now a Bitcoiner?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]