[
  {
    "source": "CoinDesk",
    "date": "2023-06-06T12:01:00.000Z",
    "title": "First Mover Americas: Crypto Markets Stay Down Following SEC Suing Binance",
    "url": "https://www.coindesk.com/markets/2023/06/06/first-mover-americas-crypto-markets-stay-down-following-sec-suing-binance/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for June 6, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-06T12:00:00.000Z",
    "title": "Turbos Finance Introduces Smart Routing for Stablecoins on Sui",
    "url": "https://www.coindesk.com/tech/2023/06/06/turbos-finance-introduces-smart-routing-for-stablecoins-on-sui/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The new feature aims to reduce friction for users coming from other ecosystems to Sui and improve liquidity."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-06T11:55:19.000Z",
    "title": "Atomic Wallet Hacker Swapping Stolen Funds for Bitcoin: Elliptic",
    "url": "https://decrypt.co/143559/atomic-wallet-hacker-swapping-stolen-funds-bitcoin-elliptic",
    "description": "Elliptic Connect analysts have also linked the stolen crypto from the Atomic Wallet hack to the North Korean hacking group Lazarus."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-06T11:51:46.000Z",
    "title": "SEC’s Binance lawsuit triggers market-wide selloff: CryptoSlate wMarket Update",
    "url": "https://cryptoslate.com/secs-binance-lawsuit-triggers-market-wide-selloff-cryptoslate-wmarket-update/",
    "description": "<p>The cryptocurrency market saw net outflows of over $40 billion over the last 24 hours and currently stands at $1.09 trillion — down 3.53% from $1.13 trillion. During the reporting period, the market caps of Bitcoin (BTC) and Ethereum (ETH) fell 3.85% and 2.65% to $498.87 billion and $218.53 billion, respectively. Over the last 24 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/secs-binance-lawsuit-triggers-market-wide-selloff-cryptoslate-wmarket-update/\">SEC&#8217;s Binance lawsuit triggers market-wide selloff: CryptoSlate wMarket Update</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-06T11:45:00.000Z",
    "title": "BTC Crashes Below $26000, Crypto Daily TV 6/6/2023",
    "url": "https://cryptodaily.co.uk/2023/06/btc-crashes-below-26000-crypto-daily-tv-6-6-2023",
    "description": "In Todays Headline TV CryptoDaily News:\n<p></p>\n<p>Ethereum reserves at multi-year lows</p>\n<p>Ethereum token reserves on exchange wallets have declined to their lowest level since 2018. As of June 5, ETH reserves sit at 17.2 million Ether, a multi-year low.&nbsp;</p>\n<p>Atomic Wallet users hacked for $35M</p>\n<p>The crypto industry&rsquo;s latest causality occurred over the weekend as nearly $35 million worth of various tokens were stolen from Atomic Wallet, a centralized storage and wallet service. These tokens included bitcoin, ether, tether, dogecoin, litecoin, bnb coin and polygon.</p>\n<p>Bitcoin dropped below $26,000 </p>\n<p>Cryptocurrency prices dropped after the U.S. Securities and Exchange Commission charged Binance, the largest crypto exchange in the world, with violating securities laws. Bitcoin fell more than 6% to its lowest level since March.</p>\nBTC/USD dove 5.5% in the last session.\n<p>The Bitcoin-Dollar pair plummeted 5.5% in the last session. The RSI's negative signal is in line with the overall technical analysis. Support is at 26695.3333 and Resistance is at 27661.3333.</p>\n<p>The RSI is currently in negative territory.</p>\n<p></p>\nETH/USD plummeted 4.4% in the last session.\n<p>The Ethereum-Dollar pair dove 4.4% in the last session. According to the Stochastic-RSI, we are in an oversold market. Support is at 1866.6167 and Resistance is at 1925.8567.</p>\n<p>The Stochastic-RSI points to an oversold market.</p>\n<p></p>\nXRP/USD dove 6.1% in the last session.\n<p>The Ripple-Dollar pair dropped 6.1% in the last session after rising as much as 1.3% during the session. The MACD is giving a positive signal. Support is at 0.5017 and Resistance is at 0.5629.</p>\n<p>The MACD is currently in positive territory.</p>\n<p></p>\nLTC/USD plummeted 7.1% in the last session.\n<p>The Litecoin-Dollar pair dove 7.1% in the last session. The Williams indicator is giving a negative signal. Support is at 92.571 and Resistance is at 97.311.</p>\n<p>The Williams indicator is giving a negative signal.</p>\n<p></p>\nDaily Economic Calendar:\n<p>US API Weekly Crude Oil Stock</p>\n<p>The API&rsquo;s Weekly Statistical Bulletin reports overall U.S. and regional data relating to refinery operations and the production of the four major petroleum products. The US API Weekly Crude Oil Stock will be released at 20:30 GMT, the UK's 30-y Bond Auction at 09:30 GMT, Australia's RBA Interest Rate Decision at 04:30 GMT.</p>\n<p>UK 30-y Bond Auction</p>\n<p>The auction sets the average yield on the bonds auctioned off. Yields are set by bond market investors, and therefore they can be used to estimate investors' outlook on future interest rates.</p>\n<p>AU RBA Interest Rate Decision</p>\n<p>The RBA Interest Rate Decision is announced by the Reserve Bank of Australia. The interest rates are a key mechanism through which the central bank influences inflation.</p>\n<p>AU RBA Rate Statement</p>\n<p>Decisions regarding the interest rates are made by the Reserve Bank Board and are explained in a media release that announces the decision after each meeting. Australia's RBA Rate Statement will be released at 04:30 GMT, Japan's JP Foreign Reserves at 23:50 GMT, the US Redbook Index at 12:55 GMT.</p>\n<p>JP JP Foreign Reserves</p>\n<p>The Foreign Reserves are the total of a country's gold holdings and convertible foreign currencies held by its central bank. </p>\n<p>US Redbook Index</p>\n<p>The Johnson Redbook Index measures the year-over-year same-store sales growth from a sample of large general merchandise retailers.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T12:05:08.000Z",
    "title": "Liquity price analysis: LQTY  price sinks to $1.06 after a  strong bearish day",
    "url": "https://www.cryptopolitan.com/liquity-price-analysis-2023-06-06/",
    "description": "The Liquity price analysis shows a drop in price has been observed today,&#160; with LQTY sinking to $1.06 after a strong bearish day. The price has been consolidating for the past few days, and was unable to break out of resistance at $1.21. The price is currently stuck between the support at $1.03 and resistance ... <a title=\"Liquity price analysis: LQTY  price sinks to $1.06 after a  strong bearish day\" class=\"read-more\" href=\"https://www.cryptopolitan.com/liquity-price-analysis-2023-06-06/\" aria-label=\"More on Liquity price analysis: LQTY  price sinks to $1.06 after a  strong bearish day\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-06T11:51:33.000Z",
    "title": "Bybit’s AED 1M AUS scholarship boosts UAE influence",
    "url": "https://www.cryptopolitan.com/bybit-1m-aus-scholarship-hikes-uae-influence/",
    "description": "Bybit, one of the global leaders in the crypto exchange space, has inked a significant partnership with the American University of Sharjah (AUS), signaling a notable commitment to advancing crypto adoption in the UAE. The signing of a Memorandum of Understanding in Sharjah marks the birth of this landmark collaboration. Bybit bridging academia and Fintech ... <a title=\"Bybit&#8217;s AED 1M AUS scholarship boosts UAE influence\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bybit-1m-aus-scholarship-hikes-uae-influence/\" aria-label=\"More on Bybit&#8217;s AED 1M AUS scholarship boosts UAE influence\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-06T12:08:43.000Z",
    "title": "Kava defies SEC-induced market slump with a notable surge",
    "url": "https://crypto.news/kava-defies-sec-induced-market-slump-with-a-notable-surge/",
    "description": "Kava (KAVA), a decentralized blockchain platform known for its crypto lending and borrowing services, has seen its native token KAVA rise by 9.48% in the last 24 hours.  This noteworthy performance comes amidst a general downturn in the cryptocurrency market,&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-06T12:01:50.000Z",
    "title": "Crypto liquidations peak as SEC’s Binance lawsuit shakes crypto markets",
    "url": "https://crypto.news/crypto-liquidations-peak-as-secs-binance-lawsuit-shakes-crypto-markets/",
    "description": "Recent enforcement action from the SEC against Binance has sent waves through the cryptocurrency ecosystem, inducing a large volume of liquidations and creating an atmosphere of uncertainty.  The SEC&#8217;s decision to file a lawsuit against Binance and its CEO, Changpeng&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-06T11:53:05.000Z",
    "title": "Dogecoin Plunges 7% As Whales Make Large Moves",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-plunges-7-as-whales-make-large-moves/",
    "description": "Dogecoin has plunged more than 7% during the past day as data shows that whales have made some large movements. Dogecoin Whales Move Large Amounts On The Chain According to data from the cryptocurrency transaction tracker service Whale Alert, five large transactions have been spotted on the DOGE blockchain during the last 24 hours. Three of these transfers all saw the movement of the same amount of the meme coin: 600,000,018 DOGE worth $42,946,921 at the time the transactions took place. The other two transactions were smaller and saw the travel of 337,520,424 DOGE ($24,159,104) and 399,999,992 DOGE ($28,631,279), respectively, across the network. As all of these transfers saw the movement of such a large amount of Dogecoin, it&#8217;s likely that whale entities were behind them. Whales are humongous holders who carry significant amounts in their wallets, which makes them powerful existences on the network. Surprisingly, all of these transfers were executed at the same time. Such large whale transactions aren&#8217;t exactly an everyday occurrence, so five of them happening simultaneously is interesting, to say the least. Based on this and the fact that three of the transactions saw the movement of the exact same number of coins, the natural conclusion would emerge to be that the same entity was behind these transfers. Related Reading: Bitcoin Current Position Is Sensitive, Glassnode Explains Why Indeed, as the blockchain data would confirm, all of these transfers have involved not only the same sending addresses but also the same destinations. This would imply that the investor or group of investors behind these transactions may have made all of these moves with the same goal in mind. Here are some additional details regarding one of these Dogecoin transactions, which may provide hints about the reason behind why the transfers may have been done: Looks like this transfer required a fee of just 2 DOGE to go through &#124; Source: Whale Alert Both the sending and the receiving addresses here seem to be unknown wallets, meaning that they are unattached to any known centralized platform (like an exchange). Generally, such wallets are investors&#8217; personal wallets, which they may use for keeping their coins in for extended periods. Related Reading: Ethereum Top 10 Whales Now Hold 31.8M ETH, A New All-Time High It&#8217;s always hard to say what the purpose behind a transaction between two unknown wallets may have been, as it could be anything from a simple change of addresses, to a sale made through over-the-counter (OTC) deals. Usually, investors deposit to exchanges when their aim is selling, so it&#8217;s possible that the transactions in the past day may not have been because of the whale planning to sell. However, as mentioned before, them being done for selling through OTC deals is still a possibility. In the last 24 hours, since these transfers have been made, Dogecoin has observed a sharp plunge of 7%. The crash isn&#8217;t limited to the meme coin, as in fact most of the market has seen bearish price action during the past day. The impulse of this plunge seems to have been the US SEC suing the cryptocurrency exchange Binance. Given these circumstances, it&#8217;s possible that the Dogecoin whale in question may have participated in the selloff after all. DOGE Price At the time of writing, Dogecoin is trading around $0.0667, down 8% in the past week. The value of the memecoin seems to have plummeted hard today &#124; Source: DOGEUSD on TradingView Featured image from Kanchanara on Unsplash.com, chart from TradingView.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-06T11:40:19.000Z",
    "title": "The SEC Attacks Binance, Examining Recent Actions and Potential Motives",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/the-sec-attacks-binance-examining-recent-actions-and-potential-motives/",
    "description": "<p>While leaving Bitcoin relatively untouched, The SEC aimed at preventing the industry from becoming the last refuge for the world population, dealing a significant blow to the current financial system. In this article, we&#8217;ll try to tell how the SEC is acting to put obstacles to the most important companies of the crypto industry in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/the-sec-attacks-binance-examining-recent-actions-and-potential-motives/\">The SEC Attacks Binance, Examining Recent Actions and Potential Motives</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-06T11:58:09.000Z",
    "title": "Binance’s Deposit Volume Surpasses Withdrawal Volume: Report Says",
    "url": "https://coinedition.com/binances-deposit-volume-surpasses-withdrawal-volume-report-says/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Binances_Deposit_Volume_Surpasses_Withdrawal_Volume_Report_Says-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Binances_Deposit_Volume_Surpasses_Withdrawal_Volume_Report_Says-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Binances_Deposit_Volume_Surpasses_Withdrawal_Volume_Report_Says-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Binances_Deposit_Volume_Surpasses_Withdrawal_Volume_Report_Says-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Binances_Deposit_Volume_Surpasses_Withdrawal_Volume_Report_Says-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Binances_Deposit_Volume_Surpasses_Withdrawal_Volume_Report_Says-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Binances_Deposit_Volume_Surpasses_Withdrawal_Volume_Report_Says.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>According to the findings of the blockchain research platform Nansen, the NetFlow to the leading crypto exchange Binance over the last hour has exhibited a positive turn with more deposits than withdrawals. Despite the ongoing legal battle between Binance and the Securities and Exchange Commission (SEC), the exchange had a massive inflow volume surpassing the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binances-deposit-volume-surpasses-withdrawal-volume-report-says/\">Binance’s Deposit Volume Surpasses Withdrawal Volume: Report Says</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-06T11:45:32.000Z",
    "title": "Leading Institutions Now Looking at Discounted Crypto Markets, According to Franklin Templeton Strategist",
    "url": "https://dailyhodl.com/2023/06/06/leading-institutions-now-looking-at-discounted-crypto-markets-according-to-franklin-templeton-strategist/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Discounted-Crypto-Markets.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Discounted-Crypto-Markets.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Discounted-Crypto-Markets.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Discounted-Crypto-Markets.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Discounted-Crypto-Markets.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Discounted-Crypto-Markets.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Discounted-Crypto-Markets.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An executive at the $1.5 trillion asset management giant Franklin Templeton says that large institutions are becoming increasingly interested in digital assets. In a new interview with Scott Melker, Franklin Templeton senior vice president Sandy Kaul says that financial institutions are now looking at crypto following the industry&#8217;s deep correction over the past year. According [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/06/leading-institutions-now-looking-at-discounted-crypto-markets-according-to-franklin-templeton-strategist/\">Leading Institutions Now Looking at Discounted Crypto Markets, According to Franklin Templeton Strategist</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]