[
  {
    "source": "Cointelegraph",
    "date": "2023-12-27T03:00:00.000Z",
    "title": " Grayscale refiles Bitcoin ETF application as Barry Silbert departs ",
    "url": "https://cointelegraph.com/news/grayscale-bitcoin-etf-application-barry-silbert-departure",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNGM2NzY2M2UtMjBhMi00NjkzLWE3M2EtMmE0ZmVlMjU4YmM4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Grayscale has “finally surrendered” to cash creations in its amended filing to convert GBTC into a spot Bitcoin ETF. </p>\n                    <p><p>Crypto asset manager Grayscale lodged an amended S-3 filing with the United States securities regulator on the same day Barry Silbert — the CEO of its parent company Digital Currency Group — <a href=\"https://cointelegraph.com/news/grayscale-barry-silbert-resigns-board\">announced his resignation from Grayscale’s board of directors</a>. </p><p>Some crypto market commentators speculate that Silbert’s departure could significantly increase the odds that Grayscale will successfully convert its Grayscale Bitcoin Trust (GBTC) into a spot Bitcoin ETF, currently awaiting a decision from the Securities and Exchange Commission. </p><p>“Despite all other spot commodity ETFs operating with in-kind models, this must be done in a novel way via cash and who knows if that will work,” wrote Johnsson. </p><p><a href=\"https://cointelegraph.com/news/grayscale-bitcoin-etf-application-barry-silbert-departure\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-27T02:43:08.000Z",
    "title": " Thunder Terminal claims funds safe after $192K attack, hacker says otherwise ",
    "url": "https://cointelegraph.com/news/thunder-terminal-hack-exploit-wallet-compromise-hacker-demands-ransom",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvZjIwNGU3NTItNmE1Yi00NDNlLWExNWItN2VlMzJlMGE4ZTlkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The decentralized trading platform confirmed a 3rd party compromise has led to funds being drained from 114 wallets but claims it has already fixed the issue. The hacker has a different take.</p>\n                    <p><p>Decentralized trading platform Thunder Terminal says user funds are now safe after thwarting a $192,000 exploit that compromised 114 wallets on its platform. The hacker, however, says it’s \"all lies\" and is demanding an additional ransom for user data. </p><p>In a Dec. 27 post to X (formerly Twitter), Thunder stated the exploit was the result of a third-party service being compromised. It assured users that funds were safe, no private keys were compromised, and that the attack had been halted within nine minutes. </p><p>Thunder claimed that only 114 out of 14,000 wallets had been compromised and assured users that refunds would be handled shortly. </p><p><a href=\"https://cointelegraph.com/news/thunder-terminal-hack-exploit-wallet-compromise-hacker-demands-ransom\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-27T02:52:29.000Z",
    "title": "This Solana (SOL) Rival Is Ready for a Massive 2024, eyes 100x gains",
    "url": "https://cryptodaily.co.uk/2023/12/this-solana-sol-rival-is-ready-for-a-massive-2024-eyes-100x-gains",
    "description": "The decentralized finance (DeFi) space is full of new projects that emerge with the promise of being the next big thing."
  },
  {
    "source": "NullTX",
    "date": "2023-12-27T03:03:20.000Z",
    "title": "Didn’t Invest in Solana (SOL)? Explore This Rising Cryptocurrency as an Alternative",
    "url": "https://nulltx.com/didnt-invest-in-solana-sol-explore-this-rising-cryptocurrency-as-an-alternative/",
    "description": "TLDR Market analysts foresee Solana (SOL) surpassing $130 by the end of 2024. Investors are increasingly moving to a new meme coin, considering its impressive presale performance. Experts predict the early investors of the emerging coin will receive 150% profit in 2024. Solana (SOL) recently flipped XRP to become the [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-27T02:49:10.000Z",
    "title": "A Rising Star in Crypto: This Newcomer Gains Edge Over dYdX and TRON",
    "url": "https://nulltx.com/a-rising-star-in-crypto-this-newcomer-gains-edge-over-dydx-and-tron/",
    "description": "TLDR: NuggetRush (NUGX) is making waves in blockchain gaming by combining play-to-earn (P2E) incentives and crypto. As a new addition to ICOs, it uniquely supports impact gaming, specifically aiding artisanal miners in developing nations. On December 1, 2023, dYdX (DYDX) unlocked 150 million tokens, valued at $485 million, triggering a [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-27T03:00:14.000Z",
    "title": "Kyber Network Takes Swift Action After $48 Million Breach, Implements Critical Decisions",
    "url": "https://www.newsbtc.com/news/kyber-network-takes-swift-action-after-48-million-breach-implements-critical-decisions/",
    "description": "Decentralized finance (DeFi) platform Kyber Network has taken significant steps to address the aftermath of a massive security breach in November, with CEO and co-founder Victor Tran at the helm. Despite the challenges posed by the &#8220;Elastic exploit&#8221;, KyberSwap&#8217;s core business, including the aggregator and limit order functions, remains fully functional, according to the latest statement. Kyber Network Response To Elastic Exploit As stated by Tran, Kyber Network is preparing to launch the Zap API, this is expected to enable decentralized applications (dApps), wallets, and other projects to serve as convenient gateways for users to access DeFi liquidity protocols.  Related Reading: Billionaire Tim Draper Predicts When The Bitcoin Price Will Reach $250,000 Additionally, Kyber Network has made operational changes, including temporary pauses in liquidity protocol initiatives and the KyberAI project, to &#8220;ensure a sustainable future&#8221;. Tran further stated: Regrettably, we have also reduced our workforce by 50%. The past few days have been among the most challenging in my journey as an entrepreneur. The decision to part ways with so many of our team members was heart-wrenching. Each individual is not only highly skilled but also deeply committed to advancing DeFi and bringing tangible value to end-users.  Tran also stated that Kyber Network&#8217;s response to the Elastic exploit includes the implementation of the KyberSwap Elastic Exploit Treasury Grant Program, aimed at covering up to 100% of users&#8217; losses.  To provide clarity on the situation, Kyber Network has categorized the affected assets and outlined the consequences for each category.  Treasury Grants For Victims  According to the network’s blog post, Category 1 comprises affected assets taken from affected pools by the primary exploit, which commenced on November 22, 2023.  This category includes liquidity positions and liquidity provider (LP) fees, with a market value of $48,883,930.66. Notably, the network has stated that these assets have yet to be recovered. Category 2 consists of affected assets taken from affected pools by subsequent activity, referred to as Category 2 Mimicking Bots (MBA).  These assets, totaling US$172,148.52, were obtained by two mimicking bots that replicated the actions of the primary exploit. Similar to Category 1, these assets have yet to be recovered. Category 3 includes affected assets that were removed from affected pools by subsequent activity, collectively referred to as Category 3 Mimicking Bots (MBA), along with assets referred to as Category 3 swapped affected assets.  While a portion of the affected assets were partially recovered, a portion of the assets were swapped into Category 3 Swapped affected assets. The market value of the Category 3 Affected Assets is $6,405,483.43, based on the last block before the Category 3 MBA. Assets falling under Category 4 are currently locked in affected pools due to an “incorrect pool state” resulting from the primary exploit and MBA. The total value of these assets is $24,478.93.  This amount comprises different segments: $9,390.51 attributable to the primary exploit, $15,036.04 attributable to the Category 2 MBA, and $52.38 attributable to the Category 3 MBA. Related Reading: Bitcoin Millionaires Rise By 246% In 2023, Here’s How Many There Are Lastly, Category 5 represents affected assets that were previously locked in affected pools due to an incorrect pool state resulting from the primary exploit. However, these assets have been successfully recovered from the liquidity pools, with a total value of $706,162.85. At present, the native token of Kyber, KNC, is trading at $0.732, indicating a marginal decline of 0.3% within the past 24 hours. Nevertheless, over the last fourteen days, the token has demonstrated notable growth, with gains surpassing 7%. Featured image from Shutterstock, chart from TradingView.com"
  }
]