[
  {
    "source": "Decrypt",
    "date": "2023-07-12T10:22:43.000Z",
    "title": "Grayscale Bitcoin Shares Discount Hits Lowest Since Last Summer",
    "url": "https://decrypt.co/148260/grayscale-bitcoin-shares-discount-hits-lowest-since-last-summer",
    "description": "The GBTC discount narrowed amid renewed hopes of an ETF approval in the U.S. or the beginning of redemptions for Bitcoin. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T10:18:49.000Z",
    "title": "High skilled jobs most exposed to AI, impact is still unknown - report ",
    "url": "https://cointelegraph.com/news/high-skilled-jobs-most-exposed-to-ai",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/d12d74d1-2e4d-409b-a257-64c0bb790b8c.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A deep dive into global employment data and trends indicates that AI could have the biggest impact on high-skill jobs.</p>\n                    <p><p>An employment outlook paper suggests that highly skilled professions are the most exposed to artificial intelligence while its potential impact on employment is yet to be seen.</p><p>The Organisation for Economic Co-operation and Development (OECD) released its latest employment  report, with a focus on labour demand and widespread shortages given ongoing high inflation and resulting fiscal policies around the world.</p><p>A key takeaway is covered in a chapter dedicated to exploring why there is no significant sign of slowing labour demand due to advancements in AI. Measures of AI exposure show that available tools have shown the most progress in areas requiring “non-routine, cognitive tasks such as information ordering, memorization and perceptual speed”.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> Just released: OECD’s 2023 Employment Outlook!  <br><br>See latest analysis to find out more  <a href=\"https://t.co/OoHoiCv9qE\">https://t.co/OoHoiCv9qE</a><a href=\"https://twitter.com/hashtag/EmploymentOutlook?src=hash&amp;ref_src=twsrc%5Etfw\">#EmploymentOutlook</a> <a href=\"https://t.co/6nSiv4JPMx\">pic.twitter.com/6nSiv4JPMx</a></p>&mdash; OECD ➡️ Better Policies for Better Lives (@OECD) <a href=\"https://twitter.com/OECD/status/1678713284965302272?ref_src=twsrc%5Etfw\">July 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The OECD says these are key qualities of occupations requiring significant training or tertiary education. The research goes on to label “high-skill, white collar jobs” as the most exposed to AI.</p><p>Business professionals, managers, chief executives and science and engineering professionals are listed as the main occupations exposed to AI capabilities. Meanwhile food preparation assistants, agriculture, forestry and fishery labourers, cleaners and helpers are named as the least affected occupations by AI.</p><p>The publication also takes an in-depth look at evidence on the impact of AI on labour markets, noting that progress in space has been fast, making it hard to distinguish its outputs from those produced by humans.</p><p>The report states that the net impact of AI is ambiguous because while AI displaces some jobs, its can also stimulate labour demand by increasing productivity. AI also has the potential to create new tasks, which in part creates new jobs.</p><blockquote>“AI will substitute for labour in certain jobs, but it will also create new jobs for which human labour has a competitive advantage.”</blockquote><p><a href=\"https://cointelegraph.com/news/ai-related-crypto-returns-rose-up-to-41-after-chatgpt-launched-study\"><strong><em>Related: AI-related crypto returns rose up to 41% after ChatGPT launched: Study</em></strong></a></p><p>Meanwhile negative employment effects due to AI advances are hard to find. The OECD cites data which reflects high-skill workers seeing employment gains over the past decade in comparison to low skilled workers. </p><p>The chapter also notes that its findings on the impact on specific job levels comes before the advent of <a href=\"https://cointelegraph.com/news/generative-ai\">large language models</a> like <a href=\"https://cointelegraph.com/tags/chatgpt\">ChatGPT</a>, noting that generative AI could further expand the scope of tasks and jobs that can be automated.</p><p>As Cointelegraph previously <a href=\"https://cointelegraph.com/news/searches-for-ai-jobs-in-2023-4x-higher-than-crypto-jobs-when-btc-hit-69k\">reported</a>, the AI sector has seen a surge in job seekers, with Google searches for “AI jobs” four times higher than searches for “crypto jobs” during 2021s peak bull run. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/moral-responsibility-how-blockchain-can-improve-ai-trustworthiness/\">‘Moral responsibility’: Can blockchain really improve trust in AI?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T10:12:57.000Z",
    "title": "Bitcoin trader eyes BTC price 'Darth Maul candle' as CPI due 2-year low",
    "url": "https://cointelegraph.com/news/bitcoin-trader-btc-price-candle-cpi-2-year-low",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/aa1222be-ea6b-4f0e-ba65-a1d7f6edf403.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin is tipped to see classic volatility in BTC price around the CPI release, while liquidity remains tightly wrapped around spot.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) eased higher into July 12 with the key macroeconomic event of the week just hours away.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/4a92831d-2886-41e4-8b07-16c9109ccdfc.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><h2>CPI set to hit lowest since March 2021</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> followed BTC price momentum as it slowly inched closer to $31,000.</p><p>The largest cryptocurrency showed little volatility through the start of the week, with local range highs and lows <a href=\"https://cointelegraph.com/news/bitcoin-fakeout-repeats-btc-price-spikes-31k\">still clearly defined</a>.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/FireCharts?src=hash&amp;ref_src=twsrc%5Etfw\">#FireCharts</a> shows <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> ask liquidity moving closer to the active trading zone, while bid support strengthens.<br><br>Expecting to see liquidity thinned out in the heart of the active trading range between now and Wed morning to clear the way for volatility around the <a href=\"https://twitter.com/hashtag/CPI?src=hash&amp;ref_src=twsrc%5Etfw\">#CPI</a> report.… <a href=\"https://t.co/T4VoXd1CaD\">pic.twitter.com/T4VoXd1CaD</a></p>&mdash; Material Indicators (@MI_Algos) <a href=\"https://twitter.com/MI_Algos/status/1678820072704311296?ref_src=twsrc%5Etfw\">July 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>With liquidity tight around spot price, analysts hoped for a reshuffle upon the release of the June print of the United States Consumer Price Index (CPI).</p><p>Roughly expected at around 3.2% — the lowest score since March 2021 — CPI should show U.S. inflation continuing to slow down.</p><p>“The Cleveland Fed, University of Michigan + Truflation all anticipating a similar number,” financial commentator Tedtalksmacro <a href=\"https://twitter.com/tedtalksmacro/status/1678118504896012288\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> in part of the day’s analysis.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/6d51f80e-a87f-4fd7-adf5-37630a2017e0.jpeg\"  /><figcaption style=\"text-align: center;\"><em>U.S. inflation chart. Source: Tedtalksmacro/Twitter</em></figcaption></figure><p>Traders acknowledged that flash volatility could prove deceptive, as Bitcoin tends to decide on trajectory somewhat after the data release.</p><p>“There's a good chance we see the usual ‘Darth Maul’ candle where both low timeframe highs &amp; lows are taken out shortly after CPI,” Daan Crypto Trades <a href=\"https://twitter.com/DaanCrypto/status/1679039127621181442/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">explained</a>.</p><blockquote>“From there on out the real direction for the day is often chosen which could then target the 31.1K or 30.2K level imo.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/6f3c68cd-7478-4605-9fc1-ee0e0cc0d57f.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Daan Crypto Trades/Twitter</em></figcaption></figure><p>\"The previous 4 CPI data releases have all followed a very similar pattern for Bitcoin,\" trading suite Decentrader <a href=\"https://twitter.com/decentrader/status/1678744558945939456\" target=\"_blank\" rel=\"noopener nofollow\">added</a> on the day. </p><blockquote>\"Volatility both ways to liquidate everyone, then price reverts back to where it was immediately prior to CPI release.\"</blockquote><h2>Bitcoin \"looking good\" for copycat bull run move</h2><p>On longer timeframes, popular trader Moustache considered the chances of a repeat performance of classic bull runs.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/cpi-btc-supply-5-things-bitcoin-this-week\">CPI meets low BTC supply — 5 things to know in Bitcoin this week</a></em></strong></p><p>The BTC/USD monthly chart, he noted this week, is in the process of breaking out above its 20-period simple moving average (SMA).</p><p>\"Every time BTC made a monthly close ABOVE the SMA 20 line, it was the ultimate confirmation of a bull run. For the following 2 years it never again went below this line (except covid crash),\" he commented, adding that the current situation was \"looking good.\"</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/5fd6f2d2-4b3b-4b9f-9941-d325d1ca5ef5.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Moustache/Twitter</em></figcaption></figure><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\">Should you ‘orange pill’ children? The case for Bitcoin kids books</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-12T10:30:00.000Z",
    "title": "Data Warehouse Space and Time Releases AI-Powered Prompt-to-SQL",
    "url": "https://cryptodaily.co.uk/2023/07/data-warehouse-space-and-time-releases-ai-powered-prompt-to-sql",
    "description": "<p>Space and Time (SxT), the decentralized data warehouse, has released a data query product that harnesses AI. Powered by Open AI&rsquo;s GPT-4, Prompt-to-SQL allows developers to generate queries using natural language prompts. It&rsquo;s the latest example of blockchain companies utilizing artificial intelligence, two technologies whose synergies are strong.</p>\n<p>The ultimate goal of Space and Time is to make blockchain and off-chain data available to developers on demand, regardless of which network they&rsquo;re working on. Its Proof of SQL technology enables data to be delivered with cryptographic proof that queries are accurate and tamperproof. Prompt-to-SQL slots into this, making it easier for researchers, analysts, and developers to query data with no coding required.</p>\n<p>&nbsp;</p>\nDecentralized Data on Demand\n<p>With Microsoft funding to its name, Space and Time comes with a certain pedigree. Its technology, which makes use of zero-knowledge proofs, is already being provisioned to dapp developers building across multiple chains. The release of Prompt-to-SQL is a major milestone for SxT, not only in enhancing its core product, but in terms of the new user groups it supports.</p>\n<p>As SxT CTO Scott Dykstra explains, &ldquo;AI-powered SQL is a game-changer for businesses that run a lean analytics team. Leveraging OpenAI decreases time-to-value for building data pipelines, analytics dashboards or simply writing SQL.&rdquo; The Space and Time co-founder highlights the benefit of being able to generate SQL or Python scripts using prompts and to ask natural-language questions about data.</p>\n<p>&nbsp;</p>\nMade for Enterprise\n<p>Initial applications for SxT&rsquo;s tech have primarily been for crypto-native developers creating consumer dapps. The real value of its Proof of SQL system, however, lies in its ability to open blockchain up to enterprises.</p>\n<p>Structured Query Language (SQL) is a programming language designed for managing data in relational database systems. By making it available within an onchain environment, Space and Time has made blockchain more palatable to enterprises, who can create apps that pull in data from a broad range of sources, not just onchain feeds.</p>\n<p>Houston is the name of the chatbot Space and Time has created for fielding data queries. Any time a user enters a prompt, the chatbot will process it and deliver an SQL query. The resultant output can be published to APIs, dashboards and AI/ML models in a single click.</p>\n<p>According to ChainML CEO Ron Bodkin, whose company developed Houston, the bot provides &ldquo;industry-leading AI functionality to users, including technical documentation support, code generation, self-service analytics, research, and seamless navigation powered by a conversational interface.&rdquo;</p>\n<p>Smart developers have long been aware of GPT-4&rsquo;s ability to help with their homework, providing capable code that can save time and brain power. The ability to plug artificial intelligence into SxT&rsquo;s Proof of SQL service, however, supports far more sophisticated use cases. By doing little more than entering text prompts, developers can access on- and off-chain data quickly and in a variety of convenient format</p>\n<p>AI chatbots are commonly envisaged in the context of providing customer support and helping consumers with low-level tasks such as holiday bookings. With Prompt-to-SQL, Space and Time has shown it&rsquo;s equally adept at helping tech-savvy users perform more complex tasks.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-12T10:15:49.000Z",
    "title": "Atpbot Launches The Easiest Automated Crypto Trading Bot For Investors",
    "url": "https://cryptodaily.co.uk/2023/07/atpbot-launches-the-easiest-automated-crypto-trading-bot-for-investors",
    "description": "<p>Singapore, Singapore, July 12th, 2023, Chainwire</p><p>ATPBot has launched one of the easiest auto-trading bots on the market. With its user-friendly interface and simplified features, the bot offers a hassle-free experience for novice and experienced traders.</p><p>ATPBot focuses on quantitative trading strategy development and services. It uses artificial intelligence to develop and implement quantitative trading strategies for users. ATPBot aims to provide cryptocurrency investors with efficient and stable trading strategies.</p><p>Key features of ATPBot include preset parameters and extensive historical backtesting. The system has been rigorously tested over a period of one to three years, providing users with a range of proven strategy options. This removes the need for traders to manually configure parameters and conduct their own backtesting.</p><p></p><p>Source: ATPBot, 40-month backtest profit 879%, max drawdown 33%</p><p>Using ATPBot is very simple, requiring only three steps. After connecting to a crypto exchange API, the user selects a strategy that matches their requirements and enters the investment amount. Finally, they click Run and wait for the AI trading bot to capture signals and trade on their behalf 24 hours a day.</p><p>Unlike many other bots that rely only on predetermined parameters set by the trader, ATPBot uses extensively tested and proven strategies and provides highly detailed backtest data. Through rigorous historical data analysis and market analysis, ATPBot constantly adjusts its strategies to minimize risk while maximizing profits.</p><p></p><p>Source: ATPBot, no fear of market ups and downs, perfect curve</p><p>ATPBot's simple operating system offers a number of advantages. By eliminating the need for manual parameter configuration and backtesting, ATPBot saves traders valuable time. They can spend more time on other aspects of their investment strategy or pursuing other opportunities in the cryptocurrency market.</p><p>ATPBot also eliminates the confusion that novice traders may feel in the face of automated trading complexity. The simple interface and preset parameters make it easy to understand, even for individuals with limited trading experience. This allows more people to participate in automated trading.</p><p>With preset parameters and extensive historical backtesting, ATPBot provides users with confidence in their chosen strategies. Traders can be confident that the selected strategies have been rigorously tested and have demonstrated promising results in the past.</p><p>Despite the many benefits of automated trading, it is vital that risk is managed effectively, and ATPBot's preset parameters and historical backtesting help users assess the potential risk of each strategy. Traders can protect their investment capital by choosing strategies that match their risk tolerance.</p><p></p><p>Source: ATPBot. Review the time and position of entry and exit for each order</p><p>By providing preset parameters, extensive backtesting, and a simple process, ATPBot simplifies the steps involved in implementing an automated trading strategy. Traders can save time, reduce complexity, increase confidence and manage risk effectively with this user-friendly interface.</p><p>Traders can register today to open the door to AI quant trading, and share the profits of AI technology algorithms with ATPBot.</p><p>In addition to its platform functionality, ATPBot also boasts a professional Discord community consisting of numerous quantitative trading researchers and practitioners. Within this space, users can interact with quantitative trading enthusiasts from around the world, sharing experiences and ideas. The community offers professional guidance on market trends, market analysis, and trading techniques, helping users advance further on the path of quantitative trading.</p><p>About ATPBot</p><p>ATPBot is a digital currency intelligent AI-quantitative trading bot platform, founded in 2021. ATPBot&rsquo;s mission is to become a leader in the field of digital currency trading and provide efficient, intelligent, and reliable quantitative trading solutions to our clients. ATPBot&rsquo;s team consists of AI algorithm and strategy modeling experts who provide collective intelligence and advanced machine learning models to drive growth and success for businesses. ATPBot seeks significant capital appreciation through a combination of quantitative methods and artificial intelligence (AI) strategies, and has developed an advanced AI algorithm model that has repeatedly outperformed the market. Moving forward, ATPBot will continue to drive technological innovation and industry leadership to provide our clients with more efficient, intelligent, and reliable quantitative trading bot solutions.</p><p>Socials:&nbsp;Twitter&nbsp;|&nbsp;Discord</p>ContactJoan Trinabusiness@atpbot.com"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T10:34:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T10:15:25.000Z",
    "title": "Atpbot Launches The Easiest Automated Crypto Trading Bot For Investors",
    "url": "https://www.cryptopolitan.com/atpbot-launches-the-easiest-automated-crypto-trading-bot-for-investors/",
    "description": "Singapore, Singapore, July 12th, 2023, Chainwire ATPBot has launched one of the easiest auto-trading bots on the market. With its user-friendly interface and simplified features, the bot offers a hassle-free experience for novice and experienced traders. ATPBot focuses on quantitative trading strategy development and services. It uses artificial intelligence to develop and implement quantitative trading ... <a title=\"Atpbot Launches The Easiest Automated Crypto Trading Bot For Investors\" class=\"read-more\" href=\"https://www.cryptopolitan.com/atpbot-launches-the-easiest-automated-crypto-trading-bot-for-investors/\" aria-label=\"More on Atpbot Launches The Easiest Automated Crypto Trading Bot For Investors\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-12T10:33:58.000Z",
    "title": "Most Underrated Cryptocurrencies Right Now:  Decentraland, Zilliqa, Tradecurve",
    "url": "https://www.crypto-news-flash.com/most-underrated-cryptocurrencies-right-now-decentraland-zilliqa-tradecurve/?utm_source=rss&utm_medium=rss&utm_campaign=most-underrated-cryptocurrencies-right-now-decentraland-zilliqa-tradecurve",
    "description": "<img width=\"512\" height=\"330\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-12T130048.805.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-12T130048.805.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-12T130048.805-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />A lot of cryptocurrencies experienced volatility during June and ended up dipping in value, but in July, this volatility is heading in a positive, as a lot of them began seeing significant increases in value. The most underrated cryptocurrencies available during this month include Tradecurve (TCRV), Decentraland (MANA), and Zilliqa (ZIL), and we will go [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-12T10:22:36.000Z",
    "title": "Bitcoin Holds Its Breath: Is a Rally to $35,000 Imminent with the Release of US CPI Data? Report",
    "url": "https://www.crypto-news-flash.com/bitcoin-holds-its-breath-is-a-rally-to-35000-imminent-with-the-release-of-us-cpi-data-report/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-holds-its-breath-is-a-rally-to-35000-imminent-with-the-release-of-us-cpi-data-report",
    "description": "<img width=\"960\" height=\"573\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720.jpg 960w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720-300x179.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720-768x458.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720-336x200.jpg 336w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720-36x21.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/08/bitcoin-3227442_960_720-48x29.jpg 48w\" sizes=\"(max-width: 960px) 100vw, 960px\" />Market remains on edge as US inflation data is set to be published. Favorable data might likely push Bitcoin to the $35,000 price level in the near term. Crypto investors are still looking forward to the release of the Consumer Price Index (CPI) scheduled for today Wednesday, July 12th. This data is crucial to the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-12T10:16:12.000Z",
    "title": "Atpbot Launches The Easiest Automated Crypto Trading Bot For Investors",
    "url": "https://www.crypto-news-flash.com/atpbot-launches-the-easiest-automated-crypto-trading-bot-for-investors/?utm_source=rss&utm_medium=rss&utm_campaign=atpbot-launches-the-easiest-automated-crypto-trading-bot-for-investors",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/img_v2_887050a6-492a-4140-848e-aa56f0472f8g_1689154342zD79Fd6qdf.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/img_v2_887050a6-492a-4140-848e-aa56f0472f8g_1689154342zD79Fd6qdf.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/img_v2_887050a6-492a-4140-848e-aa56f0472f8g_1689154342zD79Fd6qdf-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/img_v2_887050a6-492a-4140-848e-aa56f0472f8g_1689154342zD79Fd6qdf-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/img_v2_887050a6-492a-4140-848e-aa56f0472f8g_1689154342zD79Fd6qdf-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Singapore, Singapore, July 12th, 2023, Chainwire ATPBot has launched one of the easiest auto-trading bots on the market. With its user-friendly interface and simplified features, the bot offers a hassle-free experience for novice and experienced traders. ATPBot focuses on quantitative trading strategy development and services. It uses artificial intelligence to develop and implement quantitative trading [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-12T10:12:28.000Z",
    "title": "IOTA Revolutionizing Supply Chain in Africa Using Tangle Technology – Report",
    "url": "https://www.crypto-news-flash.com/iota-revolutionizing-supply-chain-in-africa-using-tangle-technology-report/?utm_source=rss&utm_medium=rss&utm_campaign=iota-revolutionizing-supply-chain-in-africa-using-tangle-technology-report",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/stockphoto-graf-IOTA.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"IOTA News\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/stockphoto-graf-IOTA.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/stockphoto-graf-IOTA-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/stockphoto-graf-IOTA-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/stockphoto-graf-IOTA-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The IOTA Foundation in partnership with TradeMark East Africa (TMEA) has brought together different trade agencies to enable seamless cross-border trade. The IOTA ecosystem has enabled different technologies to align with the open standards, EPCIS 2.0, and the decentralized ID coming from W3C verifiable credentials. The need for streamlined supply chain management is undeniably needed [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-12T10:20:35.000Z",
    "title": "Coinbase Center Stage in Bitcoin ETF Push: Will the SEC Crack?",
    "url": "https://coinedition.com/coinbase-center-stage-in-bitcoin-etf-push-will-the-sec-crack/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Cboe_exchange_to_partner_with_Coinbase_on_bitcoin_market_surveillance.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Cboe_exchange_to_partner_with_Coinbase_on_bitcoin_market_surveillance.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Cboe_exchange_to_partner_with_Coinbase_on_bitcoin_market_surveillance-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Cboe_exchange_to_partner_with_Coinbase_on_bitcoin_market_surveillance-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Cboe_exchange_to_partner_with_Coinbase_on_bitcoin_market_surveillance-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Cboe_exchange_to_partner_with_Coinbase_on_bitcoin_market_surveillance-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Cboe_exchange_to_partner_with_Coinbase_on_bitcoin_market_surveillance-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Cboe_exchange_to_partner_with_Coinbase_on_bitcoin_market_surveillance-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Cboe_exchange_to_partner_with_Coinbase_on_bitcoin_market_surveillance-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Cboe_exchange_to_partner_with_Coinbase_on_bitcoin_market_surveillance-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Cboe_exchange_to_partner_with_Coinbase_on_bitcoin_market_surveillance-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Cboe_exchange_to_partner_with_Coinbase_on_bitcoin_market_surveillance-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Cboe_exchange_to_partner_with_Coinbase_on_bitcoin_market_surveillance-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Cboe_exchange_to_partner_with_Coinbase_on_bitcoin_market_surveillance-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Cboe_exchange_to_partner_with_Coinbase_on_bitcoin_market_surveillance-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Cboe_exchange_to_partner_with_Coinbase_on_bitcoin_market_surveillance-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Cboe_exchange_to_partner_with_Coinbase_on_bitcoin_market_surveillance-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Exchange operator Cboe Global Markets has taken a decisive step forward by submitting revised applications to list and trade shares of three spot Bitcoin exchange-traded funds (ETFs), including a notable offering from Fidelity. A noteworthy addition to these applications is the inclusion of surveillance-sharing agreements with US-based crypto exchange Coinbase. According to Reuters, the U.S. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coinbase-center-stage-in-bitcoin-etf-push-will-the-sec-crack/\">Coinbase Center Stage in Bitcoin ETF Push: Will the SEC Crack?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]