[
  {
    "source": "Bitcoin.com",
    "date": "2024-02-05T05:30:07.000Z",
    "title": "FTX Estate to Monetize AI Investment, Seeks Sale of Anthropic Shares Amid Bankruptcy Proceedings",
    "url": "https://news.bitcoin.com/ftx-estate-to-monetize-ai-investment-seeks-sale-of-anthropic-shares-amid-bankruptcy-proceedings/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/ftxanthrop-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"FTX Estate to Monetize AI Investment, Seeks Sale of Anthropic Shares Amid Bankruptcy Proceedings\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/ftxanthrop-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/ftxanthrop-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/ftxanthrop-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/ftxanthrop-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/ftxanthrop-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/ftxanthrop-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/ftxanthrop.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a significant move within the crypto bankruptcy landscape, FTX Trading Ltd. has announced its intention to sell its equity interests in the artificial intelligence (AI) firm, Anthropic PBC. Holding close to an 8% stake, valued between approximately $1.47 billion to upwards of $2.4 billion, FTX is navigating its Chapter 11 bankruptcy with this strategic [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-05T05:20:00.000Z",
    "title": "BNB Price Increase To Continue? This Resistance Could Trigger Fresh Rally",
    "url": "https://www.newsbtc.com/analysis/bnb/bnb-price-increase-310/",
    "description": "BNB price is attempting a fresh increase from the $288 zone. The price could start a fresh rally if there is a clear move above the $310 resistance. BNB price is showing bullish signs above the $300 pivot level. The price is now trading below $310 and the 100 simple moving average (4 hours). There is a key bearish trend line forming with resistance near $306 on the 4-hour chart of the BNB/USD pair (data source from Binance). The pair gather bullish momentum if there is a close above the $308-$310 resistance zone. BNB Price Eyes Fresh Rally In the past few days, BNB price started a decent increase and cleared the $300 resistance zone, unlike Bitcoin and Ethereum. There was a move above the $305 level before the bears appeared. A high was formed near $313 and the price recently started a downside correction. There was a move below the $308 level. The price declined below the 50% Fib retracement level of the upward move from the $287 swing low to the $313 high. BNB is now consolidating near $305 and the 100 simple moving average (4 hours). Immediate resistance is near the $308 level. There is also a key bearish trend line forming with resistance near $306 on the 4-hour chart of the BNB/USD pair. Source: BNBUSD on TradingView.com The next resistance sits near the $310 level. A clear move above the $310 zone could send the price further higher. In the stated case, BNB price could test $320. A close above the $320 resistance might set the pace for a larger increase toward the $335 resistance. Any more gains might call for a test of the $350 level. Another Decline? If BNB fails to clear the $310 resistance, it could continue to move down. Initial support on the downside is near the $300 level. The next major support is near the $292 level or the 76.4% Fib retracement level of the upward move from the $287 swing low to the $313 high. The main support sits at $288. If there is a downside break below the $288 support, the price could drop toward the $275 support. Any more losses could initiate a larger decline toward the $262 level. Technical Indicators 4-Hours MACD – The MACD for BNB/USD is losing pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for BNB/USD is currently above the 50 level. Major Support Levels – $300, $292, and $288. Major Resistance Levels – $308, $310, and $320."
  }
]