[
  {
    "source": "CoinDesk",
    "date": "2023-06-13T23:20:19.000Z",
    "title": "SEC Says It May Make a Recommendation on Coinbase Petition Within 4 Months",
    "url": "https://www.coindesk.com/policy/2023/06/13/sec-says-it-may-make-a-recommendation-on-coinbase-petition-within-4-months/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Securities and Exchange Commission (SEC) hasn't made a decision on whether it will respond to Coinbase's petition for rulemaking and its enforcement action against the crypto trading platform isn't inconsistent with any decision on rulemaking, the regulator said Tuesday."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-13T23:32:30.000Z",
    "title": "You Can Mint This Ridiculous Song About Vitalik Buterin as a Free NFT",
    "url": "https://decrypt.co/144498/you-can-mint-this-ridiculous-song-about-vitalik-buterin-as-a-free-nft",
    "description": "As music NFT platform Sound.xyz adds support for Ethereum layer-2 Optimism, the projects' co-founders deliver a rousing tribute to Vitalik."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-13T23:29:06.000Z",
    "title": "SEC Refuses to Respond to Coinbase’s Rulemaking Petition Following Lawsuit",
    "url": "https://decrypt.co/144454/sec-refuses-respose-coinbase-rulemaking-petition-lawsuit",
    "description": "The U.S. Court of Appeals for the Third Circuit had asked the SEC to clarify its position on a rulemaking petition from Coinbase."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-13T23:29:38.000Z",
    "title": "Cybernetic organizations — BORGs — are doomed to fail",
    "url": "https://cointelegraph.com/news/cybernetic-organizations-borgs-doomed-fail",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/aff252b9-6448-4c64-b0b2-6d1580cb3b82.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cybernetic organizations automate decision-making so that DAO actions can be taken without proposals — implementing law through code. </p>\n                    <p><p>What makes a <a href=\"https://cointelegraph.com/daos-for-beginners/what-is-a-dao\">decentralized autonomous organization (DAO)</a> a DAO? In practice, the democratic structure of these organizations has been compromised because a number of self-purporting DAOs are operating like traditional corporations.</p><p>With this in mind, developers at Delphi Labs proposed an alternative framework, incorporating so-called BORGs (Cybernetic Organizations) into governance structures to automate decision-making so that action could be taken without a DAO proposal. In effect, a BORG would be an artificially intelligent bureaucrat, implementing law through code. </p><p>However, the project of democratization should not be abandoned yet. DAOs should put in the work to engage their community in governance from the start.</p><h2>BORGs entered the scene</h2><p>As BORG proponents <a href=\"https://delphilabs.medium.com/assimilating-the-borg-a-new-cryptolegal-framework-for-dao-adjacent-entities-569e54a43f83#:~:text=Unlike%20a%20DAO%2C%20however%2C%20BORGs,legal%2C%20technological%20and%20economic%20mechanisms.\" target=\"_blank\" rel=\"noopener nofollow\">admit</a>, “BORGs are not intended to be fully transparent, fully decentralized or fully autonomous.”</p><p>So, how can these entities coexist with DAOs? By design, BORGs further cement the vision of founding core teams who establish these entities, then shield their interests from criticism under the guise of trust-minimized, programmable governance. Where this technology is adopted, projects are bound to siphon decision-making into BORGs for the sake of convenience, falling into a democratic deficit.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/openai-needs-a-dao-to-manage-chatgpt\"><strong><em>OpenAI needs a DAO to manage ChatGPT</em></strong></a></p><p>It is worth noting that Delphi Labs argues in favor of BORGs under the premise that DAOs cannot function as they were envisioned. DAOs require significant levels of coordination and engagement. Not to mention DAOs are now facing an uphill legal battle, with a <a href=\"https://cointelegraph.com/news/bzx-dao-class-action-ruling-dev-with-upgrade-key-makes-platform-custodial\">recent court case</a> in the United States ruling that legal liability could be extended to tokenholders. </p><p>In the absence of functioning DAOs, BORGs represent a more democratic entity than a traditional hierarchical corporate structure. But if decentralized governance can be achieved, automated decision-making pales in comparison to the outcomes that can be delivered from inclusive governance.</p><h2>The history of DAOs</h2><p>To appreciate DAOs, we have to understand the problem that this decentralized structure was designed to fix. In the last century, corporations have become increasingly centralized, with almost all decisions made to put more money in the pockets of the largest shareholders. This has come at a tremendous cost to employees and consumers in the form of low wages, poor service quality and price inflation. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This is one of the most interesting papers I’ve read on DAOs. <br><br>It proposes BORGs, essentially hiving off DAO adjacent entities which have a legal personality tailored to their specific action. <br><br>I resonate with a lot of the definitions here, importantly it let’s the DAO be a DAO <a href=\"https://t.co/lZrbTMtxMm\">https://t.co/lZrbTMtxMm</a> <a href=\"https://t.co/WgDGi6wLWB\">pic.twitter.com/WgDGi6wLWB</a></p>&mdash; drnick  (@DrNickA) <a href=\"https://twitter.com/DrNickA/status/1649089956781117441?ref_src=twsrc%5Etfw\">April 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>When the crypto industry developed out of the ashes of the 2008 recession, leaders in the space advocated for crypto companies to operate with decentralized governance to avoid the foils of corporate greed that caused Wall Street’s collapse.</p><p>Over the course of history, democracy is the only system that has proven to optimize the diverse interests of a community so that no person benefits to the detriment of everyone else. As the industry seeks to democratize finance, extending opportunities to previously disenfranchised communities, it is critical that these services are developed democratically. Otherwise, the end product is bound to serve the interests of the founders and the largest stakeholders.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/brian-armstrong-owes-me-100-in-bitcoin-here-s-why\"><strong><em>Brian Armstrong promised me $100 in Bitcoin — So, where is it?</em></strong></a></p><p>Members of the DAO community should have a say in critical decision-making, especially as DAOs diversify their membership and need to balance the preferences of people from different socioeconomic backgrounds. By design, community-driven solutions will cater to a wider range of preferences than decisions made behind closed doors by smaller groups, or executed automatically by BORGs developed by these individuals. </p><h2>DAOs as legal entities</h2><p>One of the benefits of BORGs as outlined by Delphi Labs would be to reduce the legal liability of DAO members in relation to off-chain activities, such as investing in new projects or hiring workers, which would then be delegated to a BORG. However, it is difficult to say whether this delegation would be recognized under law in all jurisdictions. Moreover, the existence of BORGs does not eliminate liability for on-chain activities, so DAO communities still need to be prepared for these events in the future.</p><p>This is an ongoing issue for DAOs — one that can be addressed with greater transparency and accountability while complying with existing laws and guidelines. As of yet, the benefits of BORGs do not outweigh the risk this framework poses to the democratic structure of DAOs. </p><h2>Engaging community</h2><p>Scalability remains a key attraction to BORGs, with the potential to streamline decision-making as projects expand and diversify. However, the benefits of automation result in sacrificing democratic ideals.</p><p>Engaging community members in the decision-making process should be the first port of call before a DAO turns to automation. This requires developers to reflect on whether the product is people-centered, tailoring the mission to one that would attract community interest and engagement. Furthermore, coordinating with a larger group of stakeholders requires coordination and flexibility.</p><p>While operating a non-hierarchical organization can be difficult, these sacrifices will have long-term benefits to the sustainability and impact of the project. Otherwise, community members may be alienated from the project and abandon it altogether. With the potential to undermine democracy and erode community support, BORGs are doomed to fail.</p><p>Though DAOs come with their own set of problems that must be addressed, the solution must not be to reduce transparency and community participation but to create tools that allow for the efficient management of a DAO.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Bernhard Blaha </strong>is the CEO of The People’s SCE, a Luxembourg-based European Cooperative Society. He was previously the CEO of Blocktrade. He holds a master’s degree in executive management. He has been active in the blockchain industry for nine years.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-13T23:20:52.000Z",
    "title": "Binance.US and SEC told to reach compromise on restraining order",
    "url": "https://cryptoslate.com/binance-us-and-sec-told-to-reach-compromise-on-restraining-order/",
    "description": "<p>Binance.US and the U.S. Securities Exchange Commission (SEC) could reach an agreement that could avoid a full asset freeze, Bloomberg said on June 13. Judge demands compromise agreement The SEC first filed charges against Binance.US and related companies on June 5. It then requested a restraining order and asset freeze on June 8. Though the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-us-and-sec-told-to-reach-compromise-on-restraining-order/\">Binance.US and SEC told to reach compromise on restraining order</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-13T23:30:00.000Z",
    "title": "Mysterious SHIB Whale Snaps Up 1.5 Trillion Tokens from Crypto Exchanges Facing SEC Lawsuits",
    "url": "https://www.cryptoglobe.com/latest/2023/06/mysterious-shib-whale-snaps-up-1-5-trillion-tokens-from-crypto-exchanges-facing-sec-lawsuits/",
    "description": "A mysterious Shiba Inu ($SHIB) whale has quietly amassed a significant amount of the meme-inspired cryptocurrency in a series of transactions that lasted several hours, and prompted speculation and intrigue among observers on-chain. According to data obtained from the Ethereum blockchain explorer Etherscan, this so-called whale, identified by the first characters of its wallet address […]\n"
  }
]