[
  {
    "source": "Cointelegraph",
    "date": "2023-12-28T00:31:42.000Z",
    "title": " Bitzlato suspends withdrawals weeks after founder agrees to dissolve exchange  ",
    "url": "https://cointelegraph.com/news/bitzlato-suspends-bitcoin-withdrawals-founder-guilty-plea",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNTExNGM1OWUtZWQ1Yy00MzQ0LThhODgtM2RhODA4ZjQ2YjA0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Part of Bitzlato co-founder’s guilty plea on Dec. 6 was to dissolve the illicit exchange and forfeit its cryptocurrency. Now, it’s suspending withdrawals.</p>\n                    <p><p>Just weeks after Bitzlato’s co-founder agreed in a Brooklyn court to <a href=\"https://cointelegraph.com/news/bitzlato-ex-ceo-legkodymov-pleads-guilty-one-count-brooklyn-court\">dissolve the crypto exchange</a> as part of a guilty plea, the Bitzlato team announced it has to “temporarily suspend” all Bitcoin withdrawals. </p><p>In a Dec. 27 post to its Telegram Channel, the firm <a href=\"https://t.me/bitzlato_newss/103\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> this was only a temporary measure while it prepares and goes through upcoming legal hearings regarding its users’ assets seized in France. </p><p>“We are full of determination and optimism regarding this matter,” it said. </p><p><a href=\"https://cointelegraph.com/news/bitzlato-suspends-bitcoin-withdrawals-founder-guilty-plea\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-28T00:10:19.000Z",
    "title": "Bitzlato suspends ‘special balance withdrawals’ while assets still under seizure",
    "url": "https://cryptoslate.com/bitzlato-suspends-special-balance-withdrawals-while-assets-still-under-seizure/",
    "description": "<p>The Russia-linked cryptocurrency exchange Bitzlato announced a temporary halt on certain withdrawal requests on Dec. 27, despite having had its assets seized by French authorities in January. The company wrote in a Telegram message: &#8220;&#8230; We are faced with the need to suspend special balance withdrawals and technical support. This is a temporary measure to [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitzlato-suspends-special-balance-withdrawals-while-assets-still-under-seizure/\">Bitzlato suspends &#8216;special balance withdrawals&#8217; while assets still under seizure</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-28T00:30:10.000Z",
    "title": "Former SEC Official Warns Spot Bitcoin ETFs Will Create ‘Wall Street Fee-Sucking Scam of Epic Proportions’",
    "url": "https://news.bitcoin.com/former-sec-official-warns-spot-bitcoin-etfs-will-create-wall-street-fee-sucking-scam-of-epic-proportions/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/john-reed-stark-bitcoin-etf-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Former SEC Official Warns Spot Bitcoin ETFs Will Create &#039;Wall Street Fee-Sucking Scam of Epic Proportions&#039;\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/john-reed-stark-bitcoin-etf-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/john-reed-stark-bitcoin-etf-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/john-reed-stark-bitcoin-etf-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/john-reed-stark-bitcoin-etf-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/john-reed-stark-bitcoin-etf-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/john-reed-stark-bitcoin-etf-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/john-reed-stark-bitcoin-etf.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.S. Securities and Exchange Commission’s former head of internet enforcement has warned that spot bitcoin exchange-traded funds (ETFs) &#8220;will create yet another Wall Street fee-sucking investor scam of epic proportions.&#8221; In addition, he stressed that it will likely be the most centralized crypto contraption conceivable. Ex-SEC Official&#8217;s Spot Bitcoin ETF Warnings Former U.S. Securities [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-28T00:20:10.000Z",
    "title": "Dogecoin Whale Moves 71 Million DOGE To Robinhood, What Does This Mean For Price?",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-whale-71-million-doge/",
    "description": "A Dogecoin whale address recently made a transfer of 71.2 million DOGE valued at $6.3 million into Robinhood from a private address. According to various social media posts by whale transaction tracker Whale Alerts, large DOGE transfers in and out of exchanges have seen an uptick since the beginning of the week. At the same time, the price of DOGE has traded between a high end of $0.097 and a low end of $0.089. Massive DOGE Transfer Into Robinhood The uptick in massive DOGE transfers from whales has had investors thinking of the crypto&#8217;s outlook in the next few days. When whales make big transfers like this, it often signals they’re about to make a major buy or sell order that can impact the price. Related Reading: The Crypto Bulls Are Back: Digital Asset Inflows Cross $103 Million In One Week In this case, data from on-chain data shows that the 71.2 million DOGE tokens were transferred from the private address &#8220;DF8jRK&#8221; to the Robinhood-linked address &#8220;DHQsfy.&#8221; The token transfer seems to have been a major part of the address&#8217; holdings. At the time of writing, the address &#8220;DF8jRK&#8221; holds 36.3 million DOGE tokens, worth approximately $3.3 million. 🚨 71,224,271 #DOGE (6,392,254 USD) transferred from unknown wallet to #Robinhoodhttps://t.co/mSNJ8HSSot — Whale Alert (@whale_alert) December 26, 2023 Consequently, the transfer to Robinhood, a major crypto exchange, suggests the whale may be preparing to sell their DOGE holdings, which could drive the price down. On the other hand, Whale Alerts has reported other large transfers during the last few days. For example, 367 million DOGE tokens worth $33.6 million were transferred between two unknown wallets.  Also, 999 million DOGE tokens worth $91 million were sent from Binance to an unknown wallet in the past 24 hours. However, the crypto exchange clarified that the transfer was part of its standard wallet maintenance. DOGE bears continue to vie for control &#124; Source: DOGEUSD On Tradingview.com Current State Of Dogecoin Dogecoin&#8217;s price movement this year has generally lacked the volatility and enthusiasm it has experienced from traders in past years. The crypto is currently trading at $0.09255, down by 0.29% in the past 24 hours, and has been stuck in a sideways movement. On the monthly timeframe, DOGE is up by 16% in the past 30 days.  Related Reading: Crypto Trading Firm Expects Bitcoin To Crash To $36,000, Here’s Why DOGE recently hit a yearly high of $0.10 this December. According to crypto analyst Ali Martinez, network activity has increased this month, with a steady rise in the creation of new DOGE addresses.  Dogecoin now has 5.29 million addresses with a balance, reiterating its position as the largest meme coin and the fifth-largest address count in the crypto market. However, IntoTheBlock’s Active Addresses Ratio shows that the majority of these addresses are inactive, with only a 2.73% average in the past 30 days. Source: IntoTheBlock Featured image from Watcher Guru, chart from Tradingview.com"
  }
]