[
  {
    "source": "Crypto Briefing",
    "date": "2023-12-28T20:00:05.000Z",
    "title": "Researchers see 2024 as crypto’s ‘airdrop season’",
    "url": "https://cryptobriefing.com/researchers-consider-2024-cryptos-airdrop-season/?utm_source=feed&utm_medium=rss",
    "description": "Following 2022s record crypto VC funding, analysts expect 2024 incentive season as projects award tokens to users to boost adoption."
  },
  {
    "source": "NullTX",
    "date": "2023-12-28T20:01:25.000Z",
    "title": "$AUCTION Faces Downtrend After Successful $AMMX Token Launch",
    "url": "https://nulltx.com/auction-faces-downtrend-after-successful-ammx-token-launch/",
    "description": "Bounce Token experienced a decline of more than 11% in the recent hours following the triumphant conclusion of the $AMMX token launch. Participation in the $AUCTION Staking Pool exceeded expectations, with 2,126 participants committing a total of 2,741,970 $AUCTION, surpassing the initial goal of 12,857 $AUCTION. According to Lookonchain, after [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-28T20:00:34.000Z",
    "title": "Bitcoin Whales Bought The Recent Dip While Market Panicked",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-whales-bought-heavy-lows-on-chain-data/",
    "description": "On-chain data suggests the Bitcoin whales may have participated in a significant amount of buying while the market was panicking about the recent lows. Bitcoin Exchange Netflow Has Been Quite Negative Recently An analyst in a CryptoQuant Quicktake post pointed out that the exchanges have recently seen outflows. The indicator of interest here is the &#8220;exchange netflow,&#8221; which keeps track of the net amount of Bitcoin entering or exiting out of the wallets of all centralized exchanges. The metric&#8217;s value is calculated by subtracting the outflows from the inflows. When the indicator has a positive value, the inflows overwhelm the outflows, and a net number of coins moves into these platforms. Related Reading: When Will Bitcoin Bull Run Begin? This Could Be The Metric To Watch As one of the main reasons investors may want to deposit their BTC to the exchanges is for selling purposes, this trend can have bearish implications for the cryptocurrency. On the other hand, the negative metric implies withdrawals are taking place, which can be a sign that the holders are accumulating right now. Such a trend could naturally turn out to be bullish for the asset&#8217;s price. Now, here is a chart that shows the trend in the Bitcoin exchange netflow over the past year: The value of the metric has been quite negative in recent days &#124; Source: CryptoQuant The above graph shows that the Bitcoin exchange netflow has observed some deep negative spikes recently. This suggests that some large outflows have been occurring from these platforms. Interestingly, these withdrawals came as BTC slipped towards the $41,600 level, implying that some investors were potentially buying while the rest of the market was panicking about the drawdown. Given the large scale of the deposits, it&#8217;s likely that whale entities were behind them. The fact that these humongous holders were willing to risk accumulating at these recent prices could be a positive sign for the continuation of the rally. Microstrategy has also just announced its massive $615 million BTC acquisition, which can naturally be another optimistic sign for the coin. The exchange netflows occurring ahead of the announcement are interesting, though. It&#8217;s hard to be sure if there is any connection between the two, but one possibility is that the whales who bought at these recent lows knew about the acquisitions ahead of time. Related Reading: Polygon Breaks Out Of Symmetrical Triangle, Analyst Puts This Target Another, and perhaps the more likely explanation, is that these large investors were looking for an entry point into the asset ahead of the potential ETF approvals, and the dip presented as good an opportunity as any to achieve so. Whatever the case, it would seem like the moves made by the whales might have paid off so far, as the Bitcoin price has rebounded since its lows (although its recovery hasn&#8217;t been too strong yet). BTC Price Bitcoin had recovered to as high as $43,800 during the past day, but the asset has since slumped back down as it&#8217;s now floating around the $42,800 mark. BTC has overall moved sideways during the last few days &#124; Source: BTCUSD on TradingView Featured image from Todd Cravens on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-28T20:08:51.000Z",
    "title": "Vitalik Buterin in Argentina: A View on the Economy and the Future of Ethereum",
    "url": "https://www.crypto-news-flash.com/vitalik-buterin-in-argentina-a-view-on-the-economy-and-the-future-of-ethereum/?utm_source=rss&utm_medium=rss&utm_campaign=vitalik-buterin-in-argentina-a-view-on-the-economy-and-the-future-of-ethereum",
    "description": "<img width=\"640\" height=\"427\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/angelica-reyes-cs9v06TuiT8-unsplash.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Vitalik-Argentina\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/angelica-reyes-cs9v06TuiT8-unsplash.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/angelica-reyes-cs9v06TuiT8-unsplash-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/angelica-reyes-cs9v06TuiT8-unsplash-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/angelica-reyes-cs9v06TuiT8-unsplash-450x300.jpg 450w\" sizes=\"(max-width: 640px) 100vw, 640px\" />Vitalik Buterin praises Argentine President Milei&#8217;s economic focus, contrasting it with U.S. economic policy. Buterin highlights Ethereum&#8217;s participation-proof shift and successful rollups in 2023. Today I bring you something interesting: Vitalik Buterin, the co-founder of Ethereum, currently in Argentina, has shared his impressions on the country&#8217;s economic situation and the role of the new president, [...]"
  }
]