[
  {
    "source": "Cointelegraph",
    "date": "2023-06-28T17:30:00.000Z",
    "title": "CFTC issues $54M default judgment against trader in crypto fraud scheme ",
    "url": "https://cointelegraph.com/news/cftc-issues-54m-default-judgment-against-trader-in-crypto-fraud-scheme",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/66093162-4769-45bb-85e3-1f8642950df2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>As a result of the judgment, the defendant is also now prohibited from engaging in any trading activities within markets regulated by the CFTC and is barred from registering with the regulatory body.</p>\n                    <p><p>On June 28th, the Commodity Futures Trading Commission (CFTC) <a href=\"https://www.cftc.gov/PressRoom/PressReleases/8732-23\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that Judge Naomi Reice Buchwald of the U.S. District Court for the Southern District of New York had issued a default judgment that granted a permanent injunction against Michael Ackerman, a resident of Alliance, Ohio. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today a federal court ordered an Ohio man to pay more than $50M for a fraudulent digital asset trading scheme. Learn more: <a href=\"https://t.co/z0WOqXIqih\">https://t.co/z0WOqXIqih</a></p>&mdash; CFTC (@CFTC) <a href=\"https://twitter.com/CFTC/status/1674060474407694337?ref_src=twsrc%5Etfw\">June 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Ackerman is now subjected to a ban from participating in any trading activities within CFTC-regulated markets and is prohibited from registering with the CFTC. Alongside these restrictions, the judgment mandates Ackerman to provide $27 million in restitution to the victims who suffered from his fraudulent digital asset trading scheme. Additionally, Ackerman is compelled to pay a $27 million civil monetary penalty, serving as a substantial financial consequence for his involvement in the deceptive scheme.</p><p>Ackerman is accused of operating a fraudulent scheme that solicited funds from individuals and entities under false pretenses. However, instead of using the funds for their intended purpose, he is alleged to have misappropriated the majority of the funds for personal use or to perpetuate the fraudulent trading scheme. </p><p>The case, brought forward by the CFTC, traces back to February 11, 2020, when Ackerman was accused of orchestrating an elaborate scam that spanned from August 2017 to December 2019. The complaint alleged that Ackerman operated the scheme to solicit funds for trading digital commodity assets but instead misappropriated the funds.</p><p> Over 150 individuals and entities reportedly entrusted Ackerman with a total of at least $33 million. Shockingly, less than $10 million of the deposited funds were actually used for trading, while the remainder was fraudulently diverted for personal use or to prolong the deceptive operation.</p><p><strong><em><a href=\"https://cointelegraph.com/news/ooki-dao-to-shut-down-after-precedent-setting-court-battle-with-cftc\">Related: Ooki DAO to shut down after ‘precedent setting’ court battle with CFTC</a></em></strong></p><p>During a keynote speech at City Week 2023 in London, Christy Goldsmith Romero, <a href=\"https://cointelegraph.com/news/cftc-proposes-reducing-anonymity-to-manage-risks\">a commissioner of the CFTC</a>, proposed the reduction of cryptocurrency anonymity as a way to mitigate the risks associated with digital assets. Romero highlighted the importance of governments and the industry working together to address the appeal of cryptocurrencies for illicit finance. </p><p>She emphasized that managing the risks of digital assets is crucial to uphold market integrity, national security, and financial stability. Romero specifically mentioned the need to tackle the challenge of identity verification to minimize illicit finance risks in the cryptocurrency market, as the use of mixers and anonymity-enhancing technology introduces significant potential risks.</p><p><em><strong>Magazine: </strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</strong></a></em></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-28T17:38:36.000Z",
    "title": "Analyzing capital rotation across cycle transitions",
    "url": "https://cryptoslate.com/insights/analyzing-capital-rotation-across-cycle-transitions/",
    "description": "<p>Investigating the Flow of Capital Amidst Market Shifts In studying the dynamics of capital rotation, we&#8217;re particularly focused on the turning points across various cycle transitions. This perspective provides crucial insights into the mechanisms driving the Bitcoin market. The Role of Bitcoin&#8217;s Long-Term Holders on Supply Availability When we turn our attention to Bitcoin, a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/analyzing-capital-rotation-across-cycle-transitions/\">Analyzing capital rotation across cycle transitions</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T17:23:33.000Z",
    "title": "NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?",
    "url": "https://www.cryptopolitan.com/near-price-prediction/",
    "description": "NEAR Price Prediction 2023-2032 Near Protocol (NEAR) is a blockchain platform with significant attention and partnerships within the cryptocurrency industry. Initially established by a small team in San Francisco, NEAR Protocol has rapidly expanded its influence and formed collaborations with industry giants. As a result, it has witnessed a consistent upward trajectory since its inception. ... <a title=\"NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-price-prediction/\" aria-label=\"More on NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T17:22:45.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. Various APE price highlights unfold in this ApeCoin Price Prediction. How much is ApeCoin (APE) worth? ... <a title=\"ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T17:21:39.000Z",
    "title": "Mexican crypto market gets a boost as Paxos partners with Mercado Libre to offer USDP stablecoin",
    "url": "https://www.cryptopolitan.com/mexican-crypto-market-gets-a-boost-as-paxos-partners-with-mercado-libre-to-offer-usdp-stablecoin/",
    "description": "In a move set to alleviate the burden of exorbitant remittance fees for customers, Paxos, the pioneering blockchain finance company, has joined forces with MercadoLibre, a leading online marketplace, to introduce the Pax Dollar (USDP) to the Mexican crypto market. This groundbreaking collaboration, announced on June 28th, will utilize MercadoLibre&#8217;s widely-used payment service, MercadoPago, to ... <a title=\"Mexican crypto market gets a boost as Paxos partners with Mercado Libre to offer USDP stablecoin\" class=\"read-more\" href=\"https://www.cryptopolitan.com/mexican-crypto-market-gets-a-boost-as-paxos-partners-with-mercado-libre-to-offer-usdp-stablecoin/\" aria-label=\"More on Mexican crypto market gets a boost as Paxos partners with Mercado Libre to offer USDP stablecoin\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T17:13:07.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T17:10:24.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the series of delisting fuelled by the ongoing United States SEC crackdown on major crypto platforms. Basically, it&#8217;s crypto winter in the summer as it stands. How do Cardano Price Prediction analysts steer in this turbulent crypto weather? ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-28T17:28:19.000Z",
    "title": "Top Only Fans Model Buys $10,000 worth of Alex The Doge (ALEX) and Chiliz (CHZ) Tokens, Analyst Explains why",
    "url": "https://nulltx.com/top-only-fans-model-buys-10000-worth-of-alex-the-doge-alex-and-chiliz-chz-tokens-analyst-explains-why/",
    "description": "In a surprising crossover between digital entertainment and cryptocurrencies, a top Only Fans model has reportedly invested $10,000 in Alex The Doge (ALEX) and Chiliz (CHZ) tokens. This unexpected news not only demonstrates the broadening appeal of cryptocurrencies but also signals some potential avenues for growth. This article delves into the reasons behind this investment [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-28T17:25:52.000Z",
    "title": "Crypto Millionaires showing great interest in Alex The Doge (ALEX) Presale",
    "url": "https://nulltx.com/crypto-millionaires-showing-great-interest-in-alex-the-doge-alex-presale/",
    "description": "The world of cryptocurrencies is seeing a new buzz, and the focus of attention is a digital asset that is still in its presale phase &#8211; Alex The Doge (ALEX). What&#8217;s more intriguing is the unexpected interest being shown by crypto millionaires in this budding asset. But why is a coin in its infancy attracting [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-28T17:17:27.000Z",
    "title": "Bulls are pushing Shiba Inu, Tradecurve and Axie Infinity prices to new heights",
    "url": "https://nulltx.com/bulls-are-pushing-shiba-inu-tradecurve-and-axie-infinity-prices-to-new-heights/",
    "description": "During the past few weeks, many cryptocurrencies experienced a rapid rally. Bulls began pushing Shiba Inu in a green direction. Tradecurve and Axie Infinity were also affected by the broader market momentum and their prices were pushed to new heights, where investors are now looking at bullish outlooks for both of them. Shiba Inu and [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-28T17:19:29.000Z",
    "title": "Bitpanda Pro becomes One Trading, raises €30m",
    "url": "https://crypto.news/bitpanda-pro-becomes-one-trading-raises-e30m/",
    "description": "Bitpanda Pro cryptocurrency exchange has undergone a significant transformation. It has been spun out into a standalone company called One Trading. "
  }
]