[
  {
    "source": "CoinDesk",
    "date": "2023-11-20T22:41:36.000Z",
    "title": "Kraken Accused by SEC of Operating Unregistered Platform, Improperly Mixing Customer Funds",
    "url": "https://www.coindesk.com/policy/2023/11/20/kraken-accused-by-sec-of-operating-unregistered-platform-improperly-mixing-customer-funds/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto exchange Kraken commingled customer and corporate funds while operating as an unregistered broker, clearing agency and dealer, the U.S. Securities and Exchange Commission (SEC) alleged in a new lawsuit Monday."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-20T22:40:53.000Z",
    "title": "SEC Files Charges Against Crypto Exchange Kraken—Again",
    "url": "https://decrypt.co/206775/sec-files-charges-against-crypto-exchange-kraken-again",
    "description": "The United States regulator has filed fresh charges against Kraken, just nine months after settling previous charges."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-20T22:45:33.000Z",
    "title": "SEC sues Kraken alleging it violated securities laws ",
    "url": "http://cointelegraph.com/news/sec-sues-kraken-for-securities-laws-violations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/2c073549-6ce1-49cd-a3f0-22c394bd533b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The SEC alleged Kraken operated as an unregistered exchange, broker, dealer and clearing agency.</p>\n                    <p><p>The United States Securities and Exchange Commission (SEC) has sued Kraken alleging it failed to register as an exchange, broker, dealer and clearing agency with the regulator and claimed it commingled customer funds. </p><p>In a Nov. 20 <a href=\"https://www.courtlistener.com/docket/68023155/1/securities-and-exchange-commission-v-payward-inc/\" target=\"_blank\" rel=\"noopener nofollow\">complaint</a>, the SEC claimed that since 2018, Kraken had operated as a platform that offered the unlawful sale of cryptocurrencies.</p><blockquote>\"Without registering with the SEC in any capacity, Kraken has simultaneously acted as a broker, dealer, exchange, and clearing agency with respect to these crypto asset securities.\"</blockquote><p>Additionally, the SEC alleged that Kraken's business practices and \"deficient\" internal controls saw the exchange commingle customer assets with its own, which resulted in an allegedly \"significant risk of loss\" for its customers. </p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-20T23:00:58.000Z",
    "title": "Clear Skies: Why Bitcoin Overhead Resistance Is Weak",
    "url": "https://www.newsbtc.com/bitcoin-news/clear-skies-why-bitcoin-overhead-resistance-is-weak/",
    "description": "Bitcoin price is only at $37,500 — a far cry from former all-time highs around $68,000. However, one visual technical analysis tool could show that overhead resistance is weak, and that the top cryptocurrency could rip right through what’s left. Could BTCUSD be back at all-time highs faster than most are ready for? Bitcoin Price Breaks Above The Monthly Ichimoku Cloud Technical analysts rely on a variety of tools to help provide signals to visually inspect and either manually or automatically take positions based on the results. One such tool, created by a Japanese journalist Goichu Hosoda, is called the Ichimoku. Hosoda was nicknamed “Ichimoku Sanjin” which loosely translates to &#8220;what the man in the mountain sees.&#8221; The idea behind the Ichimoku is that it provides an &#8220;at a glance&#8221; view of all market conditions. Related Reading: Learn All About The Ichimoku Cloud For example, the cloud plots where future support and resistance may lie. Meanwhile, the Tenkan-sen and Kijun-sen act as trend-following tools that cross bearish and bullish depending on price action. These spans can also act as support and resistance. With all that out of the way, all it takes is &#8220;one glance&#8221; at the chart below and we can see there is very little 1M BTCUSD resistance left. Bitcoin price is pushing above all major resistance &#124; BTCUSD on TradingView.com Clear Skies Above Major Resistance, But Minor Pullbacks A Plenty Also at just a glance, it is possible to see how each time Bitcoin price passed through these spans and the Ichimoku cloud, an extended bull market formed. It is important to note, however, that the Tenkan-sen (blue) and Kijun-sen (maroon) are still crossed bearish. But this also happened prior to each bull run. Related Reading: Failed Bearish Signal Could Send Bitcoin To $85K Next Month Additionally, the lagging span has been omit from this chart. Called the Chikou span in Japanese, the lagging span shows where former support and resistance used to be, which means Bitcoin does have some less significant resistance levels to contend with at around $43,000 and again around $60,000. Beyond $60,000, the Ichimoku shows nothing but air. Could this really mean clear skies for Bitcoin once the Ichimoku cloud is officially left behind? This chart appeared initially in Issue #27 of CoinChartist VIP. Click here to read the rest of the issue. Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from Shutterstock, Charts from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-20T23:01:08.000Z",
    "title": "$225,000,000 in USDT Frozen by Tether Following Investigation Into International Crime Syndicate",
    "url": "https://dailyhodl.com/2023/11/20/225000000-in-usdt-frozen-by-tether-following-investigation-into-international-crime-syndicate/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/03/whales-increase-power-tether.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/03/whales-increase-power-tether.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/03/whales-increase-power-tether.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/03/whales-increase-power-tether.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/03/whales-increase-power-tether.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/03/whales-increase-power-tether.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/03/whales-increase-power-tether.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The firm behind USDT has voluntarily frozen over $200 million worth of stablecoins to assist the U.S. Department of Justice (DOJ). In a new announcement, Tether says they are freezing $225 million in USDT funds in certain Southeast Asian wallets allegedly connected to &#8220;pig-butchering&#8221; romance scams. In a pig butchering scam, bad actors form a relationship [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/20/225000000-in-usdt-frozen-by-tether-following-investigation-into-international-crime-syndicate/\">$225,000,000 in USDT Frozen by Tether Following Investigation Into International Crime Syndicate</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]