[
  {
    "source": "Cointelegraph",
    "date": "2023-10-20T03:22:35.000Z",
    "title": "Crypto exchange Binance restores euro services after new fiat partners",
    "url": "https://cointelegraph.com/news/binance-restores-euro-withdrawal-deposit-fiat-partners-after-paysafe-debanking",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/52a6af2b-4bd7-4733-94d5-96a868775fa8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Euro payments, deposits, and withdrawals are back on for European Binance users months after the severance of services by PaySafe. </p>\n                    <p><p>Crypto exchange Binance has announced it has onboarded new partners to handle euro deposits and withdrawals, months after losing its previous fiat partner PaySafe in September. </p><p>In an Oct. 19 statement, Binance <a href=\"https://www.binance.com/en/blog/fiat/binance-expands-freedom-of-money-for-european-users-with-new-eur-fiat-partnerships-3923321843149867820\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that it had signed agreements with new fiat partners for euro payments, deposits, and withdrawals.</p><p>The move follows regulatory and debanking woes in the European Union, where the firm was forced to look for new banking partners after it lost the support of PaySafe in September. </p><p>Binance said that users have already started being migrated to the new services provided by “a number of new regulated and authorized fiat partners.” It did not specify which firms it had partnered with, however.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">More EUR fiat channels have arrived on <a href=\"https://twitter.com/hashtag/Binance?src=hash&amp;ref_src=twsrc%5Etfw\">#Binance</a><br><br>We’re proud to announce that we’ve entered into agreements with multiple new EUR partners to provide deposit, withdrawal, and payment services, making your experience even more seamless.<br><br>Find out more <a href=\"https://t.co/jKh2QxH3sN\">https://t.co/jKh2QxH3sN</a></p>&mdash; Binance (@binance) <a href=\"https://twitter.com/binance/status/1715041951353827722?ref_src=twsrc%5Etfw\">October 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The announcement noted that fiat services offered by the new partners include EUR deposits and withdrawals via Open Banking and SEPA/SEPA Instant. </p><p>Users can also buy and sell crypto using SEPA (Single Euro Payments Area), bank cards, and their fiat balances, and trade EUR spot pairs. </p><p>In late September, Binance urged its European users to <a href=\"https://cointelegraph.com/news/binance-urges-users-to-convert-euros-to-usdt-after-paysafe-debank\">convert their euros</a> into Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) before the end of October, though the latest announcement could suggest this is now not necessary.</p><p><em><strong>Related: </strong></em><a href=\"https://cointelegraph.com/news/binance-limits-withdrawals-in-europe\"><strong><em>Binance limits withdrawals in Europe, cites payment processor issues</em></strong></a><strong> </strong></p><p>However, some users were still <a href=\"https://twitter.com/Antiunes/status/1715053890045944078\" target=\"_blank\" rel=\"noopener nofollow\">reporting</a> issues depositing euros even after the announcement, while others <a href=\"https://twitter.com/chadthechad1/status/1715059064286085307\" target=\"_blank\" rel=\"noopener nofollow\">asked</a> about fiat partners for the British pound in the UK. </p><p>Paysafe pulled support for transactions in British pounds in May following <a href=\"https://cointelegraph.com/news/binance-s-paysafe-deal-worries-uk-financial-watchdog\">concerns raised</a> by United Kingdom financial regulators over the partnership.</p><p>On Oct. 16, Binance <a href=\"https://www.binance.com/en-GB/blog/all/update-on-binance-for-uk-users-937596818854026589\" target=\"_blank\" rel=\"noopener nofollow\">suspended access</a> to its exchange for new users based in the UK. The move followed the termination of a partnership with a third party to approve communications on its platform under new local rules by the country’s watchdog, the Financial Conduct Authority (FCA).</p><p>Binance has yet to source fiat partnerships for its UK exchange where British users are still unable to deposit GBP. </p><p>Cointelegraph contacted Binance for more specifics but did not receive an immediate response. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/sbf-bribe-binance-account-freeze-huobi-hacker/\">SBF’s alleged Chinese bribe, Binance clarifies account freeze: Asia Express</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-20T03:11:53.000Z",
    "title": "'He broke his word' — Ex-ConsenSys staff sue founder over employee equity deal",
    "url": "https://cointelegraph.com/news/consensys-founder-joseph-lubin-former-employee-lawsuit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/b89679ab-46d2-4ff8-9f6c-d94373498bf8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>ConsenSys founder Joseph Lubin has been named in a new lawsuit filed in New York by over two dozen former ConsenSys employees.</p>\n                    <p><p>Over two dozen former employees of Ethereum infrastructure firm ConsenSys have filed a fresh lawsuit against the firm’s founder and CEO, Joseph Lubin, over claims he diluted employee equity shares against earlier promises.</p><p>The former staff allege that Lubin — who is also a co-founder of Ethereum — breached this “no-dilution promise” made in 2015, <a href=\"https://iapps.courts.state.ny.us/nyscef/ViewDocument?docIndex=o_PLUS_Rl1RtTIENwlGHZo2yB1g==\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to the plaintiff’s Oct. 19 filing in a New York Supreme Court. </p><p>The plaintiffs allege Lubin lured in “smart and motivated” colleagues to work for ConsenSys in late 2014, claiming the firm would become the “future of cryptocurrency” and the “crypto Google.” </p><p>Around that time, Lubins allegedly stated in a document that he wouldn’t dilute employee equity shares; the plaintiffs allege he later broke that promise.</p><p>“It is my intention that the percentage ConsenSys members receive will not be diluted by additional issuance,” the document reportedly wrote.</p><p>The plaintiffs argued Lubin didn’t just break the promise but also “got rich” off it while they “got nothing.”</p><blockquote>“He broke his word [and] he violated his legal commitments and duties. While Lubin got rich, Plaintiffs got nothing.”</blockquote><p>The plaintiffs, who held shares in Swiss-based holding company ConsenSys AG — formerly ConsenSys Mesh — claim the shares were rendered “worthless” when Lubin transferred <a href=\"https://cointelegraph.com/news/consensys-metamask-snaps-interview-security\">cryptocurrency wallet MetaMask</a> and other assets to its new United States-based entity in 2020.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/c273d12a-0e36-4f1c-8002-5461c07a60dc.PNG\"  /><figcaption style=\"text-align: center;\"><em>Excerpt from the lawsuit brought by former ConsenSys employees. Source: New York Supreme Court</em></figcaption></figure><p>The plaintiffs also named investment bank JPMorgan — as one of the seven defendants — alleging it ”played a pivotal role” in negotiating the asset transfer and became a new equity holder in the new U.S. entity:</p><blockquote>“Lubin, his inner circle, and JPMorgan kept the details of the negotiations secret—Plaintiffs were left in the dark.</blockquote><p>“Lubin did not bring over many of his early employees—the Plaintiffs here—as equity holders in the new company. Instead, they continued to hold shares in the far less valuable entity that had been stripped of its assets,” the plaintiffs added.</p><h3>ConsenSys says plaintiffs claims are ‘meritless’</h3><p>Speaking to Cointelegraph, a ConsenSys spokesperson called the claims \"frivolous,\" saying the plaintiffs are now trying their luck in the U.S. legal arena after “two years of getting nowhere with their frivolous claims” in a Swiss court.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/consensys-founder-bullish-on-ethereum-following-crypto-winter-performance\"><strong><em>ConsenSys founder ‘bullish’ on Ethereum following crypto winter performance</em></strong></a></p><p>“[The] plaintiffs now believe their meritless claims stand a better chance of yielding a pay day if they game U.S. courts and entangle ConsenSys Software and other unrelated parties in litigation.” The ConsenSys representative added:</p><blockquote>“We fully expect that the plaintiffs, who were never employees of Consensys Software, will soon find this gambit is another fruitless attempt to enrich themselves from the success of others.”</blockquote><p>Despite claims that the plaintiff’s legal challenge went “nowhere” in Switzerland, the country’s High Court of Zug issued a judgment in favor of the plaintiffs.</p><p>The plaintiffs say the ruling supports their position that Lubin breached his duties.</p><p>ConsenSys was founded in October 2014, about nine months before the<a href=\"https://cointelegraph.com/learn/history-of-ethereum-blockchain\"> Ethereum blockchain launched in mid-2015.</a> </p><p>The firm develops and hosts infrastructure projects that underpins much of the Ethereum network.</p><p>The plaintiffs are seeking damages across six separate causes of action, in an amount to be determined at trial.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/joe-lubin-the-truth-about-eth-founders-split-and-crypto-google/\"><strong><em>Joe Lubin: The truth about ETH founders split and ‘Crypto Google’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-20T03:27:54.000Z",
    "title": "BlackRock Amends Spot Bitcoin ETF Filing",
    "url": "https://cryptodaily.co.uk/2023/10/blackrock-amends-spot-bitcoin-etf-filing",
    "description": "Asset manager BlackRock filed an amended prospectus for its spot Bitcoin ETF application with the US SEC."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-20T03:14:54.000Z",
    "title": "Why Are Cybersecurity Stocks Surging, and What’s Driving the Boom?",
    "url": "https://www.cryptopolitan.com/cybersecurity-stocks-surging-whats-boom/",
    "description": "In the dynamic intersection of artificial intelligence and digital security, a thrilling boom is underway in the cybersecurity stocks realm. The growing menace of high-profile cyber breaches, fueled by the sophistication of generative AI, has ignited unprecedented interest from investors and private equity firms alike. This surge comes at a time when the need for ... <a title=\"Why Are Cybersecurity Stocks Surging, and What&#8217;s Driving the Boom?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cybersecurity-stocks-surging-whats-boom/\" aria-label=\"More on Why Are Cybersecurity Stocks Surging, and What&#8217;s Driving the Boom?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-20T03:11:19.000Z",
    "title": "Bitcoin Price Hesitates, But Further Gains Seem Likely Toward $30K",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-hesitates-30k/",
    "description": "Bitcoin price is attempting a fresh increase above $28,500. BTC is eyeing another upside break toward the $30,000 resistance in the near term. Bitcoin found support near $28,150 and started a fresh increase. The price is trading above $28,500 and the 100 hourly Simple moving average. There is a key rising channel forming with resistance near $29,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could continue to rise if there is a close above the $29,000 resistance. Bitcoin Price Eyes Upside Break Bitcoin price struggled below the $29,000 level. BTC even traded below the $28,250 level before the bulls appeared. The price found support near the $28,150 zone and recently started a fresh increase. There was a move above the $28,400 and $28,500 resistance levels. The price cleared the 61.8% Fib retracement level of the downward move from the $28,980 swing high to the $28,150 low. There is also a key rising channel forming with resistance near $29,000 on the hourly chart of the BTC/USD pair. Bitcoin is now trading above $28,500 and the 100 hourly Simple moving average. It is slowly gaining pace and consolidating near the 76.4% Fib retracement level of the downward move from the $28,980 swing high to the $28,150 low. Source: BTCUSD on TradingView.com On the upside, immediate resistance is near the $28,950 level. The next key resistance could be near $29,000 and the channel region. A close above the $29,000 resistance zone could set the pace for a larger increase. The next key resistance could be $29,500. Any more gains might send BTC toward the $30,000 level, above which the bulls might aim for $31,200. Another Decline In BTC? If Bitcoin fails to rise above the $29,000 resistance zone, it could start another decline. Immediate support on the downside is near the $28,650 level. The next major support is near the $28,350 level and the 100 hourly Simple moving average. The main support is now forming near $28,150. A downside break and close below the $28,150 support might trigger more losses in the near term. The next support sits at $27,650, below which it could test $28,120. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $28,650, followed by $28,150. Major Resistance Levels – $28,950, $29,000, and $30,000."
  }
]