[
  {
    "source": "Decrypt",
    "date": "2023-12-18T22:30:56.000Z",
    "title": "Solana Game 'Aurory' Suffers $830K Exploit, Disables Arbitrum Bridge",
    "url": "https://decrypt.co/210153/solana-game-aurory-suffers-830k-exploit-disables-arbitrum-bridge",
    "description": "An exploit on Aurory's marketplace led to one user siphoning about 600,000 AURY tokens. The game's bridge is down while devs work on a fix."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-18T22:19:35.000Z",
    "title": " US court approves settlement against Binance, paying $2.7B to CFTC ",
    "url": "https://cointelegraph.com/news/binance-cz-cftc-settlement-court-order-pay-penalty",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMTJjNjUyZTktNTA5Mi00Yzk5LWJkNjUtNDJjZWQxZWVjOTI4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Former Binance CEO Changpeng \"CZ\" Zhao has been ordered to pay $150 million while Binance will pay $2.7 billion to conclude the CFTC enforcement action.  </p>\n                    <p><p>A United States court has entered an order against crypto exchange Binance and its former CEO Changpeng \"CZ” Zhao, which will see Binance pay $2.7 billion and CZ pay $150 million to the Commodities Futures and Trading Commission (CFTC). </p><p>In a Dec. 18 <a href=\"https://www.cftc.gov/PressRoom/PressReleases/8837-23\" target=\"_blank\" rel=\"noopener nofollow\">statement</a>, the CFTC announced that the U.S. District Court for the Northern District of Illinois had approved the previously announced settlement and concluded the enforcement action first issued by the CFTC in November. </p><p>\"In formalizing the settlement initially announced on November 21 the court finds Zhao and Binance violated the Commodity Exchange Act (CEA) and CFTC regulations, imposes a $150 million civil monetary penalty personally against Zhao, and requires Binance to disgorge $1.35 billion of ill-gotten transaction fees and pay a $1.35 billion penalty to the CFTC,\" wrote the CFTC in a statement. </p><p><a href=\"https://cointelegraph.com/news/binance-cz-cftc-settlement-court-order-pay-penalty\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-18T22:12:02.000Z",
    "title": "Fuse Network to Launch ZK-Powered Layer-2 Using Polygon CDK",
    "url": "https://cryptodaily.co.uk/2023/12/fuse-network-to-launch-zk-powered-layer-2-using-polygon-cdk",
    "description": "Tel Aviv, Israel – In a groundbreaking collaboration, Fuse Network, a leading Layer-1 blockchain player specializing in scaling Web3 payments, has teamed up with Polygon Labs,"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T22:37:39.000Z",
    "title": "Avalanche users spend $13.8 million in transaction fees on inscriptions in 5 days",
    "url": "https://www.cryptopolitan.com/avalanche-spend-13-8-m-transaction-fees/",
    "description": "In the last five days, users on the Avalanche blockchain have collectively paid $13.8 million in transaction fees for the creation and movement of tokens and NFTs using inscription-based technology. These unique tokens are generated by incorporating text into standard blockchain transactions, utilizing an off-chain numbering system for tracking. The popularity of inscriptions has surged [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T22:37:24.000Z",
    "title": "Ex-Ethereum developer claims 70% of ETH was pre-mined",
    "url": "https://www.cryptopolitan.com/ex-ethereum-developer-claims-70-of-eth/",
    "description": "Lane Rettig, a former core developer for Ethereum, has recently raised serious allegations about the distribution of Ethereum&#8217;s native cryptocurrency, ETH. In a statement that garnered significant attention from the crypto community, Rettig claimed that approximately 70% of all ETH was distributed during the project&#8217;s pre-mine phase. This figure has decreased to about 60% in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T22:15:14.000Z",
    "title": "Grayscale predicts a $30 trillion Bitcoin boom on the horizon",
    "url": "https://www.cryptopolitan.com/grayscale-predicts-30-trillion-bitcoin-boom/",
    "description": "In an era marked by rapid digital transformation, the cryptocurrency sector is poised for an unprecedented leap, with Grayscale, a leading digital asset management firm, at the forefront of this charge. Grayscale CEO Michael Sonnenshein, in a recent conversation with CNBC, has shed light on the immense potential that a Spot Bitcoin ETF approval could [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-18T22:19:45.000Z",
    "title": "Bitcoin Faces Decline Below $41,000 Price Level Mark Amid Hash Rate Surge",
    "url": "https://nulltx.com/bitcoin-faces-decline-below-41000-price-level-mark-amid-hash-rate-surge/",
    "description": "Bitcoin ($BTC) has encountered a noticeable setback in its growth trajectory over the past month, raising concerns about the sustainability of its recent climb to $44,000. Based on Ali&#8217;s chart on X, Bitcoin&#8217;s price has dipped below a critical supply zone, ranging from $41,200 to $42,400. Within this range, 1.87 [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-18T22:30:51.000Z",
    "title": "Key Factors That Bitcoin Needs To Keep Bullish Momentum",
    "url": "https://www.newsbtc.com/news/bitcoin/key-factor-that-bitcoin-needs-for-continued-price-rally/",
    "description": "Amid the bearish impression circling the cryptocurrency market lately, a prominent crypto analyst has revealed a recent trend for Bitcoin (BTC), which will help bolster the continuation of its price rally. What Bitcoin Needs To Sustain And Expand Its Rally A cryptocurrency analyst known as Ali recently shared this crucial information with the entire cryptocurrency community on December 18, 2023. The analyst took to X (formerly Twitter) to highlight what Bitcoin needs to maintain its upward trajectory. Ali said the crypto asset experienced a dip in network growth over the past month, which raised concerns about the stability of BTC&#8217;s recent price move to $44,000. He added that creating new Bitcoin addresses must expand to guarantee a robust continuation of its rally. This will provide the much-needed support for the crypto asset to maintain its bullish momentum.  The post read: There&#8217;s been a noticeable dip in #Bitcoin network growth over the past month, casting doubt on the sustainability of $BTC&#8217;s recent move to $44,000. For a robust continuation of the bull rally, it&#8217;s crucial to see an uptick in the number of new $BTC addresses. This would provide the needed support for sustained bullish momentum. BTC needs further investor and institutional support to sustain its rally. A chart accompanied the crypto analyst&#8217;s X post to support his projection further. This prediction means further corrections may be a scenario for the digital asset. This is because of the discrepancy between the creation of new addresses and the current price increase of Bitcoin. Nonetheless, approving a Bitcoin Spot exchange-traded fund (ETF) in the US might create an avenue for more institutional investment, thereby reversing this trend. As of the time of writing, BTC was trading at $40,980, indicating a decrease of over 2% in the past 24 hours. According to CoinMarketCap, its market capitalization decreased by the same percentage in the past 24 hours. Digital asset prices have increased by 146% in the last year, demonstrating amazing growth throughout this timeframe. Its performance over the same year exceeded 73% of the leading 100 crypto assets, putting it among the top performers. The Crypto Asset Fell Below Its Crucial Supply Area Ali has also shared another post on X showing that Bitcoin has witnessed a dip below its key supply zone. The analyst pointed out that the zone ranges from $41,200 to $42,400, of which the asset has recently fallen below this range. He added that 1.87 million addresses in this region have accumulated about 730,000 BTC. With this decline, these holders may sell the token to reduce losses. The crypto analyst also highlighted a potential decline to the next demand zone ranging from $37,500 to $38,700. Meanwhile, about 1,28 million addresses in this region have accumulated 553,000 BTC tokens. Featured image from iStock, chart by Tradingview.com"
  }
]