[
  {
    "source": "Crypto Daily",
    "date": "2023-06-30T06:00:00.000Z",
    "title": "Ledger Launches Institutional Crypto Trading Platform",
    "url": "https://cryptodaily.co.uk/2023/06/ledger-launches-institutional-crypto-trading-platform",
    "description": "<p class=\"md-end-block md-p\">Prominent crypto wallet service provider, Ledger, has announced its latest venture into the world of institutional trading technology.</p>\n<p class=\"md-end-block md-p\">Dubbed \"Tradelink,\" this new trading and settlement network technology is set to revolutionize the landscape for asset managers, custodians, and exchanges/OTC. Aiming to streamline operations and boost efficiency, Tradelink will allow trading on multiple exchanges without the need for on-chain liquidity re-balancing.</p>\n<p class=\"md-end-block md-p\">This will ensure that users maintain custodial ownership of assets while engaging in off-exchange trading. Additionally, Tradelink seeks to mitigate trading collateral risks across various third-party platforms, offer easy integration with preferred counter-parties, and significantly reduce transaction fees.</p>\n<p class=\"md-end-block md-p\">The company&rsquo;s official announcement stated:</p>\n\n<p class=\"md-end-block md-p\">\"Today, we are proud to announce that Ledger is entering the institutional trading technology market with the first open network to enable custodial trading via exchange and custodial partners. This solution will provide unparalleled control, security, flexibility, and transparent governance over an enterprise&rsquo;s digital asset trading.\"</p>\n\n<p class=\"md-end-block md-p\">Ledger's VP of Enterprise Revenue, Sebastien Badault, emphasizes how Tradelink will empower users, asserting:</p>\n\n<p class=\"md-end-block md-p\">&ldquo;By unlocking better trading options for enterprises, we are empowering asset managers, custodians, and exchanges to navigate the changing landscape with confidence while making the whole ecosystem a safer and more transparent place.&rdquo;</p>\n\n<p class=\"md-end-block md-p\">At launch, Tradelink will be accessible to all Ledger Enterprise clients at no additional cost. Initial partners will include well-known asset managers such as Laser Digital and Hodl Group, digital asset trading and orchestration platforms like Wyden, and platform partners including Crypto.com, Bitstamp, Huobi, and more.</p>\n<p class=\"md-end-block md-p\">The launch of Tradelink comes after Ledger's recent controversial update, which raised security concerns among its users. However, the company remains undeterred and has just closed a $109 Million Series C extension fundraising round, pushing its valuation to $1.4 billion.</p>\n<p class=\"md-end-block md-p\">Badault further elaborates on the company's vision for Tradelink:</p>\n\n<p class=\"md-end-block md-p\">&ldquo;We are creating a future-proof solution that will give Ledger Enterprise customers flexibility and security allowing institutions to de-risk their businesses. For almost a decade, Ledger has been building security and governance solutions for the crypto ecosystem. It is this core security foundation that can now be used to reduce counterparty risk and enable custodial trading for institutional investors.&rdquo;</p>\n\n<p class=\"md-end-block md-p\">Ledger&rsquo;s innovative Trading Operation technology, coupled with its commitment to transparency and regulatory compliance, positions the company at the forefront of an increasingly evolving market, navigating the ever-changing regulatory and overall market landscape with confidence.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-30T06:00:19.000Z",
    "title": "Presidential Candidate Javier Milei Claims He Has the Funds to Dollarize Argentina",
    "url": "https://news.bitcoin.com/presidential-candidate-javier-milei-claims-he-has-the-funds-to-dollarize-argentina/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1121838566-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Presidential Candidate Javier Milei Claims He Has the Funds to Dollarize Argentina\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1121838566-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1121838566-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1121838566-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1121838566-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1121838566-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1121838566-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1121838566.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Javier Milei, a liberal presidential candidate in Argentina, stated recently that he has the funds needed for the dollarization of the country at the current market prices. Milei noted that his team had signed an NDA (non-disclosure agreement) with unknown third parties that would provide the liquidity needed to close the Central Bank of Argentina. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T05:46:50.000Z",
    "title": "Coinbase’s Base layer-2 network gears up for mainnet launch, strengthened by rigorous security audits",
    "url": "https://www.cryptopolitan.com/coinbases-base-layer-2-network-ready-launch/",
    "description": "Base, the layer 2 blockchain developed by Nasdaq-listed crypto exchange Coinbase (COIN), has completed a series of security audits as it prepares to launch its mainnet with the goal of attracting up to 1 million new crypto users in the coming years. The team announced on June 29 that the Optimism-powered, Ethereum-secured network had undergone ... <a title=\"Coinbase&#8217;s Base layer-2 network gears up for mainnet launch, strengthened by rigorous security audits\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbases-base-layer-2-network-ready-launch/\" aria-label=\"More on Coinbase&#8217;s Base layer-2 network gears up for mainnet launch, strengthened by rigorous security audits\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-30T06:00:10.000Z",
    "title": "Stellar XLM vs. Tradecurve which coin will hit $1 first and why",
    "url": "https://www.crypto-news-flash.com/stellar-xlm-vs-tradecurve-which-coin-will-hit-1-first-and-why/?utm_source=rss&utm_medium=rss&utm_campaign=stellar-xlm-vs-tradecurve-which-coin-will-hit-1-first-and-why",
    "description": "The cryptocurrency sector is filled with many profit-making chances, and two coins that have recently caught the attention of many investors are Stellar and Tradecurve.  Both coins have promising potential, and traders are eager to determine which will reach the coveted milestone of $1 first. Today, we will explore the factors influencing the price movements [...]"
  }
]