[
  {
    "source": "Cryptopolitan",
    "date": "2024-01-20T21:27:18.000Z",
    "title": "Mark Scott faces a possible 17-year sentence for OneCoin money laundering",
    "url": "https://www.cryptopolitan.com/mark-scott-faces-a-possible-17-year-sentence/",
    "description": "In a recent development, Mark Scott, a lawyer convicted of money laundering through the infamous OneCoin cryptocurrency scheme, is facing the possibility of a substantial prison sentence. The United States Attorney&#8217;s Office has recommended a minimum 17-year prison term, while Scott&#8217;s legal team proposed a considerably shorter five-year sentence.&#160; This divergence in sentencing proposals underscores [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-20T21:21:47.000Z",
    "title": "Options trading for Bitcoin ETFs may begin by the end of February; the SEC acknowledges proposals",
    "url": "https://www.cryptopolitan.com/options-trading-for-bitcoin-etfs-may-begin/",
    "description": "In a significant development for the cryptocurrency market, options trading for Bitcoin exchange-traded funds (ETFs) could potentially commence as early as the end of February, as confirmed by an analyst.&#160; On January 19, the United States Securities and Exchange Commission (SEC) officially acknowledged the proposals put forth by Nasdaq and the Cboe to introduce options [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-20T21:18:14.000Z",
    "title": "UK economy: Is the soft landing still in sight?",
    "url": "https://www.cryptopolitan.com/uk-economy-is-soft-landing-still-in-sight/",
    "description": "As we navigate through the choppy waters of economic forecasts and data releases, the UK&#8217;s economic landscape appears more like a rollercoaster than a serene glide. The much-anticipated soft landing of the UK economy, which seemed almost within reach, now faces fresh turbulence. With recent figures introducing a twist in the tale, we&#8217;re left wondering [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-20T21:18:27.000Z",
    "title": "Pastor dupes investors out of $1.3m in crypto-selling scam",
    "url": "https://crypto.news/crypto-scam-pastor-collect-over-million-investors/",
    "description": "The Denver-based pastor, who runs an online-only church called Victorious Grace Church, allegedly sold worthless INDXcoin crypto, and made away with a huge chunk of the proceeds."
  }
]