[
  {
    "source": "CoinDesk",
    "date": "2023-07-20T10:55:39.000Z",
    "title": "Chainlink’s LINK Climbs as Whales Add to Holdings Following Protocol Release",
    "url": "https://www.coindesk.com/markets/2023/07/20/chainlinks-link-climbs-as-whales-add-to-holdings-following-protocol-release/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The CCIP protocol is designed to help build cross-chain applications and services and went live for early access users on the Avalanche, Ethereum, Optimism and Polygon blockchains this week."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-20T10:52:46.000Z",
    "title": "Myanmar Shadow Government to Start Neobank With Crypto Rails to Fund Fight Against Military Junta",
    "url": "https://www.coindesk.com/policy/2023/07/20/myanmar-shadow-govt-to-start-neobank-with-crypto-rails-to-fund-fight-against-military-junta/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The National Unity Government bank is set to run on Polygon and do currency swaps via Uniswap v3 pools and USDT stablecoins."
  },
  {
    "source": "CoinDesk",
    "date": "2023-07-20T10:43:53.000Z",
    "title": "UK Government Rejects Lawmaker Plan to Regulate Crypto as Gambling",
    "url": "https://www.coindesk.com/policy/2023/07/20/uk-government-rejects-lawmaker-plan-to-regulate-crypto-as-gambling/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Treasury says it has learned lessons from FTX's collapse, and that gambling law doesn’t deal with crypto risks."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-20T11:07:08.000Z",
    "title": "Kuwait applies blanket ban to crypto",
    "url": "https://cryptodaily.co.uk/2023/07/kuwait-applies-blanket-ban-to-crypto",
    "description": "<p>Citing a recommendation by the Financial Assets Task Force (FATF), the Kuwaiti authorities have promulgated bans across a range of crypto activities.</p>\n<p>According to the Kuwaiti Capital Markets Authority, in a circular published on Monday, it has banned all crypto-related activities by companies, it has placed an absolute ban on all digital asset mining, and, into the bargain, has prohibited that crypto be recognised as a decentralised currency.</p>\n<p>The only exception to this are securities regulated by the central bank, or the Capital Markets Authority.&nbsp;</p>\n\n<p>\"Securities regulated by the Central Bank of Kuwait and other securities and financial instruments regulated by the Capital Markets Authority are excluded from this prohibition,\"</p>\n\n<p>The Kuwaiti anti-crypto actions were purportedly taken in order to come into line with recommendations from the Financial Action Task Force (FATF), a global financial organisation that is obliging nation states to come into compliance for what it sees as anti money-laundering (AML) and terrorist financing threats.</p>\n<p>However, according to an article on Coindesk, the FATF has not asked countries to ban crypto. Be that as it may, this regulator holds much power, and not complying with its &lsquo;recommendations&rsquo; can land a country onto the FATF blacklist.</p>\nOpinion\n<p>Some might argue that the FATF&rsquo;s recommendations do more harm than good from an economic perspective. There are cases where banks pull out of lending to countries in poorer regions of the world because they fear the fines they can incur from the added difficulty of being able to adequately identify customers.&nbsp;</p>\n<p>Also, the cost of running the organisation should be measured against the costs of the illegal activity it is purportedly stopping. AML has now entered into almost every financial activity that a government can make, and the costs of compliance that all companies have to endure just to be able to go about their business can be a reason for concern.</p>\n<p>In Springer Link, under &ldquo;Crime, Law and Social Change&rdquo; author Mark. T. Nance goes into a deep dive on the FATF. In the introduction he asks the question as to how there can be an increase in illicit money at the same time as the &ldquo;global governance regime&rdquo; is getting bigger to fight it.</p>\n<p>He looks at the expert detractors of the FATF, and what they say makes interesting reading:</p>\n\n<p>&ldquo;Detractors portray FATF as a faceless, unaccountable, de facto global regulatory agency run amok. On behalf of the interests of a few select states, it imposes regulations that are illegitimate and costly. For these critics, the Panama Papers are evidence that the rules are ineffective, to boot.&rdquo;</p>\n\n<p>Banning an emerging technology in order to become compliant with an agency controlled by certain countries, with their own interests in mind is certainly a difficult call for Kuwait to make. Emerging technology has never been suppressed for long, therefore Kuwait may eventually see fit to reverse its decision.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T11:07:06.000Z",
    "title": "Tensions rise as Meta distances itself from news publishers",
    "url": "https://www.cryptopolitan.com/meta-distances-itself-from-news-publishers/",
    "description": "Tensions are escalating as Meta, the parent company of Facebook, Whatsapp, Threads, and Instagram grows increasingly distant from news publishers, sparking widespread concern. This move comes amidst a shift in strategy where the technology titan has been giving less attention to politics and current affairs on its platforms, while simultaneously shrugging off governmental calls for ... <a title=\"Tensions rise as Meta distances itself from news publishers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/meta-distances-itself-from-news-publishers/\" aria-label=\"More on Tensions rise as Meta distances itself from news publishers\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T11:01:00.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T11:00:20.000Z",
    "title": "China’s stern warning to the US over chip restrictions",
    "url": "https://www.cryptopolitan.com/chinas-stern-warning-to-the-us/",
    "description": "With rising tensions regarding technology and trade between the United States and China, the latter has sent a clear message to Washington, cautioning against restrictive measures. In the face of growing US scrutiny over foreign investments, particularly in the tech sector, China is prepared to counteract any national security measures levied against it. Ambassador Xie ... <a title=\"China&#8217;s stern warning to the US over chip restrictions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chinas-stern-warning-to-the-us/\" aria-label=\"More on China&#8217;s stern warning to the US over chip restrictions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T10:56:51.000Z",
    "title": "France and UK in Close Race to Lead Europe’s AI Revolution",
    "url": "https://www.cryptopolitan.com/france-and-uk-trace-to-lead-ai-revolution/",
    "description": "In the global race to dominate the artificial intelligence (AI) revolution, governments worldwide strive to position themselves at the forefront. Old rivals France and the United Kingdom are vying for prime positions in Europe&#8217;s AI landscape. With significant investments and strategic plans, both countries are determined to lead the way in AI development and regulation. ... <a title=\"France and UK in Close Race to Lead Europe&#8217;s AI Revolution\" class=\"read-more\" href=\"https://www.cryptopolitan.com/france-and-uk-trace-to-lead-ai-revolution/\" aria-label=\"More on France and UK in Close Race to Lead Europe&#8217;s AI Revolution\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T10:46:29.000Z",
    "title": "Tesla holds Bitcoin holdings in Q2 as earnings exceed expectations",
    "url": "https://www.cryptopolitan.com/tesla-holds-bitcoin-holdings-in-q2-as-earnings-exceed-expectations/",
    "description": "In an earnings release on Wednesday after the market close, electric vehicle giant Tesla (TSLA) confirmed that there was no change in their Bitcoin holdings for the fourth consecutive quarter. The net value of the company&#8217;s digital assets remained steady at $184 million, irrespective of Bitcoin&#8217;s market fluctuations. The Bitcoin roller coaster ride Tesla, under ... <a title=\"Tesla holds Bitcoin holdings in Q2 as earnings exceed expectations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tesla-holds-bitcoin-holdings-in-q2-as-earnings-exceed-expectations/\" aria-label=\"More on Tesla holds Bitcoin holdings in Q2 as earnings exceed expectations\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-20T11:00:00.000Z",
    "title": "Ripple wins case against SEC, InQubeta presale raises over $1.5 million",
    "url": "https://crypto.news/ripple-wins-case-against-sec-inqubeta-presale-raises-over-1-5-million/",
    "description": "InQubeta has so far raised over $1.5 million and rising amid XRP's 75% after recent ruling on the Ripple-SEC case"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-20T11:00:33.000Z",
    "title": "2.4 Trillion SHIB Moved To Unknown Wallet: Bullish Wave Ahead For Shiba Inu?",
    "url": "https://www.newsbtc.com/shiba-inu/shib-moved-to-wallet-bullish-wave-ahead-for-shiba-inu/",
    "description": "Earlier today, a massive trove of SHIB tokens was relocated from Binance.US, the American subsidiary of the world&#8217;s largest crypto exchange, Binance. These tokens, amounting to roughly 2.4 trillion according to WhaleAlert, have been transferred to an unknown wallet. 🚨 2,416,836,656,676 #SHIB (18,771,570 USD) transferred from #BinanceUS to unknown wallethttps://t.co/8ujqIZ5C5i — Whale Alert (@whale_alert) July 19, 2023 This movement of SHIB tokens is particularly noteworthy as this comes amid the anticipation which is running high as Shytoshi Kusama, the lead developer of Shiba Inu, hinted at the upcoming release of Shibarium mainnet and Worldpaper in August. Whale Alert Triggers Market Speculation According to Whale Alert, the blockchain tracking and analytics provider, the wallet transfer from Binance.US to an unknown wallet comprised approximately 2,416,836,656,676 SHIB tokens, which, at the time of transfer, were worth around $18.77 million. Related Reading: Shibarium Reaches New Milestones As Anticipation Builds For Mainnet Launch Though this transaction could be interpreted as a positive sign, suggesting that &#8216;whales&#8217;, or large-scale investors, are acquiring and hoarding SHIB tokens by moving their SHIB asset to an unknown, privately-held wallet, signaling their intent to hold for an extended period. However, a deep dive into Etherscan data also shows that Binance.US has since been shuffling tokens to a fresh wallet address identified as 0x058A over the past couple of days. This wallet, interestingly, now holds a mix of 69 different tokens collectively valued at $72.62 million. Regardless, the Shiba Inu community is abuzz with chatter about this monumental transfer. Many community members have speculated that this activity may be linked to the upcoming launch of Shibarium, further stoking the anticipation for August&#8217;s much-awaited release. Bullish Wave Ahead For SHIB While it&#8217;s still unclear what the whale&#8217;s aim behind this move is all about, given the fundamental metrics, Shiba Inu might actually be closer to a bullish wave. Shiba Inu Lead Developer, Shytoshi Kusama, announced earlier this month, the Shiba Inu Ecosystem will be the title sponsor for the Blockchain Futurist Conference, Eth Toronto, and Eth Women &#8211; events to take place in Toronto in August where the team could launch Shibarium. These events could serve as a catalyst that ushers in another rally for the meme coin. Related Reading: Breaking: Shiba Inu Lead Dev Reveals Shibarium Release Date, SHIB Up 3% Meanwhile, over the past week, SHIB has been performing quite well. The meme coin has managed to breach several resistance levels and currently trades at $0.00000782, marking a nearly 5% uptick over the previous week. SHIB&#8217;s market capitalization currently stands at $4.6 billion, which elevates it to the 16th spot in the ranking of cryptocurrencies by market cap. Adding to this bullish narrative, SHIB&#8217;s trading volume has also seen a considerable boost in the past seven days, soaring from $74.4 million to $87 million in the last 24 hours. This positive momentum is partly due to the broader crypto market trend, led by Bitcoin&#8217;s recent rally. Featured image from Shutterstock, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-20T10:58:00.000Z",
    "title": "Litecoin Price Faces Volatility as Halving Event Nears – Can LTC Reach $300? Are These Profits Realistic?",
    "url": "https://www.crypto-news-flash.com/litecoin-price-faces-volatility-as-halving-event-nears-can-ltc-reach-300-are-these-profits-realistic/?utm_source=rss&utm_medium=rss&utm_campaign=litecoin-price-faces-volatility-as-halving-event-nears-can-ltc-reach-300-are-these-profits-realistic",
    "description": "<img width=\"1000\" height=\"667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-2-Litecoin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-2-Litecoin.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-2-Litecoin-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-2-Litecoin-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-2-Litecoin-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Litecoin appears to have a bullish sentiment, but is struggling to regain its losses ahead of the LTC halving.  Whales have been accumulating the asset aggressively but have had little impact on the price.  The much-anticipated Litecoin halving is less than two weeks away but the asset is still hovering below the price curve against [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-20T11:01:47.000Z",
    "title": "Symbiosis Expands Multi-Chain Liquidity Possibilities with Linea Network Integration",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/symbiosis-expands-multi-chain-liquidity-possibilities-with-linea-network-integration/",
    "description": "<p>Symbiosis, the leading multi-chain liquidity protocol, is thrilled to announce the addition of Linea network support, further enhancing its capabilities. This exciting development enables Symbiosis users to seamlessly perform token swaps not only across different blockchain networks. But also on Linea, the groundbreaking zkEVM rollup network developed by Consensys. Introducing Linea: Empowering the Ethereum Ecosystem [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/symbiosis-expands-multi-chain-liquidity-possibilities-with-linea-network-integration/\">Symbiosis Expands Multi-Chain Liquidity Possibilities with Linea Network Integration</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]