[
  {
    "source": "Decrypt",
    "date": "2023-09-06T18:37:07.000Z",
    "title": "Ice Cold: Feds Freeze Celsius Founder Alex Mashinsky's Assets",
    "url": "https://decrypt.co/155163/feds-freeze-former-celsius-ceo-alex-mashinskys-assets",
    "description": "The alleged conman is facing a number of criminal and civil charges following the collapse of Celsius last year. "
  },
  {
    "source": "Decrypt",
    "date": "2023-09-06T18:14:19.000Z",
    "title": "Google Changes Policy to Allow NFT Game Ads—With Some Limits",
    "url": "https://decrypt.co/155185/google-changes-policy-allow-nft-game-ads-some-limits",
    "description": "Google's updated advertising policy permits NFT games, but titles that offer wagering or staking require a gambling certification."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-06T18:12:51.000Z",
    "title": "Visa Payments Will Rely on 'Multiple Blockchains', Says Head of Crypto",
    "url": "https://decrypt.co/155182/visa-payments-will-rely-on-multiple-blockchains-says-head-of-crypto",
    "description": "Cuy Sheffield’s post referenced skepticism attached to an early internet, when slow, chirping modems were the norm."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-06T18:30:00.000Z",
    "title": "Financial privacy and regulation can co-exist with ZK-proofs — Vitalik Buterin",
    "url": "https://cointelegraph.com/news/financial-privacy-regulation-can-coexist-zk-proofs-vitalik-buterin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/6eebbfff-5276-46c6-8ae4-cb0415c7a332.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A new paper co-authored by Ethereum's Vitalik Buterin highlights the use of zero-knowledge proofs as a tool for regulatory compliance and on-chain privacy.  </p>\n                    <p><p>Ethereum co-founder Vitalik Buterin has <a href=\"https://deliverypdf.ssrn.com/delivery.php?ID=969069125111078029031068102121110124096013037044021004025108064026065123018009122072011019010100011037017031075100090028099113024072012082004016106121094091119021028064037045092111072011106026086124112064010106076066111071000108124116001087115026089095&amp;EXT=pdf&amp;INDEX=TRUE\" target=\"_blank\" rel=\"noopener nofollow\">published</a> a research paper diving into privacy pools systems as a tool to achieve more privacy in financial transactions, allowing users to prove dissociation from illicit funds through zero-knowledge proof technology.</p><p>The document initially discusses one of the most popular privacy-enhancing protocols, Tornado Cash, which allows users to deposit and withdraw cryptocurrencies without creating an identifiable link between the two addresses. Recently, United States authorities<a href=\"https://cointelegraph.com/news/tornado-cash-co-founders-charged-with-money-laundering-sanctions-violations-ofac\"> filed criminal charges against its founders,</a> alleging extensive use by bad actors.</p><p>\"The critical issue with Tornado Cash was essentially that legitimate users had limited options to dissociate from the criminal activity the protocol attracted,\" reads the paper co-authored by Jacob Illum, Matthias Nadler, Fabian Schar and Ameen Soleimani. </p><p>The analysis then elaborates on an extension of Tornado Cash's approach that would enable users to publicly prove the source of funds on-chain by allowing membership proofs — “I prove that my withdrawal comes from one of these deposits” — and exclusion proofs — “I prove that my withdrawal does not come from one of these deposits.\" </p><p>According to the authors, the concept could provide a balance between honest and dishonest protocol users, potentially enabling financial compliance on-chain in the future:</p><blockquote>\"The core idea of the proposal is to allow users to publish a zero-knowledge proof, demonstrating that their funds (do not) originate from known (un-)lawful sources, without publicly revealing their entire transaction graph. This is achieved by proving membership in custom association sets that satisfy certain properties, required by regulation or social consensus.\"</blockquote><p>With Privacy Pools, users can exclude themselves from anonymity sets that include addresses related to illegal activities based on zero-knowledge proofs — a method of proving a statement without disclosing the statement's details.</p><p>The underlying idea presented in the document asserts that instead of simply using zero-knowledge to prove that a \"withdrawal is linked to some previously-made deposit, a user proves membership in a more restrictive association set.\" </p><p>The association set can include all previously made deposits, only the user's own deposits, or anything in between. As a public input, the user specifies the set by providing its Merkle root. \"For simplicity, we do not directly prove that the association set actually is a subset of the previously-made deposits; instead, we just require the user to zero-knowledge-prove two Merkle branches.\"   </p><p>To illustrate it in a law enforcement context, the authors provide a simple example:        </p><blockquote>\"Suppose that we have five users: Alice, Bob, Carl, David and Eve. The first four are honest, law-abiding users who nevertheless want to preserve their privacy, but Eve is a thief. Suppose also that this is publicly known.\"</blockquote><p>In the example, when one of the users wants to withdraw funds, they can specify which association set they want, meaning they are incentivized to make their association sets larger to safeguard privacy. However, to avoid their funds from being perceived as suspicious by merchants or exchanges, the users do not include Eve in their association set. Eve, however, cannot exclude her own deposit, and will be forced to make an association set equal to the set of all five deposits. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/b1d2bf8c-7fc4-4994-bd5a-87ca4d5613c8.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Visual representation of participants’ association set selection. Source: Vitalik Buterin, JacobI llum, Matthias Nadler, Fabian Schar, Ameen Soleimani.</em></figcaption></figure><blockquote>\"[...] we assume that Alice, Bob, Carl and David include all other “good” deposits in their respective association sets and exclude deposit 5, that originates from a known illicit source. Eve, on the other hand, cannot create a proof that disassociates her withdrawal from her own deposit.\" </blockquote><p>According to the authors, the example illustrates one possibility for the use of association sets in privacy pools protocols. \"Note, that the system does not rely on altruism on Alice, Bob, Carl and David’s part; they have a clear incentive to prove their disassociation.\" </p><p>The paper further offers several other use cases of zero-knowledge-proof for users to demonstrate that funds are not tied to illicit sources or to prove that funds originate from a specific set of deposits without revealing any further information. </p><blockquote>\"In many cases, privacy and regulatory compliance are perceived as incompatible. This paper suggests that this does not necessarily have to be the case, if the privacy-enhancing protocol enables its users to prove certain properties regarding the origin of their funds.\" </blockquote><p>Protocols working on zero-knowledge solutions are on the rise, with the Ethereum network<a href=\"https://cointelegraph.com/news/ethereum-scaling-protocols-drive-zero-knowledge-proof-use-2023\"> dominating major launches</a>, according to a recent research. The findings point out that scaling zk-proof solutions are set to experience the highest growth in the coming 12 months, as global regulations evolve and users seek to protect their privacy. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/recursive-inscriptions-bitcoin-supercomputer-defi-aws-possible/\"><strong><em>Recursive inscriptions — Bitcoin ‘supercomputer’ and BTC DeFi coming soon</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-06T18:29:33.000Z",
    "title": "Tornado Cash co-founder pleads not guilty to all charges: Report",
    "url": "https://cointelegraph.com/news/tornado-cash-cofounder-pleads-not-guilty",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/36ac44f7-9a13-481c-b400-a7025104bade.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Roman Storm, facing charges related to his role in helping create crypto mixer Tornado Cash, has been free on bail following his arrest by U.S. authorities in August.</p>\n                    <p><p>Roman Storm, the co-founder of controversial cryptocurrency mixer Tornado Cash arrested in August, has reportedly pleaded not guilty to all charges related to money laundering and violations of United States sanctions.</p><p>According to an Sept. 6 X thread from Inner City Press, Storm <a href=\"https://twitter.com/innercitypress/status/1699448941014610375\" target=\"_blank\" rel=\"noopener nofollow\">pleaded</a> not guilty before a judge in U.S. District Court for the Southern District of New York. He, along with his alleged co-conspirator Roman Semenov, have been charged with conspiracy to commit money laundering, conspiracy to commit sanctions violations and conspiracy to operate an unlicensed money-transmitting business.</p><p>The charges were centered around Tornado Cash allegedly facilitating the efforts of the North Korean <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/lazarus-group\">Lazarus Group</a> bypassing U.S. sanctions, allowing the country’s regime to reportedly fund its nuclear program. Storm was <a href=\"https://cointelegraph.com/news/tornado-cash-arrested-tornado-cash-developer-released-on-bail\">released on a $2-million bond</a> shortly after his arrest and is largely restricted from traveling outside certain regions of New York, New Jersey, Washington, and California.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Kraken Blog",
    "date": "2023-09-06T18:37:48.000Z",
    "title": "Now live: Price Alerts on Kraken Pro",
    "url": "https://blog.kraken.com/product/now-live-price-alerts-on-kraken-pro",
    "description": "Greetings, Pro traders! We&#8217;re thrilled to introduce Price Alert, which are now live for all Kraken spot and futures markets. Now, you can easily be notified for live price changes, whether you&#8217;re using Kraken Pro in the browser, or on the go with our mobile app. Set A Price Alert on Kraken Pro Price Alerts [&#8230;]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-06T18:15:00.000Z",
    "title": "Blockchain in Gaming Unwelcome: “Gamers Don’t Like NFTs in Their Games”",
    "url": "https://coinedition.com/blockchain-in-gaming-unwelcome-gamers-dont-like-nfts-in-their-games/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/How-Does-Consensus-Algorithm-Work-in-Blockchain-Network.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Blockchain in Gaming Unwelcome: “Gamers Don&#039;t Like NFTs in Their Games”\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/How-Does-Consensus-Algorithm-Work-in-Blockchain-Network.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/How-Does-Consensus-Algorithm-Work-in-Blockchain-Network-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/How-Does-Consensus-Algorithm-Work-in-Blockchain-Network-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/How-Does-Consensus-Algorithm-Work-in-Blockchain-Network-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Esports tech firm eFuse halts Creator League due to blockchain controversy. The VP of Engineering apologizes for the lack of disclosure on blockchain use. Critics express concerns that Community Passes resemble NFTs. Esports tech firm eFuse has temporarily halted its newly launched Creator League following controversy surrounding its use of blockchain technology. A prominent crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/blockchain-in-gaming-unwelcome-gamers-dont-like-nfts-in-their-games/\">Blockchain in Gaming Unwelcome: “Gamers Don&#8217;t Like NFTs in Their Games”</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]