[
  {
    "source": "CoinDesk",
    "date": "2024-03-21T13:00:00.000Z",
    "title": "French Energy Giant EDF Subsidiary Becomes Chiliz Blockchain Validator",
    "url": "https://www.coindesk.com/business/2024/03/21/french-energy-giant-edf-subsidiary-becomes-chiliz-blockchain-validator/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Exaion helps industries with digital transformation related to cloud and blockchain with a focus on addressing energy efficiency of data centers."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-21T13:00:33.000Z",
    "title": "Protocol Village: Fluence's 'Cloudless Platform' Goes Live as Alternative to AWS, Google Cloud",
    "url": "https://www.coindesk.com/tech/2024/03/20/protocol-village/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of March 21-26."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-21T13:01:02.000Z",
    "title": "Immutable's Mobile Ethereum RPG 'Guild of Guardians' Releasing in May",
    "url": "https://decrypt.co/222736/immutable-mobile-ethereum-rpg-guild-guardians-may",
    "description": "Launching on Immutable zkEVM, Guild of Guardians is a crypto role-playing game for iOS and Android. And it’s nearly here."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-21T13:03:00.000Z",
    "title": " Greens’ push to end German cryptocurrency tax exemption sparks debate ",
    "url": "https://cointelegraph.com/news/greens-germany-cryptocurrency-tax-politics",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMzdiMGJjMzUtZTFmYi00ZDk5LTk4YWMtY2YyOWY2ZWYzMDU3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Greens think the current one-year holding tax exemption for crypto is unfair and are seeking to abolish it.  </p>\n                    <p><p data-ct-non-breakable=\"true\">The debate around taxing cryptocurrencies in Germany is heating up as Alliance90/The Greens (the Green parliamentary group in the German Bundestag) wants to ditch a tax exemption favoring cryptocurrency investments.</p><p>In Germany, cryptocurrency taxes are determined by how long an investor has held their crypto. After holding crypto for one year, private investors can realize tax-free trading profits. </p><p>The one-year period was created to incentivize long-term investments and, at the same time, <a href=\"https://cointelegraph.com/news/here-is-why-germany-is-ranked-the-most-crypto-friendly-country\">increase the attractiveness of Germany</a> as a location for crypto investors. Long-term-oriented investors are thus to be supported, while speculative short-term transactions are less favored. </p><p><a href=\"https://cointelegraph.com/news/greens-germany-cryptocurrency-tax-politics\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-21T13:00:00.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>India crypto exchange OKX has told its users in the country to prepare for the closure of their accounts after the government issued compliance orders against a number of exchanges. Coinbase is preparing to launch new futures trading products for Dogecoin, Litecoin, and Bitcoin Cash, and the United States Securities and Exchange Commission (SEC) is reportedly trying to have Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) classified as a security. </p><p>OKX cryptocurrency exchange is closing its services in India nearly three months after the Financial Intelligence Unit (FIU) of the Indian Ministry of Finance <a href=\"https://cointelegraph.com/news/india-takes-steps-block-binance-huobi-other-global-crypto-exchange-urls\">issued compliance notices to nine foreign crypto exchanges</a>.</p><p>In a notice sent to Indian users on March 21, OKX asked users to close their accounts and redeem funds before April 30. The crypto exchange cited local regulatory hurdles as the key reason behind the decision. </p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-21T12:55:05.000Z",
    "title": " Trad Wall Street firms pushing for Ether ETF approval, says former Binance Labs head  ",
    "url": "https://cointelegraph.com/news/trad-wall-street-firms-pushing-ether-etf-approval",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvOGMyNjk0ZmYtZmUzOC00MmNkLTk4YWMtMTk4ZWM4NjY1Y2YzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Wall Street firms want Ether ETFs more than crypto natives, due to the ETF management fees, Bill Qian told Cointelegraph in an exclusive.</p>\n                    <p><p data-ct-non-breakable=\"true\">Wall Street firms and large financial institutions have the biggest interest in pushing for the approval of spot Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) exchange-traded funds (ETFs), not crypto natives, according to Bill Qian, chairman of Cypher Capital and former global head of fundraising at Binance Labs.</p><p>“Now it’s not crypto natives pushing the approval of ETFs, but Wall Street firms trying their best to make it happen,” Qian told Cointelegraph in an interview.</p><p>Companies vying for a spot Ether ETF include BlackRock, Grayscale, Fidelity, ARK 21Shares, Invesco Galaxy, VanEck, Hashdex and Franklin Templeton.</p><p><a href=\"https://cointelegraph.com/news/trad-wall-street-firms-pushing-ether-etf-approval\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-21T13:02:11.000Z",
    "title": "North Korean hackers have stolen $3B in crypto to bankroll weapons program — UN Security Council",
    "url": "https://cryptobriefing.com/north-korean-crypto-heists-un-report/",
    "description": "A UN report reveals that North Korean hackers have stolen over $3B in crypto to fund the DPRK's weapons programs."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-21T13:00:40.000Z",
    "title": "Moondance Labs raises $6M for Tanssi appchain protocol",
    "url": "https://cryptobriefing.com/tanssi-protocol-investment/",
    "description": "Moondance Labs secures $6M to advance Tanssi protocol, enhancing appchain deployment and attracting top venture capital firms."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-21T13:07:03.000Z",
    "title": "Memecoin Crash: Dogecoin (DOGE) and Shiba Inu (SHIB) Experience Declines Amid Market Corrections",
    "url": "https://cryptodaily.co.uk/2024/03/memecoin-crash-dogecoin-doge-and-shiba-inu-shib-experience-declines-amid-market-corrections",
    "description": "In the latest cryptocurrency market update, Dogecoin (DOGE) and Shiba Inu (SHIB), two leading meme coins by market capitalization, have witnessed declines over the past 24 hours."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-21T13:05:19.000Z",
    "title": "Kaspa (KAS) and Sui (SUI) continue to show strength after bitcoin (BTC) pump",
    "url": "https://cryptodaily.co.uk/2024/03/kaspa-kas-and-sui-sui-continue-to-show-strength-after-bitcoin-btc-pump",
    "description": "With Bitcoin and the crypto market totally ignoring the bearish SEC investigation into the Ethereum Foundation, solid gains were made across the board on Wednesday. As Thursday sees calmer price action, both Kaspa (KAS) and Sui (SUI) are continuing to see positive price movement."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-21T13:05:37.000Z",
    "title": "Bitcoin Mining Stocks Rally Ahead of Halving: Double-Digit Gains Mark Midweek Surge",
    "url": "https://news.bitcoin.com/bitcoin-mining-stocks-rally-ahead-of-halving-double-digit-gains-mark-midweek-surge/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/mine-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Mining Stocks Rally Ahead of Halving: Double-Digit Gains Mark Midweek Surge\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/mine-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/mine-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/mine-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/mine-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/mine-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/mine-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/mine.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Publicly traded bitcoin mining companies experienced a revival this week, as numerous stocks saw double-digit increases on Wednesday. Shares of Cleanspark soared by 22.8%, Marathon&#8217;s shares climbed by 16.1%, and Riot&#8217;s shares increased by 11.81% throughout the trading day. Bitcoin Mining Equities See Recovery With Stellar Wednesday Gains With less than a month remaining until [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-21T13:00:13.000Z",
    "title": "Bitcoin Traders Capitulate: Here’s What Happened Last 2 Times",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-traders-capitulate-what-last-2-times/",
    "description": "On-chain data shows the Bitcoin investors have been capitulating recently, a sign that FUD has been gripping the market. Bitcoin Total Amount Of Holders Has Seen A Drop Recently According to data from the on-chain analytics firm Santiment, the Bitcoin Total Amount of Holders has registered a notable decline recently. The &#8220;Total Amount of Holders&#8221; here is an indicator that measures the total number of addresses on the BTC blockchain that are carrying some non-zero balance right now. When the value of this metric trends up, it can mean that fresh hands are potentially investing into the cryptocurrency, opening new addresses and adding coins to them. Related Reading: Solana Whale Makes Massive 1,000,000 SOL Deposit To Binance, Bearish Sign? The indicator would naturally also increase if any investors who had left the asset before are returning back to it and filling up their wallets again. Another possible reason for the trend can also be due to holders breaking up their holdings into multiple wallets, for purposes like privacy. In general, though, an increase in the Total Amount of Holders is usually a sign that net adoption of the coin is taking place, which can be a bullish sign in the long term. On the other hand, a decline in the indicator can signal that some investors have decided to leave the cryptocurrency behind, as they have completely liquidated their holdings. Now, here is a chart that shows the trend in the Bitcoin Total Amount of Holders over the past few months: The value of the metric appears to have gone through a drawdown in recent days &#124; Source: Santiment on X As displayed in the above graph, the Bitcoin Total Amount of Holders has suffered a decrease during the past 10 days or so. In all, 311,000 addresses have completely emptied themselves inside this window. &#8220;To a novice trader, this may appear to be a concern with less overall active participants. However, historically this stat has reflected FUD moments in the market, indicating small BTC wallets are typically capitulating as large wallets scoop up their coins,&#8221; explains Santiment. From the chart, it&#8217;s visible that there have also been two other instances of mass capitulation within the past few months. More specifically, 1.1 million addresses exited between the 23rd of September and 23rd of October, while 757,000 capitulated between the 21st of January and 13th of February. Interestingly, during these capitulation events, the price went up 28% and 24%, respectively. So far since the latest selloff from the small hands has started, the cryptocurrency is down about 3%. Related Reading: Santiment Reveals Best Altcoins Currently In “Opportunity Zone” &#8220;If history is any indication, Bitcoin has a strong chance of putting up positive returns before this exodus of non-0 wallets this round (due to traders thinking the top is in) finally stops,&#8221; notes the analytics firm. BTC Price Since Bitcoin&#8217;s low at $60,600, the asset has enjoyed some sharp recovery as its price has now surged to the $66,800 level. Looks like the value of the coin has climbed back up over the past day &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, Santiment.net, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-21T13:00:55.000Z",
    "title": "Experts Predict Possible 30x on Rebel Satoshi’s $RECQ While Toncoin and NEAR Hold Steady Prices",
    "url": "https://www.crypto-news-flash.com/experts-predict-possible-30x-on-rebel-satoshis-recq-while-toncoin-and-near-hold-steady-prices/?utm_source=rss&utm_medium=rss&utm_campaign=experts-predict-possible-30x-on-rebel-satoshis-recq-while-toncoin-and-near-hold-steady-prices",
    "description": "<img width=\"1200\" height=\"750\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-21T092145.380.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-21T092145.380.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-21T092145.380-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-21T092145.380-768x480.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-21T092145.380-150x94.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/unnamed-2024-03-21T092145.380-450x281.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Experts predict a 30x growth for $RECQ, the second token of Rebel Satoshi ($RBLZ), as it gains momentum in the Early Bird Round of its presale. Toncoin (TON) eyes a price surge of 72% in 2024 as experts express optimism about its future. Market analysts have predicted that the NEAR Protocol (NEAR) will cross $11 [...]"
  }
]