[
  {
    "source": "CoinDesk",
    "date": "2023-07-07T21:15:37.000Z",
    "title": "Why Edinburgh Is Zumo's Crypto Hub",
    "url": "https://www.coindesk.com/consensus-magazine/2023/07/07/why-edinburgh-is-zumos-crypto-hub/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A conversation with Nick Jones, the co-founder and CEO of digital-assets infrastructure platform Zumo, on how being accepted to a blockchain accelerator and COVID-19 workplace changes influenced their choice to establish and remain in Scotland."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-07T21:20:00.000Z",
    "title": "Coinbase domain name reportedly used by scammers in high-profile attacks",
    "url": "https://cointelegraph.com/news/coinbase-domain-name-reportedly-used-by-scammers-in-high-profile-attacks",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/733076c2-e00f-40e5-8823-8df3325b4ea6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Twitter users have been sharing security incidents surrounding the crypto exchange, including claims that scammers are using Coinbase's domain name on attacks.</p>\n                    <p><p>Coinbase's users have been turning to Twitter to report scams and phishing attacks involving the company's services and applications in the recent weeks, including claims that scammers are using the crypto exchange's domain name.</p><p>The most recent case was<a href=\"https://twitter.com/dgmason/status/1677181060373958656\" target=\"_blank\" rel=\"noopener nofollow\"> disclosed</a> on July 7 by a Twitter user identified as Daniel Mason, who allegedly received texts and emails from scammers with links under the domain Coinbase.com.</p><p>The fraudster contacted Mason using a real phone number, then triggered an email from a Coinbase.com domain, followed by a phishing text message directing him to a Coinbase subdomain URL, before verifying Mason's address, social security number, and driver's license number.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> I founded an identity / security company.<br> I&#39;m currently building an auth company.<br> But my Coinbase account *almost* got phished.<br><br>This is the (2nd) most legit fraud attack I&#39;ve ever experienced personally.  Wild story below.  </p>&mdash; Daniel Mason (SF next week ) (@dgmason) <a href=\"https://twitter.com/dgmason/status/1677181060373958656?ref_src=twsrc%5Etfw\">July 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As Mason notes, the scammer was well-spoken and a native English speaker. The fraudster reportedly said during a phone call that Mason would receive an email from Coinbase regarding an alleged breach of his account. Immediately, an email arrived from help@coinbase.com. \"Did he create a case on my behalf? Or access Coinbase mail servers?,\" Mason commented on Twitter. </p><p>Mason's experience is one of many on the social media platform reporting security incidents involving the crypto exchange. A brief look at Coinbase's support page shows users complaining about several types of scams, including phishing on Coinbase Wallet and criminals using the company's web address. </p><p>Cointelegraph spoke with a victim of a similar approach. The individual, who asked to remain anonymous, claims to have called Coinbase's support line to verify the authenticity of an email about their account being compromised. The employee then confirmed it was real communication, but the email was the work of a hacker.</p><p>\"An employee of Coinbase authenticated a hacker as a Coinbase employee, who then stole my crypto. They then strung me along before taking no accountability, even though I had a witness, time and date of call, and the employee I spoke to,\" said the individual. The case is now under litigation. Among funds frozen and stolen, the victim claims to have lost roughly $50,000 in assets. </p><p>The reports follow the same pattern as the <a href=\"https://twitter.com/JacobCanfield/status/1668762812213067776\" target=\"_blank\" rel=\"noopener nofollow\">attack</a> on Twitter user Jacob Canfield. Canfield reportedly received a text message and phone calls from a fraudster on June 13, citing an alleged change in his two-factor authentication (2FA). </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Holy shit. <br><br>I just got attacked with one of the most complex scams in <a href=\"https://twitter.com/hashtag/crypto?src=hash&amp;ref_src=twsrc%5Etfw\">#crypto</a> that I have seen to date.<br><br>Please read if you use <a href=\"https://twitter.com/coinbase?ref_src=twsrc%5Etfw\">@coinbase</a>. <br><br>This just happened 15 minutes ago.<br><br>THIS IS A WARNING FOR ALL COINBASE USERS!<br><br>There has been some sort of a data breach. <br><br>First, I… <a href=\"https://t.co/aOVWLpAtY4\">pic.twitter.com/aOVWLpAtY4</a></p>&mdash; Jacob Canfield (@JacobCanfield) <a href=\"https://twitter.com/JacobCanfield/status/1668762812213067776?ref_src=twsrc%5Etfw\">June 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>​​\"They then sent me to the 'security' team to verify my account to avoid a 48 hour suspension. They had my name, my email and my location and sent a 'verification code' email from help@coinbase.com to my personal email,\" Canfield explained, adding that the criminal \"got angry and hung up the phone\" when told the code would not be sent.</p><p>The email help@coinbase.com is <a href=\"https://help.coinbase.com/en/coinbase/privacy-and-security/other/is-this-email-really-from-coinbase\" target=\"_blank\" rel=\"noopener nofollow\">listed</a> on the exchange's support page as a reliable and official address. The company's blog also states that its staff will never ask users for passwords, two-step verification codes, or request remote access to devices.</p><p> Security specialists recommend strong, unique passwords for crypto accounts and enabling two-factor authentication on applications.</p><p>Cointelegraph reached out to Coinbase, but did not receive an immediate response. </p><p><a href=\"https://cointelegraph.com/magazine/3-4-billion-bitcoin-popcorn-tin-silk-road-hacker/\"><strong><em>Magazine: $3.4B of Bitcoin in a popcorn tin — The Silk Road hacker’s story</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-07T21:10:24.000Z",
    "title": "US presidential candidate RFK Jr.’s financial disclosures reveal up to $250,000 in Bitcoin",
    "url": "https://cryptoslate.com/us-presidential-candidate-rfk-jr-s-financial-disclosures-reveal-up-to-250000-in-bitcoin/",
    "description": "<p>Financial disclosures reveal that the family of U.S. presidential candidate Robert Kennedy Jr owns Bitcoin (BTC) worth up to $250,000 The June 30 filing showed that he owns between $100,001 and $250,000 and has earned less than $201 from the investment in the flagship digital asset. The filing does not provide additional information on when [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/us-presidential-candidate-rfk-jr-s-financial-disclosures-reveal-up-to-250000-in-bitcoin/\">US presidential candidate RFK Jr.&#8217;s financial disclosures reveal up to $250,000 in Bitcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-07T21:30:18.000Z",
    "title": "BTC’s Year-End Price Projections for 2023 Vary Widely, Ranging From $25K to $40K, While Future Forecasts Extend Into Six-Digit Territory",
    "url": "https://news.bitcoin.com/btcs-year-end-price-projections-for-2023-vary-widely-ranging-from-25k-to-40k-while-future-forecasts-extend-into-six-digit-territory/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/20233333-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BTC&#039;s Year-End Price Projections for 2023 Vary Widely, Ranging From $25K to $40K, While Future Forecasts Extend Into Six-Digit Territory\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/20233333-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/20233333-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/20233333-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/20233333-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/20233333-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/20233333-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/20233333.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin&#x2019;s market performance in the first half of 2023, surging by 80% against the U.S. dollar, has enthusiasts eagerly speculating about its year-end price. Techopedia and Changelly have released price prediction reports with varying estimates, suggesting that bitcoin&#x2019;s value could range from $25,175 to $40,836 per unit by the close of the year. Techopedia vs. [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-07T21:26:04.000Z",
    "title": "Robert F. Kennedy Jr. owns up to $250k in bitcoin, financial records show",
    "url": "https://crypto.news/robert-f-kennedy-jr-owns-up-to-250k-in-bitcoin-financial-records-show/",
    "description": "Robert F. Kennedy Jr. currently holds between $100,000 and $250,000 in bitcoin, according to financial records. America’s next potential president is a bitcoiner&#160; Kennedy, who is running as a Democratic candidate for president of the United States, has been a&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-07T21:30:10.000Z",
    "title": "Ripple Head Of Policy Calls For UK To Join Global Trend Of CBDC Adoption",
    "url": "https://www.newsbtc.com/news/ripple/ripple-head-of-policy-calls-for-uk-to-join-global-trend-of-cbdc-adoption/",
    "description": "In an interview with the Digital Pound Foundation, Ripple Head of Policy Susan Friedman shared her positive outlook on London&#8217;s potential as a crypto hub, highlighting its dedication to developing ecosystems for crypto assets and Central Bank Digital Currencies (CBDCs).  Ripple Advocates For Encouraging CBDC Ecosystem Development Friedman noted that Ripple&#8217;s goal is to advocate for global policy frameworks that encourage ecosystem development for crypto assets, including CBDCs.  She expressed excitement for what is happening in the UK, as London and the government have taken a proactive approach to fintech and CBDCs. She cited the work of the Bank of England with the digital pound and the government&#8217;s consideration of all viewpoints when implementing a CBDC. According to Friedman, digital currencies and CBDCs are a natural evolution of how individuals and countries exchange value, given that current currencies were created in a less globalized world.  Related Reading: Ethereum Address Creation Spikes, Adoption On The Rise? She also believes CBDCs can offer the same protection as fiat and that most countries looking to implement CBDCs are exploring CBDs to solve specific domestic challenges. Ultimately, she believes all countries must develop a strategy to implement CBDCs to efficiently interact with the global market. Ripple&#8217;s head of policy also sees CBDCs and cryptocurrencies as encouraging financial inclusion, increasing access to financial services for under and unbanked populations, and increasing the speed and efficiency of payments. She believes that digital currencies can also help reduce energy use and environmental resources by reducing the printing of paper money and minting coins. However, Friedman acknowledged that central banks globally are struggling to encourage this technology while maintaining financial stability and control of their monetary systems. She believes that there can be interoperability between these currencies in a way that maintains financial stability for all countries. In conclusion, Friedman&#8217;s positive outlook on London&#8217;s potential as a crypto hub reflects Ripple&#8217;s dedication to advocating for global policy frameworks that encourage ecosystem development for crypto assets and CBDCs.  Her insights into the comparable security and protections of CBDCs and their potential to encourage financial inclusion and reduce energy use highlight the benefits of this technology.  As countries worldwide explore the implementation of CBDCs, interoperability and maintaining financial stability will be critical factors to consider. XRP Enters Crucial Phase Market analyst Egrag Crypto has shared his insights on the next 100 days for XRP, highlighting key levels of support and resistance for investors to watch. As the market enters the third quarter of 2023, he believes this will be a make-it-or-break-it phase for XRP, with the potential for significant price movements. According to Egrag Crypto, XRP&#8217;s support levels are currently at $0.4570, $0.4250, and $0.4200, with major support at $0.3850. On the other hand, the resistance levels for XRP are currently locked at $0.48 and $0.50, with major resistance at $0.54 and $0.58.  These levels may provide investors with an indication of where XRP&#8217;s price may move in the coming months. Related Reading: Surging Demand For Bitcoin Ordinals Propels Q2 Trading Volume To $210M However, Egrag Crypto also notes that the ongoing legal proceedings between Ripple and the U.S. Securities and Exchange Commission (SEC) regarding XRP&#8217;s status as a security could significantly impact the cryptocurrency&#8217;s price. The decision by Judge Torres could sling-shot the price of XRP in either direction, depending on the verdict and subsequent actions. Despite this uncertainty, Egrag Crypto advises investors to stay level-headed and maintain a long-term perspective. Short-term volatility can be unpredictable, and emotions can run high. He recommends continuing with a dollar-cost averaging (DCA) strategy, as he believes in the potential of XRP and utility in the evolving digital economy. At the time of writing, XRP is trading at $0.4657, following the overall trend of the market, experiencing a 0.4% decline in the past 24 hours Featured image from Unsplash, chart from TradingView.com "
  }
]