[
  {
    "source": "CryptoSlate",
    "date": "2023-11-17T09:30:21.000Z",
    "title": "Tumultuous 9-day stretch culminates in massive crypto leverage clear-out of over $1.7B",
    "url": "https://cryptoslate.com/insights/tumultuous-9-day-stretch-culminates-in-massive-crypto-leverage-clear-out-of-over-1-7b/",
    "description": "<p>Quick Take Bitcoin&#8217;s recent performance has been nothing short of a rollercoaster ride of late, highlighting the resurgence of the volatile nature of the crypto market. In a span of approximately nine days since Nov. 9, Bitcoin&#8217;s price embarked on a tumultuous journey, peaking just shy of $38,000 and plunging to depths as low as [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/tumultuous-9-day-stretch-culminates-in-massive-crypto-leverage-clear-out-of-over-1-7b/\">Tumultuous 9-day stretch culminates in massive crypto leverage clear-out of over $1.7B</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-17T09:25:32.000Z",
    "title": "Dogecoin ($DOGE) Is Literally Going to the Moon",
    "url": "https://www.cryptoglobe.com/latest/2023/11/dogecoin-doge-is-literally-going-to-the-moon/",
    "description": "Astrobotic, a Pittsburgh-based aerospace company, has announced an ambitious plan to send a physical Dogecoin (DOGE) token to the moon. Astrobotic, founded in 2007 and headquartered in Pittsburgh’s North Side, has emerged as a leader in lunar logistics, specializing in making space missions more feasible and affordable. With a focus on science, exploration, and commerce, […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-17T09:32:57.000Z",
    "title": "Coinbase Commerce Revolutionizes Onchain Payments with New Protocol",
    "url": "https://www.cryptopolitan.com/coinbase-commerce-onchain-payments-protocol/",
    "description": "Coinbase Commerce is setting a new standard in the realm of on-chain payments, introducing an updated experience that promises to make transactions faster, cheaper, and more seamless than ever before. Built on the newly developed open-source Onchain Payment Protocol, the enhancement is a game-changer for merchants and consumers alike, offering instant settlement, low transaction fees, ... <a title=\"Coinbase Commerce Revolutionizes Onchain Payments with New Protocol\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-commerce-onchain-payments-protocol/\" aria-label=\"More on Coinbase Commerce Revolutionizes Onchain Payments with New Protocol\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-17T09:31:53.000Z",
    "title": "Ripple CLO accuses SEC of shady practices amid legal battle",
    "url": "https://www.cryptopolitan.com/ripple-clo-accuses-sec-of-shady-practices/",
    "description": "In a recent development that&#8217;s been turning heads in the financial and legal communities, Ripple&#8217;s Chief Legal Officer, Stuart Alderoty, has leveled serious criticism against the U.S. Securities and Exchange Commission (SEC). Alderoty&#8217;s remarks come amid ongoing legal challenges involving Ripple, a leading player in the cryptocurrency space. Alderoty, in a series of public statements, ... <a title=\"Ripple CLO accuses SEC of shady practices amid legal battle\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-clo-accuses-sec-of-shady-practices/\" aria-label=\"More on Ripple CLO accuses SEC of shady practices amid legal battle\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-17T09:36:28.000Z",
    "title": "Sushiswap (SUSHI) surges amid new tokenomics model discussion",
    "url": "https://crypto.news/sushiswap-sushi-surges-amid-new-tokenomics-model-discussion/",
    "description": "Decentralized exchange Sushiswap (SUSHI) has introduced a new tokenomics model for sustainable growth and efficiency that the community is now discussing. Launched in August 2020, SUSHI is a decentralized finance protocol on Ethereum (ETH) that allows cryptocurrencies to be traded&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-17T09:24:00.000Z",
    "title": "Strike to charge non-U.S. users for Bitcoin purchases with debit card",
    "url": "https://crypto.news/strike-to-charge-non-u-s-users-for-bitcoin-purchases-with-debit-card/",
    "description": "Strike CEO Jack Mallers admitted high fees for crypto purchases with debit card but noted the firm is working to find a cheaper way. Bitcoin (BTC) payments firm Strike is rolling out its services globally, allowing users in 35+ countries&#8230;"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-17T09:22:51.000Z",
    "title": "Will THIS Be a HIDDEN CRYPTO Gaming Gem? IQ Protocol (IQT)",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/will-this-be-a-hidden-crypto-gaming-gem-iq-protocol-iqt/",
    "description": "<p>Get in early! How many times have I mentioned that? To get those 100x gains or more, you need to get in early with a project. Here is a perfect opportunity for you. IQ Protocol, the NFT rental platform, is launching its IQ token. This is as early as you can get into a project. [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/will-this-be-a-hidden-crypto-gaming-gem-iq-protocol-iqt/\">Will THIS Be a HIDDEN CRYPTO Gaming Gem? IQ Protocol (IQT)</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]