[
  {
    "source": "Decrypt",
    "date": "2023-08-18T02:31:03.000Z",
    "title": "Associated Press Limits How Journalists Can Use Generative AI",
    "url": "https://decrypt.co/152873/associated-press-limits-how-journalists-use-generative-ai",
    "description": "The AP releases guidelines on using generative AI, as the storied news agency emphasizes the role of human oversight in journalism."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-18T02:12:44.000Z",
    "title": "OpenSea Will Make Creator Royalties Optional for NFT Trades",
    "url": "https://decrypt.co/152878/opensea-make-creator-royalties-optional-nft-trades",
    "description": "Once the largest NFT marketplace by trading volume, OpenSea has revealed plans to stop enforcing creator royalty fees on secondary trades."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-18T02:30:08.000Z",
    "title": "Valkyrie Files for Ethereum ETF With US Securities Regulator",
    "url": "https://news.bitcoin.com/valkyrie-files-for-ethereum-etf-with-us-securities-regulator/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1912581994-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Valkyrie Files for Ethereum ETF With US Securities Regulator\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1912581994-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1912581994-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1912581994-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1912581994-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1912581994-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1912581994-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1912581994.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />U.S.-based asset manager Valkyrie is requesting regulatory approval from the U.S. Securities and Exchange Commission (SEC) for an ether futures exchange-traded fund (ETF). The move follows the acceptance by the SEC of Valkyrie&#x2019;s application for a spot bitcoin ETF last month. Asset Manager Valkyrie Seeks Regulatory Nod for Ether Futures ETF Tennessee-headquartered asset management firm [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T02:31:49.000Z",
    "title": "AI-Generated Review Summaries: Can They Transform Purchase Decisions?",
    "url": "https://www.cryptopolitan.com/ai-generated-review-summaries-from-amazon/",
    "description": "AI-generated review summaries"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-18T02:30:55.000Z",
    "title": "Sei Takes A Hit: Price Suffers 26% Plunge Amid Airdrop Claim Expansion",
    "url": "https://www.newsbtc.com/altcoin/sei-takes-a-hit-price-suffers-plunge-amid-airdrop/",
    "description": "Sei, a specialized trading network within the Cosmos ecosystem, has recently recorded a significant downward trend.  Notably, on a day rife with anticipation, the price of Sei plunged by more than 20%, plummeting from its initial spike above $0.28 to somewhere below $0.18. This decline coincided with the Sei Foundation&#8217;s decision to open airdrop claims, arguing free tokens are often distributed to early participants or testers of a new crypto project. Related Reading: SEI Token Breaks Into Top 100 One Day Post-Debut On Major Exchanges Airdrop Details And The Impact On Sei&#8217;s Price The crypto community has since waited with bated breath for the Sei blockchain to launch and initiate its airdrop. And finally, on August 15, Sei launched its mainnet beta, with the airdrop initiatives happening after. Today, the blockchain reported an upsurge in the number of wallets eligible for the airdrop. Initially planned for 500,000 wallets, the number swelled to roughly 1.5 million in response to what the foundation termed &#8220;fervent demand.&#8221; Due to fervent demand, Sei Foundation has increased the number of eligible wallets for the cross-bridge airdrop from 500K to 1.5M on @ethereum, @0xPolygonLabs, @arbitrum, @BNBCHAIN, @solana, @optimismFND and @osmosiszone. — Sei Foundation (@Sei_FND) August 17, 2023 This enlargement incorporated users from a variety of blockchain networks, including but not limited to Ethereum, Polygon, Arbitrum, BNB Chain, and Solana. From its coin supply, the Sei team earmarked 3% specifically for the airdrop. This translates to a figure of 300 million coins. To put this into perspective, according to a report by Binance, these coins form a significant chunk of the 1.8 billion Sei coins currently circulating out of 10 billion coins.  Sei Price Plunges More Than 20% In The Past Day Sei has plummeted by more than 20% over the past 24 hours. This plummet contributes to the asset&#8217;s fall from its rank among the top 100 in crypto on the day of launch to a current rank of 107 among the most prominent crypto by market capitalization, according to CoinGecko. Despite the token&#8217;s listing on exchanges such as Binance, it has seen quite a plunge in the past day with a current market price of $1.80, a 22% drop from its initial trading price above $0.25. The reason behind Sei&#8217;s plummet is evident as it comes amid the asset&#8217;s airdrop expansion. It is worth noting that an event such as an airdrop can often trigger a cascade of sell-offs as eligible users rush to convert their newfound assets into cash or other cryptocurrencies. Alongside its declining value, Sei&#8217;s market capitalization plunged from $413 million on Wednesday to $319 million at the time of writing. The asset&#8217;s trading volume has declined from a high of $1.2 billion yesterday to $705 million in the past 24 hours. Related Reading: Kraken Surges Ahead In Altcoin Liquidity To Overtake Coinbase In US: Kaiko Sei is a new trading-focused blockchain claiming a faster transaction initiation than its counterparts. The blockchain touts the capability to execute sub-second blocks making its transaction more efficient. In the ever-demanding realm of cryptocurrency trading, where speed is of the essence, this feature makes the blockchain worth paying attention to. Featured image from Unsplash, Chart from TradingView"
  }
]