[
  {
    "source": "Cointelegraph",
    "date": "2023-07-16T07:43:13.000Z",
    "title": "AI systems used in deadly military operations in Israel: Report ",
    "url": "https://cointelegraph.com/news/ai-systems-used-deadly-military-operations-israel-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/969fa51b-e5ee-4b59-9fab-b9882ff96f94.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The IDF has reportedly employed AI extensively and has increasingly implemented these systems in various units to establish itself as a global leader in autonomous weaponry.</p>\n                    <p><p>As tensions rise in the occupied territories and with Iran, the Israel Defense Forces are reportedly utilizing <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/artificial-intelligence\">artificial intelligence (AI)</a> to choose targets for air strikes and manage logistics during wartime.</p><p><a href=\"https://www.bloomberg.com/news/articles/2023-07-16/israel-using-ai-systems-to-plan-deadly-military-operations?srnd=technology-ai\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to a Bloomberg report, officials in the Israeli military confirmed the use of an AI recommendation system by the military. This system reportedly analyzes vast amounts of data to assist in target selection for air strikes. Additionally, the Fire Factory, another AI model, reportedly swiftly assembles subsequent raids by calculating munition loads, prioritizing and assigning targets and proposing a schedule based on military-approved data.</p><p>AI finds<a href=\"https://circle.cointelegraph.com/blog/how-ai-and-blockchain-are-disrupting-traditional-business-models\"> widespread applications across major industries</a>. One such application is automation, where AI technologies streamline repetitive tasks, enhancing overall efficiency and productivity. Additionally, AI algorithms enable data analysis on large scales, identifying patterns and delivering valuable insights crucial for informed decision-making.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/d881c66a-e4c3-4ec6-b560-e4ee80a91f67.JPG\"  /><figcaption style=\"text-align: center;\"><em>Screenshot of the Fire Factory software. </em>Source: Bloomberg</figcaption></figure><p>Despite human operators overseeing and approving individual targets and air raid plans, an Israel Defense Forces (IDF) official reportedly confirmed that the technology used in these systems lacks international or state-level regulation. </p><p>Supporters argue that advanced algorithms have the potential to outperform human capabilities and assist in minimizing casualties. However, critics<a href=\"https://cointelegraph.com/news/environmental-impact-of-ai-pioneering-solutions-for-a-sustainable-future\"> caution against the potential hazards</a> associated with an increasing reliance on autonomous systems, highlighting the potentially deadly consequences.</p><p>In the report, it states that the IDF has extensively employed AI and has increasingly implemented these systems in various units to establish itself as a global leader in autonomous weaponry. Israeli defense contractors have reportedly constructed some of these systems, while others, like the army-developed StarTrack border control cameras, utilize thousands of hours of footage to identify individuals and objects.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/cryptoa-bill-to-exempt-foreigners-from-crypto-taxes-passes-preliminary-reading-in-israel\"><strong><em>Bill to exempt foreigners from crypto taxes passes preliminary reading in Israel</em></strong></a></p><p>Although specifics about the IDF's utilization of AI in operations are classified, military officials reportedly confirm that the IDF has acquired battlefield experience with these contentious systems during periodic escalations in the Gaza Strip. The region often witnesses Israeli air strikes as a response to rocket attacks.</p><p>Experts reportedly emphasize the potential to reduce civilian casualties through the integration of AI in battlefield systems. Simona R. Soare from the International Institute of Strategic Studies noted that correct usage of AI technologies can offer significant efficiency and effectiveness advantages, with the potential for achieving high precision when the technological parameters are properly functioning.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-human-digital-souls-agi-alignment-problem-replika/\"><strong><em>Experts want to give AI human ‘souls’ so they don’t kill us all</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-16T08:00:00.000Z",
    "title": "Bitcoin Miners Face Difficulty Ahead of Halving, JP Morgan Warns",
    "url": "https://cryptodaily.co.uk/2023/07/bitcoin-miners-face-difficulty-ahead-of-halving-jp-morgan-warns",
    "description": "<p class=\"md-end-block md-p\">Bitcoin miners may face significant challenges due to the upcoming halving event, according to a new report by analysts from banking and finance firm JP Morgan.</p>\n<p class=\"md-end-block md-p\">The report suggests that Bitcoin's price and transaction fees need to rise substantially to balance the reduced block reward.</p>\nUnsettling Times Ahead for Miners\n<p class=\"md-end-block md-p\">The analysis predicts potential difficulties for Bitcoin miners as the hash rate, representing the computational power used to mine cryptocurrency, hits new highs. Factors such as fluctuating electricity costs and intensified competition among miners are expected to increase the cost of production. </p>\n<p class=\"md-end-block md-p\">The halving event, which takes place approximately every four years, will cut miners' rewards by half. \"The upcoming bitcoin halving event in April/May 2024 could be a stress test for Bitcoin miners,\" states the report, co-authored by JP Morgan analyst Nikolaos Panigirtzoglou.</p>\n<p class=\"md-end-block md-p\">This event will lower the issuance rewards from 6.25 to 3.125 BTC, effectively reducing miners&rsquo; revenue while concurrently increasing Bitcoin&rsquo;s production cost. The report explains that while Bitcoin halving typically has a positive impact on the Bitcoin price given that the production cost has historically acted as a floor, it presents a considerable challenge for miners.</p>\n\n<p class=\"md-end-block md-p\">\"[The halving] would reduce the issuance rewards from 6.25 to 3.125 BTC, implying a reduction in miners&rsquo; revenue, effectively increasing Bitcoin&rsquo;s production cost at the same time [...] As a result, while Bitcoin halving is seen as having a positive effect on the bitcoin price given the production cost acted historically as a floor, it poses a challenge for bitcoin miners,\" the report indicated.</p>\n\nHash Rate Volatility and Energy Costs\n<p class=\"md-end-block md-p\">Based on a global average electricity cost of $0.05/kWh, it presently costs around $20,000 to mine a Bitcoin, currently valued at around $30,000 according to public blockchain explorer data. JP Morgan highlighted the hash rate's volatility, suggesting a range of energy sources and potential advantages for miners who have access to lower-priced power.</p>\n<p class=\"md-end-block md-p\">The firm revealed that a one-cent increase in the cost per kilowatt-hour translates into a $4,300 increase in Bitcoin production costs. After the halving event, this sensitivity is expected to double, thereby escalating the risk and susceptibility for higher-cost producers (in simpler terms, they will effectively be \"priced out\" of the competitive sphere for Bitcoin mining).</p>\nInstitutional Support and the Importance of Rising Bitcoin Prices\n<p class=\"md-end-block md-p\">The report also points to growing institutional interest in Bitcoin mining as a source of support for struggling miners, citing investments in mining rigs from companies like Galaxy Digital and Grayscale Investments. </p>\n<p class=\"md-end-block md-p\">The report stated:</p>\n\n<p class=\"md-end-block md-p\">\"It seems unlikely that the Bitcoin hash rate will continue to rise at the same pace post the April/May 2024 halving event without any sustained rise in the Bitcoin price above its production cost or a large increase in transaction fees that could offset the reduction in issuance rewards.\"</p>\n\n<p class=\"md-end-block md-p\">Despite this, however, to offset the lower block reward, JP Morgan stresses that Bitcoin's price and transaction fees must see substantial growth. The analysts furtherl noted that declining enthusiasm around cryptocurrencies could pose an additional challenge for miners' revenues, if indeed the trend in terms of declining interest in crypto proves to be a long-term trend.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-16T08:00:11.000Z",
    "title": "Bitcoin ETFs Can Boost ‘Overall Reputation of Certain Cryptocurrencies’ — Brighty App Co-Founder",
    "url": "https://news.bitcoin.com/bitcoin-etfs-can-boost-overall-reputation-of-certain-cryptocurrencies-brighty-app-co-founder/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/guoy78900-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/guoy78900-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/guoy78900-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/guoy78900-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/guoy78900-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/guoy78900-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/guoy78900-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/guoy78900.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to Nikolay Denisenko, the co-founder and CTO of the financial and earning application Brighty App, the digital version of the pound sterling can be a bridge that enables &#8220;easy conversions between different types of crypto, stablecoins, and digital currencies.&#8221; Furthermore, the digital pound — also known as britcoin — can potentially &#8220;make payments faster, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-16T07:49:52.000Z",
    "title": "WRX Price Prediction 2023-2032: Will WazirX Recover Soon?",
    "url": "https://www.cryptopolitan.com/wrx-price-prediction/",
    "description": "WRX Price Prediction 2023-2032 How much is WRX worth? As of today, the price of WazirX (WRX) stands at $0.101. It has a 24-hour trading volume of $2.36M and a market capitalization of $40.54M, with a market dominance of 0.00%. Over the past 24 hours, the WRX price has experienced a decrease of 0.57%. Currently, ... <a title=\"WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wrx-price-prediction/\" aria-label=\"More on WRX Price Prediction 2023-2032: Will WazirX Recover Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-16T07:41:33.000Z",
    "title": "How Will Generative AI Chatbot Tutors Boost Students’ Academic Performance?",
    "url": "https://www.cryptopolitan.com/generative-ai-chatbot-tutors-boost-students/",
    "description": "Generative AI chatbots are on the brink of transforming the field of education, promising to tackle the long-standing Two Sigma Problem identified by educational psychologist Benjamin Bloom. In his groundbreaking 1984 paper, Bloom found that personalized one-on-one tutoring could significantly elevate students&#8217; academic performance. The key to success lies not solely in educational content but ... <a title=\"How Will Generative AI Chatbot Tutors Boost Students&#8217; Academic Performance?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/generative-ai-chatbot-tutors-boost-students/\" aria-label=\"More on How Will Generative AI Chatbot Tutors Boost Students&#8217; Academic Performance?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-16T07:44:05.000Z",
    "title": "Terra Luna Classic Community Empowers Change: Votes to Revise LUNC Gas Fees and Staking Undelegation Period",
    "url": "https://www.crypto-news-flash.com/terra-luna-classic-community-empowers-change-votes-to-revise-lunc-gas-fees-and-staking-undelegation-period/?utm_source=rss&utm_medium=rss&utm_campaign=terra-luna-classic-community-empowers-change-votes-to-revise-lunc-gas-fees-and-staking-undelegation-period",
    "description": "<img width=\"1600\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"The long-awaited LUNC/USTC swaps may soon be available on TerraSwap, which would be great for the Terra Classic (LUNC) community.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f.png 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/739b339aa6304aa181c6afb60eb6937f-1536x864.png 1536w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />The community at Terra Luna Classic is making two major governance proposals, designed to restructure the network.  Both proposals are created to help increase the price of Terra Luna (LUNC), and potentially revive it to the $1 price level.  The Terra LUNA Classic community is working towards enacting some changes in the network. The community [...]"
  }
]