[
  {
    "source": "Bitcoin.com",
    "date": "2023-06-29T22:30:02.000Z",
    "title": "Change the Code Blasts Wall Street for Propping Up Bitcoin Initiatives",
    "url": "https://news.bitcoin.com/change-the-code-blasts-wall-street-for-propping-up-bitcoin-initiatives/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_755151406-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Change the Code Blasts Wall Street for Propping up Bitcoin Initiatives\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_755151406-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_755151406-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_755151406-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_755151406-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_755151406-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_755151406-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_755151406.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Change The Code, a Greenpeace-backed initiative that seeks to change Bitcoin&#x2019;s consensus algorithm, has blasted Wall Street companies for the support they are showing to Bitcoin-related activities. On social media, it has called out companies like Fidelity, Blackrock, JPMorgan, and Goldman Sachs, stating their actions propping up climate-destroying technologies are &#x201C;unacceptable.&#x201D; Change the Code Rails [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-29T22:31:38.000Z",
    "title": "HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?",
    "url": "https://www.cryptopolitan.com/hbar-price-prediction/",
    "description": "HBAR Price Prediction 2023-2032 Hedera Hashgraph is a trending cryptocurrency focused on providing a sustainable, enterprise-grade blockchain.&#160; The asset has been performing extremely well recently, prompting investors everywhere to search for a Hedera Hashgraph price prediction. So that is a heads-up in crypto winter despite the doom which tends to pull everyone else connected to ... <a title=\"HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hbar-price-prediction/\" aria-label=\"More on HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-29T22:11:30.000Z",
    "title": "Dawn For Bitcoin: $5 Billion In Options Expire And Could Push Price Towards $31,000",
    "url": "https://www.newsbtc.com/bitcoin-news/dawn-for-bitcoin-5-billion-in-options-expire-and-could-push-price-towards-31000/",
    "description": "Still recording some green on small timeframes, the price of Bitcoin has remained above $30,400. Despite the recent selling pressure across the sector, the support around this level held, providing bulls a chance to fight back. Related Reading: Bitcoin Bulls Battle Against Miners’ $128 Million Move: Is The Bull Run In Danger? As of this writing, Bitcoin trades at $30,458 with sideways movement in the last 24 hours. The previous week, the number one crypto by market cap recorded similar price action while other cryptocurrencies experienced losses. Bitcoin About To Explode? Data from crypto options platform Deribit, shared by analyst Tom Dunleavy, shows that over $7 billion in these contracts will expire today, Friday 29th. In other words, today, option holders can exercise their right or obligation to buy/sell BTC and other assets at a specific price, depending on their contract. Over $5 billion of the options contracts are based on Bitcoin, while the rest are based on Ethereum, as seen in the chart below. However, option holders could choose to “roll over” their contracts to a later date. As a result, according to Dunleavy, spot prices could see a spike in buying pressure as major option players hedge their positions. This increased buying pressure could see BTC soaring above the $31,000 mark. Via Twitter, the analyst stated: Big options expiration date for both ETH and BTC tomorrow ETH: ~$2B notional BTC: ~$5B notional If these are rolled into more calls we should see spot buying from dealers to hedge their books; puts opposite story. Either way expect some vol (volatility). As Dunleavy claims, the crypto market is poised for volatility, whichever direction. The chart above shows the Max Pain price for BTC options, which is $26,500. Max Pain is the price Bitcoin must trade to deny most options traders from booking profits. In that sense, the BTC price will likely turn to the downside with a spike in volatility. Beyond $31,000, What’s Next For BTC? Analysis and crypto education firm Blofin recently posted a report on BTC&#8217;s short- and long-term risks and scenarios. The firm claims the recent rally was driven by a “hunger for positive news” and a “rebalancing” of internal liquidity. In other words, crypto investors got bullish and took money from altcoins into BTC. However, there is still a liquidity issue within the sector that could limit any rally, but there is a silver lining in this scenario. Related Reading: Cardano Shows Signs of Recovery: When Will it Reach $0.30? Blofin stated: The decline in the price of BTC will be more limited, with a relatively small probability of falling below $28k, while the upward space is relatively large, and there is even hope for a rebound to $35k and above. Cover image from Unsplash, chart from Tradingview"
  }
]