[
  {
    "source": "CoinDesk",
    "date": "2024-01-25T19:52:02.000Z",
    "title": "ETH ETFs Are Inevitable — But When?",
    "url": "https://www.coindesk.com/consensus-magazine/2024/01/25/eth-etfs-are-inevitable-but-when/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "As the SEC delays applications from Grayscale and BlackRock, Daniel Kuhn looks at how soon regulators might approve these investment products."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-25T19:45:30.000Z",
    "title": "SEC Punts on Yet Another Spot Ethereum ETF",
    "url": "https://decrypt.co/214301/sec-punts-yet-another-spot-ethereum-etf",
    "description": "The U.S. Securities and Exchange Commission has pushed back a decision on Grayscale's spot Ethereum ETF conversion proposal."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-25T19:40:42.000Z",
    "title": " Massive digital yuan pilot projects planned in Shanghai development ",
    "url": "https://cointelegraph.com/news/digital-yuan-pilot-projects-planned-shanghai-development",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMjQzYmVjZGItOWQ3Mi00ZDI5LTg4OWEtZmNlYjRiMTAzZDZiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>China’s Belt & Road Initiative partners will get a cushy trade hub with lots of chances to use its CBDC under a Party development plan.</p>\n                    <p><p>A modernization plan for the Pudong New Area of Shanghai includes numerous pilot projects for the digital yuan — China’s pilot central bank digital currency (CBDC) — along with extensive new international trade facilities. A document published by the state-run Xinhua News Agency <a href=\"https://www.gov.cn/zhengce/202401/content_6927503.htm\" target=\"_blank\" rel=\"noopener nofollow\">outlines</a> the ambitious five-year plan issued by the Chinese Communist Party Central Committee and General Office of the State Council. </p><p>Under the plan, the Pudong New Area will be granted new authorities to develop into an international hub. It will have a commercial mediation system in line with international standards and “convenient” customs procedures. Improved supply chain management will facilitate the freer flow of commodities through newly built port facilities and nearby free trade zones and Shanghai Pudong International Airport. </p><p>New educational institutions will have special intellectual property rights for research and development. The plan says world-class medical and educational facilities will attract foreign talent from countries partnering on China’s Belt &amp; Road Initiative under a special visa regime.</p><p><a href=\"https://cointelegraph.com/news/digital-yuan-pilot-projects-planned-shanghai-development\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-25T19:46:05.000Z",
    "title": "LiveArt to Launch Chris Levine’s First NFT Collection Featuring Banksy and Other Icons",
    "url": "https://cryptodaily.co.uk/2024/01/liveart-to-launch-chris-levines-first-nft-collection-featuring-banksy-and-other-icons",
    "description": "LiveArt to Launch Chris Levine’s First NFT Collection Featuring Banksy and Other Icons"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-25T20:06:18.000Z",
    "title": "Bitcoin ATM flaw allows hackers unprecedented access",
    "url": "https://www.cryptopolitan.com/bitcoin-atm-flaw-allow-hackers-unprecedented/",
    "description": "A recent revelation has shed light on a significant vulnerability in Bitcoin ATMs provided by Lamassu Industries. This flaw, if exploited, could have allowed hackers to gain complete control over these machines, posing serious risks to users&#8217; funds and personal information. Bitcoin ATM flaw risked users&#8217; wallets Security experts from IOActive, a well-known cybersecurity firm, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-25T20:00:00.000Z",
    "title": "Cosmos Hub Rejects Proposal 868, XRP Onchain Metrics Points At Price Recovery, NuggetRush Revolutionizes P2E Gaming",
    "url": "https://www.cryptopolitan.com/cosmos-hub-rejects-proposal-868-xrp-onchain-metrics-points-at-price-recovery-nuggetrush-revolutionizes-p2e-gaming/",
    "description": "TLDR: Significantly, the Cosmos community voted against lowering ATOM&#8217;s minimum inflation rate from 7% to 0%. Ripple&#8217;s on-chain indicators, meanwhile, indicate that a price rebound may be possible. In other developments, NuggetRush has emerged as the best&#160;ICO of 2024. This is a mining game that you may play for free and make a lot of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-25T20:00:00.000Z",
    "title": "New Upcoming Cryptocurrency Priced in Cents Set To Reach $10 in 2024",
    "url": "https://www.cryptopolitan.com/new-upcoming-cryptocurrency-priced-in-cents-set-to-reach-10-in-2024/",
    "description": "The foundational concept of cryptocurrencies is one of decentralization of finance to prevent institutional malpractices that result in crises such as the 2008 crash. Additionally, cryptocurrencies are intended to provide anonymity and more efficiency than what fiat currencies offer. Since its conception, cryptocurrencies have become a lucrative and popular investment stream globally. Today, whale investors [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-25T19:57:32.000Z",
    "title": "Ethereum devs set timeline for final Dencun testnet upgrade",
    "url": "https://www.cryptopolitan.com/ethereum-dev-timeline-dencun-testnet-upgrade/",
    "description": "Ethereum developers are on the cusp of implementing the blockchain’s most substantial upgrade in a year, known as Dencun. This pivotal hard fork aims to introduce a technical feature called “proto-danksharding,” designed to alleviate transaction costs on layer 2s and enhance the affordability of data on the blockchain. Ethereum devs release Dencun testnet upgrade timeline [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-25T19:46:14.000Z",
    "title": "LiveArt to Launch Chris Levine’s First NFT Collection Featuring Banksy and Other Icons",
    "url": "https://www.cryptopolitan.com/liveart-to-launch-chris-levines-first-nft-collection-featuring-banksy-and-other-icons/",
    "description": "London, United Kingdom, January 25th, 2024, Chainwire The Icons Collection will present NFTs and physical artworks, exclusively available for sale on LiveArt this January — benefiting the Trussell Trust LiveArt is pleased to announce a groundbreaking collaboration with pioneer multi-disciplinary artist Chris Levine to introduce his first NFT collection, Icons. Launching this January, the collection [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-25T19:42:49.000Z",
    "title": "U.S. government to sell over $131m in Bitcoin seized from Silk Road",
    "url": "https://crypto.news/u-s-government-to-sell-over-131m-in-bitcoin-seized-from-silk-road/",
    "description": "The U.S. District Court of Maryland has issued a notice regarding the disposition of a substantial amount of Bitcoin from the former marketplace Silk Road, totaling over $131 million. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-25T20:00:58.000Z",
    "title": "$130M Silk Road Bitcoin Stash To Be Sold By US Government",
    "url": "https://www.newsbtc.com/breaking-news-ticker/130m-silk-road-bitcoin-stash-to-be-sold-by-us-government/",
    "description": "Since mid-January Bitcoin (BTC) has been facing mounting selling pressure from various market players. This includes asset manager Grayscale, bankrupt crypto exchange FTX, and now, the US government, which is set to auction off a substantial amount of Bitcoin seized from the infamous dark web marketplace Silk Road. Sale Of Confiscated Silk Road Bitcoin The US government has filed a notice to sell approximately $130 million worth of Bitcoin confiscated from Silk Road. The filing states that the United States intends to dispose of the forfeited property as directed by the United States Attorney General. Individuals or entities, except for the defendants in the case, claiming an interest in the forfeited property must file an ancillary petition within 60 days of the initial publication of the notice.  Once all ancillary petitions have been addressed or the filing period has expired, the United States will obtain clear title to the property, enabling them to warrant good title to subsequent purchasers or transferees. Related Reading: XRP Faces Bearish Pressures Amid Market Downturn: Analysts Divided On Next Move The ongoing selling pressure on BTC has resulted in a sharp 20% correction over the past 10 days. This trend is expected to continue and further amplify the selling pressure. Adding to the situation, asset manager Grayscale, while slowing down its selling activities, continues to transfer a significant amount of Bitcoin to Coinbase.  According to data from Arkham Intelligence, Grayscale recently sent an additional 10,000 BTC worth $400 million to Coinbase.  Since the approval of the Bitcoin spot exchange-traded fund (ETF), Grayscale has deposited a total of 103,134 BTC ($4.23 billion) to Coinbase Prime. Currently, Grayscale holds 510,682 BTC ($20.43 billion). Ideal Buying Opportunities?  Adam Cochran, a prominent market expert, has provided insights into the recent price action and the expectations of Bitcoin buyers. Cochran highlights that aggregate open interest (OI) for BTC has decreased by 17% from recent highs but remains around 20% higher than the averages observed during more stable market ranges.  Cochran notes that the market has seen attempts to catch falling prices, suggesting a mix of “sophisticated” and leveraged buyers. Cochran further observes that retail investors are driven by narratives surrounding the ETF and halving events, leading them to buy dips on leverage. However, many investors remain unconvinced about the market&#8217;s direction and are waiting for a clear entry point, according to Cochran’s analysis.  Notably, Cochran highlights that the current funding rates do not indicate a bearish sentiment, even in options trading, suggesting an expectation of a bottom formation shortly. The market&#8217;s dynamics are influenced by emotions and probabilities, and Cochran believes that too many participants are overexposing themselves emotionally by trying to catch the bottom of the market on each dip.  This behavior has increased the likelihood that the recent price action may not mark the bottom yet. Cochran suggests that a sentiment reset, a decline in the 3-month annualized basis by around 25%, and a further decrease in open interest would provide a healthier environment for major plays in the market. Related Reading: Helium (HNT) Heats Up: 21% Jump After Telefónica Deal Ignites Growth Ultimately, Cochran emphasizes the need for a reset in expectations, highlighting that a period of doom and despair is necessary for market participants to reassess their positions.  Cochran points out that a range between $35,000 and $37,000 BTC could be a suitable level for larger spot buys in the longer term. However, Cochran also notes that a potential drop to the $28,000 to $32,000 range could provide ideal conditions for confident, leveraged deployment. Currently, BTC is trading at $39,800, up a slight 0.6% in the past 24 hours, but down over 14% in the past fourteen days. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-25T19:45:08.000Z",
    "title": "Avalanche Foundation Release Eligibility Criteria for $100,000,000 Memecoin Fund",
    "url": "https://dailyhodl.com/2024/01/25/avalanche-foundation-release-eligibility-criteria-for-100000000-memecoin-fund/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/avalanche-foundation-release.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/avalanche-foundation-release.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/avalanche-foundation-release.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/avalanche-foundation-release.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/avalanche-foundation-release.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/avalanche-foundation-release.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/avalanche-foundation-release.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The Avalanche Foundation says it is funding select memecoins, non-fungible tokens (NFTs) and other similar crypto assets through its Culture Catalyst program. In 2022, the non-profit organization behind the layer-1 blockchain Avalanche (AVAX) launched the Culture Catalyst initiative to support community coins created for culture and engagement. In a new statement, the foundation says it [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/25/avalanche-foundation-release-eligibility-criteria-for-100000000-memecoin-fund/\">Avalanche Foundation Release Eligibility Criteria for $100,000,000 Memecoin Fund</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-25T19:41:23.000Z",
    "title": "Solana-Based Altcoin Surges 39% in Two Days As Crypto Project Partners With Telecom Firm",
    "url": "https://dailyhodl.com/2024/01/25/solana-based-altcoin-surges-39-in-two-days-as-crypto-project-partners-with-telecom-firm/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/helium-tumbles-migrate.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/helium-tumbles-migrate.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/helium-tumbles-migrate.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/helium-tumbles-migrate.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/helium-tumbles-migrate.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/helium-tumbles-migrate.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/helium-tumbles-migrate.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A Solana-based (SOL) wireless crypto project is skyrocketing after partnering up with a telecom firm. In a new press release, Nova Labs, the team behind Helium Mobile (MOBILE), says it&#8217;s collaborating with Spanish telecom firm Telefónica to launch mobile hotspots in select parts of Mexico. According to Nova Labs, Helium and Telefónica together will not [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/25/solana-based-altcoin-surges-39-in-two-days-as-crypto-project-partners-with-telecom-firm/\">Solana-Based Altcoin Surges 39% in Two Days As Crypto Project Partners With Telecom Firm</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]