[
  {
    "source": "Decrypt",
    "date": "2024-04-08T21:56:01.000Z",
    "title": "Is BitVM the Holy Grail of Bitcoin? It’s Complicated, Developers Say",
    "url": "https://decrypt.co/225279/bitcoin-bitvm-trust-bridge-liquidi",
    "description": "Trust-minimized Bitcoin bridges using BitVM can work, but it may take a while for users to get their funds out."
  },
  {
    "source": "Decrypt",
    "date": "2024-04-08T21:46:02.000Z",
    "title": "The Bored Ape Restaurant in LA Closed—But That's Not the Whole Story",
    "url": "https://decrypt.co/225277/the-bored-ape-restaurant-in-la-is-closed-but-thats-not-the-whole-story",
    "description": "After two years in business, the NFT-themed restaurant shuts down, turning toward Asia and the Middle East."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-08T22:00:00.000Z",
    "title": " Bitcoin surge to $72K driven by macro factors, not just spot BTC ETF inflows ",
    "url": "https://cointelegraph.com/news/bitcoin-surge-to-72k-driven-by-macro-factors-not-just-spot-btc-etf-inflows",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvYjRjN2UxMGMtYzk4Ny00MTQ5LTg4NmEtMDNiOTdkZjQxNjRmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin’s rally is likely influenced by persistent inflation, student debt forgiveness policies, and global trade restrictions.</p>\n                    <p><p>Bitcoin's (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) increase of 7.6% between April 6 and April 8, reached an intraday peak of $72,747 and sparked widespread speculation about the underlying causes. </p><p>While some may hastily point to the <a href=\"https://cointelegraph.com/news/bitcoin-etf-trading-activity-robust-until-halving-santiment\">inflows from the spot Bitcoin</a> exchange-traded funds (ETF) as the primary factor, this perspective overlooks the broader motivations for buyers to push the price higher. It is more plausible that a range of macroeconomic factors played a key role in Bitcoin's recent price rally.</p><p>It seems misguided to assert that the surge in BTC's value was solely due to the purchase of $500 million in Bitcoin by the <a href=\"https://cointelegraph.com/news/ethena-labs-adds-bitcoin-as-collateral-usde-stablecoin\">Ethena stablecoin USDCe</a> as collateral. For instance, <a href=\"https://cointelegraph.com/news/microstrategy-sells-604m-notes-buy-btc\">MicroStrategy’s acquisition</a> of 9,245 Bitcoin, valued at over $600 million on March 19, did not prevent a 13.7% drop in BTC price in the subsequent six days. Given Bitcoin's daily spot volumes exceeding $10 billion, such inflows are relatively insignificant.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-surge-to-72k-driven-by-macro-factors-not-just-spot-btc-etf-inflows\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-04-08T21:57:58.000Z",
    "title": "Bitcoin’s latest rally driven by ‘huge accumulation’",
    "url": "https://cryptoslate.com/bitcoins-latest-rally-driven-by-huge-accumulation/",
    "description": "<p>Bitcoin&#8217;s (BTC) latest rally was driven by &#8220;huge accumulation&#8221; as investor appetite remains high despite five days of trading in the red over the past week, according to CryptoQuant research. Just three days ago, Bitcoin was trading at roughly $65,500 as markets closed on Friday. However, a sustained rally over the weekend took prices to [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoins-latest-rally-driven-by-huge-accumulation/\">Bitcoin&#8217;s latest rally driven by ‘huge accumulation’</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-08T22:03:12.000Z",
    "title": "CLAMM trading options on the DeFi scene through PancakeSwap and Stryke collaboration",
    "url": "https://www.cryptopolitan.com/clamm-trading-options-on-the-defi-scene/",
    "description": "PancakeSwap, a well-known DEX, partners with Stryke (once Dopex) to accommodate the first-in-class CLAMM Options Trading. This joint initiative the next step for DeFi, as it brings for the first time options trading to the Ethereum sidechain. by providing the domestic options traders with some A-CLAMM formats, will be able to take advantage of numerous [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-08T21:58:34.000Z",
    "title": "Mechanism Capital co-founder predicts boom for ‘culture coins’",
    "url": "https://www.cryptopolitan.com/mechanism-capital-boom-for-culture-coins/",
    "description": "The memecoin market has been experiencing a remarkable ride to the top, thanks to some overwhelming gains experienced by some of these tokens. However, some market participants including Mechanism Capital co-founder Andrew Kang believe that a new class of tokens will outshine the regular ones. According to his post on X, Kang believes that culture [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-08T22:00:50.000Z",
    "title": "Arthur Hayes Sells All His Holdings Of This Altcoin, How Did The Price React?",
    "url": "https://www.newsbtc.com/news/arthur-hayes-sells-all-his-holdings-of-this-altcoin-how-did-the-price-react/",
    "description": "Arthur Hayes, the founder of the crypto exchange BitMEX, recently made a move on an altcoin he had held since 2022. This move saw the transfer of over 230,000 GMX tokens to Wintermute Trading, seemingly making a profit of $3.2 million. Related Reading: XRP Price Drops After Massive Whale Dump, Casting Doubt On $1 Target In April Altcoin Dropped By Its Largest Personal Holder Blockchain research platform Lookonchain revealed that Arthur Hayes seemingly sold his GMX holdings yesterday. Hayes was the largest holder of GMX, the native token of decentralized perpetual exchange GMX. Throughout 2022, the BitMEX founder spent a total of 3,383 ETH, worth $5.17 million, to buy 200,581 GMX tokens. In 2023, Hayes spent another 60 ETH to buy 2,328 GMX, around $105,000. From July to December 2023, Hayes withdrew 215,428 GMX tokens from centralized exchanges (CEX). By the end of 2023, he had bought 218,337 GMX for $6.5 million from CEX and decentralized exchange (DEX) Uniswap. As of April 7, 2024, Hayes had GMX holdings worth $9.7 million, per Lookonchain data. The post revealed that Hayes had unstaked all 237,672 tokens and transferred them to an address linked to crypto algorithmic trading firm Wintermute Trading. The transaction sparked rumors of a possible token sale by the former CEO of BitMEX. According to the report, the average cost of buying through Haye’s accumulation phase is around $29.74.  After selling, Hayes’s profits would total over $3.2 million. GMX investors reacted to the news, suggesting that “nothing changed” and the altcoin was “in that buy zone again.” Did Arthur Hayes Accept Capitulation? Crypto analyst and trader JJcycles suggested that the transaction looked like “Hayes capitulation.” Later, the trader speculated why the GMX price didn’t “tank hard” after one of its largest personal holders sold his tokens. To the analyst, the incident looked “like the price of ETH during the FTX debacle.” Based on his perception, the trader decided to buy more GMX tokens. One of the largest holders of GMX send his bags to a market maker. Speculation goes that he is selling which is the most logical conclusion to make. My question, why is price not tanking hard? Feels a bit like the price of ETH during the FTX debacle.I&#39;m buying more.$GMX pic.twitter.com/jZi91vIghT &#8212; JJcycles (@JJcycles) April 8, 2024 In a later post, the analyst clarified what he meant with his previous statement. According to him, GMX’s capitulation looks like ETH’s capitulation in 2023. As reported by NewsBTC, the number of Ethereum traders selling at a loss increased around August 2023. ETH’s price bounced back from the capitulation and has continued an upward trajectory ever since. Per the analyst charts, GMX appears to be showing an ascending triangle pattern at writing time, like the one made by ETH during its capitulation. To the trader, this suggests GMX could begin an upward trajectory like ETH. GMX Price Reaction The GMX token displays red numbers in most timeframes, as it’s currently 55.5% lower than its all-time high (ATH) of $91.07. The token registers a 7.9%, 28.9%, and 48.9% price drop on the weekly, monthly, and yearly timeframes. After the news of Hayes’ transaction broke, the price went from hovering between the $40.8-$40.7 price range to $37.1, plunging 9% in just an hour. Nonetheless, the altcoin quickly started to recover from the initial dip.  At the time of writing, GMX is trading at $40.47, a 1% drop from 24 hours ago. Notably, the token’s market activity skyrocketed 467.6% in the last day, with a daily trading volume of $54.77 million. Related Reading: Sleeping Giant Awakens! Ethereum Whale With Over 12,000 ETH Creates Noise GMX performance in the 3-day chart. Source: GMXUSDT on Tradingview  Featured Image from Unsplash.com, Chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-04-08T22:01:32.000Z",
    "title": "Blockchain Association Files Amicus Brief in Support of Tornado Cash Developers Roman Storm and Roman Semenov",
    "url": "https://dailyhodl.com/2024/04/08/blockchain-association-files-amicus-brief-in-support-of-tornado-cash-developers-roman-storm-and-roman-semenov/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/by-Sanctioning-Tornado-Cash.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/by-Sanctioning-Tornado-Cash.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/by-Sanctioning-Tornado-Cash.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/by-Sanctioning-Tornado-Cash.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/by-Sanctioning-Tornado-Cash.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/by-Sanctioning-Tornado-Cash.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/by-Sanctioning-Tornado-Cash.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The Blockchain Association, a prominent crypto advocacy group, is showing support for the two developers of mixing service Tornado Cash in their legal battle against the United States. Last year, the U.S. Department of Justice (DOJ) charged Tornado Cash founders Roman Storm and Roman Semenov with aiding the North Korean hacking group Lazarus in laundering [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/04/08/blockchain-association-files-amicus-brief-in-support-of-tornado-cash-developers-roman-storm-and-roman-semenov/\">Blockchain Association Files Amicus Brief in Support of Tornado Cash Developers Roman Storm and Roman Semenov</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]