[
  {
    "source": "Crypto Daily",
    "date": "2023-08-18T06:28:26.000Z",
    "title": "Two Uzbekistan Banks Get Greenlight to Issue Crypto Cards",
    "url": "https://cryptodaily.co.uk/2023/08/two-uzbekistan-banks-get-greenlight-to-issue-crypto-cards",
    "description": "<p>The National Agency for Prospective Projects in Uzbekistan has granted two banks in the country to issue crypto cards. </p>\n<p>Two banks in the Central Asia nation of Uzbekistan have obtained permission from the National Agency for Prospective Projects (NAPP) to issue crypto cards.</p>\nPrivate Banks to Issue Crypto Cards Powered by Mastercard\n<p>The NAPP reported on August 14 that it granted approval to two private banks in Uzbekistan &ndash; Kapital Bank and Ravnaq Bank &ndash; to issue cryptocurrency cards and take part in the NAPP&rsquo;s digital sandbox of crypto regulation. The announcement reported Ravnaq Bank had just received approval, but Kapital had already received its approval in May.</p>\n<p>The two private Uzbeki banks will issue UzNEX cards and will be supported by payment giants Mastercard. The UzNEX cards will integrate a bank account with access to a crypto exchange and automated exchange mechanism, Cointelegraph reports.</p>\n<p>Kapital Bank and Ravnaq Bank are two of the three registered participants in the Uzbeki national sandbox, the NAPP reports. The third participant is &ldquo;UZINFOCOM,&rdquo; a &ldquo;single integrator for the creation and support of state information systems,&rdquo; which will implement &ldquo;NFT certificates based on distributed data registry technology (&ldquo;blockchain&rdquo;) for names in the &ldquo;.UZ&rdquo; domain zone.&rdquo; &nbsp;</p>\n<p>The deadline for final customer rollouts of both institutions&rsquo; cards expires in December 2023.</p>\nUzbekistan Restricts Provision of Crypto Services to Licensed Firms\n<p>The government of the Republic of Uzbekistan initially granted licenses to local crypto firms in November 2022, according to the NAPP. But from 2023, it has restricted crypto service provision to licensed crypto firms.</p>\n<p>Before providing clarity regarding crypto service provision, the Uzbeki government restricted access to several international cryptocurrency exchanges, such as Binance, Huobi, and the now-collapsed FTX, after accusing them of conducting unlicensed activities.</p>\n<p>Uzbekistan introduced its regulatory framework for cryptocurrencies in early 2022 by presidential decree and launched the NAPP to oversee the industry.</p>\n<p>The government of Uzbekistan started its crackdown on the crypto industry in October 2021 after it identified over half a dozen crypto exchanges operating illegally.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T06:38:44.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 How much is MATIC worth? The current price of Polygon is $0.58. Over the past 24 hours, it has seen a trading volume of $1.16 billion. With a market capitalization of $6.15 billion, Polygon holds a market dominance of 0.51%. However, the MATIC price has experienced a decrease of 6.7% in ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  }
]