[
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T15:21:20.000Z",
    "title": "Crypto scams are down 77% — but this exploit is making a huge comeback",
    "url": "https://cointelegraph.com/news/crypto-scams-down-but-one-exploit-is-making-comeback-chainalysis",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/1c4e014d-6543-40e2-af86-f9877ba0595b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Attackers of this kind are supposedly \"big game hunting” large-scale organizations with deep pockets to extract ”the most money possible” out of these firms.</p>\n                    <p><p>Cryptocurrency scams have fallen a massive 77% from $3.3 billion to $1.1 billion over the first six months of 2023, according to a recent report by blockchain intelligence firm Chainalysis.</p><p>The catch, though, is that ransom attacks are back in trend, with perpetrators pocketing 62.4% more revenue than the first six months of 2022.</p><p>On July 12, Chainalysis released its Mid Year Crypto Crime report, noting it’s the second consecutive year that scam revenue has trended downwards.</p><p>The firm observed that historically, scam revenue increases in bull markets — but that hasn’t been the case so far in 2023:</p><blockquote>“Usually, positive price movements translate to higher scam revenue, likely because increased market exuberance and FOMO make victims more susceptible to scammers’ pitches. But 2023’s drastic scam decline bucks that long-standing trend.”</blockquote><p>Inflows into known illicit entities fell 65% over the first six months of 2023 compared to the same timeframe last year, while inflows to risky entities — such as cryptocurrency mixers and high-risk exchanges — fell 42%.</p><p>While Chainalysis partially attributed the drop to decreasing transaction volumes, it explained that illicit inflows have fallen at a faster rate:</p><blockquote>“Transaction volumes are down across the board, but declines are much less severe for legitimate services, which have seen just a 28% drop in inflows.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/8de74339-3715-4619-8ea5-16526552e540.jpg\"  /><figcaption style=\"text-align: center;\"><em>Cumulative flows for legitimate, risky and illicit services from January 1 to June 30 for 2020-2023. Source: Chainalysis. </em></figcaption></figure><p>Kim Grauer, director of research at Chainalysis told Cointelegraph that past scam victims may also be becoming more “scrupulous” with their investment decisions and, as a result, may no longer be falling for the bait thrown out by scammers. This may also be contributing to the fall in scam revenue.</p><p>“It’s entirely possible that scam victims have learned to be more scrupulous,” the firm said. “It’s also likely that government and industry awareness campaigns, as well as media reporting, has helped educate people on the risks of scamming.” </p><p>Chainalysis warned that artificial intelligence tools may increasingly be used to promote scams through the use of deepfakes, among other things.</p><blockquote>“Given the growing prominence of romance and pig butchering scams, one thing to look out for is the use of AI to increase effectiveness and scale, since those scams are largely text-based.”</blockquote><p>Hacks also fell by $1.1 billion from the first six months of 2022, according to Chainalysis. </p><h3>Ransom perpetrators are ‘big game hunting’ deep pocketed firms</h3><p>Not everything has improved across the board, however. Ransomware revenue increased 62.4% to $449.1 million in the first half of 2023. through June.</p><p>The reason, according to Chainalysis, is that attackers are now “big game hunting” large-scale organizations with deep pockets to extract ”the most money possible” out of firms willing to pay up.</p><blockquote>“Why the reversal in fortunes? For one thing, big game hunting — that is, the targeting of large, deep-pocketed organizations by ransomware attackers — seems to have bounced back after a lull in 2022.”</blockquote><p>These attackers are on track for their second-biggest year ever, trailing 2021’s full year figure of $940 million by 4.6%.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/0c482b18-9d3e-42ab-8671-ddb2d5435bb6.jpg\"  /><figcaption style=\"text-align: center;\"><em>Cumulative flows for ransomware revenue from January 1 to June 30 for 2022 and 2022. Source: Chainalysis </em></figcaption></figure><p>Chainalysis quoted Risk Officer Andrew J. Davis of cybercrime consulting firm Kivu said the decrease in 2022 could be attributed to stronger cybersecurity practices and new laws that impose stricter sanctions against paying ransoms.</p><p>As a result, ransom attackers are now likely trying to ”squeeze the most money possible” out of firms willing to pay ransoms, Davis added.</p><p>Chainalysis added payment sizes extracted by the largest perpetrators have increased substantially.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/cypto-drainers-pink-pussy-venom-and-inferno-steal-millions\"><strong><em>Pink, Pussy, Venom, Inferno — Drainers coming for a crypto wallet near you </em></strong></a></p><p>The United Nations Office on Drugs and Crime unit <a href=\"https://www.unodc.org/roseap/en/2021/10/cybercrime-ransomware-attacks/story.html\" target=\"_blank\" rel=\"noopener nofollow\">found</a> in October 2021 that ransoms take place every 11 seconds around the world, which resulted in a total damage cost of $20 billion in 2021 alone. </p><p>Cybersecurity Ventures <a href=\"https://cybersecurityventures.com/global-ransomware-damage-costs-predicted-to-reach-250-billion-usd-by-2031/\" target=\"_blank\" rel=\"noopener nofollow\">predicted</a> in June that ransomware will cost its victims $265 billion annually by 2031.</p><p>Chainalysis noted that all figures are a “lower bound estimate” and that illicit and risky transaction volume will likely increase over time as new illicit activity is found.</p><p>In addition, the data doesn’t include crime where cryptocurrency is used as a mode of payment.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/3-4-billion-bitcoin-popcorn-tin-silk-road-hacker/\"><strong><em>$3.4B of Bitcoin in a popcorn tin — The Silk Road hacker’s story</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-12T15:29:59.000Z",
    "title": "Silk Road BTC Valued at $300M Moved by US Government",
    "url": "https://cryptobriefing.com/silk-road-btc-moved-by-us-government/?utm_source=feed&utm_medium=rss",
    "description": "US government-linked wallets moved Bitcoin worth over $300 million that are connected to the Silk Road, a once-thriving illegal marketplace on the darknet. The transactions were carried out the transfer..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-12T15:37:24.000Z",
    "title": "Struct Finance Transforms DeFi Landscape on Avalanche With the Launch of Tranche-based BTC.B-USDC Vaults",
    "url": "https://cryptodaily.co.uk/2023/07/struct-finance-transforms-defi-landscape-on-avalanche-with-the-launch-of-tranche-based-btcb-usdc-vaults",
    "description": "<p>Tortola, British Virgin Islands, July 12th, 2023, Chainwire</p><p>In its ongoing journey to reshape the crypto investing landscape, Struct Finance, a DeFi platform that enables investors to engage with tailored interest rate products linked to digital assets, is thrilled to announce the launch of the BTC.B-USDC Vaults.</p><p>The tranche-based BTC.B-USDC Interest Rate Product was made possible by effectively leveraging Avalanche&rsquo;s BTC.B (Bridged Bitcoin) for DeFi applications. The new vault beautifully complements Struct Finance&rsquo;s Genesis USDC Vaults, heralding an exciting era in DeFi yield opportunities. Struct Finance built the new vault on top of GMX's Liquidity Provider Token (GLP) to generate predictable yields for BTC in the form of fixed returns, and USDC in the form of variable returns, while still leveraging a secure asset and minimizing volatility and exposure to other risks.</p><p>&ldquo;Our BTC.B-USDC Vaults represent an innovative application of Bitcoin in DeFi. We're taking full advantage of Avalanche's Bridged Bitcoin (BTC.B) to bring about a fresh wave of opportunities in the digital asset space,&rdquo; said Ersin Dalkali, the Co-founder of Struct Finance.</p><p>While Bitcoin continues to dominate the market, its inherent lack of a DeFi layer has traditionally made native yield generation quite challenging. Avalanche has unlocked new possibilities for Bitcoin in DeFi with BTC.B (Bridged Bitcoin). Unlike WBTC that relied on centralized bridges, BTC.B is minted via Avalanche Core &mdash; a decentralized bridge &mdash; and can be trustlessly bridged across networks using the Layer Zero bridge.</p><p>At present, Bitcoin investments in prominent lending pools yield between 0.2&ndash;0.5%. Even the stable swap pools offering wBTC-BTC.B products only manage to deliver returns of about 2%. Struct&rsquo;s BTC.B-USDC product shatters these limitations, offering significantly higher yields.</p><p>The purpose of BTC.B is to empower BTC holders to explore DeFi opportunities on the Avalanche blockchain, without the need to acquire secondary tokens or rely on centralized bridges. BTC.B represents BTC coins transferred to the Avalanche blockchain in the form of ERC-20 tokens. With over 6000 BTC bridged and a fully diluted value of $180 million, BTC.B is carving a niche for itself in the crypto arena.</p><p>The Bitcoin ETF applications by BlackRock, WisdomTree, and Invesco &ndash; three of the world&rsquo;s leading asset managers &ndash; are not just a mere submission. It is a signal that the traditional financial realm is ready to embrace Bitcoin on a new level. Recently, the US Securities and Exchange Commission (SEC) gave the green light to a 2X leveraged Bitcoin ETF, sparking an enthusiastic wave of speculation and anticipation for approval of a spot Bitcoin ETF.</p>Delta hedging<p>Amid the highly volatile crypto industry, Struct Finance&rsquo;s Interest Rate Products allow anyone to split and repackage the risk of any yield-bearing DeFi assets in different parts to fit their risk profile through an innovative process called &ldquo;tranching.&rdquo; Every Interest Rate Product is a single vault split into two portions, or tranches that have different return configurations:</p><ol><li>A Fixed-return Tranche for conservative investors looking for consistent returns</li><li>A Variable-return Tranche for investors with a higher risk appetite seeking superior returns</li></ol><p>The yield from the underlying asset flows into the fixed tranche first to ensure predictable returns. The remainder is then allocated to the variable tranche, which gets enhanced exposure to the underlying yield-bearing asset. Compared to the fixed tranche, the variable tranche might accrue more yield, less yield, or no yield.</p><p>As part of its BTC.B-USDC Vaults, Struct Finance has implemented a unique approach to managing investment risk: delta hedging. While the fixed tranche takes center stage with its high yield, the variable side of the product offers an additional layer of intriguing complexity and potential.</p><p>Upon deployment of funds into the vault, the BTC.B in the fixed tranche gets converted into GMX&rsquo;s GLP token, setting up a position that&rsquo;s short Bitcoin against GLP and contributing a negative delta. In contrast, the USDC on the variable side is converted into GLP, which inherently carries a positive delta.&nbsp;</p><p>This innovative delta-hedged product design achieves a fine balance between the positive and negative delta forces. It results in a robust strategy that allows investors to confidently navigate the crypto market&rsquo;s inherent volatility.</p><p>This artful interplay of the fixed and variable sides within the vaults opens the doors for investors to tap into the potential of Bitcoin investments like never before. By catering to a diverse range of risk appetites, Struct Finance ensures that both retail and institutional investors can tailor their strategies to maximize their returns, regardless of market conditions.</p>About Struct Finance<p>Struct Finance is at the forefront of the DeFi revolution, with a vision to transform the design and utility of financial products. It empowers users to design their own financial instruments, harnessing the power of tokenized, yield-bearing positions to unlock a world of diverse investment opportunities. Moreover, its cutting-edge financial products adopt a tranche-based system, smartly distributing yield between different investor classes. This balanced approach guarantees a steady yield for risk-averse investors while also offering the prospect of heightened returns to the more adventurous. Initially available on Avalanche, Struct Finance plans to go multichain in the near future.</p><p>For more information, visit: Website&nbsp; |&nbsp; Twitter&nbsp; |&nbsp; Discord&nbsp; |&nbsp; Telegram</p><p class=\"ql-align-center\">Disclaimer: This release is for informational purposes only and should not be construed as financial promotion.</p>ContactMiguel Depazmedia@struct.fi"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T15:34:41.000Z",
    "title": "Struct Finance Transforms DeFi Landscape on Avalanche With the Launch of Tranche-based BTC.B-USDC Vaults",
    "url": "https://www.cryptopolitan.com/struct-finance-transforms-defi-landscape-on-avalanche-with-the-launch-of-tranche-based-btc-b-usdc-vaults/",
    "description": "Tortola, British Virgin Islands, July 12th, 2023, Chainwire In its ongoing journey to reshape the crypto investing landscape, Struct Finance, a DeFi platform that enables investors to engage with tailored interest rate products linked to digital assets, is thrilled to announce the launch of the BTC.B-USDC Vaults. The tranche-based BTC.B-USDC Interest Rate Product was made ... <a title=\"Struct Finance Transforms DeFi Landscape on Avalanche With the Launch of Tranche-based BTC.B-USDC Vaults\" class=\"read-more\" href=\"https://www.cryptopolitan.com/struct-finance-transforms-defi-landscape-on-avalanche-with-the-launch-of-tranche-based-btc-b-usdc-vaults/\" aria-label=\"More on Struct Finance Transforms DeFi Landscape on Avalanche With the Launch of Tranche-based BTC.B-USDC Vaults\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T15:31:48.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T15:30:46.000Z",
    "title": "NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?",
    "url": "https://www.cryptopolitan.com/near-price-prediction/",
    "description": "NEAR Price Prediction 2023-2032 Near Protocol (NEAR) is a blockchain platform with significant attention and partnerships within the cryptocurrency industry. Initially established by a small team in San Francisco, NEAR Protocol has rapidly expanded its influence and formed collaborations with industry giants. As a result, it has witnessed a consistent upward trajectory since its inception. ... <a title=\"NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-price-prediction/\" aria-label=\"More on NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T15:22:45.000Z",
    "title": "Shiba Inu’s Recent Price Drops Explained: Aave vs. VC Spectra in 2023",
    "url": "https://www.cryptopolitan.com/shiba-inus-recent-price-drops-explained-aave-vs-vc-spectra-in-2023/",
    "description": "Cryptocurrencies are witnessing untested times. No historical references and rebellious graphs make it hard for analysts to understand what’s happening. The same is experienced by Shiba Inu (SHIB), which dips significantly on weekly charts. Meanwhile, AAVE and VC Spectra (SPCT) are toe to toe. Can VC Spectra (SPCT) take the lead as it raised more ... <a title=\"Shiba Inu’s Recent Price Drops Explained: Aave vs. VC Spectra in 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inus-recent-price-drops-explained-aave-vs-vc-spectra-in-2023/\" aria-label=\"More on Shiba Inu’s Recent Price Drops Explained: Aave vs. VC Spectra in 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T15:20:54.000Z",
    "title": "U.S. Senate seeks crypto industry insight to navigate digital asset tax challenges",
    "url": "https://www.cryptopolitan.com/u-s-senate-seeks-crypto-industry-insight-to-navigate-digital-asset-tax-challenges/",
    "description": "The U.S. Senate Committee on Finance is tapping into the cryptocurrency industry&#8217;s expertise, hoping to address the complex tax challenges and potential opportunities digital assets present. This development reveals a shift in legislative approach, opting for industry collaboration to untangle the intricate issues related to digital assets and taxation. Seeking industry knowledge The Chairman of ... <a title=\"U.S. Senate seeks crypto industry insight to navigate digital asset tax challenges\" class=\"read-more\" href=\"https://www.cryptopolitan.com/u-s-senate-seeks-crypto-industry-insight-to-navigate-digital-asset-tax-challenges/\" aria-label=\"More on U.S. Senate seeks crypto industry insight to navigate digital asset tax challenges\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T15:16:55.000Z",
    "title": "EOS Price Prediction 2023-2032: Is EOS a good investment?",
    "url": "https://www.cryptopolitan.com/eos-price-prediction/",
    "description": "EOS Price Prediction 2023-2032 EOS, a crypto token formed by the company to promote its decentralized app creation, ranks #47, a little lower on the charts, thanks to its slightly lower market cap of $3,365,472,360. Lately, it has resumed its upward projectile with renewed activities and is viewed by some analysts as a &#8220;ticking time ... <a title=\"EOS Price Prediction 2023-2032: Is EOS a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eos-price-prediction/\" aria-label=\"More on EOS Price Prediction 2023-2032: Is EOS a good investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-12T15:29:15.000Z",
    "title": "Crypto Investment Firm CEO Stresses AI’s Vitality in Today’s Market Landscape, the demand for InQubeta (QUBE) Booms",
    "url": "https://nulltx.com/crypto-investment-firm-ceo-stresses-ais-vitality-in-todays-market-landscape-the-demand-for-inqubeta-qube-booms/",
    "description": "The intersection of AI and the cryptocurrency market has become a topic of great interest and discussion. As the crypto industry continues to evolve, the significance of AI in shaping its future cannot be overlooked. In this article, we delve into the insights shared by a prominent CEO of a crypto investment firm who highlights [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-12T15:38:45.000Z",
    "title": "AAVE is up 56% from June lows, DAO expects more revenue in H2 2023",
    "url": "https://crypto.news/aave-is-up-56-from-june-lows-dao-expects-more-revenue-in-h2-2023/",
    "description": "AAVE prices are firm, adding 56% from June 2023 lows. Voting is in progress to deploy GHO on mainnet"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-12T15:38:02.000Z",
    "title": "Struct Finance Transforms DeFi Landscape on Avalanche With the Launch of Tranche-based BTC.B-USDC Vaults",
    "url": "https://www.crypto-news-flash.com/struct-finance-transforms-defi-landscape-on-avalanche-with-the-launch-of-tranche-based-btc-b-usdc-vaults/?utm_source=rss&utm_medium=rss&utm_campaign=struct-finance-transforms-defi-landscape-on-avalanche-with-the-launch-of-tranche-based-btc-b-usdc-vaults",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BTC_USDC_1689175623JHb650OWHh.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BTC_USDC_1689175623JHb650OWHh.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BTC_USDC_1689175623JHb650OWHh-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BTC_USDC_1689175623JHb650OWHh-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BTC_USDC_1689175623JHb650OWHh-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Tortola, British Virgin Islands, July 12th, 2023, Chainwire In its ongoing journey to reshape the crypto investing landscape, Struct Finance, a DeFi platform that enables investors to engage with tailored interest rate products linked to digital assets, is thrilled to announce the launch of the BTC.B-USDC Vaults. The tranche-based BTC.B-USDC Interest Rate Product was made [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-12T15:37:57.000Z",
    "title": "Terra Luna Classic (LUNC) Price Prediction 2022-2030: Will LUNC Price Hit $0.00013 Soon?",
    "url": "https://coinedition.com/terra-luna-classic-lunc-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Terra-Classic-LUNC-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Terra-Classic-(LUNC)-Price-Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Terra-Classic-LUNC-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Terra-Classic-LUNC-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Terra-Classic-LUNC-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Terra-Classic-LUNC-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Terra-Classic-LUNC-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Terra is an open-sourced blockchain project built to enhance the development of following-generation products and services. Its native token, called before its market implosion in May 2022, is now rebranded to Terra Classic and denoted with LUNC. Terra Classic investors are bullish, and the return on their investment has been over 19 times in the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/terra-luna-classic-lunc-price-prediction/\">Terra Luna Classic (LUNC) Price Prediction 2022-2030: Will LUNC Price Hit $0.00013 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-12T15:35:00.000Z",
    "title": "EBA Publishes Stablecoin Issuance Guidelines Under MiCA Regulation",
    "url": "https://coinedition.com/eba-publishes-stablecoin-issuance-guidelines-under-mica-regulation/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Crypto-Regulation3-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The European Banking Authority (EBA) has announced in place some recent regulations in the interest of risk management and consumer protection. As part of “guiding principles,” the EBA has advised stablecoin issuers to promptly implement necessary actions in order to adhere to upcoming cryptocurrency regulations set by the European Union, which will be enforced within [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/eba-publishes-stablecoin-issuance-guidelines-under-mica-regulation/\">EBA Publishes Stablecoin Issuance Guidelines Under MiCA Regulation</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-12T15:18:00.000Z",
    "title": "Ethereum (ETH) Needs to Jump Some Barriers to Reclaim $2,100",
    "url": "https://coinedition.com/ethereum-eth-needs-to-jump-some-barriers-to-reclaim-2100/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Ethereum_ETH_Needs_to_Jump_Some_Barriers_to_Reclaim_2100.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Ethereum_ETH_Needs_to_Jump_Some_Barriers_to_Reclaim_2100.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Ethereum_ETH_Needs_to_Jump_Some_Barriers_to_Reclaim_2100-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Ethereum_ETH_Needs_to_Jump_Some_Barriers_to_Reclaim_2100-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Ethereum_ETH_Needs_to_Jump_Some_Barriers_to_Reclaim_2100-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Ethereum_ETH_Needs_to_Jump_Some_Barriers_to_Reclaim_2100-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Ethereum_ETH_Needs_to_Jump_Some_Barriers_to_Reclaim_2100-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Ethereum_ETH_Needs_to_Jump_Some_Barriers_to_Reclaim_2100-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Ethereum_ETH_Needs_to_Jump_Some_Barriers_to_Reclaim_2100-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Ethereum_ETH_Needs_to_Jump_Some_Barriers_to_Reclaim_2100-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Ethereum_ETH_Needs_to_Jump_Some_Barriers_to_Reclaim_2100-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Ethereum_ETH_Needs_to_Jump_Some_Barriers_to_Reclaim_2100-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Ethereum_ETH_Needs_to_Jump_Some_Barriers_to_Reclaim_2100-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Ethereum_ETH_Needs_to_Jump_Some_Barriers_to_Reclaim_2100-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Ethereum_ETH_Needs_to_Jump_Some_Barriers_to_Reclaim_2100-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Ethereum_ETH_Needs_to_Jump_Some_Barriers_to_Reclaim_2100-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Ethereum_ETH_Needs_to_Jump_Some_Barriers_to_Reclaim_2100-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Ethereum (ETH), the second-largest cryptocurrency by market capitalization, could set its sights on reclaiming the $2,100 level. On-chain analyst Ali Charts pointed this out after highlighting the support and resistance levels that could affect the move toward the price mentioned above. According to Ali, ETH had found stable support between $1.800 and $1,870. The analyst [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ethereum-eth-needs-to-jump-some-barriers-to-reclaim-2100/\">Ethereum (ETH) Needs to Jump Some Barriers to Reclaim $2,100</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]