[
  {
    "source": "Decrypt",
    "date": "2024-03-14T15:03:36.000Z",
    "title": "Bitcoin DeFi App Sovryn Is Expanding to Ethereum—Here's How",
    "url": "https://decrypt.co/221633/bitcoin-defi-app-sovryn-expanding-ethereum-heres-how",
    "description": "By expanding from the first to the second largest crypto ecosystem, Sovryn wants to bring its lending, borrowing, and trading services to more people."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-14T15:01:02.000Z",
    "title": "Crypto Puzzle Game CypherClans Launches $1 Million Treasure Hunt",
    "url": "https://decrypt.co/219874/crypto-puzzle-game-cypherclans-launches-1-million-treasure-hunt",
    "description": "Billed as “The Da Vinci Code meets Web3,” CypherClans harks back to the philosophy of the cypherpunk and Cicada 3301 movements."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-14T15:00:39.000Z",
    "title": "Nexo card sees $50M in holiday spending boosted by its credit function",
    "url": "https://cryptobriefing.com/nexo-card-holiday-sales-fintech-award/",
    "description": "Nexo Card's holiday spending hits $50M, earning the FinTech Breakthrough Award for payment innovation."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-14T14:46:44.000Z",
    "title": "US leads global crypto gains with $9.3 billion in 2023: Chainalysis report",
    "url": "https://cryptobriefing.com/crypto-gains-2023-country-breakdown/",
    "description": "The US led 2023's crypto gains with $9.3 billion, contributing to the global recovery of $37.6 billion after a tough year."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-14T14:43:41.000Z",
    "title": "Polkadot announces Unity-compatible SDK for Web3 gaming development",
    "url": "https://cryptobriefing.com/polkadot-unity-sdk-web3-gaming/",
    "description": "Discover how Polkadot's new SDK for Unity is transforming web3 game development, making it easier for creators to build on an interoperable blockchain."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-14T15:00:12.000Z",
    "title": "Shiba Inu (SHIB) Price Prediction While Neo (NEO) Whales Rush To InsanityBets (IBET) Amid 17x Potential",
    "url": "https://cryptodaily.co.uk/2024/03/shiba-inu-shib-price-prediction-while-neo-neo-whales-rush-to-insanitybets-ibet-amid-17x-potential",
    "description": "From meme coins like Shiba Inu (SHIB) that capture our imagination to the groundbreaking platforms reshaping decentralized finance like InsanityBets (IBET) there's never a dull moment."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-14T14:42:04.000Z",
    "title": "Promising Digital Crypto Banking Tools Provider, Vault, Plans for $180M Revenue by 2025",
    "url": "https://cryptodaily.co.uk/2024/03/promising-digital-crypto-banking-tools-provider-vault-plans-for-180m-revenue-by-2025",
    "description": "In his interview with U.Today, Vladimir Gorbunov, the Founder of Vault, shared the company's plans to reach $60 million in revenue by the end of 2024 and $180 million by the end of 2025. Gorbunov believes that the crypto-banking market has both the size and demand to achieve these revenue plans, and is favorable for Vault to secure its leadership position in the b2b sector which remains one of the company’s primary goals."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-14T15:07:26.000Z",
    "title": "Ether.fi Unveils Game-Changing DeFi Roadmap: Introducing Liquid and Cash",
    "url": "https://www.cryptopolitan.com/ether-fi-game-changing-defi-liquid-and-cash/",
    "description": "Ether.fi, the innovative non-custodial liquidity staking protocol, has recently announced an ambitious product roadmap that spans the next 12 to 24 months, signaling a significant expansion of its offerings. Currently known for its Stake product, ether.fi is set to diversify its portfolio with the introduction of two new products: Liquid and Cash. These additions are [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-14T14:57:32.000Z",
    "title": "Solana’s popularity could lead to potential threat, crypto expert warns",
    "url": "https://crypto.news/solana-threat-crypto-popularity/",
    "description": "The Solana network is experiencing growing pains due to a surge in user activity, which can lead to several threats."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-14T14:41:12.000Z",
    "title": "Early Dogwifhat investor sold coins for $142k, now worth $23.2m",
    "url": "https://crypto.news/dogwifhat-investor-sold-wif/",
    "description": "An unknown trader spent about $1,170 in Solana to buy 8.18 million Dogwifhat tokens and then sold them for $142,000, which is now valued at $23.2 million."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-14T15:00:53.000Z",
    "title": "Classic Minerals And AuResources Drive Blockchain-Backed Funding For Gold Mining Ventures",
    "url": "https://www.newsbtc.com/news/classic-minerals-and-auresources-drive-blockchain-backed-funding-for-gold-mining-ventures/",
    "description": "Classic Minerals Limited, an Australian gold exploration company, and AuResources AG, a Swiss fintech startup, have begun a $60 million funding initiative to leverage blockchain technology to boost the gold mining and fintech sectors. The collaboration is designed to accelerate the development of Classic&#8217;s gold projects, particularly the Kat Gap Project in Western Australia and the Forrestania Gold Project, by avoiding traditional commodity trade funding. Blockchain-Backed Capital In a move that bypasses traditional banking channels, AuResources, backed by digital and tokenization-focused bank Black Manta Capital, will provide the initial $10 million in funding.  This capital injection is intended to support Classic&#8217;s production capacity at the Kat Gap project and facilitate the development of the Lady Magdalene and Lady Ada deposits. By leveraging blockchain technology, the partnership introduces a new business model that aligns with the companies&#8217; interests.  Related Reading: Solana (SOL) Price Primed For 50% Leap: Experts Turn Bullish Classic&#8217;s Kat Gap project, situated approximately 170km south of Southern Cross, has demonstrated potential. It boasts a $41 million reserve at 2.5 grams per tonne (g/t) and additional inferred resources of $120 million at 2.19g/t within the area.  Following a successful trial mining phase in mid-August 2023, the project has generated revenue, with gold sales surpassing $967,000 across the September and December 2023 quarters. The collaboration with AuResources aims to build upon this initial success, facilitating further exploration. In addition, Classic Minerals has acquired full control of the 500 km² Forrestania Gold Project Properties. The Forrestania Project, with a history of production and resources Inferred and Indicated, represents additional exploration and development for blockchain-backed financing. Gold Financing Enters The Digital Age After a long period of planning and support from investors, Ian Cooper, CEO of AuResources, expressed his excitement about the partnership by stating the following: Being able to reach this milestone today is the result of two years of dedicated work and the unwavering support of our investors. The entire team is proud to move forward, and we couldn&#8217;t have found a better partner than Classic Minerals. Furthermore, the financing structure, backed by gold &#8220;tokens&#8221; using distributed ledger technology, aims to provide investors with increased security and transparency.  Related Reading: Euphoria Or False Dawn? Why The Ethereum $4,000 Party Might End Soon On the other hand, John Lester, Chairman of Classic Minerals, expressed his gratitude towards AuResources and Black Manta Capital Partners for their support, stating:  The launch of this funding round firmly establishes Classic on the international stage. We are now poised to deliver exceptional value to AuResources, Black Manta Capital, and our esteemed shareholders. Overall, the partnership and the new funding strategy underscore the use and wider adoption of blockchain technology within the crypto asset industry and for traditional finance (TradFi) companies such as gold and other commodities.  Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-14T15:02:04.000Z",
    "title": "Syntropy Secures Fresh Funding to Build Out Its Web3 Data Layer",
    "url": "https://www.crypto-news-flash.com/syntropy-secures-fresh-funding-to-build-out-its-web3-data-layer/?utm_source=rss&utm_medium=rss&utm_campaign=syntropy-secures-fresh-funding-to-build-out-its-web3-data-layer",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Press_1710425953gZHADluzbs.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Press_1710425953gZHADluzbs.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Press_1710425953gZHADluzbs-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Press_1710425953gZHADluzbs-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Press_1710425953gZHADluzbs-150x90.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/Press_1710425953gZHADluzbs-450x270.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Gibraltar, Gibraltar, March 14th, 2024, Chainwire Web3 data infrastructure developer Syntropy has announced additional funding from a host of leading blockchain VCs. The fresh capital injection will support Syntropy’s goal of building out modular, interoperable data infrastructure across all major chains. Several high-profile investors have been added to Syntropy’s cap table with the latest raise, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-14T14:40:00.000Z",
    "title": "XRP’s Time Is Coming: Top Analyst Backs XRP Despite Lag",
    "url": "https://coinedition.com/xrps-time-is-coming-top-analyst-backs-xrp-despite-lag/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/03/image1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP&#039;s Time Is Coming: Top Analyst Backs XRP Despite Lag\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/03/image1.png 730w, https://coinedition.com/wp-content/uploads/2024/03/image1-300x169.png 300w, https://coinedition.com/wp-content/uploads/2024/03/image1-380x214.png 380w, https://coinedition.com/wp-content/uploads/2024/03/image1-696x392.png 696w, https://coinedition.com/wp-content/uploads/2024/03/image1-159x89.png 159w, https://coinedition.com/wp-content/uploads/2024/03/image1-255x143.png 255w, https://coinedition.com/wp-content/uploads/2024/03/image1-313x175.png 313w, https://coinedition.com/wp-content/uploads/2024/03/image1-440x247.png 440w, https://coinedition.com/wp-content/uploads/2024/03/image1-414x233.png 414w, https://coinedition.com/wp-content/uploads/2024/03/image1-293x165.png 293w, https://coinedition.com/wp-content/uploads/2024/03/image1-375x211.png 375w, https://coinedition.com/wp-content/uploads/2024/03/image1-328x185.png 328w, https://coinedition.com/wp-content/uploads/2024/03/image1-144x81.png 144w, https://coinedition.com/wp-content/uploads/2024/03/image1-123x70.png 123w, https://coinedition.com/wp-content/uploads/2024/03/image1-129x73.png 129w, https://coinedition.com/wp-content/uploads/2024/03/image1-355x200.png 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto analyst Zach Rector has boldly affirmed his belief that XRP, despite its subdued performance, will not be left behind in the ongoing crypto bull run. Rector expressed this view amid growing pessimism surrounding XRP due to its distasteful performances in the emerging bull run.&#160; Since last October, XRP has seen only a modest 50% [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/xrps-time-is-coming-top-analyst-backs-xrp-despite-lag/\">XRP&#8217;s Time Is Coming: Top Analyst Backs XRP Despite Lag</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]