[
  {
    "source": "CoinDesk",
    "date": "2023-06-26T06:00:00.000Z",
    "title": "NEAR Foundation Partners With Alibaba Cloud to Accelerate Web3 Growth in Asia ",
    "url": "https://www.coindesk.com/business/2023/06/26/embargo-26th-june-7am-bst-near-foundation-partners-with-alibaba-cloud-to-accelerate-web3-growth/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The partnership will offer multi-chain indexing to provide data query API to developers."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-26T06:00:00.000Z",
    "title": "Hedera Integrates ChatGPT For $HBAR Interactions",
    "url": "https://cryptodaily.co.uk/2023/06/hedera-integrates-chatgpt-for-hbar-interactions",
    "description": "<p class=\"md-end-block md-p\">ChatGPT, an advanced natural language AI implementation, has been coupled with Hedera, the decentralized network supporting the $HBAR cryptocurrency.</p>\n<p class=\"md-end-block md-p\">This unique integration is projected to facilitate secure and streamlined interactions between the AI tool and Hedera's various services.</p>\n\n<p dir=\"ltr\" lang=\"en\">Any #ChatGPT users and enthusiasts in the house? 🙋&zwj;♂️Here&rsquo;s a step-by-step guide on how to create a #ChatGPT #plugin that interacts with @hedera This will be useful for those who want to tap into the power of #AI with #blockchain 🤖🧊⛓Happy coding💻https://t.co/yhdWqSkG24</p>\n&mdash; Ed (@ed__marquez) June 23, 2023\n\nAI Fuses Into Blockchain \n<p class=\"md-end-block md-p\">Artificial intelligence implementations such as ChatGPT from OpenAI are semi-autonomous systems capable of learning, decision-making, and adaptation based on minimal user input. Blockchain, on the other hand, provides a secure, immutable method to record transactions or digital interactions. The convergence of these technologies introduces an innovative approach to data processing and utilization.</p>\n<p class=\"md-end-block md-p\">In healthcare, for example, AI could analyze patient records securely stored on a blockchain for personalized treatments. In finance, AI-powered decision-making combined with smart contracts could automate processes ranging from simple transactions to complex investments. The blend of AI's adaptive learning and blockchain's secure, transparent nature opens doors to more intelligent and efficient solutions across numerous sectors.</p>\n<p class=\"md-end-block md-p\">ChatGPT, a conversational AI that responds to text inputs in a human-like manner, is now taking a leap into the blockchain world via a new plugin that interacts with the Hedera network. </p>\nUnpacking ChatGPT and Hedera Integration\n<p class=\"md-end-block md-p\">Hedera, a decentralized, open-source, proof-of-stake, EVM-compatible public ledger, uses a leaderless consensus algorithm. This confers the network with the highest level of security and performance theoretically possible. The network is governed by a collusion-resistant, decentralized council of notable enterprises, universities, and Web3 projects worldwide, such as Google, IBM, and Ubisoft.</p>\n<p class=\"md-end-block md-p\">The network provides several services that facilitate web 3 components and applications development. These services, including the Hedera Consensus Service (HCS), Hedera Token Service (HTS), and Smart Contract Service, are now accessible to ChatGPT via a newly-developed plugin.</p>\n<p class=\"md-end-block md-p\">In essence, this integration allows ChatGPT to retrieve HBAR and other token balances from Hedera accounts. As a result, users can easily monitor and manage their assets on the blockchain.</p>\n<p class=\"md-end-block md-p\">The interaction between AI and blockchain holds immense potential. However, we are in the early stages of this integration. Close observation is necessary to comprehend its full potential and its impact on the broader technological landscape.</p>\nImplications and Potential\n<p class=\"md-end-block md-p md-focus\">This integration between ChatGPT and Hedera presents a unique and significant development in the world of technology. With the AI's capability to engage with blockchain securely, the interaction between these technologies could influence a range of applications in the sector, particularly relating to decentralized applications (dApps).</p>\n<p class=\"md-end-block md-p\">Notably, this ChatGPT-Hedera plugin allows for streamlined asset monitoring and management. Users can retrieve HBAR and other token balances from Hedera accounts, which can simplify the process of monitoring assets on the blockchain.</p>\n<p class=\"md-end-block md-p\">In the context of decentralised marketplaces, the fusion of AI and blockchain could lead to advancements in the ways transactions and interactions are conducted. Blockchain's secure, transparent, and decentralised nature, coupled with AI's advanced computational capabilities, could offer potential benefits in terms of security, transparency, and efficiency.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T06:01:14.000Z",
    "title": "Blockchain Australia’s CEO Appointment Signals Radical Crypto Regulation Shift",
    "url": "https://www.cryptopolitan.com/blockchain-australias-crypto-regulation/",
    "description": "Blockchain Australia, the peak crypto industry body in the country, has named Simon Callaghan as its new CEO. Callaghan, formerly the digital assets program lead for Cambridge University and a co-founder of corporate service provider MOOPS Tech, aims to expedite the regulatory process for cryptocurrencies in Australia. In his new role, Callaghan emphasizes the importance ... <a title=\"Blockchain Australia&#8217;s CEO Appointment Signals Radical Crypto Regulation Shift\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blockchain-australias-crypto-regulation/\" aria-label=\"More on Blockchain Australia&#8217;s CEO Appointment Signals Radical Crypto Regulation Shift\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-26T05:58:14.000Z",
    "title": "ADA Price (Cardano) Could See “Liftoff” if It’s Able to Hold One Crucial Level",
    "url": "https://www.newsbtc.com/analysis/ada/ada-price-cardano-liftoff-0-35/",
    "description": "Cardano’s price is attempting a recovery wave above $0.775. ADA could gain bullish momentum if it settles above the $0.3050 resistance zone. ADA price is slowly moving higher from the $0.250 zone against the US dollar. The price is trading above $0.275 and the 100 simple moving average (4 hours). There is a key bullish trend line forming with support near $0.2780 on the 4-hour chart of the ADA/USD pair (data source from Kraken). The pair could start a decent increase if it settles above the $0.3050 resistance zone. Cardano’s ADA Price Eyes Upside Break This past week, Cardano’s price started a decent recovery wave from the $0.250 support zone. The bulls managed to push the price above the $0.265 and $0.272 resistance levels. It even spiked above the $0.300 resistance. A high is formed near $0.3047 and the price is now consolidating gains, similar to Bitcoin and Ethereum. It is trading below the 23.6% Fib retracement level of the upward move from the $0.2524 swing low to the $0.3047 high. ADA is now trading above $0.275 and the 100 simple moving average (4 hours). There is also a key bullish trend line forming with support near $0.2780 on the 4-hour chart of the ADA/USD pair. Source: ADAUSD on TradingView.com On the upside, immediate resistance is near the $0.300 zone. The next major resistance is forming near the $0.305 zone. If there is an upside break above the $0.300 and $0.305 resistance levels, the price could start a decent increase. In the stated case, the price could even surpass the $0.320 resistance zone. The next key resistance might be $0.348, above which it could test $0.40. Fresh Decline in ADA? If Cardano’s price fails to climb above the $0.300 and $0.305 resistance levels, it could start another decline. Immediate support on the downside is near the $0.380 level and the trend line. The next major support is near the $0.275 level or the 61.8% Fib retracement level of the upward move from the $0.2524 swing low to the $0.3047 high. A downside break below the $0.275 level could open the doors for a fresh decline toward $0.254. The next major support is near the $0.232 level. Technical Indicators 4 hours MACD – The MACD for ADA/USD is losing momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for ADA/USD is now below the 50 level. Major Support Levels – $0.280, $0.275, and $0.254. Major Resistance Levels – $0.300, $0.305, and $0.348."
  }
]