[
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T05:26:39.000Z",
    "title": "Major Australian bank to decline ‘certain’ payments to crypto exchanges",
    "url": "https://cointelegraph.com/news/commonwealth-bank-decline-limit-payments-to-high-risk-crypto-exchanges",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/06ead170-14de-4587-8473-aa7ca8a0999e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>James Roberts, Commonwealth Bank General Manager of Group Fraud Management Services cited a huge scale of \"investment scams\" involving crypto exchanges.</p>\n                    <p><p>Commonwealth Bank (CBA), the largest bank in Australia, has said it will decline or temporarily hold payments to cryptocurrency exchanges citing the risk of scammers. </p><p>On June 8, CBA <a href=\"https://www.commbank.com.au/articles/newsroom/2023/06/changes-on-payments-to-crytocurrency-exchanges.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a> it would decline or put a 24-hour hold on \"certain payments to cryptocurrency exchanges.\" The bank did not explain which exchanges would be impacted by the new measures.</p><p>\"Commonwealth Bank has today introduced new measures to help protect customers from scam risks associated with making certain payments to cryptocurrency exchanges,\" it wrote in a statement.</p><p>It added a $6,650 ($10,000 Australian dollar) per month limit on customers sending funds to crypto exchanges to purchase cryptocurrencies would be introduced \"in the coming months.\"</p><p>\"From today, CBA will decline or hold for 24 hours certain payments to cryptocurrency exchanges. In coming months the Bank will also introduce $10,000 limits in a calendar month where the Bank can identify the customer payments are to exchanges for cryptocurrency purchases,\" it said.</p><p>The general manager of CBA's fraud management services, James Roberts, claimed that \"scammers globally are capitalizing\" on the interest in crypto, pretending to be \"legitimate investment opportunities or diverting funds into cryptocurrency exchanges.\"</p><p>The bank said the measure would be \"subject to ongoing review\" and it would monitor the impact of the measures.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T05:10:00.000Z",
    "title": "Do Kwon could serve prison in both US and South Korea, prosecutor says",
    "url": "https://cointelegraph.com/news/do-kwon-could-serve-prison-in-both-us-south-korea-prosecutor",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/fc507307-c927-4afd-b944-c05cea9f3264.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>South Korean senior prosecutor Dan Sunghan says Kwon's extradition to South Korea makes better sense, but suggested Kwon could also serve time in the US too. </p>\n                    <p><p>Terraform Labs co-founder and CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/do-kwon\">Do Kwon</a> may be subject to multiple sentences in the United States and South Korea, according to a senior South Korean prosecutor heading the investigation.</p><p>It is understood that Kwon is currently serving house bail in Montenegro, after having his bail proposal granted by <a href=\"https://cointelegraph.com/news/do-kwon-granted-bail-again-montenegro\">a Montenegro court</a> on June 5. Both Kwon and Terraform Labs’ chief financial officer Han Chang-Joon are legally required to reside at Chang-Joon's legal residence in Montenegro while a decision about extradition is made.</p><p><a href=\"https://www.bloomberg.com/news/articles/2023-06-08/fallen-crypto-mogul-kwon-could-face-jail-in-south-korea-and-us-prosecutor-says\" target=\"_blank\" rel=\"noopener nofollow\">Speaking</a> to Bloomberg, Dan Sunghan revealed that Kwon’s extradition to South Korea made better sense “when it comes to bringing justice or recovering the damages for victims.” </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/ab0f802f-4330-4fd9-bc50-7cbccbce03c9.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>South Korean senior prosecutor Dan Sunghan speaking about the possibility of Kwon facing multiple sentences across the U.S. and South Korea. Source: Bloomberg</em></figcaption></figure><p>According to Sunghan, most of the basic investigation around the collapse of the Terra ecosystem was done in South Korea. He further claimed local authorities have access to more evidence when compared to their American counterparts.</p><blockquote>“The most efficient way to get justice is to have the investigation and trial take place in South Korea.”</blockquote><p>Sunghan also stressed the fact that South Korean authorities have already indicted a number of Kwon’s co-conspirators.</p><p>However, when asked about the possibility of Kwon having to face a trial in both the U.S. and South Korea, Sunghan believed “such a scenario is an option.” A convict is subject to multiple cross-border sentences when they are yet to be prosecuted for some of the crimes in one of the jurisdictions, he explained.</p><p>Thus, Sunghan said if South Korean authorities don’t account for all the crimes Kwon is charged with within the U.S., then the entrepreneur could potentially be sent to the US for prosecution after serving his sentence in South Korea — which could be over 40 years alone.</p><p>The prosecutor expects Kwon’s sentence to be “the longest sentence ever handed down in South Korea.” Kwon’s cold wallet, which supposedly contains 10,000 Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), remains untraceable.</p><p> Sunghan confirmed that authorities can see funds being moved from the wallet in question. However, the location of the wallet and the process used to withdraw the funds remains a mystery. </p><p>“This is the largest financial fraud or financial securities fraud case that has ever happened in South Korea,” said Sunghan.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"> JUST IN:  <a href=\"https://twitter.com/hashtag/DoKwon?src=hash&amp;ref_src=twsrc%5Etfw\">#DoKwon</a> has been released on bail once again after Montenegro  court dismisses prosecution appeal <a href=\"https://t.co/zOlpLqU17S\">pic.twitter.com/zOlpLqU17S</a></p>&mdash; Crypto Rand (@crypto_rand) <a href=\"https://twitter.com/crypto_rand/status/1665652402777649153?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Kwon was held by Montenegro authorities on March 23 after he was <a href=\"https://cointelegraph.com/news/do-kwon-reportedly-arrested-in-montenegro\">caught trying to fly out of the country using fake documents</a>. Soon after, both the US and South Korean <a href=\"https://cointelegraph.com/news/us-and-south-korea-request-extradition-of-terra-co-founder-do-kwon\">authorities requested his extradition to their respective countries</a>. According to South Korean prosecutor Dan Sunghan, some extradition requests can take up to nine months for processing.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/south-korea-bitcoin-crypto-disclosure-bill-passes-national-assembly\"><strong><em>South Korea passes bill to make officials disclose Bitcoin holdings</em></strong></a></p><p>Meanwhile, South Korean <a href=\"https://cointelegraph.com/news/sec-lawsuit-against-binance-stalls-gopax-acquisition-deal-in-south-korea\">authorities have started reviewing Binance’s acquisition deals</a> in the country after the crypto exchange got into a legal battle with the United States Securities and Exchange Commission (SEC).</p><p>A local report suggests that South Korea’s financial watchdog — the Financial Service Committee (FSC) — is reviewing Binance’s acquisition of local crypto trading platform Gopax.</p><p>In its review of the Gopax deal, the FSC pointed out that Binance’s alleged securities law violations and requests from the SEC to freeze Binance.US assets make it difficult to accept the acquisition request at this point.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-08T05:30:43.000Z",
    "title": "SEC Actions in US May Affect Binance in Other Regions, Hong Kong Lawyer Says",
    "url": "https://news.bitcoin.com/sec-actions-in-us-may-affect-binance-in-other-regions-hong-kong-lawyer-says/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2313368769-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SEC Actions in US May Affect Binance in Other Regions, Hong Kong Lawyer Says\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2313368769-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2313368769-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2313368769-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2313368769-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2313368769-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2313368769-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2313368769.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The crackdown initiated by the U.S. Securities and Exchange Commission (SEC) may affect Binance in other regions and its license application in Hong Kong, according to a crypto-compliance lawyer. The expert believes the regulator wants the largest digital asset exchange to leave the United States. U.S. SEC Crackdown on Binance Is Different, Legal Expert Says [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T05:28:51.000Z",
    "title": "Aave Unveils Native Stablecoin $GHO, Redefining DeFi Possibilities",
    "url": "https://www.cryptopolitan.com/aave-stablecoin-gho-defi-possibilities/",
    "description": "Aave, a pioneering decentralized finance (DeFi) protocol, has unveiled a groundbreaking proposal that is set to redefine the possibilities within the DeFi landscape. With the introduction of GHO, a native stablecoin on the Ethereum mainnet, Aave empowers users to mint tokens using collateral, offering a new level of financial flexibility. This user-centric initiative not only ... <a title=\"Aave Unveils Native Stablecoin $GHO, Redefining DeFi Possibilities\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-stablecoin-gho-defi-possibilities/\" aria-label=\"More on Aave Unveils Native Stablecoin $GHO, Redefining DeFi Possibilities\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-08T05:37:08.000Z",
    "title": "Ways Portfolio Diversification Principle Can Help Save You From Getting Rekt",
    "url": "https://nulltx.com/ways-portfolio-diversification-principle-can-help-save-you-from-getting-rekt/",
    "description": "Investors diversifying their portfolio is an essential tactic that can shield them from big losses in the cryptocurrency space, due to so much volatility involved. Cryptocurrencies can be risky investments due to their unpredictable volatility and quick price changes. Investors can reduce these risks and improve their chances of avoiding &#8220;getting rekt&#8221; by employing the [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-08T05:23:27.000Z",
    "title": "Navigating the Risks and Rewards of Investing in Pepe (PEPE), HedgeUp (HDUP), and Dogecoin (DOGE)",
    "url": "https://nulltx.com/navigating-the-risks-and-rewards-of-investing-in-pepe-pepe-hedgeup-hdup-and-dogecoin-doge/",
    "description": "The last long bear market lasted about a year and a half to two years. If history repeats itself, crypto as a whole should break free of the down market it’s been in very soon. Many investors expect that to happen this summer and are choosing the projects out there that suit them the best. [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-08T05:16:51.000Z",
    "title": "Dogecoin (DOGE) and HedgeUp (HDUP) Surge:  a Sign of Growing Mainstream Acceptance?",
    "url": "https://nulltx.com/dogecoin-doge-and-hedgeup-hdup-surge-a-sign-of-growing-mainstream-acceptance/",
    "description": "As with any marketplace, the consumer is the ultimate authority. By watching where consumers are putting their money, trends will show what works and what doesn’t. This year, a big trend has been the widespread adoption of meme coins. The quirky tokens with tons of personality but little to no use cases have always had [&#8230;]"
  }
]