[
  {
    "source": "Decrypt",
    "date": "2023-10-30T22:53:30.000Z",
    "title": "God Mode: 7 Spooky Games for Halloween That Won't Scare You to Death",
    "url": "https://decrypt.co/203724/god-mode-7-spooky-games-halloween-wont-scare-death",
    "description": "Want to enjoy eerie vibes rather than shake with fear? These Halloween-ready games are unsettling, but aren't too grisly or horrifying."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T23:04:47.000Z",
    "title": "FTX ambassadors in Africa receive alarming threats",
    "url": "https://www.cryptopolitan.com/ftx-ambassadors-in-africa-receive-threats/",
    "description": "In an unsettling turn of events, former ambassadors of the FTX cryptocurrency exchange are facing severe backlash and threats to their personal safety across various regions in Africa. These individuals, primarily students, once part of a grand scheme to amplify FTX’s presence and user base on the continent, now find themselves at the receiving end ... <a title=\"FTX ambassadors in Africa receive alarming threats\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ftx-ambassadors-in-africa-receive-threats/\" aria-label=\"More on FTX ambassadors in Africa receive alarming threats\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T22:58:31.000Z",
    "title": "Fed’s latest interest rate gambit: Hit or miss?",
    "url": "https://www.cryptopolitan.com/feds-latest-interest-rate-gambit-hit-or-miss/",
    "description": "The recent maneuvering of the Federal Reserve with their interest rates has been nothing short of a high-stakes gamble, leaving investors hanging on the edge of their seats. The Fed’s top brass has adopted a ‘higher-for-longer’ monetary policy stance, implying that while interest rates may not skyrocket any further, they’re definitely not plummeting back down ... <a title=\"Fed&#8217;s latest interest rate gambit: Hit or miss?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/feds-latest-interest-rate-gambit-hit-or-miss/\" aria-label=\"More on Fed&#8217;s latest interest rate gambit: Hit or miss?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T22:51:43.000Z",
    "title": "Bill Morgan announces XRP healthcare’s middle east expansion",
    "url": "https://www.cryptopolitan.com/bill-morgan-announces-xrp-healthcares-in-middle-east/",
    "description": "Bill Morgan, a leading advocate for XRP, has relayed exhilarating updates to the XRP community about XRP Healthcare. This notable platform, the first of its kind operating on the XRP Ledger (XRPL) within the pharmaceutical and healthcare sector, has declared its entrance into the buoyant healthcare markets of Dubai and the Middle East. Kain Roomes, ... <a title=\"Bill Morgan announces XRP healthcare&#8217;s middle east expansion\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bill-morgan-announces-xrp-healthcares-in-middle-east/\" aria-label=\"More on Bill Morgan announces XRP healthcare&#8217;s middle east expansion\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T22:50:55.000Z",
    "title": "dYdX Chain takes DeFi to new horizons with native blockchain launch",
    "url": "https://www.cryptopolitan.com/dydx-native-chain-officially-goes-live/",
    "description": "dYdX, a significant decentralized exchange (DEX), has officially transitioned from its Ethereum base to launch its native chain. This marks the first instance of a major DEX opting for autonomy by setting up its own native blockchain. Notably, this significant move allows users to move away from the Ethereum protocol and engage in staking activities ... <a title=\"dYdX Chain takes DeFi to new horizons with native blockchain launch\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dydx-native-chain-officially-goes-live/\" aria-label=\"More on dYdX Chain takes DeFi to new horizons with native blockchain launch\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-30T23:00:32.000Z",
    "title": "Shiba Inu Burn Rate Nosedives Following 7,700% Jump, What Happened?",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-burn-rate-nosedives/",
    "description": "The Shiba Inu burn initiative continues this week but with a drastic decline in volume. The latest figure which shows a decreased participation from investors could have long-running significant implications for the SHIB price. SHIB Burn Rate Drops From 7,700% Spike Over the last 24 hours, Shibburn has shown that the SHIB burn rate has been less than encouraging. The burn tracker revealed a total of 106.72 million tokens burned in the 23-hour period, which is a significant decline of almost 60% from the prior day’s figures. Related Reading: The End Is Near For Trellor (TRB): Crypto Analyst Says Prepare For 50% Drop Now, the interesting thing is not just the fact that the Shiba Inu burn rate plunged but how far it plunged. Coming out of the weekend, the burn tracker had flagged an over 7,700% spike in the burn rate, which makes the current deceleration concerning. Source: Shibburn There were only a total of five transactions that burned SHIB in the last 24-hour period, with one wallet “0x75d9” doing the majority of the work at this time. The wallet address alone had 100 million tokens, accounting for around 98% of the total burn figure. At the time of writing, there has not been a single Shiba Inu burn transaction in the last 8 hours amid the slowdown. However, there has been an uptick on the weekly chart which suggests the current deceleration might be localized to just the 24-hour period. Shibburn shows an increase of 151.4% over the last 7 days, bringing the total burned figure to above 620 million. SHIB bears tussle with bulls for control &#124; Source: SHIBUSD on Tradingview.com Shiba Inu Sustains Rally Despite the decline in the burn rate, the Shiba Inu price remains resolved to go the other way. The altcoin’s price crossed the $0.000008 mark and bulls have demonstrated a strong hold on the coin. This has resulted in an 11.75% rise in the last day compared to a 9.38% increase in the last week. Daily volume for the digital asset is down 14.75% though, so it could mean that this rally is destined to be short-lived. However, if the SHIB price can maintain its hold above the 50-day moving average, then it will provide the momentum needed for the rally to continue. Related Reading: Crypto Analyst Who Called Bitcoin’s Parabolic Rally Picks Altcoin Set To Pop The recovery is also closely linked to the Bitcoin price recovery, which means a drawdown in Bitcoin could also mean a drawdown in the SHIB price. So the Bitcoin price will be important to keep an eye on to figure out SHIB’s next moves. Presently, SHIB is trading at $0.00000804. with a market cap of $4.74 billion, it is the 19th-largest cryptocurrency in the space. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  }
]