[
  {
    "source": "CryptoSlate",
    "date": "2024-03-04T22:43:39.000Z",
    "title": "Coinbase experiences second zero-balance bug in five days",
    "url": "https://cryptoslate.com/coinbase-experiences-second-zero-balance-bug-in-five-days/",
    "description": "<p>Crypto exchange Coinbase once again experienced an issue that caused some users to see an empty balance in their accounts on March 4. At 5:36 pm UTC, the company wrote: &#8220;A small subset of users may see intermittent zero balance across their Coinbase accounts and latency across pages. Trading is not impacted at this time. [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/coinbase-experiences-second-zero-balance-bug-in-five-days/\">Coinbase experiences second zero-balance bug in five days</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-04T23:03:56.000Z",
    "title": "Altcoin season is still getting traction: Bitfinex report",
    "url": "https://cryptobriefing.com/altcoin-season-gains-traction-memecoins-ai-lead/",
    "description": "Altcoin market cap approaches $640B with memecoins and AI projects driving the surge."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-04T23:00:03.000Z",
    "title": "Marathon Mines Record-Breaking 4 MB Bitcoin Block Linked to Runestone Airdrop",
    "url": "https://news.bitcoin.com/marathon-mines-record-breaking-4-mb-bitcoin-block-linked-to-runestone-airdrop/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/marablcoks-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Marathon Mines Record-Breaking 4 MB Bitcoin Block Linked to Runestone Airdrop\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/marablcoks-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/marablcoks-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/marablcoks-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/marablcoks-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/marablcoks-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/marablcoks-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/marablcoks.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />During bitcoin&#x2019;s extraordinary price peaks in March, this week saw the mining of the biggest block by byte size, with Marathon&#x2019;s mining pool producing a 3.99 megabyte (MB) block. This block, labeled as 832,849, carried a message linked to the Runestone airdrop. Bitcoin Blockchain Witnesses Unprecedented 4 MB Block Over the recent weekend, Marathon, a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-04T23:09:06.000Z",
    "title": "Solana DEXs achieve record $11B trading milestone: Details",
    "url": "https://www.cryptopolitan.com/solana-dexs-record-11b-trading-milestone/",
    "description": "Solana-based decentralized exchanges (DEXs) have experienced a record-breaking week in trading volume, surpassing previous highs and underscoring the blockchain&#8217;s growing activity.&#160; Between Feb. 24 and Mar. 2, Solana DEXs facilitated over $11.19 billion worth of digital asset trades, marking a 154% increase from the volume recorded in the preceding week, according to data from DeFi [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-04T23:08:16.000Z",
    "title": "MicroStrategy stock sees impressive surge as Bitcoin maintains bull run",
    "url": "https://www.cryptopolitan.com/microstrategy-stock-sees-impressive-surge/",
    "description": "On March 4th, the early trading hours in the United States saw MicroStrategy&#8217;s (MSTR) stock price jump more than 20%, holding a strong gain of over 15% by noon. This company, known for its huge investments in Bitcoin, saw its shares soar from a previous close of $1,079 on March 3 to an opening price [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-04T22:52:12.000Z",
    "title": "Bitcoin inches really close to all-time high as it blasts past $67,000",
    "url": "https://www.cryptopolitan.com/bitcoin-inches-really-close-to-all-time-high/",
    "description": "Kicking off the week with a bang, Bitcoin blasted past $67,000, showing off with a swagger that says, &#8220;I&#8217;m not here to play.&#8221; For a hot minute, the apex crypto was worth $67,977, making eyes at its November 2021 peak like an ex at a high school reunion. Ethereum, not wanting to be left in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-04T22:46:23.000Z",
    "title": "Charles Hoskinson backs John Deaton for US Senate",
    "url": "https://www.cryptopolitan.com/charles-hoskinson-backs-john-deaton/",
    "description": "Charles Hoskinson, the founder of Cardano, has contributed a legal donation of $3,300 to John Deaton, a lawyer and cryptocurrency advocate, who is contesting for the United States Senate against incumbent Senator Elizabeth Warren in Massachusetts. Hoskinson announced his support for Deaton on X, emphasizing the need for candidates who challenge the current legislative approach [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-04T22:44:18.000Z",
    "title": "Bitcoin and Gold Surge as Investors Anticipate Interest Rate Cuts",
    "url": "https://www.cryptopolitan.com/bitcoin-and-gold-surge-to-new-heights/",
    "description": "Bitcoin soared to new heights, reaching a peak of $67,584, the highest level it has achieved in over two years. This surge has sparked anticipation among investors, with many predicting that BTC is on the brink of surpassing its previous all-time high of $68,999.99, set in November 2021. The cryptocurrency has exhibited remarkable resilience and [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-04T23:00:47.000Z",
    "title": "Crypto Expert Says ‘Prepare Yourself’ For Massive Altcoin Run, Here’s Why",
    "url": "https://www.newsbtc.com/altcoin/crypto-expert-altcoin-run/",
    "description": "Cryptocurrency analyst, Michael van de Poppe has alerted the broader cryptocurrency community about an upcoming altcoin rally. The analyst has cited the recent upward trend experienced by Bitcoin as a positive signal for this prediction.  Get Ready For Major Altcoin Run In a recent X (formerly Twitter) post, Poppe suggested that altcoins are poised to become the next in line for the 2024 bullish momentum. Citing Bitcoin’s recent upward surge to over $60,000, the crypto analyst has disclosed that this substantial price increase is a clear signal for a potential altcoin rally in the market.  Related Reading: Bitcoin Profitability Reaches 97% For The First Time In Over 2 Years He predicts that during this potential altcoin run, major cryptocurrencies may experience substantial surges that could potentially push their prices far above their previous all-time highs. In light of this, the crypto analyst has advised the broader cryptocurrency community to remain vigilant and make necessary preparations for this anticipated bullish event.  Lately, market sentiment has been indicating a shift from Bitcoin investments to meme coins and other major altcoins. Just last week, a Solana-based memecoin, Dogwifhat (WIF) experienced a massive surge, propelling its price to $1 and boasting a year-to-year gain of over 90%.  Furthermore, popular altcoins like Solana and Cardano have witnessed significant price increases and growth in their respective markets. On March 1, Solana’s price surged to two-year highs, skyrocketing above $136. Conversely, Cardano recorded a boost in its adoption rate, with the total number of Cardano wallets in the ecosystem approaching 4.6 million.  These subtle developments are indicating a potential shift in the market dynamics of altcoins, as an increasing number of cryptocurrencies are beginning to mirror Bitcoin’s bullish momentum.  Altcoins Gearing To Pump A crypto analyst, identified as “Dami Defi” on X has disclosed that recent market trends are signaling that “altcoins are getting ready to pump.” Dami Defi’s predictions are anchored in the diminishing dominance of Bitcoin in the cryptocurrency market. He explained that when the market capitalization of the entire crypto market is on the rise and simultaneously, Bitcoin’s dominance decreases, it often signals a healthy and widespread bull market in the crypto space.  Related Reading: Crypto Exchange Says Cardano Price Can Reach $165, Here’s When According to the analyst, this scenario implies that the market’s growth is not solely focused on Bitcoin but would also potentially be distributed across various altcoins. He has revealed that despite Bitcoin’s recent price rally, the cryptocurrency has been experiencing notable outflows, with a substantial portion of these funds moving into altcoins.  “If we continue to see BTC dominance go down and total 3 resistance gets broken, all hell will break lose and altcoins will pump crazy,” Dami Defi stated.  Altcoins market cap at $1.08 trillion &#124; Source: Crypto Total Marekt Cap Exclusing BTC Featured image from Coinpedia, chart from Tradingview.com"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-04T22:54:09.000Z",
    "title": "$1.3+ Trillion: Bitcoin Market Cap Sets New Record All-Time High",
    "url": "https://www.newsbtc.com/news/bitcoin/1-3-trillion-bitcoin-market-cap-sets-new-record-all-time-high/",
    "description": "Considering the seemingly unstoppable momentum in Bitcoin price action, a new all-time high on the BTCUSD trading pair is less than 2% away. Meanwhile, due to the supply of new BTC unlocked since 2021, the BTC market cap chart has reached a new all-time high above $1.3 trillion. BTC Market Cap Sets New Record ATH Crypto bulls have something to celebrate today, even if BTCUSD doesn&#8217;t make a new all-time high just yet. That&#8217;s because the market cap chart has, and the total value of the Bitcoin network is currently around $1.33 trillion. Related Reading: Why “Overbought” Bitcoin Could Trigger A 107% Rally The previous peak was squarely set at $1.3 trillion back in December 2021, just prior to the top cryptocurrency falling into the troughs of a bear market. BTC Market Cap is now $1.33 trillion &#124; BTCUSD on TradingView.com Other Bitcoin Charts At New Record Highs The BTC market cap chart as calculated by TradingView, isn&#8217;t the only non-USD chart that&#8217;s made new all-time highs. The reigning king of crypto has also broken records in over a dozen different national currencies, such as the Australian Dollar, which is trading over $100,000 per coin. Related Reading: Bitcoin Gives Early Top Warning Signal, But Price Could Double First At current prices of $67,900, BTCUSD is less than 2% away from a new all-time high itself. Can the top cryptocurrency set a new record this week? Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from Shutterstock, Charts from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-04T23:01:00.000Z",
    "title": "Judge in Coinbase Insider Trading Case Says Secondary Market Sales Were Securities Transactions",
    "url": "https://dailyhodl.com/2024/03/04/judge-in-coinbase-insider-trading-case-says-secondary-market-sales-were-securities-transactions/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Decision-To-Sue-Coinbase.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Decision-To-Sue-Coinbase.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Decision-To-Sue-Coinbase.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Decision-To-Sue-Coinbase.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Decision-To-Sue-Coinbase.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Decision-To-Sue-Coinbase.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Decision-To-Sue-Coinbase.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A US judge in Coinbase&#8217;s insider trading case is declaring that secondary market sales of crypto assets are considered securities transactions. In July of 2022, the SEC filed a complaint accusing Ishan Wahi of giving his brother and a friend, Sameer Raman, confidential information about which crypto assets were to be supported by Coinbase. The former [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/04/judge-in-coinbase-insider-trading-case-says-secondary-market-sales-were-securities-transactions/\">Judge in Coinbase Insider Trading Case Says Secondary Market Sales Were Securities Transactions</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]