[
  {
    "source": "Decrypt",
    "date": "2023-11-09T03:59:21.000Z",
    "title": "Congress Moves to Clip the SEC's Wings as Gensler Signals Openness to a Revived FTX",
    "url": "https://decrypt.co/205293/gary-gensler-ineffective-incompetent-revived-ftx",
    "description": "Hitting out at the SEC Chair, Representative Tom Emmer called Gary Gensler “ineffective” and “incompetent.”"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-09T03:45:00.000Z",
    "title": "AI’s Impactful Journey in Reducing Sudden Cardiac Death Risks",
    "url": "https://www.cryptopolitan.com/ais-journey-reducing-sudden-cardiac-death/",
    "description": "In a groundbreaking stride toward global health strategies, preliminary research presented at the American Heart Association&#8217;s Resuscitation Science Symposium 2023 suggests that artificial intelligence (AI) might hold the key to predicting and preventing sudden cardiac death. This revelation comes at a crucial juncture, as sudden cardiac death remains a significant public health concern, constituting 10% ... <a title=\"AI&#8217;s Impactful Journey in Reducing Sudden Cardiac Death Risks\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ais-journey-reducing-sudden-cardiac-death/\" aria-label=\"More on AI&#8217;s Impactful Journey in Reducing Sudden Cardiac Death Risks\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-09T04:00:54.000Z",
    "title": "Polygon Labs And NEAR Foundation Partner For zkWasm L2 Prover Integration",
    "url": "https://www.newsbtc.com/analysis/matic-analysis/polygon-labs-and-near-foundation-partner-for-zkwasm-l2-prover-integration/",
    "description": "Polygon Labs (MATIC) and the NEAR Foundation have recently announced their collaboration on the development of a zero-knowledge (ZK) prover for the WebAssembly (Wasm) blockchain.   The alliance aims to “bridge the gap” between Wasm-based chains and the Ethereum ecosystem, providing customization and options for developers building with the Polygon CDK (Chain Development Kit). NEAR Foundation Joins Polygon As Core Contributor According to Polygon Labs’ announcement, introducing a zkWasm prover will enable developers utilizing Polygon CDK to choose from various provers when building their projects. This can be leveraged in various scenarios, including launching or migrating an Ethereum Virtual Machine (EVM) chain or constructing a Wasm chain for closer alignment with Ethereum and access to liquidity.  Related Reading: Exploring The Resurgence Of BNB: Unveiling The Force Behind Renewed Interest The zkWasm prover will serve as a new runtime, generating zero-knowledge proofs that validate the correctness of native Wasm runtime execution. This advancement is expected to enhance scalability and decentralization, bringing the NEAR protocol closer to Ethereum. As part of this partnership, the NEAR Foundation is set to become a core contributor to Polygon CDK, expanding the toolkit&#8217;s capabilities for developers. Sandeep Nailwal, the co-founder of Polygon, expressed pride in collaborating with NEAR on this research and emphasized the value of the zkWasm prover in providing developers with increased customization options.  To provide further context, WebAssembly is a widely used framework for running complex programs in web browsers, offering performance comparable to native computer applications. In the context of Web3, the Wasm Virtual Machine serves as a runtime for blockchains like NEAR and Polkadot, differing from the Ethereum Virtual Machine. Scalability And Decentralization Boost? Per the announcement, in the future, an in-development interop layer will allow chains to join a unified ecosystem of Layer 2 solutions deployed through Polygon CDK.  This ecosystem will encompass alternative layer-1 chains, EVM layer-2 solutions, and Wasm chains, providing interoperability and defragmentation of liquidity across different chains. Related Reading: Solana Whale Deposits $11M In SOL To Binance, Bearish Signal? Illia Polosukhin, co-founder of NEAR Protocol, expressed optimism about the collaboration, emphasizing that it will bring the benefits of zero-knowledge proofs not only to NEAR but to the entire Web3 ecosystem. Polosukhin stated: We are very excited to work with Polygon Labs to bring all the benefits of zero-knowledge proofs not just to NEAR but all of Web3. NEAR is integrating more with Ethereum by innovating in new research frontiers, and the shared expertise of these two teams will bring a much-needed expansion of the ZK landscape and defragmentation of liquidity across chains. And by creating and using the zkWasm prover, NEAR will also improve the scalability and decentralization of the NEAR L1. Overall, the collaboration between Polygon Labs and the NEAR Foundation holds significant implications for both protocols. Integrating the zkWasm prover will enhance the capabilities of Polygon CDK, providing developers with more options in building “custom blockchains.”  Additionally, it will bring NEAR Protocol closer to Ethereum, expanding its interoperability and liquidity opportunities.  As of the latest update, MATIC, the native token of Polygon, is on the verge of reaching the $0.800 level, a milestone that has not been attained since July. The token currently trades at $0.7903, showcasing a noteworthy upward trajectory.  This positive movement is further bolstered by an impressive 11% uptrend recorded over the past 24 hours.  Featured image from Shutterstock, chart from TradingView.com "
  }
]