[
  {
    "source": "CoinDesk",
    "date": "2024-03-06T00:00:00.000Z",
    "title": "Polygon Lands First User of New 'AggLayer,' Inking Deal With Astar Network",
    "url": "https://www.coindesk.com/tech/2024/03/06/polygon-lands-first-user-of-new-agglayer-inking-deal-with-astar-network/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "By plugging into the AggLayer, Astar users will have access to the liquidity in the Polygon ecosystem, allowing cross-chain transactions between Astar and Polygon zkEVM, making the experience feel like a single chain."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-06T00:00:00.000Z",
    "title": " Lotte subsidiary partners with Aptos to build Web3 hub ",
    "url": "https://cointelegraph.com/news/lotte-partners-aptos-build-web3-hub",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvY2NlZTI1M2EtMTA4Yy00MWUyLWFlZTktNGEwMzk2NjIzNzFjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The partnership is aimed at creating a Web3 hub for Lotte, a South Korean multinational conglomerate corporation that oversees roughly 90 business units.</p>\n                    <p><p data-ct-non-breakable=\"true\">South Korean advertising firm Daehong Communications, a subsidiary of Lotte Group, has partnered with Aptos Labs to undertake Web3-powered strategic global expansion. </p><p>The partnership between Daehong and Aptos marks the commencement of the creation of a Web3 hub for Lotte, a South Korean multinational conglomerate corporation that oversees roughly 90 business units. In an announcement shared with Cointelegraph, Daehong revealed plans to introduce loyalty programs, <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\"></a><a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">NFT-based</a> profile picture projects, and entertainment, among other initiatives within Lotte Group’s Web3 hub.</p><p>Daehong also laid the groundwork for upcoming nonfungible token projects and use cases for other subsidiaries of Lotte Group. Future Web3 initiatives will include loyalty programs for improving fan engagement and new payment services that aid collectibles preservation and eradicating counterfeit tickets. </p><p><a href=\"https://cointelegraph.com/news/lotte-partners-aptos-build-web3-hub\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-06T00:00:00.000Z",
    "title": " Astar Network launches Astar zxEVM on Polygon AggLayer ",
    "url": "https://cointelegraph.com/news/astar-network-launches-blockchain-astar-zx-evm-polygon-agg-layer",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMWU0MTBmYTctOGJiZi00YjBiLWE5YjYtNGY1NTVmZDcxNzJmLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The new zero-knowledge layer-2 chain is the first to be integrated into AggLayer.</p>\n                    <p><p data-ct-non-breakable=\"true\">Astar Network, a blockchain firm based in Japan, launched Astar zxEVM on March 5, becoming the first layer-2 chain to integrate into Polygon’s AggLayer.</p><p>Astar zkEVM is a zero-knowledge layer-2 chain designed to enable cross-chain transactions between the Astar and Polygon blockchains. It’s integrated through AggLayer, a protocol that supports multichain smart contracts via aggregate zero-knowledge proofs (ZK-proofs), essentially making the chains seemingly operate for end-users as though they’d merged into a single network.</p><p>According to a blog post from Polygon Labs, AggLayer <a href=\"https://polygon.technology/blog/aggregated-blockchains-a-new-thesis\" target=\"_blank\" rel=\"noopener nofollow\">brings</a> “uniform cryptographic security and atomic composability across aggregated chains without sacrificing sovereignty,” which is to say that transactions remain immutable throughout the entire process of crossing chains. </p><p><a href=\"https://cointelegraph.com/news/astar-network-launches-blockchain-astar-zx-evm-polygon-agg-layer\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-06T00:00:52.000Z",
    "title": "Astar Network unveils zkEVM as first layer-2 on Polygon’s AggLayer",
    "url": "https://cryptobriefing.com/astar-network-launches-zkevm-layer-2-polygon-agglayer/",
    "description": "Astar Network launches Astar zkEVM, the first layer-2 on Polygon's AggLayer, revolutionizing Web3 UX and unifying blockchain tech in Japan."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-06T00:05:35.000Z",
    "title": "Analyst Predicts Massive Rally For Dogecoin Price With A $1 Target, Here’s How",
    "url": "https://www.newsbtc.com/news/dogecoin/massive-rally-dogecoin-price-1/",
    "description": "Dogecoin recently jumped to the $0.2 level for the first time since November 2021 amidst a month of exceptional bullish price action. Notably, DOGE is currently up by 128% this month and 97% in the past seven days, giving DOGE holders something to be happy about. According to a crypto analyst, this price surge is expected to continue and go parabolic to the $1 mark in this market cycle.  Dogecoin Set To Perform Exceptionally Well Current market dynamics and bullish sentiment have seen DOGE shooting up in market capitalization after an extended consolidation period. A recent surge past the $0.20 price level saw DOGE briefly overtaking Cardano and jumping up to the eighth position in market cap rankings.  Related Reading: Bitcoin Will Reach A New All-Time High This Week, Matrixport Head Of Research Says In a post shared on social media platform X, a crypto analyst known as Altcoin Sherpa, noted this recent surge as a sign of better things to come in this cycle. While the analyst didn&#8217;t give a particular price point, he noted that a $1 price per Dogecoin wouldn&#8217;t be too surprising. $DOGE: Several notes on this one- -Its going to go to crazy #s this cycle, I don&#8217;t know what. $1 wouldn&#8217;t honestly surprise me. -Chart itself looks good, consolidated for like 600 days. -Given the overall mc, this one is NOT going to give you as big of gains as… pic.twitter.com/ifNdTGCr9L — Altcoin Sherpa (@AltcoinSherpa) February 29, 2024 Interestingly, the $1 level would mean a ride to uncharted territory for DOGE, as the crypto is yet to cross above $0.8. A surge to $1 would mean a 465% surge from the current price level and past its current all-time high of $0.74. The analyst noted that he doesn’t expect DOGE to perform as well as other meme-inspired cryptocurrencies with lower market caps like WIF, PEPE, and BONK, but its deep liquidity provides more of a stable investment. He also noted that DOGE and SHIB will probably take turns leading gains among meme coins. Meme Coins Continue To Shine The meme coin market has grown significantly since the early days of DOGE&#8217;s creation, which started out as a joke. Since then, tons of meme coins have been created, but Dogecoin continues to solidify its position as the largest meme coin in terms of market cap, demonstrating signs of renewed enthusiasm every so often. At the time of writing, DOGE is trading at $0.18. Data from Coinglass shows that the open interest on DOGE futures contracts is now at $1.62 billion, a 10% increase in the past 24 hours.  Related Reading: Cardano On-Chain Fundamentals Point To Massive Rally, Is $10 Possible? Other meme coins are also witnessing strong interest. According to Santiment, SHIB, PEPE, FLOKI, and BONK have seen an increase of over 3,000% in trading volume in the past week. The on-chain analytics platform credits the increase in trading volume to surging prices and increased crowd interest. 📈 #Memecoins, particularly those that have been trending over the past week, have skyrocketed in trading volume due to surging prices and increased crowd interest. On average, $SHIB, $PEPE, $FLOKI, and $BONK has seen volume rise +3,000% in the past week. https://t.co/MMHxbMotu0 pic.twitter.com/AiIaEbgGIz — Santiment (@santimentfeed) March 4, 2024 SHIB, PEPE, FLOKI, and BONK are up by 277%, 256%, 204%, and 145% respectively in the past seven days, outperforming DOGE during the time frame.  DOGE bulls hold up price &#124; Source: DOGEUSD on Tradingview.com Featured image from StormGain, chart from Tradingview.com"
  }
]