[
  {
    "source": "NewsBTC",
    "date": "2023-10-25T04:01:22.000Z",
    "title": "Bitcoin Bulls Take Back Seat But Here’s Why Dips Are Still Attractive",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-bulls-take-back-seat-35k/",
    "description": "Bitcoin price started a downside correction from the $35,000 resistance. BTC could start a fresh increase unless there is a move below $32,800. Bitcoin rallied toward the $35,000 resistance before the bears appeared. The price is trading above $33,200 and the 100 hourly Simple moving average. There is a key breakout pattern forming with resistance near $34,050 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could correct lower toward the $33,000 zone before it starts a fresh increase. Bitcoin Price Corrects Gains Bitcoin price rallied over 15% after there was speculation of spot ETF being listed DTCC. BTC surged toward the $35,000 resistance zone before the bears appeared. A new multi-week high was formed near $35,225. Recently, the price started a downside correction below the $34,500 level. There was a move below the 23.6% Fib retracement level of the upward move from the $29,694 swing low to the $35,225 high. Bitcoin is now trading above $33,200 and the 100 hourly Simple moving average. There is also a key breakout pattern forming with resistance near $34,050 on the hourly chart of the BTC/USD pair. The triangle support is close to the 50% Fib retracement level of the upward move from the $29,694 swing low to the $35,225 high. On the upside, immediate resistance is near the $34,050 level. The next key resistance could be near $34,800. The main resistance is now forming near the $35,000 zone. Source: BTCUSD on TradingView.com A clear move above the $35,000 barrier might send the price toward the $36,200 resistance. The next key resistance could be $37,000. Any more gains might send BTC toward the $38,000 level in the coming days. More Losses In BTC? If Bitcoin fails to rise above the $34,050 resistance zone, it could continue to move down. Immediate support on the downside is near the $33,400 level. The next major support is near the $32,800 level and the triangle trend line. If there is a move below the trend line support, the price may perhaps decline toward the $31,500 level in the coming sessions. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $33,400, followed by $32,800. Major Resistance Levels – $34,050, $34,800, and $35,000."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-25T04:00:49.000Z",
    "title": "1inch Investment Fund Just Sold Ethereum, What Do They Know?",
    "url": "https://www.newsbtc.com/news/ethereum/1inch-investment-fund-sold-ethereum-what-do-they-know/",
    "description": "1inch Investment Fund, a fund closely tied with the crypto exchange aggregating platform, 1inch, has sold 4,685 stETH for 8.54 million USDC at $1,823, according to Scopescan, an analytics platform, on October 24. By selling at spot rates, the fund has netted $1.28 million in profits since the stETH was bought at an average price of $1,550 less than a week ago. 1inch Investment Fund Sells stETH StETH, or staked Ethereum (ETH), is an ERC-20 token representing staked ETH on the Lido Finance protocol. The platform allows anyone to stake their coins and earn rewards without necessarily locking their coins for an extended period.  Related Reading: All Clear For $40,000? Bitcoin Shows Little On-Chain Resistance Ahead As of October 24, Lido Finance is the most popular decentralized finance (DeFi) application looking at total value locked (TVL). DeFiLlama data shows that the protocol manages over $15.7 billion of assets, of which over 95% are ETH.  Technically, any ETH holder wishing to stake and earn network rewards stake on Lido Finance receives stETH in return, representing the stake amount. The higher the staked amount, the more stETH the protocol issued. This stETH can be traded, transferred, or used to secure loans while concurrently earning network rewards.  Selling stETH means 1inch Investment Fund automatically unstaked the same amount on Lido Finance and sold the underlying coins. Even so, transferring the underlying ETH can take several days when there might be changes to spot prices. Related Reading: Chainlink (LINK) Surge Far From Done As Crypto Analyst Predicts Rise To $15 Curiously, the decision is when the crypto market seems to recover, and Ethereum is roaring back to life towards the $2,000 level. Considering that the fund is private and doesn&#8217;t divulge its strategy to the public, it couldn&#8217;t be immediately determined why it sells stETH when market confidence is high.  Will Ethereum Prices Break $2,000? Looking at price charts, Ethereum prices are up roughly 17% from H2 2023 lows, rallying at spot rates. The October 23 and 24 expansion has seen the coin break higher, registering new October highs. Even so, despite the overall confidence, the failure of bulls to complete reverse losses of August 17 should be a concern. Ideally, a comprehensive surge above $1,800 and $2,000 could anchor a leg up toward $2,100 in the coming sessions. When the fund sold stETH at $1,823, price data showed it exited at around today&#8217;s peak. There is an inverted hammer in the ETHUSDT daily chart, an indicator that prices are inching lower on increasing selling pressure. Feature image from Canva, chart from TradingView"
  }
]