[
  {
    "source": "CoinDesk",
    "date": "2023-06-21T07:32:42.000Z",
    "title": "Stablecoins, DeFi Likely to Be SEC’s Next Targets in U.S. Crypto Crackdown: Berenberg",
    "url": "https://www.coindesk.com/policy/2023/06/21/stablecoins-defi-likely-to-be-secs-next-targets-in-us-crypto-crackdown-berenberg/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "If USD Coin is targeted by regulators, the impact on Coinbase revenue could be significant, the report said"
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-21T07:22:37.000Z",
    "title": "Bitcoin June 2024 Expiry Futures and Options in High Demand Due to Halving: Deribit",
    "url": "https://www.coindesk.com/markets/2023/06/21/bitcoin-june-2024-expiry-futures-and-options-in-high-demand-due-to-mining-reward-halving-deribit/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Panama-based exchange will launch the June 2024 bitcoin futures and options contracts on Thursday at 08:00 UTC"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-21T07:14:47.000Z",
    "title": "Binance Netherlands exit - Dutch Central Bank says registration failings are confidential ",
    "url": "https://cointelegraph.com/news/netherlands-central-bank-says-binance-failed-registration-confidential",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/3fd8b44c-896d-4375-95f3-296bbab7a146.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>De Nedelandsche Bank is unable to share details of Binance’s registration failings in the country due to confidentiality requirements of its supervisory laws. </p>\n                    <p><p>The details behind Binance’s failed efforts to register for a virtual asset service provider (VASP) license in the Netherlands will remain unclear due to confidentiality requirements of the central bank’s supervisory laws.</p><p>Binance announced that it would terminate its services in the Netherlands on <a href=\"https://cointelegraph.com/news/binance-crypto-exchange-exits-netherlands\">June 16</a> with immediate effect, having failed to get the all clear from De Nedelandsche Bank (DNB). From July 17, Dutch customers will only be able to withdraw assets from the platform, while trading and deposits were stopped on the date of the announcement.</p><p>Binance claimed that it had undergone a ‘comprehensive registration application process’ to obtain a VASP license in the Netherlands and had also explored ‘alternative avenues’ to serve Dutch residents in the country. The exchange indicated that it would continue its effort to obtain authorization to provide its services and products in the country.</p><p>Cointelegraph reached out to Tobias Oudejans, spokesperson for DNB in charge Supervision, Fintech, Cryptos, Resolution and Payment systems to ascertain final details of Binance’s failed registration efforts.</p><p>Oudejans said that the central bank could not share more details about Binance’s registration due to legal requirements of supervisory laws: </p><blockquote>“Because of confidentiality as demanded by our supervisory laws, we cannot elaborate on anything concerning our supervision on individual institutions or the possible licensing trajectories they may be in.”</blockquote><p>Oudejans added that the DNB wanted to stress that its perceived silence over this specific supervisory outcome and similar issues ‘might wrongly be attributed to an unwillingness to comment,’ but was necessitated by Dutch laws.</p><p>Binance would have joined a list of 35 VASP that have <a href=\"https://www.dnb.nl/en/public-register/?p=1&amp;l=100&amp;rc=V1dGVEFD\" target=\"_blank\" rel=\"noopener nofollow\">completed registration</a> with the DNB. This includes the likes of Coinbase Custody International Limited, Coinbase Europe Limited, eToro (Europe) Limited, BitPay and Bitstamp.</p><p><a href=\"https://cointelegraph.com/news/eu-s-new-crypto-law-how-mica-can-make-europe-a-digital-asset-hub\"><strong><em>Related: EU’s new crypto law: How MiCA can make Europe a digital asset hub</em></strong></a></p><p>Oudejans said VASP registration requirements in the Netherlands are in line with the similar requirements for other types of financial institutions under the DNB’s supervision. These are based on the Netherlands Anti-Money Laundering and Anti-Terrorist Financing Act, locally known as the <em>Wet ter voorkoming van witwassen en financieren van terrorisme</em> (WWFT).</p><p>The implementation of the European Union’s <a href=\"https://cointelegraph.com/news/eu-mica-crypto-legislation-added-to-official-journal\">recently published</a> Markets in Crypto-Assets regulation (MiCA) could provide Binance an alternative avenue to operate in the Netherlands come 2024. As Oudejans explained, the global exchange could gain access to the Dutch market if it has met the necessary requirements in other EU member states:</p><blockquote>“It is not yet clear in what way MiCA will be implemented in the Netherlands, but indeed it looks like it will be a different law than the WWFT and possibly on a European level there may be access to the Dutch market for registered entities from other EU-countries.”</blockquote><p>Binance has already indicated that it is ramping up efforts to be fully compliant with the new EU rules set out in MiCAR. </p><p>Binance was handed a <a href=\"https://cointelegraph.com/news/binance-fined-3m-over-illegal-operations-in-the-netherlands\">$3.6 million</a> (3.3 mln euro) by the DNB in July 2022 for operating without clearance in the Netherlands. </p><p>Meanwhile Coinbase obtained a green light from the DNB in <a href=\"https://cointelegraph.com/news/coinbase-enters-the-netherlands-with-central-bank-approval\">September 2022</a> as it began to explore expansion away from the United States and into Europe. The U.S. exchange is <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">embroiled in a high-profile legal battle</a> with the U.S. Securities and Exchange Commission over allegations that it has been operating as an unregistered securities exchange, broker and clearing agency.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/opinion-republican-crypto-maxis-democrat-anti-crypto-army-mchenry-warren/\">Opinion: GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-21T07:30:24.000Z",
    "title": "Privacy Protocols Have Not Gained Traction Because ‘User Experience Hasn’t Been up to Par’ — Namada Co-Founder",
    "url": "https://news.bitcoin.com/privacy-protocols-have-not-gained-traction-because-user-experience-hasnt-been-up-to-par-namada-co-founder/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146778875-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Privacy Protocols Have Not Gained Traction Because &#039;User Experience Hasn’t Been up to Par&#039; — Namada Co-Founder\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146778875-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146778875-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146778875-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146778875-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146778875-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146778875-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2146778875.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to Christopher Goes, the co-founder of privacy-focused blockchain Namada, many privacy protocols have not gained traction primarily because &#8220;the user experience hasn’t been up to par.&#8221; Part of the reason for this is that existing solutions such as Zcash &#8220;often require that users use a specific asset in order to receive privacy.&#8221; Another privacy [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T07:32:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past couple of months, BNB and the entire crypto market seem to be experiencing winter in the summer. Crypto prices have fallen and the entire crypto market cap has dropped by 18% since April 18, 2023. What does the future hold for Binance Coin? ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-21T07:19:51.000Z",
    "title": "The Sandbox Price Prediction 2023-2032: Should You Hodl or Dump SAND?",
    "url": "https://www.cryptopolitan.com/the-sandbox-price-predictions/",
    "description": "The Sandbox Price Prediction 2023-2032 If you&#8217;re into crypto games, SAND will be familiar to you, and The Sandbox Price Prediction will prove helpful. The new virtual universe inspired by Metaverse gaming firm The Sandbox has opened toward NFT auctions, where several pieces have been sold, including the mega yacht. According to announcements from the ... <a title=\"The Sandbox Price Prediction 2023-2032: Should You Hodl or Dump SAND?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-sandbox-price-predictions/\" aria-label=\"More on The Sandbox Price Prediction 2023-2032: Should You Hodl or Dump SAND?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-21T07:22:23.000Z",
    "title": "Bitnals aims to shape crypto trading with data-driven signals",
    "url": "https://crypto.news/bitnals-aims-to-shape-crypto-trading-with-data-driven-signals/",
    "description": "Bitnals, a crypto company, aims to revolutionize crypto trading with its approach and technology, providing data-driven signals"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-21T07:14:54.000Z",
    "title": "IOTA 2.0 Takes Flight: Breaking Barriers, Attracting Projects, and Navigating EU Regulations for Explosive Growth",
    "url": "https://www.crypto-news-flash.com/iota-2-0-takes-flight-breaking-barriers-attracting-projects-and-navigating-eu-regulations-for-explosive-growth/?utm_source=rss&utm_medium=rss&utm_campaign=iota-2-0-takes-flight-breaking-barriers-attracting-projects-and-navigating-eu-regulations-for-explosive-growth",
    "description": "The IOTA 2.0 is under development through several networks, including Shimmer stardust, Chrysalis Devnet, and Testnet stardust. The IOTA network has worked with over 100 organizations across different businesses, governments, and academia to develop open-source solutions. Since the European Union countries unanimously adopted the Markets in Crypto Assets (MiCA) regulation, a comprehensive framework to regulate [...]"
  }
]