[
  {
    "source": "Decrypt",
    "date": "2023-07-20T19:55:13.000Z",
    "title": "Coin Center Blasts 'Messy and Unconstitutional' Senate DeFi Bill",
    "url": "https://decrypt.co/149400/coin-center-blasts-messy-and-unconstitutional-senate-defi-bill",
    "description": "Critics say new legislation will grant the U.S. Treasury overbroad authority while violating freedom of speech. "
  },
  {
    "source": "Decrypt",
    "date": "2023-07-20T19:49:48.000Z",
    "title": "ChatGPT Isn't All That Great at Cybersecurity: ImmuneFi",
    "url": "https://decrypt.co/149412/chatgpt-isnt-great-cybersecurity-immunefi",
    "description": "Security researchers see ChatGPT as a tool with plenty of potential, but it's dogged by how inaccurate it is at diagnosing security flaws."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-20T19:52:18.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting the Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>The United Kingdom's Financial Conduct Authority is launching a Digital Sandbox on Aug. 1, opening the door to payment, lending and investment services to receive support for product development. Kuwait has banned almost all crypto and virtual assets transactions, as the country's regulator issued a circular on July 18 reiterating its \"absolute prohibition\" on a host of crypto-related activities. Meanwhile, Myanmar's government in exile has backed the launch of the country's first all-crypto bank, which could help it gain access to better financial services, and several spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund applications made their way to the Federal Register this week.</p><h3>UK regulator to launch Digital Sandbox for startups</h3><p>On July 20, FCA unveiled that its Digital Sandbox program will become available starting in August. The announcement followed two successful pilot programs. </p><p>Sandboxes allow developers and startup founders to test their products and services in a controlled environment. FCA’s Digital Sandbox has been established to help firms launch new products and services in support of the U.K.’s economic mandate. </p><p>The United Kingdom is taking measured steps to regulate cryptocurrency and digital assets. This week, the government <a href=\"https://cointelegraph.com/news/crypto-uk-rejects-regulating-crypto-gambling\">rejected a Treasury Committee proposal</a> to regulate crypto retail trading in the same way it polices gambling. The government said it’s already working on crypto market regulation and views the sector in the lens of financial services, not gambling. </p><p>The United Kingdom’s Financial Conduct Authority (FCA) is launching a product development ecosystem for early-stage companies, potentially opening the door to digital-asset payment and lending services. </p><h3>Kuwait bans crypto and virtual assets transactions</h3><p>The state of Kuwait is the latest jurisdiction to ban virtually all operations involving cryptocurrencies like Bitcoin. On July 18, Kuwait’s main financial regulator, the Capital Markets Authority (CMA), issued a circular on the supervision and issuance of virtual assets in the country.</p><p>In the circular, the CMA confirmed the commitment to “absolute prohibition” on major use cases and operations involving cryptocurrencies, including payments, investments, and mining. The circular also bans local regulators from issuing any licenses allowing firms to provide virtual asset services as a commercial business.</p><p>In the meantime, securities and other financial instruments regulated by the Central Bank of Kuwait and the CMA are excluded from the latest prohibitions, the announcement notes.</p><p>Apart from the prohibitions, the CMA also required customers to be cautious and aware of the risks associated with virtual assets. The regulator particularly flagged cryptocurrencies, arguing that they “don’t carry a legal status and are not issued or supported.”</p><p>The CMA added: </p><blockquote>“It is not linked to any asset or issuer, and that the prices of these assets are always driven by speculation that exposes them to a sharp decline.”</blockquote><p>The penalties for violating Kuwait’s Anti-Money Laundering laws are stipulated in Article 15 of Law No. 106 of 2013, the regulator noted.</p><p>Kuwait’s new regulations align with the country’s measures to combat money laundering and terrorist financing, the regulator stated. The CMA also referred to the conclusions of a study by the National Committee for Combating Money Laundering and Financing of Terrorism regarding the commitment to applying recommendation 15 by the Financial Action Task Force.</p><p>According to local reports, the CMA’s crypto restrictions are part of a new inter-departmental crypto ban involving several supervisory authorities in Kuwait. Similar circulars have reportedly been issued by the Central Bank of Kuwait, the Ministry of Commerce and Industry and the Insurance Regulatory Unit.</p><h3>Myanmar’s exiled gov backs launch of crypto-based bank</h3><p>The first crypto-based financial institution in Myanmar is set for a soft launch on July 22 and could help the country's shadow government gain better access to funding and financial services. </p><p>Called the Spring Development Bank, it was named after the Spring revolution — the opposition movement led by Myanmar’s exiled National Unity Government (NUG) against the ruling State Administration Council (SAC), the military junta that seized control of the country in early 2021.</p><p>The bank is based on the Polygon blockchain with the main goal of making domestic and international payments faster and more efficient, along with offering access to a broad array of financial products for both the 55 million Burmese living in Myanmar and the 2 million outside the country who frequently send money back. </p><p>A number of new fiat-pegged stablecoins including the Myanmar kyat, Thai baht, Singapore dollar and the U.S. dollar will be issued by the bank which can be plugged into a “currency swap” feature built on  UniSwap V3 allowing users to exchange the stablecoins.</p><p>While not launched directly by the NUG, an official told Cointelegraph the bank is launched with its full support and resources and the bank is licensed and regulated by the NUG-controlled interim central bank of Myanmar.</p><h2>Spot Bitcoin ETF applications make their way to Federal Register</h2><p>Multiple spot Bitcoin ETF applications have been <a href=\"https://cointelegraph.com/news/spot-crypto-etf-applications-federal-register-sec-approval\">published in the Federal Register</a>, raising optimism in the crypto community that the path to approval was gradually being laid.</p><p>According to July 19 records, the Federal Register listed the spot Bitcoin ETF applications of BlackRock, Fidelity, Invesco Galaxy, VanEck and WisdomTree. The listings give the Securities and Exchange Commission a window of up to 240 days to accept or request the applications’ proposed rule changes that would pave the wave for a spot Bitcoin ETF to be listed. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">UPDATE: Not much of one though... As predicted and as expected those <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> ETF applications all hit the federal register today.<br><br>BlackRock, VanEck, WisdomTree, Fidelity, and Invesco/Galaxy. <a href=\"https://t.co/aAFxK1Rqp7\">https://t.co/aAFxK1Rqp7</a> <a href=\"https://t.co/B9C1oF3yhQ\">pic.twitter.com/B9C1oF3yhQ</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1681664749166051329?ref_src=twsrc%5Etfw\">July 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Before crypto enthusiasts get too excited, it’s important to note that the Federal Register publications were expected after the firms filed the initial applications in June. To date, the SEC has not given any indication that it’s prepared to approve a spot investment vehicle for digital assets. </p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T20:08:31.000Z",
    "title": "Netherlands pushes for tighter EU regulations on crypto",
    "url": "https://www.cryptopolitan.com/netherlands-tighter-eu-regulations-on-crypto/",
    "description": "The Netherlands government has voiced its concern over the increasing use of digital currencies in consumer apps and video games, stressing the need for stricter consumer protections in the European Union, especially for young users. This move underscores a greater push for a tighter regulatory framework surrounding cryptocurrencies, ensuring they&#8217;re used responsibly and effectively, particularly ... <a title=\"Netherlands pushes for tighter EU regulations on crypto\" class=\"read-more\" href=\"https://www.cryptopolitan.com/netherlands-tighter-eu-regulations-on-crypto/\" aria-label=\"More on Netherlands pushes for tighter EU regulations on crypto\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T20:06:29.000Z",
    "title": "Filecoin Price Prediction 2023-2032: What’s the future for FIL?",
    "url": "https://www.cryptopolitan.com/filecoin-price-prediction/",
    "description": "Filecoin Price Prediction 2023-2032 How much is Filecoin (FIL) worth? The live Filecoin price today is $4.28 USD, with a 24-hour trading volume of $85,523,014 USD. Filecoin is up 0.75% in the last 24 hours. The current CoinMarketCap ranking is #30, with a live market cap of $1,870,599,438 USD. It has a circulating supply of ... <a title=\"Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/filecoin-price-prediction/\" aria-label=\"More on Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\">Read more</a>"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-20T20:00:59.000Z",
    "title": "Here’s What It Takes To Get Listed on Kraken, According to the Crypto Exchange’s Chief Legal Officer",
    "url": "https://dailyhodl.com/2023/07/20/heres-what-it-takes-to-get-listed-on-kraken-according-to-the-crypto-exchanges-chief-legal-officer/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/what-it-takes-kraken.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/what-it-takes-kraken.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/what-it-takes-kraken.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/what-it-takes-kraken.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/what-it-takes-kraken.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/what-it-takes-kraken.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/what-it-takes-kraken.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Kraken&#8217;s chief legal officer Marco Santori says crypto assets on his exchange undergo a multi-pronged compliance, cybersecurity and legal review process before being listed for trading. Santori explains in a new interview with Real Vision Crypto that Kraken weeds through thousands of crypto assets and chooses to support &#8220;only a few&#8221; tokens. &#8220;We do that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/20/heres-what-it-takes-to-get-listed-on-kraken-according-to-the-crypto-exchanges-chief-legal-officer/\">Here’s What It Takes To Get Listed on Kraken, According to the Crypto Exchange’s Chief Legal Officer</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-20T19:55:38.000Z",
    "title": "Crypto Analyst Breaks Down Bitcoin (BTC), Chainlink (LINK) and One Top XRP Rival",
    "url": "https://dailyhodl.com/2023/07/20/crypto-analyst-breaks-down-bitcoin-btc-chainlink-link-and-one-top-xrp-rival/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/10/bitcoin-chainlink-altcoin-prediction.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/10/bitcoin-chainlink-altcoin-prediction.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/10/bitcoin-chainlink-altcoin-prediction.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/10/bitcoin-chainlink-altcoin-prediction.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/10/bitcoin-chainlink-altcoin-prediction.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/10/bitcoin-chainlink-altcoin-prediction.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/10/bitcoin-chainlink-altcoin-prediction.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is diving into the crypto markets after a week of largely sideways trading action. Crypto trader Michaël van de Poppe tells his 660,100 Twitter followers that Bitcoin (BTC) is on the edge of a move that will strengthen the crypto markets. &#8220;Bitcoin is on the edge of a big move here. Breaking [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/20/crypto-analyst-breaks-down-bitcoin-btc-chainlink-link-and-one-top-xrp-rival/\">Crypto Analyst Breaks Down Bitcoin (BTC), Chainlink (LINK) and One Top XRP Rival</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]