[
  {
    "source": "CryptoGlobe",
    "date": "2023-07-05T01:00:00.000Z",
    "title": "Shiba Inu ($SHIB) Sees Explosive New Address Growth in Q2",
    "url": "https://www.cryptoglobe.com/latest/2023/07/shiba-inu-shib-sees-explosive-new-address-growth-in-q2/",
    "description": "The meme-inspired cryptocurrency Shiba Inu ($SHIB) has been seeing significant growth over the last few months, to the point that data shows explosive growth of its daily new addresses on the network in the second quarter of the year. According to popular cryptocurrency analytics firm IntoTheBlock, the meme-inspired cryptocurrency has seen a strong ending to […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-05T01:00:04.000Z",
    "title": "Trader Bets Against Ethereum, Losses A Big Chunk Of The $2 Million Margin On GMX",
    "url": "https://www.newsbtc.com/news/ethereum/trader-bets-against-ethereum-losses-a-big-chunk-of-the-2-million-margin-on-gmx/",
    "description": "A trader’s big bet against Ethereum caused him to lose a big chunk of his $2 million margin. Considering the firm and steady increment of ETH prices over the last few weeks, more could be at stake.  In a series of screenshots shared on July 3 on Reddit, one trader on GMX has been aggressively “shorting” Ethereum with high leverage, a decision that has seen the trader lose hundreds of thousands in USD. GMX is a popular decentralized finance (DeFi) protocol that allows users to trade perpetual futures contracts, including those of ETH, with up to 50x leverage.  Ethereum Prices Up 20% In 2 Weeks Despite facing significant losses from the forced liquidation of their shorts, the trader appears unfazed and continues to double down, shorting with high leverage without concern. Since mid-June 2023, Ethereum prices have been rising, expanding 20% at spot rates. Floating above previous liquidation levels at around $1,900, the coin is now trading at about $1,945.Although buyers were unable to drive up spot rates further, the bulls are still in charge. The psychological price point of $2,000 is still the immediate resistance level, along with the April 2023 highs at $2,100. Sparked by fundamental activities and mostly confidence from the broader cryptocurrency community, Ethereum has been marching higher, tracking the performance of Bitcoin. The direct correlation of prices versus the USD between Bitcoin and Ethereum could have benefited bulls during the rally.   Related Reading: Federal Reserve Certifies 57 Organizations For Instant Payments System ‘FedNow’ Comments from the United States Securities and Exchange Commission (SEC), alleging that some of the native currencies of some of Ethereum’s competitors, including Algorand, Cardano, and Solana, are unregistered securities could have provided tailwinds for ETH, cementing its positions as a leading smart contracts platform. The SEC’s representatives, especially its chair, Gary Gensler, have remained non-committal in readily classifying the status of ETH. Any clarification could boost prices or force a sell-off depending on the agency&#8217;s classification. Trader’s Doubling Down on ETH Shorts Despite the steady rise of ETH over the past two weeks, the trader, records reveal, has been shorting ETH from when it was at around $1,700 to spot rates. However, the trader began aggressively shorting ETH from June 26.  In total, the trader opened two positions. One with a leverage of 19X was for $12 million, while the other with a leverage of 7X was for $1 million. As prices increased, the collateral representing $12 million from the 19X leverage position was closed. This didn’t stop the trader from opening another position. According to his trading history, another short position with a stop at $1,999 was opened, with leverage of 30X. Related Reading: TRX Bulls Charge Ahead As Tron Network Prepares For Major Upgrade Whether ETH prices will rise in the coming weeks is yet to be seen. All that’s evident is that the coin’s price has been firm, defying sellers who have been active from mid-April through to the first half of June. In the medium term, the $2,000 and $2,100 liquidation levels are critical price points that could shape ETH’s trajectory in the second half of 2023. Feature image from Canva, chart from TradingView"
  }
]