[
  {
    "source": "CryptoSlate",
    "date": "2023-09-21T21:40:13.000Z",
    "title": "OpenAI draws scrutiny from Polish authorities over alleged violations of EU General Data Protection Regulation",
    "url": "https://cryptoslate.com/openai-draws-scrutiny-from-polish-authorities-over-alleged-violations-of-eu-general-data-protection-regulation/",
    "description": "<p>Regulators in Poland have opened a case against OpenAI, according to an official announcement published on Sept. 20. Poland&#8217;s Personal Data Protection Office said that it is considering a complaint in which an individual objected to aspects of OpenAI&#8217;s popular ChatGPT app. In the relevant complaint, the individual user alleged that OpenAI handles data in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/openai-draws-scrutiny-from-polish-authorities-over-alleged-violations-of-eu-general-data-protection-regulation/\">OpenAI draws scrutiny from Polish authorities over alleged violations of EU General Data Protection Regulation</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-21T22:00:26.000Z",
    "title": "Is The Bitcoin Dream Fading? Glassnode Data Reveals Newbies Facing Steep Losses",
    "url": "https://www.newsbtc.com/bitcoin-news/is-the-bitcoin-dream-fading-glassnode-data-reveals/",
    "description": "Since its inception, Bitcoin, the preeminent cryptocurrency, has witnessed several market cycles, each with its highs and lows. Its volatile nature has recently tested investors&#8217; mettle, especially those who ventured into Bitcoin in the past three months. Bitcoin Short-Term Holders&#8217; Cost Basis Troubles New findings from analytics firm Glassnode have painted a detailed picture of the current scenario, revealing the challenges faced by short-term holders (STHs) of the premier cryptocurrency. Related Reading: Bitcoin Sees Sudden Boost Amid Mt. Gox Rumors, But QCP Capital Targets $22,000 STHs, defined by Glassnode as entities holding Bitcoin for 155 days or less, have recently felt the heat. The firm&#8217;s research disclosed that roughly 97.5% of these investors grapple with unrealized losses. To put it in perspective, as of September 17, Glassnode reveals the cost basis (or average purchase price) for those refraining from selling their BTC stands at $28,000, precariously hovering around 5% above the prevailing market rate. This situation stresses those new to the crypto ecosystem, causing many to reconsider their potential investment strategies. Shift In Sentiment And Trend Confidence Metric Delving deeper, Glassnode&#8217;s &#8220;The Week On-Chain&#8221; report highlights a marked change in sentiment among Bitcoin&#8217;s short-term holders. The firm identified a distinction between STHs based on their activity – those who spend their Bitcoin and those who hold. An interesting trend emerged from this classification. The cost basis of the spenders dipped below that of the holders during the market&#8217;s descent from $29,000 to $26,000 in mid-August. This shift indicates a sentiment of concern and pessimism among the STH community. Related Reading: Bitcoin’s Next Move: Crypto Analyst Predicts $45,000 Price Ahead Of Halving Glassnode introduced a &#8216;trend confidence metric to quantify this sentiment further.&#8217; This metric is derived by deducting the spender&#8217;s cost from the holder&#8217;s cost basis and dividing the resultant value by Bitcoin&#8217;s current price. A pivotal takeaway from this metric was the evident negative shift in market sentiment. As stated in Glassnode&#8217;s conclusion: The Bitcoin market is experiencing a non-trivial shift in sentiment, with almost all Short-Term Holders now underwater on their supply. The firm noted that the current atmosphere of unease has been &#8220;unparalleled&#8221; since the FTX debacle. Glassnode noted: This has resulted in a negative shift in sentiment, with investors spending now having a lower cost basis than the rest of the cohort. This suggests a degree of panic is dominating this group, which is the first time since FTX collapsed. Meanwhile, although Bitcoin&#8217;s short-term holders are grappling with steep losses, the asset experienced a slight uptick yesterday, pushing its price above $27,000. However, this gain was short-lived as Bitcoin quickly retraced its steps, trading at $26,605 at the time of writing, with a 2.1% decline in the last 24 hours. Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-21T22:01:00.000Z",
    "title": "$ADA Teeters on the Edge of A Potential Bull Run: Crypto Analyst",
    "url": "https://coinedition.com/ada-teeters-on-the-edge-of-a-potential-bull-run-crypto-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/05-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Technical Indicator Suggests ADA’s Bullish Momentum Could Continue\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/05-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/05-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/05-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/05-2-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/05-2-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/05-2-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A prominent crypto analyst on YouTube, Crypto Capital Venture, said in a recent video that ADA is teetering on the edge of a potential bull run. He made these comments while referencing data from historical charts to back his claim. He said, according to the data, that every time ADA fell close to the oversold [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ada-teeters-on-the-edge-of-a-potential-bull-run-crypto-analyst/\">$ADA Teeters on the Edge of A Potential Bull Run: Crypto Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-21T22:01:30.000Z",
    "title": "Mt. Gox Extends Repayment Deadline of Estimated $3,700,000,000+ in Bitcoin (BTC) and Bitcoin Cash (BCH) Payout",
    "url": "https://dailyhodl.com/2023/09/21/mt-gox-extends-repayment-deadline-of-estimated-3700000000-in-bitcoin-btc-and-bitcoin-cash-bch-payout/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/mt-gox-deadline-creditors.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/mt-gox-deadline-creditors.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/mt-gox-deadline-creditors.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/mt-gox-deadline-creditors.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/mt-gox-deadline-creditors.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/mt-gox-deadline-creditors.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/mt-gox-deadline-creditors.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Defunct crypto exchange Mt. Gox is extending its deadline to repay about $3.7 billion worth of Bitcoin (BTC) and Bitcoin Cash (BCH) to its creditors. In a new announcement, Mt. Gox rehabilitation trustee Nobuaki Kobayashi says that the crypto exchange will not be able to make certain repayments by their original deadline of October 31, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/21/mt-gox-extends-repayment-deadline-of-estimated-3700000000-in-bitcoin-btc-and-bitcoin-cash-bch-payout/\">Mt. Gox Extends Repayment Deadline of Estimated $3,700,000,000+ in Bitcoin (BTC) and Bitcoin Cash (BCH) Payout</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]