[
  {
    "source": "Cointelegraph",
    "date": "2023-10-10T14:01:36.000Z",
    "title": "Circle rolls out native USDC tokens on Polygon ",
    "url": "https://cointelegraph.com/news/circle-launches-usdc-tokens-on-polygon",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/60ee8148-5dc3-4622-b1f1-d5aa92b90590.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Circle taps into Ethereum layer 2 Polygon to provide USDC liquidity directly on the proof-of-stake scaling protocol. </p>\n                    <p><p>US dollar stablecoin issuer Circle has <a href=\"https://www.circle.com/blog/native-usdc-now-available-on-polygon-pos\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that it has begun minting USD Coin (USDC) natively on Ethereum layer 2 scaling protocol Polygon.</p><p>USDC is accessible to both users and developers without the need to bridge the stablecoin from Ethereum or other blockchain. Circle Mint and Circle’s developer API’s now support Polygon-based USDC, tapping into Polygon’s scaling capabilities.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ It’s official. <a href=\"https://twitter.com/hashtag/ItsStillStableSeptember?src=hash&amp;ref_src=twsrc%5Etfw\">#ItsStillStableSeptember</a> and <a href=\"https://twitter.com/search?q=%24USDC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USDC</a> is now available natively on <a href=\"https://twitter.com/0xPolygon?ref_src=twsrc%5Etfw\">@0xPolygon</a> PoS mainnet!<br><br>Learn the benefits of native USDC and how to switch from bridged USDC.e <a href=\"https://t.co/KcK55sT4KH\">https://t.co/KcK55sT4KH</a> <a href=\"https://t.co/Gm6HjR62KW\">pic.twitter.com/Gm6HjR62KW</a></p>&mdash; Circle (@circle) <a href=\"https://twitter.com/circle/status/1711729590539083806?ref_src=twsrc%5Etfw\">October 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to the announcement from Circile, businesses and developers will be able to build decentralized applications (DApps) with USDC on Polygon. The new offering is touted to enable near-instant, low fee transactions for a variety of use cases including payments, remittances, trading, borrowing and lending.</p><p>Before Circle’s announcement of its native Polygon USDC offering, users of the protocol had to make use of bridge USDC (USDC.e) from the Ethereum blockchain. The token is not issued by Circle, as opposed to its new offering that it assures will be redeemable at a 1:1 ratio for US dollars.</p><p><a href=\"https://cointelegraph.com/news/circle-launches-usdc-stablecoin-polkadot-asset-hub\"><strong><em>Related: Circle launches USDC stablecoin on Polkadot Asset Hub</em></strong></a></p><p>Circle had previously provided support of deposits and withdrawals for USDC.e on Polygon for Circle Mint and its APIs. The issuer plans to discontinue this service from Nov. 10, warning users that attempt to send bridge USDC.e to Circle Mint accounts that their assets may be unrecoverable after this date.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/3147d965-8d9d-4d31-b7bc-12403cdbb004.png\"  /><figcaption style=\"text-align: center;\">The new Polygon USDC token address reflects a current market capitalization of some 4.3 million USDC on the scaling protocol. Source: Polygonscan</figcaption></figure><p>Circle also notes that provision of native Polygon USDC will enable low cost global payments and remittances as well as accessibility to trading, borrowing, and lending on leading DeFi protocols including Aave, Compound, Curve, Uniswap and Quickswap.</p><p>The USDC issuer also plans to launch cross-chain transfer protocol to Polygon to enable interoperability with other blockchain networks. This is set to unlock Polygon-based USDC transfers to and from the Ethereum blockchain.</p><p><a href=\"https://cointelegraph.com/magazine/cuba-bitcoin-revolution-adoption-embargo/\"><strong><em>Magazine: The Truth Behind Cuba’s Bitcoin Revolution: An on-the-ground report</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-10T14:01:22.000Z",
    "title": "BTC price rally in doubt? Bitcoin young supply echoes 2022 bear market",
    "url": "https://cointelegraph.com/news/btc-price-rally-doubt-bitcoin-young-supply-bear-market",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/3c298760-d398-4763-8630-19ca6fad4bc5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin on-chain transaction data shows \"uncertain\" conditions prevailing, research says, warning that Q2 is not likely to match BTC price gains from earlier in 2023.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) traders are displaying behavior similar to the 2022 bear market bottom as “uncertain” sentiment rules, new research argues.</p><p>In one of its <a href=\"https://cryptoquant.com/insights/quicktake/6523af40ff1f8e60a552b0f7-What-insights-can-we-get-from-Data-on-the-Sub-1-Month-Supply\" target=\"_blank\" rel=\"noopener nofollow\">Quicktake</a> market updates on Oct. 9, on-chain analytics platform CryptoQuant examined a major drop in realized capitalization of the most active part of the BTC supply.</p><h2>One-month-old BTC supply realized cap comes full circle</h2><p>Bitcoin’s more speculative investor cohorts continue to come in for scrutiny this year as BTC price action experiences a variety of diverging environments.</p><p>Spot price is currently circling the <a href=\"https://cointelegraph.com/news/bitcoin-short-term-holders-panic-amid-nearly-100-unrealized-loss\">aggregate cost basis</a> for so-called short-term holders (STHS), defined as entities hodling a given amount of BTC for 155 days or less.</p><p>Now, CryptoQuant reveals that the realized capitalization, or cap, of coins which last moved between 24 hours and one month ago has collapsed in recent months.</p><p>Realized cap refers to the combined value, here in U.S. dollars, of a specific group of bitcoins being used in transactions. Tracking the total value of the one day to one month (1D-1M) cohort can give insights into broader BTC price action, CryptoQuant says.</p><p>“In my view, this dataset effectively reflects Bitcoin's market price fluctuations,” contributor Binh Dang wrote. </p><blockquote>“It represents recently acquired coins before they become long-term holdings or are continually traded in the short term.”</blockquote><p>In late 2022, when BTC/USD fell to two-year lows, the 1D-1M cohort’s realized cap fell to below $20 billion. When Bitcoin peaked at just below $32,000 in July, the realized cap topped out at more than double — around $44 billion.</p><p>Binh shows that the figure has now retreated back to those bear market levels, “recovering slightly” to still hover near the $20 billion mark.</p><p>“The current change in this data (in blue and green) shows an inconsistent recovery, partly due to general market sentiment, including macroeconomic and geopolitical issues,” he continued in commentary on an illustrative chart.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/25f26065-c29d-48bb-af37-fb83739ebcf6.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin realized cap supply data (screenshot). Source: CryptoQuant</em></figcaption></figure><h2>Bitcoin newbies \"should not expect\" rerun of Q1 gains</h2><p>$20 billion has in fact formed a broad floor for the 1D-1M group since September last year, but going forward, a stronger bounce should be viewed as unlikely.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-dominance-3-month-high-risk-dive\">Bitcoin dominance hits 3-month high as ‘hammered’ altcoins risk dive</a></em></strong></p><p>“The market will likely remain uncertain if these data don't show significant and positive trends from now until the year's end,” Banh wrote. </p><blockquote>“The volatility will be unpredictable, so newcomers should not expect continuous and strong price increases as in the first half of this year.”</blockquote><p>Similar conclusions can be drawn from the percentage of the aggregate realized cap accounted for by 1D-1M coins.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/1bcc53a7-9724-4331-981c-3dd303f4a4e3.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin 1D-1M cohort realized cap % chart (screenshot). Source: CryptoQuant</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-10T13:51:37.000Z",
    "title": "OK Group sunsets ‘Okcoin’ for a global transition to ‘OKX’",
    "url": "https://cointelegraph.com/news/crypto-ok-group-cancels-okcoin-brand",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/fd35610c-71aa-4189-88ec-da3e63a8bd45.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Founded in 2013, Okcoin will have the same name as OK Group’s other crypto venture, OKX, formerly known as OKEx.</p>\n                    <p><p>Major cryptocurrency exchange operator OK Group continues transforming its business, rebranding its crypto ventures under the single name “OKX.”</p><p>Hong Fang, chief operating officer at OK Group and president of OKX, took to X (formerly Twitter) to <a href=\"https://x.com/hfangca/status/1711402101673431207?s=20\" target=\"_blank\" rel=\"noopener nofollow\">announce</a> that Okcoin will be rebranding to OKX over the coming months. Founded in 2013, Okcoin will have the same name as OK Group’s other crypto venture, OKX (formerly OKEx).</p><p>“I’ve been part of Okcoin for five years. Over the years, we have put a lot of love and passion into our brand and product,” the exec wrote in the post. He added that the platform’s rebranding in key operational jurisdictions will be great for its customers and business.</p><p>Starting with Singapore, OK Group plans to sequentially rebrand “Okcoin” to “OKX” in Europe and the United States over the next few months, Fang said. The exec assured that customers will receive the “same set of product services under the same regulatory framework” and will interact with a new brand.</p><p>Fang also mentioned that OK Group recently sunsetted the “Okcoin” brand and product in a few regions, including Latin America, the Middle East and North Africa, South Asia, Hong Kong and other regions.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-okx-comply-crypto-finprom-rules-in-uk\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-okx-comply-crypto-finprom-rules-in-uk/amp\"><strong><em>Binance, OKX to comply with new financial promotions rules in UK</em></strong></a></p><p>The executive emphasized that the U.S. has always been important to the company’s global strategy. “It is home base for a lot of us on our team. It is special to us,” Fang wrote, adding:</p><blockquote>“Despite all the challenges, we remain committed to the U.S. as a visionary leader that upholds the standards of empowering individuals and protecting freedom with technology as it always has and defines our future as it should be.”</blockquote><p>The news comes nearly one year after OK Group rebranded another part of its business, formerly known as OKEx. In December 2022, OKEx <a href=\"https://www.okx.com/learn/okex-rebrands-to-okx\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> its transition to “OKX” to become more than just a centralized crypto exchange and capture decentralized finance, nonfungible tokens and Web3. The exchange was founded by OK Group CEO Star Xu in 2017.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/minecraft-bans-bitcoin-play-earn-iphone-15-crypto-gaming-formulae-preview-web3-gamer/\"><strong><em>Web3 Gamer: Minecraft bans Bitcoin P2E, iPhone 15 & crypto gaming, Formula E</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-10T14:00:52.000Z",
    "title": "Israeli Shekel Hits 7-Year Low Amid Conflict; Central Bank Launches $30B FX Intervention",
    "url": "https://news.bitcoin.com/israeli-shekel-hits-7-year-low-amid-conflict-central-bank-launches-30b-fx-intervention/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shek-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Israeli Shekel Hits 7-Year Low Amid Conflict; Central Bank Launches $30B FX Intervention\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shek-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shek-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shek-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shek-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shek-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shek-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shek.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Monday, as tensions escalated between Israel and Hamas militants from the recent weekend skirmishes, the Israeli shekel plummeted to its weakest level in seven years. Responding to the declining currency, the Bank of Israel unveiled a strategy to offload up to $30 billion in foreign exchange, alongside an additional $15 billion through swap initiatives. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-10T14:01:00.000Z",
    "title": "Dell Launches Innovative Generative AI Tool for Model Customization",
    "url": "https://www.cryptopolitan.com/dell-launches-innovative-generative-ai-tool/",
    "description": "Dell Technologies, a global leader in IT solutions and services, has announced the launch of a groundbreaking tool aimed at advancing the field of artificial intelligence. Named the Dell Validated Design for Generative AI with NVIDIA for Model Customization, this tool promises to streamline the AI model development process, making it more accessible and secure ... <a title=\"Dell Launches Innovative Generative AI Tool for Model Customization\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dell-launches-innovative-generative-ai-tool/\" aria-label=\"More on Dell Launches Innovative Generative AI Tool for Model Customization\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-10T13:57:02.000Z",
    "title": "Binance and Israeli Police partner to stop Hamas’s crypto donations amid rising conflict",
    "url": "https://www.cryptopolitan.com/binance-israeli-police-stop-hamass-crypto-donations-amid-rising-conflict/",
    "description": "To curb financial aid to the Palestinian militant group Hamas amid escalating violence, Binance teamed up with the cyber unit of Israel’s police. The collaboration has successfully led to the freezing of several cryptocurrency accounts believed to be linked to Hamas, significantly impacting the militant group’s fundraising campaigns. The tumultuous situation in Israel, characterized by ... <a title=\"Binance and Israeli Police partner to stop Hamas&#8217;s crypto donations amid rising conflict\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-israeli-police-stop-hamass-crypto-donations-amid-rising-conflict/\" aria-label=\"More on Binance and Israeli Police partner to stop Hamas&#8217;s crypto donations amid rising conflict\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-10T13:52:22.000Z",
    "title": "AI Revolutionizing Network Management and Monitoring",
    "url": "https://www.cryptopolitan.com/ai-network-management-and-monitoring/",
    "description": "Artificial Intelligence (AI) is rapidly transforming industries worldwide, and the realm of enterprise networking is no exception. In network management and monitoring, AI is beginning to play a pivotal role, offering a tantalizing glimpse of the future. Understanding AI in network monitoring and management AI harnesses the power of machine learning models to analyze data ... <a title=\"AI Revolutionizing Network Management and Monitoring\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-network-management-and-monitoring/\" aria-label=\"More on AI Revolutionizing Network Management and Monitoring\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-10T13:43:12.000Z",
    "title": "The Impact of AI on Big Tech Dominance: A Warning from Germany’s Antitrust Leader",
    "url": "https://www.cryptopolitan.com/the-impact-of-ai-on-big-tech-dominance/",
    "description": "In a recent interview with Reuters, Andreas Bundt, President of Germany&#8217;s Cartel Office and Chair of the International Competition Network, has raised concerns about the potential for artificial intelligence (AI) to further strengthen the dominance of large tech corporations. As AI technology continues to advance, the need for powerful servers and vast amounts of data ... <a title=\"The Impact of AI on Big Tech Dominance: A Warning from Germany&#8217;s Antitrust Leader\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-impact-of-ai-on-big-tech-dominance/\" aria-label=\"More on The Impact of AI on Big Tech Dominance: A Warning from Germany&#8217;s Antitrust Leader\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-10T13:39:43.000Z",
    "title": "Prophetic’s AI Headset Promises Dream Manipulation: A Glimpse into Lucid Dreaming’s Potential",
    "url": "https://www.cryptopolitan.com/ai-headset-promises-dream-manipulation/",
    "description": "Recent developments in artificial intelligence have stirred a whirlwind of excitement and caution. AI startup Prophetic leads the pack, claiming a revolutionary Halo headband device. Designed to instigate and manipulate lucid dreams, this device could potentially be a game-changer, but it raises inevitable concerns. The allure of lucid dreaming Lucid dreaming has fascinated humans for ... <a title=\"Prophetic&#8217;s AI Headset Promises Dream Manipulation: A Glimpse into Lucid Dreaming&#8217;s Potential\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-headset-promises-dream-manipulation/\" aria-label=\"More on Prophetic&#8217;s AI Headset Promises Dream Manipulation: A Glimpse into Lucid Dreaming&#8217;s Potential\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-10T14:00:11.000Z",
    "title": "Shiba Inu Price Dips Below Key Support: Time To Enter Or Exit SHIB?",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-price-dips-below-key-support/",
    "description": "The Shiba Inu (SHIB) price currently treads on crucial technical terrains. As highlighted in previous comprehensive analysis, the potential impacts of two distinct chart patterns were observed on the 1-week timeframe for SHIB, both leading to vastly different price trajectories. The 1-week chart reveals a compelling quadruple bottom formation for SHIB. If this pattern materializes, it could suggest a bullish surge of up to 250% from its breakout point, as delineated in prior assessments. Conversely, a starkly contrasting pattern emerges in the form of a descending triangle, which has taken shape over a span of 60 weeks. A conclusive break below its defining neckline could induce substantial declines in SHIB&#8217;s valuation. Shiba Inu Price: Currently, the bearish sentiment around Shiba Inu seems to be intensifying in the wake of the crypto market downturn. With SHIB recording a price of $0.00000695 at the press time and briefly touching a low of $0.00000674 yesterday, it has breached the descending triangle&#8217;s neckline pegged at $0.00000715. Related Reading: Shiba Inu Stagnation: What’s Causing Meme Coin’s Recent Sluggishness? Should SHIB close this week below this key support level, it might portend strong bearish implications, possibly steering the price toward its annual low of $0.000006. Yet, a closure below $0.00000715, while foreboding, is not conclusively bearish. An analogous dip occurred in June, which was swiftly followed by a robust rally. Over an 8-week period, SHIB ascended by 59%, only to face resistance at the 50-day EMA of $0.00001140, leading to a renewed breach under the descending triangle&#8217;s trend line on the weekly chart. At this juncture, if SHIB can secure a weekly close above the $0.00000715 mark either this week or the next, it might bolster the case for the bullish quadruple bottom setup. So SHIB could see a similar rally to June this year. From a technical viewpoint, the cryptocurrency will then confront key resistance barriers: the 20-day EMA at $0.00000806, the descending triangle&#8217;s trendline approximately at $0.000009, and the 50-day EMA at $0.00001019. Subsequently, a monumental target, pinpointed at the 23.6% Fibonacci retracement level of $0.00002545, representing a rally in excess of 250%, could be attainable. Related Reading: Shiba Inu-Based BONE Gearing Up For Massive Rally, Here’s Why When interpreting these patterns, investors must decide whether the quadruple bottom or the descending triangle holds more weight for them, making it a buy or sell position. Community Insights In a recent post on X (previously known as Twitter), prominent SHIB influencer, Lucie, urged the Shiba Inu community to persevere: “In these turbulent times, it&#8217;s imperative for us to remain resilient. The crypto landscape is indeed tumultuous, inundated with unsettling global updates. However, as the formidable ShibArmy, our collective endeavours will undoubtedly yield dividends. Let&#8217;s remain united, weathering challenges and championing our shared vision.” Investors and traders are encouraged to exercise caution and conduct due diligence, keeping a close watch on the unfolding SHIB price narrative. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-10T14:03:25.000Z",
    "title": "Flare Finally Integrates with Subsquid to Give Developers Access to Historical On-Chain Data",
    "url": "https://www.crypto-news-flash.com/flare-finally-integrates-with-subsquid-to-give-developers-access-to-historical-on-chain-data/?utm_source=rss&utm_medium=rss&utm_campaign=flare-finally-integrates-with-subsquid-to-give-developers-access-to-historical-on-chain-data",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/FLARE.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/FLARE.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/FLARE-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The blockchain for data platform Flare has announced its integration into the full-stack blockchain indexing solution Subsquid. Co-founder and CEO Hugo Philion has lauded the collaboration, praising Subsquid&#8217;s commitment to the open-source approach. Flare, an EVM-based layer-1 platform has officially been integrated by Subsquid, a full-stack blockchain indexing solution, to make historical on-chain data available [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-10T14:01:00.000Z",
    "title": "APE Investors Disheartened as Its Price Dips 97% From ATH",
    "url": "https://coinedition.com/ape-investors-disheartened-as-its-price-dips-97-from-ath/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/ApeCoins-APE-Price-Is-Up-0.56-Over-The-Last-Hour-Alone.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"ApeCoin’s (APE) Price Is Up 0.56% Over The Last Hour Alone\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/ApeCoins-APE-Price-Is-Up-0.56-Over-The-Last-Hour-Alone.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/ApeCoins-APE-Price-Is-Up-0.56-Over-The-Last-Hour-Alone-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/ApeCoins-APE-Price-Is-Up-0.56-Over-The-Last-Hour-Alone-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/ApeCoins-APE-Price-Is-Up-0.56-Over-The-Last-Hour-Alone-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/ApeCoins-APE-Price-Is-Up-0.56-Over-The-Last-Hour-Alone-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/ApeCoins-APE-Price-Is-Up-0.56-Over-The-Last-Hour-Alone-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Many investors feel dejected when looking at the current Apecoin (APE) price. One investor took to X yesterday sharing his own disappointment with the meme coin’s performance as he bought the token when it was worth $23.63. His holdings that totaled $35,445 are now worth only about $1,635. According to CoinMarketCap, after APE reached its [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ape-investors-disheartened-as-its-price-dips-97-from-ath/\">APE Investors Disheartened as Its Price Dips 97% From ATH</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]