[
  {
    "source": "CoinDesk",
    "date": "2023-10-16T08:48:21.000Z",
    "title": "Investor Demand for Ether Staking Yields Has Slowed: Coinbase",
    "url": "https://www.coindesk.com/markets/2023/10/16/investor-demand-for-ether-staking-yields-has-slowed-coinbase/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Staking yields have dropped to 3.5% from above 5% in the last few months, the report said."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-16T08:51:05.000Z",
    "title": "Bitcoin’s rally near $28,000 sparks $75 million in market liquidations",
    "url": "https://cryptoslate.com/insights/bitcoins-rally-near-28000-sparks-75-million-in-market-liquidations/",
    "description": "<p>Quick Take Bitcoin exhibited a price surge of more than 2.5% in the last 24 hours and an overall increase of 4% across the weekend, positioning it just under the noteworthy $28,000 mark. This uptick in Bitcoin&#8217;s value has had a significant ripple effect on the broader crypto market, instigating a total of $75 million [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoins-rally-near-28000-sparks-75-million-in-market-liquidations/\">Bitcoin&#8217;s rally near $28,000 sparks $75 million in market liquidations</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-16T08:45:55.000Z",
    "title": "SBF Trial: Lawyers argue Bankman-Fried needs more Adderall in order to participate in trial",
    "url": "https://cryptoslate.com/sbf-trial-lawyers-argue-bankman-fried-needs-more-adderall-in-order-to-participate-in-trial/",
    "description": "<p>According to a recent court letter, Samuel Bankman-Fried has reportedly faced difficulties concentrating during his ongoing criminal trial due to being denied access to his prescribed ADHD medication. As Cohen &#38; Gresser LLP stated in a letter to Judge Lewis A. Kaplan dated Oct. 15, Bankman-Fried takes a prescribed dose of Adderall for attentional issues [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sbf-trial-lawyers-argue-bankman-fried-needs-more-adderall-in-order-to-participate-in-trial/\">SBF Trial: Lawyers argue Bankman-Fried needs more Adderall in order to participate in trial</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-16T08:54:23.000Z",
    "title": "Sam Bankman-Fried Needs More Adderall To Focus, Claims Lawyers",
    "url": "https://cryptodaily.co.uk/2023/10/sam-bankman-fried-needs-more-adderall-to-focus-claims-lawyers",
    "description": "Bankman-Fried’s attorneys have stated that if a solution isn’t found, they would like to ask that the trial take a day off so they can sort out the issue."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-16T09:01:23.000Z",
    "title": "Artificial Intelligence Revolutionizes Food Safety: A Glimpse into the Future",
    "url": "https://www.cryptopolitan.com/ai-revolutionizes-food-safety/",
    "description": "In a world where self-driving cars can identify objects, it&#8217;s only logical to leverage artificial intelligence (AI) to identify harmful bacteria in our food supply. Recent research from the University of California, Davis, suggests this may not be such a far-fetched idea. Luyao Ma, a researcher at the university&#8217;s Department of Food Science and Technology, ... <a title=\"Artificial Intelligence Revolutionizes Food Safety: A Glimpse into the Future\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-revolutionizes-food-safety/\" aria-label=\"More on Artificial Intelligence Revolutionizes Food Safety: A Glimpse into the Future\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-16T09:00:43.000Z",
    "title": "Shiba Inu Price Spiral: 91% Of Investors Brace For Significant Losses",
    "url": "https://www.newsbtc.com/news/shiba-inu-plummets-around-91-expected-to-suffer-losses/",
    "description": "Shiba Inu (SHIB) holders are not exempt from the turbulence of the market in recent weeks. Analyzing the current state of affairs for holders of the meme coin, it becomes apparent that the profitability of investing in this particular asset type has been a rollercoaster journey.  Data derived from IntoTheBlock, an analytics firm, reveals a striking fact: a mere 9% of the current SHIB holders find themselves in a profitable position at the current value of roughly $0.0000069 per coin. This figure is indicative of the challenges that many SHIB investors are currently grappling with. Moreover, an additional 1% find themselves at a break-even point, while a staggering 91% face the harsh reality of being at an overall loss. Related Reading: Trillions In Shiba Inu On The Move: What Lies Ahead For The Meme Coin? Source: IntoTheBlock Shiba Inu&#8217;s Price Plunge: A Tale Of Highs And Lows One of the key contributing factors to this landscape of varying profitability is the undeniable influence of Shiba Inu&#8217;s price volatility and the composition of its holder base. Over the past few months, SHIB&#8217;s market value has been subject to dramatic oscillations, largely propelled by substantial trading volumes. This volatility has undoubtedly played a pivotal role in shaping the current financial positions of SHIB holders.  It is also worth noting that an overwhelming 78% of the circulating supply of SHIB is concentrated within the wallets of the so-called &#8216;whale&#8217; holders, emphasizing the significant influence of a few major players within the SHIB ecosystem. The plunge of Shiba Inu&#8217;s price, a staggering 92% drop from its all-time high of $0.00008616 in October 2021, has left many investors who bought at or near peak prices in a precarious position, facing significant losses. However, on the flip side, those who entered the market at relatively lower prices are potentially reveling in the positive returns yielded by their investments.  SHIB market cap slightly above $4 billion. Chart: TradingView.com At the time of writing, SHIB&#8217;s price stands at $0.00000700, as per CoinGecko, showing a 1.2% gain over the past 24 hours, though still nursing a 1.0% loss over the past seven days.  Can Shiba Inu Overcome Resistance? Despite the apparent challenges faced by SHIB holders, a glimmer of hope emerges from the analysis of the price trends. It is evident that every significant dip in SHIB&#8217;s value is consistently followed by a period of recovery, creating what appears to be a repetitive &#8220;zig-zag&#8221; pattern.  SHIB two-week price action. Source: Coingecko Related Reading: Cardano Yearly Support: The Key To A 15% Price Breakout? This pattern is indicative of a healthy correction process, a natural phenomenon within the realm of cryptocurrency markets. It speaks to the resilience of SHIB and its ability to bounce back from adversities, offering a ray of optimism amidst the prevailing uncertainty. Furthermore, the current market dynamics suggest that SHIB is grappling with a local resistance level, posing a formidable challenge to its upward trajectory. The interplay of reduced activity among the whale holders and the ongoing battle to overcome this resistance level implies that if SHIB manages to break through this barrier, a bullish trend could be on the horizon.  (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-16T08:43:49.000Z",
    "title": "BONE Token Outshines Even Bitcoin with Stellar Week Ahead",
    "url": "https://www.crypto-news-flash.com/bone-token-outshines-even-bitcoin-with-stellar-week-ahead/?utm_source=rss&utm_medium=rss&utm_campaign=bone-token-outshines-even-bitcoin-with-stellar-week-ahead",
    "description": "<img width=\"591\" height=\"330\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/BONE-.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/BONE-.png 591w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/BONE--300x168.png 300w\" sizes=\"(max-width: 591px) 100vw, 591px\" />BONE token, part of the Shiba Inu ecosystem, observed a 6.5% increase, reaching a notable $0.78 per token. Bitcoin recorded a 3.8% surge, while SHIB, Shiba Inu’s primary token, achieved only a 2% rise. BONE Token&#8217;s Radiant Performance in the Crypto Landscape As the new week dawned, the cryptocurrency realm experienced seismic activities. While Bitcoin, [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-16T08:44:27.000Z",
    "title": "What Is Stars Arena? The Ultimate Guide",
    "url": "https://www.altcoinbuzz.io/product-release/what-is-stars-arena-the-ultimate-guide/",
    "description": "<p>SoFi or Social Finance is an up-and-coming niche in crypto. In August, we saw Friend.tech launching. This SoFi platform soon saw plenty of spin-offs. One such fork is Stars Arena on Avalanche. This platform launched in late September. However, in early October it was already hacked twice. The latest hack saw $3 million in AVAX [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/product-release/what-is-stars-arena-the-ultimate-guide/\">What Is Stars Arena? The Ultimate Guide</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]