[
  {
    "source": "Decrypt",
    "date": "2024-03-04T21:58:12.000Z",
    "title": "Solana Weekly DeFi Trading Sets All-Time High Above $11 Billion",
    "url": "https://decrypt.co/220134/solana-weekly-defi-trading-all-time-high-11-billion",
    "description": "Traders swapped over $11 billion worth of digital assets on Solana last week, smashing through a previous record set in December."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-04T21:56:44.000Z",
    "title": " Dogecoin (DOGE) open interest tops $1.4B — Is it time for memecoins to correct? ",
    "url": "https://cointelegraph.com/news/dogecoin-doge-open-interest-tops-1-4b-is-it-time-for-memecoins-to-correct",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYWU2NDQyM2UtZjI4Ny00NDc3LWFhZjktOWY4YjdmYTZlY2U2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>DOGE rallied 95% in a week, but analysts signal that the bull run is only starting.</p>\n                    <p><p>Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) has been at the heart of the <a href=\"https://cointelegraph.com/news/pepe-floki-bonk-memecoins-3000-surge\">memecoin frenzy</a> for over a decade, and it continues to post wild gains, such as the 95% increase in the past 7 days alone. However, the rally has been accompanied by a record-high $1.4 billion futures open interest in Dogecoin, triggering speculation of excessive optimism among investors.</p><p>Some analysts argue that there is no altcoin season without a DOGE pump, and there is some truth to that, given its track record and $24 billion market cap, making it a top-10 cryptocurrency. </p><p>Technical analysts argue that Dogecoin is repeating \"past bull markets\" of explosive gains after 22 months of consolidation. One such example includes a post from user ali_charts on X social network.</p><p><a href=\"https://cointelegraph.com/news/dogecoin-doge-open-interest-tops-1-4b-is-it-time-for-memecoins-to-correct\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-04T21:40:31.000Z",
    "title": "JTC Network's Revolutionary Legal -Recourse Bitcoin Fork Listed on WhiteBIT, Bridging Digital Assets with Official Court Systems",
    "url": "https://cryptodaily.co.uk/2024/03/jtc-networks-revolutionary-legal-recourse-bitcoin-fork-listed-on-whitebit-bridging-digital-assets-with-official-court-systems",
    "description": "JTC Network's Revolutionary Legal -Recourse Bitcoin Fork Listed on WhiteBIT, Bridging Digital Assets with Official Court Systems"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-04T21:41:50.000Z",
    "title": "Ethereum touches $3.6k, gas fees skyrocket",
    "url": "https://crypto.news/ethereum-3600-gas-fees/",
    "description": "Ethereum has seen a price rise to $3,600, resulting in a substantial hike in gas fees amid increased network traffic."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-04T22:00:57.000Z",
    "title": "A Dual Tech Saga: Disruptive Trends From ETHDenver And MWC",
    "url": "https://www.newsbtc.com/news/a-dual-tech-saga-disruptive-trends-from-ethdenver-and-mwc/",
    "description": "As the first quarter of 2024 ends, the crypto industry has also seen the conclusion of major events, including ETHDenver. The 2018-launched mythical event has grown as the industry matures, becoming a crucial venue for founders and community members to observe new developments across the crypto ecosystem. Related Reading: XRP Price Set To Hit $1 In March: Crypto Analyst In addition, crypto and blockchain took center stage at the Mobile World Congress in Barcelona, Spain. The event, which took place last week, hosted over 100,000 attendees from over 200 countries and 2,700 exhibitors from different tech sectors. We sat down with Claudia Richoux, Founder and CEO of Banyan, and Sheraz Ahmed, Managing Partner at STORM, to discuss these conferences, and get a behind-the-scenes look at the trends and key topics for the industry now and in the future. This is what they told us. “… people actually really don&#8217;t know where we&#8217;re going or don&#8217;t know where we&#8217;re headed.” Sheraz Ahmed, STORM Managing Partner ETHDenver: A Chat With Filecoin-Based Banyan Founder Claudia Richoux Claudia Richoux founded Banyan on top of the Filecoin network to empower users and give them control over their data. In that sense, the project is an alternative to Amazon Web Services (AWS), as it pushes for data sovereignty and price optimization for startups and companies. In a world built on centralized data storage solutions, individuals are at risk of suffering from censorship, but companies face different risks as their operations become more and more reliable on a single point of failure. We spoke with Claudia about this and much more: Q: What do you think about ETHDenver? What’s the sentiment and overall vibe at the conference, and what are people talking about behind the scenes? Claudia: (…) people have been talking a lot about crypto and AI stuff and decentralized compute because that&#8217;s really, really exciting. A lot of things like Filecoin (…) we&#8217;ve all built storage and so now it&#8217;s time to figure out compute; computes really exciting, (it’s) like 60% of most AWS bills that you&#8217;re going to see from startups. So, being able to undercut the prices there and open up more freedom to compute on different platforms is super exciting. That&#8217;s something that I&#8217;ve seen a lot of the Filecoin stuff. And then at the Ethereum stuff, I&#8217;ve seen a lot of re-staking stuff. I went to some ZK (Zero Knowledge) and scaling events that were really interesting as well, and there were a lot of cool toolkits coming out. Q: Why is data storage and cloud storage so important and why would they be important in the future? And maybe you can talk a little bit about Banyan and what you guys do? Claudia: Yeah, for sure. So I mean, a lot of people come at decentralization from the angle of, “oh, it&#8217;s so important that we can&#8217;t get censored.” And that&#8217;s important. However, it&#8217;s not important to 90% of the market because most startups are not worried they&#8217;re going to get censored. Most large enterprises are not worried that they&#8217;re going to get censored. What they are worried about coming from AWS is that AWS is just going to charge them in the same amount of money. Their business will be incredibly dependent on that, (and) there&#8217;s nothing they can do and they&#8217;re just kind of stuck and they&#8217;re (spending) a huge amount of their runway is going into the pocket of AWS. So I think decentralization is really interesting. Less for the censorship angle, more for the idea of competition. So yeah, if you have 10 different service providers, all of which you can trust because of some combination of cryptographic incentives or notary systems or auditing systems, and they are competing for your business instead of you using AWS (…). (…) And yeah, if you have that competition, you&#8217;re going to have hopefully way lower prices. And we&#8217;ve already seen in the open source world that open source software development where you can have one piece of software that is kind of the commons. It&#8217;s maintained by a lot of different people who are all contributing to the same piece of software, which can save costs because you&#8217;re not duplicating work as much (…). So, with an open thing where we&#8217;re collaborating instead of competing on the development of this new cloud, we can probably drive costs down. We can probably make people fight for a more sensible margin than what AWS is charging people right now. So I think that decentralization is going to be really, really good for cutting cloud costs if we actually execute on this vision and generally just for accessibility of compute resources and making it so that you&#8217;re not having as much cloud block and dealing with that. (…) What Banyan does is we take what Filecoin has already built and we make it ready for an enterprise user to use. And that can be a big company, that can be a startup, that can be a small and medium enterprise (…). (…) we&#8217;re very focused on that. When people ask me what I do in Web3, I say, I onboard data on  Filecoin. And they&#8217;re like, is that a startup? Why is that an entire company? And I think they just, there&#8217;s an immense amount of complexity in actually bringing a decentralized startup to the enterprise, but we&#8217;re almost in GA, we&#8217;re about to launch and finally reaching the exciting part of this journey. Mobile World Congress: Insights From STORM’s Sheraz Ahmed Sheraz Ahmed, Managing Partner at STORM, attended the Mobile World Congress and gave us a look into the massive event. While not directly speaking with Richoux, they coincided on several points: the importance of data user ownership, and decentralize data storage solutions as a key sector for the industry. Speaking about the MWC, Sheraz told us: Q: What do you think about the Mobile World Congress? What were the main topics of the conversation, and how do they intertwine with blockchain and cryptocurrencies? Do you think this technology and assets are important to the conversation? Sheraz: (…) I think a core point is that it&#8217;s not only about mobile phones, it&#8217;s become about mobile technology and interconnectivity play at large. So everything from Wi-Fi 5G, satellite connection and the likes. And I think when you look at that from a broader play of data interconnectivity, because all of these companies, their main business model is the data angle. It was very interesting to discuss, see and even challenge some of those things. Honestly, when I was looking at some of the companies, seeing what they were doing and the likes, and maybe this is my perspective, but I felt like there was a lot of underlying uncertainty, so I&#8217;ve been to a few of these conferences before that have like 60,000, 80,000 people, et cetera. I&#8217;ve never seen so much interest in the consultancy, strategic consultancy side of an industry in terms of if you look at who were some of the main pavilions, I mean you had Huawei, that was huge. Some of these huge phone makers, et cetera, et cetera, they are the mobiles of Mobile World Congress. But then if you looked at how busy they were from a retail perspective, yes people would check out the new folks, check new innovation, great. But then if you really looked behind the scenes and saw the equally big consultancy firm pavilions, Deloitte, PWC, et cetera, et cetera, they were as big. So they had invested as much money, and I saw at least twice as big in terms of, or in terms of volume of people that were going there. And what that meant or what that triggered me to believe is the fact that people actually really don&#8217;t know where we&#8217;re going or don&#8217;t know where we&#8217;re headed. There was a huge reliance on consultants to tell big companies what to do. What is their strategy, what should they innovate in now, how should they innovate? And then speaking with some of the consultants themselves, they&#8217;re always very macro, very strategic, etc. But it was interesting to see that they themselves are moving away from just consultancy. That is like advisory report. Here you go. This is your strategy. Okay, well if we have the experts in-house, why don&#8217;t we build the technology or technology that then we can use to service/support some of these larger organizations on an ongoing basis basis. And I thought that that was quite interesting because they&#8217;re essentially innovating in their business model as the innovation landscape moves forward. But I definitely believe that there is this large wave of, what&#8217;s the right way to put it, a form of uncontrolled technological innovation or I feel like everyone&#8217;s a bit out of their depths. Things are moving so fast that the larger organizations are building things that they believe are going to be important to the consumers over the next years to come. And they&#8217;re building layer on top of layer of innovation that is driven by the money that they&#8217;re making and some things that the consultants are telling them and the likes. But it seems like, and again, maybe this is from my perspective, but it does seem like it&#8217;s kind of getting out of their hands in some of the innovation that&#8217;s going forward (…). But there is a lot of, “oh, what the hell? Technology has definitely made a leap into its next era, it&#8217;s next phase, it&#8217;s next generation.” And if you pull that back to the Web3 kind of angle and you look at the metaverse as an aggregation of those kind of four wave technologies, I definitely believe that that is becoming real today with how interconnected we can be through some of those mobile technologies through some of the augmented reality, virtual reality and technologies. Let&#8217;s say applications that are coming out or hardware, software that is coming out. And it was quite crazy in terms of, it didn&#8217;t necessarily feel like, there was this one kind of common one. Common direction, yes, maybe in a way. But it really felt like there was a lot happening. A lot of people are trying to shoot not in the dark, but shoot in a lot of different places to see okay, where are we headed? And it was kind of a moment as well where you can look at in each moment of uncertainty, chaos, there&#8217;s a lot of opportunity. It felt like we were at that pivotal moment and the energy of opportunism was in the air. &#160; Q: Microsoft, JP Morgan, Accenture, and many other big names in one place talking about the emergences of new technologies, such as AI, blockchain, etc., and it seems like every year it is easier to see the likes of Google joining hands with a crypto project, but what are they contributing with? Where can we see these collaborations actually coming to life? Sheraz: Yeah, I think today most of the blockchain world is based on centralized cloud storage, cloud computing. And there were quite some applications at the Mobile World Congress that were looking at decentralized forms of cloud storage. Now if you look at the Amazon&#8217;s AWS or Google, these kind of companies like Google Cloud is heavily pushing for more blockchain based businesses to run their nodes on their clouds and the likes, right? So I think that was a big push there. That is a push there definitely that&#8217;s foreseeable. I&#8217;ve seen a lot of them start pushing more kind of innovation programs that are not only blockchain led, but that some of the ideas that they&#8217;re trying to bring in, they want to have some form of distributed technology as an underlying for maybe some properties that blockchain can provide. Related Reading: CryptoQuant’s Bitcoin “Bull-Bear” Indicator Flags Price As Overheated So I think that was a big one. It wasn&#8217;t really spoken at the Mobile World Congress, but I think the whole zero knowledge kind of privacy side is going to be super important play when it comes to data and especially when it comes to interconnectivity of different devices together and being able to, you don&#8217;t want your data to just be flown through different channels and systems left, right and center. You&#8217;re going to want to have some form of encrypted, but also privacy filtered innovation or applications that allow you to ensure that what you&#8217;re putting into a certain database isn&#8217;t going in and out and everywhere. So I think that&#8217;s an important one that is coming as well. And I think that&#8217;s something that some of the larger organizations are working towards. Cover image from Dall-E, chart from Tradingview"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-04T21:40:35.000Z",
    "title": "JTC Network’s Revolutionary Legal -Recourse Bitcoin Fork Listed on WhiteBIT, Bridging Digital Assets with Official Court Systems",
    "url": "https://coinedition.com/jtc-networks-revolutionary-legal-recourse-bitcoin-fork-listed-on-whitebit-bridging-digital-assets-with-official-court-systems/",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://coinedition.com/wp-content/uploads/2024/03/128a_JTC_To_List_On_WhiteBit_Exchange_1709566809mVRXLEWbkv.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/03/128a_JTC_To_List_On_WhiteBit_Exchange_1709566809mVRXLEWbkv.jpg 1200w, https://coinedition.com/wp-content/uploads/2024/03/128a_JTC_To_List_On_WhiteBit_Exchange_1709566809mVRXLEWbkv-300x180.jpg 300w, https://coinedition.com/wp-content/uploads/2024/03/128a_JTC_To_List_On_WhiteBit_Exchange_1709566809mVRXLEWbkv-1024x614.jpg 1024w, https://coinedition.com/wp-content/uploads/2024/03/128a_JTC_To_List_On_WhiteBit_Exchange_1709566809mVRXLEWbkv-380x228.jpg 380w, https://coinedition.com/wp-content/uploads/2024/03/128a_JTC_To_List_On_WhiteBit_Exchange_1709566809mVRXLEWbkv-768x461.jpg 768w, https://coinedition.com/wp-content/uploads/2024/03/128a_JTC_To_List_On_WhiteBit_Exchange_1709566809mVRXLEWbkv-148x89.jpg 148w, https://coinedition.com/wp-content/uploads/2024/03/128a_JTC_To_List_On_WhiteBit_Exchange_1709566809mVRXLEWbkv-742x445.jpg 742w, https://coinedition.com/wp-content/uploads/2024/03/128a_JTC_To_List_On_WhiteBit_Exchange_1709566809mVRXLEWbkv-412x247.jpg 412w, https://coinedition.com/wp-content/uploads/2024/03/128a_JTC_To_List_On_WhiteBit_Exchange_1709566809mVRXLEWbkv-400x240.jpg 400w, https://coinedition.com/wp-content/uploads/2024/03/128a_JTC_To_List_On_WhiteBit_Exchange_1709566809mVRXLEWbkv-275x165.jpg 275w, https://coinedition.com/wp-content/uploads/2024/03/128a_JTC_To_List_On_WhiteBit_Exchange_1709566809mVRXLEWbkv-352x211.jpg 352w, https://coinedition.com/wp-content/uploads/2024/03/128a_JTC_To_List_On_WhiteBit_Exchange_1709566809mVRXLEWbkv-117x70.jpg 117w, https://coinedition.com/wp-content/uploads/2024/03/128a_JTC_To_List_On_WhiteBit_Exchange_1709566809mVRXLEWbkv-125x75.jpg 125w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" /><p>Chicago, Illinois, March 4th, 2024, Chainwire JTC Network, a next-gen Bitcoin fork with native connections to official government legal systems, will be listed for trading on March 5 by the WhiteBIT exchange. WhiteBIT’s listing follows consistent solid performances by the JTC ecosystem, including successful use within the U.S. federal court system, an NFT platform with [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/jtc-networks-revolutionary-legal-recourse-bitcoin-fork-listed-on-whitebit-bridging-digital-assets-with-official-court-systems/\">JTC Network&#8217;s Revolutionary Legal -Recourse Bitcoin Fork Listed on WhiteBIT, Bridging Digital Assets with Official Court Systems</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]