[
  {
    "source": "Crypto Briefing",
    "date": "2023-07-22T11:27:58.000Z",
    "title": "SEC Hints at Challenging Court XRP Ruling in Separate Lawsuit",
    "url": "https://cryptobriefing.com/sec-may-challenge-ripple-ruling/?utm_source=feed&utm_medium=rss",
    "description": "The U.S. Securities and Exchange Commission (SEC) has given itsresponse to the recent court decision in its case against Ripple Labs, arguing that XRP isn&#8217;t a security when sold to..."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-22T11:33:43.000Z",
    "title": "Ethereum (ETH) Records Highest CEX Inflows In 2 Months",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-eth-records-highest-cex-inflows-in-2-months/",
    "description": "Over the past week, Ethereum (ETH) registered the highest inflows into centralized exchanges (CEX) in the past two months. These significant asset movements have suggested a potential price dip for ETH. CoinGecko data shows that the second-largest cryptocurrency has been experiencing a slight price decline, losing 2.5% of its value in the past week. As of this writing, the Ether token changes hand at $1,892.65, with a negligible 0.2% gain in the last 24 hours. Related Reading: XDC Network Dominates Weekend Top 100 Roster With 50% Rally Ethereum Registers $383 Million Worth Of ETH In CEX Inflows According to data from IntoTheBlock, Ethereum witnessed the largest inflows into centralized exchanges in the past two months. The data analytics platform found that at least $383 million worth of ETH was deposited into these exchanges. IntoTheBlock also revealed that a significant percentage of the CEX inflows came from a single address and in a single transaction. This deposit came from an old wallet that accumulated 61,216 ETH during the Ethereum Initial Coin Offering (ICO). This pre-mine wallet had been dormant for eight years, with its constituent ETH worth more than $116 million untouched. On Wednesday, July 19, this address became activated, and its stash of Ether tokens was abruptly moved to another address associated with the Kraken exchange. Data from Whale Alert shows that a significant amount of Ether tokens has been transferred to crypto exchanges by several whales over the past week. Notably, more than 200,000 Ether tokens have been transferred to Coinbase in separate transactions within this period. Indeed, the movement of massive amounts of ETH to centralized exchanges can signal impending selling pressure, which can drive the asset’s price down. However, not all large transfers to an exchange precipitate a downward price movement, as the whales might not intend to sell immediately or all at once. Total ETH Staked Reaches All-Time High The Ethereum network has been experiencing a steady increase in the total amount of ETH staked on the blockchain. According to data from IntoTheBlock, this figure has reached $52.3 billion, representing its highest value ever. The data analytics company also noted that with an increasing amount of staked ETH, the Ethereum blockchain is bound to become even more secure, as there will be a corresponding decrease in the risk of the network being taken over by a single entity.  Related Reading: Dogecoin Becomes 8th-Largest Cryptocurrency After Adding $1 Billion To Market Cap It is worth noting that this surge in staking activity can be linked to the successful launch of the Shapella upgrade. The Shapella upgrade offered a new dimension to ETH staking, as investors can now lock and unlock their assets at will. This increased flexibility eliminated a substantial portion of risk that has been attributed to ETH staking in the past. ETHUSD trading at $1,886.82 &#124; Source: ETHUSD daily chart from TradingView &#160; Featured image from Getty, chart from TradingView"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-22T11:15:11.000Z",
    "title": "How Did Shiba Inu Price React To 3 Trillion SHIB Investor Accumulation?",
    "url": "https://www.newsbtc.com/news/how-did-shiba-inu-price-react-to-3-trillion-shib-investor-accumulation/",
    "description": "Shiba Inu (SHIB) has emerged as a force to be reckoned with in the digital asset landscape despite the lack of significant bullish momentum in the past few weeks. However, recent events have catapulted this canine-inspired cryptocurrency into the spotlight, as an astonishing 3 trillion SHIB tokens were accumulated by investors.  Cryptocurrencies are renowned for their inherent volatility, and Shiba Inu is no exception. The token&#8217;s meteoric popularity and the passionate community backing it have contributed to its roller-coaster journey on the market. But with the recent accumulation of such an astronomical number of SHIB tokens, questions arise about how this development will reverberate throughout the ecosystem and influence its market value. SHIB Token Accumulation And Price Stability A recent SHIB price report highlights a notable surge in SHIB token accumulation by investors, indicating heightened interest and confidence in the cryptocurrency. Related Reading: XDC Network Dominates Weekend Top 100 Roster With 50% Rally With approximately 3 trillion SHIB tokens, amounting to a significant value of over $23 million being bought from exchanges within a two-day period, it appears that investors are actively seeking to bolster their positions in the Shiba Inu ecosystem. Within two days, exchanges sold 3 trillion SHIB coins worth $23 million. Source: Santiment Despite the substantial increase in token accumulation, the Shiba Inu price has not witnessed any significant change, leaving investors somewhat disconcerted. A lack of price movement often results in a scenario where investors adopt a &#8220;wait-and-see&#8221; approach, keeping their holdings static rather than engaging in active trades. This phenomenon, commonly known as &#8220;sitting ducks,&#8221; can hinder the overall liquidity and dynamism of the SHIB market. SHIB feeling the pain on the weekly timeframe. Source: Coingecko Based on the latest data from crypto market tracker Coingecko, the current price of SHIB stands at $0.00000785. Over the past 24 hours, the token has experienced a modest 1.2% rally, which indicates some level of short-term market activity. However, over the last seven days, SHIB has faced a decline of 5.8%, hinting at potential challenges in sustaining positive price momentum. Shibarium’s Potential Meanwhile, Shiba Inu is gearing up to introduce an innovative layer-2 solution known as Shibarium, aiming to revolutionize the process of purchasing SHIB tokens by enhancing cost-effectiveness, efficiency, and speed. Shiba Inu market cap currently at $4.5 billion on the weekend chart: TradingView.com This highly anticipated L2 network has garnered immense excitement within the Shiba Inu community, with investors hailing it as the potential catalyst for propelling SHIB&#8217;s price to unprecedented heights, even setting the ambitious target of reaching $0.01. Related Reading: Chainlink Holds Strong With 19% Rally – More Gains In The Pipeline? The impending launch of Shibarium has ignited a surge of optimism among SHIB enthusiasts, as it promises to address the inherent limitations of the current token acquisition process. By leveraging the power of layer-2 technology, the network intends to streamline transactions and reduce fees, making the buying experience more accessible and seamless for users. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from The Currency Analytics"
  }
]