[
  {
    "source": "CryptoSlate",
    "date": "2023-09-05T22:00:34.000Z",
    "title": "Bitcoin’s drop to $25k coincides with peak in long-term holding",
    "url": "https://cryptoslate.com/insights/bitcoins-drop-to-25k-coincides-with-peak-in-long-term-holding/",
    "description": "<p>Quick Take The Spent Output Profit Ratio (SLRV) inversion occurred on August 13, preceding a notable drop in Bitcoin&#8217;s value to $25,000 just three days later. The SLRV Ratio, a pivotal measure in the crypto market, measures the percentage of Bitcoins that were last moved within 24 hours against those moved between 6-12 months prior. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoins-drop-to-25k-coincides-with-peak-in-long-term-holding/\">Bitcoin&#8217;s drop to $25k coincides with peak in long-term holding</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-09-05T21:48:17.000Z",
    "title": "Tether Holds More US Treasury Bonds Than Australia, CTO Claims",
    "url": "https://cryptobriefing.com/tether-cto-affirms-72-5-billion-us-treasury-bonds/?utm_source=feed&utm_medium=rss",
    "description": "Tether now ranks as the 22nd largest holder of US T-bills, surpassing nations like Australia, UAE, and Mexico."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-05T22:02:00.000Z",
    "title": "Institutional Investors Bet on Solana as $SOL Investment Products Record 9th Week of Inflows",
    "url": "https://www.cryptoglobe.com/latest/2023/09/institutional-investors-bet-on-solana-as-sol-investment-products-record-9th-week-of-inflows/",
    "description": "Cryptocurrency investment products focusing on the smart contract platform Solana ($SOL), Ethereum ($ETH) rival whose performance was negatively affected by the collapse of FTX, have been seeing significant inflows so far this year, and recently recorded its ninth consecutive week of inflows. According to CoinShares’ latest Digital Asset Fund Flows weekly report, in a week […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-05T22:06:00.000Z",
    "title": "Do Not Pass Up These Top 3 Undervalued Cryptocurrencies – Dogecoin (DOGE), XRP (XRP) and Everlodge (ELDG)",
    "url": "https://cryptodaily.co.uk/2023/09/do-not-pass-up-these-top-3-undervalued-cryptocurrencies-dogecoin-doge-xrp-xrp-and-everlodge-eldg",
    "description": "As the market continues to mature, savvy investors are always looking for undervalued assets with the potential to provide significant returns."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T22:05:45.000Z",
    "title": "Return of Big Government: Funding the overhaul challenge",
    "url": "https://www.cryptopolitan.com/return-of-big-government-overhaul-challenge/",
    "description": "A resurgence, almost seismic in its impact, is currently shaking the foundations of global economic systems. Big government is making a grand re-entry, challenging our long-held beliefs about fiscal policies and intervention. A paradigm shift is imminent, and its implications are daunting, both fiscally and politically. New Directions in Financial Dialogues Amidst a backdrop of ... <a title=\"Return of Big Government: Funding the overhaul challenge\" class=\"read-more\" href=\"https://www.cryptopolitan.com/return-of-big-government-overhaul-challenge/\" aria-label=\"More on Return of Big Government: Funding the overhaul challenge\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T21:56:59.000Z",
    "title": "Apple, Microsoft battle EU over iMessage and Bing",
    "url": "https://www.cryptopolitan.com/apple-microsoft-battle-eu-over-imessage-bing/",
    "description": "Two of the tech world&#8217;s juggernauts, Apple and Microsoft, are standing their ground against the European Union, questioning the very fabric of upcoming regulations. While both companies have been global innovators in their own right, it&#8217;s the clash with Brussels over the forthcoming Digital Markets Act (DMA) that puts the spotlight squarely on them. The ... <a title=\"Apple, Microsoft battle EU over iMessage and Bing\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apple-microsoft-battle-eu-over-imessage-bing/\" aria-label=\"More on Apple, Microsoft battle EU over iMessage and Bing\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T21:48:40.000Z",
    "title": "More challenges ahead for global finance, says expert",
    "url": "https://www.cryptopolitan.com/more-challenges-ahead-for-global-finance/",
    "description": "With heightened concerns over a stalling economic recovery and the unfolding impact of elevated interest rates, global finance remains in precarious territory. G20 leaders gathered in New Delhi are now bracing for new obstacles in the financial realm, particularly with vulnerable sectors like real estate poised on the brink. Real Estate: A Sector Under Watch ... <a title=\"More challenges ahead for global finance, says expert\" class=\"read-more\" href=\"https://www.cryptopolitan.com/more-challenges-ahead-for-global-finance/\" aria-label=\"More on More challenges ahead for global finance, says expert\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-05T22:00:07.000Z",
    "title": "VISA’s Stablecoin Payments On Solana Propel SOL To 5% Gain, Bulls Eye Price Breakout",
    "url": "https://www.newsbtc.com/news/solana/visas-stablecoin-payments-on-solana-propel-sol-to-5-gain-bulls-eye-price-breakout/",
    "description": "Payment giant VISA has significantly moved in the digital currency space by expanding its stablecoin settlement services to the Solana (SOL) blockchain.  According to recent announcements, the company aims to enhance the capabilities of traditional payment systems through this pilot program, which is currently in the testing phase.  This initiative is expected to improve cross-border settlement speeds and offer a modern option for clients to send and receive funds through Visa&#8217;s treasury.  In collaboration with merchant acquirers Worldpay and Nuvei, this expansion reinforces Visa&#8217;s commitment to staying at the forefront of digital currency and blockchain innovation, according to VISA’s head of Crypto, Cuy Sheffield.  VISA Expands Stablecoin Settlement Services To Solana Solana, a blockchain platform known for its scalability, has been chosen by VISA to extend its stablecoin settlement capabilities. With Solana&#8217;s existing support for Ethereum (ETH), VISA is leveraging the strengths of both platforms to facilitate efficient and secure transactions.  Related Reading: Litecoin Price Momentum: Will It Sustain Above The $63 Mark? Per the announcements, VISA aims to enhance cross-border settlement efficiency by leveraging stablecoins such as USDC (USD Coin) and utilizing the global blockchain networks of Solana and Ethereum.  This integration allows users to benefit from the advantages of Solana&#8217;s blockchain, such as fast transaction speeds and low fees.  Furthermore, integrating VISA&#8217;s stablecoin settlement services with Solana provides increased utility and credibility to the platform and its native cryptocurrency, contributing to the SOL value surge. Overall, VISA&#8217;s decision to expand its stablecoin settlement services to the Solana blockchain signifies the company&#8217;s recognition of the potential offered by blockchain technology and digital currencies.  VISA’s selection of Solana as a partner underscores its reputation as a scalable and efficient blockchain platform. The positive market response, as evidenced by the surge in SOL&#8217;s price, highlights the growing confidence in the potential of both Solana and stablecoin solutions.  As VISA continues to explore and embrace digital currency innovations, it reinforces the ongoing transformation of the global financial landscape. Bullish Momentum For SOL The recent announcement of VISA&#8217;s expansion into the Solana blockchain has notably impacted the price of SOL, Solana&#8217;s native cryptocurrency.  Since the news broke, SOL has surged by 5.2% in the past 24 hours, currently trading at $20.46. This surge reflects the market&#8217;s positive response to VISA embracing Solana&#8217;s capabilities. In the immediate term, bullish investors will face a key resistance level of $20.82, which was lost on August 30 after a consolidation period of 15 days following a sharp decline influenced by the overall market trend. Related Reading: Bitcoin Trade Volumes Beat YTD Average As Inflows Resume: Are Bulls Taking Over? Should bulls successfully overcome this resistance level, the next hurdle to watch out for would be the 50-day Moving Average (MA) at the $21.89 level. This moving average could act as a further resistance level for the token. On the downside, if any of these possibilities don&#8217;t play out, SOL bulls will need to defend the $19.15 level and strive to consolidate above this crucial point. Conversely, Solana&#8217;s circulating market capitalization currently stands at $8.25 billion. However, over the past 30 days, it has declined 12.47%. Featured image from iStock, chart from TradingView.com "
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-05T21:44:00.000Z",
    "title": "You Don’t Need To Burn XRP For EVRS Airdrop: Evernode Founder",
    "url": "https://coinedition.com/you-dont-need-to-burn-xrp-for-evrs-airdrop-evernode-founder/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/XRP_Retests_0_40_Amid_Whale_Transfers_Analysts_Eye_0_44_For_Breakout.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"You Don’t Need To Burn XRP For EVRS Airdrop: Evernode Founder\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/XRP_Retests_0_40_Amid_Whale_Transfers_Analysts_Eye_0_44_For_Breakout.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/XRP_Retests_0_40_Amid_Whale_Transfers_Analysts_Eye_0_44_For_Breakout-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/XRP_Retests_0_40_Amid_Whale_Transfers_Analysts_Eye_0_44_For_Breakout-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/XRP_Retests_0_40_Amid_Whale_Transfers_Analysts_Eye_0_44_For_Breakout-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/XRP_Retests_0_40_Amid_Whale_Transfers_Analysts_Eye_0_44_For_Breakout-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/XRP_Retests_0_40_Amid_Whale_Transfers_Analysts_Eye_0_44_For_Breakout-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Evernode founder, Scott Chamberlain, has clarified that eligible XRP holders do not need to burn their digital assets to receive new tokens in the upcoming EVRS airdrop. Posting on X (formerly Twitter), Chamberlain explained that XRP holders who clone their r-addresses on Xahau will receive enough Xahau XRP to open an account and set a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/you-dont-need-to-burn-xrp-for-evrs-airdrop-evernode-founder/\">You Don’t Need To Burn XRP For EVRS Airdrop: Evernode Founder</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-05T22:01:28.000Z",
    "title": "Tech Entrepreneur Accused of Massive $290,000,000 Crypto Fraud, Theft and Money Laundering: Report",
    "url": "https://dailyhodl.com/2023/09/05/tech-entrepreneur-accused-of-massive-290000000-crypto-fraud-theft-and-money-laundering-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/10/crypto-fraud-five-years.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/10/crypto-fraud-five-years.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/10/crypto-fraud-five-years.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/10/crypto-fraud-five-years.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/10/crypto-fraud-five-years.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/10/crypto-fraud-five-years.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/10/crypto-fraud-five-years.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A serial tech entrepreneur is being accused of a slew of potential crimes amounting to a sum of nearly $300 million. According to a new Bloomberg report, Israeli police are accusing Moshe Hogeg and his partners of defrauding investors of $290 million when they raised capital for crypto projects in 2017 and 2018. Israeli national police [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/05/tech-entrepreneur-accused-of-massive-290000000-crypto-fraud-theft-and-money-laundering-report/\">Tech Entrepreneur Accused of Massive $290,000,000 Crypto Fraud, Theft and Money Laundering: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]