[
  {
    "source": "CryptoSlate",
    "date": "2024-02-28T00:15:29.000Z",
    "title": "Chamber of Digital Commerce files amicus brief supporting Kraken in SEC lawsuit",
    "url": "https://cryptoslate.com/chamber-of-digital-commerce-files-amicus-brief-supporting-kraken-in-sec-lawsuit/",
    "description": "<p>The Chamber of Digital Commerce filed an amicus curiae defending crypto exchange Kraken in the lawsuit initiated by the US SEC, according to Feb. 27 court filings. The Chamber explained that the purpose of the amicus brief is to end the SEC&#8217;s attempted regulation of the digital asset industry through enforcement without legislative authority. The [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/chamber-of-digital-commerce-files-amicus-brief-supporting-kraken-in-sec-lawsuit/\">Chamber of Digital Commerce files amicus brief supporting Kraken in SEC lawsuit</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-28T00:30:03.000Z",
    "title": "$30 Billion Investment Platform Approves 4 Spot Bitcoin ETFs for Clients",
    "url": "https://news.bitcoin.com/30-billion-investment-platform-approves-4-spot-bitcoin-etfs-for-clients/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/carson-group-etfs-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/carson-group-etfs-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/carson-group-etfs-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/carson-group-etfs-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/carson-group-etfs-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/carson-group-etfs-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/carson-group-etfs-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/carson-group-etfs.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Carson Group, an investment platform with $30 billion in assets under management, has reportedly approved four spot bitcoin exchange-traded funds (ETFs) on its platform. The approved funds include Blackrock&#8217;s Ishares Bitcoin Trust (IBIT) and Fidelity Wise Origin Bitcoin Fund (FBTC). &#8220;We feel it is important to offer these products as a result of two of [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-28T00:30:44.000Z",
    "title": "Stablecoins Join The Crypto Bull Run With $140B Market Cap, Highest Since 2022",
    "url": "https://www.newsbtc.com/stablecoin/stablecoins-join-the-crypto-bull-run-with-140b-market-cap-highest-since-2022/",
    "description": "February has been an overall notable month for cryptocurrencies and the crypto industry. We’ve seen Bitcoin and Ether, the two largest cryptocurrencies by market capitalization, reach milestones not seen since the crypto winter started. The bull run has seemingly started, as many analysts and investors have announced, and it appears to be following a ‘2-year trend’ where the industry is beginning to reclaim the heights lost in 2022. Consequentially, the rally has propelled the overall market cap of the crypto industry. Related Reading: Ethereum (ETH) Price Reaches $3,000 After Two Years, More Excitement To Come? Stablecoins Remain Stable, But The Market Is Expanding According to data from DefiLlama, stablecoins have joined the crypto market in the bullish rally, as its market capitalization hit $140 billion for the first time since December 2022. Stablecoins are cryptocurrencies designed to have value pegged to another currency, like the US dollar, or a commodity, like gold. They account for a large portion of the daily trading volume of cryptocurrencies, as many consider them more useful for everyday transactions. The slow and steady recovery of the crypto industry has been maturing the bullish sentiment in the community. Fueled by investors’ trust in crypto assets and important developments in the industry, the crypto market seems to be recovering to achieve a performance like that of the previous crypto bull run. Stablecoins Market Capitalization hits $140B. Source: DefiLlama However, stablecoin’s recent market expansion is not only fueled by the positive sentiment. Tether (USDT) sits as the third largest cryptocurrency by market capitalization, with over $98 billion, and it has continued to extend its reach in the last few years. Just this month, USDT’s market cap increased by $2 billion; in the last year, it has risen by over $28 billion. USDT is also ranked as the first cryptocurrency by trading volume in the previous 24 hours, according to data from CoinMarketCap. Circle’s USDC, ranked fifth by daily trading volume and seventh by market cap, has also seen impressive growth, with its $2 billion market cap increase showing a recovery this month. The stablecoin’s market capitalization saw a 1-year slump after dropping from $40 billion in March last year. However, the relisting of its trading pairs on Binance and the recent expansion to international markets has fueled USDC’s ‘resurgence,’ as Coinbase recently called it. Crypto Market Cap Hits $2T Today, the total crypto market cap hit $2 trillion as Bitcoin’s price spiked to $57,000, increasing 32.2% monthly and 101.3% in the past year. This milestone has not been reached since April 2022, when the total crypto market cap was at $2.1 trillion. However, Bitcoin’s parabolic surge is not the only reason behind this achievement, as the altcoin market cap, which includes all cryptocurrencies except for BTC, has grown 29.35% in 30 days. Accordingly, the market capitalization for altcoins hit $255 billion, representing a 111.6% surge last year. Similarly, this level has not been seen since April of 2022. The altcoin market has seen green throughout February as interest in cryptocurrencies soared massively, led by the ETFs frenzy that started building at the end of last year and exploded in January. Related Reading: Top Memecoins Face Pullback Amid Recent Market Rally Crypto market capitalization sitting at $2.09 Trillion in the 30-day chart. Source: TradingView.com Feature image from Unsplash.com, Charts from Tradingview.com and DeFiLlama.com"
  }
]