[
  {
    "source": "Bitcoin.com",
    "date": "2023-10-13T03:30:04.000Z",
    "title": "JPMorgan’s Tokenized Collateral Network Facilitates Blackrock-Barclays Trade",
    "url": "https://news.bitcoin.com/jpmorgans-tokenized-collateral-network-facilitates-blackrock-barclays-trade/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/jpmorgan-blockchain-solution-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"JPMorgan&#039;s Tokenized Collateral Network Facilitates Blackrock-Barclays Trade\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/jpmorgan-blockchain-solution-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/jpmorgan-blockchain-solution-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/jpmorgan-blockchain-solution-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/jpmorgan-blockchain-solution-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/jpmorgan-blockchain-solution-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/jpmorgan-blockchain-solution-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/jpmorgan-blockchain-solution.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Banking giant JPMorgan Chase has debuted its blockchain-based collateral settlement system. Blackrock became the first client to use JPMorgan&#8217;s Tokenized Collateral Network (TCN). The world’s largest asset manager used the system to convert shares in one of its money market funds into digital tokens, which it then used as collateral in an over-the-counter derivatives trade [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T03:21:00.000Z",
    "title": "How Other Countries Responsibly Harness AI Potential with AI Regulation – Exclusive Report",
    "url": "https://www.cryptopolitan.com/harness-ai-potential-with-ai-regulation/",
    "description": "In an era where artificial intelligence (AI) increasingly intertwines with daily life, its influence is undeniable. From personal digital assistants to intricate supply chain optimizations, AI&#8217;s pervasive impact touches diverse sectors, including healthcare, finance, and entertainment. As this technological marvel continues to evolve, creating opportunities and challenges, the pressing question arises: how do we harness ... <a title=\"How Other Countries Responsibly Harness AI Potential with AI Regulation &#8211; Exclusive Report\" class=\"read-more\" href=\"https://www.cryptopolitan.com/harness-ai-potential-with-ai-regulation/\" aria-label=\"More on How Other Countries Responsibly Harness AI Potential with AI Regulation &#8211; Exclusive Report\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T03:10:25.000Z",
    "title": "What Skills Do Students Need in the AI Age? Shelley Gates Offers a Roadmap",
    "url": "https://www.cryptopolitan.com/skills-students-need-ai-age-shelley-gates/",
    "description": "As the world continues to grapple with the implications of artificial intelligence (AI), Shelley Gates emerges as a key advocate for preparing today&#8217;s youth for the transformative era known as the &#8220;AI age.&#8221; While conversations about the future of work automation and the use of AI technologies in education are taking place, Gates talks on ... <a title=\"What Skills Do Students Need in the AI Age? Shelley Gates Offers a Roadmap\" class=\"read-more\" href=\"https://www.cryptopolitan.com/skills-students-need-ai-age-shelley-gates/\" aria-label=\"More on What Skills Do Students Need in the AI Age? Shelley Gates Offers a Roadmap\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-13T03:39:32.000Z",
    "title": "Ethereum Price Plunge Imminent as Key Support Line Collapses",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-plunge-imminent-1440/",
    "description": "Ethereum price is moving lower toward the $1,500 support against the US dollar. ETH could correct higher, but upsides might be limited above $1,565. Ethereum is struggling to start a recovery above $1,550. The price is trading below $1,565 and the 100-hourly Simple Moving Average. There are two bearish trend lines forming with resistance near $1,555 and $1,570 on the hourly chart of ETH/USD (data feed via Kraken). The pair could correct higher, but the bears might remain active near $1,565. Ethereum Price Extends Losses Ethereum remained in a bearish zone below the $1,580 resistance zone. ETH failed to stay above the key $1,550 support and extended its decline, unlike Bitcoin. The price traded to a new weekly low at $1,521. It seems like the price is slowly moving lower after it settled below $1,600. There are also two bearish trend lines forming with resistance near $1,555 and $1,570 on the hourly chart of ETH/USD. Ethereum is now trading below $1,565 and the 100-hourly Simple Moving Average. There was a minor increase above the 23.6% Fib retracement level of the recent decline from the $1,595 swing high to the $1,521 low. On the upside, the price might face resistance near the $1,555 level and the first trend line. The first major resistance is near the second trend line, $1,565, and the 100-hourly Simple Moving Average. It is close to the 61.8% Fib retracement level of the recent decline from the $1,595 swing high to the $1,521 low. Source: ETHUSD on TradingView.com A clear move above the $1,570 resistance might send the price toward the key resistance at $1,600. In the stated case, Ether could rise and recover toward the $1,665 resistance. Any more gains might open the doors for a move toward $1,750. More Losses in ETH? If Ethereum fails to clear the $1,565 resistance, it could continue to move down. Initial support on the downside is near the $1,520 level. The next key support is $1,500. A downside break below the $1,500 support might send the price further lower. In the stated case, the price could drop toward the $1,440 level. Any more losses may perhaps send Ether toward the $1,420 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,500 Major Resistance Level – $1,565"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-13T03:17:29.000Z",
    "title": "Bitcoin Price Holds Ground But Upsides Turned Attractive To Bears",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-holds-ground-26500/",
    "description": "Bitcoin price is consolidating above the $26,550 level. BTC could correct higher, but upsides might be capped near the $27,400 and $27,500 resistance levels. Bitcoin is finding bids near the $26,550 level. The price is trading below $27,200 and the 100 hourly Simple moving average. There is a key bearish trend line forming with resistance near $26,200 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could correct higher, but the bears might remain active near the $27,500 zone. Bitcoin Price Holds Support Bitcoin price started a fresh decline from the $27,500 resistance. BTC traded below the $27,000 level to enter a bearish zone. Finally, the bulls appeared above the $26,500 support. The price remained well-bid near the $26,550 level. The bears made two attempts to push the price below $26,550, but they failed. A low is formed near $26,551 and the price is now consolidating losses below the 23.6% Fib retracement level of the downward move from the $28,285 swing high to the $26,551 low. Bitcoin is now trading below $27,200 and the 100 hourly Simple moving average. There is also a key bearish trend line forming with resistance near $26,200 on the hourly chart of the BTC/USD pair. Immediate resistance is near the $26,950 level. The first major resistance is $27,200 and the 100 hourly Simple moving average. The next key resistance could be $27,400 and the trend line. It is close to the 50% Fib retracement level of the downward move from the $28,285 swing high to the $26,551 low. Source: BTCUSD on TradingView.com A close above the $27,500 resistance might start a steady increase toward the $28,000 level. The main hurdle is still $28,500, above which the price could start another increase. In the stated case, the price could rise toward the $30,000 resistance. More Losses In BTC? If Bitcoin fails to recover higher above the $27,200 resistance, there could be more losses. Immediate support on the downside is near the $26,550 level. The next major support is near the $26,500 level. A downside break and close below the $26,500 support might send the price further lower. The next support sits at $26,000. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $26,550, followed by $26,500. Major Resistance Levels – $27,200, $27,400, and $27,500."
  }
]