[
  {
    "source": "Decrypt",
    "date": "2023-11-06T19:00:02.000Z",
    "title": "Hackers Pinch Nearly $1 Million in Crypto Via Fake Ledger App on Microsoft App Store",
    "url": "https://decrypt.co/204506/fake-ledger-app-microsoft-app-store-zachxbt",
    "description": "Microsoft’s official App Store served up fraudulent code crafted by crypto crooks. "
  },
  {
    "source": "Decrypt",
    "date": "2023-11-06T18:56:55.000Z",
    "title": "'The Simpsons' Skewered NFTs—But Not Before Cashing In on the Craze",
    "url": "https://decrypt.co/204491/simpsons-skewered-nfts-not-before-cashing-craze",
    "description": "NFTs were a punchline on 'The Simpsons' this weekend. But in 2021, the iconic show sold golden, Bart-themed digital collectibles to its fans."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-06T18:42:32.000Z",
    "title": "$ADA: Crypto Analyst Says ‘Cardano Bulls Ignited the Fuse!’",
    "url": "https://www.cryptoglobe.com/latest/2023/11/ada-crypto-analyst-says-cardano-bulls-ignited-the-fuse/",
    "description": "Dan Gambardello, the Founder of Crypto Capital Venture, has provided an insightful analysis of Cardano’s (ADA) recent price movements. He begins by acknowledging the excitement around ADA’s surge, posing the critical question of whether this uptrend can persist, especially in the short term, and if ADA can hit the 40-cent mark or is due for […]\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-06T18:53:05.000Z",
    "title": "OKX to delist 26 trading pairs and several high-risk tokens ",
    "url": "https://crypto.news/okx-to-delist-26-trading-pairs-and-several-high-risk-tokens/",
    "description": "OKX announces the delisting of several trading pairs, including BTM, which saw a 32% drop today. "
  },
  {
    "source": "Kraken Blog",
    "date": "2023-11-06T18:49:14.000Z",
    "title": "Security above everything: why every month is Cybersecurity Awareness Month at Kraken",
    "url": "https://blog.kraken.com/product/security/security-above-everything-why-every-month-is-cybersecurity-awareness-month-at-kraken",
    "description": "By Nick Percoco, Kraken Chief Security Officer Cybersecurity cannot be an afterthought for a crypto platform. At Kraken, we consider securing our clients’ personal information and cryptoassets to be our highest priority, so we place security above everything. Following October’s Cybersecurity Awareness Month, we&#8217;d like to tell you more about our ongoing approach to safeguarding [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-06T19:00:29.000Z",
    "title": "Conflux Protocol Shuts Down This Key Feature After 2 Years",
    "url": "https://www.newsbtc.com/news/conflux-protocol-shuts-down-this-key-feature-after-2-years/",
    "description": "After over two years of operation and maintenance by the Conflux Foundation, ShuttleFlow, a multi-asset bridge built on Conflux, is set to shut down.  Per the announcement, the platform was pivotal in driving progress within the decentralized finance (DeFi) arena, enabling “seamless” asset transfers across various chains.  Conflux Foundation Passes The Torch ShuttleFlow emerged as one of the advanced multi-chain asset bridges in the DeFi space. Its architecture facilitated interoperability between different blockchains, opening up new user possibilities.  Notably, ShuttleFlow enabled “effortless swaps” between external blockchains such as Ethereum (ETH) and Binance (BNB), utilizing Conflux as the transit chain. With the decision to shut down ShuttleFlow, the Conflux Foundation has entrusted cryptocurrency hub company Zero Gravity with the responsibility of maintaining and further developing the technology stack. Related Reading: Did Ethereum Founder Vitalik Buterin Short Ethereum? Unraveling A 70,000 ETH Sale According to Monday&#8217;s announcement, Zero Gravity will continue to enhance the Bridge&#8217;s capabilities to ensure a &#8220;seamless and secure&#8221; experience for users within the expanding multi-chain ecosystem. Furthermore, the Conflux Foundation assures users that their funds are secure throughout the transition. All user funds will be migrated from ShuttleFlow to Zero Gravity, safeguarding their assets.  Users who have previously bridged assets through ShuttleFlow and successfully claimed them on the destination chain will not be required to undertake any additional actions for the migration. ShuttleFlow will continue to assist users in claiming assets on the destination chain even after the bridging service is shut down. Users can locate their unclaimed assets on the ShuttleFlow history page. ShuttleFlow Service Ends The ShuttleFlow website and decentralized app (dApp) will continue to operate with limited functionality until January 6, 2024. However, the bridging service through ShuttleFlow&#8217;s dApp will cease on November 6, 2023. Once ShuttleFlow fully shuts down, users can bridge their assets through Zero Gravity&#8217;s official dApp. Related Reading: Bitcoin Has Just Cleared A Level That Historically Lead To Rallies Of 99%+ The Conflux Foundation firmly believes that the decentralization and accumulation of infrastructure partners are crucial for the growth of its ecosystem. With Zero Gravity taking the reins, ShuttleFlow&#8217;s vision of enabling chain-agnostic asset flows to and from the Conflux Network will persist. In light of these developments, the protocol&#8217;s token, CFX, currently ranked among the top 80 largest cryptocurrencies in the ecosystem, has experienced a retracement of over 2.9% in the past 24 hours, trading at $0,1619.  Nevertheless, the token retains significant gains of 277% in the year-to-date period, demonstrating its remarkable growth over the past year. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-06T19:05:20.000Z",
    "title": "Fidelity Analyst Forecasts Potential Bitcoin Price Target Amid Acceleration of Adoption – Here’s His Outlook",
    "url": "https://dailyhodl.com/2023/11/06/fidelity-analyst-forecasts-potential-bitcoin-price-target-amid-acceleration-of-adoption-heres-his-outlook/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/Bitcoin-Collapse-Below-30.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/Bitcoin-Collapse-Below-30.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/Bitcoin-Collapse-Below-30.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/Bitcoin-Collapse-Below-30.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/Bitcoin-Collapse-Below-30.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/Bitcoin-Collapse-Below-30.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/Bitcoin-Collapse-Below-30.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Fidelity Investments’ global macro director Jurrien Timmer is updating his outlook on Bitcoin (BTC) following the latest price surge. Timmer tells his 173,000 followers on the social media platform X that Bitcoin could soar beyond $96,210 by 2025 due to two main factors. He lays out a scenario for Bitcoin&#8217;s price performance in the coming [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/06/fidelity-analyst-forecasts-potential-bitcoin-price-target-amid-acceleration-of-adoption-heres-his-outlook/\">Fidelity Analyst Forecasts Potential Bitcoin Price Target Amid Acceleration of Adoption – Here’s His Outlook</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]