[
  {
    "source": "Decrypt",
    "date": "2023-09-15T14:54:02.000Z",
    "title": "What Are Wrapped Tokens? How They Work and What They’re Used For",
    "url": "https://decrypt.co/resources/what-are-wrapped-tokens",
    "description": "Wrapped tokens such as WBTC help move assets across blockchains. Here’s why they matter to the crypto ecosystem."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-15T14:42:36.000Z",
    "title": "What Is Toncoin, the Cryptocurrency Conceived by Telegram?",
    "url": "https://decrypt.co/resources/what-is-toncoin-the-cryptocurrency-conceived-by-telegram",
    "description": "TON uses a sharded, proof of stake consensus mechanism, meaning it can process transactions in parallel, improving transaction speed."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-15T14:44:00.000Z",
    "title": "Quadratic Funding: Revolutionizing the Way Public Goods Are Funded and Supported",
    "url": "https://www.cryptopolitan.com/quadratic-funding-revolutionizing-public/",
    "description": "Quadratic Funding is a groundbreaking mechanism designed to democratize the allocation of funds for public goods. Rooted in mathematical optimization, it leverages a unique formula to match individual contributions with a larger pool of funds, often provided by institutional donors. In the realms of crowdfunding and public goods financing, Quadratic Funding serves as a transformative ... <a title=\"Quadratic Funding: Revolutionizing the Way Public Goods Are Funded and Supported\" class=\"read-more\" href=\"https://www.cryptopolitan.com/quadratic-funding-revolutionizing-public/\" aria-label=\"More on Quadratic Funding: Revolutionizing the Way Public Goods Are Funded and Supported\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-15T15:00:55.000Z",
    "title": "Bitcoin Profit-Taking At 2-Month High, Pullback Incoming?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-profit-taking-2-high-pullback-incoming/",
    "description": "On-chain data shows the Bitcoin profit-taking has risen to a two-month high, which could provide resistance to the BTC surge. Bitcoin Profit-Taking Volume Has Shot Up With The Price Rise According to data from the on-chain analytics firm Santiment, investors have started to take profits following the latest cryptocurrency price increase. The relevant indicator here is the &#8220;ratio of daily on-chain transaction volume in profit to loss,&#8221; as its name already implies, it tells us how the profit-taking volume in the market currently compares against the loss-taking one. The indicator separates these two volumes by going through the on-chain history of each coin being sold/transferred on the network to see what price it was previously moved at. If this last selling price for any coin was less than the current spot price, the sale of that particular coin contributes to the profit-taking volume. Similarly, their transactions would count under the loss-taking volume for the opposite type of coins. Related Reading: Bitcoin Net Taker Volume Turns Highly Positive, Bullish Sign? When the indicator has a value greater than zero, the profit-taking volume is currently overwhelming the loss-taking volume. On the other hand, values under this mark suggest that loss-taking is currently the dominant behavior among investors. Now, here is a chart that shows how the value of this Bitcoin indicator has changed over the past month: Looks like the value of the metric has surged to a high value in recent days &#124; Source: Santiment on X As displayed in the above graph, the indicator&#8217;s value has risen as Bitcoin&#8217;s rebound from the $25,000 level occurred during the past few days. This suggests that the investors have started increasing their profit-taking volume. During the past day or so, the metric has seen exceptionally high values, as the difference between the profit-taking and loss-taking volumes is at a two-month high now. Usually, profit-taking is a normal sign during price rallies. Still, considering that this latest increase in BTC&#8217;s value isn&#8217;t too extraordinary, the level of the profit selling may be a cause for concern. Perhaps some of the holders selling here have lost hope for the asset after it has been stuck in consolidation for some time now. These investors might be jumping on this relatively minor exit opportunity because they don&#8217;t think a better one will emerge shortly. In the chart, Santiment has also attached the data for another metric: the active addresses. This indicator keeps track of the total number of addresses taking part in some transfer activity on the blockchain daily. It&#8217;s visible that this metric has been at notably high values in the past few days, suggesting that many traders have been paying attention to the cryptocurrency. Related Reading: Ethereum Leverage Ratio Is Rising, What Does It Mean? While sellers may be present in the market, the high activity could also suggest the presence of buyers. It remains to be seen whether the profit-takers would pull the asset back down, or if the buyers are strong enough to hold them off. BTC Price Bitcoin had climbed to the $26,700 mark yesterday but dropped back under $26,500 today. BTC has observed a net rise during the past few days &#124; Source: BTCUSD on TradingView Featured image from Maxim Hopman on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-15T15:00:14.000Z",
    "title": "While Dogecoin (DOGE) Price Dwindles, Investors Continue to Invest Massively in Pikamoon",
    "url": "https://www.crypto-news-flash.com/while-dogecoin-doge-price-dwindles-investors-continue-to-invest-massively-in-pikamoon/?utm_source=rss&utm_medium=rss&utm_campaign=while-dogecoin-doge-price-dwindles-investors-continue-to-invest-massively-in-pikamoon",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-52.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-52.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-52-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-52-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Dogecoin price has been down for a while now, and DOGE investors are losing money by the day. This continued drop in price has left the majority of investors rekt and the remaining are barely hanging on by a thread. However, Pikamoon has been trending in crypto communities, and its price keeps soaring even in [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-15T14:55:50.000Z",
    "title": "Chainlink CCIP Leads the Way: Australia and New Zealand Banking Group Demonstrates Cross-Chain Asset Purchase with A$DC Stablecoin",
    "url": "https://www.crypto-news-flash.com/chainlink-ccip-leads-the-way-australia-and-new-zealand-banking-group-demonstrates-cross-chain-asset-purchase-with-adc-stablecoin/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-ccip-leads-the-way-australia-and-new-zealand-banking-group-demonstrates-cross-chain-asset-purchase-with-adc-stablecoin",
    "description": "<img width=\"1038\" height=\"612\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Airchains has joined Chainlink&#039;s BUILD program, aiming to accelerate appchains and rollup technology adoption. \" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1.png 1038w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1-300x177.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1-1024x604.png 1024w\" sizes=\"(max-width: 1038px) 100vw, 1038px\" />Using Chainlink CCIP, ANZ Australia Carrie’s lit a cross-China purchase of tokenized assets using the ASDC stablecoin.  The future of tokenization is promising, as the technology is poised to revolutionize the banking system, ANZ asserts.  In a recent announcement, Chainlink has shared that ANZ Australia, one of the largest institutional banks in Australia utilized Chainlink [...]"
  }
]