[
  {
    "source": "Decrypt",
    "date": "2024-04-01T22:07:04.000Z",
    "title": "ChatGPT and Perplexity AI Tweak Free Plans In Battle for Users",
    "url": "https://decrypt.co/224344/free-chatgpt-perplexity-logging-in-ads",
    "description": "Two popular generative AI platforms hope to expand their reach and revenue with easier access and ads."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-01T22:07:07.000Z",
    "title": "China Embraces Blockchain: The Conflux Network Partnership Amid Cryptocurrency Skepticism",
    "url": "https://www.cryptopolitan.com/china-blockchain-conflux-network-partnership/",
    "description": "While taking a quite rigorous position on cryptocurrencies, the government of China issued a statement of launching a dialogue blockchain infrastructure system jointly with Conflux Network. It is the ultra-large-scale blockchain infrastructure platform for the Belt and road initiative that is the core of this plan. This plan, together with China&#8217;s perpetual intensification of the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-01T22:01:55.000Z",
    "title": "5 Top Under $1 Altcoins To Buy Ahead of The Next Bull Run",
    "url": "https://www.cryptopolitan.com/under-1-altcoins-to-buy-ahead/",
    "description": "The cryptocurrency market is teetering on the edge of a significant shift, poised for a bullish breakout. Five under-$1 altcoins are capturing investors&#8217; interest for their potential for significant gains. Cardano (ADA), PAAL AI (PAAL), XRP, Dogecoin (DOGE), and 0x0.ai stand out as the top altcoins to buy. These digital assets are seen as promising [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-01T21:50:45.000Z",
    "title": "FTX Bankruptcy Estate Sets Repayment Target by 2024 End",
    "url": "https://www.cryptopolitan.com/ftx-bankruptcy-estate-sets-repayment-target/",
    "description": "The FTX bankruptcy estate has disclosed plans to commence repayments to customers by the close of 2024, as revealed during a recent meeting of FTX Digital’s Joint Official Liquidators in the Bahamas. This initiative comes as part of the ongoing efforts to address the fallout from the collapse of FTX, which includes the Chapter 11 [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-01T22:00:32.000Z",
    "title": "Telegram Implements Toncoin Payment Integration For Ads, TON Price Sees Impact",
    "url": "https://www.newsbtc.com/toncoin-ton/telegram-implements-toncoin-payment-integration-for-ads-ton-price-sees-impact/",
    "description": "Telegram, the renowned messaging platform, recently unveiled a new feature that allows users to promote their channels through advertising. With the launch of this feature, users can now purchase ad space using Toncoins (TON), the native cryptocurrency powered by the TON blockchain. Telegram Implements TON Blockchain For Ad Payments Acknowledging the potential for channel owners to generate advertising revenue, Telegram&#8217;s announcement highlighted that channels collectively accumulate over 1 trillion views each month.  Realizing this opportunity, Telegram has implemented a revenue-sharing model, enabling channel owners with a minimum of 1000 subscribers to receive 50% of the ad revenue generated from ads displayed on their channels. Related Reading: Bitcoin Flash Crash Washes Out 81,000 Crypto Traders For Over $220 Million The decision to integrate the TON blockchain into this feature was driven by various reasons, as noted in the social media platform&#8217;s announcement on Sunday: We chose the TON Blockchain because it has low fees, high transaction speeds – and holds a record for the number of transactions it can process per second. Anyone can now promote their bot or channel – with budgets as low as a handful of Toncoins. When creating a Telegram ad, you choose the exact channels where you&#8217;d like it to appear, so you have full control over their context. Telegram CEO Pavel Durov had previously emphasized the importance of fast and secure ad payments and withdrawals, expressing that the TON blockchain would be the exclusive platform for these transactions. Durov stated: To ensure ad payments and withdrawals are fast and secure, we will exclusively use the TON blockchain. Similar to our approach with Telegram usernames on Fragment, we will sell ads and share revenue with channel owners in Toncoin. This will create a virtuous circle, in which content creators will be able to either cash out their Toncoins — or reinvest them in promoting and upgrading their channels. TON Shows Bullish Momentum As Telegram unveils these new features and developments that can significantly boost the adoption and usage of the TON token, the cryptocurrency has responded positively.  Over the past 24 hours, TON has surged by more than 5%, reaching a current trading price of $5.30. This surge adds to its impressive 100% price increase over the past 30 days alone. Notably, the announcement has also caused a substantial increase in the trading volume of TON, which has soared to $234,869,370 in the past 24 hours. This represents a rise of over 74% compared to Sunday&#8217;s trading volume, according to CoinGecko data. Related Reading: Traders Not Showing Dogecoin FOMO, Good Sign For Rally? Furthermore, the TON token is approaching its all-time high (ATH) mark of $5.69, reached on March 25. With the introduction of these new features in Telegram and the notable increase in trading volume, the token appears to be on the verge of setting a new ATH in the coming days if the demand continues to rise. However, the token must surpass the significant resistance level of $5.45 for this scenario to unfold. This price level has proven to be a hurdle for the token, as it has attempted three times to break through and consolidate above it to reach a new ATH but has failed. Overcoming this resistance level is crucial before the token can approach new ATH levels. On the TON/USD 4-hour chart, the support level that could potentially halt a price correction following the recent uptrend is $5.26. This support level acts as a buffer to prevent a significant downward correction in price. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-04-01T21:40:52.000Z",
    "title": "IOTA Ecosystem’s Resurgence: Innovations in Government, RWA, and Global Trade",
    "url": "https://www.crypto-news-flash.com/iota-ecosystems-resurgence-innovations-in-government-rwa-and-global-trade/?utm_source=rss&utm_medium=rss&utm_campaign=iota-ecosystems-resurgence-innovations-in-government-rwa-and-global-trade",
    "description": "<img width=\"1792\" height=\"1024\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-15-13.19.55-A-dynamic-and-futuristic-representation-of-IOTA-Revolutionizes-Digital-Product-Passports-for-Transparent-Value-Chains-with-added-text-elements.-The-.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-15-13.19.55-A-dynamic-and-futuristic-representation-of-IOTA-Revolutionizes-Digital-Product-Passports-for-Transparent-Value-Chains-with-added-text-elements.-The-.png 1792w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-15-13.19.55-A-dynamic-and-futuristic-representation-of-IOTA-Revolutionizes-Digital-Product-Passports-for-Transparent-Value-Chains-with-added-text-elements.-The--300x171.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-15-13.19.55-A-dynamic-and-futuristic-representation-of-IOTA-Revolutionizes-Digital-Product-Passports-for-Transparent-Value-Chains-with-added-text-elements.-The--1200x686.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-15-13.19.55-A-dynamic-and-futuristic-representation-of-IOTA-Revolutionizes-Digital-Product-Passports-for-Transparent-Value-Chains-with-added-text-elements.-The--768x439.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-15-13.19.55-A-dynamic-and-futuristic-representation-of-IOTA-Revolutionizes-Digital-Product-Passports-for-Transparent-Value-Chains-with-added-text-elements.-The--1536x878.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-15-13.19.55-A-dynamic-and-futuristic-representation-of-IOTA-Revolutionizes-Digital-Product-Passports-for-Transparent-Value-Chains-with-added-text-elements.-The--150x86.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/DALL·E-2024-01-15-13.19.55-A-dynamic-and-futuristic-representation-of-IOTA-Revolutionizes-Digital-Product-Passports-for-Transparent-Value-Chains-with-added-text-elements.-The--450x257.png 450w\" sizes=\"(max-width: 1792px) 100vw, 1792px\" />IOTA continues its partnership with the EU PCP program, where its digital product passports and IOTA Streams are utilized to offer residents better services. Through its development foundation, which it launched this year in Abu Dhabi, IOTA is targeting the Middle East and Africa regions with new products customized to solve their challenges. While most [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-04-01T22:01:24.000Z",
    "title": "Sam Bankman-Fried Speaks From Prison, Says FTX Victims Deserve To Be Paid in Full at Current Prices: Report",
    "url": "https://dailyhodl.com/2024/04/01/sam-bankman-fried-speaks-from-prison-says-ftx-victims-deserve-to-be-paid-in-full-at-current-prices-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/ftx-Could-Be-Worse.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/ftx-Could-Be-Worse.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/ftx-Could-Be-Worse.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/ftx-Could-Be-Worse.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/ftx-Could-Be-Worse.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/ftx-Could-Be-Worse.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/ftx-Could-Be-Worse.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The founder and former CEO of the now-collapsed FTX crypto exchange is speaking out from behind bars. Last week, a US judge sentenced disgraced FTX founder Sam Bankman-Fried (SBF) to 25 years in prison after the former crypto tycoon was convicted of fraud charges last year. Now, in the first week of his 25-year sentence, SBF says [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/04/01/sam-bankman-fried-speaks-from-prison-says-ftx-victims-deserve-to-be-paid-in-full-at-current-prices-report/\">Sam Bankman-Fried Speaks From Prison, Says FTX Victims Deserve To Be Paid in Full at Current Prices: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]