[
  {
    "source": "CoinDesk",
    "date": "2023-07-24T16:29:13.000Z",
    "title": "Inside the Orb: The Untold Story of Worldcoin’s Launch",
    "url": "https://www.coindesk.com/consensus-magazine/2023/07/24/inside-the-orb-the-untold-story-of-worldcoins-launch/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Is Sam Altman’s UBI startup a smart countermeasure to AI, or a privacy nightmare? Jeff Wilser reports."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-24T16:23:24.000Z",
    "title": "Sam Bankman-Fried Might Have Leaked Caroline's Diary, But Lawyers Say 'He's Done Nothing Wrong'",
    "url": "https://decrypt.co/149798/sam-bankman-fried-might-have-leaked-carolines-diary-but-lawyers-say-hes-done-nothing-wrong",
    "description": "SBF's lawyers complained that newly-appointed FTX CEO, John J. Ray III, has been \"routinely and gratuitously attacking\" his predecessor."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-24T16:10:49.000Z",
    "title": "Bitcoin sees first outflows in a month as Ethereum, XRP enjoy investors’ confidence",
    "url": "https://cryptoslate.com/bitcoin-sees-first-outflows-in-a-month-as-ethereum-xrp-enjoy-investors-confidence/",
    "description": "<p>Digital assets investment products recorded $6.5 million in outflows this week after four consecutive weeks of inflows totaling $742 million, Coinshares reported on July 24. This week&#8217;s outflows break the longest streak of inflows since late 2021, coinciding with the recent market downturn that saw Bitcoin&#8217;s (BTC) price dump to its lowest value since June [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitcoin-sees-first-outflows-in-a-month-as-ethereum-xrp-enjoy-investors-confidence/\">Bitcoin sees first outflows in a month as Ethereum, XRP enjoy investors&#8217; confidence</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-24T16:33:38.000Z",
    "title": "LBank Explores Emerging Narratives in Cryptocurrency and Regulatory Environment for 2023 - Vol. 9",
    "url": "https://cryptodaily.co.uk/2023/07/lbank-explores-emerging-narratives-in-cryptocurrency-and-regulatory-environment-for-2023-vol-9",
    "description": "<p>Road Town, BVI, July 24th, 2023, Chainwire</p><p>In a recent engaging conversation hosted by LBank, the persisting implications of the XRP court case on the cryptocurrency market were examined. Despite a tentative win for XRP, experts on the panel agreed that the legal challenges are far from concluded. The discussion also delved into the importance of robust infrastructure in the cryptocurrency domain and how it continues to be a magnet for venture capitalist investments. The burgeoning sector of blockchain gaming and the future of on-chain gaming platforms were other key talking points.</p><p>Founder of Network Spotlight, Mikhail, shared his insights on the potential impact of the XRP case on funding within the Web 3.0 ecosystem. He emphasized the necessity for project builders to outpace investors in understanding their domain given their specialist status. He further advised founders to stress their domain expertise, deep understanding of the solutions they offer, and ability to adapt in an ever-evolving industry.</p><p>Michael Rippe, CCO of zkHoldem, a company specializing in blockchain-based Texas Hold'em, expressed a hopeful outlook for XRP and the broader crypto market despite the pending resolution of the XRP case.</p><p>Michael Lee, Director of Corporate Development at the South Korean gaming firm, Come to us, outlined their new initiative, Explore and Play (X PLA), and their transformation into a transmedia entity. He emphasized their dedication to the evolving landscape of Web 3.0.</p><p>Manuel Vazquez, CEO of OscarSwap, succinctly clarified the relationship between Ripple and XRP, noting that XRP existed prior to Ripple's inception and was adopted by Ripple as a store of value. He pointed out that while Ripple's method of offering XRP to institutional investors is under investigation, XRP's decentralized nature disqualifies it from being classified as a security.</p><p>Echoing Vazquez's explanation of the Ripple-XRP relationship and the ongoing SEC legal issues, Sam, AMA Host at Future Lounge, conveyed his optimism for the crypto sphere, suggesting that victories in these cases will bolster confidence in the continued expansion of the crypto sector.</p><p>Alexandre Raffin, CEO of GAINS, concluded the discussion by underscoring the importance of generating authentic value in the gaming and crypto sectors. He also highlighted the power of memes in building communities and shaping belief systems, along with the potential of AI to enhance user experience.</p><p>About LBank Labs</p><p>LBank Labs, a prominent player in the web3 space, manages a versatile $100 Million fund that extends beyond specific protocols and exchanges. With a team of experienced web3 veterans from prestigious entities, they have built an extensive network of expertise and connections. Their investment strategy includes fund-of-fund investments, direct investments in early-stage projects, and liquid projects, enabling them to explore diverse opportunities. LBank Labs actively promotes their investment thesis, &ldquo;The Other Angle,&rdquo; through engaging discussions and focuses on the PSE principles to foster sustainable growth and innovation in the web3 landscape. With a Fund of Fund network comprising 12 funds and over $1 billion in AUM, and offices in seven global regions, LBank Labs is well-positioned to expand their network and drive innovation in the web3 ecosystem, together with their partners and collaborators.</p>ContactLBank Exchangepress@lbank.info"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-24T16:30:00.000Z",
    "title": "Solana (SOL) Price Prediction - Tradecurve Outruns Polygon (MATIC) In User Base",
    "url": "https://cryptodaily.co.uk/2023/07/solana-sol-price-prediction-tradecurve-outruns-polygon-matic-in-user-base",
    "description": "<p class=\"s5\">As uncertainties prevail in the market, crypto investors have altered their investment strategies. Thus, they are looking for real-world utility tokens that can offer a stable profit. Subsequently, the presale of Tradecurve (TCRV) is selling out quickly.Meanwhile, Solana (SOL) and Polygon (MATIC) seem to be losing their Midas touch.</p>\n<p class=\"s5\">Whales are accumulating TCRV tokens in large numbers, as their value can grow by 100x in the next six months.</p>\n<p>&gt;&gt;Register For The Tradecurve Presale&lt;&lt;</p>\nSolana (SOL) Joins Hands With Coca-Cola\n<p class=\"s5\">Expanding its ecosystem, Solana (SOL) has partnered with Coca-Cola in Serbia. Under this partnership, Solana&rsquo;s platform SolSea and Coca-Cola will jointly work on an NFT offering at a music event.</p>\n<p class=\"s5\">As per the official statement, Solana and the soda company will provide 100 limited-edition hoodies and NFTs to participants. Earlier, a report had suggested that Solana has witnessed a significant rise in the NFT space this year.</p>\n<p class=\"s5\">The price trajectory of Solana has also responded positively to the partnership. The exchange rate of Solana has increased by 21% in the past week. At the time of writing, Solana is trading at $22.29.</p>\n<p>&gt;&gt;Register For The Tradecurve Presale&lt;&lt;</p>\nRevolut Announces Delisting Polygon (MATIC)\n<p class=\"s5\">Polygon has faced several challenges and weathering of its user base since the SEC labeled MATIC as a security. Many exchanges have announced delisting Polygon (MATIC), with the Revolut being the latest one.</p>\n<p class=\"s5\">While making the announcement, Revolut stated that it will delist Polygon by September 18. Earlier, two leading exchanges, Robinhood and Bakkt, had already announced the delisting of Polygon. According to analysts, this move can cause a severe fall in Polygon&rsquo;s user base and price.</p>\n<p class=\"s5\">The market value of Polygon has seen a drop of 7% in the last 30 days. Consequently, Polygon is now trading at $6.34.</p>\n<p>&gt;&gt;Register For The Tradecurve Presale&lt;&lt;</p>\nTradecurve Becomes The Face Of Next-gen Cryptos\n<p class=\"s5\">After the collapse of the FTX exchange, which caused a loss of around $2 billion in the crypto market, investors have become apprehensive about centralized exchanges. The market trust in centralized exchanges has suffered a blow. Therefore, the demand for decentralized exchanges has increased, and Tradecurve (TCRV) is considered the best option by experts.</p>\n<p class=\"s5\">It is a unique blockchain platform, which enables users to trade a wide range of assets without relying on fiat payments. It keeps users&rsquo; identities anonymous, and allows them to trade privately.</p>\n<p class=\"s5\">On this platform, users are not required to undergo any KYC checks. This is contrary to existing trading platforms like ByBit and Robinhood, where users must share their personal details.</p>\n<p class=\"s5\">Its native crypto is TCRV, which will fuel the platform&rsquo;s ecosystem. The token&rsquo;s smart contract has been verified by Cyber Scope, and the team verification was performed by Assure DeFi. The token&rsquo;s presale is live, and currently progressing through the fourth stage, where a token is available for purchase at $0.018.</p>\n<p class=\"s5\">So far, the price of a token has increased by 80%, and is likely to rise to $0.025 in stage 5. Moreover, the platform&rsquo;s value may rise 50 times before the end of the presale round. Interestingly, only 40% of the total 1.8 billion tokens will be available during the presale.</p>\n<p class=\"s5\">For more information about the Tradecurve presale:</p>\n<p>Click Here For Website</p>\n<p>Click Here To Buy TCRV Presale Tokens</p>\n<p>Follow Us Twitter</p>\n<p>Join Our Community on Telegram</p>\n<p class=\"s5\">Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T16:39:04.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T16:35:18.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T16:20:50.000Z",
    "title": "Cardano Price Prediction 2023-2032: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2023-2032 Yet again, the crypto market is toiling in the abyss of uncertainty following the series of delisting fuelled by the ongoing United States SEC crackdown on major crypto platforms. Basically, it&#8217;s crypto winter in the summer as it stands. How do Cardano Price Prediction analysts steer in this turbulent crypto weather? ... <a title=\"Cardano Price Prediction 2023-2032: Is ADA a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cardano-price-prediction/\" aria-label=\"More on Cardano Price Prediction 2023-2032: Is ADA a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T16:12:04.000Z",
    "title": "Balancer Protocol: 25,000 Liquidity Providers, and Over $3 Billion locked in Liquidity",
    "url": "https://www.cryptopolitan.com/balancer-protocol-25000-liquidity-providers/",
    "description": "Balancer represents a decentralized finance (DeFi) protocol operating on the Ethereum blockchain, designed to stimulate a decentralized exchange where users can conveniently buy and sell various cryptocurrencies.&#160; Balancer is a decentralized Ethereum-based exchange and one of the leading automated market makers (AMMs) in the cryptocurrency world. It runs on the Ethereum mainnet and allows users ... <a title=\"Balancer Protocol: 25,000 Liquidity Providers, and Over $3 Billion locked in Liquidity\" class=\"read-more\" href=\"https://www.cryptopolitan.com/balancer-protocol-25000-liquidity-providers/\" aria-label=\"More on Balancer Protocol: 25,000 Liquidity Providers, and Over $3 Billion locked in Liquidity\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-24T16:30:14.000Z",
    "title": "Bittrex To US Users: Withdraw Your Crypto Or Risk Running Into Issues",
    "url": "https://www.newsbtc.com/crypto/bittrex-us-users-withdraw-your-crypto/",
    "description": "Bittrex Inc., the US arm of the crypto exchange Bittrex Global, has sent a reminder email to its users on the need to withdraw their funds “as soon as possible.” Although the deadline for withdrawal of funds remains August 31, the crypto exchange has urged users to do it soon to give their team “sufficient time to resolve any unforeseen issues.” &#8220;Bittrex Inc. has been granted permission by the United States Bankruptcy Court to allow customers who meet the necessary regulatory requirements to access their accounts and withdraw any remaining assets.” the email read. Bittrex asks US users to withdraw crypto before deadline How It All Went Down For Bittrex On March 31, 2023, Bittrex announced on its Twitter platform that it was winding down its US operations due to the “continued regulatory uncertainty.” The tweet read: Due to continued regulatory uncertainty, we have made the difficult decision to wind down our U.S. operations, effective April 30, 2023. All funds are safe and can be fully withdrawn immediately. Related Reading: Bitcoin (BTC) Address Dormant For More Than 11 Years Moves $31 Million In BTC However, the exchange’s woes were just starting as on April 17, 2023, the United States Securities and Exchange Commission (SEC) charged the crypto exchange for violating securities laws, including trading unregistered securities on its platform. This had caused many to believe that the impending SEC charges may have caused the crypto exchange to announce it was winding back in March.  This belief may not be far from the truth as Bittrex released a statement on its Twitter platform following the SEC’s charges.  Bittrex said in its statement:  We are disappointed with the SEC’s decision to bring an enforcement action against Bittrex as part of Chairman Gensler’s larger crusade to drive cryptocurrency out of the United States. The impact of the SEC’s approach of regulation by enforcement will have a chilling effect on not just cryptocurrency in the United States, but on blockchain technology and innovation in general. The impact of this regulatory action was significant for the exchange and on May 8, 2023, Bittrex filed for Chapter 11 bankruptcy protection. This came following the SEC’s clampdown on the trading platform. Its filings also suggested that the firm was in deep financial woes as it stated that it had more than 100,000 creditors.  Bittrex’s Approach Is Commendable Unlike what was seen with FTX and other crypto platforms that experienced ‘free fall’ bankruptcy, Bittrex’s case is quite different. From all indications, the company was fully prepared for the moments leading up to its bankruptcy filing.  According to Patterson Belknap Webb &#38; Tyler LLP, Bittrex had taken “extensive action pre-petition to ensure full customer recovery, and plan to swiftly bring these chapter 11 cases to a responsible conclusion.”  These actions include the ‘winding up’ announcement on March 31, which was going to become effective on April 30, halting deposits (without halting withdrawals), and giving customers enough time to withdraw their funds.  Related Reading: Dogecoin Becomes 8th-Largest Cryptocurrency After Adding $1 Billion To Market Cap Even at the time of filing, Bittrex continued to reiterate the fact that customers’ assets were safe and would be returned. This customer-first approach by Bittrex is commendable, considering how customers of different crypto platforms remain in limbo as to when (or if ever) they will regain their funds. It is also worth mentioning that Bittrex went as far as obtaining a $7 million loan in Bitcoin (BTC) from its parent company, Aquila Holdings, to pay back its customers, according to a Reuters report on May 10. Total market cap drops to $1.13 trillion &#124; Source: Crypto Total Market Cap on TradingView.com Featured image from NewsBTC, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-24T16:33:42.000Z",
    "title": "LBank Explores Emerging Narratives in Cryptocurrency and Regulatory Environment for 2023 – Vol. 9",
    "url": "https://www.crypto-news-flash.com/lbank-explores-emerging-narratives-in-cryptocurrency-and-regulatory-environment-for-2023-vol-9/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-explores-emerging-narratives-in-cryptocurrency-and-regulatory-environment-for-2023-vol-9",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/2__1690208985e6sXrM4cKr.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/2__1690208985e6sXrM4cKr.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/2__1690208985e6sXrM4cKr-300x180.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/2__1690208985e6sXrM4cKr-1024x614.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/2__1690208985e6sXrM4cKr-768x461.jpeg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Road Town, BVI, July 24th, 2023, Chainwire In a recent engaging conversation hosted by LBank, the persisting implications of the XRP court case on the cryptocurrency market were examined. Despite a tentative win for XRP, experts on the panel agreed that the legal challenges are far from concluded. The discussion also delved into the importance [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-24T16:30:26.000Z",
    "title": "What Hong Kong’s New Crypto License Means for Student Jobs",
    "url": "https://www.crypto-news-flash.com/what-hong-kongs-new-crypto-license-means-for-student-jobs/?utm_source=rss&utm_medium=rss&utm_campaign=what-hong-kongs-new-crypto-license-means-for-student-jobs",
    "description": "<img width=\"960\" height=\"641\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Bitcoin1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Bitcoin1.jpg 960w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Bitcoin1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/Bitcoin1-104x69.jpg 104w\" sizes=\"(max-width: 960px) 100vw, 960px\" />Today, more and more people become interested in the world of cryptocurrency and everything that is connected to it. And it’s not really a surprise, as experts say that cryptocurrency is the future of banking and money. Some countries have started to adopt this instead of rejecting it. After all, there is no harm in [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-24T16:35:54.000Z",
    "title": "Zeebu (ZBU) Token Goes Live for Trading on LBank Exchange",
    "url": "https://dailyhodl.com/2023/07/24/zeebu-zbu-token-goes-live-for-trading-on-lbank-exchange/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/Zeebu-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/Zeebu-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/05/Zeebu-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/05/Zeebu-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/05/Zeebu-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/05/Zeebu-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>July 23, 2023 – Dubai, United Arab Emirates The world’s first loyalty token tailored for telecom carrier businesses – Zeebu (ZBU) – has been successfully listed on global cryptocurrency exchange LBank. From today, users of the LBank Exchange can officially trade the ZBU/USDT trading pair. The milestone marks a significant step in the journey of Zeebu, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/24/zeebu-zbu-token-goes-live-for-trading-on-lbank-exchange/\">Zeebu (ZBU) Token Goes Live for Trading on LBank Exchange</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]