[
  {
    "source": "CryptoSlate",
    "date": "2023-06-30T16:15:04.000Z",
    "title": "BNY Mellon’s crypto custody venture runs afoul of SEC rules",
    "url": "https://cryptoslate.com/bny-mellons-crypto-custody-venture-runs-afoul-of-sec-rules/",
    "description": "<p>The Bank of New York Mellon&#8217;s (BNY Mellon) foray into the digital asset custody business has hit a regulatory hurdle, per American Banker. It emerged that the Securities and Exchange Commission&#8217;s (SEC) Staff Accounting Bulletin 121 (SAB 121) requires custodians of digital assets to record those assets on their balance sheets. This regulatory requirement presents [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bny-mellons-crypto-custody-venture-runs-afoul-of-sec-rules/\">BNY Mellon’s crypto custody venture runs afoul of SEC rules</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-06-30T16:36:26.000Z",
    "title": "Celsius to Liquidate Altcoin Holdings to Repay Creditors",
    "url": "https://cryptobriefing.com/celsius-liquidate-altcoin-holdings-epay-creditors/?utm_source=feed&utm_medium=rss",
    "description": "Celsius, one of the industrys several bankrupt cryptocurrency lenders, has been given the green light to start liquidating its altcoin holdings on July 1, according to a ruling on June..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-30T16:30:00.000Z",
    "title": "Mimo Exchange launches unique, lowest-fee, user-friendly NFT marketplace",
    "url": "https://cryptodaily.co.uk/2023/06/mimo-exchange-launches-unique-lowest-fee-user-friendly-nft-marketplace",
    "description": "<p class=\"s7\">Mimo Exchange, one of Web3&rsquo;s fastest, cheapest and most secure decentralized crypto exchanges, is excited to announce the launch of its transformative NFT trading platform enabling more accessible, faster, cheaper transactions and a more user-friendly interface than any other similar marketplace.</p>\n<p class=\"s7\">Mimo's NFT marketplace will provide a seamless and secure platform for buying and selling NFTs. But better yet, thanks to IoTeX's high-performing blockchain, the Mimo NFT trading platform solves the current challenges in the sector, enabling lower transaction fees, faster transaction times, and an enhanced user-friendly interface.</p>\n<p class=\"s7\">The Mimo NFT marketplace will revolutionize the NFT industry by offering more efficient NFT trading, its low handling fee of only 1.5% of the transaction price, as well as with its exciting launch activities. Mimo is the ideal platform for NFT enthusiasts to buy, sell, and trade digital assets.</p>\n<p class=\"s7\">The Mimo NFT marketplace also addresses the non-fungible token industry's current issues, such as high transaction fees, slow transaction times, and security.</p>\n<p class=\"s7\">One of the critical barriers to mainstream adoption is the user interface. To this point, Mimo provides a user-friendly interface that makes it easy for experienced and novice users to discover and collect NFTs. We've designed our intuitive interface to provide a seamless user </p>\n<p class=\"s7\">The Mimo NFT Marketplace has integrated ioPay, IoTeX's official multi-chain and cross-chain crypto wallet, and all other Web3 wallets, including Metamask.</p>\n<p class=\"s7\">People who use IoPay, one of Web3&rsquo;s most unique, secure, and versatile crypto wallets that also has multichain support, for example, can directly buy and sell their NFTs on the Mimo NFT marketplace from within this crypto wallet without additional wallets or exchanges. </p>\n<p class=\"s7\">Mimo now supports purchasing cryptocurrencies with a credit card, providing even more convenience for using the Mimo NFT marketplace.</p>\n<p class=\"s7\"></p>\n<p class=\"s7\">An exciting aspect of the Mimo NFT marketplace is that it supports projects leveraging W3bstream, which means Decentralized Physical Infrastructure Network (DePIN) startups or projects can issue their NFTs and list them directly on the Mimo NFT marketplace. It provides a new and unique way to interact and expand audiences.</p>\n<p class=\"s7\">Mimo has partnered with well-known NFT and blockchain projects to create a joint marketing campaign. This joint marketing campaign will offer users exciting opportunities and rewards for participating in Mimo's NFT marketplace.</p>\n<p class=\"s7\">To celebrate the launch, Mimo is offering 90% off on the entire transaction fee throughout July, encouraging affordable transactions for all. This limited-time offer enables users to join the Mimo community and experience the benefits of faster, cheaper, and more user-friendly NFT trading.</p>\n<p class=\"s7\"></p>\n<p class=\"s7\">Users can also look forward to several activities and giveaways during the launch event, including limited edition NFTs, exclusive access to pre-released NFTs, and competitions. The Mimo community will also have the chance to engage with our team through live AMAs, Q&amp;A sessions, and beta testing opportunities.</p>\n<p class=\"s7\">With the rise of NFTs as a new asset class, there is a need for a dedicated NFT marketplace on IoTeX to support the growing demand for NFTs in several Web3 sectors, such as art, gaming, music and for the Decentralized Physical Infrastructure Networks (DePIN) sector, which is today the most promising crypto category in the entire blockchain space. </p>\n<p class=\"s7\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-30T16:30:18.000Z",
    "title": "Insiders Say SEC Deems Blackrock’s Spot Bitcoin ETF and Other Applications as Inadequate",
    "url": "https://news.bitcoin.com/insiders-say-sec-deems-blackrocks-spot-bitcoin-etf-and-other-applications-as-inadequate/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/sec-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Insiders Say SEC Deems Blackrock&#039;s Spot Bitcoin ETF and Other Applications as Inadequate\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/sec-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/sec-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/sec-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/sec-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/sec-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/sec-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/sec.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to a report citing “people familiar with the matter,” the U.S. Securities and Exchange Commission has allegedly informed Nasdaq and Cboe that Blackrock&#8217;s registration for a bitcoin exchange-traded fund (ETF) and the multitude of other spot bitcoin ETF applications currently in progress are considered inadequate. SEC Reportedly Finds Flaw in the Latest Slew of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T16:24:06.000Z",
    "title": "NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?",
    "url": "https://www.cryptopolitan.com/near-price-prediction/",
    "description": "NEAR Price Prediction 2023-2032 Near Protocol (NEAR) is a blockchain platform with significant attention and partnerships within the cryptocurrency industry. Initially established by a small team in San Francisco, NEAR Protocol has rapidly expanded its influence and formed collaborations with industry giants. As a result, it has witnessed a consistent upward trajectory since its inception. ... <a title=\"NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-price-prediction/\" aria-label=\"More on NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T16:23:44.000Z",
    "title": "Circle welcomes former Goldman Sachs executive Craig Broderick to board of directors",
    "url": "https://www.cryptopolitan.com/circle-welcomes-former-goldman-sachs-executive-craig-broderick-to-board-of-directors/",
    "description": "In a strategic move to enhance risk management and strengthen regulatory compliance, Circle Internet Financial, the issuer of the USDC stablecoin, has announced the appointment of Craig Broderick, a former executive at Goldman Sachs, to its board of directors. Broderick, renowned for his distinguished career spanning over three decades at Goldman Sachs, notably serving as ... <a title=\"Circle welcomes former Goldman Sachs executive Craig Broderick to board of directors\" class=\"read-more\" href=\"https://www.cryptopolitan.com/circle-welcomes-former-goldman-sachs-executive-craig-broderick-to-board-of-directors/\" aria-label=\"More on Circle welcomes former Goldman Sachs executive Craig Broderick to board of directors\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T16:22:22.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-30T16:14:37.000Z",
    "title": "Lacoste launches exciting NFT rewards and co-creation feature for fashion enthusiasts",
    "url": "https://www.cryptopolitan.com/lacoste-launches-exciting-nft-rewards-and-co-creation-feature/",
    "description": "Lacoste, the renowned French fashion brand, has made a significant stride in embracing non-fungible tokens (NFTs) by expanding its NFT ecosystem. The brand has introduced a rewards and co-creation feature for its UNDW3 community following the successful release of its UNDW3 collection of profile picture (PFP) NFTs. With this expansion, Lacoste aims to provide its ... <a title=\"Lacoste launches exciting NFT rewards and co-creation feature for fashion enthusiasts\" class=\"read-more\" href=\"https://www.cryptopolitan.com/lacoste-launches-exciting-nft-rewards-and-co-creation-feature/\" aria-label=\"More on Lacoste launches exciting NFT rewards and co-creation feature for fashion enthusiasts\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-30T16:30:30.000Z",
    "title": "Crypto Market Players Turn to Uwerx (WERX) Crypto Presale, Investors Ditching Shiba Inu (SHIB)?",
    "url": "https://www.crypto-news-flash.com/crypto-market-players-turn-to-uwerx-werx-crypto-presale-investors-ditching-shiba-inu-shib/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-market-players-turn-to-uwerx-werx-crypto-presale-investors-ditching-shiba-inu-shib",
    "description": "Meme coins are gradually losing their appeal after the meme craze that saw them grow in prominence and adoption. Shiba Inu (SHIB) was one of the most impressive meme coins during this period, giving many crypto investors huge profits. However, investors are now growing impatient with the meme coin due to a lack of indications [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-30T16:17:53.000Z",
    "title": "IOTA Leads the Way in European Union’s EDIC Initiative for Blockchain Infrastructure, Spearheading Europe’s Digital Transformation",
    "url": "https://www.crypto-news-flash.com/iota-leads-the-way-in-european-unions-edic-initiative-for-blockchain-infrastructure-spearheading-europes-digital-transformation/?utm_source=rss&utm_medium=rss&utm_campaign=iota-leads-the-way-in-european-unions-edic-initiative-for-blockchain-infrastructure-spearheading-europes-digital-transformation",
    "description": "The European Union is working towards launching an international body as part of the EDIC initiative to oversee blockchain platforms connecting citizens to public services. IOTA has expressed keen interest in actively participating in the European Union&#8217;s EDIC initiative and contributing to this vision by leveraging its technology stack for the initiative&#8217;s success. The European [...]"
  }
]