[
  {
    "source": "Decrypt",
    "date": "2023-06-09T10:06:13.000Z",
    "title": "Binance US Shifts to ‘Crypto-Only’ Operations Amid Intensified SEC Scrutiny",
    "url": "https://decrypt.co/143938/binance-us-shifts-crypto-only-operations-amid-intensified-sec-scrutiny",
    "description": "Binance.US is transitioning to a \"crypto-only\" platform, suspending USD operations, including deposits and withdrawals. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-09T10:04:46.000Z",
    "title": " U.S. senators propose AI bills for transparency and innovation ",
    "url": "https://cointelegraph.com/news/us-senators-propose-ai-bills",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/83d996ac-e56d-49ef-b175-6c2b59089ee2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The bipartisan bills target government transparency when using AI and the formation of a new Office of Global Competition Analysis to stay on top of innovation.</p>\n                    <p><p>Lawmakers in the United States have proposed two new bipartisan bills targeting issues of transparency and innovation in artificial intelligence (AI). </p><p>On June 8, Democratic senator Gary Peters and Republican senators Mike Braun and James Lankford introduced the first bill which would require the government to be transparent with its AI usage. </p><p>Under such a measure, U.S. government agencies would need to inform the public when it uses AI to interact with them, along with a system for citizens to appeal any decisions made by AI. </p><p>Braun commented in a statement saying that: </p><blockquote>\"The federal government needs to be proactive and transparent with AI utilization and ensure that decisions aren't being made without humans in the driver's seat.”</blockquote><p>The second bill was brought to the table by Democratic senators Michael Bennet and Mark Warner, along with Republican senator Todd Young to establish an official Office of Global Competition Analysis. </p><p>This new division is aimed at aiding the U.S. in staying on top of AI development. Senator Bennet remarked that: </p><blockquote>\"We cannot afford to lose our competitive edge in strategic technologies like semiconductors, quantum computing, and artificial intelligence to competitors like China. </blockquote><p>The introduction of these bills follows an announcement from senate majority leader Chuck Schumer that called for three upcoming AI briefings to educate lawmakers on the technology. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/pro-bitcoin-de-santis-uses-ai-images-smear-campaign-trump\"><strong><em>Pro-Bitcoin DeSantis tagged over AI-faked photos in Trump smear campaign</em></strong></a></p><p>Regulations targeting AI are beginning to pop up in discussions among lawmakers across the globe. </p><p>Earlier this week officials in the United Kingdom stressed that<a href=\"https://cointelegraph.com/news/ai-regulated-medicine-nuclear-power-uk-minister\"> AI models need regulation</a> similar to those imposed on medicine and nuclear power. The same day another U.K. official warned that if these models are not <a href=\"https://cointelegraph.com/news/ai-could-threaten-humanity-in-two-years-says-uk-advisor\">under control ​​within the next two years</a> or else face a threat to humanity. </p><p>Meanwhile, in Europe, lawmakers are in the process of <a href=\"https://cointelegraph.com/news/chatgpt-midjourney-ai-tools-make-it-into-european-agenda\">finalizing their EU AI Act</a>, which is a comprehensive set of regulations for the development and deployment of generative AI. </p><p>European regulators have taken a similarly urgent approach to AI regulation and most recently said they considering <a href=\"https://cointelegraph.com/news/eu-officials-want-all-ai-generated-content-labeled\">all AI-generated content</a> to be labeled as such. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/biticulture-fine-art-on-solana-ai-music-podcast-book-reviews/\"><strong><em>BitCulture: Fine art on Solana, AI music, podcast + book reviews</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-09T10:00:14.000Z",
    "title": "US Senator Bill Hagerty Warns SEC Actions ‘Pave the Way’ for a CBDC",
    "url": "https://news.bitcoin.com/us-senator-bill-hagerty-warns-sec-actions-pave-the-way-for-a-cbdc/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2307711231-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"US Senator Bill Hagerty Warns SEC Actions &#039;Pave the Way&#039; for a CBDC\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2307711231-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2307711231-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2307711231-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2307711231-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2307711231-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2307711231-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2307711231.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Tennesse U.S. senator Bill Hagerty has warned about the consequences of the recent actions of the Securities and Exchange Commission (SEC) against cryptocurrency platforms in the country and the objectives that might be behind these. Hagerty stated that the true motivation behind the lawsuits against Coinbase and Binance is to remove the possible competitors of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T09:44:12.000Z",
    "title": "EU’s crypto licensing rules take effect with MiCA law publication",
    "url": "https://www.cryptopolitan.com/eus-crypto-licensing-rules-take-effect-with-mica-law-publication/",
    "description": "The European Union&#8217;s Markets in Crypto Assets law (MiCA) has been published in the Official Journal of the European Union (OJEU), signaling the start of implementing comprehensive crypto licensing rules. The law mandates that crypto wallet providers identify their customers during fund transfers and offers a license for crypto companies to operate across the EU. ... <a title=\"EU&#8217;s crypto licensing rules take effect with MiCA law publication\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eus-crypto-licensing-rules-take-effect-with-mica-law-publication/\" aria-label=\"More on EU&#8217;s crypto licensing rules take effect with MiCA law publication\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-09T10:00:00.000Z",
    "title": "Unpacking the growing appeal of meme coins: analyzing DigiToads and Shiba Inu",
    "url": "https://crypto.news/unpacking-the-growing-appeal-of-meme-coins-analyzing-digitoads-and-shiba-inu/",
    "description": "DigiToads and Shiba INU are among the top meme coins whose appeal has been rising in recent months. Already, TOADS presale is successful, raising over $4.7 million"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-09T10:00:38.000Z",
    "title": "Here’s Why Ethereum Could Be At Risk Of Falling To $1,000 Again",
    "url": "https://www.newsbtc.com/news/ethereum/heres-why-ethereum-could-be-at-risk-of-falling-to-1000-again/",
    "description": "Ethereum is currently following the market trend of Bitcoin and continues to maintain above the $1,800 level. This price level is still bullish for the digital asset which is now only around 60% down from its all-time high. However, there is a threat to the stability that the digital asset has enjoyed so far which could send its price spiraling back down toward the $1,000 level. What Could Send Ethereum Back To $1,000? This week, the United States Securities and Exchange Commission (SEC) brought lawsuits against top exchanges Binance and Coinbase, with more regulatory action expected to come toward crypto firms as time goes on. But one of the most important parts of the lawsuit was the SEC naming some cryptocurrencies as securities. Related Reading: Cardano (ADA) Declines As Market Recovers Amid Security Charges The list which the regulator hinted was not exhaustive included the likes of Cardano (ADA) and Solana (SOL), among others. Interestingly, the SEC did not name Ethereum as a security despite the digital asset’s status being a hot topic of debate over the last year. What’s important about the cryptocurrencies that the regulator named is the fact that they are proof of stake (POS) networks, a mechanism which Ethereum transitioned to back in 2022. This has sparked speculation that while ETH was not listed as a security, it could very well be on the regulator’s radar to do so in the future. If Ethereum does get listed as a security, the cryptocurrency could become a target for the SEC, which is already in a drawn-out battle with Ripple for the same allegations. When Ripple was sued back in 2020, the asset suffered a massive crash of up to 60% of its value. A repeat of such an event for Ethereum could easily see the digital asset fall to $1,000, and even lower. ETH price resting above $1,800 &#124; Source: ETHUSD on TradingView.com However, the SEC has not made any indications of going after Ethereum. Right now, it seems to have its hands full with Ripple, Binance, and Coinbase, all of which have been vocal about fighting the regulator in court as they object to the charges brought against them. ETH Price Still Holding Firmly Even amid speculations that Ethereum would end up being classified as a security, the token is still maintaining a bullish outlook in the mid to long-term. It is trading above its 100-day moving average of $1,758, which shows investors&#8217; willingness to purchase the asset at prices higher than they did three months ago. Related Reading: Not Immune To FUD? Binance Sees $1.5 Billion In Outflows In 24 Hours As long as the bulls continue to maintain momentum, it is possible that ETH could continue to maintain above $1,800 before the next crypto market run-up begins. When this happens, Ethereum could easily clear the $2,000 level. At the time of writing, ETH is changing hands at a price of $1,839, down 0.35% in the last 24 hours with 1.22% losses on the weekly chart. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-09T10:00:33.000Z",
    "title": "Best Crypto Investments In June: Shiba Inu (SHIB), Ripple (XRP), Avorak AI (AVRK)",
    "url": "https://www.crypto-news-flash.com/best-crypto-investments-in-june-shiba-inu-shib-ripple-xrp-avorak-ai-avrk/?utm_source=rss&utm_medium=rss&utm_campaign=best-crypto-investments-in-june-shiba-inu-shib-ripple-xrp-avorak-ai-avrk",
    "description": "<p>June is ushering diverse cryptocurrencies with unique value propositions, making them compelling choices for investors looking to diversify their portfolios and secure substantial returns. Among the notable best crypto investments are Avorak AI (AVRK), Shiba Inu (SHIB), and Ripple (XRP). These projects continue to captivate investors who regard them as promising investment opportunities.  Avorak AI [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/best-crypto-investments-in-june-shiba-inu-shib-ripple-xrp-avorak-ai-avrk/\">Best Crypto Investments In June: Shiba Inu (SHIB), Ripple (XRP), Avorak AI (AVRK)</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-09T09:55:51.000Z",
    "title": "PEPE Whale Makes Another Big Purchase; Bullish Sign?",
    "url": "https://coinedition.com/pepe-whale-makes-another-big-purchase-bullish-sign/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Whales-Are-Buying-PEPE-Is-This-the-Bottom-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Whales-Are-Buying-PEPE-Is-This-the-Bottom-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Whales-Are-Buying-PEPE-Is-This-the-Bottom-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Whales-Are-Buying-PEPE-Is-This-the-Bottom.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The blockchain tracking firm Lookonchain posted a thread to Twitter earlier today, which discussed the recent purchasing behavior of a particular Pepe (PEPE) whale over the past few weeks. According to the thread, this whale, who had made around $11.47 million on PEPE before, recently purchased 227 billion PEPE at $0.0000011 again earlier today. Lookonchain’s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/pepe-whale-makes-another-big-purchase-bullish-sign/\">PEPE Whale Makes Another Big Purchase; Bullish Sign?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]