[
  {
    "source": "Cointelegraph",
    "date": "2023-05-28T14:15:00.000Z",
    "title": "What are NFT royalties, and how do they work?",
    "url": "https://cointelegraph.com/explained/what-are-nft-royalties-and-how-do-they-work",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/storage/uploads/view/7969703ec7d9ed20e9cd2f0e901d34e6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>NFT royalties refer to the percentage of sales or transactions of a nonfungible token (NFT) that are paid to the original creator or owner of the NFT. </p>\n                    <p><h2>What does the future hold for NFT royalties?</h2><p></p><p><em>Despite the bumpy ride over the past few months, NFT royalties make the model more sustainable for founders of NFT collections. It also allows art to be a more sustainable source of livelihood for creators.</em></p><p>2022 was brutal in many aspects for the Web3 world. Scams ran rampant, while prices kept falling owing to <a href=\"https://cointelegraph.com/news/how-does-the-economy-work\">macroeconomic conditions</a>. Despite roadblocks, NFT royalties can play a crucial role in creator revenue generation. It can also help with customer loyalty for organizations incentivizing the buying and selling of collectibles and giving a chunk of revenue back to their customers, creating a greater brand experience. </p><p>With new concepts like <a href=\"https://cointelegraph.com/explained/what-are-dynamic-nfts-use-cases-and-examples\">dynamic NFTs</a>, where the metadata of the NFT can be altered or upgraded resulting in new traits for a subset of loyal users, NFTs fuel both the attention and loyalty economies within Web3. Intelligent NFTs bring an element of artificial intelligence (AI) to NFTs by making holders feel that their profile pictures (PFPs) are closer to their real selves thanks to AI.</p><p>That said, NFT royalties are here to stay, and companies adopting this business model may have an edge over their competitors in the years to come.</p><h2>How have emerging marketplaces transformed NFTs?</h2><p></p><p><em>Several NFT marketplaces have emerged over the last few years, each with a growth hacking strategy. In some cases, the strategies have worked in favor of the industry, while in others, they have hurt the ecosystem.</em></p><p>The marketplace market has moved from organic growth to aggressive growth hacking through airdrop techniques based on NFT transaction activities. This is due to the intense competition that new NFT marketplaces have brought to the landscape in a bear market, where liquidity is largely limited.</p><p>OpenSea, Magic Eden, Sudoswap, X2Y2 and Blur are competing for creators, users and, more critically, liquidity. This competition has created aggressive royalty wars, with reductions in royalty fees affecting the health of the ecosystem. This has, in turn, forced NFT projects to decrease the royalty fees, and even marquee digital collectibles, such as Bored Ape Yacht Club and Azuki, are no exception.</p><p>While the highly competitive environment stoked reductions in royalty fees, some marketplaces have made a move of blocking the sale of NFTs in secondary markets that do not have royalties. While some critics have slammed the move, others call it a measure to protect creators’ interests. </p><p>A state where NFT collections can’t charge royalties makes it hard for them to then fund their business and makes them far too reliant on venture capital funding options. This can be a challenge as venture capital firms are still understanding this space and fine-tuning their approach to funding NFT projects.</p><h2>How do marketplaces contribute to NFT royalties?</h2><p></p><p><em>Marketplaces provide a platform for creators to develop their content, mint it and put it up for sale. They also help digital content creators to tap into demand for secondary sales of their creations.</em></p><p>Marketplaces play a crucial role in the Web3 world, proliferating the NFT ecosystem and creating commerce. Each blockchain network has its marketplaces along with cross-chain marketplaces for buying and selling digital assets. Along with creating a space for NFTs with royalties, marketplaces also add credibility to projects by listing them.</p><p>NFT marketplaces can also set royalties for NFTs sold on their platform. This can have an adverse effect on the NFT ecosystem, directly impacting volumes. NFT trading volumes are one of the key performance indicators to assess the health of an NFT collection or the ecosystem on a chain. </p><p>NFT platforms like OpenSea have tried removing royalties and introducing optional royalties where the purchaser can decide if they would like to pay royalties to the creators. Such policies could hurt creators as their recurring source of income is now diminished. That makes the creator economy less sustainable and competitive, as newcomers will struggle to compete against established creative studios. Therefore, the royalty fees determined by the marketplaces can make or break the heart and soul of this innovation.</p><h2>What is the need for NFT royalties?</h2><p></p><p><em>NFT royalties make art and digital content a sustainable source of income for creators. As payments could typically be programmatic, there could be multiple creators who could benefit from this model.</em></p><p>From a principle and economic standpoint, NFT royalties offer a number of advantages to the ecosystem. It is challenging to track the subsequent purchases of artwork in the Web2 creative sectors of music, art and graphic design. On top of that, contracts drafted between creative professionals and marquee studios or corporations are often one-sided and heavily against the creator of the work.</p><p>This imbalance in economic relationships is what the Web3 model seeks to correct. In Web3, any piece of work that gets minted as an NFT can be tracked through subsequent purchases recorded on the blockchain. The creator can thus programmatically stay on top of the chain of transactions and earn royalties at every point.</p><p>Furthermore, the creator can go to an <a href=\"https://cointelegraph.com/learn/the-nft-marketplace-how-to-buy-and-sell-nonfungible-tokens\">NFT marketplace</a> and list and sell their NFTs without the marketplace directly claiming royalty on the purchase. NFTs are instrumental because one can create an economy around creators, which hasn’t necessarily been the strong suit of Web2 business models. For many NFT collections, royalties were a great mechanism for funding their operational costs.</p><p>NFT royalties can also curb the dangerous practice of <a href=\"https://cointelegraph.com/explained/what-are-wash-trading-and-money-laundering-in-nfts\">wash trading</a>. By creating multiple accounts or wallets, a market participant can buy an NFT or any digital asset they want to artificially inflate the price of. Often, their wallets are used to just buy an NFT from each other to create the perception of demand and pump up the price of the NFT. </p><p>For unattentive spectators, this activity can seem like high demand for the NFT. However, that is not the case. Enforcing royalties will make sure that for each transaction between the wash traders’ wallets, there is a price to be paid. Therefore, the cost of keeping the price high increases very quickly, making it hard for the wash trader to continue. </p><h2>What are NFT royalties?</h2><p></p><p><em>Royalties give NFT creators a way to keep getting paid for their work, even after the original sale of the NFT.</em></p><p><a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">Nonfungible tokens (NFTs)</a> have been a key technical paradigm and a building block of the <a href=\"https://cointelegraph.com/blockchain-for-beginners/what-is-web-3-0-a-beginners-guide-to-the-decentralized-internet-of-the-future\">Web3 ecosystem</a>. While the rise of NFTs was really led by the Ethereum community through 2020 and 2021, other chains like Solana and even Bitcoin have followed suit with major projects launching on these <a href=\"https://cointelegraph.com/blockchain-for-beginners/how-does-blockchain-work-everything-there-is-to-know\">blockchains</a>.</p><p>Creators have historically looked for different forms of income from their work. While there are laws pertaining to protecting intellectual property in the Web2 world, enforcing these laws and protecting creators’ interests has been hard to achieve.</p><p>Royalty payments are passive income that goes toward a creator on each transaction of their finished product. The product could be music, art, game utilities or any other form of digital asset. While creators earn from the primary sale of their NFTs, royalties are paid to the creator for each subsequent purchase as well. </p></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-05-28T14:12:04.000Z",
    "title": "Gemini and Ripple navigate legal hurdles, Asia boosts regulatory efforts | Weekly Recap",
    "url": "https://crypto.news/gemini-and-ripple-navigate-legal-hurdles-asia-boosts-regulatory-efforts-weekly-recap/",
    "description": "Following in the footsteps of Ripple, Gemini gears up for a legal battle with the SEC; Asia makes efforts towards boosting its crypto regulations \n\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-05-28T14:30:14.000Z",
    "title": "Here’s What’s Accelerating De-Dollarization Trend, According to Macro Guru Lyn Alden",
    "url": "https://dailyhodl.com/2023/05/28/heres-whats-accelerating-de-dollarization-trend-according-to-macro-guru-lyn-alden/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2022/02/develop-new-digital-dollar.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" /><p>Macro guru Lyn Alden is naming two big underlying foundations that are kicking the trend of de-dollarization into high gear. In a recent interview on The Jay Martin Show, Alden says one reason why de-dollarization is accelerating is that other countries have lost trust in US government bonds. According to the macro guru, the yields [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/05/28/heres-whats-accelerating-de-dollarization-trend-according-to-macro-guru-lyn-alden/\">Here’s What’s Accelerating De-Dollarization Trend, According to Macro Guru Lyn Alden</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]