[
  {
    "source": "Cryptopolitan",
    "date": "2023-07-03T04:54:08.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-03T04:48:04.000Z",
    "title": "BNB Price Primed For Rally And Only 1 Thing Is Holding It Back",
    "url": "https://www.newsbtc.com/analysis/bnb/bnb-price-rally-250/",
    "description": "BNB price (Binance coin) is recovering above $240 against the US Dollar. The price might gain bullish momentum if it clears $250 and $255. Binance coin price is attempting a recovery wave above $232 against the US Dollar. The price is now trading below $240 and the 100 simple moving average (4 hours). There was a break above a major bearish trend line with resistance near $235 on the 4-hour chart of the BNB/USD pair (data source from Binance). The pair might gain bullish momentum above $250 and $255. Binance Coin Price Starts Increase In the past few days, BNB price saw a major decline below the $250 support. There was a move below the $240 support zone. The price traded as low as $224 and is currently rising, similar to Bitcoin and Ethereum. There was a move above the $232 resistance. The price climbed above the 50% Fib retracement level of the main drop from the $257 swing high to the $224 low. There was also a break above a major bearish trend line with resistance near $235 on the 4-hour chart of the BNB/USD pair. BNB price is now trading below $240 and the 100 simple moving average (4 hours). On the upside, it is facing resistance near the $250 level. It is close to the 76.4% Fib retracement level of the main drop from the $257 swing high to the $224 low. Source: BNBUSD on TradingView.com The next major resistance is near $255. A clear move above the $250 resistance and $255 might start a steady increase. The next major resistance is near the $270 level, above which the price might rise toward the $285 resistance. Fresh Decline in BNB? If BNB fails to clear the $250 resistance, it could start another decline. Initial support on the downside is near the $240 level and the 100 simple moving average (4 hours). The next major support is near the $232 level. If there is a downside break below the $232 support, the price could revisit the $225 support. Any more losses could send the price toward the $210 support. Technical Indicators 4-Hours MACD – The MACD for BNB/USD is losing pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for BNB/USD is currently above the 50 level. Major Support Levels – $240, $232, and $225. Major Resistance Levels – $250, $255, and $270."
  }
]