[
  {
    "source": "Decrypt",
    "date": "2023-06-29T03:14:37.000Z",
    "title": "It’s A 'Forgone Conclusion' That Ethereum Is A Commodity, Says Joe Lubin",
    "url": "https://decrypt.co/146661/forgone-conclusion-ethererum-is-a-commodity-joe-lubin",
    "description": "The ConsenSys Founder says Gary Gensler may not be able to admit it, but that his hesitancy doesn’t matter. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-29T03:15:44.000Z",
    "title": "Bitcoin Price Needs To Clear $31K For Hopes of a Fresh Rally",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-31k-resistance/",
    "description": "Bitcoin price is still facing a major hurdle near $31,000. BTC could correct lower below $29,800 if it stays below $31,000 for a long time. Bitcoin is still consolidating below the $31,000 resistance zone. The price is trading below $30,500 and the 100 hourly Simple moving average. There is a key declining channel forming with resistance near $30,200 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could correct lower toward the $29,550 support or even $29,000. Bitcoin Price Stuck In A Range Bitcoin price remained in a major range below the $31,000 resistance zone. BTC made another attempt to gain pace above the $31,000 resistance but failed. A high was formed near $31,008 before there was a fresh decline. There was a move below the $30,500 level but the bulls were active above the $29,800 zone. A low is formed near $29,834 and the price is now trading in a range. It is trading near the 23.6% Fib retracement level of the recent decline from the $31,008 swing high to the $29,834 low. Bitcoin price is now trading below $30,500 and the 100 hourly Simple moving average. There is also a key declining channel forming with resistance near $30,200 on the hourly chart of the BTC/USD pair. Immediate resistance is near the $30,200 level. The first major resistance is near the $30,420 level or the 100 hourly Simple moving average. It is close to the 50% Fib retracement level of the recent decline from the $31,008 swing high to the $29,834 low, above which the price might revisit the $31,000 resistance zone. Source: BTCUSD on TradingView.com An upside break above the $31,000 resistance might send BTC toward $31,500. Any more gains could open the doors for a move toward the $32,200 resistance zone. More Losses in BTC? If Bitcoin’s price fails to clear the $30,420 resistance, it could continue to move down. Immediate support on the downside is near the $30,000 level. The next major support is near the $29,850 level, below which there could be a drop toward the $29,550 support. Any more losses might send the price toward the $29,000 zone in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is below the 50 level. Major Support Levels – $30,000, followed by $29,550. Major Resistance Levels – $30,200, $30,420, and $31,000."
  }
]