[
  {
    "source": "Decrypt",
    "date": "2023-08-08T22:52:49.000Z",
    "title": "Amazon Reverses Course on ‘Garbage Books’ After Public Uproar",
    "url": "https://decrypt.co/151780/amazon-authors-writers-fake-books-trademark",
    "description": "Amazon removed several books believed to be written using AI and listed under a real author’s name."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-08T22:59:39.000Z",
    "title": "Marathon Digital Q2 results miss revenue and earnings forecasts",
    "url": "https://cointelegraph.com/news/marathon-digital-q2-results-miss-forecasts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/293552b8-a355-4a3f-ae8d-c28c81f0147e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Despite the earnings miss, Marathon's CEO said it mined a record 2,926 Bitcoin over the second quarter of 2023.</p>\n                    <p><p>Crypto mining firm Marathon Digital missed earnings and revenue expectations with its second-quarter 2023 results. </p><p>Marathon's Q2 2023 results on Aug. 8 <a href=\"https://ir.mara.com/news-events/press-releases/detail/1323/marathon-digital-holdings-reports-second-quarter-2023\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> revenues of $81.8 million compared to Zacks Investment Research's estimate of $83.2 million.</p><p>The crypto miner reported a earnings per share net loss of 13 cents compared to Zacks' estimate of a 3 cents per share loss. </p><p>Marathon's share price largely remained sideways after market close, recording a 1.65% drop in after-hours trading to around $15.50 per share <a href=\"https://www.google.com/finance/quote/MARA:NASDAQ\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to Google Finance.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/ddc1e62f-0a80-44b5-a881-3a782d69226e.png\"  /><figcaption style=\"text-align: center;\"><em>Marathon's share price largely remained sideways after market close. Source: Google Finance</em></figcaption></figure><p>Marathon’s chairman and CEO Fred Thiel said in a press release that the firm significantly grew its hash rate and improved efficiency over the quarter.</p><p>“In Q2, we grew our energized hash rate 54% from 11.5 to 17.7 exahashes,\" Thiel reported. He added Marathon also increased its Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) production with a record 2,926 Bitcoin mined during the quarter, representing around 3.3%  of the network's rewards over that time.</p><p>Marathon reported a $23.4 million gain due to selling 63% of the Bitcoin mined in the quarter, used to fund operating costs. Impairment charges on the value of its held digital assets were $8.4 million.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-08T23:00:40.000Z",
    "title": "Binance becomes El Salvador’s first licensed crypto exchange amid regulatory struggles worldwide",
    "url": "https://cryptoslate.com/binance-becomes-el-salvadors-first-licensed-crypto-exchange-amid-regulatory-struggles-worldwide/",
    "description": "<p>Cryptocurrency exchange Binance is the first licensed crypto platform in El Salvador after receiving two licenses from the Central American country, according to an Aug. 8 statement. Binance said it was licensed as a Bitcoin Services Provider (BSP) by the Central Bank of El Salvador (Banco Central de Reserva). At the same time, the National Commission [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-becomes-el-salvadors-first-licensed-crypto-exchange-amid-regulatory-struggles-worldwide/\">Binance becomes El Salvador&#8217;s first licensed crypto exchange amid regulatory struggles worldwide</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NullTX",
    "date": "2023-08-08T23:05:03.000Z",
    "title": "Bitcoin Spark Could Be The Bitcoin You Can Actually Afford",
    "url": "https://nulltx.com/bitcoin-spark-could-be-the-bitcoin-you-can-actually-afford/",
    "description": "Since its inception, Bitcoin has significantly grown in popularity and mainstream adoption to dominate the entire cryptocurrency market. Its popularity and continuous adoption have exponentially surged its price, making it expensive for potential retail investors. Moreover, BTC has a huge market cap making its return on investment relatively small. Bitcoin Spark has come in as [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-08T23:00:57.000Z",
    "title": "Crypto Analyst Says Bitcoin Could Reach $180,000 Next Cycle If This Happens",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-could-reach-180000-next-cycle/",
    "description": "Since the Bitcoin bull market began, one discussion that has never left the crypto community is when the next bull rally will commence and if it would follow the previously established trend around the halving events. To this end, a crypto analyst, Lark Davis, has taken to X (formerly Twitter) to share his forecast around the next bull market. What Could Happen If History Repeats Itself All of the previous Bitcoin bull markets have always begun after the BTC halving event which cuts block rewards in half. However, this time around, there have been dissenting views regarding the digital asset’s tendency to follow this established trend once more due to deviations in various Bitcoin metrics. But Davis has shared a possible scenario for BTC if the bull market begins after the rally once more. Related Reading: Litecoin Hashrate Taps New All-Time High, Will LTC Price Follow Suit? In the chart shared by the analyst on X, he points out a long period of accumulation. This is when investors fill up their bags with BTC as it is possibly the lowest that the price of the digital asset would get during the bear market. BTC could reach $180,000 if the bull market follows halving cycle &#124; Source: Lark Davis on X Next comes the Bitcoin halving event, at which time, the price of Bitcoin and other cryptocurrencies in the market start to pick up steam. This is when the bull market starts to take shape, leading to the next part of the trend which is when prices explode. In Davis’ post, he shows that the price of the digital asset could rise as high as $180,000 during this time. If the cryptocurrency does touch this price mark, it would mean that the price of BTC would almost triple from its current all-time high of $69,000. How This Can Happen For Bitcoin As clarified by the analyst in his X post, for any of this to happen, it would mean that BTC would have to completely follow the trends of the previous bull cycles. This would mean the bottom could likely be reached in early 2024, but it would also be the same year for the start of the bull run. Even if Bitcoin does follow this trend though, it would not always be ‘up-only’ for the market. It would mean that the bull market would top out sometime in 2025 and then there would likely be a market crash that sends BTC spiraling in the following year. As Davis points out, the digital asset could tumble 70% to reach $50,000 again. Related Reading: Ethereum Price Could Break Above $2,000 If This Happens However, even with the obvious bear market that would follow this trend, it is still an incredibly bullish scenario for Bitcoin and the crypto market at large. The bull market would last around one year, following historical data, providing ample opportunity for investors to make the most of the market. The next Bitcoin halving is expected to take place in April 2024, and if history is anything to go by, this is around when the bull market should be expected to start back up. BTC price adds $300 &#124; Source: BTCUSD on Tradingview.com Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-08T23:00:00.000Z",
    "title": "XRP $5B Market Cap Dip Doesn’t Deter Expert’s $20 Bullish Outlook",
    "url": "https://coinedition.com/xrp-5b-market-cap-dip-doesnt-deter-experts-20-bullish-outlook/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/XRP-7.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP $5B Market Cap Dip Doesn’t Deter Expert’s $20 Bullish Outlook\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/XRP-7.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/XRP-7-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/XRP-7-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/XRP-7-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/XRP-7-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/XRP-7-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/XRP-7-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/XRP-7-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/XRP-7-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/XRP-7-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/XRP-7-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/XRP-7-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/XRP-7-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/XRP-7-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/XRP-7-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/XRP-7-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent video, crypto influencer Ben Armstrong, aka Bitboy, challenged a claim that the XRP price has lost momentum to push for further price increases, given that the coin has lost over $5 billion of its market cap. Bitboy refuted the claim while reflecting on his accurate predictions about the price movements of XRP [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrp-5b-market-cap-dip-doesnt-deter-experts-20-bullish-outlook/\">XRP $5B Market Cap Dip Doesn’t Deter Expert’s $20 Bullish Outlook</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]