[
  {
    "source": "CoinDesk",
    "date": "2023-08-22T08:46:41.000Z",
    "title": "Indian Crypto Exchange CoinDCX Is Cutting 12% of Jobs as Bear Market, Taxes Take Their Toll",
    "url": "https://www.coindesk.com/business/2023/08/22/indian-crypto-exchange-coindcx-is-cutting-12-of-jobs-as-bear-market-taxes-take-their-toll/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "As many as 71 people are losing their jobs."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-22T09:04:40.000Z",
    "title": "\n                        Finst becomes first Dutch cryptocurrency platform to release an extensive Proof of Reserves\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/finst-becomes-first-dutch-cryptocurrency-platform-to-release-an-extensive-proof-of-reserves",
    "description": "\n                        <p>According to LBank's latest announcement: https://support.lbank.com/hc/en-gb/articles/22061348602521</p>\n<ul>\n<li>Amsterdam-based cryptocurrency exchange Finst announces the successful release of its Proof of Reserves (PoR) conducted by a reputable and independent audit firm</li>\n<li>Finst&rsquo;s extensive Proof of Reserves audit is a first-of-its-kind, aiming to address the limitations of traditional PoR and set higher transparency standards in the crypto industry</li>\n<li>The audit, which will be renewed at least every 6 months, confirmed that Finst holds its clients&rsquo; assets on a full reserve basis (1:1) and has implemented an effective segregation of assets.</li>\n</ul>\n<p>As a crypto investor, getting access to reliable insights into an exchange&rsquo;s reserves and overall safety should be the norm. 8 months only after its launch,&nbsp;Finst&nbsp;becomes the first and only Dutch cryptocurrency platform to unveil an extensive Proof of Reserves audit conducted by AuditNow, a reputable and independent Dutch audit firm.</p>\n<p>The audit was skillfully led by AuditNow&rsquo;s CEO, Dani&euml;l Waknine, a distinguished member of the World Compliance Association who has previously been collaborating with esteemed institutions such as BNP Paribas and ING holding.</p>\n<p>As part of its Proof of Reserves audit, Finst has developed a comprehensive framework which provides full transparency on its structure, operations, assets, liabilities, business activities and overall&nbsp;safety.</p>\n<p>Challenging traditional Proof of Reserves limitations</p>\n<p>Traditional Proof of Reserves audits merely focus on an exchange&rsquo;s on chain holdings, with a scope often being limited to certain crypto assets, thus excluding the cash reserves of an exchange and its liabilities. Besides, traditional PoR audits do not verify whether an exchange has an effective segregation of assets in place, which is key in providing maximum safety as it prevents commingling of assets.</p>\n\n<p>Julien Vallet, CEO &amp; co-founder, commented:&nbsp;&ldquo;Our analysis of various Proof of Reserves (PoR) statements highlighted a need for greater clarity in this area. Traditional PoR tend to leave important questions unanswered for investors, which is why we decided to develop a new standard which goes far beyond the verification of on-chain holdings.&rdquo;</p>\n\n<p>The outcome of Finst&rsquo;s Proof of Reserves audit</p>\n<p>The results of this thorough and independent audit confirmed that Finst holds the entirety of its clients&rsquo; assets on a full reserve basis (1:1) and has an effective segregation of assets in place through a bankruptcy-remote vehicle. Additionally, the audit verified the following key points:</p>\n<ul>\n<li>Finst has policies and procedures in place to correctly safeguard its clients&rsquo; assets</li>\n<li>The designated roles and responsibilities in the safeguarding procedures are fulfilled</li>\n<li>A strict restriction of assets transfers to designated senior management employees is enforced</li>\n<li>Clients&rsquo; assets are held in a bank account and wallets through a bankruptcy-remote vehicle, without any possibility of commingling funds</li>\n<li>All clients&rsquo; assets have been acquired through users&rsquo; deposits, without the use of any loans</li>\n<li>There is no transfer or use of clients&rsquo; assets by any third party</li>\n<li>Clients&rsquo; assets are fully available, with a maximum time frame of 2 days</li>\n<li>Finst&rsquo;s collateralization rate is &gt;100% for all coins listed on its platform</li>\n<li>All cryptocurrencies listed on Finst&rsquo;s platform have been included in the audit scope</li>\n</ul>\n<p>The exchange also confirmed that it will renew its comprehensive Proof of Reserves audit at least every 6 months to ensure continuous and transparent information for its clients.</p>\n\n<p>Julien Vallet, added:&nbsp;&ldquo;Cryptocurrency investors rightfully deserve to know how well they are protected, especially in the wake of recent global exchanges collapses. We were surprised to see that no Dutch crypto platform has ever released a Proof of Reserves, and we firmly believe that this should become a standard practice. We extend an open invitation to all crypto platforms to join us in embracing this vital initiative so that we can collectively enhance the transparency and safety of the entire industry.&rdquo;</p>\n\n<p>To learn more, please&nbsp;read the Proof of Reserves statement (EN).</p>\n<p>About Finst</p>\n<p>Finst is the fastest-growing cryptocurrency exchange in The Netherlands and offers a best-in-class investment platform together with institutional-grade security standards and 82% lower trading fees. Finst is led by the ex-core team of DEGIRO and is registered as a Crypto Service Provider with De Nederlandsche Bank (DNB). Finst aims to become the largest and most trusted cryptocurrency platform in Europe by enabling retail investors to benefit from the same opportunities and tools as professional traders. For more information visit&nbsp;www.finst.com.</p>\n                    "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-22T08:44:28.000Z",
    "title": "\n                        Friend.tech Refutes Report Claiming User Information Was Leaked\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/friendtech-refutes-report-claiming-user-information-was-leaked",
    "description": "\n                        <p dir=\"ltr\">The team behind Friend.tech has vehemently denied a report that claimed the personal data of over 100,000 of its users had been leaked.&nbsp;</p>\n<p dir=\"ltr\">It was claimed in a report that Banteg, a core contributor to Yearn Finance, had published scraped details of Friend.tech users, including Twitter usernames and addresses.&nbsp;</p>\nFriend.tech Denies Report&nbsp;\n<p dir=\"ltr\">The report suggested that data posted by a pseudo-anonymous developer for Yearn Finance, Banteg, was leaked information. According to the report, the information published contained scraped details of over 100,000 Friend.tech users. However, the Friend.tech team countered the report, stating that the information published by Banteg came from scraping its public API. In a post on X, the Friend.tech official feed stated the report was basically saying we got hacked by someone who simply looked at our Twitter feed. The post also called out the publication that published the report.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;This is just someone scraping our public API that shows the association between public wallet addresses and public Twitter usernames. It&rsquo;s like saying someone hacked you by looking at your public Twitter feed.&rdquo;</p>\n\n<p dir=\"ltr\">The post by Friend.tech also received input from X&rsquo;s Community Notes contributors, stating,&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;The underlying data is public, and anybody can work it out by reading a block explorer: if you buy a share, 5% goes to the creator&rsquo;s wallet, and he will have needed to fund his wallet. The database only scraps that public info.&rdquo;</p>\n\nBanteg&rsquo;s Original Post&nbsp;\n<p dir=\"ltr\">Banteg had published a repository containing publicly available scraped data, including critical details of users on the Friend.tech platform on GitHub. The details include wallet addresses on Base and the corresponding Twitter usernames of over 100,000 users. Banteg stated in a post,&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;101,183 people have given friend.tech access to post as them, leaked db (database) indicates.&rdquo;</p>\n\n<p dir=\"ltr\">He also drew attention to Friend.tech&rsquo;s permissions, insisting that users had granted the app to post on their behalf without a complete understanding or consent. Notably, Banteg&rsquo;s post regarding the data came after a post from blockchain analytics service Spon-On-Chain, which noted that Friend.tech&rsquo;s API revealed specific information not available to typical users of the app. Spot-On-Chain also gave an example of this, stating that wallets created by certain users could be viewed through the API.&nbsp;</p>\n<p dir=\"ltr\">Spot-On-Chain stated that this information could potentially be used to game the system by allowing bots to almost instantaneously purchase shares of big accounts as soon as they signed up on the Friend.tech platform. Spot-On-Chain added,&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;A lot of bots have already taken advantage of this, it monitors the contract, finds the big KOL, and buys shares before others.&rdquo;</p>\n\n<p dir=\"ltr\">Meanwhile, X users saw the funny side of the unfolding situation, with one user posting a link to the Ethereum block explorer and claiming that they had discovered a leaked database of all transactions on Ethereum.&nbsp;</p>\n<p dir=\"ltr\">Friend.tech is a Web3 social application on the Base Layer-2 chain. It gives users a platform to trade shares in Twitter accounts, giving shareholders unique features such as access to private chat rooms. The platform has gained considerable traction since its launch, particularly due to a number of high-profile signups. Friend.tech had also recently generated over $1.4 million in protocol fees, putting it among the top three crypto projects when it came to fees. The project ranked only behind Ethereum and Lido.</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-22T09:00:26.000Z",
    "title": "Coinbase Acquires Equity Stake in Circle; Companies Reshape USDC’s Future",
    "url": "https://news.bitcoin.com/coinbase-acquires-equity-stake-in-circle-companies-reshape-usdcs-future/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/usdc-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/usdc-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/usdc-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/usdc-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/usdc-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/usdc-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/usdc-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/usdc.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a joint statement, Jeremy Allaire, CEO of Circle, and Brian Armstrong, CEO of Coinbase, announced the dissolution of the Centre Consortium. Consequently, Circle will take exclusive charge of the issuance and governance of USDC. Additionally, Coinbase has acquired an equity stake in Circle while signaling a stronger commitment to stablecoins. Circle, Coinbase Dissolve USDC&#x2019;s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-22T09:03:52.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 How much is Bitcoin (BTC) worth? Today, the price of Bitcoin stands at $26,065, with a 24-hour trading volume totalling $38.62 billion. It boasts a market capitalization of $507 billion and commands 47% of the cryptocurrency market. Over the past day, Bitcoin’s price experienced a decrease of 0.24%. Currently, there are ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  }
]