[
  {
    "source": "CoinDesk",
    "date": "2023-05-31T11:00:00.000Z",
    "title": "Find Satoshi Labs Rolls Out AI Tool That Turns Selfies Into NFTs",
    "url": "https://www.coindesk.com/web3/2023/05/31/find-satoshi-labs-rolls-out-ai-tool-that-turns-selfies-into-nfts/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The parent company behind Web3 game STEPN is releasing GNT V3, which will allow users to turn their selfies into digital artworks on the Solana blockchain."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-31T10:59:52.000Z",
    "title": "Rental car owner arrested for taking payment in crypto",
    "url": "https://cryptodaily.co.uk/2023/05/rental-car-owner-arrested-for-taking-payment-in-crypto",
    "description": "<p>An Indonesian rental car owner was arrested by Bali police at his business premises after it was alleged he accepted crypto for payments.</p>\n<p>It has always been so, that anyone who uses anything else other than a government-backed currency to make a transaction is considered to have broken the law, and is normally heavily sanctioned compared to other far more heinous crimes, depending on the country in which they reside.</p>\n<p>In this particular case, police in Bali carried out an undercover operation in order to expose the illegal transactions that were being made, i.e., taking payments in crypto in exchange for car rentals.</p>\n<p>The police set up the car rental owner by first infiltrating a Telegram group and then asked the suspect for a wallet address for crypto payment. In a subsequent meeting to finalise the deal the business owner was arrested and his mobile phone was seized as well as other possessions.</p>\n<p>If proven guilty, the punishment meted out by Indonesian courts for such an offence is up to one year in prison, and a fine of IDR 200 million (US$13,337).&nbsp;</p>\n<p>According to Coconuts Bali, Nanang Prihasmoko, the Bali Crime Investigation Unit Chief, said of the incident:</p>\n\n<p>&ldquo;We encourage the use of the Indonesian rupiah because it is the only currency in Indonesia, and we must conduct transactions with it,&rdquo;&nbsp;</p>\n\nOpinion\n<p>On the face of it, requiring citizens to transact in the officially recognised currency of the land appears to be not only sensible but laudable, given that the use of other, non-official currencies, can take away from the official currency, and over time confidence in it can erode.</p>\n<p>However, as the following chart demonstrates, the Indonesian rupiah is not maintaining its value. The chart is for the price of gold in kilograms against the Indonesian rupiah over the last 15 years. It can be seen that the rupiah has fallen around 400% to gold in this time.</p>\n<p></p>\n<p>Source: Goldprice.org</p>\n<p>Every fiat currency in the world is also suffering a similar fate, leading to vastly reduced purchasing power for citizens of all countries. The question is whether citizens should agree to allow their governments to continue to prop up banks and save in rapidly devaluing currencies.</p>\n<p>The fiat currency experiment has failed on the most spectacular level. This being said, governments and banks have locked their citizens into this system with very few escape routes out. Crypto, gold, and silver are those routes out, so stand by for them to become ever more difficult to purchase.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-31T11:00:32.000Z",
    "title": "Junkineering Launches a Closed Demo in Q3 2023: New Approach Vision  for the Web3 Gaming Industry",
    "url": "https://news.bitcoin.com/junkineering-launches-a-closed-demo-in-q3-2023-new-approach-vision-for-the-web3-gaming-industry/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/unnamed-1-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/unnamed-1-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/unnamed-1-1024x577.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/unnamed-1-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/unnamed-1-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/unnamed-1-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/unnamed-1-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/unnamed-1.png 1204w\" sizes=\"(max-width: 768px) 100vw, 768px\" />What is wrong with the current P2E market Since most P2E projects do not create long-playing products, the Free-to-Play model of the past decade is breaking down, threatening to disrupt a $100B+ industry. The main lessons learned before 2023 are: NFTs were misused for trading and farming, not for gaming, Pay-to-play model anyway to engage [&#8230;]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-31T10:53:05.000Z",
    "title": "BREAKING: Binance Explores Potential Partnerships with Trillion Dollar Banks to Mitigate Crypto Risk",
    "url": "https://www.crypto-news-flash.com/breaking-binance-explores-potential-partnerships-with-trillion-dollar-banks-to-mitigate-crypto-risk/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-binance-explores-potential-partnerships-with-trillion-dollar-banks-to-mitigate-crypto-risk",
    "description": "<p>Binance is reportedly seeking to work with Swiss-based FlowBank and Liechtenstein-based Bank Frick to facilitate the asset custody services. The exchange saw its institutional clients in Q4 rise by 17 percent QoQ. Following the collapse of FTX and Alameda late last year, Binance, the leading cryptocurrency exchange, has been putting in place measures to restore [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/breaking-binance-explores-potential-partnerships-with-trillion-dollar-banks-to-mitigate-crypto-risk/\">BREAKING: Binance Explores Potential Partnerships with Trillion Dollar Banks to Mitigate Crypto Risk</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-31T10:41:24.000Z",
    "title": "Argentinians can now buy milk with Tether (USDT), traders on Tradecurve can get moon bags",
    "url": "https://www.crypto-news-flash.com/argentinians-can-now-buy-milk-with-tether-usdt-traders-on-tradecurve-can-get-moon-bags/?utm_source=rss&utm_medium=rss&utm_campaign=argentinians-can-now-buy-milk-with-tether-usdt-traders-on-tradecurve-can-get-moon-bags",
    "description": "<p>Emerging markets absolutely dominate when it comes to crypto adoption. The East will fuel the next bull run, according to Cameron Winklevoss, along with emerging economies. As the United States clamps down on crypto, Tether (USDT) has partnered with KriptonMarket to enable stablecoin purchases in the Central Market of Buenos Aires- the difference is night [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/argentinians-can-now-buy-milk-with-tether-usdt-traders-on-tradecurve-can-get-moon-bags/\">Argentinians can now buy milk with Tether (USDT), traders on Tradecurve can get moon bags</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-31T10:40:00.000Z",
    "title": "APE’s Price May Lose Another Major Support Level in the Next 24Hrs",
    "url": "https://coinedition.com/apes-price-may-lose-another-major-support-level-in-the-next-24hrs/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/What_to_expect_from_ApeCoin_Next_Crack_at_Support_Could_Be_Decisive-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"APE\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/What_to_expect_from_ApeCoin_Next_Crack_at_Support_Could_Be_Decisive-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/What_to_expect_from_ApeCoin_Next_Crack_at_Support_Could_Be_Decisive-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/What_to_expect_from_ApeCoin_Next_Crack_at_Support_Could_Be_Decisive-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/What_to_expect_from_ApeCoin_Next_Crack_at_Support_Could_Be_Decisive-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/What_to_expect_from_ApeCoin_Next_Crack_at_Support_Could_Be_Decisive-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/What_to_expect_from_ApeCoin_Next_Crack_at_Support_Could_Be_Decisive.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The price of ApeCoin (APE) experienced a 24-hour loss according to CoinMarketCap. This brought the price of the altcoin down to $3.12 at press time. In addition to this, the recent decrease in the crypto’s price had pushed APE down to a key support level, which, if broken in the next 2 days, could be [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/apes-price-may-lose-another-major-support-level-in-the-next-24hrs/\">APE’s Price May Lose Another Major Support Level in the Next 24Hrs</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]