[
  {
    "source": "CryptoGlobe",
    "date": "2023-12-17T19:58:57.000Z",
    "title": "David Duong of Coinbase Institutional Analyzes Crypto’s Resurgence and Future Trends in 2024",
    "url": "https://www.cryptoglobe.com/latest/2023/12/david-duong-of-coinbase-institutional-analyzes-cryptos-resurgence-and-future-trends-in-2024/",
    "description": "What is Coinbase Institutional? Coinbase Institutional represents a significant branch of Coinbase, one of the leading cryptocurrency exchanges, tailored specifically to meet the needs of institutional clients. This platform is designed to cater to a range of professional investors, including hedge funds, asset managers, pension funds, and other large-scale entities, offering a suite of services […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-17T20:00:25.000Z",
    "title": "Bitcoin Miners Hit Record $9.97M Earnings From Ordinals; 61% of BTC Transfers Inscription-Driven",
    "url": "https://news.bitcoin.com/bitcoin-miners-hit-record-9-97m-earnings-from-ordinals-61-of-btc-transfers-inscription-driven/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/inscriptttttt-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Miners Hit Record $9.97M Earnings From Ordinals; 61% of BTC Transfers Inscription-Driven\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/inscriptttttt-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/inscriptttttt-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/inscriptttttt-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/inscriptttttt-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/inscriptttttt-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/inscriptttttt-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/inscriptttttt.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In the wake of a substantial increase in onchain transaction fees for Bitcoin, the compensation to bitcoin miners from inscription-based transfers has hit a record peak in the last 24 hours. An estimated total of $9.97 million was allocated to miners, eclipsing the former high of $7.21 million established on May 8, 2023. Miners Rake [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-17T20:02:09.000Z",
    "title": "Rising Bitcoin Ordinals trend fuels crypto community debate",
    "url": "https://www.cryptopolitan.com/rising-bitcoin-ordinals-trend-fuels-crypto/",
    "description": "The Bitcoin network has recently witnessed a remarkable surge in activity, primarily driven by the rising popularity of Bitcoin Ordinals and their associated inscriptions. This trend, while showcasing the network&#8217;s versatility, has sparked a debate over its impact on the decentralized nature of Bitcoin and the increased network fees. Bitcoin Ordinals surge sparks community debate [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-17T20:02:13.000Z",
    "title": "Flooring Protocol allegedly hacked for NFTs worth $1.5m",
    "url": "https://crypto.news/flooring-protocol-pudgy-penguin-bored-ape-hacked-nfts/",
    "description": "Three dozen Pudgy Penguins and 15 Bored Ape NFTs worth 690 Ether (ETH) or approximately $1.54 million were reportedly stolen."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-17T20:00:03.000Z",
    "title": "New And Upcoming NFT Projects",
    "url": "https://www.newsbtc.com/nft/new-and-upcoming-nft-projects/",
    "description": "Finding the best upcoming NFT projects can be quite challenging, but it&#8217;s an endeavor filled with excitement and potential rewards. The NFT world is buzzing with innovation and creativity, offering a plethora of opportunities for collectors and enthusiasts alike. This guide is tailored to simplify your journey through this vibrant landscape, highlighting key NFT trends, notable upcoming NFT mints, and standout NFT projects across various platforms. We’ll show you how to find upcoming NFT projects! Upcoming NFT Projects The arena of upcoming NFT projects in 2024 is a treasure trove of innovation and opportunity. As we delve into this space, we discover a range of projects that are setting new standards in the NFT world. From digital art masterpieces to revolutionary utility-based tokens, these upcoming NFT projects are not just about ownership, but also about experiencing the future of digital interaction and community building. The beauty of these upcoming NFT projects lies in their diversity and potential for growth. Whether it&#8217;s promising and upcoming NFT projects on Solana or Cardano or the latest Ethereum-based artworks, each project offers a unique glimpse into the future of digital assets. The key to navigating this space is staying informed and connected, allowing you to identify NFT trends and engage with the best upcoming NFT projects that resonate with your interests and investment goals. Possible NFT Trends For 2024 In 2024, the NFT space is expected to showcase a range of trends and developments: Established And Upcoming NFT Art Art has always held cultural and historical significance, and this extends to NFT art. It has already attracted a substantial base of collectors and enthusiasts, both within and outside the crypto space. This NFT trend is likely to continue in 2024. GameFi And NFT Integration The fusion of decentralized finance (DeFi), NFTs, and online gaming, known as GameFi, is advancing. This integration offers unique opportunities for players and developers, with NFTs serving as in-game assets and rewards, adding tangible value to gaming experiences. Games like Axie Infinity exemplify this trend, where characters exist as distinct NFTs on the Ethereum blockchain, enhancing digital ownership and security​​. NFTs In The Metaverse NFTs are becoming integral to the metaverse, facilitating digital ownership and interaction. They enable users to create or acquire lasting items for use across various virtual worlds. The metaverse utilizes NFTs for applications like virtual real estate, land ownership, and digital fashion, opening new avenues for investment and creative expression​​. Virtual Real Estate And Land Ownership In the metaverse, NFTs are revolutionizing virtual real estate and land ownership, offering opportunities for investment and development. Fractional ownership of property through NFTs is becoming more accessible, with platforms like Metropoly leading this trend. Marketplaces like OpenSea and Decentraland are prominent for trading virtual real estate NFTs​​. Digital Fashion And Wearables The metaverse is seeing a rise in digital fashion and wearables as NFTs, enabling users to express their style and individuality in virtual spaces. Brands like Adidas, Gucci, and Nike have successfully ventured into this arena, with platforms like DRESSX and UNXD facilitating the trade of digital fashion NFTs​​. Decentralized Finance (DeFi) And NFTs The convergence of DeFi and NFTs is opening new possibilities for financial innovation. Tokenizing real-world assets through NFTs enables fractional ownership and broader investment opportunities. NFT lending platforms like NFTfi and Solvent offer innovative solutions for using NFTs as collateral for loans, unlocking liquidity for NFT holders and broadening the scope of financial services​. Upcoming NFT Projects And Mints The world of non-fungible tokens (NFTs) is continuously evolving, with upcoming NFT projects and mints capturing the imagination of investors and enthusiasts alike. In 2024, the landscape is set to transform with innovative and promising NFT endeavors. This section looks at the most anticipated upcoming NFT projects and the hottest NFTs at the moment. Pudgy Penguins Pudgy Penguins is a vibrant NFT collection that launched in 2021. It features 8,888 unique cartoon penguins, each with distinctive traits like clothing, body features, and backgrounds. These penguins symbolize positive values such as love, happiness, compassion, and empathy. The collection, originally developed by ColeThereum and friends, was later acquired by Luca Netz in 2022, who expanded the project&#8217;s reach. Notable for its large community, Pudgy Penguins also introduced Pudgy Toys in collaboration with major retailers like Walmart and Amazon. The collection represents more than digital art; it’s a symbol of communal virtues and a significant player in the NFT world, with its most expensive piece selling for over $640,000​​​​​​​​​​. Azuki Azuki is a standout NFT project featuring 10,000 anime-inspired avatars. Launched in January 2022 by Chiru Labs, a group of Los Angeles-based artists and developers, Azuki gained rapid popularity due to its unique artwork and ambitious roadmap. Initially offered via a Dutch Auction, the collection sold out swiftly, reflecting its high demand. Azuki&#8217;s vision encompasses creating a large decentralized metaverse brand, emphasizing community ownership. The project has introduced &#8220;Azuki Beanz,&#8221; a complimentary collection to expand the Azuki universe without diluting its originality. 2023 saw the launch of Hilumia, Azuki&#8217;s virtual world offering immersive experiences exclusively for Azuki and Beanz holders. Additionally, Azuki announced a partnership with IPX, showcasing a blend of Web3 innovation and traditional branding strategies​​. Lil Pudgys Lil Pudgys emerged as an adorable extension of the Pudgy Penguins NFT collection. Launched in December 2021, this collection comprises 22,222 penguin NFTs, serving as allies in the Pudgy Penguins&#8217; narrative. With a delightful aesthetic designed to spread positivity, Lil Pudgys offers an affordable entry into the Pudgy ecosystem. Each NFT in the collection is unique, featuring a combination of 405 traits across 10 categories. The distribution of Lil Pudgys included a public sale and a claimable portion for Pudgy Penguin owners. Despite early controversies involving the original team, the project found new direction under entrepreneur Luca Schnetzler. His team has introduced innovative concepts like soulbound tokens and expanded the project&#8217;s reach with initiatives like Pudgy Toys, a collaboration with PMI Toys for physical merchandise. The Lil Pudgys collection has also embraced cross-chain capabilities, allowing NFTs to traverse multiple blockchain networks. This strategic expansion has positioned Lil Pudgys as a dynamic player in both digital and physical realms, blending NFTs with real-world applications​​​​​​​​​​. Skyborne &#8211; Genesis Loot Skyborne &#8211; Genesis Loot is part of the Skyborne Legacy franchise developed by Revolving Games. This company is backed by prominent Web3 investors and features a global team. Its ambitious franchise consists of a trilogy: Skyborne Genesis (a web browser minigame), Skyborne Phoenix Flight (a mobile fantasy adventure game), and Skyborne Legacy (a PC MMORPG), slated for release in 2024. Skyborne Genesis serves as a prologue in this universe, offering narrative-driven quests with NFT rewards. It&#8217;s a strategic and immersive experience where players use &#8220;Immortal&#8221; NFTs to complete quests and earn rewards, significantly enhancing their gameplay in the upcoming games of the franchise. Skyborne Genesis has partnered with OpenSea for its first free NFT mint, including the Genesis Immortals and Nexian Gems collections. These collections provide early access to new content and collectibles for future Skyborne mints. The game, developed using the Polygon PoS protocol, is set in a detailed world where traits impact the gameplay, and the quests are designed to maximize player engagement and rewards. Skyborne&#8217;s roadmap and collaborative efforts with industry leaders highlight the potential of blockchain in gaming and its commitment to delivering a rich, multifaceted gaming experience​. Milady Maker Milady Maker is an NFT collection of 10,000 pieces, showcasing a unique neochibi aesthetic inspired by Y2K Japanese street style tribes. This project transcends the typical digital art sphere, creating a lifestyle and community around its distinctive aesthetic. It features innovative VR integration, allowing avatars to be used in VRtube, and a specialized Milady Minecraft Metaverse for community engagement and events. The collection also includes exciting expansion projects like Banners NFT and Redacted Remilio Babies, offering diverse experiences to holders. The distinct art style of Milady NFTs, influenced by various Tokyo fashion themes, is complemented by a &#8216;Drip Score&#8217; system, enhancing their appeal and market value. This project not only presents unique digital art but also fosters a vibrant community and diverse artistic expressions​. OrdiRocks: Upcoming NFT Project? OrdiRocks is a distinct NFT collection comprising 500 genesis tokens, created in February 2023. It&#8217;s a series of digital artworks stored on the Bitcoin blockchain, forming part of a larger suite of 10,000 NFTs. With 3.346 unique owners currently holding at least one OrdiRock, the collection has a significant holder base. OrdiRocks is part of the larger suite of Bitcoin Ordinals. These are essentially Satoshis (the smallest unit of Bitcoin) that have been ordered and inscribed with unique information such as text or images, transforming them into a type of NFT. Unlike traditional NFTs (on Ethereum or Solana) minted as new tokens, Ordinals are inscribed directly onto the Bitcoin blockchain, containing the actual raw file data. This approach differs significantly from other NFTs, which often only refer to off-chain files. Ordinals, therefore, represent a blend of digital art and blockchain technology, retaining the fungibility at the protocol level but becoming unique at the social level due to their inscriptions. Bitcoin Punks Bitcoin Punks, part of the growing trend of Bitcoin NFTs, is an NFT collection that mirrors the iconic CryptoPunks. This collection, leveraging the Bitcoin-native Ordinals Protocol, consists of 100 NFTs styled similarly to Yuga Labs&#8217; CryptoPunks on Ethereum. One notable sale from this collection, Punk 94, fetched a significant 9.5 BTC, approximately $214,000. The Ordinals Protocol utilizes Bitcoin&#8217;s Taproot upgrade to securely and efficiently store NFTs through inscriptions, essentially encoding data onto individual satoshis. The Bitcoin Punks were minted on the first 650 inscriptions of the Bitcoin network, representing a significant move in the blockchain community. Axies &#8220;Axies,&#8221; based on the popular blockchain-based game Axie Infinity, are unique digital creatures that players can collect, breed, raise, battle, and trade. Each Axie is a non-fungible token (NFT) with different attributes and strengths, making them unique in the game&#8217;s ecosystem. The game has garnered significant attention for its play-to-earn model, where players can earn cryptocurrency through gameplay and contributions to the ecosystem. The game blends elements of traditional gaming with emerging blockchain technology, creating an innovative, engaging, and financially incentivized gaming experience. Axies have become a cornerstone of this virtual world, symbolizing the fusion of gaming and decentralized finance (DeFi). Decentraland In Decentraland, NFTs play a central role, representing the ownership and trading of virtual land parcels in this Ethereum-based virtual world. These land parcels are unique, immutable digital assets that users can purchase, develop, and monetize, creating personalized experiences ranging from games and interactive art to social hubs and commercial ventures. The platform&#8217;s marketplace facilitates the buying, selling, and leasing of these NFT land parcels, as well as other digital goods and services, making Decentraland a vibrant ecosystem for virtual real estate and a hotbed for digital creativity and commerce. DeGods &#8220;DeGods&#8221; is a prominent NFT project known for its unique digital collectibles. Each NFT in this collection represents a distinctively designed digital character, often with a focus on artistic creativity and rarity. The DeGods project has gained popularity in the NFT community for its engaging community involvement, innovative features, and utility within the digital collectibles space. Owners of DeGods NFTs often have access to exclusive events, community votes, and special releases, making it a dynamic and community-driven project within the wider NFT ecosystem. CryptoPunks CryptoPunks, launched in 2017, are the original trailblazers in the NFT world, holding a significant place in the history and development of the crypto art movement. Globally acknowledged for their cultural and artistic value, CryptoPunks have earned inclusion in prestigious art institutions like the Centre Pompidou in Paris, LACMA, and ICA Miami. In May 2023, CryptoPunks achieved a remarkable milestone, becoming the first NFT collection to surpass $100 million in total loan volume on NFTfi. This feat reflects the strong adoption of NFT finance tools by CryptoPunks holders, who have successfully leveraged their assets for liquidity while maintaining a high repayment rate. The collection&#8217;s integration into the financial sphere exemplifies how NFTs are being used beyond just collectibles, evolving into significant assets in the broader financial landscape​​. Mutant Ape Yacht Club (MAC) The Mutant Ape Yacht Club, created by Yuga Labs, is an innovative extension of the Bored Ape Yacht Club (BAYC) ecosystem. Launched on August 28, 2021, as a collection of 20,000 Mutant Ape-themed NFTs, MAYC aimed to expand the BAYC collector base. Each MAYC NFT is derived from an original Bored Ape NFT, transformed through a process involving &#8216;Mutant Serum&#8217; NFTs. Half of the Mutant Ape Yacht Club collection was created by Bored Ape holders using these serums, while the other half was sold through a Dutch auction. The MAYC project has significantly increased the accessibility of the Bored Ape ecosystem. Originally, Bored Ape NFTs were expensive and elusive, but the introduction of Mutant Ape Yacht Club and Kennel Club NFTs lowered the barrier to entry. This accessibility has extended MAYC&#8217;s popularity beyond the NFT space, with several brands utilizing Mutant Apes as brand ambassadors. Bored Ape Yacht Club (BAYC) Bored Ape Yacht Club NFTs are certainly no longer an insider tip, in fact the BAYCs have long been the most popular and most expensive NFT project. But because the price of BAYCs plummeted in the bear market, they could be one of the upcoming NFT projects in terms of value appreciation in the next crypto bull market. The Bored Ape Yacht Club (BAYC) is a collection of 10,000 unique Bored Ape NFTs (Non-Fungible Tokens) residing on the Ethereum blockchain. Each NFT depicts a distinctive digital character, generated algorithmically. The collection gained popularity for its blend of digital collectibles and membership perks, creating a unique online club experience. Notably, BAYCs have attracted a notable list of celebrity buyers, making it a popular NFT collection. Some of the most famous buyers include Snoop Dogg, Gwyneth Paltrow, Stephen Curry, Post Malone, Jimmy Fallon, Lamelo Ball, Justin Bieber and DJ Steve Aoki. Cardano NFT Projects Upcoming The Cardano blockchain, recognized for its proof of stake consensus mechanism, is fast becoming a hub for upcoming NFT projects. Here we delve into the top three Cardano NFT projects making waves on the network, as highlighted by DappRadar&#8217;s latest data. 1. The Ape Society At the pinnacle of upcoming Cardano NFT projects stands The Ape Society, a collection that has seen a remarkable uptick in both average price and volume, rising by 8.85% and 84.97% in the last 30 days respectively. This collection&#8217;s unique digital artwork of apes has not only captivated the community&#8217;s imagination but also reflected the growing interest in Cardano&#8217;s NFT capabilities. With 168 traders and 124 sales in the last 30 days, The Ape Society is setting a strong precedent for digital collectibles on the Cardano blockchain. 2. Toolheads Toolheads occupies the second spot, with a nuanced approach to NFTs. Despite a slight decrease in volume in the last 30 days, the average price has risen by 19.1%, indicating a robust demand for this collection. The number of traders interacting with Toolheads has reached 403, and the collection has facilitated 536 sales, showcasing a solid engagement level within the Cardano NFT ecosystem. 3. Jellycubes &#8211; BIG Jellycubes &#8211; BIG, another leading Cardano NFT collection, offers a distinct aesthetic with its vibrant and playful cubic creatures. While the volume has seen a downturn of 47.64% in the last 30 days, the traders remain engaged, with 96 active participants and 57 sales. The collection&#8217;s average price has experienced a modest increase of 4.85%, suggesting that collectors are still valuing the uniqueness of these NFTs. New NFT Games In 2024 The year 2024 is shaping up to be a monumental year for blockchain-based gaming, particularly with the integration of NFTs. The gaming landscape on blockchains like Ethereum, Binance Smart Chain, and notably Cardano is undergoing rapid innovation. New games leverage the unique properties of NFTs to redefine player ownership and involvement. Below, we explore some of the most anticipated NFT games slated for release in 2024, which promise to offer unprecedented gaming experiences. 1. Best Upcoming NFT Game: Illuvium Illuvium, which made its grand entrance on the Epic Games Store on November 28, 2023, is a trailblazer in the AAA-quality, open-world RPG genre. Built on the Ethereum blockchain, Illuvium offers a visually stunning experience where players can explore a vast alien landscape. The game&#8217;s integration of NFTs is seamless, allowing players to capture deity-like creatures known as Illuvials, each tokenized as an NFT. The ownership of these Illuvials is absolute, with the blockchain ensuring the uniqueness and provenance of each creature. With its deep strategic elements, the game allows players to battle, trade, and build a collection of Illuvials, which can be leveraged in competitions. As the first blockchain-based title to launch on a mainstream gaming platform, Illuvium is not just a game but a statement about the future of integrated blockchain gaming. BlockLords BlockLords is a grand strategy game that thrusts players into the heart of a medieval landscape ripe with political intrigue and economic strategy. Each player&#8217;s journey towards dominion is nuanced by the NFT-based ownership of characters, lands, and titles. Expected to release in late 2024, BlockLords is set to offer a experience where players can become lords, vassals, or monarchs. The integration of NFTs promises to elevate the strategic gameplay, allowing for authentic asset ownership and transfer. Guild Of Guardians Guild of Guardians is an upcoming mobile RPG that merges the thrill of dungeon-crawling with the cutting-edge technology of NFTs. Scheduled for release in the first quarter of 2024, it empowers players to build powerful guilds, embark on adventurous quests, and earn valuable resources. Guild of Guardians tokenizes every character and item, allowing players to earn tangible rewards through its &#8220;play-to-earn&#8221; model. Designed for mobile platforms, the game extends NFT gaming&#8217;s reach beyond traditional PC and console markets. Its free-to-play model, coupled with the potential for players to earn real-world value from in-game achievements, positions Guild of Guardians as a potential vanguard in the mobile gaming sector. How To Find Upcoming NFT Projects Discovering upcoming NFT projects that resonate with personal interests or investment goals requires a proactive approach to navigate the expansive digital landscape. Here are some strategies to uncover these hidden gems: Research And Community Engagement The first step is to immerse yourself in the NFT community. Platforms like Twitter, Discord, and Reddit are teeming with discussions about new and upcoming projects. Joining these communities can provide insights into emerging trends and lead to early discoveries of promising NFT ventures. NFT Marketplaces And Listing Sites OpenSea, the largest NFT marketplace, offers a feature-rich platform where users can explore and track upcoming collections. Their ranking system, interactive interfaces, and detailed asset information make it a valuable resource for enthusiasts looking to catch the next wave of upcoming NFT projects. Analytics And Tracking Platforms DappRadar is an analytics platform that provides comprehensive data on blockchain-based projects, including NFT collections. Their interface allows users to monitor activity, track trends, and gain a granular understanding of the market dynamics. This is crucial when scouting for upcoming NFT projects. NFT Calendars And Launchpads Dedicated NFT calendars and launchpads list upcoming drops, auctions, and minting events, providing valuable information. These specialized resources are invaluable for staying ahead of the curve and securing positions in early-stage projects The Future Of NFT Art And Collections NFT art and collections are on a trajectory for an intriguing evolution. This is marked by a deeper integration with traditional art markets and heightened interactivity. As auction houses and galleries increasingly embrace NFTs, the barrier between digital and physical art continues to dissolve. Fractional ownership stands ready to further democratize art collection, enabling broader access to high-value pieces and potentially enhancing market liquidity. In the creative sphere, AI is anticipated to become a pivotal force, creating unique artworks. The future also promises enhanced cross-platform interoperability, making the trade and display of NFTs more fluid across various blockchain ecosystems. Sustainability is becoming a central concern, with the NFT sector likely to adopt more eco-friendly practices and technologies. Alongside this, clearer regulatory frameworks will emerge to provide security and foster growth within the industry. Finally, NFTs are poised to play a significant role in cultural and historical preservation. They introduce new methods for protecting and sharing our collective heritage. As these trends converge, the NFT landscape will not only redefine artistry and ownership but also shape the cultural fabric of our digital-centric world. FAQ: Upcoming NFT Projects What Are Some Notable Upcoming NFT Projects to Watch Out For? The NFT arena is abuzz with groundbreaking initiatives such as Skyborne Genesis Loot, Lil Pudgys, OrdiRocks on Bitcoin and Axies. What Exciting Opportunities Exist in Upcoming NFT Minting? There are numerous compelling minting opportunities, including exclusive digital collectibles, collaborative pieces from prominent artists, and interactive NFTs. The latter promise engaging and potentially immersive experiences. What Are the Most Anticipated Upcoming NFT Projects in 2024? The NFT community eagerly awaits the year 2024 for projects like Skyborne Genesis Loot, Lil Pudgys, OrdiRocks and Axies. Which Up and Coming NFT Projects Are Gaining Momentum? Among the upcoming NFT projects, the Pudgy Penguins stand out. Analysts speculate that they could overtake the BAYC NFTs from their top spot in this crypto bull run. What Are Some Big Upcoming NFT Projects Set to Launch Soon? On the imminent horizon are ambitious projects such as &#8220;CryptoCinema,&#8221; which merges the realms of NFTs and cinematic entertainment. Another one is &#8220;Phantom Galleries,&#8221; which promises to deliver AR art experiences by world-renowned creators. Which Upcoming NFTs To Mint Should Collectors Be Excited About? Collectors should look forward to minting prospects within projects like &#8220;Synthetica,&#8221; showcasing AI-generated artwork. Also interesting is &#8220;Legacy Tokens,&#8221; which offer ownership in digitalized historical artifacts. What New NFT Games In 2024 Are Creating a Buzz? Illuvium, BlockLords and Guild Of Guardians are generating excitement with their rich narrative and strategy-driven gameplay. They seamlessly integrate NFTs into their core mechanics. Which Are the Top New NFT Projects Currently? Iconic collections like Bored Ape Yacht Club (BAYC) and Pudgy Penguins currently still dominate the NFT landscape. They captivate the market with their unique community offerings and evolving narratives. What Are Some New NFT Projects To Mint With Potential? Innovative ventures like &#8220;Quantum Quirks,&#8221; connecting scientific wonders to NFTs, and &#8220;SoundSculpt,&#8221; visualizing audio in art form, are brimming with potential and ripe for minting. Featured image from Shutterstock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-17T20:00:32.000Z",
    "title": "Hot December Picks: 3 Rising Altcoins Post-Bitcoin Rally",
    "url": "https://www.crypto-news-flash.com/hot-december-picks-3-rising-altcoins-post-bitcoin-rally/?utm_source=rss&utm_medium=rss&utm_campaign=hot-december-picks-3-rising-altcoins-post-bitcoin-rally",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-17T225713.751.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-17T225713.751.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-17T225713.751-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The cryptocurrency market is buzzing with excitement, especially after Bitcoin&#8217;s recent rally. While the flagship cryptocurrency has been stealing the spotlight, let&#8217;s shift our focus to three rising altcoins that are making waves in the crypto space this December. Among them, Galaxy Fox stands out as a promising and best upcoming ICO that&#8217;s capturing the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-17T19:53:48.000Z",
    "title": "Markets Erase Monday’s Losses, Injective (INJ) and Fetch.Ai (FET) Gain Over 10% While Pullix (PLX) Sells Out Stage 1 of Their Presale In Rapid Time",
    "url": "https://www.crypto-news-flash.com/markets-erase-mondays-losses-injective-inj-and-fetch-ai-fet-gain-over-10-while-pullix-plx-sells-out-stage-1-of-their-presale-in-rapid-time/?utm_source=rss&utm_medium=rss&utm_campaign=markets-erase-mondays-losses-injective-inj-and-fetch-ai-fet-gain-over-10-while-pullix-plx-sells-out-stage-1-of-their-presale-in-rapid-time",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-17T225247.712.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-17T225247.712.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-17T225247.712-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />After Monday&#8217;s market turbulence, key altcoins are reclaiming the lost ground. Cryptocurrencies are on an upward trajectory, with notable gains observed for Injective (INJ) and Fetch.Ai (FET), boasting over a 10% surge. Meanwhile, Pullix (PLX) has experienced stellar presale performance with 3.2M tokens already sold and $134,400 raised. Some experts even foresee this new ICO [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-17T19:47:48.000Z",
    "title": "Cantor Fitzgerald Confirmed as Custodian of Tether Reserves",
    "url": "https://www.crypto-news-flash.com/cantor-fitzgerald-confirmed-as-custodian-of-tether-reserves/?utm_source=rss&utm_medium=rss&utm_campaign=cantor-fitzgerald-confirmed-as-custodian-of-tether-reserves",
    "description": "<img width=\"390\" height=\"280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/usdt-e1702581035956.webp\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"USDT\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" />Cantor Fitzgerald is confirmed as custodian of Tether&#8217;s reserves, strengthening confidence in the stablecoin in the financial market. Tether, with a market capitalization exceeding $90 billion, chooses Cantor for his experience in the Treasury market. Cantor Fitzgerald, a prominent Wall Street firm, has confirmed its role as custodian of the reserves of Tether, the popular [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-17T19:46:27.000Z",
    "title": "U.S. SEC Chair Hints at Bitcoin ETF Approvals: The Countdown Begins",
    "url": "https://www.crypto-news-flash.com/u-s-sec-chair-hints-at-bitcoin-etf-approvals-the-countdown-begins/?utm_source=rss&utm_medium=rss&utm_campaign=u-s-sec-chair-hints-at-bitcoin-etf-approvals-the-countdown-begins",
    "description": "<img width=\"1000\" height=\"666\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BlackRock\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/05/Beneath-Blue-Bitcoin-ETF-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />In an interview with CNBC, SEC chairman Gary Gensler said that a Bitcoin spot ETF is &#8220;going through the process right now,&#8221; stoking excitement that the January approval could be coming. Gensler insisted that the SEC is determined to protect investors even as it pushes for innovation, hinting that Grayscale&#8217;s court ruling has been the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-17T19:46:08.000Z",
    "title": "Breaking News: Galaxy Fox Hits $1 Million in Funding; Could it Be the Next Dogecoin?",
    "url": "https://www.crypto-news-flash.com/breaking-news-galaxy-fox-hits-1-million-in-funding-could-it-be-the-next-dogecoin/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-news-galaxy-fox-hits-1-million-in-funding-could-it-be-the-next-dogecoin",
    "description": "<img width=\"512\" height=\"512\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-17T223821.225.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-17T223821.225.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-17T223821.225-300x300.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-17T223821.225-150x150.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-17T223821.225-24x24.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-17T223821.225-48x48.png 48w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-2023-12-17T223821.225-96x96.png 96w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Things have been exciting in the crypto world recently. Markets are ripping, memecoins are printing multiples daily, and presale funding is on a one-way super-highway to the moon. The bull market is in full gear, and a new class of crypto millionaires will be made in the next 18 months. The only question is – [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-17T19:45:21.000Z",
    "title": "1,000,000,000 Jupiter (JUP) Tokens To Be Airdropped to Solana Wallets in January, According to Founder",
    "url": "https://dailyhodl.com/2023/12/17/1000000000-jupiter-jup-tokens-to-be-airdropped-to-solana-wallets-in-january-according-to-founder/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/11/6-airdrops.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/11/6-airdrops.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/11/6-airdrops.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/11/6-airdrops.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/11/6-airdrops.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/11/6-airdrops.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/11/6-airdrops.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The Solana (SOL)-based decentralized exchange (DEX) Jupiter (JUP) will be airdropping a billion of its tokens early next year, according to its founder. Jupiter&#8217;s founder, who pseudonymously goes by Meow, says on the social media platform X that out of the 10 billion JUP tokens that will eventually be minted, half of them will go [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/17/1000000000-jupiter-jup-tokens-to-be-airdropped-to-solana-wallets-in-january-according-to-founder/\">1,000,000,000 Jupiter (JUP) Tokens To Be Airdropped to Solana Wallets in January, According to Founder</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]