[
  {
    "source": "Cointelegraph",
    "date": "2023-10-03T00:55:44.000Z",
    "title": "Ethereum futures ETFs garner lukewarm reception on first day of trading",
    "url": "https://cointelegraph.com/news/ethereum-futures-etfs-launch-low-volume-trading-first-day",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/93702d99-ac96-47e9-b2a3-ca6430271f4e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Day one trading volume across all nine products stood at less than $2 million.</p>\n                    <p><p>The rush of excitement that accompanied the launch of nine new Ethereum futures exchange-traded funds (ETFs) appears to have yielded little in the way of investment dollars in comparison.</p><p>On Oct. 2, nine new ETF products, which are designed to track futures contracts tied to the value of Ethereum’s native currency Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) arrived on the market. Of these funds only five hold exclusively Ether futures, while the other four track a mixture of Bitcoin and ETH futures contracts. </p><p>“Pretty meh day of volume,” wrote senior Bloomberg ETF analyst Eric Balchunas on X (formerly known as Twitter) on Oct. 2.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Unprecedented day today with multiple ETFs all launching at same time. No clear winner has emerged, all of them were pretty average, lower than I would have predicted, but its a long run and remember, these hold futures (ETF investors much prefer physical to derivatives) <a href=\"https://t.co/fKGOv8T7pP\">https://t.co/fKGOv8T7pP</a></p>&mdash; Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1708953284495708559?ref_src=twsrc%5Etfw\">October 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In total, all nine ETFs witnessed less than $2 million worth of trading volume as of midday EST on the first day of trading. </p><p>The most popular of the futures ETF products was Valkyrie's BTF — which tracks a combination of Bitcoin and Ether — racking up a total of $882,000 worth of volume.</p><p>It’s worth noting that BTF had already been trading as a Bitcoin-only futures ETF since Oct. 2021, but adjusted its strategy to include ETH. </p><p>The first-day trading volume of the Ether ETFs paled in comparison to that of ProShares Bitcoin Strategy ETF (BITO), which debuted in October 2021 during a roaring market for crypto assets. BITO witnessed more than $1 billion in trading volume on its first day.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/van-eck-ethereum-strategy-etf-launches-cboe\"><strong><em>VanEck Ethereum Strategy ETF set for CBOE listing</em></strong></a></p><p>However, Balchunas noted that compared to a regular traditional finance ETF launch, the volume witnessed was actually “quite a lot,” though investors tend to prefer spot ETF products over futures.</p><p>Balchunas explained that all of the products were scheduled for launch on the same day as the SEC wanted to prevent any one fund from gaining market domination.</p><p>Meanwhile, while a range of United States firms jostled for pole position in the nascent Ether futures market, ETF firm Volatility Shares <a href=\"https://cointelegraph.com/news/volatility-shares-cancels-etheruem-eth-etf-futures-launch\">canceled its plans to list a similar product</a>, saying that it “didn’t see an opportunity” at the current time.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-03T01:00:28.000Z",
    "title": "Is Your Crypto at Risk? FBI Issues Dire Warning Over ‘Phantom Hacker’",
    "url": "https://www.newsbtc.com/crypto/is-your-crypto-at-risk-fbi-issues-dire-warning-over-phantom-hacker/",
    "description": "As the crypto market continues to attract substantial investments, it has also witnessed a surge in scams and fraudulent activities. Regulatory institutions worldwide, spearheaded by the United States, seem to intensify their efforts to combat cyber threats, hacks, and frauds that affect the industry.  However, the nascent sector is far from the only one suffering from increasing cyber threats. Since 2020, these attacks have been common both within the crypto space and outside. In line with this, the Federal Bureau of Investigation (FBI) identified a new threat dubbed &#8220;The Phantom Menace.&#8221; The FBI issued a warning on September 29, alerting the public about the escalating &#8220;Phantom Hacker&#8221; scams, particularly affecting senior citizens.  FBI Warns Of &#8216;Phantom Hacker&#8217; Scams Targeting Crypto The FBI&#8217;s statement revealed that the &#8220;Phantom Hacker&#8221; scam is an evolution of traditional tech support scams, employing imposter tech support, fraudulent exchange account support, and government personas to gain victims&#8217; trust. This multi-layered approach helps scammers identify lucrative accounts to target.  Related Reading: XRP Price Bloodbath On The Horizon? Report Casts Doubt On Recent Rally From January to June 2023, the FBI Internet Crime Complaint Center (IC3) received over 19,000 complaints about tech support and crypto scams, resulting in estimated losses exceeding $542 million. Losses have already surpassed 2022 figures by 40% as of August 2023. The Scam Phases: In the initial phase of the scam, fraudsters adopt the guise of tech or customer support representatives from legitimate companies. They reach out to their victims through various communication channels and employ persuasive tactics to convince them to call a designated number for assistance. Once victims are connected, scammers manipulate them into downloading software that grants remote access to their computers. By fabricating a fictitious virus scan, scammers deceive victims into believing their computers have been compromised or are at risk. Subsequently, they coax victims into opening their financial accounts, allowing scammers to identify the most lucrative targets. Upon successfully gaining access to victims&#8217; financial accounts, scammers proceed to the second phase of the scam. In this stage, they assume the role of representatives from reputable financial institutions such as banks or brokerage firms. The scammers falsely inform victims that foreign hackers have compromised their computers and accounts. To ensure the safety of victims&#8217; funds, they instruct victims to transfer their money to a purportedly &#8220;secure&#8221; third-party account, often claiming an affiliation with recognized entities like the Federal Reserve or other US government agencies. These transfers typically involve wire transfers, cash, or even cryptocurrencies, with the funds predominantly sent overseas. Scammers coerce victims into maintaining secrecy regarding the true purpose of these transfers. Rise In Ransomware Attacks In contrast with the alarming rise of &#8220;Phantom Hacker&#8221; scams, a Chainalysis report indicates an overall decline in cryptocurrency-related crime in 2023. Cumulative daily inflows to known illicit entities have decreased by 65% compared to the same period in 2022.  Notably, scams have experienced the most significant decline, with scammers generating nearly $3.3 billion less revenue in 2023 than in 2022. However, the report highlights a concerning trend: ransomware attacks.  Ransomware attackers extorted $175.8 million more by June 2023 than during the same period in 2022, suggesting a reversal from the downward trend observed in 2022. Related Reading: Bitcoin MPI Forms Death Cross, End of The Rally? While overall crypto-related crime has declined, the resurgence of ransomware attacks poses a significant menace and could spill over to the nascent sector. While the number declines, the amount stolen in the crypto space urging users to remain cautious in the face of new threats.  Featured image from Shutterstock, chart from TradingView.com"
  }
]