[
  {
    "source": "Cointelegraph",
    "date": "2023-11-01T08:51:07.000Z",
    "title": "Turkey aims to shed FATF gray list status with new crypto regulations",
    "url": "http://cointelegraph.com/news/turkey-seeks-shed-fatf-gray-list-status-crypto-regulations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/787adf87-236f-4d56-a884-fcb1e859ab59.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Finance Minister Simsek reportedly stated that the sole outstanding technical compliance matter is crypto assets.</p>\n                    <p><p>Turkey is reportedly drafting fresh regulations to govern crypto-assets in an effort to convince the Financial Action Task Force (FATF), an international organization responsible for combating financial crimes, to remove it from a “gray list” of nations that have not done enough to combat money laundering and terrorist financing.</p><p>Notably, the FATF placed Turkey on its gray list in 2021. According to a <a href=\"https://www.reuters.com/world/middle-east/turkey-toughen-law-crypto-assets-minister-2023-11-01/\" target=\"_blank\" rel=\"noopener nofollow\">report</a>, during a discussion with a parliamentary commission on Oct. 31, Turkish Finance Minister Mehmet Simsek mentioned that a FATF report determined that Turkey adhered to all but one of the 40 standards set by the watchdog.</p><p>Finance Minister Simsek reportedly stated that the sole outstanding matter for technical compliance is related to crypto assets. He cited plans to propose a crypto-assets law to parliament, aiming to exit the gray list, pending any political factors. No specifics on the legal changes were provided.</p><p>The FATF, established by the G7 advanced economies to safeguard the international financial system, cautioned Turkey in 2019 about significant deficiencies. These included the necessity to enhance procedures for freezing assets associated with terrorism and the proliferation of weapons of mass destruction.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-price-all-time-highs-across-argentina-nigeria-turkey\"><strong><em>Bitcoin price hits all-time highs across Argentina, Nigeria and Turkey</em></strong></a></p><p>Nevertheless, the Turkish Presidential Annual Program for 2024, released on Oct. 25 in the Official Gazette of the Republic of Turkey, <a href=\"https://cointelegraph.com/news/turkey-plans-craft-crypto-framework-2024\">sets the objective of completing cryptocurrency regulations in the country</a> by the end of 2024. Article 400.5, found within the comprehensive 500-page document, outlines the intended efforts to establish clear definitions for crypto assets, potentially subject to taxation in the future. </p><p>The document also intends to legally define crypto asset providers like cryptocurrency exchanges. However, it does not provide further specifics on the upcoming regulatory framework. By December 2022, the Central Bank of the Republic of Turkey had <a href=\"https://cointelegraph.com/news/turkey-s-central-bank-completes-first-cbdc-test-with-more-to-come-in-2023\">successfully conducted the initial trial of its digital currency,</a> the digital lira. It has expressed intentions to pursue further testing into 2024.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/cuba-bitcoin-revolution-adoption-embargo/\"><strong><em>The Truth Behind Cuba’s Bitcoin Revolution. An on-the-ground report</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-01T08:58:21.000Z",
    "title": "Frax Finance regains control over domains after potential security breach, investigation underway",
    "url": "https://cryptoslate.com/frax-finance-regains-control-over-domains-after-potential-security-breach-investigation-underway/",
    "description": "<p>In a swift resolution of a potentially disruptive issue, Frax Finance, the decentralized stablecoin project, has regained control over its primary domains, as reported by the company&#8217;s Founder, Sam Kazemian, on his X feed. The initial concern was raised by Kazemian through a post on Oct. 31, urging users to refrain from using frax.finance and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/frax-finance-regains-control-over-domains-after-potential-security-breach-investigation-underway/\">Frax Finance regains control over domains after potential security breach, investigation underway</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-01T08:42:40.000Z",
    "title": "Deribit experiences substantial capital inflows, the largest since Luna debacle",
    "url": "https://cryptoslate.com/insights/deribit-experiences-substantial-capital-inflows-the-largest-since-luna-debacle/",
    "description": "<p>Quick Take The crypto landscape recently highlighted an intriguing pattern in capital inflow, with crypto exchanges Deribit and Crypto.com registering their largest inflows this year. In particular, Deribit recorded a significant inflow of around $34M yesterday, Oct. 31, a development underpinned by large withdrawals by so-called &#8216;crypto whales.&#8217; This is not an isolated event. A [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/deribit-experiences-substantial-capital-inflows-the-largest-since-luna-debacle/\">Deribit experiences substantial capital inflows, the largest since Luna debacle</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-01T08:54:46.000Z",
    "title": "Polkadot firm, dYdX launches on Cosmos while Everlodge investors are bullish",
    "url": "https://crypto.news/polkadot-firm-dydx-launches-on-cosmos-while-everlodge-investors-are-bullish/",
    "description": "Everlodge bulls expect more price gains as ELDG presale progresses. Polkadot firm while dYdX deploys on Cosmos"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-01T08:47:30.000Z",
    "title": "Various crypto scams cost users over $32m in October",
    "url": "https://crypto.news/various-crypto-scams-cost-users-over-32m-in-october/",
    "description": "According to blockchain analysis firm CertiK, over $32.2 million was lost to crypto scams and security incidents in October, with vulnerabilities, exit scams, and flash loan manipulations among the leading causes. In October alone, more than $32.2 million in user&#8230;"
  }
]