[
  {
    "source": "NewsBTC",
    "date": "2023-06-15T04:02:33.000Z",
    "title": "Ethereum Price Resumes Downtrend As Bears Aim $1,500",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-resumes-downtrend-1500/",
    "description": "Ethereum price is showing bearish signs below $1,700 against the US Dollar. ETH could continue to move down below the $1,600 level. Ethereum is down 5% and there was a move below the $1,720 support. The price is trading below $1,700 and the 100-hourly Simple Moving Average. The bears struggle near a key bearish trend line with resistance near $1,740 on the hourly chart of ETH/USD (data feed via Kraken). The pair could struggle to recover above the $1,680 and $1,700 resistance levels. Ethereum Price Dives 5% Ethereum’s price failed to gain pace for a move above the $1,780 resistance. ETH reacted to the downside below the $1,720 support after the Fed interest rate decision, similar to Bitcoin. There was a clear move below the $1,700 and $1,640 support levels. The price declined over 5% and traded close to $1,630. A low is formed near $1,630 and the price is now consolidating losses. It is trading below $1,700 and the 100-hourly Simple Moving Average. There is also a key bearish trend line forming with resistance near $1,740 on the hourly chart of ETH/USD. Immediate resistance is near the $1,660 level or the 23.6% Fib retracement level of the recent drop from the $1,749 swing high to the $1,630 low. The next major resistance is near the $1,680 level. The first major resistance is near $1,700 or the 61.8% Fib retracement level of the recent drop from the $1,749 swing high to the $1,630 low. A proper move above the $1,680 and $1,700 resistance levels might start a steady recovery wave. Source: ETHUSD on TradingView.com The next resistance sits near $1,740 and the trend line, above which Ethereum could rise toward the $1,780 level. Any more gains above the $1,780 resistance zone might send the price toward the $1,850 resistance. More Losses in ETH? If Ethereum fails to clear the $1,700 resistance, it could continue to move down. Initial support on the downside is near the $1,630 level and the recent low. The next major support is near the $1,600 level. If there is a break and close below the $1,600 support, the price could accelerate lower toward the $1,550 support. Any more losses may perhaps send the price toward the $1,500 zone. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,600 Major Resistance Level – $1,700"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-15T03:40:31.000Z",
    "title": "Web 3.0 Gaming Isn’t Just About Asset Ownership – It’s Much Bigger",
    "url": "https://dailyhodl.com/2023/06/14/web-3-0-gaming-isnt-just-about-asset-ownership-its-much-bigger/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/web3-altcoin-inks-deal.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/web3-altcoin-inks-deal.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/web3-altcoin-inks-deal.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/web3-altcoin-inks-deal.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/web3-altcoin-inks-deal.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/web3-altcoin-inks-deal.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/web3-altcoin-inks-deal.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>People think they know the value of Web 3.0 gaming – that it&#8217;s all about users owning their own in-game assets as non-fungible tokens (NFTs). This view is the most common misperception in the space, and it’s flat-out wrong. Ownership matters, but limiting the value of Web 3.0 gaming to ownership misses the full picture [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/14/web-3-0-gaming-isnt-just-about-asset-ownership-its-much-bigger/\">Web 3.0 Gaming Isn’t Just About Asset Ownership – It’s Much Bigger</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]