[
  {
    "source": "Bitcoin.com",
    "date": "2023-06-17T19:30:59.000Z",
    "title": "Tesla’s Elon Musk Denies Dogecoin Whale Allegations, Attorney Challenges Wallet Associations",
    "url": "https://news.bitcoin.com/teslas-elon-musk-denies-dogecoin-whale-allegations-attorney-challenges-wallet-associations/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/doge-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Tesla&#039;s Elon Musk Denies Dogecoin Whale Allegations, Attorney Challenges Wallet Associations\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/doge-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/doge-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/doge-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/doge-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/doge-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/doge-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/doge.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to a recent letter viewed by the press, Elon Musk denies being a dogecoin (DOGE) whale in the lawsuit that accuses the Tesla executive of engaging in pump-and-dump activities with the meme coin token, which allegedly harmed retail investors. Musk&#8217;s attorney, Alex Spiro, stated in a written communication to the plaintiff&#8217;s lawyer that the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-17T19:34:50.000Z",
    "title": "UBS CEO is confident about his company’s future",
    "url": "https://www.cryptopolitan.com/ubs-ceo-is-confident-about-companys-future/",
    "description": "The Swiss banking industry is on the precipice of a significant transformation as UBS, one of the country&#8217;s banking giants, seals its historical acquisition of former competitor, Credit Suisse. In the wake of the deal, UBS CEO Sergio Ermotti took it upon himself to bolster confidence in his organization and reassure Swiss stakeholders of its ... <a title=\"UBS CEO is confident about his company&#8217;s future\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ubs-ceo-is-confident-about-companys-future/\" aria-label=\"More on UBS CEO is confident about his company&#8217;s future\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-17T19:31:37.000Z",
    "title": "XRP now accepted for gas on cutting-edge EVM-compatible blockchain",
    "url": "https://www.cryptopolitan.com/xrp-now-accepted-for-gas-on-cutting-edge-evm-compatible-blockchain/",
    "description": "The XRP Ledger and blockchains in the Ethereum Virtual Machine (EVM) ecosystem have long-faced interoperability challenges. However, a solution may be on the horizon, as a crypto educator and well-known XRPL enthusiast, Dip Collector, sheds light on Root Network&#8217;s ambitious plan to address this issue. Root Network, a forthcoming cross-chain network, aims to leverage Polkadot&#8217;s ... <a title=\"XRP now accepted for gas on cutting-edge EVM-compatible blockchain\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-now-accepted-for-gas-on-cutting-edge-evm-compatible-blockchain/\" aria-label=\"More on XRP now accepted for gas on cutting-edge EVM-compatible blockchain\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-17T19:28:15.000Z",
    "title": "Kenya’s president really just hates the US dollar",
    "url": "https://www.cryptopolitan.com/kenya-president-really-hates-the-us-dollar/",
    "description": "Kenya&#8217;s President, William Ruto, a firm advocate for local currency reliance in Africa, intensifies his campaign against the dollar. The message is clear: it&#8217;s high time African nations abandon the use of the currency in cross-border trade and embrace their national currencies. Afreximbank: A tool for currency liberation Ruto&#8217;s conviction is not just theoretical but ... <a title=\"Kenya&#8217;s president really just hates the US dollar\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kenya-president-really-hates-the-us-dollar/\" aria-label=\"More on Kenya&#8217;s president really just hates the US dollar\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-17T19:26:34.000Z",
    "title": "Binance inks metaverse collaboration with The Weeknd",
    "url": "https://www.cryptopolitan.com/binance-metaverse-collaboration-the-weeknd/",
    "description": "Cryptocurrency exchange giant Binance and pop artist The Weeknd have joined forces to introduce a unique online space called the “Metaverse Dimension,” as part of their ongoing collaboration. This new venture aims to offer users an immersive experience, combining elements of gaming, art, and exclusive rewards, and bringing The Weeknd’s creative world to life in ... <a title=\"Binance inks metaverse collaboration with The Weeknd\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-metaverse-collaboration-the-weeknd/\" aria-label=\"More on Binance inks metaverse collaboration with The Weeknd\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-17T19:18:25.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-17T19:17:02.000Z",
    "title": "Twitter’s transformation strategy is not that impressive",
    "url": "https://www.cryptopolitan.com/twitter-strategy-is-not-that-impressive/",
    "description": "Twitter&#8217;s aspiration to rejuvenate its business extends beyond just digital advertising, as it eyes the expansive horizons of video, creator, and commerce collaborations. However, the grandeur of this vision might not match up to the reality on the ground, raising questions about the platform&#8217;s true potential. Twitter&#8217;s reliance on digital advertising Linda Yaccarino, the newly ... <a title=\"Twitter&#8217;s transformation strategy is not that impressive\" class=\"read-more\" href=\"https://www.cryptopolitan.com/twitter-strategy-is-not-that-impressive/\" aria-label=\"More on Twitter&#8217;s transformation strategy is not that impressive\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-17T19:10:19.000Z",
    "title": "Hedge funds and trading firms are terrified of AI",
    "url": "https://www.cryptopolitan.com/hedge-funds-trading-firms-terrified-of-ai/",
    "description": "With the growing dominance of AI, hedge funds, and computer-driven trading entities are facing an increasingly complex battlefield. The prospect of this technology&#8217;s manipulation has triggered widespread concern within the sector, primarily after a fabricated image of a Pentagon explosion stirred a temporary sell-off in US stocks. The digitally manipulated image, circulated through a verified ... <a title=\"Hedge funds and trading firms are terrified of AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hedge-funds-trading-firms-terrified-of-ai/\" aria-label=\"More on Hedge funds and trading firms are terrified of AI\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-17T19:22:52.000Z",
    "title": "Bitcoin Recovers Above Critical Level, Why Bulls Could Be Ready To Charge",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-recovers-above-critical-level-2023/",
    "description": "Bitcoin CME Futures BTC1 front month continuous contract price action closes over the weekend, making Friday evening the closing bell for the week. This Friday&#8217;s close saw price recover above a crucial level that in the past led to a bullish impulse in crypto. Here is a closer look at why bulls could be ready to charge in the coming weeks. Using BTC CME Futures As A Crypto Crystal Ball Large institutional traders don&#8217;t just trade spot BTCUSD, nor do they trade on Binance, ByBit, or another crypto platform. When they want to speculate and trade using derivatives contracts, they look to the Chicago Mercantile Exchange, better known as CME Group. Unlike the 24/7, always-on crypto market, CME Group charts close down for the weekend and holidays much like stocks. Due to this behavior, the chart often features gaps that don&#8217;t appear on standard BTCUSD price charts. Discrepancies between BTC CME Futures charts and BTCUSD charts can lead to fakeouts and shakeouts. Related Reading: One Coin, Two Trades: Why Bitcoin Futures And Spot Signals Don’t Match Up Because Bitcoin CME Futures does stop on Friday for the weekend, it also can provide early clues as to how spot price charts might close on Sunday night. In this case, BTC Futures has reclaimed the Bollinger Band basis line, often referred to as the &#8220;mid-BB&#8221;. Is the third time the charm? &#124; BTCUSD on TradingView.com Bitcoin Price Recovers Above The Bollinger Band Basis Line The basis line on the Bollinger Bands is a 20-period simple moving average. The tool&#8217;s creator, John Bollinger, then adds an upper and lower band set at two standard deviations of the SMA. This causes the bands to expand and contract with market volatility. Like any moving average, it can act as dynamic support and resistance, holding up price action or preventing it from pushing along further. Following this Friday&#8217;s BTC Futures weekly close, Bitcoin has made it back above the mid-BB, possibly confirming it as support. Related Reading: Bitcoin “Throwback” Could Trigger Flawless Technical Bottom Formation In the upper portion of the chart above, Bitcoin goes on an impulsive uptrend after holding above the basis line in 2019 and 2020. The lower portion depicts a closer look at this latest weekly close. Unless there is a massive collapse before Sunday night, BTCUSD technicals should follow suit. And if history repeats, a bull run could follow. Is Bitcoin ready for a strong rally higher after reclaiming the key level as support? This chart was featured in issue #8 of CoinChartist (VIP) alongside a dozen other exclusive crypto charts. Click here to learn more. Tony is the author of the CoinChartist (VIP) newsletter. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  }
]