[
  {
    "source": "Cointelegraph",
    "date": "2023-05-30T21:30:00.000Z",
    "title": "Researchers propose new scheme to help courts test deanonymized blockchain data",
    "url": "https://cointelegraph.com/news/researchers-propose-new-scheme-to-help-courts-test-deanonymized-blockchain-data",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/712fe4c5-ce2e-4268-bd9e-7e4a0c88c8e4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A team of researchers proposed five “argumentative schemes” designed to protect the rights of crypto crime suspects while also helping investigators. </p>\n                    <p><p>A team of researchers from Friedrich-Alexander-Universität Erlangen-Nürnberg recently published a paper detailing methods investigators and courts can use to determine the validity of deanonymized data on the Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) blockchain.</p><p>The team’s preprint paper, “Argumentation Schemes for Blockchain Deanonymization,” <a href=\"https://arxiv.org/pdf/2305.16883.pdf\" target=\"_blank\" rel=\"noopener nofollow\">lays out</a> a blueprint for conducting, verifying and presenting investigations into crimes involving cryptocurrency transactions. While the paper focuses on the German and United States legal systems, the authors state that the findings should be generally applicable. </p><p>Bitcoin-related <a href=\"https://cointelegraph.com/news/seizure-of-bitfinex-funds-is-a-reminder-that-crypto-is-no-good-for-money-launderers\">crime investigations revolve</a> around the deanonymization of suspected criminals, a process made more challenging by blockchains’ pseudonymous nature. Users conducting blockchain transactions are identified by wallets (unique software addresses) instead of legal names. </p><p>However, blockchains are inherently transparent. Whenever data is added to a blockchain ledger, the transaction is recorded and made available for anyone with access to the blockchain to see. </p><p>Investigators trying to determine who is behind a specific wallet use the information ensconced in blockchain transactions (blocks) as data points that, when combined, form a digital paper trail.</p><p>According to the research team, the current bottleneck when it comes to these investigations is no longer a technological one; it’s a legal issue. </p><p>Law enforcement agencies have access to the tools needed to conduct preliminary blockchain analysis, but these early data points represent circumstantial evidence.</p><p>This evidence relies on certain raw assumptions that can only be validated by connecting on-chain activity to off-chain activity, such as compelling an exchange to disclose the identity or bank account information of users suspected of criminal involvement. Per the paper: </p><blockquote>“In legal practice, those assumptions are critical for inferring the evidential value of the deanonymization of a perpetrator. However, no standard practice for deriving and discussing the reliability of those analysis results has been proposed yet.”</blockquote><p>If conducted properly, blockchain investigations can reveal the perpetrator of a crime. The researchers cite the Wall Street Market case as an example. There, U.S. Postal Service investigators identified the operator of an illegal dark web marketplace by connecting various data points that law enforcement officers corroborated through surveillance operations.</p><p><strong><em>Related: </em><a href=\"https://cointelegraph.com/news/german-police-seize-six-figures-in-crypto-from-suspects-involved-in-dark-web-site\"><em>German Police Seize Six Figures in Crypto From Suspects Involved in Dark Web Site</em></a></strong></p><p>However, the researchers state that such investigations risk impinging on suspects’ rights due to legal requirements. Prosecutors (in Germany and the U.S., per the paper) must demonstrate a certain degree of evidence of guilt before a warrant for invasive investigations, such as surveillance or arrests, be issued. </p><p>To aid investigators and prosecutors while also ensuring the law is applied fairly to suspects, the researchers propose a standard framework containing five argumentative schemes designed to ensure proper reporting and explanation throughout the legal process.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/bcefc281-8323-43c5-924b-181d81efc5ed.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Two of the schemes explored by researchers. Source: “Argumentation Schemes for Blockchain Deanonymization\"</em></figcaption></figure><p>The above image shows two of the schemes, each utilizing a set of defined premises to frame a specific conclusion and then providing a set of critical questions to assess the strength of the argument. </p><p>The researchers assert that “by utilising the schemes, an analyst can clearly articulate the employed heuristics, their individual strengths, and potential weaknesses. This increases the comprehensibility of such analyses and court proceedings for the decision makers, and also eases the documentation for later verification by an expert witness.”</p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-30T21:14:49.000Z",
    "title": "US CFTC issues letter on digital asset derivatives, clearing compliance in 3 areas",
    "url": "https://cointelegraph.com/news/us-cftc-issues-letter-on-digital-asset-derivatives-clearing-compliance-in-3-areas",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/8181bd59-200f-4f0f-82c7-a72e21ddbeb2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The letter is a reminder, but a highly specific one that is reminiscent of the SEC’s recent custody rule proposal in part. </p>\n                    <p><p>The United States Commodity Futures Trading Commission (CFTC) has issued a staff advisory letter to registered derivatives clearing organizations (DCOs) and DCO applicants, reminding them of the risks associated with expanding the scope of their activities. The letter from the CFTC Division of Clearing and Risk (DCR) specifically <a href=\"https://www.cftc.gov/LawRegulation/CFTCStaffLetters/letters.htm\" target=\"_blank\" rel=\"noopener nofollow\">addressed</a> digital assets.</p><p>Staff advisory letters can remind addressees of their legal obligations or provide clarity on those obligations. The “DCR expects DCOs and applicants to actively identify new, evolving, or unique risks and implement risk mitigation measures,” it said, continuing:  </p><blockquote>“Over the past several years, DCR has observed increased interest […] In expanding the types of products cleared and business lines, clearing models, and services offered by DCOs, including related to digital assets.” </blockquote><p>The DCR said it will emphasize compliance in three areas: system safeguards, conflicts of interest and physical deliveries. Systems safeguards require attention because of the “heightened cyber and other operational risks” associated with digital assets. Potential conflicts of interest were seen in “dependencies on affiliated entities or services (i.e., dual-hatted executives, shared systems and resources, etc.).” </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/cftc-proposes-reducing-anonymity-to-manage-risks\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cftc-proposes-reducing-anonymity-to-manage-risks/amp\">CFTC proposes reducing anonymity to manage risks</a></em></strong></p><p>“Physical delivery” is used in the letter in its technical sense to mean the transfer of ownership rights, that is, transferring digital assets from one account or wallet to another. This concern, in part, mirrors the U.S. Securities and Exchange Commission’s reported plans to propose a new rule that <a href=\"https://cointelegraph.com/news/sec-to-target-crypto-firms-operating-as-qualified-custodians-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-to-target-crypto-firms-operating-as-qualified-custodians-report/amp\">would impact crypto firms</a> serving as custodians of their clients’ assets. That proposal <a href=\"https://cointelegraph.com/news/war-on-crypto-newly-filed-letters-lambast-proposed-sec-custody-rules\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/war-on-crypto-newly-filed-letters-lambast-proposed-sec-custody-rules/amp\">brought on harsh criticism</a> in the crypto sector. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today the CFTC’s Division of Clearing and Risk issued a staff advisory on the risks associated with expanding the reach of Derivatives Clearing Organizations (DCO) to clear digital assets. Learn more: <a href=\"https://t.co/9lEPMVXB1W\">https://t.co/9lEPMVXB1W</a></p>— CFTC (@CFTC) <a href=\"https://twitter.com/CFTC/status/1663583593757540359?ref_src=twsrc%5Etfw\">May 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Alexander Grieve, vice president of the Tiger Hill Partners communications firm, <a href=\"https://twitter.com/AlexanderGrieve/status/1663588028894281732\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> in a tweet that Bitnomial <a href=\"https://cointelegraph.com/news/bitnomial-has-new-permission-to-trade-btc-derivatives\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitnomial-has-new-permission-to-trade-btc-derivatives/amp\">has a DCO application</a> before the CFTC. LedgerX, recently purchased by MIAX from FTX, <a href=\"https://cointelegraph.com/news/miax-completes-acquisition-of-ftx-subsidiary-ledgerx\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/miax-completes-acquisition-of-ftx-subsidiary-ledgerx/amp\">is also a CFTC-regulated</a> clearinghouse. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\">Crypto regulation: Does SEC Chair Gary Gensler have the final say?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-30T21:17:39.000Z",
    "title": "Bybit becomes latest crypto exchange to exit Canada",
    "url": "https://cryptoslate.com/bybit-becomes-latest-crypto-exchange-to-exit-canada/",
    "description": "<p>Cryptocurrency exchange Bybit said May 30 that it intends to halt all services and products being offered in Canada until further notice due to the regulatory developments in the country. Bybit said Canadian nationals and residents of the country would no longer be able to open new accounts with the exchange starting May 31. &#8220;In [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bybit-becomes-latest-crypto-exchange-to-exit-canada/\">Bybit becomes latest crypto exchange to exit Canada</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-30T21:30:19.000Z",
    "title": "Critical Vulnerability in Tron’s Multisig Mechanism Exposed $500M in Digital Assets: Report",
    "url": "https://news.bitcoin.com/critical-vulnerability-in-trons-multisig-mechanism-exposed-500m-in-digital-assets-report/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/tronbug-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/tronbug-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/tronbug-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/tronbug-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/tronbug-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/tronbug-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/tronbug-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/tronbug.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to a report published by the cybersecurity research team known as 0d, a division of Dwallet Labs, researchers discovered a critical vulnerability in the Tron network&#8217;s native multi-sig mechanism. The cybersecurity experts explained that the vulnerability could have impacted more than $500 million worth of digital assets held in Tron multi-sig accounts. 0d specified [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-30T21:21:19.000Z",
    "title": "Liquity price analysis: Bears dominate LQTY market at $1.25",
    "url": "https://www.cryptopolitan.com/liquity-price-analysis-2023-05-30/",
    "description": "The most recent Liquity price analysis shows a bearish trend in the market. The selling pressure seems to be dominating the market as bears have pushed LQTY prices downward. The current trading point stands at $1.25, with a 24-hour decrease of 0.64%. The bulls were in control earlier as they had pushed the price up ... <a title=\"Liquity price analysis: Bears dominate LQTY market at $1.25\" class=\"read-more\" href=\"https://www.cryptopolitan.com/liquity-price-analysis-2023-05-30/\" aria-label=\"More on Liquity price analysis: Bears dominate LQTY market at $1.25\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-05-30T21:30:40.000Z",
    "title": "Is Bitcoin Poised For A Comeback To Higher Price Levels? Experts Weigh In",
    "url": "https://www.newsbtc.com/bitcoin-news/is-bitcoin-poised-for-a-comeback-to-higher-price-levels-experts-weigh-in/",
    "description": "Bitcoin (BTC), the largest cryptocurrency by market cap, is currently showing signs of a new momentum refresh and the beginning of a newly formed bull run. Market analyst Justin Bennet accurately predicted this move, citing recent range highs and a cluster of short liquidations in the $27,500 area. However, Bennet suggests an expected market between $27,500 and $28,250. He further claimed:  Bitcoin&#8217;s pullback today is not surprising, given the aggressiveness of the weekend rally. The pullback will remain constructive as long as Bitcoin can stay above $27,500 on a 4-hour and daily closing basis. Related Reading: Can This THORChain New Feature Push Back RUNE Bears? Is Bitcoin On The Verge Of Reaching $30,000 Again? Furthermore, Bennet suggests a sustained break below Bitcoin’s current trading area would confirm a deviation and expose the Chicago Mercantile Exchange (CME) gap at $26,900. To understand what a CME gap is, it&#8217;s important to know that Bitcoin futures are traded on the Chicago Mercantile Exchange. When the CME closes for the weekend, there can be price movements in Bitcoin that are not reflected in the futures market. This can create a gap between the Friday close and Monday open on the CME chart, known as a CME gap. However, Bitcoin is trading above a key resistance level, as indicated by the 50-day Moving Average (MA), noted in the chart below by the brown line. This level could support Bitcoin in the short term and prevent further price drops in the $27,440 area. It remains to be seen if Bitcoin can consolidate above this key indicator and maintain its momentum. If it successfully manages to do so, the next target could be to consolidate above $28,000 and break out of the current range, as suggested by analyst Justin Bennet. This could pave the way for Bitcoin to reconquer the $30,000 level.  BTC Could Reach $300,000 Or Drop To $3,000 Moreover, Bitcoin&#8217;s volatility has been compressing over time, according to trader Jackis, who believes this compression could lead to a significant price movement in 2024. He predicts that once Bitcoin leaves this compression phase in 2024, it could drop to $3,000 or soar to $300,000. Jackis further claimed that this potential price movement could mark the next stage of Bitcoin&#8217;s evolution, as it moves from the &#8220;Early adopters&#8221; phase to the &#8220;Vast majority&#8221; stage. As more individuals and institutions adopt Bitcoin, its price and volatility will likely be impacted. However, according to Glassnode co-founder James Check, the headwinds that have kept Bitcoin&#8217;s price under $30,000 include the strength of the US Dollar (DXY), a bounce in interest rates, and the risk of further Federal Reserve interest rate hikes. Nonetheless, he believes that the market may be about to turn and that Bitcoin may be poised for a rally. While the Nasdaq has been used as an indicator of Bitcoin&#8217;s potential rally, the Glassnode co-founder believes other factors are at play. He sees a potential turn in the DXY at levels of 106-107, potentially leading to a reversal in interest rates. The US Dollar Index measures the value of the US Dollar against a basket of other currencies. A stronger DXY can be seen as a headwind for Bitcoin, making the cryptocurrency relatively more expensive for holders of other currencies. Related Reading: Rare Crypto Signal Emerges That Could Spark Another 2017-Style Boom However, the Glassnode co-founder believes that the DXY may be nearing a potential turn, which could provide a tailwind for Bitcoin. Additionally, a reversal in interest rates could also provide a boost to Bitcoin&#8217;s price. Featured image from iStock, chart from TradingView.com"
  }
]