[
  {
    "source": "Decrypt",
    "date": "2023-08-09T19:55:00.000Z",
    "title": "Web3 Games Need to Compete with All Games, Says Solana Foundation GM",
    "url": "https://decrypt.co/videos/interviews/Ud9wTd4s/web3-games-need-to-compete-with-all-games-says-solana-foundation-gm",
    "description": "Solana Foundation's General Manager of Games Johnny Lee tells Decrypt's Jason Nelson about Solana's PlayGG conference and shares his take on crypto gaming and the \"play-to-earn\" concept."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-09T19:54:43.000Z",
    "title": "Meet the Company Building AI Fighter Jets for the U.S. Military",
    "url": "https://decrypt.co/151902/ai-unmanned-fighter-jets-uncrewed-military-valkyrie-xq-58a",
    "description": "Kratos Defense aims to redefine air combat and usher in a new era of AI-enhanced flight."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-09T19:45:55.000Z",
    "title": "Ethereum's Vitalik Buterin: Crypto Community Never Really Respected Sam Bankman-Fried",
    "url": "https://decrypt.co/151927/vitalik-buterin-sam-bankman-fried-ai-hollywood",
    "description": "He also said that the impact on AI on jobs is both terrible and amazing."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-09T20:00:00.000Z",
    "title": "Bitcoin’s Lightning Network is growing, but there are still three major challenges",
    "url": "https://cointelegraph.com/news/bitcoins-lightning-network-major-challanges",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/47c2ab7b-08dd-4201-a077-8f8a6769c588.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Lightning Network is growing, but liquidity issues and a need for greater user awareness continue to hinder mainstream adoption.</p>\n                    <p><p>The Lightning Network is a second-layer solution built on top of the Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) blockchain and its primary objective is to address the Bitcoin network’s scalability issues. It also allows for faster and cheaper transactions by facilitating off-chain payments through a network of payment channels. </p><p>The Lightning Network has gained traction since its launch in 2018, hitting a total value locked (TVL) of $140 million, but this is relatively small compared to Bitcoin's $580 billion market capitalization. However, this oversimplification disregards that this scaling solution focuses on instant transactions, not lending, yield farms or other activities that require staking.</p><p>Additionally, the number of nodes grew by a mere 6% since June 2022. This suggests that there are significant reasons why it has not achieved mainstream adoption. Let’s take a look at a few of the factors influencing Lightning Network growth. </p><h2>Channel balancing, finding liquidity and the associated costs impact network growth </h2><p>If a Lightning Network user wishes to make a payment that exceeds their channel balance, they must find a well-funded node with a direct channel to the recipient to facilitate the transaction. This process can be challenging and time-consuming, especially if the recipient is not well-connected within the Lightning Network.</p><p>Channel balancing requires users to manage the funds in their channels effectively. Rebalancing is automatic when using apps like the Phoenix or Breeze, but it adds complexity for mid level users relying on their own nodes. <a href=\"https://viktorbunin.medium.com/lightning-for-those-who-havent-checked-in-on-it-in-a-while-776a1d8daebe\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to Viktor Bunin, protocol specialist at Coinbase Cloud:</p><blockquote>“This capital inefficiency at the edges for non-custodial users is a hard and annoying optimization problem, and it’s objectively worse than an account-based model with arbitrary transaction sizing. However, it’s not an unworkable problem.”</blockquote><p>Besides the issue of optimizing the channels’ funding, there is also the associated costs of opening and closing channels as it requires an on-chain transaction. That can create serious issues if the median fee surpasses $5 or $10, which would drastically limit the use for the lower-income population and disincentive the network capillarity.</p><h2>The risk of development hiccups could be pushing potential users away</h2><p>The Lightning Network is still under development, meaning it still faces certain security risks. One concern is that if a node goes offline, it becomes unable to process payments through the channels it is connected to. This disrupts the payment process until the node comes back online, potentially causing an inconvenience for users.</p><p>Coinbase Cloud’s Viktor Bunin highlights that there are no offline methods for Lightning payments, but non-custodial wallets offer “clever workarounds'' using background tasks in mobile devices. Still, this solution might present constraints if the device’s operating system limits the performance to preserve battery power.</p><p>Double-spending is a risk on any blockchain-based system, including the Lightning Network. This attack could emerge from a node being offline for too long, subsequently providing an incorrect state and returning coins to the other party. This risk emerges only if the user is not active to inform the ‘justice transaction’, or hasn’t set up ‘watchtowers’ to prove that a fraud is being committed when a channel closing is requested. </p><h2>Dragging merchant adoption and user awareness</h2><p>The widespread adoption of any payment system requires acceptance by a large number of merchants and high user awareness. However, the Lightning Network faces challenges in both areas.</p><p>Merchant adoption is limited due to complexities in integrating the Lightning Network into existing payment systems, concerns about Bitcoin's price volatility, and regulatory uncertainties. On the other hand, efforts are being made to increase merchant adoption through user-friendly point-of-sale systems and partnerships with payment processors.</p><p>For instance, Zeus and OpenNode are popular wallets that offer a user-friendly point-of-sale app for merchants. The app allows merchants to accept Lightning Network payments with a QR code or NFC scan.</p><p>Additionally, user awareness about the Lightning Network's benefits and usage is still relatively low. Educating users about the advantages and ease of Lightning payments is essential to overcome this limitation.</p><h2>What is the future of the Bitcoin Lightning Network?</h2><p>Besides the more obvious problems cited, including channel rebalancing and security risks, developers are working on payments that can be made when the receiver is offline, known as asynchronous (async).</p><p>An important milestone for this Bitcoin’s scaling solution has been its <a href=\"https://cointelegraph.com/news/binance-integration-bitcoin-btc-lightning-network\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-integration-bitcoin-btc-lightning-network/amp\">integration by Binance exchange</a> in July. The reduced fees for withdrawal are a major selling point in comparison to wrapped Bitcoin options available on competing blockchains. Coinbase CEO Brian Armstrong confirmed in August that the exchange is also <a href=\"https://cointelegraph.com/news/bitcoin-lightning-on-coinbase-agenda-brian-armstrong-to-jack-dorsey\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-lightning-on-coinbase-agenda-brian-armstrong-to-jack-dorsey/amp\">looking forward to implementing Bitcoin’s Lightning network</a>.</p><p>This second layer scaling solution holds immense potential to enhance Bitcoin's transaction efficiency and scalability. As the technology matures and efforts are made to address these issues, the scaling solution may eventually gain broader acceptance and increased adoption.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p>\n\n\n</p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-09T20:00:48.000Z",
    "title": "FTX’s Sam Bankman-Fried to Face Campaign Finance Charge, Prosecutors Say",
    "url": "https://news.bitcoin.com/ftxs-sam-bankman-fried-to-face-campaign-finance-charge-prosecutors-say/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbf-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"FTX’s Sam Bankman-Fried to Face Campaign Finance Charge, Prosecutors Say\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbf-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbf-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbf-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbf-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbf-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbf-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbf-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Founder of failed crypto exchange FTX, Sam Bankman-Fried, will be held accountable for alleged campaign finance violations, U.S. prosecutors indicated on Tuesday. The charge was dropped earlier because the extradition treaty with the Bahamas prevents adding further charges without prior permission from the other side. Sam Bankman-Fried to Be Charged With Campaign Finance Violations Next [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-09T20:02:31.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and platform they need to build blockchain solutions. At this time, we can only make educated guesses about ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-09T20:04:17.000Z",
    "title": "Fantom’s DEX, SpiritSwap, folding after Multichain hack",
    "url": "https://crypto.news/fantoms-dex-spiritswap-folding-after-multichain-hack/",
    "description": "SpiritSwap, a decentralized exchange (DEX) on Fantom, will cease operations from Sep.1, weeks after the Multichain hack"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-09T19:46:55.000Z",
    "title": "EOS Network Foundation urges community to reject $22 million settlement offer",
    "url": "https://crypto.news/eos-network-foundation-urges-community-to-reject-22-million-settlement-offer/",
    "description": "The EOS Network Foundation (ENF) advises community members to carefully consider opting out of the $22 million settlement with B1 as the deadline approaches"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-09T20:00:29.000Z",
    "title": "Cardano-Native MuesliSwap To Refund Users After “Slippage” Misunderstanding",
    "url": "https://www.newsbtc.com/news/defi/cardano-native-muesliswap-to-refund-users-after-slippage-misunderstanding/",
    "description": "MuesliSwap, a decentralized exchange (DEX) on the Cardano network, has announced its decision to reimburse its users that have been affected by high slippage over the past year. This is in response to the recent questions faced by the protocol on its slippage feature. Slippage refers to the price difference between when a transaction order is submitted and when the transaction is executed by the market maker and confirmed on the blockchain. MuesliSwap Acknowledges Lack Of “Adequate Clarity”  In a post on X (formerly Twitter), the team behind MuesliSwap admitted that it failed to provide “adequate clarity” on the slippage feature within its decentralized exchange. Users have had to pay high slippage due to the manner in which the protocol’s matchmaker was designed.  Related Reading: Is Curve DAO (CRV) Price On Track To Reach Or Exceed $1 This Month? The MuesliSwap team explained in the post: Our decentralized matchmaker setup allowed each matchmaker to fill the limit order and choose whether to return the additional slippage amount or retain the difference at their discretion. MuesliSwap claims this difference has served as an incentive for the matchmakers since the beginning. To further clarify, the protocol’s team said this “supplementary matchmaker incentive” pushes the decentralized matchmaker to prioritize users’ orders during periods of high market volatility. However, it acknowledged that pushing this under the unclear term “slippage” may have confused new users. 📣 Clarifying Slippage on MuesliSwap: We want to address confusion about advanced matchmaker slippage on our platform. Quick heads-up: This impacts only a handful of users so please be careful about what others state on Twitter. 🔍 1️⃣ Trades through the MuesliSwap DEX aggregator… pic.twitter.com/SBpBZUWxnb — MuesliSwap Team🥛 (@MuesliSwapTeam) August 8, 2023 In a bid to rectify the situation, the MuesliSwap team disclosed that it would be refunding users who were affected by the high slippage on the protocol’s pools in the last 12 months. The team claims that the funds for users’ reimbursement will come from the “project funds”. Additionally, MuesliSwap said that a comprehensive analysis of all trades will be carried out to ensure fair refunds. “This process may take approximately 3 to 4 weeks as we gather and validate the necessary data, and implement the distribution code,” the team noted. MuesliSwap To Remedy The Situation? At the end of the post, MuesliSwap stated that swift action has been taken to fix the high slippage issue in the DEX order book.  Related Reading: Cardano (ADA) Price Prediction: 28% Upswing Or 23% Drop Coming Next? The team also said: Going forward, our DEX protocol will provide clear and accurate information on slippage when interacting with our pools. MuesliSwap is the fifth-largest protocol on the Cardano network, with a total value locked (TVL) of $10.41 million, according to data from DefiLlama. MILKUSDT trading at $2.7232 &#124; Source: daily MILKUSDT chart from TradingView Featured image from Taxaide, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-09T20:00:38.000Z",
    "title": "Coins with Competitive Edge in August to Purchase – Shiba Inu (SHIB), Borroe ($ROE), and Maker (MKR)",
    "url": "https://www.crypto-news-flash.com/coins-with-competitive-edge-in-august-to-purchase-shiba-inu-shib-borroe-roe-and-maker-mkr/?utm_source=rss&utm_medium=rss&utm_campaign=coins-with-competitive-edge-in-august-to-purchase-shiba-inu-shib-borroe-roe-and-maker-mkr",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T123039.373.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T123039.373.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T123039.373-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T123039.373-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T123039.373-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T123039.373-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As August rolls around, experts are singling out Shiba Inu (SHIB), Borroe ($ROE), and Maker (MKR) as the coins with the best competitive edge. Of the three, Borroe ($ROE) is getting the most attention, attracting investors worldwide with its brand-new Web3 use case and massive growth potential. As a result, market analysts predict that this [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-09T19:59:00.000Z",
    "title": "Crypto Exchange Gemini Teases Relisting XRP, Token Up 4%",
    "url": "https://coinedition.com/crypto-exchange-gemini-teases-relisting-xrp-token-up-4/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Should-investors-hope-for-more-after-XRP-takes-the-lead-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Should-investors-hope-for-more-after-XRP-takes-the-lead-4.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Should-investors-hope-for-more-after-XRP-takes-the-lead-4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Should-investors-hope-for-more-after-XRP-takes-the-lead-4-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Gemini has teased relisting Ripple’s (XRP) in a recent post on X (Twitter). The crypto exchange has shared two different tweets hinting at relisting XRP on its online trading platform. Gemini previously stated that it was exploring relisting the token following Ripple’s major victory in the lawsuit brought by the U.S. Securities and Exchange Commission [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-exchange-gemini-teases-relisting-xrp-token-up-4/\">Crypto Exchange Gemini Teases Relisting XRP, Token Up 4%</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-09T20:00:58.000Z",
    "title": "Crypto Whales and Sharks Gobble Up Nearly $200,000,000 Worth of Chainlink (LINK) in Less Than a Month: Santiment",
    "url": "https://dailyhodl.com/2023/08/09/crypto-whales-and-sharks-gobble-up-nearly-200000000-worth-of-chainlink-link-in-less-than-a-month-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/whales-sharks-gobble-worth.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/whales-sharks-gobble-worth.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/whales-sharks-gobble-worth.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/whales-sharks-gobble-worth.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/whales-sharks-gobble-worth.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/whales-sharks-gobble-worth.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/whales-sharks-gobble-worth.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Santiment says that deep-pocketed crypto investors are accumulating massive amounts of Chainlink (LINK) as LINK&#8217;s development activity soars. New data from the market intelligence platform shows that crypto whales and sharks went on a LINK buying spree, picking up $192.2 million of the decentralized oracle network’s token in under four weeks. During the same time, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/09/crypto-whales-and-sharks-gobble-up-nearly-200000000-worth-of-chainlink-link-in-less-than-a-month-santiment/\">Crypto Whales and Sharks Gobble Up Nearly $200,000,000 Worth of Chainlink (LINK) in Less Than a Month: Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-09T19:55:35.000Z",
    "title": "Billionaire David Rubenstein Says Bitcoin Here To Stay As ‘Enormous Interest’ Spreads Around the World",
    "url": "https://dailyhodl.com/2023/08/09/billionaire-david-rubenstein-says-bitcoin-here-to-stay-as-enormous-interest-spreads-around-the-world/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/Fed-Could-Trigger-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/Fed-Could-Trigger-Bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/Fed-Could-Trigger-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/Fed-Could-Trigger-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/Fed-Could-Trigger-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/Fed-Could-Trigger-Bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/Fed-Could-Trigger-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Billionaire David Rubenstein says that Bitcoin (BTC) isn’t going anywhere now due to a wave of massive interest in the king crypto spread around the globe. In a new interview with Bloomberg, the legendary investor and co-founder of financial services titan Carlyle Group says that interest in BTC and other prominent crypto assets is ramping [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/09/billionaire-david-rubenstein-says-bitcoin-here-to-stay-as-enormous-interest-spreads-around-the-world/\">Billionaire David Rubenstein Says Bitcoin Here To Stay As ‘Enormous Interest’ Spreads Around the World</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]