[
  {
    "source": "Cointelegraph",
    "date": "2023-07-28T16:45:15.000Z",
    "title": "Sam Bankman-Fried's legal team turns over docs related to NYT story, requests they be sealed",
    "url": "https://cointelegraph.com/news/sam-bankman-fried-legal-team-turns-over-docs-related-nyt-story-requests-sealed",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/99f700a0-b3c2-43c8-ac6d-eff8837ad7ed.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Lawyers claimed there was a \"need to avoid\" the public dissemination of documents Sam Bankman-Fried had shown a New York Times reporter which led to a story on Caroline Ellison.</p>\n                    <p><p>Lawyers representing former FTX CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried</a>, also known as ‘SBF’, have requested the court seal documents related to his interviews with a New York Times reporter revealing details about his relationship with Caroline Ellison. </p><p>In a July 27 filing in United States District Court for the Southern District of New York, Bankman-Fried’s legal team said it had provided the court and Department of Justice with documents the former FTX CEO had shown a reporter which led to details in Ellison’s private journals being published. The lawyers requested Judge Lewis Kaplan allow them to file the documents under seal, citing “the need to avoid their public dissemination”.</p><p>Prosecutors in the case have pushed for SBF's $250-million bail to be revoked, claiming he used his freedom to intimidate Ellison — his former romantic partner and colleague — who is expected to offer testimony against the former FTX CEO. News outlet Inner City Press filed a letter of opposition to the request to seal the documents, claiming that any order to do so would be “internally inconsistent”: </p><blockquote>“The defendant already gave them to one media outlet. It is akin to the evisceration of a Freedom of Information Act exemption by a record being already publicly available.”</blockquote><p>Among the details of Ellison's journals in the published NYT story included her describing feeling overwhelmed by her position at Alameda Research, and her break up with SBF. It's unclear what other information, if any, on Bankman-Fried or Ellison might come to light should the judge deny the request to seal.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-brother-planned-buy-island-prep-for-apocalypse\"><strong><em>Sam Bankman-Fried’s brother planned to buy island and prep for apocalypse: court filing</em></strong></a></p><p>SBF is currently under a temporary gag order imposed on July 26 which largely prevents him from making any extrajudicial statements related to his criminal case until the determination of arguments on bail. Judge Kaplan will <a href=\"https://cointelegraph.com/news/judge-warns-sam-bankman-fried-take-seriously-prosecutors-push-revoke-bail\">accept arguments from prosecutors</a> on July 28 and from Bankman-Fried’s legal team on Aug. 3 regarding his bail conditions, which could lead to him being detained until his October trial.</p><p>Prosecutors told Judge Kaplan on July 27 they <a href=\"https://cointelegraph.com/news/sam-bankman-fried-campaign-contribution-charge-dropped-by-prosecutors\">expected to drop</a> the charge concerning violations of campaign finance against SBF due to the conditions of an extradition agreement with The Bahamas. The former FTX CEO still faces 12 criminal counts, which will be spread across two trials scheduled for October 2023 and March 2024.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-28T17:00:31.000Z",
    "title": "IoTeX launches W3bstream Devnet for accelerated DePIN development",
    "url": "https://cryptoslate.com/iotex-launches-w3bstream-devnet-paving-the-way-for-accelerated-depin-development/",
    "description": "<p>IoTeX, a leader in the Decentralized Physical Infrastructure Network (DePIN) space, has announced the release of W3bstream Devnet. The infrastructure is designed to provide developers with a cost-effective and efficient way to build DePINs for various sectors such as commerce, consumers, and industry. Decentralized Physical Infrastructure Networks DePIN refers to the blending of traditional physical [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/iotex-launches-w3bstream-devnet-paving-the-way-for-accelerated-depin-development/\">IoTeX launches W3bstream Devnet for accelerated DePIN development</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-28T17:00:16.000Z",
    "title": "WSJ: Sequoia Capital Reduces Its Crypto Fund",
    "url": "https://cryptodaily.co.uk/2023/07/wsj-sequoia-capital-reduces-its-crypto-fund",
    "description": "<p>Reports by the Wall Street Journal (WSJ) reveal venture capital giants Sequoia Capital reduced its crypto fund by over 65%. </p>\n<p>Venture capital firm, Sequoia Capital, has cut its cryptocurrency fund by over 65% from $585 million to $200 million, the WSJ reports citing persons familiar with the matter.</p>\nSequoia Capital Downsizes Two Funds\n<p>According to the WSJ, which cites persons familiar with the matter, the venture capital firm reduced the size of two of its funds, including its Sequoia Crypto Fund. The Silicon Valley-based tech-focused venture capital firm informed investors it would reduce its crypto and ecosystem fund.</p>\n<p>According to the firm, the adjustments reflect a changed market, with the crypto fund now more focused on investing in newer startups after the market slump reduced its chances to invest in larger projects. The VC firm had invested a sizeable $150 million in the now-collapsed FTX exchange.</p>\n<p>The WSJ report indicates the Sequoia Crypto Fund has been reduced from $585 million to $200 million.</p>\n<p>The WSJ also reports Sequoia&rsquo;s ecosystem fund was reduced from $900 million to $450 million. The firm&rsquo;s ecosystem fund, reduced by 50%, invests in other smaller venture funds and solo investors.</p>\n<p>A further report by the Financial Times (FT) states Sequoia returned over &ldquo;$15 billion to its investors over the past three years.&rdquo; According to the FT, the firm said:</p>\n\n<p>&ldquo;We made these changes to sharpen our focus on seed-stage opportunities and to provide liquidity to our limited partners.&rdquo;</p>\n\n<p>Sequoia first announced its crypto fund in February 2022 and said it was looking to raise around a $500-600 million crypto fund which invests exclusively in the crypto space.</p>\n<p>Sequoia Capital India was also the majority investor in a Polygon funding round which saw the Ethereum scaling platform raise a total of $450 million.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-28T17:00:17.000Z",
    "title": "Unpacking LBank’s Success: A Strategic Approach to MEME Coins and the Crypto Market",
    "url": "https://news.bitcoin.com/unpacking-lbanks-success-a-strategic-approach-to-meme-coins-and-the-crypto-market/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-2-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-2-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-2-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-2-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-2-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-2-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-2.png 900w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. In the rapidly evolving crypto landscape, the LBank exchange platform is making waves. Their noteworthy achievement of being ranked among the top 5 global exchanges in CoinMarketCap&#8217;s (CMC) H1 report is reflective of their innovative strategies and an unyielding commitment to driving the industry forward. Strategizing Success with MEME Coins In the first [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T16:55:52.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T16:53:48.000Z",
    "title": "US economy shows resilience with 2.4% growth in Q2 2023",
    "url": "https://www.cryptopolitan.com/us-economy-shows-resilience-with-2-4-growth-in-q2-2023/",
    "description": "The US economy demonstrated robust performance in the second quarter of 2023, surpassing expectations despite the Federal Reserve&#8217;s aggressive interest rate hikes. According to preliminary figures released by the Department of Commerce, the world&#8217;s largest economy grew at an annualized rate of 2.4% between April and June. This marked an acceleration from the first quarter&#8217;s ... <a title=\"US economy shows resilience with 2.4% growth in Q2 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-economy-shows-resilience-with-2-4-growth-in-q2-2023/\" aria-label=\"More on US economy shows resilience with 2.4% growth in Q2 2023\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-28T17:00:19.000Z",
    "title": "Data Shows: Bitcoin Traders Going Long, Blast Above $30,000 Looming?",
    "url": "https://www.newsbtc.com/bitcoin-news/data-shows-bitcoin-traders-going-long-blast-above-30000-looming/",
    "description": "Bitcoin continues to trade sideways during today’s trading session, holding the line draw for the past few weeks. Recent data shows that the cryptocurrency has been recording “crab-like” price action in the short term, but operators favor the long side of their trades. Related Reading: Why This Billionaire Continues To Advocate For Bitcoin Amid Surging US Debt? As of this writing, Bitcoin trades at $29,700 with a 0.7% loss in the last 24 hours and a 2% loss in the previous week. The cryptocurrency’s implied volatility has been trending to the downside while BTC’s price holds still at its current levels. Low Volatility Set The Stage For A Bitcoin Price Explosion? Data from a report posted by crypto analytics firm Block Scholes via Deribit indicates that Bitcoin and Ethereum traders have been seeking long exposure to these cryptocurrencies. As mentioned above, this behavior coincides with a decline in delivered volatility. As a result, the BTC and ETH perpetual swap markets are experiencing a shift in funding rates. This measure determines the percentage paid by long to short positions at a given time. The chart below shows that funding rates have been trending to the upside since last September 2022. At that time, the price of Bitcoin and other cryptocurrencies hit a multi-year low. Now, the BTC price experienced a 100% recovery from those levels leading to a change in the derivatives sector. The chart shows that funding rates across the BTC, ETH, and USDC trading pairs have been positive for the past three months. This data shows that traders are going long and willing to pay short positions for their exposure. A positive funding rate is often linked to the sentiment among operators and could hint at an upcoming bullish run when found on platforms like Deribit, where “smart money” trades. Why Are BTC Traders Going Long? Conversely, Block Scholes wonders: why are traders going long when implied volatility fell to new all-time lows? What’s driving operators for long exposure while the price trades sideways so much that they are willing to pay a premium? The report stated: We find it somewhat odd that traders are willing to pay such a consistently high rate for long exposure despite such low expectations of volatility. Related Reading: Bitcoin Set To Accelerate As A Store Of Value In Wake Of Bank Collapses, Cathie Wood The above is unclear; it could be traders hedging their positions on the options market could be traders getting ready for an upcoming move as the U.S. Securities and Exchange Commission (SEC) deliberates on the potential approval of a spot Bitcoin Exchange Traded Fund (ETF)."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T17:05:16.000Z",
    "title": "Why the AltSignals Presale Could Skyrocket in 2023: Price Predictions and Analysis",
    "url": "https://www.crypto-news-flash.com/why-the-altsignals-presale-could-skyrocket-in-2023-price-predictions-and-analysis/?utm_source=rss&utm_medium=rss&utm_campaign=why-the-altsignals-presale-could-skyrocket-in-2023-price-predictions-and-analysis",
    "description": "<img width=\"1018\" height=\"518\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Altsignals-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Altsignals-4.jpg 1018w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Altsignals-4-300x153.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Altsignals-4-768x391.jpg 768w\" sizes=\"(max-width: 1018px) 100vw, 1018px\" />Among a host of impressive uses of Web3 technology, AltSignals has emerged as a unique contender primed for a potential skyrocket in 2023. Analysts are now quickly putting together in-depth assessments of the project potential to understand why the AltSignals presale has garnered such massive attention, offering price predictions and comprehensive analysis. For any investor [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T17:00:40.000Z",
    "title": "Shiba Inu Breaks Milestones: Is Flow a Good Investment? Borroe Takes the Lead in 2023",
    "url": "https://www.crypto-news-flash.com/shiba-inu-breaks-milestones-is-flow-a-good-investment-borroe-takes-the-lead-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-breaks-milestones-is-flow-a-good-investment-borroe-takes-the-lead-in-2023",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T170219.718.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T170219.718.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T170219.718-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T170219.718-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T170219.718-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-28T170219.718-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />  It&#8217;s always an interesting period for the crypto market, especially for altcoins like Shiba Inu (SHIB) and Flow. Shiba Inu (SHIB) has remained among the most talked-about meme coins, yet altcoins like Flow have much work to do to become relevant again. This also presents an opportunity for investors to consider new entrants like [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-28T16:55:23.000Z",
    "title": "South African Foreign Minister Says Three New Countries Have Joined BRICS Economic Alliance: Report",
    "url": "https://dailyhodl.com/2023/07/28/south-african-foreign-minister-says-three-new-countries-have-joined-brics-economic-alliance-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/south-african-minister-three.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/south-african-minister-three.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/south-african-minister-three.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/south-african-minister-three.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/south-african-minister-three.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/south-african-minister-three.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/south-african-minister-three.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Three more countries have reportedly joined Brazil, Russia, India, China and South Africa in their economic alliance known as BRICS. South African Foreign Minister Naledi Pandor tells Russian government-backed RT about BRICS’ expansion ahead of a Russia-Africa summit in St. Petersburg. The diplomat says countries seeking to join BRICS are drawn to the progressive ideals [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/28/south-african-foreign-minister-says-three-new-countries-have-joined-brics-economic-alliance-report/\">South African Foreign Minister Says Three New Countries Have Joined BRICS Economic Alliance: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]