[
  {
    "source": "CoinDesk",
    "date": "2023-08-01T15:00:00.000Z",
    "title": "DeFi Platform Term Finance Brings Fixed Rate Lending to Ethereum",
    "url": "https://www.coindesk.com/business/2023/08/01/defi-platform-term-finance-brings-fixed-rate-lending-to-ethereum/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Short term, fixed rate loans can now work in harmony with Aave and Compound's \"ultimate liquidity\" model."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-01T15:00:00.000Z",
    "title": "16 tips for managing the business development side of scaling",
    "url": "https://cointelegraph.com/innovation-circle/16-tips-for-managing-the-business-development-side-of-scaling",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/9256e2e5-d911-42c5-8c5e-51a14047cb01.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>To successfully scale, crypto and blockchain companies need to know as much about business development as they do about their technology.</p>\n                    <p><p>Founders of crypto and blockchain companies launch with a vision of bringing an innovative and impactful service to the business or consumer marketplace. And as with entrepreneurs in any industry, they have the goal of growing. With expertise in the technology and its potential, leaders of crypto and blockchain firms may be clear on the “nuts and bolts” aspects of scaling — infrastructure upgrades, interoperability, compliance and so on — but less knowledgeable about the business development side of growing a company.</p> <p>Crypto and blockchain companies seeking to expand will need to make multiple decisions — but first, they need to know all the questions that have to be answered. Below, 16 members of <a href=\"https://circle.cointelegraph.com/?_ga=2.198681135.1484442309.1667485998-1927108766.1652715111\" target=\"_blank\" rel=\"noreferrer noopener\">Cointelegraph Innovation Circle</a> share some of the factors growing companies will need to examine and offer their tips for confidently moving forward. </p> <h2>Focus on a specific market</h2> <p>When working on scaling your business, it’s important to stay focused. Sometimes business development folks think that the more target audiences a company can reach, the better. However, history has shown that focusing on a specific, niche market always works best and, ultimately, leads to the most success. Focus on one key market at a time and do the best job for their particular needs. Only when you’ve done that should you move on to the next one. –<a href=\"https://circle.cointelegraph.com/u/1bff9b74-7b61-4788-a1c8-203b31439d85\" target=\"_blank\" rel=\"noreferrer noopener\"> Ayelet Noff</a>,<a href=\"https://slicedbrand.com/\" target=\"_blank\" rel=\"noreferrer noopener\"> SlicedBrand</a></p> <h2>Start by building a brand</h2> <p>The best thing you can do is to ensure you focus your marketing and communications efforts on building a brand. That is by far the best way to ensure the path to market is as smooth as can be for your project. If every time one of your sales or business development people encounters a prospect they have to start with the bees and the flowers, you’re doomed to fail. Do your job. Build a brand! –<a href=\"https://circle.cointelegraph.com/u/5efb46ba-15cc-4f20-ad2a-c0c7e455a7ea\" target=\"_blank\" rel=\"noreferrer noopener\"> German Ramirez</a>,<a href=\"http://therelevancehouse.com/\" target=\"_blank\" rel=\"noreferrer noopener\"> THE RELEVANCE HOUSE AG</a></p> <h2>Create a story about your project</h2> <p>Grow your crypto company the same way you would take a journey: Don’t just keep your foot on the gas pedal the whole way. You also need to search for the best routes, make some friends along the way and, most importantly, create a story about your project that resonates with people. Lead your company with both ambition and care and find the balance between fast growth and lifelong success. –<a href=\"https://circle.cointelegraph.com/u/de8c500e-4e5b-4182-89ec-17b2fb76a252\" target=\"_blank\" rel=\"noreferrer noopener\"> Bogomil Stoev</a>,<a href=\"http://seasonaltokens.org/\" target=\"_blank\" rel=\"noreferrer noopener\"> Seasonal Tokens</a></p> <h2>Expand your community</h2> <p>Build meaningful partnerships and grow a strong community. Expanding your community helps expand your reach, granting you access to experts in the space. Partnering with an established business brings valuable experience and knowledge to the table, as these partners can provide insights into industry best practices and trends. Leveraging their knowledge can assist in accelerating B2B development. –<a href=\"https://circle.cointelegraph.com/u/5cae7f29-8588-4852-bb31-c66fd1d805c6\" target=\"_blank\" rel=\"noreferrer noopener\"> Anthony Georgiades</a>,<a href=\"https://pastel.network/\" target=\"_blank\" rel=\"noreferrer noopener\"> Pastel Network</a></p> <h2>Sync growth with marketplace rhythms</h2> <p>Be the blockchain maestro! Balance your technology and business in harmony. Just as a maestro conducts an orchestra, ensure your tech team hits high notes with scaling solutions while your business team plays a melody of building partnerships and meeting customer needs. Sync your growth with the rhythm of the market to compose a masterpiece in the crypto and blockchain symphony! –<a href=\"https://circle.cointelegraph.com/u/d720a7cd-d784-46d6-9998-f4df393114ab\" target=\"_blank\" rel=\"noreferrer noopener\"> Erki Koldits</a>,<a href=\"https://www.popspot.com/\" target=\"_blank\" rel=\"noreferrer noopener\"> OÜ Popspot</a></p> <h2>Blend ‘science’ and ‘art’</h2> <p>Scaling a crypto and blockchain company requires a blend of “science” and “art.” The “science” lies in measuring the effectiveness of activities that yield desired outcomes — for instance, prioritizing partnerships and reaching out to compatible industry companies. The “art” entails effectively communicating with partners and cultivating an appealing brand image. –<a href=\"https://circle.cointelegraph.com/u/8179044f-5f09-469d-8c72-d17fd6274257\" target=\"_blank\" rel=\"noreferrer noopener\"> Arvin Khamseh</a>,<a href=\"http://soldoutnfts.io/\" target=\"_blank\" rel=\"noreferrer noopener\"> SOLDOUT NFTs</a></p> <h2>If you’re collaborating with influencers, choose wisely</h2> <p>If you want to collaborate with influencers, look for those who are able to convert, rather than those with mass audience sizes. Choose influencers who create content that is closely related to what you do, who can act as your ambassadors, and who believe in your work and have a connection to it. They will promote you in a much more effective way. –<a href=\"https://circle.cointelegraph.com/u/409457b5-4733-4b8b-86d1-114a5633b416\" target=\"_blank\" rel=\"noreferrer noopener\"> Tammy Paola</a>,<a href=\"http://zerocap.com/\" target=\"_blank\" rel=\"noreferrer noopener\"> Zerocap</a></p> <h2>Build with your client base in mind</h2> <p>Choose a lane. It often comes down to focusing either on Web2 enterprises or Web3 natives. Find out what makes your client base tick, build for them and target them in ways they will respond to. Web2 clients may need case studies, hand-holding and a focus on compliance. Web3 natives may prefer to use platforms they heard about on Twitter that have token incentives and forward-thinking user interfaces. –<a href=\"https://circle.cointelegraph.com/u/33f1a11d-f668-4986-9f93-6132b7453866\" target=\"_blank\" rel=\"noreferrer noopener\"> Shiv Madan</a>,<a href=\"http://moonwalk.com/\" target=\"_blank\" rel=\"noreferrer noopener\"> Moonwalk</a></p> <p class=\"has-black-color has-text-color has-background\" style=\"background-color: #fabf2c;padding: 20px 30px\">Join the community where you can transform the future. Cointelegraph Innovation Circle brings blockchain technology leaders together to connect, collaborate and publish. <strong><a href=\"https://hubs.ly/Q0152XyT0\" target=\"_blank\" rel=\"noopener\">Apply today</a></strong></p> <h2>Embrace tactical partnerships</h2> <p>Embrace tactical partnerships in crypto and blockchain to scale your business. Find aligned organizations and leverage complementary strengths to access new markets, foster innovation and mitigate risks. Collaborate, innovate and propel your company toward accelerated growth to unleash the true potential of your crypto venture. –<a href=\"https://circle.cointelegraph.com/u/a27b7ccb-dfb8-468f-83ae-4aac596f0a40\" target=\"_blank\" rel=\"noreferrer noopener\"> Vinita Rathi</a>,<a href=\"https://www.systango.com/\" target=\"_blank\" rel=\"noreferrer noopener\"> Systango</a></p> <h2>Don’t go too fast</h2> <p>Just as with any business, don’t try to grow at too fast a pace, because you may end up neglecting your basic principles, taking shortcuts, forgetting to support your customers or bypassing security precautions. Grow at a pace at which you can maintain proper operating standards and customer satisfaction levels. –<a href=\"https://circle.cointelegraph.com/u/008ee5ae-3d26-4c82-a558-db3e57e4c769\" target=\"_blank\" rel=\"noreferrer noopener\"> Zain Jaffer</a>,<a href=\"http://www.zain-ventures.com/\" target=\"_blank\" rel=\"noreferrer noopener\"> Zain Ventures</a></p> <h2>Network in person whenever possible</h2> <p>Join as many high-quality events as possible. As a Web3 startup, you are much more likely to form lasting connections with potential partners and investors in person as opposed to over email or Telegram. Conferences and summits are an excellent way to expand your network, since they typically bring together builders and venture capitalists from a variety of different blockchain ecosystems. –<a href=\"https://circle.cointelegraph.com/u/abc0e9e1-b580-49da-b9fb-105caa752b79\" target=\"_blank\" rel=\"noreferrer noopener\"> Wolfgang Rückerl</a>,<a href=\"https://entity.global/\" target=\"_blank\" rel=\"noreferrer noopener\"> ENT Technologies AG</a></p> <h2>Start building up development data now</h2> <p>Build relationships, get data and grow partnerships. Begin storing business development data, such as contact details, conversation topics and buying signals, within a CRM early in the life of your business. If you don’t, once your company has grown, you’ll regret not having an accurate database to draw from. –<a href=\"https://circle.cointelegraph.com/u/bcb46b42-12ad-4937-8069-b741c596ef3c\" target=\"_blank\" rel=\"noreferrer noopener\"> Sheraz Ahmed</a>,<a href=\"http://storm.partners/\" target=\"_blank\" rel=\"noreferrer noopener\"> STORM Partners</a></p> <h2>Build alliances within the ecosystem</h2> <p>One key tip is to focus on forging strategic partnerships. In the rapidly evolving crypto and blockchain ecosystem, alliances can provide access to new markets, technologies and user bases. Leveraging these synergies can help you drive growth, scale operations and establish your brand in this competitive landscape. –<a href=\"https://circle.cointelegraph.com/u/0d167285-44f8-41a6-9001-72aab6b4058d\" target=\"_blank\" rel=\"noreferrer noopener\"> Tomer Warschauer Nuni</a>,<a href=\"http://www.kryptomon.co/\" target=\"_blank\" rel=\"noreferrer noopener\"> Kryptomon</a></p> <h2>Establish sustainable revenue models</h2> <p>To thrive, crypto and blockchain companies must prioritize survival and growth. Longevity is key. Business development drives product success by establishing sustainable revenue models and creating an ecosystem around the offering. Regardless of the industry, adherence to fundamental rules ensures company progress. –<a href=\"https://circle.cointelegraph.com/u/923e790f-d991-437d-a1eb-575af185daca\" target=\"_blank\" rel=\"noreferrer noopener\"> Ilias Salvatore</a>,<a href=\"http://flooz.xyz/\" target=\"_blank\" rel=\"noreferrer noopener\"> Flooz XYZ</a></p> <h2>Collaborate with established companies</h2> <p>Establish strategic partnerships. Collaborating with established companies, industry leaders or complementary service providers can offer several benefits, including access to a broader customer base. By forging strategic partnerships, crypto and blockchain companies can leverage their partners’ strengths, enhance their market presence and accelerate growth in a mutually beneficial manner. –<a href=\"https://circle.cointelegraph.com/u/984f8954-d388-45bf-bcb5-d6dd3f8be93c\" target=\"_blank\" rel=\"noreferrer noopener\"> Theo Sastre-Garau</a>,<a href=\"https://nftevening.com/\" target=\"_blank\" rel=\"noreferrer noopener\"> NFTevening</a></p> <h2>Don’t limit your partnership options</h2> <p>Don’t limit yourself when it comes to whom you’ll work with; rather, be strategic about <em>how</em>. Business development partnerships should be more technically strategic, but you can grow your audience by experimenting with a broader group of brands — for example, through events or social partnerships that reach like-minded audiences. –<a href=\"https://circle.cointelegraph.com/u/84007b98-8c0e-4c02-8807-ff7876b7765d\" target=\"_blank\" rel=\"noreferrer noopener\"> Megan Nyvold</a>,<a href=\"http://bingx.com/en-us/\" target=\"_blank\" rel=\"noreferrer noopener\"> BingX</a></p> <hr class=\"wp-block-separator\" /> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p> <p><a href=\"https://hubs.ly/Q0152XyT0\"><em><strong><u>Learn more about Cointelegraph Innovation Circle and see if you qualify to join.</u></strong></em></a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-01T15:00:00.000Z",
    "title": "Bitcoin Price Analysis:  Stops Hit Below 28672 - 2 August 2023",
    "url": "https://cryptodaily.co.uk/2023/08/bitcoin-price-analysis-stops-hit-below-28672-2-august-2023",
    "description": "<p>BTC/USD Stops Elected Below the 28672:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 2 August 2023</p>\n<p>Bitcoin (BTC/USD) continued to suffer from bearish momentum early in the Asian session as the pair depreciated sharply to the 28477 level after Stops were elected below the 29089.49 and 28775.19 levels, downside price objectives associated with selling pressure around the 29851.28 area.&nbsp; Additional Stops were elected below the 28999, 28874, and 28672 areas during the acute selloff, downside price objectives related to recent selling pressure around the 29526 and 29344 levels.&nbsp; Additional downside price objectives linked to recent selling pressure include the 28432, 27979, 27409, 27246, and 26501 levels.&nbsp; Below the market, additional downside price objectives include the 28213, 28137, 27757, 27430, 27338, 27312, 26348, and 26199 levels.&nbsp; &nbsp;Also, the 28095.44 area represents the 23.6% retracement of the historic depreciating range from 69000 to 15460.&nbsp;&nbsp;</p>\n<p>Following recent upside activity, areas of technical support and potential buying pressure include the 28306, 27466, 26428, and 26272 levels.&nbsp; Traders are monitoring the recent depreciating range from 31862.21 to 28850 with upside retracement levels around the 30000, 30356, 30711, 31151, and 31217 areas.&nbsp; Above the market, upside price objectives include the 30526, 30611, 30762, and 31145 areas.&nbsp; Upside price objectives related to other levels of buying pressure include the 32125 and 33569 areas, and Stops are cited above additional upside price objectives around the 32043, 34531, 34658, and 35912 areas.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 100-bar MA (hourly) and below the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 29268.97 and the&nbsp;50-bar MA&nbsp;(Hourly) at 29214.97.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bullishly above SlowD&nbsp;while&nbsp;MACD&nbsp;is Bearishly below MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-01T14:45:00.000Z",
    "title": "Bitcoin (BTC) Price Prediction – Maker (MKR) and Borroe ($ROE) Surge",
    "url": "https://cryptodaily.co.uk/2023/08/bitcoin-btc-price-prediction-maker-mkr-and-borroe-roe-surge",
    "description": "<p class=\"s7\">According to experts, Bitcoin (BTC) may surge in early August 2023, thanks to the options expiry exercise. Also, Maker (MKR) recorded a massive price surge in July, and analysts are monitoring to see if this bullish momentum will hold through Q3 2023. On the other hand, Borroe ($ROE) is ready to disrupt decentralized fundraising, and the platform has already sold all of the Borroe ($ROE) tokens listed for its Beta presale stage.</p>\n<p>&gt;&gt;BUY $ROE TOKENS NOW&lt;&lt;</p>\nBitcoin (BTC) May Record a Price Surge in Late July 2023\n<p class=\"s7\">Today, July 28, 2023, $2 billion worth of Bitcoin (BTC) options will expire. Historically, this monthly Bitcoin (BTC) options expiry is always associated with bullish volatility for Bitcoin (BTC). This time we could see Bitcoin&rsquo;s (BTC) support level rise from $29,000 to $29,500. According to experts, the effects of Bitcoin (BTC) options expiry often take a few days to consolidate, and we may see Bitcoin (BTC) rise to $31,000 in the first few days of August 2023.</p>\n<p class=\"s7\">Also, requests for Bitcoin (BTC) Spot ETFs could propel Bitcoin (BTC) to a greater price surge. If the US SEC approves the requests from Blackrock and Fidelity, Bitcoin (BTC) should break through its 2023 high. Interestingly, Bitcoin (BTC) hit this $31,657 high on July 13 after a US federal court ruling dealt a blow to the SEC&rsquo;s crypto regulatory efforts. Bitcoin (BTC) turned bearish shortly after this price surge, and the token is currently trading at $29,180 on July 28.</p>\n<p>&gt;&gt;BUY $ROE TOKENS NOW&lt;&lt;</p>\nMaker (MKR) Ecosystem Developments Trigger Massive Price Surge\n<p class=\"s7\">In May 2023, MakerDAO released a five-phase roadmap tagged &lsquo;Endgame.&rsquo; According to Maker (MKR) developers, this upgrade will include a rebrand, a new blockchain, and the introduction of two new tokens. During this period, Rune Christensen (co-founder of Maker DAO) also revealed that Maker (MKR) users could initiate hard forks in response to power attacks or abuse.</p>\n<p class=\"s7\">These ecosystem developments and the Maker (MKR) token burn led to a massive price surge last month. Maker (MKR) launched a Smart Burn Engine program that recently cleaned more than $230,000 worth of Maker (MKR) tokens from the market.</p>\n<p class=\"s7\">As a result, we saw Maker (MKR) rise from $672 on June 28 to a current price of $1,167 on July 28. The token gained 72.84% this last month, and only a few tokens, like XRP and Borroe ($ROE), can match this surge in Q3 2023. &nbsp;</p>\nInvestors Are Betting on Borroe ($ROE) in August 2023, Token Set to Gain 300% \n<p class=\"s7\">Borroe ($ROE) is the world&rsquo;s first web3 blockchain invoice discounting NFT marketplace. As a decentralized funding platform, Borroe ($ROE) helps web3 participants and content creators generate instant cash by selling future verifiable income. Borroe ($ROE) users can mint their subscriptions, royalties, digital payments, and invoices into NFTs. Afterwards, they sell these NFTs at discounted prices to supportive community members. &nbsp;</p>\n<p class=\"s7\">Currently, Borroe ($ROE) is moving from its Beta stage to Stage 1 of its presale, as it has sold more than 25 million tokens so far. Borroe ($ROE) has surged by 25%, and it is selling at $0.0125. After all presale stages, Borroe ($ROE) will hit the mainstream crypto and sell for $0.0400. So if you invest in Borroe ($ROE) now, you&rsquo;ll see a 220% rise in the value of your tokens in a few weeks.</p>\nLearn more about the Borroe ($ROE) presale here:\n<p class=\"s12\">Buy Presale: https://borroe.finance/ &nbsp; &nbsp;</p>\n<p class=\"s12\">Website: https://borroe.finance/ &nbsp;</p>\n<p class=\"s7\">Telegram: https://t.me/borroe_finance &nbsp;</p>\n<p class=\"s7\">Twitter: https://twitter.com/Borroe_Finance</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-01T14:55:47.000Z",
    "title": "Why Is Wall Street Bullish on Palantir’s AI Potential And Likened to Messi?",
    "url": "https://www.cryptopolitan.com/why-is-wall-street-bullish-on-palantirs-ai/",
    "description": "Artificial Intelligence (AI) has been the talk of Wall Street and Main Street this year, with its rapid evolution and wide-ranging potential applications, specifically Palantir. From creating original content to writing code, the possibilities of generative AI are still being explored. Investment banks Morgan Stanley and Goldman Sachs predict that productivity gains from AI could ... <a title=\"Why Is Wall Street Bullish on Palantir&#8217;s AI Potential And Likened to Messi?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/why-is-wall-street-bullish-on-palantirs-ai/\" aria-label=\"More on Why Is Wall Street Bullish on Palantir&#8217;s AI Potential And Likened to Messi?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-01T15:03:36.000Z",
    "title": "CBDCs: gateway to state control or monetary innovation?",
    "url": "https://crypto.news/cbdcs-gateway-to-state-control-or-monetary-innovation/",
    "description": "While some champion CBDCs as a financial revolution, many view them as a threat to privacy and freedom. Crypto.news spoke with experts to shed light on this complex debate. Digital currencies backed by central banks, or CBDCs, could completely change&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-01T14:47:39.000Z",
    "title": "Crypto Twitter believes SBF secretly backs BALD",
    "url": "https://crypto.news/crypto-twitter-believes-sbf-secretly-backs-bald/",
    "description": "The crypto community speculates that Sam Bankman-Fried could be behind the new meme coin, BALD. The BALD meme coin, making fun out of Coinbase CEO Brian Armstrong&#8217;s absence of hair, was launched on July 31. The meme coin gained an&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-01T15:00:34.000Z",
    "title": "Bitcoin (BTC) Investors Switch to Borroe ($ROE) and Shiba Inu (SHIB) – Here’s Why",
    "url": "https://www.crypto-news-flash.com/bitcoin-btc-investors-switch-to-borroe-roe-and-shiba-inu-shib-heres-why/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-btc-investors-switch-to-borroe-roe-and-shiba-inu-shib-heres-why",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T120732.180.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T120732.180.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T120732.180-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T120732.180-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T120732.180-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-01T120732.180-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Bitcoin (BTC) recorded a primarily bearish outing in July 2023. On the other hand, Shiba Inu (SHIB) gained attention after the lead developer confirmed the launch of Shibarium in August 2023. Bitcoin (BTC) investors are buying Shiba Inu (SHIB) tokens in anticipation of this event. Also, investors have caught wind of Borroe ($ROE), a hot [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-01T14:59:00.000Z",
    "title": "ApeCoin Team Claims Another 4.6M Tokens From Treasury Allocation",
    "url": "https://coinedition.com/apecoin-team-claims-another-4-6m-tokens-from-treasury-allocation/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/One_hour_ago_the_Apecoin_Team_recently_claimed_4_6M_APE.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"ApeCoin Team Claims Another 4.6M Tokens From Treasury Allocation\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/One_hour_ago_the_Apecoin_Team_recently_claimed_4_6M_APE.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/One_hour_ago_the_Apecoin_Team_recently_claimed_4_6M_APE-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/One_hour_ago_the_Apecoin_Team_recently_claimed_4_6M_APE-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/One_hour_ago_the_Apecoin_Team_recently_claimed_4_6M_APE-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/One_hour_ago_the_Apecoin_Team_recently_claimed_4_6M_APE-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/One_hour_ago_the_Apecoin_Team_recently_claimed_4_6M_APE-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/One_hour_ago_the_Apecoin_Team_recently_claimed_4_6M_APE-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/One_hour_ago_the_Apecoin_Team_recently_claimed_4_6M_APE-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/One_hour_ago_the_Apecoin_Team_recently_claimed_4_6M_APE-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/One_hour_ago_the_Apecoin_Team_recently_claimed_4_6M_APE-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/One_hour_ago_the_Apecoin_Team_recently_claimed_4_6M_APE-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/One_hour_ago_the_Apecoin_Team_recently_claimed_4_6M_APE-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/One_hour_ago_the_Apecoin_Team_recently_claimed_4_6M_APE-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/One_hour_ago_the_Apecoin_Team_recently_claimed_4_6M_APE-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/One_hour_ago_the_Apecoin_Team_recently_claimed_4_6M_APE-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/One_hour_ago_the_Apecoin_Team_recently_claimed_4_6M_APE-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The ApeCoin team recently claimed 4.6 million APE, equivalent to $8.14 million from the treasury allocation, according to Token Unlocks, the digital assets tokenomics data aggregation platform. Token Unlocks revealed this in a recent tweet, sharing details of the particular wallet involved in the transaction. The recently claimed APE tokens are a part of the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/apecoin-team-claims-another-4-6m-tokens-from-treasury-allocation/\">ApeCoin Team Claims Another 4.6M Tokens From Treasury Allocation</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]