[
  {
    "source": "CryptoSlate",
    "date": "2024-02-27T00:48:02.000Z",
    "title": "Bitwise predicts 50% odds of spot ETH ETF approval, $88k BTC by year end",
    "url": "https://cryptoslate.com/bitwise-predicts-50-odds-of-spot-eth-etf-approval-88k-btc-by-year-end/",
    "description": "<p>Bitwise researcher Ryan Rasmussen believes there is a 50% chance that spot Ethereum ETFs will gain approval in the coming months. Rasmussen shared his insights on the odds during a Feb. 26 interview with Yahoo Finance. He said: &#8220;I certainly don&#8217;t know if the market is necessarily at a point that the SEC would like [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitwise-predicts-50-odds-of-spot-eth-etf-approval-88k-btc-by-year-end/\">Bitwise predicts 50% odds of spot ETH ETF approval, $88k BTC by year end</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-27T01:00:26.000Z",
    "title": "Arbitrum Beats Ethereum and Solana With 119% Surge In NFT Sales, NFT Resurgence On The Horizon?",
    "url": "https://www.newsbtc.com/arbitrum/arbitrum-beats-ethereum-and-solana-with-119-surge-in-nft-sales-nft-resurgence-on-the-horizon/",
    "description": "Arbitrum (ARB), the Ethereum Layer 2 scaling solution, has been facing a bearish week after failing to establish a new price floor and falling below the $2 level. Additionally, the unlocking event scheduled for March could negatively impact the token’s price. Despite ARB’s recent drop, the blockchain has seen a greater performance in the non-fungible token (NFT) market, surpassing Ethereum and Solana. Related Reading: Arbitrum (ARB) Faces Potential Selling Pressure As 1 Billion Tokens Become Unlocked In March Arbitrum: Top Gainer In The Last Day Data from Crypto Slam shows that the daily NFT sales volume in the Arbitrum blockchain recovered in the last 24 hours. The blockchain is the fourth largest by total NFT volume sales, showing a recent performance larger than Ethereum or Solana. Top ten blockchains by NFT sales volume in the last 24 hours. Source: Crypto Slam The chart above shows that Arbitrum is the top gainer after seeing a 119.41% surge in sales volume, over $1.26 million, during the last 24 hours. The blockchain also registered an 8.09% increase in wash sales from the day prior. Despite the rise, it only accounts for 0.11%, or $1,489, of the total sales volume. Wash trading is a practice used to inflate an asset’s value artificially. As a form of market manipulation, the trader buys and sells the same asset, usually through a third party, to create the impression of a higher market activity of said asset. Wash sales in the NFT market can happen through a single seller creating multiple accounts to trade the NFT or two sellers scheming to buy and sell each other’s digital assets. The Arbitrum blockchain had 8,094 transactions during the last day, which accounts for a 9.04% increase. Its demand and offer of NFTs also rose by approximately 10%, with 3,557 buyers and 1,904 sellers in the previous 24 hours. Solana and Ethereum saw a milder increase in their daily volume sales, with 26.69% and 5.42% respectively. Solana had a total sales volume of $10.9 million, divided by $9.17 million in authentic sales and $1.77 million in wash sales, which is 16.21% of the total volume and a 9.37% surge from the day prior. Despite the sales volume being worth almost eleven million dollars, the demand and offer saw a significant 21.21% transaction drop and a 15.6% buyer decrease on the last day. On the other hand, the NFT sales in the Ethereum blockchain saw a 2.9% drop in its total daily sales volume. Similarly, the number of transactions faced a slight 3.79% decline, with 23,931 transactions. However, it’s worth noting that wash sales in the Ethereum blockchain saw a significant 19.33% decrease, with $7.14 million in the last 24 hours. Is An NFT Resurgence In The Horizon? The daily sales volume suggests a recent interest in some of the NFTs offered in the Arbitrum and other top blockchains. However, said interest could be a momentary thing in this ever-changing market. To paint a bigger picture, let’s look at what the 7-day time frame data suggests. As seen in the chart below, five of the top ten blockchains by NFT sales volume have increased in this timeframe. Arbitrum, Bitcoin, and BNB Chain are among the top gainers in the last week. Top ten blockchains by NFT sales volume in the last 7 days. Source: Crypto Slam Arbitrum remains the biggest winner with its massive 373.18% surge. The number of buyers and sellers also increased exponentially, with a 69% surge (approximately 35,000 buyers) and a 56% increase (27,000 sellers) in the past week. Ethereum takes the first spot as the blockchain with the largest NFT sales volume of $202.5 million. However, Solana remains the winner in the transaction and the user’s metric. The blockchain saw 860,714 transactions in the past week, with over 242,041 buyers and 144,395 sellers. Besides the sales volume, the transactions and buyer/seller numbers shone some light on the NFT market in the past week. These numbers, green in the top ten blockchains by NFT sales, undoubtedly suggest an increase in interest in the 7-day time frame. However, these numbers are significantly below the NFTs market performance shown in the 30-day metric. Related Reading: How To Create And Mint Your Own NFTs On The Ethereum Network ARB is trading at $1.82 in the 1-day chart. Source: ARBUSDT on TradingView.com Featured image from Unsplash.com, Chart from Tradingview.com"
  }
]