[
  {
    "source": "CoinDesk",
    "date": "2023-08-24T10:41:06.000Z",
    "title": "UK’s Travel Rule Troubles Showcase Global Challenge for Crypto",
    "url": "https://www.coindesk.com/policy/2023/08/24/uks-travel-rule-troubles-showcase-global-challenge-for-crypto/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto firms in the U.K. have just days to comply with new money laundering guidelines – but they are seeking more guidance given patchy implementation of the rule between jurisdictions."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T11:00:00.000Z",
    "title": "Julian Assange campaign to hold metaverse political rally against extradition ",
    "url": "https://cointelegraph.com/news/julian-assange-s-campaign-launches-metaverse-political-rally-against-extradition",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/a5b3a898-8505-447c-9d29-457a0f05d261.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Julian Assange is currently locked in a London jail fighting a four-year court battle against his extradition to the US. </p>\n                    <p><p>The “Don’t Extradite Assange Campaign,” dedicated to gathering support against the extradition of Wikileaks founder Julian Assange to the United States, is launching a virtual political rally in the metaverse.</p><p>Assange has been confined within Belmarsh Prison in London since April 2019, fighting a court battle against his extradition to the U.S., where he could potentially face up to 175 years in prison on charges of espionage for leaking information about the wrongdoings of the US agencies in Iraq and Afghanistan.</p><p>Assange founded WikiLeaks, which have been known to publish classified and sensitive information against wrongdoings of various governments in the public domain. However, his journalistic work exposing governments has made him a primary target of several agencies, especially in the United States.</p><p>The Julian Assange campaign, backed by Assange and his family, has planned the virtual political rally in a bid to appeal to more people and gather support against the extradition after his last appeal in June against the extradition was <a href=\"https://edition.cnn.com/2023/06/09/uk/julian-assange-extradition-appeal-intl-gbr/index.html\" target=\"_blank\" rel=\"noopener nofollow\">rejected </a>by the United Kingdom court. </p><p>The virtual event will be held on Aug. 26 in Wistaverse, a not-for-profit metaverse in The Sandbox ecosystem on the Polygon blockchain. The political rally will see speeches by Stella Assange, wife of Julian Assange, Kristinn Hrafnsson, the co-founder and editor-in-chief of WikiLeaks, and other high-profile guests, including British politician Jeremy Corbyn, the former leader of the country’s Labour Party. The speakers at the rally will appear either as characters inside the event or with filmed contributions shown on screens.</p><p>Cointelegraph got in touch with John Rees, the founder and director of the Don’t Extradite Assange Campaign, who said that they selected to hold a virtual rally in the hope of reaching a wider audience. Rees added that the reason for the rally is:</p><blockquote>“To publicize the Assange case and to mobilize people for the protest at the court. To make sure that people know that this is the 11th hour in the Assange case and that if the government goes ahead with extradition a very real blow will have been struck against the freedom of the press.“</blockquote><p>The rally will take place in a virtual auditorium designed to look like the Royal Courts of Justice in London, where Assange is set to face his final appeal in the U.K. court system. The virtual environment “dedicated to protests and social action” will feature a recorded message from Assange, as well.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/web3-activists-fight-for-reproductive-rights-with-nfts-daos-and-protests\"><strong><em>Web3 activists fight for reproductive rights with NFTs, DAOs and protests</em></strong></a></p><p>Many organizations involved in civil rights and freedom of the press have <a href=\"https://cointelegraph.com/news/press-and-internet-freedom-advocates-join-crypto-users-in-support-of-wikileaks-assange\">supported Assange following the WikiLeaks publication</a> and urged U.S. authorities to drop the case for extradition. Amid former U.S. President Donald Trump’s final days in office — prior to the Capitol insurrection on January 6, 2021 — crypto users donated more than $400,000 to Assange’s defense team in hopes of a presidential pardon, while a decentralized autonomous organization <a href=\"https://cointelegraph.com/news/53-million-raised-for-assange-showed-the-power-of-daos\">raised $53 million</a> for the WikiLeaks co-founder in 2022.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/forget-2022-how-metaverse-bounce-back-2023/\"><strong><em>How to resurrect the ‘Metaverse dream’ in 2023</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T10:44:06.000Z",
    "title": "SEC v Ripple: attorneys leave SEC side, both groups add new lawyers ",
    "url": "https://cointelegraph.com/news/sec-v-ripple-attorneys-leave-sec",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/a0fc1d77-053b-402f-8b7e-4e652accc79e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Attorneys Pascale Guerrier, Richard Best and Robert MacDonald Moye representing the U.S. SEC in its ongoing lawsuit against Ripple have withdrawn from the case. </p>\n                    <p><p>Multiple attorneys have moved in and out of the lawsuit between Ripple Labs, executives and the United States Securities and Exchange Commission (SEC),  as signified by court filings on Aug.23. </p><p>The latest motions <a href=\"https://www.courtlistener.com/docket/19857399/securities-and-exchange-commission-v-ripple-labs-inc/?filed_after=&amp;filed_before=&amp;entry_gte=&amp;entry_lte=&amp;order_by=desc\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> were requesting permission to withdraw attorneys Richard Best and Robert MacDonald Moye from the trial, with the former having the motion immediately granted due to extended medical leave. Moye’s withdrawal is still pending a decision from Judge Analisa Torres. </p><p>Earlier the same day, a motion was filed for attorney Pascale Guerrier to be dismissed from the case. This request was also promptly granted by the judge.  </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/de986ad8-0ebe-44f5-8e46-15b711d2d8ea.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Court filing for the withdrawal of SEC attorney Pascale Guerrier. Source: Official court documents</em></figcaption></figure><p>In a game of legal musical chairs, also on Aug. 23, Judge Torres approved attorney Michael A. Schulman for Brad Garlinghouse, the CEO of Ripple, along with attorneys Marc J. Jones and Peter Bryan Moores to represent the SEC. </p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T10:41:09.000Z",
    "title": "Nigerian crypto exchange's token launch draws scrutiny",
    "url": "https://cointelegraph.com/news/crypto-nigerian-crypto-exchange-s-token-launch-draws-scrutiny",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/cb981ddd-401e-4b23-8e12-b0555a3eca51.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This development follows the company's previous disclosure of a security breach resulting in fund losses in May 2023.</p>\n                    <p><p>Patricia, a Nigerian cryptocurrency exchange, has revealed the introduction of its own native token named Patricia token (PTK). However, this launch has generated more doubt than applause within the local cryptocurrency community.</p><p>Native tokens are digital assets that are specific to a particular blockchain platform or cryptocurrency exchange. They are created and issued directly by the platform or exchange itself. Examples of native tokens include Binance Coin (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) on the Binance exchange, Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) on the Ethereum network, and <a href=\"https://cointelegraph.com/solana-price-index\">SOL </a>on the Solana blockchain. </p><p>In the official <a href=\"https://twitter.com/PatriciaSwitch/status/1692544096542372038\" target=\"_blank\" rel=\"noopener nofollow\">communication</a> on X (formerly Twitter), the company stated its intention to transition exchange operations to the Patricia Plus app. The newly introduced native token, which the company asserts is a stablecoin with a 1:1 peg to the dollar (1PTK = $1), is expected to take the place of customers' existing bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and naira balances.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The major issue here is<br><br>If u can afford to give people(converting their balance) a stable coin backed by Usd <br><br>Then Why not just give them their tokens back ? <a href=\"https://t.co/GKgBQdi4Yg\">https://t.co/GKgBQdi4Yg</a></p>&mdash; Solomon_Gift (@Crypto__hub) <a href=\"https://twitter.com/Crypto__hub/status/1692930775610515609?ref_src=twsrc%5Etfw\">August 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>This development follows the company's previous <a href=\"https://twitter.com/PatriciaSwitch/status/1662049215772516352\" target=\"_blank\" rel=\"noopener nofollow\">disclosure</a> of a security breach resulting in fund losses in May 2023. Despite asserting that customer funds remained unaffected, platform users have faced ongoing difficulties in accessing their funds since April.</p><p>The response to Patricia's announcement has led to speculation around fears of a potential exit scam, which could leave customers who have funds stuck on the platform in a precarious situation.</p><p>Highlighted in <a href=\"https://twitter.com/pascalkelechi/status/1692937983861649811\" target=\"_blank\" rel=\"noopener nofollow\">posts</a> by members of the local crypto community, there are a few indicators of concern surrounding Patricia's introduction of PTK. The token is absent from major cryptocurrency aggregators like CoinMarketCap and Coingecko. These platforms offer comprehensive details about tokens, including their real value, issued quantity, contract address and launch blockchain.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/nigeria-to-issue-verifiable-blockchain-certificates-for-nysc\"><strong><em>Nigeria to issue verifiable blockchain certificates for NYSC</em></strong></a></p><p>PTK does not exist on widely adopted blockchains used by exchanges for launching their native tokens. To illustrate, <a href=\"https://cointelegraph.com/news/paypal-launches-stablecoin-for-payment\">PayPal's newly introduced stablecoin</a>, <a href=\"https://cointelegraph.com/paypal-pyusd-price-index\">PYUSD</a>, is <a href=\"https://etherscan.io/token/0x6c3ea9036406852006290770bedfcaba0e23a0e8\" target=\"_blank\" rel=\"noopener nofollow\">accessible</a> on the Ethereum blockchain, the platform on which it was introduced.</p><p>In its statement on X, Patricia disclosed its plan to convert outstanding balances to PTK without obtaining customer consent. This unilateral action has raised concerns, as many worry about their ability to exchange the token for fiat currency or alternate cryptocurrencies like bitcoin.</p><p>If customers initiate withdrawals in large numbers, a surge of withdrawals could lead to PTK losing its peg, potentially leaving those who couldn't withdraw stranded.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-24T11:00:52.000Z",
    "title": "Binance shutters crypto card services in Latin America, Middle East",
    "url": "https://cryptoslate.com/binance-bids-farewell-to-card-services-in-latin-america-middle-east/",
    "description": "<p>Binance Card, a crypto debit card powered by the exchange, will no longer be available in Latin America and the Middle East from Sept. 21, according to an Aug. 24 statement. The Binance Card is similar to a conventional debit card, allowing users to utilize their digital assets for everyday transactions. However, the significant difference [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-bids-farewell-to-card-services-in-latin-america-middle-east/\">Binance shutters crypto card services in Latin America, Middle East</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-24T10:59:29.000Z",
    "title": "Binance Crypto Card Curtain Call: Suspension Date Set for Middle East, Latin America",
    "url": "https://cryptobriefing.com/binance-card-curtain-call-termination-date/?utm_source=feed&utm_medium=rss",
    "description": "Binance has announced it will terminate its crypto debit card services in Latin America and the Middle East by September 21, 2023."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-24T11:00:00.000Z",
    "title": "\n                        US Charges Tornado Cash Co-Founders With Laundering Over $1B\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/us-charges-tornado-cash-co-founders-with-laundering-over-1b",
    "description": "\n                        <p class=\"MsoNormal\" style=\"line-height: 150%;\">Two Tornado Cash co-founders have been charged with conspiracy to commit money laundering and sanctions violations.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">On Wednesday, the United States Attorney&rsquo;s Office announced in a press release the unsealing of an indictment charging Roman Storm and Roman Semenov with conspiracy to commit money laundering, sanctions violations and conspiracy to operate an unlicensed money-transmitting business. The charges against two of Tornado Cash&rsquo;s co-founders arise from their alleged creation, operation, and promotion of the crypto mixer. According to the press release, Tornado Cash facilitated over $1 billion in money laundering transactions and laundered hundreds of millions from the North Korean cybercrime organization, the Lazarus Group.&nbsp;</p>\nStrom and Semenov Knew They Were Aiding Money Laundering\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">US Attorney Damian Williams said: </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;As alleged, Tornado Cash was an infamous cryptocurrency mixer that laundered more than $1 billion in criminal proceeds and violated U.S. sanctions. &nbsp;Roman Storm and Roman Semenov allegedly operated Tornado Cash and knowingly facilitated this money laundering. &nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">While publicly claiming to offer a technically sophisticated privacy service, Storm and Semenov in fact knew that they were helping hackers and fraudsters conceal the fruits of their crimes. &nbsp;Today&rsquo;s indictment is a reminder that money laundering through cryptocurrency transactions violates the law, and those who engage in such laundering will face prosecution.&rdquo; </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">In the announcement, the US Attorney&rsquo;s Office said Roman Storm was arrested on Wednesday in the State of Washington, but Roman Semenov remains at large.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">The Wall Street Journal reports, Tornado&rsquo;s alleged third co-founder, Alexey Pertsev, was arrested in the Netherlands in August on money laundering charges. Pertsev is under house arrest in the Netherlands as he awaits trial. </p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&nbsp;CNBC quotes Brian Klein, Roman Strom&rsquo;s lawyer, who said: &ldquo;We are incredibly disappointed that the prosecutors chose to charge Mr. Storm.&rdquo;&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Klein added they believe prosecutors &ldquo;did so based on a novel legal theory with dangerous implications for all software developers.&rdquo;&nbsp;&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Storm&rsquo;s lawyer further said: </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;Mr. Storm has been cooperating with the prosecutors&rsquo; investigation since last year and disputes that he engaged in any criminal conduct. There is a lot more to this story that will come out at trial.&rdquo;&nbsp;</p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">On Wednesday, the Office of Foreign Asset Control (OFAC) also sanctioned Roman Semenov. The OFAC banned Americans from using the cryptocurrency mixer in August 2022.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Wednesday&rsquo;s indictment was a joint effort by the Federal Bureau of Investigation (FBI), the Justice Department and the Internal Revenue Service&rsquo;s Criminal Investigation unit.&nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Attorney General Merrick B. Garland commented: </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;These charges should serve as yet another warning to those who think they can turn to cryptocurrency to conceal their crimes and hide their identities, including cryptocurrency mixers: it does not matter how sophisticated your scheme is or how many attempts you have made to anonymize yourself, the Justice Department will find you and hold you accountable for your crimes.&rdquo; </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&nbsp;Christopher A. Wray, Director of the FBI, said: </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;Today&rsquo;s announcement should remind criminal organizations everywhere in the world that they are neither untraceable nor anonymous. &nbsp;You can&rsquo;t hide from us behind a keyboard &mdash; whether you&rsquo;re a hacker or facilitator. &nbsp;Those charged today engaged in a conspiracy to launder money for cybercriminals, including for a North Korean cybercrime organization seeking to evade sanctions. &nbsp;</p>\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">As we have with this operation, the FBI is going to keep dismantling the infrastructure used by cyber criminals to commit and profit from their crimes, and holding anyone who assists those criminals accountable.&rdquo;&nbsp;</p>\n\nUS Court Dismisses Appeal to Lift Sanctions on Tornado\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">US District Judge Robert Pitman dismissed an appeal filed by Tornado Cash users to lift the sanctions imposed on the crypto mixer. Judge Pitman agreed with the government and Treasury Department on all of its claims and granted a summary judgement in the case. The court filing said: </p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">&ldquo;The Court finds that Tornado Cash is an association within the ordinary meaning of the term and is, therefore, an entity that may be designated per OFAC regulations.&rdquo;</p>\n\n<p class=\"MsoNormal\" style=\"line-height: 150%;\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T10:58:08.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-24T10:45:10.000Z",
    "title": "Bitcoin And Crypto Faces Pressure: Impact Of Rising Real Yields",
    "url": "https://www.newsbtc.com/news/bitcoin-and-crypto-faces-pressure-impact-of-rising-real-yields/",
    "description": "The intricate dance between Bitcoin, crypto and real yields is becoming increasingly pronounced. As the world of traditional finance grapples with the implications of shifting real yields, the BTC and crypto market is not immune to these fluctuations. For the uninitiated, the &#8216;real yield&#8217; refers to the yield on US treasuries, adjusted for inflation. This metric is pivotal in understanding the broader financial ecosystem, and its movements can have profound implications for risk assets, including Bitcoin and other cryptocurrencies. Higher Real Yields = Bitcoin And Crypto Down Renowned analyst @tedtalksmacro recently shed light on this intricate relationship, stating, &#8220;An important correlation &#8211; BTC + US real yields. Simply, higher real yields drive investors to cash and fixed-income&#8230; and out of &#8216;riskier&#8217; assets like BTC and stocks.&#8221; This observation underscores the delicate balance that Bitcoin and other cryptocurrencies maintain with the broader financial market. The path of real yields is determined by two primary factors: inflation and nominal rates. With the Federal Reserve&#8217;s hiking cycle nearing its end, nominal yields are potentially at their zenith. However, the trajectory of inflation remains uncertain, and as @tedtalksmacro notes, it will &#8220;likely be the greater mover of real yields.&#8221; Adding another layer of complexity, the US treasury&#8217;s recent influx of longer-dated issuance is exerting upward pressure on nominal yields, especially on the back-end. The 10-year, for instance, is trading at highs not witnessed since 2008. Related Reading: Why Is Bitcoin Price Up Today? On the topic of inflation, expectations lean towards a decline in the coming months. As @tedtalksmacro astutely points out, &#8220;If you have been following along, [this would be] conducive to higher real yields. Higher real-yields are bearish for risk-assets.&#8221; This observation is particularly salient for the crypto community, as falling inflation, counterintuitively, might spell trouble for risk assets like Bitcoin. The Federal Reserve&#8217;s aggressive rate hikes aim to curb inflation. Yet, the unintended consequence of this strategy, combined with sustained high rates, could be a rise in real yields. This makes fixed-income assets more appealing, potentially diverting investments away from riskier ventures like stocks and altcoins. The crypto community awaits Jerome Powell&#8217;s address this Friday with bated breath. As @tedtalksmacro anticipates, Powell is likely to persist with the &#8216;higher for longer&#8217; rhetoric, a stance the FOMC has maintained since late 2021. &#8220;Higher for longer + falling inflation + fresh duration issuance = higher real-yields = lower risk assets,&#8221; concludes @tedtalksmacro. Will BTC And Crypto Fall Due To Jackson Hole? Keith Alan, founder of Material Indicators, draws attention to historical patterns and potential market reactions to Jackson Hole. &#8220;Remember when FED Chair Powell spoke from Jackson Hole last year and his hawkish tone triggered a 29% BTC dump that took 5 months to recover? JPow returns to JHole this Friday and there are some similarities in the PA we are seeing now and the PA we saw leading up to last year&#8217;s speech.&#8221; Related Reading: Bitcoin Exchange Reserve Shoots Up, Pain Not Over Yet? Alan highlights the technical patterns observed in Bitcoin&#8217;s price movements leading up to Powell&#8217;s previous speech and the current scenario. However, he cautions against drawing direct parallels, emphasizing the changed macroeconomic conditions and Powell&#8217;s evolved communication style. &#8220;To be clear, the similarities in the current PA, relative to last year&#8217;s PA do not mean that price will react the same way this time,&#8221; Alan states. He underscores the need for investors to be vigilant, yet not reactive, to the potential market volatility surrounding the upcoming Jackson Hole event. &#8220;We must expect JPow&#8217;s words to move markets.&#8221; At press time, BTC traded at $26,589. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-24T11:00:18.000Z",
    "title": "The Shift is Real: Pomerdoge (POMD) Forecasted to Dwarf Litecoin (LTC) & Conflux (CFX) with Unprecedented Gains",
    "url": "https://www.crypto-news-flash.com/the-shift-is-real-pomerdoge-pomd-forecasted-to-dwarf-litecoin-ltc-conflux-cfx-with-unprecedented-gains/?utm_source=rss&utm_medium=rss&utm_campaign=the-shift-is-real-pomerdoge-pomd-forecasted-to-dwarf-litecoin-ltc-conflux-cfx-with-unprecedented-gains",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-117.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-117.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-117-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-117-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Pomerdoge (POMD), while still in its presale phase, is forecasted to outpace established players like Litecoin (LTC) and Conflux (CFX) in terms of gains. The shift towards this emerging asset signifies a changing landscape, adding another layer of unpredictability and possibility to an already dynamic field. Let&#8217;s take a look at what Pomerdoge is and [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-24T10:58:52.000Z",
    "title": "KuCoin Levels Up Crypto Trading with DualFutures and Spot Grid AI Plus Bots",
    "url": "https://coinedition.com/kucoin-levels-up-crypto-trading-with-dualfutures-and-spot-grid-ai-plus-bots/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/KUCOIN-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/KUCOIN-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/KUCOIN-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/KUCOIN-1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/KUCOIN-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/KUCOIN-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/KUCOIN-1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/KUCOIN-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/KUCOIN-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/KUCOIN-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/KUCOIN-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/KUCOIN-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/KUCOIN-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/KUCOIN-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/KUCOIN-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/KUCOIN-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/KUCOIN-1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto exchange KuCoin has unveiled an advancement in crypto investing by introducing two AI trading tools. According to the firm, this approach hinges on harnessing the computational prowess of AI to execute tasks with precision and sophistication. The firm highlighted that AI-driven strategies can potentially curtail errors associated with manual processes, adding that AI can [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/kucoin-levels-up-crypto-trading-with-dualfutures-and-spot-grid-ai-plus-bots/\">KuCoin Levels Up Crypto Trading with DualFutures and Spot Grid AI Plus Bots</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-24T10:54:24.000Z",
    "title": "ETH’s Bearish State Could Trigger a Breakout: Glassnode Founders",
    "url": "https://coinedition.com/eths-bearish-state-could-trigger-a-breakout-glassnode-founders/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Ethereum-Price-Analysis.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ethereum-Price-Analysis\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Ethereum-Price-Analysis.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Ethereum-Price-Analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Ethereum-Price-Analysis-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Ethereum-Price-Analysis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Ethereum-Price-Analysis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Ethereum-Price-Analysis-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Like other cryptocurrencies, Ethereum (ETH) has been experiencing a bearish phase. One undeniable reason for the downturn is the widespread selling pressure that ETH was going through. Amidst this bearish sentiment, notable figures in the industry, such as the founders of Glassnode, have weighed in with their insights. The founders Yann Allemann and Jan Happel, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/eths-bearish-state-could-trigger-a-breakout-glassnode-founders/\">ETH’s Bearish State Could Trigger a Breakout: Glassnode Founders</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]