[
  {
    "source": "CoinDesk",
    "date": "2023-11-14T14:00:00.000Z",
    "title": "Circle to Enable Cross-Chain USDC Transfers With Cosmos's Noble Later This Month",
    "url": "https://www.coindesk.com/tech/2023/11/14/circle-to-enable-cross-chain-usdc-transfers-with-cosmoss-noble-later-this-month/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Decentralized exchange dYdX will be the a user of CCTP, as the project expands beyond Arbitrum, Base, Ethereum and Optimism."
  },
  {
    "source": "CoinDesk",
    "date": "2023-11-14T13:39:55.000Z",
    "title": "U.S. CPI Unexpectedly Flat in October; Bitcoin Adds Nearly 1%",
    "url": "https://www.coindesk.com/markets/2023/11/14/us-cpi-unexpectedly-flat-in-october-bitcoin-adds-nearly-1/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "In addition to the headline beat, core CPI unexpectedly declined last month."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-14T14:01:02.000Z",
    "title": "Disney Reveals NFT Platform With Dapper Labs, Including Star Wars and Pixar",
    "url": "https://decrypt.co/205941/disney-reveals-nft-platform-dapper-labs-including-star-wars-pixar",
    "description": "NBA Top Shot maker Dapper Labs is expanding beyond sports with digital Disney pins minted as NFTs on Flow."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-14T14:00:00.000Z",
    "title": "Animoca eyes SportFi ecosystem, becomes Chiliz Chain validator",
    "url": "http://cointelegraph.com/news/animoca-becomes-chiliz-chain-validator",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/7b97e434-87b5-48a7-8ab5-d21e1151240f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Animoca Brands will become a validator for the Chiliz Chain as the venture capital firm looks to capitalize on the SportFi ecosystem.</p>\n                    <p><p>Venture capital firm Animoca Brands will put its weight behind fan token blockchain Chiliz Chain as it joins the network as a validator within its proof-of-stake authority protocol.</p><p>Chiliz Chain is the backbone of Socios.com, the platform that operates a plethora of fan tokens for some of the biggest global football and sports teams. Europe’s <a href=\"https://cointelegraph.com/news/manchester-city-soccer-club-launches-fan-token-with-socios\">most loved football clubs</a> and a number of household sports brands have tapped into the solution to power Web3 fan tokens and other blockchain-based offerings.</p><p>Animoca Brands co-founder Yat Siu says the partnership presents an opportunity for his firm to combine its expertise in nonfungible tokens (NFTs) and gaming with Chiliz’s focus on sports and entertainment-focused blockchain solutions.</p><blockquote>“We have already seen the rise of DeFi and GameFi, and we believe that SportFi represents the next major growth area that will redefine fan engagement and create new financial dynamics in the sports industry.”</blockquote><p>Chiliz CEO Alexandre Dreyfus adds that Animoca’s addition as a network validator marks a pivotal point in the firm’s history as it looks to solidify its position as a major blockchain solution primarily focused on catalyzing Web3 functionality and the wider sports industry.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/chiliz-launches-layer-1-blockchain-to-expand-fan-token-ecosystem\">Chiliz launches layer-1 blockchain to expand fan token ecosystem</a></em></strong></p><p>Animoca Brands becomes the latest validator of the Chiliz Chain, joining the likes of Ankr, Paribu, Meria, Luganoes and InfStones as validators. Similar to proof-of-stake blockchain protocols like Ethereum, validators authorize and enable the creation of fan tokens, NFTs and decentralized applications, as well as verifying transactions and executing smart contracts.</p><p>Animoca has a wide-ranging spread of investments across the Web3 space and has also honed its focus on the sports sector. Its Web3 sports products include One Fight Arena, AFL Mint and REVV Motorsport. The latter includes the likes of MotoGP Ignition, MotoGP Guru, Formula E: High Voltage, REVV Racing and Torque Drift.</p><p>Animoca grabbed headlines in April 2022 by acquiring French racing game developer Eden Games for $15.3 million. The deal aimed to acquire racing game development talent to enhance the REVV Motorsport ecosystem and introduce blockchain-based games focused on the genre.</p><p>Chiliz <a href=\"https://cointelegraph.com/news/chiliz-launches-layer-1-blockchain-to-expand-fan-token-ecosystem\"></a><a href=\"https://cointelegraph.com/news/chiliz-launches-layer-1-blockchain-to-expand-fan-token-ecosystem\">launched its own layer-1</a> Ethereum Virtual Machine-compatible blockchain ecosystem to support its growth in Feb. 2023. The launch marked the transition away from its Ethereum-based ERC-20 token ecosystem to its own blockchain solution.</p><p>The blockchain initially used a system of 11 active validators with proof-of-stake authority consensus, which is touted to provide faster block times, lower fees and energy usage. </p><p><strong><em></em></strong><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/socios-boss-goal-to-knock-crypto-out-of-the-park/\">Socios boss’ goal? To knock crypto out of the park</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-14T14:00:00.000Z",
    "title": "Cointelegraph’s Rise ‘n’ Crypto: Unveiling the daily Web3 podcast",
    "url": "http://cointelegraph.com/news/rise-n-crypto-podcast-daily-web3-news-show",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/223d3215-6eab-4868-a34e-295078248699.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Want to keep on top of all the crucial happenings in crypto? Cointelegraph has a new daily podcast that provides a rundown of what you need to know in under 15 minutes!</p>\n                    <p><p>Looking for a way to get all the crypto news you need each day from the best source on the net? Then look no further!</p><p>Hosted by Robert Baggs, <em>Rise ’n’ Crypto </em>is a daily podcast covering the most recent and important news, insights and stories without the fluff or rambling. Every morning at 9:00 am Eastern Time, while you sip your coffee, commute to work, or as you go about your day, you can get a rundown of everything you <em>need </em>to know about from the wild world of crypto.</p><p>Long-form, deep-diving podcasts are useful, but sometimes you just want a concise recap of what’s important right now — and that’s what <em>Rise ‘n’ Crypto </em>will do.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/cdc76a6b-6a29-4a44-b633-6b2e6efbc61b.jpg\"  /></figure><p>Cointelegraph provides 24/7 news coverage from every time zone, with unbiased insights and a wealth of research and data. Baggs will distill that deluge of information into what is essential and deliver it directly to your ears, Monday to Friday. Whether it’s market-moving events, legal drama, new fintech, the highs, the lows or the oddities of the crypto space, the <em>Rise ‘n’ Crypto </em>podcast will cover it all, from the biggest market-shaking stories to the fascinating and quirky of the past 24 hours.</p><template data-ct-widget=\"buzzsprout\" data-buzzsprout-podcast-id=\"2274877\"></template><p>So, if you want to stay ahead of the curve in crypto, follow or subscribe to <em>Rise ‘n’ Crypto</em> on <a href=\"https://open.spotify.com/show/3on3k67Uli3L55lgchFzY8\" target=\"_blank\" rel=\"noopener nofollow\">Spotify</a>, <a href=\"https://podcasts.apple.com/ru/podcast/rise-n-crypto/id1716325344?l=en-GB\" target=\"_blank\" rel=\"noopener nofollow\">Apple Podcasts</a> or your favorite platform. You can also check out Cointelegraph’s full catalog of informative podcasts on the <a href=\"https://cointelegraph.com/podcasts\">Cointelegraph Podcasts page</a>.</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-14T13:36:50.000Z",
    "title": "FTX, BlockFi claims settlement allowed to proceed, judge declares",
    "url": "http://cointelegraph.com/news/ftx-block-fi-claims-settlement-allowed-to-proceed",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/33136413-4d88-4235-8030-e9a4911db2c1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A U.S. bankruptcy court judge has ordered the end of an automatic holding placed on claims settlement proceedings between the two bankrupt crypto companies FTX and BlockFi.</p>\n                    <p><p>Bankrupt crypto companies FTX and BlockFi are allowed to proceed in negotiations for their claims settlement, according to a new court filing.</p><p>On Nov. 13, United States bankruptcy Judge Michael Kaplan ordered the end of an automatic holding placed on proceedings between the two firms. FTX debtors can now pursue their “arguments, defenses, counterclaims, setoffs, or otherwise” concerning the BlockFi claims in the FTX bankruptcy proceeding.</p><p>Both entities filed for Chapter 11 bankruptcy status in November 2022 after the implosion of FTX at the beginning of that month. BlockFi is estimated to have had around $355 million in funds frozen on the FTX platform, with an additional $671 million owed by Alameda Research. </p><p>The order also said that FTX debtors would have no right to “receive an affirmative distribution from the BlockFi Debtors” and that both parties should file a mediation with the U.S. Bankruptcy Court for the District of Delaware as soon as possible. </p><p>Once filed, mediation will begin “no later” than Dec. 24, 2023.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-legal-team-testimony-ftx-terms-service\"><strong><em>Sam Bankman-Fried’s legal team moves to pursue theory on FTX terms of service</em></strong></a></p><p>BlockFi CEO Zac Prince testified against Sam Bankman-Fried during his five-week criminal trial in which the former FTX CEO was found guilty of all charges against him. </p><p>Prince and the BlockFi team <a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-updates\">presented evidence on Oct. 13</a>, which showed that if FTX had not gone under, BlockFi would not have had to file for bankruptcy regardless of ongoing bear market conditions. The company lost “a little over a billion dollars” in the collapse of FTX and Alameda.</p><p>BlockFi was allowed by the court in August to repay its U.S.-based Wallet customers, though withdrawals were prohibited at the time. Shortly after, in September, BlockFi creditors approved a bankruptcy restructuring plan, which was then <a href=\"https://cointelegraph.com/news/crypto-lender-block-fi-liquidation-plan-approval-repay-customer\">approved by the court</a> on Sept. 26. </p><p>On Oct. 24, BlockFi released a blog post saying <a href=\"https://cointelegraph.com/news/blockfi-emerges-bankruptcy-opens-wallet-withdrawals\">it would begin paying back</a> some of its creditors and that withdrawals “are currently available to nearly all Wallet customers.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/interview-2-years-after-john-mcafee-death-wife-janice-broke-still-grieving/\"><strong><em>Exclusive: 2 years after John McAfee’s death, widow Janice is broke and needs answers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-14T13:28:30.000Z",
    "title": "Tether credits USDT growth surge to ETF excitement, emerging markets",
    "url": "http://cointelegraph.com/news/tether-usdt-growth-spot-bitcoin-etf",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/4177ad84-c611-4788-991e-aadbcdce8a64.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Tether USDT added at least $20 billion to its market capitalization in 2023, while rival stablecoin USDC lost the same amount so far this year.</p>\n                    <p><p>Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>), the largest stablecoin by market value, has been breaking new records over the course of 2023, with its market capitalization adding at least $20 billion so far this year.</p><p>According to data from the blockchain data provider Whale Alert, <a href=\"https://cointelegraph.com/news/tether-issues-4-billion-usdt-4-weeks\">Tether has minted 22.75 billion USDT so far this year</a>, with at least 4 billion USDT being issued over the past four weeks.</p><p>After starting the year with a market cap of roughly $66 billion, Tether USDT has been steadily gaining momentum, with its market value surpassing $80 billion in April 2023. On Nov. 14, USDT market cap briefly hit $87 billion, <a href=\"https://www.coingecko.com/en/coins/tether\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to data from CoinGecko.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/e1a0e7b1-b271-4eb1-bb86-b63847073b84.png\"  /><figcaption style=\"text-align: center;\"><em>Tether USDT all-time market capitalization. Source: CoinGecko</em></figcaption></figure><p>According to a spokesperson for Tether, the ongoing USDT growth should be attributed to two key reasons, including the ongoing market excitement around the possible approval of a spot Bitcoin exchange-traded fund (ETF).</p><p>“There is a growing interest in Bitcoin from institutional investors, driven by the excitement around the possibility of a Bitcoin ETF,” a Tether representative said.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/first-deadline-window-looms-for-sec-to-approve-bitcoin-etfs-law-decoded-nov-6-13\"><strong><em>First deadline window looms for SEC to approve Bitcoin ETFs: Law Decoded</em></strong></a></p><p>Tether's record-breaking growth has also been fuelled by growing demand in emerging markets, according to the company’s spokesperson. The USDT stablecoin has been “increasingly establishing itself as the de-facto digital dollar” for all emerging markets and developing countries, the representative said, adding:</p><blockquote>“There are in fact many countries suffering from the devaluation of their national currencies compared to the dollar, hence all the communities living in those countries are seeking protection [...] USDT is the most trusted asset for them.”</blockquote><p>Citing public information from the Brazilian government, Tether sai that <a href=\"https://cointelegraph.com/news/brazil-usdt-adoption-soars-2023-80-crypto-transactions\">Tether USDT accounts for 80% of all crypto transactions</a> in Brazil. “This pattern is similar to tens of other countries,” the representative noted.</p><p>While Tether has been seeing this surge, some major stablecoins like Circle’s USDC (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) have failed to gain much momentum in 2023. After peaking at $55 billion in June 2022, USDC market capitalization has gradually dropped and continued to decline in 2023. Since January 2023, USDC has lost $20 billion in market value, or about 45%. At the time of writing, USDC 's market cap stands at $24 billion, <a href=\"https://www.coingecko.com/en/coins/usdc\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to CoinGecko.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-14T14:00:52.000Z",
    "title": "Vitalik Buterin signals potential Plasma scaling resurgence with tech enhancements",
    "url": "https://cryptoslate.com/vitalik-buterin-signals-potential-plasma-resurgence-with-tech-enhancements/",
    "description": "<p>In a recent blog post, Ethereum co-founder Vitalik Buterin revisited the concept of Plasma, a once-prominent scaling solution, underscoring its potential resurgence in the blockchain ecosystem with new technological advancements. As Vitalik Buterin explains, Plasma, a blockchain scaling framework first introduced in 2017, is poised for a comeback. Initially overshadowed by rollup technology due to [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/vitalik-buterin-signals-potential-plasma-resurgence-with-tech-enhancements/\">Vitalik Buterin signals potential Plasma scaling resurgence with tech enhancements</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-14T13:42:02.000Z",
    "title": "US inflation cools down with Bitcoin reacting mildly to new CPI data",
    "url": "https://cryptoslate.com/insights/us-inflation-cools-down-with-bitcoin-reacting-mildly-to-new-cpi-data/",
    "description": "<p>Quick Take The recently released U.S. inflation data portrays a compelling story. The headline inflation Year-over-Year (YoY) for October was expected to be 3.3%, while it actually recorded a slightly slower pace at 3.2%, down from September&#8217;s 3.7%. Similarly, the core inflation YoY, a measure excluding volatile food and energy prices, also displayed a downtrend. [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/us-inflation-cools-down-with-bitcoin-reacting-mildly-to-new-cpi-data/\">US inflation cools down with Bitcoin reacting mildly to new CPI data</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-14T13:40:04.000Z",
    "title": "Ripple CEO Brad Garlinghouse warns of deepfake scams targeting the XRP community",
    "url": "https://cryptoslate.com/ripple-ceo-brad-garlinghouse-warns-of-deepfake-scams-targeting-the-xrp-community/",
    "description": "<p>Brad Garlinghouse, CEO of Ripple, expressed concern over the surge in deepfake videos impersonating him to promote fraudulent schemes and false giveaways. In a Nov. 13 post on social media platform X, Garlinghouse pointed out an &#8220;uptick in deepfake scam videos overlaying new words with old video footage from Ripple&#8217;s events&#8221; on YouTube. His reaction [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ripple-ceo-brad-garlinghouse-warns-of-deepfake-scams-targeting-the-xrp-community/\">Ripple CEO Brad Garlinghouse warns of deepfake scams targeting the XRP community</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-14T13:23:24.000Z",
    "title": "Security Audits Miss Vulnerabilities As Raft Hacked For $6.7M",
    "url": "https://cryptodaily.co.uk/2023/11/security-audits-miss-vulnerabilities-as-raft-hacked-for-67m",
    "description": "Despite taking precautions, the DeFi protocol Raft fell victim to a security exploit last week, which resulted in a total loss of $6.7 million worth of funds."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-14T13:25:03.000Z",
    "title": "Ripple (XRP) and Polygon (MATIC) Expect Significant Turnaround Ahead of 2024",
    "url": "https://cryptodaily.co.uk/2023/11/ripple-xrp-and-polygon-matic-expect-significant-turnaround-ahead-of-2024",
    "description": "Explore the latest developments in Ripple (XRP) and Polygon (MATIC) as they steer through a volatile crypto market. Our analysis sheds light on the robust response of XRP to rumors and the growth of MATIC despite market hurdles. Understand the potential for bullish rises and bearish downturns as these currencies approach 2024. Get ahead in the cryptocurrency sphere with our insights, navigating the nuances of these two compelling digital assets in an ever-changing financial landscape."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-14T13:58:09.000Z",
    "title": "Rootstock Grants Program Opens Wave 3: $2.5 Million for Groundbreaking Crypto Projects",
    "url": "https://cryptodaily.co.uk/2023/11/rootstock-grants-program-opens-wave-3-25-million-for-groundbreaking-crypto-projects",
    "description": "Rootstock Grants Program Opens Wave 3: $2.5 Million for Groundbreaking Crypto Projects"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-14T13:46:25.000Z",
    "title": "Australia tax office tightens grip on DeFi transactions",
    "url": "https://www.cryptopolitan.com/australia-tax-office-tightens-grip-on-defi/",
    "description": "The Australian Taxation Office (ATO) has recently issued fresh guidelines outlining the tax implications for decentralized finance (DeFi) activities and the process of wrapping and unwrapping crypto tokens. This move follows their May 2022 agenda, highlighting crypto capital gains as a priority topic. Consequently, the ATO&#8217;s new guidance sheds light on the intricate tax responsibilities ... <a title=\"Australia tax office tightens grip on DeFi transactions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/australia-tax-office-tightens-grip-on-defi/\" aria-label=\"More on Australia tax office tightens grip on DeFi transactions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-14T13:39:20.000Z",
    "title": "Exploring ChatGPT’s Role in Automated Malware Creation",
    "url": "https://www.cryptopolitan.com/exploring-chatgpts-role-in-automated-malware/",
    "description": "As artificial intelligence (AI) technologies, including ChatGPT, become more prevalent, concerns about their potential misuse in cybercriminal activities have grown. This blog delves into the effectiveness of ChatGPT&#8217;s safety measures, the risk of AI misuse by malicious actors, and the limitations of current AI models. ChatGPT, an advanced language model developed by OpenAI, gained widespread ... <a title=\"Exploring ChatGPT&#8217;s Role in Automated Malware Creation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/exploring-chatgpts-role-in-automated-malware/\" aria-label=\"More on Exploring ChatGPT&#8217;s Role in Automated Malware Creation\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-14T14:00:49.000Z",
    "title": "Bitcoin Price Ready To Go ‘Supersonic’, Analyst Says",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-supersonic/",
    "description": "Popular crypto analyst Don Alt has joined the bandwagon of predictions pertaining to Spot Bitcoin ETFs. Don Alt recently took to social media platform X to convey a strong bullish Bitcoin price sentiment, issuing a forecast that the cryptocurrency is on the verge of going supersonic to $60,000 in the coming months.  Even a $100,000 price point is not out of the books, according to this analyst. The catalyst for this potential liftoff? The long-awaited approval of a Spot Bitcoin ETF in the US.  Bitcoin’s Supersonic Rally to $60,000 Don Alt is known for accurately predicting Bitcoin price points in the past and correctly pinpointed the crypto&#8217;s lowest price point in 2022. Now, Don Alt is of the notion that Bitcoin is poised for a massive price surge in the coming months that could send it soaring to $60,000. Related Reading: Crypto Analyst Says One Day Left Until XRP Price Blast-Off, What To Expect It&#8217;s no news that this recent rally is due to the excitement around the SEC&#8217;s approval of spot Bitcoin ETFs and the analyst thinks this rally will continue until a $60,000 price point. The digital currency is already up by 121% since the beginning of the year and has broken multiple yearly highs in the past month.  The longer the SEC takes to approve the applications, the higher the rally will continue in anticipation. However,  the analyst took a different line of thinking and considered the likelihood of a price decrease after the approval.  Don Alt mentioned that the approval might turn into a &#8220;sell the news moment,&#8221; implying that there might be many more bears waiting to take advantage of the price jump to sell off than the market thinks.  “Now, after the ETF gets approved, things might get a bit tricky. It could be a ‘sell-the-news’ moment, or maybe not. To be honest, I don’t know,” Don Alt said. This line of reasoning resonates with economist Peter Schiff, who warned that approval of Spot Bitcoin ETFs might lead to a Bitcoin price decline. Schiff also believes that there could be a larger number of people sitting on their assets in anticipation of an opportunity to sell at a higher price.  On-chain data shows that large investors have been selling off in light of profit-taking. Bitcoin whales and sharks have sold around 60,000 BTC, worth about $2.2 billion in the past week. Bitcoin Price To $100,000? Don Alt dismissed bearish sentiments, particularly those waiting for a Bitcoin pullback to $12,000. “BTC is more likely to go to $100,000 here than it is to go back to $12,000,” he said. Related Reading: Renowned Economist Warns Of Bitcoin Crash Before Spot ETF Approvals The SEC is slated to decide on 12 ETF applications by November 17, although they might not be approved until January 2024. At the time of writing, Bitcoin&#8217;s rally has slowed down, and the asset has consolidated just below and above the $37,000 price point.  BTC maintains support above $36,400 &#124; Source: BTCUSD on Tradingview.com Featured image from Cointribune, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-14T14:01:30.000Z",
    "title": "Beyond The Hype: GameStop Memes Emerges With $2 Million In 24 Hours, Challenging Ethereum And Solana",
    "url": "https://www.crypto-news-flash.com/beyond-the-hype-gamestop-memes-emerges-with-2-million-in-24-hours-challenging-ethereum-and-solana/?utm_source=rss&utm_medium=rss&utm_campaign=beyond-the-hype-gamestop-memes-emerges-with-2-million-in-24-hours-challenging-ethereum-and-solana",
    "description": "<img width=\"1600\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/h.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/h.png 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/h-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/h-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/h-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/h-1536x864.png 1536w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />Ethereum (ETH) and Solana (SOL) have long been regarded as top-tier cryptocurrencies. Ethereum, often touted as the second-best cryptocurrency after Bitcoin, is currently showing promising signs, with analysts predicting a potential surge. Meanwhile, Solana, after a dip in value in 2020, has rebounded impressively and is now gaining recognition as one of the best altcoins [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-14T13:59:00.000Z",
    "title": "Will Cardano Be Beaten To $1.00 Buy Nugget Rush?",
    "url": "https://www.crypto-news-flash.com/will-cardano-be-beaten-to-1-00-buy-nugget-rush/?utm_source=rss&utm_medium=rss&utm_campaign=will-cardano-be-beaten-to-1-00-buy-nugget-rush",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-29-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-29-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-29-1-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Cardano is trading below $0.40. NuggetRush, an ICO token, is tipped to reach the $1.00 mark ahead of ADA. Early holders of the NuggetRush token will see a 100% increase in their investment. The crypto landscape isn’t only a world of innovation and potential but also one filled with surprises. It is without a doubt [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-14T13:47:29.000Z",
    "title": "Bitcoin Fees Soar to Highest Levels Since May, Will it Crack BTC Price to $20,000?",
    "url": "https://www.crypto-news-flash.com/bitcoin-fees-soar-to-highest-levels-since-may-will-it-crack-btc-price-to-20000/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-fees-soar-to-highest-levels-since-may-will-it-crack-btc-price-to-20000",
    "description": "<img width=\"921\" height=\"515\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Bitcoin-Lightning.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Bitcoin-Lightning.jpg 921w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Bitcoin-Lightning-300x168.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Bitcoin-Lightning-768x429.jpg 768w\" sizes=\"(max-width: 921px) 100vw, 921px\" />Transaction fees on the Bitcoin network have hit their highest levels since the Ordinals NFT frenzy drove them up in May, a rise that has some experts worried about the BTC price. Some, however, counter the argument, saying that the high fees only incentivize miners to invest more in BTC, boosting its security. Bitcoin fees [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-14T13:15:58.000Z",
    "title": "Ethereum & Filecoin Succeed With Recent Bull Market While GameStop Memes Has Thrived With Over $2 Million In 24 Hours",
    "url": "https://www.crypto-news-flash.com/ethereum-filecoin-succeed-with-recent-bull-market-while-gamestop-memes-has-thrived-with-over-2-million-in-24-hours/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-filecoin-succeed-with-recent-bull-market-while-gamestop-memes-has-thrived-with-over-2-million-in-24-hours",
    "description": "<img width=\"1920\" height=\"1080\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/fg.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/fg.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/fg-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/fg-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/fg-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/fg-1536x864.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />The cryptomarket is massively boosting everywhere, as all the coins have managed to reach higher revenues. According to the latest news, Ethereum and Filecoin have won the race, as they have gained advantage from the bull market. For anyone who doesn&#8217;t know, a bull market plays a major role in the crypto currency market, as [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-14T13:52:36.000Z",
    "title": "The Ebb and Flow of DAOs: Unraveling the Decline in Adoption",
    "url": "https://www.altcoinbuzz.io/spotlight/the-ebb-and-flow-of-daos-unraveling-the-decline-in-adoption/",
    "description": "<p>In recent years have witnessed a notable decline in the adoption of DAOs. Raising questions about the factors contributing to this downturn. According to Google Trends, the search interest in the topic &#8220;Decentralized autonomous organization&#8221; (DAOs) peaked (100 points) around the same time in 2021. Source: Google Trends In this article, we explore the various [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/spotlight/the-ebb-and-flow-of-daos-unraveling-the-decline-in-adoption/\">The Ebb and Flow of DAOs: Unraveling the Decline in Adoption</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-14T13:48:00.000Z",
    "title": "Ethereum Network Fees Rise Due to Price and Utility Uptick",
    "url": "https://coinedition.com/ethereum-network-fees-rise-due-to-price-and-utility-uptick/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Ethereum.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Ethereum.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Ethereum-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Ethereum-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Ethereum-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Ethereum-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Santiment shared in an X post published earlier today that network fees for Ethereum (ETH) have risen after the altcoin was able to break above $2K. According to the post, network fees for Ethereum rose to as high as $5.72 per transaction this past Sunday. Notably, this is the highest network fee that has risen [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/ethereum-network-fees-rise-due-to-price-and-utility-uptick/\">Ethereum Network Fees Rise Due to Price and Utility Uptick</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-14T13:44:12.000Z",
    "title": "Solana (SOL) Price Prediction 2023-2030: Will SOL Price Hit $80 Soon?",
    "url": "https://coinedition.com/solana-sol-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Solana-SOL-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Solana-(SOL)-Price-Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Solana-SOL-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Solana-SOL-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Solana-SOL-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Solana-SOL-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Solana-SOL-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Aside from Bitcoin (BTC) and Ethereum (ETH), there are other digital currencies worth considering for people looking to diversify their portfolios and get experience with new cryptocurrencies, Solana (SOL) is one of them. Solana is an open-source, public blockchain that facilitates using smart contracts, decentralized applications (dApps), and NFTs (non-fungible tokens). The SOL token, which [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/solana-sol-price-prediction/\">Solana (SOL) Price Prediction 2023-2030: Will SOL Price Hit $80 Soon?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-14T13:24:00.000Z",
    "title": "XRP Spikes 15%; Community Still Confused Whether ETF Filing True Or Not",
    "url": "https://coinedition.com/xrp-spikes-15-community-still-confused-whether-etf-filing-true-or-not/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Follow_the_blue_indicator_line_XRP_whale_addresses_supply_held_went.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Follow_the_blue_indicator_line_XRP_whale_addresses_supply_held_went\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Follow_the_blue_indicator_line_XRP_whale_addresses_supply_held_went.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Follow_the_blue_indicator_line_XRP_whale_addresses_supply_held_went-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Follow_the_blue_indicator_line_XRP_whale_addresses_supply_held_went-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Follow_the_blue_indicator_line_XRP_whale_addresses_supply_held_went-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Follow_the_blue_indicator_line_XRP_whale_addresses_supply_held_went-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Follow_the_blue_indicator_line_XRP_whale_addresses_supply_held_went-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A recent filing for one of the largest asset managers, BlackRock fund on XRP was highlighted on the official Delaware website that registers investment trusts incorporated in the state. Bloomberg reported that a spokesperson from the asset manager confirmed it was “false.” Several analysts observed that XRP experienced more than a 15% surge over this [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/xrp-spikes-15-community-still-confused-whether-etf-filing-true-or-not/\">XRP Spikes 15%; Community Still Confused Whether ETF Filing True Or Not</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-11-14T13:17:43.000Z",
    "title": "Bitfinex to List Celestia $TIA Token, Pioneering the Future of Modular Blockchain Innovation",
    "url": "https://blog.bitfinex.com/media-releases/bitfinex-to-list-celestia-tia-token-pioneering-the-future-of-modular-blockchain-innovation/",
    "description": "<p>Bitfinex to List Celestia $TIA Token, Pioneering the Future of Modular Blockchain Innovation ROAD TOWN, British Virgin Islands – November 14, 2023 – Bitfinex (https://www.bitfinex.com/), a cutting-edge digital token trading platform, is delighted to announce the upcoming listing of the Celestia, $TIA token.&#160; Celestia is...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/media-releases/bitfinex-to-list-celestia-tia-token-pioneering-the-future-of-modular-blockchain-innovation/\">Bitfinex to List Celestia $TIA Token, Pioneering the Future of Modular Blockchain Innovation</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]