[
  {
    "source": "CoinDesk",
    "date": "2023-08-02T21:15:22.000Z",
    "title": "Wintermute, a Major Trader, Is a Key Player in Arkham’s Controversial Dox-to-Earn Platform",
    "url": "https://www.coindesk.com/business/2023/08/02/wintermute-a-major-trader-is-a-key-player-in-arkhams-controversial-dox-to-earn-platform/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The liquidity provider just withdrew 8 million of Arkham’s ARKM token from Binance, increasing its position by 731%."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-02T21:33:21.000Z",
    "title": "AI Investments Could Surge to $200 Billion Globally by 2025: Report",
    "url": "https://decrypt.co/151053/ai-investment-global-economy-200-billion",
    "description": "For Goldman Sachs, the growth of AI could have a greater impact than the discovery of electricity or the arrival of personal computers."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-02T21:16:30.000Z",
    "title": "New York Bill Would Protect Writers and Actors From Being Replaced by AI",
    "url": "https://decrypt.co/151046/new-york-proposed-law-prevent-ai-replacing-people",
    "description": "Legislators at both state and federal levels are moving to protect people and jobs."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T21:29:10.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting the Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>The United States Department of Justice (DoJ) is reportedly concerned about pursuing criminal charges against Binance. Meanwhile, Worldcoin could allow governments and businesses to utilize its iris-scanning and identity-verifying technology in an effort to onboard more users. MicroStrategy is back to profitability and said it holds around $4.4 billion worth of Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC</a>) but is still looking to buy more. </p><h2>DoJ warns of run on Binance should exchange be prosecuted: Report</h2><p>Officials at the United States Department of Justice are reportedly concerned about <a href=\"https://cointelegraph.com/news/us-doj-concerned-binance-run-prosecutors-fraud-charges\">pursuing charges against Binance</a> due to a potental run on the crypto exchange’s assets. </p><p>Citing DoJ officials, an Aug. 2 Semafor report said the federal department is worried about another FTX-like bank run should Binance face legal actions. As such, officials are mulling over fines and other non-prosecution agreements for the exchange instead of pressinging crominal charges. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The SEC has taken to using extremely aggressive and intimidating tactics in its pursuit of an ideological campaign against the American digital asset industry. <a href=\"https://t.co/AZwoBOgsqS\">https://t.co/AZwoBOgsqS</a> and our business partners have not been spared in the use of these tactics, which has created… <a href=\"https://t.co/rlIe6swIoY\">pic.twitter.com/rlIe6swIoY</a></p>&mdash; Binance.US  (@BinanceUS) <a href=\"https://twitter.com/BinanceUS/status/1666996908651323393?ref_src=twsrc%5Etfw\">June 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Binance has been caught in regulatory crosshairs in many jurisdictions worldwide. In the United States, the Changpeng Zhao-led exchange is reportedly the target of a criminal probe for allegedly <a href=\"https://cointelegraph.com/news/us-justice-department-investigating-binance-for-violating-russian-sanctions-report\">violating sanctions on Russia</a>. The Securities and Exchange Commission also <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">filed a lawsuit</a> against the exchange over allegations of unregistered securities offerings. </p><h2>Worldcoin to allow government and businesses to use ID system: Report</h2><p>Worldcoin reportedly plans to allow governments and businesses to utilize its iris-scanning and identity-verifying technology in an effort to onboard more users.</p><p>Ricardo Macieira, the general manager for Europe at Tools For Humanity, which is behind the Worldcoin project, said that the company is on a mission of “building the biggest financial and identity community” possible. According to a Reuters report, Macieira revealed that the company os on a mission of “building the biggest financial and identity community.”</p><blockquote>\"The idea is that as we build this infrastructure and that we allow other third parties to use the technology.\"</blockquote><p>Additionally, Worldcoin plans to potentially allow companies to use its digital identity system, thus eliminating the need to gather personal data.</p><h2>MicroStrategy back in black, owns nearly 153K Bitcoin </h2><p>One of the United States' largest corporate holders of Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\"> (BTC</a>), MicroStrategy, returned to profitability in Q2 2023 amid Bitcoin's price surge and disclosed it now holds $4.4 billion worth of the cryptocurrency.</p><p>MicroStrategy's <a href=\"https://cointelegraph.com/news/microstrategy-earnings-profit-second-quarter-bitcoin\">second-quarter earnings</a> released Aug. 1 reported $22.2 million in net income — a stark comparison to the $1.1 billion net loss recorded in Q2 2022.</p><p>“Our bitcoin holdings increased to 152,800 bitcoins as of July 31, 2023,  with the addition in the second quarter of 12,333 bitcoins being the largest increase in a single quarter since Q2 2021,” said MicroStrategy CFO Andrew Kang.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">In July, <a href=\"https://twitter.com/MicroStrategy?ref_src=twsrc%5Etfw\">@MicroStrategy</a> acquired an additional 467 BTC for $14.4 million and now holds 152,800 BTC. Please join us at 5pm ET as we discuss our Q2 2023 financial results and answer questions about the outlook for <a href=\"https://twitter.com/hashtag/BusinessIntelligence?src=hash&amp;ref_src=twsrc%5Etfw\">#BusinessIntelligence</a> and <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a>.  <a href=\"https://twitter.com/search?q=%24MSTR&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$MSTR</a> <a href=\"https://t.co/SCHeBJ80TH\">https://t.co/SCHeBJ80TH</a></p>&mdash; Michael Saylor⚡️ (@saylor) <a href=\"https://twitter.com/saylor/status/1686468084574412800?ref_src=twsrc%5Etfw\">August 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The firm incurred digital asset impairment losses of $24.1 million in the quarter compared to its $917.8 million in Q2 2022.</p><p>MicroStrategy is planning a $750 million raise through a stock sale and it hinted it could use the proceeds to <a href=\"https://cointelegraph.com/news/microstrategy-bitcoin-purchase-plans-750m-stock-sale\">buy even more</a> Bitcoin, according to an Aug. 1 filing with the Securities and Exchange Commission.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T21:19:36.000Z",
    "title": "Curve emergency DAO terminates rewards for hack-related pools",
    "url": "https://cointelegraph.com/news/curve-emergency-dao-terminates-rewards-for-hack-related-pools",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/bfbec56a-0a87-4c98-a062-958730d51511.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Curve emergency DAO removed CRV rewards for alETH, msETH, pETH, crvCRVETH, Arbitrum Tricrypto, and multiBTC pools.</p>\n                    <p><p>The Curve Finance (CRV) lending protocol has terminated governance token rewards for select liquidity pools affected by the July 30 Curve exploit and July 6 Multichain exploit, according to an August 2 social media post from a member of the protocol’s governing body. </p><p>The ending of rewards was carried out by the Curve emergency decentralized autonomous organization (Curve E-DAO), a committee made up of select members of the Curve DAO governing body. It affected pools for alETH+ETH, msETH-ETH, pETH-ETH, crvCRVETH, Arbitrum Tricrypto, and multibtc3CRV, according to the announcement. The decision can be overridden in the future by a full vote of Curve DAO.</p><p>The change was announced by Curve E-DAO member Gabriel Shapiro.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">ATTENTION, FROM A CURVE E-DAO SIGNER: <br><br>The <a href=\"https://twitter.com/CurveFinance?ref_src=twsrc%5Etfw\">@CurveFinance</a> emergency multisig has terminated CRV rewards (gauges) to the liquidity pools affected by recent exploits, including pools affected by the recent Vyper compiler exploit and the multiBTC pool affected by the recent…</p>&mdash; _gabrielShapir0 (@lex_node) <a href=\"https://twitter.com/lex_node/status/1686802793275813902?ref_src=twsrc%5Etfw\">August 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On July 6, over $100 million worth of cryptocurrency <a href=\"https://cointelegraph.com/news/multichain-mpc-bridge-sees-millions-in-outflows-exploit-feared\">was withdrawn from a number of bridges</a> that were part of the Multichain protocol. The Multichain team stated that the withdrawals were “abnormal” and that users should stop using Multichain. At the time, the Curve team <a href=\"https://twitter.com/CurveFinance/status/1677056825584152576\" target=\"_blank\" rel=\"noopener nofollow\">warned</a> its users to “Exit multichain assets such as multiBTC (including the pool),” implying that its own multibtc3CRV liquidity pool was at risk from the Multichain incident.</p><p>On July 14, the Multichain team stated that the withdrawals had been <a href=\"https://cointelegraph.com/news/multichain-stops-operations-over-lack-of-funds\">caused by an unknown individual</a> who had gained access to their CEOs cloud computing account, implying that the funds had been exploited and may never be returned.</p><p>On July 30, Curve Finance itself <a href=\"https://cointelegraph.com/news/curve-finance-pools-exploited-over-24-reentrancy-vulnerability\">was the victim of a reentrancy attack</a>. Over $47 million worth of crypto was lost in the exploit. The attack affected the alETH, msETH, and pETH pools, as these were created using the Vyper protocol that contained the vulnerability. Other Curve pools not created through Vyper were unaffected.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/hackers-compromise-uniswap-founder-twitter-account-promote-scam\"><strong>Hackers compromise Uniswap founder’s Twitter account to promote scam</strong></a></em></p><p>Despite these exploits, the affected pools still produced CRV governance token rewards. This meant that users could still deposit their tokens into the pools to earn CRV. In the August 8 announcement, Shapiro stated that the emergency DAO has now removed these rewards in order to “avoid incentivizing further participation in these compromised pools.”</p><p>Investors have continued to suffer from hacks and scams in July and August. Payment provider Alphapo allegedly <a href=\"https://cointelegraph.com/news/alphapo-payment-provider-hack-estimated-over-60m-on-chain-sleuth\">lost over $60 million</a> on July 23 due to an attacker gaining access to its hot wallet private keys. The company has not confirmed the alleged attack, but on-chain sleuths have argued that the transfers are abnormal and probably the result of a hack. On July 25, zkSync <a href=\"https://cointelegraph.com/news/era-lend-zksync-exploited-reentrancy-attack\">was also exploited</a> for $3.4 million due to a read-only reentrancy bug.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-02T21:30:31.000Z",
    "title": "Asset managers’ interests pivot to Ethereum futures ETFs",
    "url": "https://cryptoslate.com/asset-managerss-interest-pivots-to-ethereum-futures-etfs/",
    "description": "<p>At least six asset managers, including Grayscale, have submitted an Ethereum (ETH) futures exchange-traded fund (ETF) filing application with the U.S. Securities and Exchange Commission (SEC). The applications are coming in less than two months after the financial regulator received an avalanche of Spot Bitcoin (BTC) ETF applications from several traditional financial institutions, including BlackRock. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/asset-managerss-interest-pivots-to-ethereum-futures-etfs/\">Asset managers&#8217; interests pivot to Ethereum futures ETFs</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-02T21:30:27.000Z",
    "title": "HEX Plummets Over 40% After SEC Files Lawsuit Against Creator Richard Heart",
    "url": "https://news.bitcoin.com/hex-plummets-over-40-after-sec-files-lawsuit-against-creator-richard-heart/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/hio90-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"HEX Plummets Over 40% After SEC Files Lawsuit Against Creator Richard Heart\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/hio90-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/hio90-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/hio90-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/hio90-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/hio90-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/hio90-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/hio90.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />After the U.S. Securities and Exchange Commission filed a lawsuit against Richard Heart and his companies Hex, Pulsechain and Pulsex, the crypto asset hex (HEX) has been in a free fall. Two-week statistics show HEX has lost 41.7% against the U.S. dollar and 35.8% over the past seven days. Uniswap Delists HEX Following SEC Lawsuit; [&#8230;]"
  }
]