[
  {
    "source": "Cointelegraph",
    "date": "2023-12-08T10:00:00.000Z",
    "title": " Developers of Bitcoin sidechain MVC prepare for BRC-20 DEX launch ",
    "url": "https://cointelegraph.com/news/bitcoin-sidechain-developers-prepare-brc20-dex-launch",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYzBmYjViMzItNGQ5Ni00ODM2LTliNmQtODczOTVhOTdhM2E1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The MVC governance token has surged in 2023 to a fully diluted market cap of over $400 million.  </p>\n                    <p><p data-ct-non-breakable=\"true\">Developers of Bitcoin side-chain MicroVisionChain (MVC) have unveiled a BRC-20 decentralized exchange (DEX) as part of its roadmap for Q1 2024.</p><p>In an interview with Cointelegraph, MVC chief operating officer Jason Kwok claims to have developed a “1:1 mapping relationship” with Bitcoin on its sidechain. “This essentially creates a parallel version of your Bitcoin assets, such as BRC-20, on MVC,” said Kwok, explaining that the bridge allows users to swap BRC-20 token assets on the MVC sidechain, thus bypassing the high transaction and gas fees required to deploy decentralized applications (DApps) on the Bitcoin mainnet.</p><p data-ct-non-breakable=\"true\">In keeping with the spirit of Bitcoin’s creator, Satoshi Nakamoto, Kwok explains that MVC has no particular founders or corporate headquarters. Instead, the sidechain is a “collaborative endeavor” involving many development teams that form the Bitcoin ecosystem.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-sidechain-developers-prepare-brc20-dex-launch\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-08T09:52:00.000Z",
    "title": " Can cryptocurrencies be frozen on a blockchain? ",
    "url": "https://cointelegraph.com/explained/can-cryptocurrencies-be-frozen-on-a-blockchain",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy8zNjc2ZGRjYWJkY2FhM2IxYjc3ZWNhODI3NWNiNzZiZC5qcGc=.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Cryptocurrencies can be frozen on a blockchain under certain legal, regulatory and technical conditions.</p>\n                    <p><p data-ct-widget=\"explained-block-content\">                </p><p><em>Frozen funds typically mean access to such funds has been restricted or temporarily halted.</em></p><p>Several factors, such as technological errors, security precautions, disagreements, investigations and regulatory compliance, can lead to such circumstances. So, can a crypto exchange freeze your account?</p><p><a href=\"https://cointelegraph.com/explained/can-cryptocurrencies-be-frozen-on-a-blockchain\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-08T10:00:40.000Z",
    "title": "Institutional Traders’ BTC Holding Percentage Increased ‘Almost Twofold’ Between January and September — Study",
    "url": "https://news.bitcoin.com/institutional-traders-btc-holding-percentage-increased-almost-twofold-between-january-and-september-study/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2249482389-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Institutional Traders&#039; BTC Holding Percentage Increased &#039;Almost Twofold&#039; Between January and September — Study\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2249482389-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2249482389-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2249482389-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2249482389-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2249482389-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2249482389-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/shutterstock_2249482389.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The bitcoin held by institutional traders (INS) in their respective crypto portfolios saw an &#x201C;almost twofold&#x201D; increase in the initial three quarters of 2023. Institutional traders&#x2019; BTC allocation shifted from under 40% in January to nearly 50% by the end of September. The Spot Bitcoin ETF Factor According to a study conducted by the crypto [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-08T09:58:22.000Z",
    "title": "Binance to resume AEUR spot trading on December 8 – All you need to know",
    "url": "https://www.cryptopolitan.com/binance-to-resume-aeur-spot-trading-on-dec-8/",
    "description": "This week, AEUR has been on a rollercoaster price ride on Binance. AEUR was involved in a market controversy a few days ago, and trading on Binance came to a halt. Binance announced today that it would begin spot trading for AEUR/USDT, BTC/AEUR, ETH/AEUR, and EUR/AEUR spot trading pairs on 2023-12-08 at 14:00 (UTC).&#160; Binance ... <a title=\"Binance to resume AEUR spot trading on December 8 &#8211; All you need to know\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-to-resume-aeur-spot-trading-on-dec-8/\" aria-label=\"More on Binance to resume AEUR spot trading on December 8 &#8211; All you need to know\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-08T09:48:59.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin, capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-08T09:41:55.000Z",
    "title": "Meta Launches ‘Purple Llama’ Project for Responsible AI Development",
    "url": "https://www.cryptopolitan.com/meta-launches-purple-llama-project/",
    "description": "Meta Platforms Inc., the parent company of Facebook, has introduced a new project called &#8220;Purple Llama&#8221; aimed at promoting responsible and ethical use of artificial intelligence (AI). This initiative reflects Meta&#8217;s commitment to advancing AI technologies while ensuring ethical and safe development. Promoting responsible AI development The &#8220;Purple Llama&#8221; project is designed to provide developers ... <a title=\"Meta Launches &#8216;Purple Llama&#8217; Project for Responsible AI Development\" class=\"read-more\" href=\"https://www.cryptopolitan.com/meta-launches-purple-llama-project/\" aria-label=\"More on Meta Launches &#8216;Purple Llama&#8217; Project for Responsible AI Development\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-08T09:56:26.000Z",
    "title": "Experts explain why two ETF industry giants are sitting out Bitcoin-ETF race",
    "url": "https://crypto.news/experts-explain-why-two-etf-industry-giants-are-sitting-out-bitcoin-etf-race/",
    "description": "Despite all the hype surrounding spot a Bitcoin (BTC) exchange traded fund (ETF), two of the biggest issuers in the industry are brushing off the buildup. As journalists from Bloomberg note, two of the industry’s three largest ETF companies are&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-08T09:46:52.000Z",
    "title": "Reebok taps Futureverse to expand web3 experience with AI",
    "url": "https://crypto.news/reebok-taps-futureverse-to-expand-web3-experience-with-ai/",
    "description": "American fitness brand Reebok has entered into a collaboration with web3 startup Futureverse. As per an X thread published by Futureverse on Dec. 7, 2023, Reebok is set to dive deep into the web3 with its new initiative dubbed &#8220;Reebok&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-08T09:45:40.000Z",
    "title": "Shiba Inu Team Unveils Enhanced SHIB And BONE Burns, What This Means",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-team-shib-bone-burns/",
    "description": "Shibarium’s burning mechanism has been in the limelight of late, especially with the recent record of over 8 billion Shiba Inu tokens burnt in a single day. This burning mechanism seems to have undergone an update, which could further enhance its performance.  Shibarium Undergoes Swift Hard Fork A screenshot containing a discord message from DaVinci (a member of the Shiba Inu development team) surfaced online recently. In the message, DaVinci mentioned that Shibarium would undergo a hard fork at Block 1962000. That suggests that the upgrade already took place as there are already over 2 million blocks on the layer-2 network at the time of writing. Related Reading: Ethereum Whale With Over $60 Million In Unrealized Profits Moves Coins To Exchange Meanwhile, the main purpose of this hard fork is to enhance the network’s burning mechanism. This will enable support for multiple burn tokens, with BONE and SHIB (the governance tokens of Shibarium) being the main focus. DaVinci also mentioned to node providers that a Genesis update would be required since it was a hard fork.  Further Clarification On What The Hard Fork Entails For Shiba Inu Shibarium had earlier provided clarification of what this new era of the network entails. A blog post published on the Shibarium site mentioned that Shibarium’s burning mechanism will initially be manually managed as part of this upgrade. This is to ensure alignment with the network’s health and sustainability. In this phase, the burn process will be managed by the official deployer. Once that is done, Shibarium will apparently transition to an automated system starting in January. As part of this transition, Shibarium is expected to witness further upgrades in a bid to “enhance efficiency and reliability.” According to the network, the automated burn process “will operate based on predefined rules,” although it didn’t provide further details on this.  Related Reading: Crypto Pundit Reveals Why Bitcoin Is Worth As Much As $17 Million Node provider NOWNodes noted in a blog post that this upgrade will also facilitate mass adoption for Shibarium. That could explain why there is a need to enhance the burning mechanism as part of the upgrade. Considering that there is a correlation between the transaction volume and token burns, Shibarium needs to be well prepared to handle the number of tokens that need to be burnt following a potential increase in transaction count.  The layer-2 network is currently flying high as the total transaction count on it continues to skyrocket. According to data from the Shibarium Explorer, the total transactions on the network stand at over 58 million at the time of writing. Shibarium has surpassed the milestones of 5 million, 10 million, 20 million, and 35 million mark in just about a week.  SHIB price reclaims $0.00001 &#124; Source: SHIBUSD on Tradingview.com Featured image from Crypto News, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-08T09:55:18.000Z",
    "title": "Crypto Community’s New Preferences: Shifting from Polygon (MATIC) and TRON (TRX) to NuggetRush?",
    "url": "https://www.crypto-news-flash.com/crypto-communitys-new-preferences-shifting-from-polygon-matic-and-tron-trx-to-nuggetrush/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-communitys-new-preferences-shifting-from-polygon-matic-and-tron-trx-to-nuggetrush",
    "description": "<img width=\"512\" height=\"384\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-53.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-53.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/unnamed-53-300x225.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Crypto whales made a significant move by acquiring 120 million Polygon (MATIC) tokens worth $90 million in just one week, as noted by analyst Ali Martinez. Coinbase announced plans to introduce perpetual futures contracts for Polygon, expanding its offerings globally. Amazon Managed Blockchain (AMB) Access added support for Polygon&#8217;s proof-of-stake mainnet. TRON (TRX) has shown [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-12-08T09:40:14.000Z",
    "title": "eBay’s Collectible Tokenization: Shaping a Trillion-Dollar Future",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/ebays-collectible-tokenization-shaping-a-trillion-dollar-future/",
    "description": "<p>Collectible tokenization is a cutting-edge concept that involves converting physical collectibles into digital tokens on a blockchain. This process not only ensures the authenticity and provenance of collectibles. But, also introduces new possibilities for ownership, trading, and investment in the digital realm. eBay is Betting on Tokenization eBay aims to harness the potential of this [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/ebays-collectible-tokenization-shaping-a-trillion-dollar-future/\">eBay&#8217;s Collectible Tokenization: Shaping a Trillion-Dollar Future</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]