[
  {
    "source": "CoinDesk",
    "date": "2023-12-14T11:26:20.000Z",
    "title": "Rulematch, a Swiss Crypto Exchange for Banks, Goes Live With Spain's BBVA",
    "url": "https://www.coindesk.com/business/2023/12/14/rulematch-a-swiss-crypto-exchange-for-banks-goes-live-with-spains-bbva/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The institutional crypto platform uses Nasdaq’s trading tech, and comes out the gates with seven banks and securities firms."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T11:37:33.000Z",
    "title": "Tesla’s Recall of 2 Million Vehicles Sparks Concerns About Autonomous Driving Technology",
    "url": "https://www.cryptopolitan.com/teslas-concerns-about-autonomous-driving/",
    "description": "Tesla, the electric vehicle giant, has issued a massive recall of 2 million vehicles in the United States, primarily due to concerns surrounding its Autopilot function. This move comes on the heels of a former Tesla employee&#8217;s whistleblower allegations regarding the safety of the Autopilot feature. While autonomous driving technology has made significant strides, recent [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T11:24:27.000Z",
    "title": "Singapore court interrogates Su Zhu in asset recovery from Three Arrows Capital",
    "url": "https://www.cryptopolitan.com/singapore-court-interrogates-su-zhu-in-asset/",
    "description": "Su Zhu, co-founder of the now-defunct crypto hedge fund Three Arrows Capital (3AC), has faced questioning in a Singapore court as liquidators continue their efforts to recover assets linked to the failed fund.&#160; The two-day court hearing marked a significant development in the ongoing legal proceedings surrounding Three Arrows Capital&#8217;s collapse, shedding light on the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T11:11:01.000Z",
    "title": "Recession concerns grip US: White House and public at odds",
    "url": "https://www.cryptopolitan.com/recession-us-white-house-and-public-at-odds/",
    "description": "Amidst the bustling streets and the daily grind of American life, a shadow of uncertainty looms over the economic landscape. Contrary to the optimistic assurances from the White House, a substantial portion of the populace stands firm in their belief that the United States economy is not just teetering but has already stumbled into the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-14T11:30:38.000Z",
    "title": "Solana Shows Its Mettle As SOL Barrels Past $70 – Details",
    "url": "https://www.newsbtc.com/news/solana-enjoys-better-pastures-as-sol-blows-through-70/",
    "description": "SOL investors are enjoying this year’s festive season as Solana enters the $70 mark today, backed by extremely bullish market conditions. According to CoinGecko, the token is up 12% in the weekly timeframe, with the biggest jump in the monthly at 30%.  Investment manager VanEck also speculates that Solana will join the ETF race, following recent news that the US Securities and Exchange Commission will approve a spot Bitcoin exchange-traded fund, further bringing exposure to traditional investors.  Related Reading: OKX DEX Loses Over $400,000 To Hackers – What Happens To Customer Funds? A Not-So Far Off Possibility VanEck recently released a list of 15 predictions for the crypto world for 2024. In summary, the post favors a bullish 2024 for crypto, especially in the realms of Web3 gaming and DeFi. According to the prediction, both Web3 and DeFi will start 2024 on a strong note; with Web3 gaming getting a breakout and DeFi finally reconciling with the Know-Your-Customer issues it’s known for.  However, the most eye-catching of these is the speculation that SOL will be part of the spot ETF race in 2024.  “Solana will become a top 3 blockchain by market cap, Total Value Locked (TVL), and active users,” said VanEck in the blog post.  VanEck sees Solana as a top player within the DeFi space, eyeing even the possibility of SOL flipping Ethereum in the long run. This prediction is influenced by the fact that VanEck is running an exchange-traded note (similar to an ETF) with SOL being the underlying asset. This Solana ETN was released in 2021 in the heyday of the crypto boom.  SOLUSD currently trading at $71.449 territory. Chart: TradingView.com If Solana does become part of the ETF race in 2024, it will bring in more institutional investors that willing to take some exposure from crypto investments.  Short-Term Pain For Long-Term Gain The token sits at a high price point after following Bitcoin in its rally. This naturally brought SOL to a position that is slightly untenable in the short term. So far, investors and traders should be careful as the current price level might result in a slight dip in the next couple of days. Chart: TradingView Related Reading: Immutable Momentum: IMX Rockets To $2.21, Scaling Heights Unseen Since 2022 However, a dip in price shortly shouldn’t be feared. This will only bring SOL in a better position for higher gains. If the token settles on the $70 price level, we might see gains far beyond $80 to $90 in the coming days. For now, the year will end on a positive note as SOL is on the road towards $100.  Featured image from Pixabay"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-12-14T11:25:22.000Z",
    "title": "Yearn Finance’s Treasury Misstep: Unveiling the Multisig Script Incident",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/yearn-finances-treasury-misstep-unveiling-the-multisig-script-incident/",
    "description": "<p>The mishap stemmed from a series of oversights in handling Treasury funds. Leading to the unintended transfer of the entire treasury balance, including fees, to a trading multisig. Yearn Finance&#8217;s Treasury promptly responded to the incident by outlining a set of measures to prevent such occurrences in the future. How to lose $1.5 mil with [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/yearn-finances-treasury-misstep-unveiling-the-multisig-script-incident/\">Yearn Finance&#8217;s Treasury Misstep: Unveiling the Multisig Script Incident</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-14T11:21:00.000Z",
    "title": "Bitcoin Stages A Comeback Following FASB’s New Standards Release",
    "url": "https://coinedition.com/bitcoin-stages-a-comeback-following-fasbs-new-standards-release/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"People Holding Bitcoin for the Last 5 Years Are Now in 34% Loss\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/People-Holding-Bitcoin-for-the-Last-5-Years-Are-Now-in-34-Loss-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bitcoin staged a comeback yesterday following the Financial Accounting Standards Board&#8217;s (FASB) publication of an Accounting Standards Update (ASU). According to the announcement, the published ASU would improve the accounting for and disclosure of crypto assets, including Bitcoin. Michael Saylor, founder of MicroStrategy, thinks the recent development will facilitate the adoption of Bitcoin as a [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/bitcoin-stages-a-comeback-following-fasbs-new-standards-release/\">Bitcoin Stages A Comeback Following FASB’s New Standards Release</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]