[
  {
    "source": "Cointelegraph",
    "date": "2023-12-28T21:25:47.000Z",
    "title": " Monex Group to acquire majority stake in asset manager 3iQ ",
    "url": "https://cointelegraph.com/news/monex-group-majority-stake-3iq",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvOWQzN2VjYjItMTZmNC00NTM3LWJkOGEtODkwZmI4ZGY1MDgzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>3iQ chair and CEO Frederick Pye said the firm planned to collaborate with Coincheck — acquired by Monex in 2018 — as part of the deal.</p>\n                    <p><p>Japan-based brokerage firm, asset manager, and crypto exchange Monex Group announced it plans to purchase a majority stake in 3iQ Digital Holdings.</p><p>In a Dec. 28 announcement, Monex <a href=\"https://www.monexgroup.jp/en/news_release/irnews/auto_20231228510346/pdfFile.pdf\" target=\"_blank\" rel=\"noopener nofollow\">cited</a> 3iQ’s experience listing some of the first spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) exchange-traded funds in North America as part of the reason for the acquisition. The Canada-based firm <a href=\"https://cointelegraph.com/news/bitcoin-etf-from-3iq-and-coinshares-goes-live-in-canada\">launched a Bitcoin fund</a> in 2020, years ahead of potential approval for similar products by the United States Securities and Exchange Commission. </p><p>“Our long term strategy is to strengthen our asset management business, and by welcoming 3iQ to our group, we aim to achieve high growth by capturing the crypto asset management needs of institutional investors and crypto asset exchanges around the world, which are expected to grow in the future,” said Monex CEO Yuko Seimei.</p><p><a href=\"https://cointelegraph.com/news/monex-group-majority-stake-3iq\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2023-12-28T21:39:34.000Z",
    "title": "Bitcoin SV’s $BSV Surges To New Heights With 82% Price Increase, Defying Market Trends",
    "url": "https://nulltx.com/bitcoin-svs-bsv-surges-to-new-heights-with-82-price-increase-defying-market-trends/",
    "description": "While Bitcoin maintains a relatively steady position this week, its fork, Bitcoin SV ($BSV), has emerged as a notable player with significant upward momentum. Of course, this is despite Bitcoin experiencing a correction around the $44K mark. Also, Bitcoin SV has seized the spotlight with remarkable breakthroughs in the market.  [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-28T21:30:59.000Z",
    "title": "Cathie Wood’s ARK ETF Overhauls Bitcoin Portfolio: ProShares In, Grayscale Out – What’s The Strategy?",
    "url": "https://www.newsbtc.com/bitcoin-news/cathie-woods-ark-etf-overhauls-bitcoin-portfolio-proshares-in-grayscale-out-whats-the-strategy/",
    "description": "In a significant shake-up of its Bitcoin (BTC)-related holdings, Cathie Wood&#8217;s ARK Next Generation Internet exchange-traded fund (ETF) has made strategic changes as BTC ends the year with a significant 156% surge. According to a Bloomberg report, the ETF sold all its remaining 2.25 million shares of the Grayscale Bitcoin Trust (GBTC) while acquiring 4.32 million shares of the ProShares Bitcoin Strategy ETF.  Caution As Reason For Exiting Grayscale Bitcoin Trust According to Bloomberg, Wood cited caution as the reason behind the sale of the Grayscale Bitcoin Trust. The move was prompted by concerns that the anticipated conversion of the trust to a spot Bitcoin ETF might not receive approval from US regulators in early January.  Additionally, Wood highlighted the substantial reduction in the trust&#8217;s discount to its net asset value, which, combined with its price increase, influenced the decision. Wood emphasized the unpredictability surrounding which Bitcoin-related offerings would gain regulatory approval, expressing optimism about Bitcoin while acknowledging the uncertainty ahead. Related Reading: Axie Infinity Springs Back To Life With Surprise 35% Rally – Details In this regard, Bloomberg ETF expert Erich Balchunas highlights that approximately $100 million of the proceeds were used to purchase the ProShares Bitcoin Strategy ETF (BITO), likely as a liquid transition vehicle to maintain exposure to Bitcoin while gradually transitioning into either ARKW or ARKB. Interestingly, ARK has now become the second-largest holder of BITO, although Balchunas clarifies that this is a temporary parking spot. Blachunas emphasizes that institutions, including ARK, often employ highly liquid ETFs for transitions of this nature.  Balchunas also points out that this move aligns with the prediction made by Bloomberg a month ago, reflecting strategic foresight on ARK&#8217;s part.  According to Balchunas, this decision is smart as it allows ARK to boost its own ETF&#8217;s assets under management (AUM) while saving investors from incurring a significant expense ratio in the process. Wood&#8217;s Long-Term Vision Per the report, the reduction in holdings of the Grayscale Bitcoin Trust has been a gradual process for Cathie Wood, even as the price of Bitcoin surged to its highest level since April 2022.  Throughout 2023, Bitcoin more than doubled in value, with significant gains occurring towards the end of the year amid speculation that the Securities and Exchange Commission (SEC) would approve spot Bitcoin ETFs in the first days of January 2024. During the Sohn Australia conference last month, Wood touted the Grayscale Bitcoin Trust as her top pick. However, recent developments have led to a shift in the ETF&#8217;s portfolio composition. In addition to the changes involving Grayscale and ProShares, the ARK ETF also purchased 20,000 shares of the ARK 21Shares Active Bitcoin Futures Strategy ETF and sold 148,885 shares of the cryptocurrency exchange Coinbase Global, according to the fund&#8217;s report. Related Reading: Top Banker Reveals Why XRP Price Will Rise 390,000% To $2,500 The ARK Next Generation Internet ETF has achieved an impressive 103% gain for the year, surpassing the 55% advance of the Nasdaq 100 Index.  It is worth noting that the fund&#8217;s performance has been characterized by significant volatility, experiencing declines of 19% and 67% in 2021 and 2022, respectively. The leading cryptocurrency in the market is trading at $42,800, exhibiting a sideways price movement over the past 24 hours. During this timeframe, there has been a marginal decrease of 0.3% in its value. Featured image from Shutterstock, chart from TradingView.com "
  }
]