[
  {
    "source": "CoinDesk",
    "date": "2023-08-17T17:41:20.000Z",
    "title": "Mastercard Deepens Tie to CBDCs as Nations Mull Issuing Digital Currencies",
    "url": "https://www.coindesk.com/business/2023/08/17/mastercard-deepens-tie-to-cbdcs-as-nations-mull-issuing-digital-currencies/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Payments giant Mastercard has created a forum where crypto industry players can discuss and collaborate on central bank digital currencies, injecting its influential voice into the CBDC conversation as nations around the world consider whether to digitize their money."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-17T18:01:28.000Z",
    "title": "Kevin Returns: Pixelmon's 'Horrible Mistake' Reborn as Base NFT",
    "url": "https://decrypt.co/152831/kevin-returns-pixelmons-horrible-mistake-reborn-base-nft",
    "description": "The blocky, meme-fueling creature is back as a $2 NFT on Base, offering perks to holders while celebrating Pixelmon’s disastrous reveal."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-17T18:00:00.000Z",
    "title": "Federal Reserve issues enforcement action against FTX-linked US bank",
    "url": "https://cointelegraph.com/news/federal-reserve-issues-enforcement-action-against-ftx-linked-bank",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/ac4fc298-6352-4cc4-b811-4ca2cd0ad4f2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Moonstone Bank, which was since renamed Farmington State Bank, received roughly $11.5 from FTX’s sister firm Alameda Research through its holding company in 2022.</p>\n                    <p><p>The Federal Reserve Board of the United States and the Washington State Department of Financial Institutions have announced an enforcement action against Farmington State Bank, a financial institution whose parent company received more than $11 million from Alameda Research.</p><p>In an Aug. 17 announcement, the Fed <a href=\"https://www.federalreserve.gov/newsevents/pressreleases/enforcement20230817a.htm\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the enforcement action was related to Farmington “improperly chang[ing] its business plan” in 2022 without proper notification and approval. The bank did not inform the Fed it intended \"to pursue a strategy focused on digital banking services or digital assets”. Formerly named Moonstone, Farmington received roughly $11.5 from FTX’s sister firm Alameda through its holding company FBH Corporation in March 2022.</p><p>“The Board's action ensures the bank's operations will wind down in a manner that protects the bank's depositors and the Deposit Insurance Fund,” said the Fed. “The action also prohibits Farmington and FBH from making dividends or capital distributions, dissipating cash assets, and engaging in certain activities without approval from its supervisors.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today’s <a href=\"https://twitter.com/hashtag/EnforcementActions?src=hash&ref_src=twsrc%5Etfw\">#EnforcementActions</a>:<a href=\"https://t.co/bTmGeUBJdP\">https://t.co/bTmGeUBJdP</a></p>— Federal Reserve (@federalreserve) <a href=\"https://twitter.com/federalreserve/status/1692190116507193743?ref_src=twsrc%5Etfw\">August 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Farmington announced in January that it <a href=\"https://cointelegraph.com/news/ftx-linked-moonstone-bank-to-exit-the-crypto-space\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ftx-linked-moonstone-bank-to-exit-the-crypto-space/amp\">planned to exit the crypto space</a> in an effort to return to its “original mission” as a community bank. However, the Fed enforcement action suggested the bank had “engage[d] in activities related to digital assets” including facilitating the issuance of stablecoins for an unnamed third party “in exchange for receipt of 50 percent of mint and burn fees”.</p><p>The Fed reported Farmington, based in Washington, had planned to sell its loans and deposits to the Bank of Eastern Oregon. Neither the Fed enforcement action nor the move to leave the space explicitly mentioned crypto exchange FTX, which declared bankruptcy in November 2022.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/fdic-highlights-crypto-risk-to-banking-in-2023-review\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/fdic-highlights-crypto-risk-to-banking-in-2023-review/amp\"><strong><em>Crypto highlighted as ‘novel and complex’ risk to US banks: FDIC report</em></strong></a></p><p>The enforcement action represented the latest by federal regulators against banks with ties to crypto firms and investors in the wake of the FTX collapse. Silvergate Bank’s parent company announced in March it planned to “wind down operations” for the crypto bank. This action preceded Silicon Valley Bank collapsing amid a run on deposits, and the Federal Deposit Insurance Corporation shutting down the crypto-friendly Signature Bank. </p><p>U.S. lawmakers <a href=\"https://cointelegraph.com/news/crypto-friendly-banks-mismanaged-traditional-risks-fdic-head-tells-senate-hearing\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-friendly-banks-mismanaged-traditional-risks-fdic-head-tells-senate-hearing/amp\">conducted several hearings</a> in the wake of the bank failures, with some suggesting that ties to crypto firms had contributed to their collapse. Some policymakers including New York Department of Financial Services superintendent Adrienne Harris reportedly said it was “ludicrous” to blame digital assets for the collapse of Signature.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-17T18:00:00.000Z",
    "title": "2024 could be very bullish for crypto — Here’s why",
    "url": "https://cointelegraph.com/news/2024-is-going-to-be-very-bullish-for-crypto-here-s-why",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/b1f48859-d921-48e1-8af1-7dc31cac91f8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This week’s episode of Market Talks discusses why 2024 could be bullish for the crypto industry and if crypto has weathered the storm.</p>\n                    <p><p>This week’s episode of Cointelegraph’s <a href=\"https://youtube.com/playlist?list=PL-HcIk8DKvOhCXPqNeNf9LK9R2z_kzzlN\" target=\"_blank\" rel=\"noopener nofollow\"><em>Market Talks</em></a> welcomes Huf, the founder of Pear Protocol, a new decentralized exchange launching on Arbitrum in 2023. Huf worked as an equity derivatives trader for various investment banks for over a decade before entering the decentralized finance industry in 2019. He is often quoted in various news outlets for his views on the markets, which he shares in real time via his X (formerly Twitter) profile.</p><p>The show kicks off with Huf’s views on the current crypto market. Is it in need of a new stimulus and new money? Is it a closed system with the same money rotating from one protocol to the next or one blockchain to another? Is that the reason for such record-low volatility? </p><p>Do narratives drive the current crypto market? If so, how can a trader or investor make the right decisions based on those narratives? Huf gives his insights and discusses the narratives he sees playing out in the near future — and those that have already played out.</p><p>Many crypto community members eagerly await the arrival of 2024, as they believe it will bring with it a new bull market — especially since 2024 is the year of the next Bitcoin halving. Huf explains why he is highly bullish on the first quarter of 2024 and why he thinks it will be the start of the next bull market.</p><p>The episode also discusses what needs to happen for central banks to start cutting interest rates: Will the decision rely on a continuous downtrend in inflation? And will the first spot Bitcoin exchange-traded fund be approved in the United States in 2024? We discuss all this and more, so stick around until the end.</p><p><em>Market Talks</em> airs every Thursday, featuring interviews with some of the most influential and inspiring people from the crypto and blockchain industry. So, head over to the <a href=\"https://www.youtube.com/@cointelegraphmarketresearch\" target=\"_blank\" rel=\"noopener nofollow\">Cointelegraph Markets &amp; Research YouTube channel</a>, and smash those “Like” and “Subscribe” buttons for all future videos and updates.</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-17T17:50:32.000Z",
    "title": "Judge grants SEC request to file motion for appeal in Ripple case",
    "url": "https://cointelegraph.com/news/judge-torres-grants-sec-s-request-to-leave-to-file-an-appeal-in-ripple-case",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/3f7fb7dc-f8ed-4c68-9d50-503840456433.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The SEC has until August 18 to officially file its motion and the defendants will have until September 1 to respond. </p>\n                    <p><p>Judge Analisa Torres has granted a request from the United States Securities and Exchange Commission (SEC) to leave to file an interlocutory appeal in its case against Ripple Labs. The securities regulator sent a letter to Torres on Aug. 9, saying her decision could affect multiple pending court cases. </p><p>According to United States laws, an interlocutory appeal occurs when a ruling by a trial court is appealed while other aspects of the case are still proceeding.  The decision allows the SEC to build and bring a case to the U.S. Court of Appeals for the Second Circuit. Ripple will also will also be able to file an opposition to the appeal. </p><p>Judge Torres ruled on July 13 that Ripple's native token (XRP) is not a security when distributed in public sales, but considered XRP a security in institutional sales. The <a href=\"https://cointelegraph.com/news/xrp-price-faces-a-rocky-road-to-recovery-ahead-of-sec-s-ripple-lawsuit\">case against Ripple</a> has been ongoing since December 2020 when the SEC sued Ripple and its two chief executives, Brad Garlinghouse and Chris Larsen, over allegations the company was offering an unregistered security.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-17T17:43:13.000Z",
    "title": "Tether Announces Decisive Shift: Discontinues Kusama, Bitcoin Cash SLP, Omni Support",
    "url": "https://cryptobriefing.com/tether-announces-decisive-shift-discontinues-support/?utm_source=feed&utm_medium=rss",
    "description": "Leading stablecoin issuer Tether is streamlining its approach by discontinuing support for certain blockchain platforms."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-17T18:00:42.000Z",
    "title": "‘Our Country Is Going to Hell’ — Trump Warns of US Losing Global Currency Dominance",
    "url": "https://news.bitcoin.com/our-country-is-going-to-hell-trump-warns-of-us-losing-global-currency-dominance/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/helll-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"‘Our Country Is Going to Hell’ — Trump Warns of US Losing Global Currency Dominance\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/helll-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/helll-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/helll-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/helll-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/helll-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/helll-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/helll.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The 45th president and previous White House occupant, Donald Trump cautions that America is in danger of losing its global influence. In an interview with Larry Kudlow, Trump stated while the U.S. retains significant power, its position is “waning” concerning its currency. The Diminishing Dollar? Trump Points to a Shift in Global Currency Dynamics Always [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T18:00:59.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 As we venture into 2023 to 2032, the next decade promises to be a critical period for Aptos as it strives to establish itself as a significant blockchain platform. The rapidly changing market dynamics, technological advancements, and evolving adoption trends will undoubtedly shape Aptos&#8217;s path. Against this backdrop, investors and stakeholders ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T17:59:05.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T17:54:21.000Z",
    "title": "EOS Price Prediction 2023-2032: Is EOS a good investment?",
    "url": "https://www.cryptopolitan.com/eos-price-prediction/",
    "description": "EOS Price Prediction 2023-2032 EOS, a crypto token formed by the company to promote its decentralized app creation, ranks #47, a little lower on the charts, thanks to its slightly lower market cap of $3,365,472,360. Lately, it has resumed its upward projectile with renewed activities and is viewed by some analysts as a &#8220;ticking time ... <a title=\"EOS Price Prediction 2023-2032: Is EOS a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eos-price-prediction/\" aria-label=\"More on EOS Price Prediction 2023-2032: Is EOS a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-17T17:51:29.000Z",
    "title": "Microsoft and IBM Collaborate on Generative AI Solutions for Enhanced Customer Experiences",
    "url": "https://www.cryptopolitan.com/microsoft-and-ibm-collaborate-on-ai/",
    "description": "In a strategic move that could redefine the landscape of enterprise solutions, tech giants Microsoft and IBM have recently joined forces to collaborate on generative artificial intelligence (GAI) solutions. This collaboration, poised to leverage the power of GAI, is set to revolutionize customer experiences, enhance brand loyalty, and reshape the way businesses engage with their ... <a title=\"Microsoft and IBM Collaborate on Generative AI Solutions for Enhanced Customer Experiences\" class=\"read-more\" href=\"https://www.cryptopolitan.com/microsoft-and-ibm-collaborate-on-ai/\" aria-label=\"More on Microsoft and IBM Collaborate on Generative AI Solutions for Enhanced Customer Experiences\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-17T18:00:50.000Z",
    "title": "Buying The Dip? Shiba Inu Whale Activity Surges As Price Declines Nearly 10%",
    "url": "https://www.newsbtc.com/shiba-inu/buying-the-dip-shiba-inu-whale-activity-surges/",
    "description": "Shiba Inu (SHIB), a dog-inspired meme coin, originally dismissed by many as just another fleeting fad, is now drawing serious attention from big players, or &#8220;whales,&#8221; in the crypto space. This attention comes amid the tokens&#8217; recent sloppy launch of its other project, Shibarium. Blockchain security team Beosin recently reported that the newly deployed Shibarium platform has had transactions stalled in a pending state, tying up approximately 1,003 ether, equivalent to $1.8 million in locked funds.  🚨Transactions on #Shibarium are stuck in a pending state. $1.7M are currently locked on ETH. Users are advised to temporarily stop using shibarium.https://t.co/io5puAibBc https://t.co/q2SXqtthoO — Beosin Alert (@BeosinAlert) August 17, 2023 This sloppy launch has affected the SHIB token negatively seeing the tokens&#8217; price decline by nearly 10% over the past 24 hours. However, despite this plunge whales are reportedly still making moves on Shiba Inu. Related Reading: Shiba Inu’s DeFi Aspirations May Rattle DOGE’s Market As SHIB Turns To Digital IDs Shiba Inu Whale Activity Surges According to Santiment, a prominent blockchain data firm, there has been a noticeable increase in transaction activity by whales across several digital currencies, including SHIB and XRP. 🐳 As the crowd feels the pain, there are several assets seeing an increase in whale activity. As they attempt to capitalize on the discounted prices, read about the four projects we&#8217;re seeing some notable activity rises: $SHIB, $XRP, $SAND, &#38; $CAKE https://t.co/SnuKebg7h1 pic.twitter.com/VWKlH95yU0 — Santiment (@santimentfeed) August 17, 2023 Specifically, for Shiba Inu, the numbers are compelling. Santiment&#8217;s data shows that there&#8217;s been a surge in transfers of SHIB valued at $1 million or higher. According to Santiment, a possible reason for the increase in whale activity could be that these large investors are attempting to &#8220;capitalize on discount prices&#8221; of Shiba Inu and the other cryptocurrencies recording a surge in whale activity Furthermore, this uptick in activity closely follows significant events in the Shiba Inu ecosystem, particularly the mainnet launch of Shibarium, which could be another contributing factor. Shibarium represents a crucial advancement for the SHIB community and its broader ecosystem. And though its launch didn&#8217;t go as planned, its introduction likely plays a role in attracting these large investors and traders to SHIB, looking to capitalize on new opportunities brought about by the platform&#8217;s capabilities. SHIB Declines Nearly 10% In The Past Day Over the past 24 hours, Shiba Inu has been in red regardless of the surging whale activity. Particularly, the dog-inspired meme coin has recorded a loss of 9.9% over this period and with a current market price of $0.0000087, at the time of writing. This plunge is also reflected in the asset&#8217;s market capitalization which has seen a substantial loss of more than $600 million in the past day. Interestingly, despite the blood bath, Shiba Inu&#8217;s daily trading volume has remained resilient. Related Reading: Shiba Inu (SHIB) Dips By 7% Following Shibarium Launch Over the past day, SHIB&#8217;s trading volume has hovered above $450 million and currently stands at a value of $461 million at the time of writing. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-17T18:00:19.000Z",
    "title": "Gaming Cryptos like Axie Infinity and Decentraland are ramping up, but this BTC alternative could do 80X",
    "url": "https://www.crypto-news-flash.com/gaming-cryptos-like-axie-infinity-and-decentraland-are-ramping-up-but-this-btc-alternative-could-do-80x/?utm_source=rss&utm_medium=rss&utm_campaign=gaming-cryptos-like-axie-infinity-and-decentraland-are-ramping-up-but-this-btc-alternative-could-do-80x",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-42.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-42.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-42-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Gaming cryptocurrencies led by Axie Infinity and Decentraland are growing in popularity. The crypto game&#8217;s success has sparked interest in the concept of play-to-earn gaming. Amidst this excitement, a Bitcoin alternative has emerged with the potential to make substantial gains. Bitcoin Spark (BTCS) looks set to see a rapid value rise of up to 80X. [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-17T18:05:36.000Z",
    "title": "Trader Updates Outlook on Crypto Asset That’s Up Over 60% This Month, Says One Altcoin’s Uptrend Is Still Strong",
    "url": "https://dailyhodl.com/2023/08/17/trader-updates-outlook-on-crypto-asset-thats-up-over-60-this-month-says-one-altcoins-uptrend-is-still-strong/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/Altcoin-Tumbles-As-DeFi-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/Altcoin-Tumbles-As-DeFi-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/Altcoin-Tumbles-As-DeFi-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/Altcoin-Tumbles-As-DeFi-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/Altcoin-Tumbles-As-DeFi-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/Altcoin-Tumbles-As-DeFi-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/Altcoin-Tumbles-As-DeFi-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto trader is updating his outlook on one altcoin that is soaring this month as the broader digital assets market dips. Pseudonymous trader Altcoin Sherpa tells his 196,300 X followers that the decentralized cross-chain liquidity protocol THORChain (RUNE) has more room to run after a bounce off of a key Fibonacci retracement level. &#8220;RUNE: [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/17/trader-updates-outlook-on-crypto-asset-thats-up-over-60-this-month-says-one-altcoins-uptrend-is-still-strong/\">Trader Updates Outlook on Crypto Asset That’s Up Over 60% This Month, Says One Altcoin’s Uptrend Is Still Strong</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]