[
  {
    "source": "CryptoGlobe",
    "date": "2023-07-13T04:24:00.000Z",
    "title": "$XRP Price Could Skyrocket to $30 in Short Term, Says Fund Manager",
    "url": "https://www.cryptoglobe.com/latest/2023/07/xrp-price-could-skyrocket-to-30-in-short-term-says-fund-manager/",
    "description": "The native token of the XRP Ledger, $XRP, could see a significant price increase to potentially reach a bullish target of $30 in the short term, according to the founder and manager of Kralow Capital Thomas Kralow, who recently revealed his bullish prediction. Kralow’s words come at a time in which a major player in […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-13T04:30:08.000Z",
    "title": "Bank of China Expands Digital Yuan Testing to SIM Cards and NFC Payments",
    "url": "https://news.bitcoin.com/bank-of-china-expands-digital-yuan-testing-to-sim-cards-and-nfc-payments/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/yuan-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bank of China Expands Digital Yuan Testing to SIM Cards and NFC Payments\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/yuan-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/yuan-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/yuan-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/yuan-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/yuan-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/yuan-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/yuan.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The state-owned financial institution Bank of China has revealed a partnership with China Unicom and China Telecom in order to test SIM cards and near-field communication (NFC) payments tethered to the renminbi. The Bank of China explains that the pilot will be tested by selected users and areas and it currently only supports Android phones. [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-13T04:18:03.000Z",
    "title": "Ethereum Price Topside Bias Vulnerable If ETH Drops Below $1,825",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-vulnerable-1825/",
    "description": "Ethereum price failed again to clear the $1,900 resistance against the US Dollar. ETH is declining and might revisit the $1,825 support zone. Ethereum topped near the $1,900 resistance and declined. The price is trading below $1,880 and the 100-hourly Simple Moving Average. There was a break below a key bullish trend line with support near $1,875 on the hourly chart of ETH/USD (data feed via Kraken). The pair could extend its decline toward $1,845 or even $1,825. Ethereum Price Restarts Decline Ethereum’s price made another to clear the key resistance at $1,900. However, ETH failed to gain pace above the $1,900 resistance and reacted to the downside, similar to Bitcoin. A high was formed near $1,901 and the price declined below $1,880. There was a break below a key bullish trend line with support near $1,875 on the hourly chart of ETH/USD. The pair traded below the 76.4% Fib retracement level of the upward move from the $1,862 swing low to the $1,901 high. Ether is now trading below $1,870 and the 100-hourly Simple Moving Average. It seems like the bears are in control and they might aim for a move below the $1,862 low. Source: ETHUSD on TradingView.com On the upside, immediate resistance is near the $1,880 level and the 100-hourly Simple Moving Average. The first major resistance is near the $1,890 zone. The main resistance is still near $1,900. A close above the $1,900 resistance could start a decent increase. The next major resistance is near the $1,955 level. Any more gains could send Ether toward the $2,000 resistance. More Losses in ETH? If Ethereum fails to clear the $1,880 resistance, it could continue to move down. Initial support on the downside is near the $1,860 level or the last swing low at $1,862. The first major support is near the $1,845 level, below which the price might test the 1.618 Fib extension level of the upward move from the $1,862 swing low to the $1,901 high at $1,838. The next major support is near the $1,825 level. Any more losses could send Ether toward the $1,770 support level in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,825 Major Resistance Level – $1,900"
  }
]