[
  {
    "source": "Cointelegraph",
    "date": "2023-09-03T02:23:21.000Z",
    "title": "FTX court filing reveals former Alameda CEO's $2.5M yacht purchase",
    "url": "https://cointelegraph.com/news/ftx-yacht-former-alameda-ceo-sam-trabucco",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/9b226ee4-9982-4d60-add2-9b7d090dc0b5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The payment to the American Yacht Group was disclosed under the category of payments benefiting any insider within one year prior to the crypto exchange collapse.</p>\n                    <p><p>FTX Debtors have disclosed a series of financial statements revealing any transactions that benefited company executives prior to the major cryptocurrency exchange’s collapse in November 2022.</p><p>In a recent court <a href=\"https://restructuring.ra.kroll.com/FTX/Home-DownloadPDF?id1=MjQ1MzA0Mw==&amp;id2=-1\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> with the United States Bankruptcy Court for the District of Delaware, several payments that directly benefited senior company executives at FTX and Alameda Research were disclosed. Specifically payments or property transfers executed within one year preceding the collapse of FTX.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/d1fbebe6-b7b8-4d31-be77-7994a99b0188.png\"  /><figcaption style=\"text-align: center;\"><em>Court Filing in the United States Bankruptcy Court for the District of Delaware. Source: Kroll</em></figcaption></figure><p>In March 2022, a transaction of $2.51 million was directed from the company to the American Yacht Group, benefiting former Alameda Research co-CEO Sam Trabucco.</p><p>Just a few months after this transaction, Trabucco confirmed ownership of a boat while informing his followers about his resignation in an August 2022 <a href=\"https://twitter.com/AlamedaTrabucco/status/1562519127797145602?s=20\" target=\"_blank\" rel=\"noopener nofollow\">tweet</a>.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-pays-witnesses-1200-an-hour-to-testify\"><strong><em>FTX founder’s expert witnesses could cost up to $1.2K an hour</em></strong></a></p><p>The filing also revealed that Bankman-Fried and Wang purchased Robinhood shares in April 2022, totalling $35,185,242. They continued their acquisitions in May 2022, spending an additional $19.45 million. It discloses that Bankman-Fired held a 90% share ownership, with Wang owning the remaining 10%.</p><p>On Aug. 31, Robinhood completed the purchase of 55,273,469 shares for roughly $606 million. Following the purchase announcement, Robinhood’s CFO Jason Warnick declared that the company is happy with the result:</p><blockquote>“We are happy to have completed the purchase of these shares and look forward to executing on our growth plans on behalf of our customers and shareholders.” </blockquote><p>However, it notes that the disclosures are limited to fiat currency. “Responses to this question do not currently include all transfers of cryptocurrency, other digital assets or other assets,” it stated.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tiffany-fong-flames-celsius-ftx-and-ny-post-hall-of-flame/\"><strong><em>Tiffany Fong flames Celsius, FTX and NY Post: Hall of Flame</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-03T02:20:52.000Z",
    "title": "Grayscale does not see any competition in Bitcoin ETF industry",
    "url": "https://www.cryptopolitan.com/grayscale-no-competition-in-bitcoin-etf/",
    "description": "In the fiercely competitive race for supremacy in the Bitcoin ETF market, Grayscale doesn&#8217;t just aim to compete – they&#8217;re set to lead. With their intent to metamorphose their existing bitcoin trust (GBTC) into an Exchange-Traded Fund (ETF), the investment giants are poised to outpace a bevy of contenders eager to make their mark. Eyeing ... <a title=\"Grayscale does not see any competition in Bitcoin ETF industry\" class=\"read-more\" href=\"https://www.cryptopolitan.com/grayscale-no-competition-in-bitcoin-etf/\" aria-label=\"More on Grayscale does not see any competition in Bitcoin ETF industry\">Read more</a>"
  }
]