[
  {
    "source": "Crypto Daily",
    "date": "2023-06-17T13:15:00.000Z",
    "title": "Uniswap Aligns with Wormhole and Axelar for Cross-Chain Bridging",
    "url": "https://cryptodaily.co.uk/2023/06/uniswap-aligns-with-wormhole-and-axelar-for-cross-chain-bridging",
    "description": "<p class=\"md-end-block md-p\">Uniswap recently disclosed its preferred choice for handling non-Ethereum deployments in its cross-chain bridging operations: Wormhole and Axelar.</p>\n<p class=\"md-end-block md-p\">These selections are the result of a comprehensive analysis conducted by Uniswap's Bridge Assessment Committee, which evaluated a range of potential protocols. The proposed changes are also aligned to the protocol's recent disclosure of its plans for V4.</p>\n<p class=\"md-end-block md-p\">Diving Deep into the Decision</p>\n<p class=\"md-end-block md-p\">Uniswap's Bridge Assessment Committee scrutinized multiple contenders, namely Wormhole, Celer, DeBridge, LayerZero, Axelar, and Multichain (CRP). Each of these was rigorously assessed for its proficiency in facilitating cross-chain governance. Out of the competition, Wormhole and Axelar emerged victorious, with the committee endorsing these two for utilization across all cross-chain deployments.</p>\n<p class=\"md-end-block md-p\">As the committee puts it, both Wormhole and Axelar have demonstrated their aptness in managing governance messaging for potential cross-chain deployments. They, however, advised the community to persistently review these and other bridge providers, bearing in mind the dynamics of the industry.</p>\n<p class=\"md-end-block md-p\">Cross-Chain Governance and Its Implications</p>\n<p class=\"md-end-block md-p\">The fundamental application for Uniswap DAO's cross-chain bridge lies in its ability to relay governance messages from Ethereum to other chains for execution. All Uniswap deployment proposals undertake a formal voting procedure on Ethereum. Any upgrades for deployments on alternate chains are then communicated via a cross-chain messaging protocol.</p>\n<p class=\"md-end-block md-p\">While Wormhole and Axelar have gained the committee's approval, this doesn't entirely exclude other bridges. The report also pointed out that those deemed unsuitable for Uniswap's present cross-chain governance needs might still satisfy the prerequisites of other protocols and applications.</p>\n<p class=\"md-end-block md-p\">Vulnerabilities and Controversies: The Story of Cross-Chain Bridges</p>\n<p class=\"md-end-block md-p md-focus\">The controversy around cross-chain bridges in the Web3 sphere is nothing new. In 2022, these bridging protocols proved to be a weak spot, with hackers successfully exploiting them and causing billions in losses. As per data from Rekt, four out of the top five most expensive DeFi breaches targeted bridges, resulting in an aggregated loss of over $2.1 billion.</p>\n<p class=\"md-end-block md-p\">In response to these vulnerabilities, Uniswap has formed its Cross-Chain Bridge Assessment Committee to aid governance delegates and the Uniswap community in making well-informed decisions regarding cross-chain bridging protocols.</p>\n<p class=\"md-end-block md-p\">The Committee's evaluations covered more than 130 assessment questions for each protocol, taking into account their ability to ensure \"safety, liveness, and censorship resistance\". Looking ahead, Celer and DeBridge might be reassessed despite their current shortcomings in slashing mechanisms and security assurances. The report was notably critical of Multichain for its lack of transparency and ineffective deterrents to prevent validator collusion.</p>\n<p class=\"md-end-block md-p\">To underscore the context, Uniswap has over $5.9 billion locked in its protocol as of May 2023, with daily transaction volume frequently exceeding $1 billion. Given these figures, Uniswap's choice of Wormhole and Axelar could have significant implications for both the involved protocols and Uniswap's ongoing cross-chain operations.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-17T13:16:15.000Z",
    "title": "Biggest Movers: SOL, MATIC Move Away From Key Support Levels on Saturday",
    "url": "https://news.bitcoin.com/biggest-movers-sol-matic-move-away-from-key-support-levels-on-saturday/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2083479154-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Biggest Movers: SOL, MATIC Move Away From Key Support Levels on Saturday\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2083479154-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2083479154-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2083479154-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2083479154-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2083479154-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2083479154-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2083479154.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Solana climbed for a third consecutive session, as crypto markets rebounded to start the weekend. At the time of writing, the global market cap rose by 3.3%, as bullish sentiment returned. Polygon was another notable gainer, surging by over 5% on Saturday. Solana (SOL) Solana (SOL) raced to a one-week high on Saturday, as crypto [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-17T13:15:09.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-17T13:10:57.000Z",
    "title": "Coinbase demands SEC respond to rulemaking petition",
    "url": "https://crypto.news/coinbase-demands-sec-respond-to-rulemaking-petition/",
    "description": "Coinbase is moving to gain an advantage in its ongoing legal battle with the U.S. Securities and Exchange Commission (SEC)"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-17T13:17:02.000Z",
    "title": "Cardano Creator Charles Hoskinson: $7 Trillion BlackRock Bitcoin ETF Approval to Flood the Market with Fresh Money",
    "url": "https://www.crypto-news-flash.com/cardano-creator-charles-hoskinson-7-trillion-blackrock-bitcoin-etf-approval-to-flood-the-market-with-fresh-money/?utm_source=rss&utm_medium=rss&utm_campaign=cardano-creator-charles-hoskinson-7-trillion-blackrock-bitcoin-etf-approval-to-flood-the-market-with-fresh-money",
    "description": "BlackRock application for Bitcoin ETF can stir an imbalance in the crypto world. Cardano Founder Charles Hoskinson believes BlackRock&#8217;s move is not worth celebrating. The recent announcement regarding BlackRock&#8217;s interest in establishing a Bitcoin Spot Trust has sent shockwaves throughout the community. The news broke when a division of BlackRock submitted documentation to the U.S. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-17T13:13:55.000Z",
    "title": "Blackrock Ignites Bullish Surge as Spot BTC ETF Launches: $28,000 Bitcoin Price Looms Large on the Horizon",
    "url": "https://www.crypto-news-flash.com/blackrock-ignites-bullish-surge-as-spot-btc-etf-launches-28000-bitcoin-price-looms-large-on-the-horizon/?utm_source=rss&utm_medium=rss&utm_campaign=blackrock-ignites-bullish-surge-as-spot-btc-etf-launches-28000-bitcoin-price-looms-large-on-the-horizon",
    "description": "BlackRock, the world&#8217;s largest asset manager, has submitted an application to the SEC for a Spot Bitcoin ETF, igniting bullish momentum in the crypto market. This development has helped the Bitcoin price recover from its dip below $25,000 to $25,500 after a grim few weeks of market activity. Following a grim period, the crypto market [...]"
  }
]