[
  {
    "source": "NewsBTC",
    "date": "2023-07-13T02:38:48.000Z",
    "title": "Bitcoin Price Fails To Follow Gold After US CPI, More Losses Ahead?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-losses-30k/",
    "description": "Bitcoin price failed to gain bullish momentum after the US CPI release. BTC is trading below $30,500 and there is a risk of a drop toward $29,850. Bitcoin failed to clear the $30,850 resistance and reacted to the downside. The price is trading below $30,500 and the 100 hourly Simple moving average. There was a break below a connecting bullish trend line with support near $30,620 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could continue to move down if it fails to stay above the $30,200 support. Bitcoin Price Faces Another Rejection Bitcoin price attempted a fresh increase above the $30,500 resistance zone. BTC climbed above the $30,750 level but the bears were active near the $30,850 resistance zone. A high was formed near $30,850 and the price reacted to the downside. There was a break below a connecting bullish trend line with support near $30,620 on the hourly chart of the BTC/USD pair. The pair even declined below the $30,500 support. A low is formed near $30,230 and the price is now consolidating losses. Bitcoin is now trading below $30,500 and the 100 hourly Simple moving average. It is stuck near the 23.6% Fib retracement level of the recent decline from the $30,850 swing high to the $30,230 low. Immediate resistance is near the $30,400 level and the 100 hourly Simple moving average. The next resistance is near the $30,550 zone. Source: BTCUSD on TradingView.com The 50% Fib retracement level of the recent decline from the $30,850 swing high to the $30,230 low is also near $30,550, above which the price could gain bullish momentum. In the stated case, BTC might rise toward the $30,850 resistance. The next major resistance is near the $31,000 level. Any more gains could open the doors for a move toward the $31,400 resistance zone. More Losses in BTC? If Bitcoin’s price fails to clear the $30,500 resistance, it could start another decline. Immediate support on the downside is near the $30,230 level. The next major support is near the $30,000 level, below which there could be a drop toward the $29,850 support zone. Any more losses might send the price toward the $29,400 level in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $30,230, followed by $30,000. Major Resistance Levels – $30,400, $30,550, and $31,000."
  }
]