[
  {
    "source": "Crypto Daily",
    "date": "2023-06-11T09:08:37.000Z",
    "title": "Gensler Tries His Best but Fails to Kill the Crypto Industry",
    "url": "https://cryptodaily.co.uk/2023/06/gensler-tries-his-best-but-fails-to-kill-the-crypto-industry",
    "description": "<p>The regulatory action against the two biggest crypto exchanges has made it clear: the SEC, at the helm of Chairman Gary Gensler, want to end the crypto industry. The agency&rsquo;s scare tactics may succeed in the US, but it struggles with the overall market. </p>\n<p>The US SEC made its position against crypto known this week when it launched severe regulatory action against Binance, the world&rsquo;s largest crypto exchange, and Coinbase, the largest crypto exchange by trade volume in the US. Leading the agency in its crusade is Gary Gensler, a man who has made his views of the industry no secret.</p>\n<p>Following the SEC&rsquo;s lawsuits against the exchanges, the market was expected to react severely, and the prices would plunge. However, Bitcoin and the broader market held steady throughout the week.</p>\n<p>However, Gensler&rsquo;s SEC made allegations in its suit against Binance, which labelled several popular cryptocurrencies unregistered securities. The SEC listed Polygon (MATIC), Cardano (ADA), Solana (SOL), Cosmos Hub (ATOM), Filecoin (FIL), Decentraland (MANA), Algorand (ALGO), The Sandbox (SAND), Coti (COTI), and Axie Infinity (AXS).</p>\n<p>The agency&rsquo;s naming of these tokens as securities did, however, cause panic in the market and spurred trading platform Robinhood to delist MATIC, SOL, and ADA from its platform come June 27.</p>\nAlt-Market Reacts to Robinhood Delisting\n<p>Although the market did not react as much as expected during the week, it did see a dramatic plunge on Saturday.</p>\n<p>Undoubtedly fuelled by Robinhood&rsquo;s delisting announcement, the crypto alt market saw significant declines. ADA was trading down by as much as 25%, while SOL and MATIC also saw double-digit losses. Amid the dire market conditions, Singapore-based crypto exchange Crypto.com announced it would suspend its institutional exchange service for US customers.</p>\n<p>Compared to the broader market, Bitcoin was only trading down only 5% to its lowest level since March and was trading hands at around $25,000.</p>\n<p>The market appeared to recover ever so slightly by Sunday morning, but the &ldquo;bloodbath&rdquo; continues.</p>\nDid Gary Gensler Offer His Services to Binance?\n<p>A surprising report emerged this week amid the chaos when CNBC revealed that Gensler had a series of conversations with Binance officials and its CEO, Changpeng Zhao. Binance lawyers allege that Gensler offered his services as an advisor to the exchange in 2019.</p>\n<p>Although merely reports at the moment, the allegations undoubtedly damage Gensler and call into question his intentions as Chairman of the securities regulator.</p>\nThe Crypto Industry Will Prevail\n<p>The SEC and all its might may continue to slap the industry with a barrage of claims, but it seems unlikely that it will manage to bring the industry down. The agency is certainly doing substantial damage to the US crypto industry, but the crypto market at large will not be taken down.</p>\n<p>In light of the recent events in the crypto industry &ndash; recall the spectacular failures of FTX, we cannot live under the illusion that the industry can go on unregulated.</p>\n<p>However, the US&rsquo;s approach to this is simply wrong and unproductive and achieves little bar driving crypto off US shores and into the hands of territories which welcome it with open arms.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-11T08:41:41.000Z",
    "title": "Bitget registers influx of Latam users amid SEC’s regulatory clampdown",
    "url": "https://www.cryptopolitan.com/bitget-registers-latam-users-sec-crackdown/",
    "description": "In the wake of legal actions taken against major cryptocurrency exchanges Binance and Coinbase by United States regulators, Bitget, a prominent crypto exchange, has experienced a significant increase in new accounts from Latin America. This surge in user sign-ups has been particularly notable in Brazil and Argentina, leading to substantial market share growth for Bitget ... <a title=\"Bitget registers influx of Latam users amid SEC’s regulatory clampdown\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitget-registers-latam-users-sec-crackdown/\" aria-label=\"More on Bitget registers influx of Latam users amid SEC’s regulatory clampdown\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-11T08:56:37.000Z",
    "title": "Hut 8 Mining mined 147 BTC in May, Bitcoin hash rate slumping",
    "url": "https://crypto.news/hut-8-mining-mined-147-btc-in-may-bitcoin-hash-rate-slumping/",
    "description": "In May 2023, Hut 8 Mining, a crypto miner based in Toronto, Canada, and one of North America's largest publicly traded mining firms, mined 147 bitcoin (BTC)"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-11T08:57:49.000Z",
    "title": "InQubeta (QUBE) Presale Prepares for Liftoff as The Popularity of Other AI Cryptos Like Fetch.ai (FET) Surges",
    "url": "https://www.crypto-news-flash.com/inqubeta-qube-presale-prepares-for-liftoff-as-the-popularity-of-other-ai-cryptos-like-fetch-ai-fet-surges/?utm_source=rss&utm_medium=rss&utm_campaign=inqubeta-qube-presale-prepares-for-liftoff-as-the-popularity-of-other-ai-cryptos-like-fetch-ai-fet-surges",
    "description": "InQubeta (QUBE) is gearing up for its successful presale, and the buzz is electrifying the crypto community. As the popularity of other AI crypto projects like Fetch.ai (FET) continues to surge, all eyes are on InQubeta and its imminent launch. With its innovative approach to artificial intelligence and blockchain technology, InQubeta has captured the attention [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-11T08:52:47.000Z",
    "title": "This Crypto AI Tool Will Elevate Your Trading Game for BETTER GAINS!!",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/this-crypto-ai-tool-will-elevate-your-trading-game-for-better-gains/",
    "description": "<p>DeFi aggregators find ways to get you the best price on tokens and gas fees. Enter KyberSwap. They are a next-gen DEX aggregator which finds optimal rates for you. As a result, you can get optimized returns when providing liquidity in DeFi. Earlier this week they added a new feature, KyberAI. That fits right into [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/this-crypto-ai-tool-will-elevate-your-trading-game-for-better-gains/\">This Crypto AI Tool Will Elevate Your Trading Game for BETTER GAINS!!</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-11T09:02:00.000Z",
    "title": "The Solana Foundation Reaffirms That SOL is Not a Security",
    "url": "https://coinedition.com/the-solana-foundation-reaffirms-that-sol-is-not-a-security/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Solana-Reaffirms-SOL-Not-Security-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Solana Reaffirms SOL Not Security\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Solana-Reaffirms-SOL-Not-Security-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Solana-Reaffirms-SOL-Not-Security-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Solana-Reaffirms-SOL-Not-Security.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The Solana Foundation has disagreed with the regulatory trend sweeping across the crypto industry in the US. The Foundation criticized particularly the characterization of SOL, Solana’s native crypto, as a security by the Securities and Exchange Commission (SEC). On Saturday, June 10, 2023, the Solana Foundation, via its Twitter account, communicated its position in the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/the-solana-foundation-reaffirms-that-sol-is-not-a-security/\">The Solana Foundation Reaffirms That SOL is Not a Security</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]