[
  {
    "source": "CryptoGlobe",
    "date": "2024-01-26T02:00:00.000Z",
    "title": "Crypto Prediction Platform Users See Trump as Likely 2024 Presidential Election Winner",
    "url": "https://www.cryptoglobe.com/latest/2024/01/crypto-prediction-platform-users-see-trump-as-likely-2024-presidential-election-winner/",
    "description": "On cryptocurrency prediction and betting platform Polymarket, users ar betting on former U.S. President Donald Trump winning the 2024 Presidential elections in the country, currently giving Trump a 55% change to do so, over current President Joe Biden’s 39%. According to data from the cryptocurrency prediction platform, bets exceeding $19 million have been placed on […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-26T02:00:51.000Z",
    "title": "Q4 Triumph For Fantom (FTM): Circulating Market Cap Outpaces All Cryptos With 140% Surge",
    "url": "https://www.newsbtc.com/fantom/q4-triumph-for-fantom-ftm-circulating-market-cap-outpaces-all-cryptos-with-140-surge/",
    "description": "In the fourth quarter of 2023, the cryptocurrency market experienced a notable resurgence, accompanied by the anticipation of a potential Bitcoin ETF approval. Among the standout performers during this period was Fantom (FTM), a Layer-1 protocol launched in 2018.  According to a recent report by Messari, Fantom witnessed significant growth, with its circulating market cap soaring by 140% quarter-over-quarter, from $0.5 billion to $1.3 billion. This performance surpassed all cryptocurrencies&#8217; overall market cap growth at 54% in Q4. Additionally, Fantom climbed up the market cap rankings, ascending five spots from 63 to 58 by the end of the quarter. FTM’s Potential For Future Growth The circulating supply of FTM remained relatively stable quarter-over-quarter, with changes in supply dynamics between Q4 2022 and Q1 2023.  Notably, Fantom introduced the Ecosystem Vault and Gas Monetization program during Q4 2023, reducing the burn rate of transaction fees and reallocating a portion of fees to the Gas Monetization program and Ecosystem Vault.  The number of daily active addresses on the Fantom network experienced a 27% decline quarter-over-quarter, averaging 32,700 in Q4&#8217;23. However, a steady increase in daily active addresses throughout December indicates potential future growth as the crypto market emerges from the bearish phase.  Related Reading: Helium (HNT) Heats Up: 21% Jump After Telefónica Deal Ignites Growth Average daily transactions on Fantom reversed their declining trend, surging by 126% to 531,000. This increase was primarily attributed to the emergence of Fantom Inscription FRC20s, with November 25 marking an all-time high of 5.11 million transactions, including 4.99 million inscriptions.  In terms of new addresses, Q4&#8217;23 saw a 10% increase to an average of 21,100 daily new addresses. Messari suggests that the surge in daily new addresses can be attributed to the launch of Estfor Kingdom, a popular blockchain-based game on Fantom that gained traction in late Q3&#8217;23. December also witnessed an uptick in daily new addresses, likely influenced by improved market conditions. Fantom DeFi Ecosystem  Per the report, Fantom&#8217;s Total Value Locked (TVL) denominated in USD increased by 58% quarter-over-quarter, from $51 million in Q3 to $81 million in Q4. However, TVL denominated in FTM decreased by 29% in the same period, primarily due to asset price fluctuations.  Q4&#8217;23 also witnessed shifts in the top DeFi applications on Fantom, with new entrants such as Equalizer Exchange, WigoSwap, and SpiritSwap gaining market share. Notable protocols by TVL included Spookyswap, Beethoven X, Equalizer Exchange, WigoSwap, Tomb Finance, and SpiritSwap.  These protocols collectively gained $29 million in TVL, accounting for nearly 100% of Fantom&#8217;s TVL growth in Q4. Equalizer and WigoSwap experienced the most significant market share increases. The average daily decentralized exchange (DEX) volume on Fantom declined by 10% to $10.2 million in Q4 2023. Still, emerging new DEXs like Equalizer Exchange and WigoSwap contributed to the ecosystem&#8217;s overall growth. Related Reading: Bitcoin Whales Go On Buying Spree As Price Dips, Here’s How Much They Bought In summary, Fantom&#8217;s performance was notable in the fourth quarter of 2023. The protocol experienced a surge in market cap, robust revenue growth, and an expanding DeFi ecosystem. However, its native token has declined significantly.  Despite the recent sharp correction across the cryptocurrency market, Fantom&#8217;s native token FTM has not been an exception. Presently, the token is trading at $0.3306, reflecting a decline of over 3% within the last 24 hours, 37% over the past 30 days, and a year-to-date decrease of 18%. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-26T01:40:00.000Z",
    "title": "88% of Top Media Houses Now Block AI Bots Amid Content Use Concerns",
    "url": "https://coinedition.com/88-of-top-media-houses-now-block-ai-bots-amid-content-use-concerns/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/BLOCKCHAIN-4.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/BLOCKCHAIN-4.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/BLOCKCHAIN-4-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/BLOCKCHAIN-4-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/BLOCKCHAIN-4-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/BLOCKCHAIN-4-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/BLOCKCHAIN-4-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/BLOCKCHAIN-4-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/BLOCKCHAIN-4-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/BLOCKCHAIN-4-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/BLOCKCHAIN-4-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/BLOCKCHAIN-4-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/BLOCKCHAIN-4-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/BLOCKCHAIN-4-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/BLOCKCHAIN-4-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/BLOCKCHAIN-4-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/BLOCKCHAIN-4-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Several media companies in the United States now block web crawlers used by artificial intelligence (AI) companies as the battle over copyright infringement and uncompensated content use prolongs. According to a Wired report, 88 percent of top-ranked news outlets in the US have devised means to restrict data collecting activities of AI companies. The data [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/88-of-top-media-houses-now-block-ai-bots-amid-content-use-concerns/\">88% of Top Media Houses Now Block AI Bots Amid Content Use Concerns</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]