[
  {
    "source": "Decrypt",
    "date": "2023-06-27T21:01:54.000Z",
    "title": "Bank of England Says ‘Britcoin’ CBDC Might Not Be on a Blockchain",
    "url": "https://decrypt.co/146451/bank-of-england-britcoin-cbdc-may-not-be-on-blockchain",
    "description": "The English Central Bank is looking at a plethora of options for a CBDC it has yet to determine is viable."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-27T20:57:02.000Z",
    "title": "New PEPE Memecoin to Launch on BNB Chain",
    "url": "https://cryptodaily.co.uk/2023/06/new-pepe-memecoin-to-launch-on-bnb-chain",
    "description": "<p>Eden Island, Republic of Seychelles, June 27th, 2023, Chainwire</p><p>A new PEPE memecoin is launching, following hot on the heels of its Ethereum namesake. Issued as a BEP20 on BNB Chain, PEPE is a novel memecoin with a number of unique mechanisms programmed into its tokenomics.</p><p>Like the original PEPE token, which has proven a runaway success in 2023, the BEP20 PEPE draws its cues from the mischievous frog of the same name, whose design was derived from the webcomic \"Boy's Club.\"</p><p>The market capitalization of the original PEPE token, which debuted on Ethereum in April, exceeded $1 billion on May 5th, prompting a new wave of memecoins, including a number of frog-themed efforts. Unlike subsequent memecoins, the PEPE (BEP20) has several unusual features programmed in including a syndication system designed to support price stabilization.</p><p>The team behind the BNB Chain PEPE aren&rsquo;t settling for just one memecoin either: they plan to launch multiple PEPE projects, all based on the loveable frog. 13 such launches have been cued up for 2023 alone.</p><p>Although each PEPE project will operate independently, the introduction of a \"Burn &amp; Drop\" system will govern the consortium. Burn &amp; Drop is a first-of-its-kind system in which burning one token leads to the airdrop of another.</p><p>To initiate a Burn &amp; Drop, two types of tokens are required. For example, this could involve a scenario in which Token A is priced at $1 and PEPE (BEP20) is also priced at $1. However, if the price of Token A were to drop to $0.8, Token A holders would have the option to burn their tokens on the Burn &amp; Drop platform, automatically receiving PEPE (BEP20) through an airdrop, and with Token A having been burned, its total supply would decrease.</p><p></p><p>By initiating the Burn &amp; Drop process between tokens, excess volatility can be reduced while possibly providing trading opportunities for arbitrage and intra-token trading. This logic is a fundamental component of PEPE (BEP20), and one which users can engage with directly within the platform.</p><p>In addition, PEPE (BEP20) has plans to introduce numerous services that will further extend the token&rsquo;s utility. To further increase interest in the project, PEPE (BEP20) is currently running an airdrop campaign on Twitter that&rsquo;s open to everyone.</p><p>About PEPEBEP20</p><p>PEPE is a project launched on the Binance Smart Chain, taking the form of a BEP20 token. The Pepe Syndicate and the unique \"Burn&amp;Drop\" mechanism of Pepe are designed to manage the token's price volatility. This is not a guarantee of price stability, but a mechanism to potentially mitigate price fluctuations. Furthermore, various projects that participate in the \"Burn&amp;Drop\" system collaborate with each other, fostering a robust Pepe Syndicate network.</p><p>For more information regarding the campaign, please visit PEPE BEP20's Twitter (@pepecoinbep20) or Join PEPE BEP20's Telegram</p><p>https://pepe.markets/</p><p> PEPEBEP20 is the source of this content. This Press Release is for informational purposes only. The information does not constitute investment advice or an offer to invest.</p>ContactPEPE BEP 20 FOUNDATIONpepebep20@gmail.com"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T21:02:35.000Z",
    "title": "Bitfinex launches innovative P2P platform ‘Bitfinex P2P’ in Latin America",
    "url": "https://www.cryptopolitan.com/bitfinex-launches-innovative-p2p-platform-bitfinex-p2p-in-latin-america/",
    "description": "Bitfinex, one of the first crypto, is making significant strides in Latin America with the launch of its peer-to-peer (P2P) platform, Bitfinex P2P. The platform aims to provide financial freedom and inclusion to Venezuela, Argentina, and Colombia users. By directly facilitating the buying and selling of cryptocurrencies such as Bitcoin (BTC), Ether (ETH), Tether tokens ... <a title=\"Bitfinex launches innovative P2P platform &#8216;Bitfinex P2P&#8217; in Latin America\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitfinex-launches-innovative-p2p-platform-bitfinex-p2p-in-latin-america/\" aria-label=\"More on Bitfinex launches innovative P2P platform &#8216;Bitfinex P2P&#8217; in Latin America\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T20:57:28.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T20:50:03.000Z",
    "title": "Big sell-off looming: ADA, SOL, and MATIC brace for impact",
    "url": "https://www.cryptopolitan.com/big-sell-off-looming-for-ada-sol-and-matic/",
    "description": "Investors are treading water, with anxious eyes trained on the horizon. There&#8217;s an expected sell-off that could throw the market into turbulence: ADA, SOL, and MATIC are bracing for impact. Here&#8217;s why these crypto assets have landed in the crosshairs of trading platforms Celsius and Robinhood, and what investors should anticipate in the coming days. ... <a title=\"Big sell-off looming: ADA, SOL, and MATIC brace for impact\" class=\"read-more\" href=\"https://www.cryptopolitan.com/big-sell-off-looming-for-ada-sol-and-matic/\" aria-label=\"More on Big sell-off looming: ADA, SOL, and MATIC brace for impact\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-27T21:04:35.000Z",
    "title": "Circle targets Asian market in business expansion",
    "url": "https://crypto.news/circle-targets-asian-market-in-business-expansion/",
    "description": "Circle is set to focus its expansion efforts on the Asian market, particularly monitoring regulatory developments in Hong Kong."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-27T20:46:35.000Z",
    "title": "Bitfinex initiates P2P trading service in Argentina, Colombia, and Venezuela",
    "url": "https://crypto.news/bitfinex-initiates-p2p-trading-service-in-argentina-colombia-and-venezuela/",
    "description": "Bitfinex announced the commencement of a peer-to-peer trading platform in Argentina, Colombia, and Venezuela, in an effort to cater to the growing market for digital assets in Latin America."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-27T20:56:29.000Z",
    "title": "New PEPE Memecoin to Launch on BNB Chain",
    "url": "https://www.crypto-news-flash.com/new-pepe-memecoin-to-launch-on-bnb-chain/?utm_source=rss&utm_medium=rss&utm_campaign=new-pepe-memecoin-to-launch-on-bnb-chain",
    "description": "Eden Island, Republic of Seychelles, June 27th, 2023, Chainwire A new PEPE memecoin is launching, following hot on the heels of its Ethereum namesake. Issued as a BEP20 on BNB Chain, PEPE is a novel memecoin with a number of unique mechanisms programmed into its tokenomics. Like the original PEPE token, which has proven a [...]"
  }
]