[
  {
    "source": "CryptoGlobe",
    "date": "2023-07-20T04:46:00.000Z",
    "title": "Ripple Report: Crypto and Blockchain to Power $250 Trillion Cross-Border Payments Sector by 2027",
    "url": "https://www.cryptoglobe.com/latest/2023/07/ripple-report-crypto-and-blockchain-to-power-250-trillion-cross-border-payments-sector-by-2027/",
    "description": "A recent report from fintech giant Ripple has shed light on the increasing role of cryptocurrencies and blockchain technology in cross-border payments, projecting that by 2027, the value of this sector will reach a staggering $250 trillion. The global payments industry has been undergoing a significant transformation, with a growing emphasis on user experience and […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-20T05:00:35.000Z",
    "title": "BitKeep (Bitget Wallet) Partners With the Solana Foundation to Drive Growth in Web3",
    "url": "https://news.bitcoin.com/bitkeep-bitget-wallet-partners-with-the-solana-foundation-to-drive-growth-in-web3/",
    "description": "<img width=\"414\" height=\"233\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/picture1.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/picture1-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/picture1-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/picture1-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/picture1.png 414w\" sizes=\"(max-width: 414px) 100vw, 414px\" />PRESS RELEASE. BitKeep, a leading multi-chain wallet, has joined forces with the Solana Foundation in an exciting collaboration aimed at promoting the growth and evolution of the blockchain landscape. This strategic partnership combines BitKeep&#x2019;s robust wallet solution with Solana&#x2019;s high-performance blockchain platform, providing a comprehensive solution to existing scalability and throughput concerns in the industry [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T05:00:14.000Z",
    "title": "Solana Broadens Accessibility for Ethereum’s Solidity Developers with Solang",
    "url": "https://www.cryptopolitan.com/solana-broadens-accessibility-for-ethereums/",
    "description": "In an innovative stride towards broader accessibility, Solana, a renowned platform known for using Rust or C for smart contract development, is now welcoming Ethereum&#8217;s Solidity developers to its ecosystem. Today, Solana Labs jubilantly announced the launch of Solang, a transformative compiler designed to bridge the gap between Ethereum Virtual Machine (EVM) developers and the ... <a title=\"Solana Broadens Accessibility for Ethereum&#8217;s Solidity Developers with Solang\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-broadens-accessibility-for-ethereums/\" aria-label=\"More on Solana Broadens Accessibility for Ethereum&#8217;s Solidity Developers with Solang\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-20T04:51:37.000Z",
    "title": "ADA Price Hold Strong At $0.30: Indicators Suggest Fresh Rally To $0.38",
    "url": "https://www.newsbtc.com/analysis/ada/ada-price-hold-strong-at-0-30/",
    "description": "Cardano’s price is holding the key support at $0.30. ADA could start a steady increase if there is a clear move above the $0.340 resistance. ADA price is showing positive signs above the $0.30 level against the US dollar. The price is trading above $0.300 and the 100 simple moving average (4 hours). There is a major bullish trend line forming with support near $0.295 on the 4-hour chart of the ADA/USD pair (data source from Kraken). The pair could gain bullish momentum if there is a close above the $0.340 resistance. Cardano’s ADA Price Signals Fresh Increase This past week, Cardano’s price started a downside correction from the $0.379 high. The price traded below the $0.365 and $0.340 support levels to move into a short-term bearish zone, similar to Bitcoin and Ethereum. However, the bulls were active above the $0.30 level. A low is formed near $0.3001 and the price is now rising. There was a break above the $0.320 resistance. The price climbed above the 23.6% Fib retracement level of the downward move from the $0.379 swing high to the $0.300 low. ADA price is now trading above $0.300 and the 100 simple moving average (4 hours). There is also a major bullish trend line forming with support near $0.295 on the 4-hour chart of the ADA/USD pair. On the upside, immediate resistance is near the $0.340 zone. It is close to the 50% Fib retracement level of the downward move from the $0.379 swing high to the $0.300 low. Source: ADAUSD on TradingView.com The first major resistance is forming near the $0.350 zone. The next key resistance might be $0.365. If there is a close above the $0.365 resistance, the price could start a decent increase. In the stated case, the price could rise toward the $0.380 resistance zone. Are Dips Limited in ADA? If Cardano’s price fails to climb above the $0.340 resistance level, it could start another decline. Immediate support on the downside is near the $0.315 level. The next major support is near the $0.30 level and the trend line. A downside break below the $0.30 level could open the doors for a sharp fresh decline toward $0.275. The next major support is near the $0.262 level. Technical Indicators 4 hours MACD – The MACD for ADA/USD is gaining momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for ADA/USD is now above the 50 level. Major Support Levels – $0.315, $0.300, and $0.275. Major Resistance Levels – $0.340, $0.350, and $0.365."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-20T04:39:54.000Z",
    "title": "Ethereum Price Could Narrowly Avoid More Losses if it Closes Above One Key Level",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-more-losses-1875/",
    "description": "Ethereum price is trading above the $1,875 support zone against the US Dollar. ETH could start a decent increase if it clears the $1,915 resistance zone. Ethereum is consolidating above the $1,875 level. The price is trading below $1,920 and the 100-hourly Simple Moving Average. There is a major bearish trend line forming with resistance near $1,910 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a steady increase if it clears the $1,915 and $1,940 resistance levels. Ethereum Price Holds Support Ethereum’s price remained stable above the $1,875 support zone. ETH bulls seem to be active above the $1,875 level and protecting more losses, similar to Bitcoin. The price was able to recover a few points above the $1,890 level. However, the bears are active near the $1,900 pivot level. There is also a major bearish trend line forming with resistance near $1,910 on the hourly chart of ETH/USD. Ether is now trading below $1,920 and the 100-hourly Simple Moving Average. On the upside, immediate resistance is near the $1,910 level and the trend line. It is close to the 23.6% Fib retracement level downward move from the $2,027 swing high to the $1,875 low. The first major resistance is near the $1,945 level or the 50% Fib retracement level downward move from the $2,027 swing high to the $1,875 low, above which the price could start a steady increase. Source: ETHUSD on TradingView.com The next major resistance is near the $2,030 level. Any more gains could send Ether toward the $2,120 resistance in the near term. More Losses in ETH? If Ethereum fails to clear the $1,915 resistance, it could start a fresh decline. Initial support on the downside is near the $1,885 level. The first major support is near the $1,875 level, below which the price accelerate lower. The next major support is near the $1,825 support level. If the bulls fail to protect the $1,825 support, there could be a drop to $1,770. Any more losses could open the doors for a move toward the $1,720 support level in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,875 Major Resistance Level – $1,915"
  }
]