[
  {
    "source": "Crypto Daily",
    "date": "2023-11-25T15:37:31.000Z",
    "title": "Bitcoin and Dogecoin are Passe, $3 Million Success Shows How Euler Network is King",
    "url": "https://cryptodaily.co.uk/2023/11/bitcoin-and-dogecoin-are-passe-3-million-success-shows-how-euler-network-is-king",
    "description": "Explore Euler Network's $3 million in 24-hour presale, a game-changer in crypto news. Compare with Bitcoin and Dogecoin. Discover 2024's top investment opportunity."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-25T15:24:36.000Z",
    "title": "GameStop Memes Raises $2M in Presale to Shock Chainlink and TRON",
    "url": "https://cryptodaily.co.uk/2023/11/gamestop-memes-raises-2m-in-presale-to-shock-chainlink-and-tron",
    "description": "Explore GameStop Memes' $2M presales, a crypto force challenging Chainlink and TRON. Witness the clash in the dynamic crypto coins market landscape."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-25T15:30:07.000Z",
    "title": "BRC20 Token ORDI Dips 10% in a Week After a 319% Monthly Surge, Nears Record High",
    "url": "https://news.bitcoin.com/brc20-token-ordi-dips-10-in-a-week-after-a-319-monthly-surge-nears-record-high/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/ordi-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BRC20 Token ORDI Dips 10% in a Week After a 319% Monthly Surge, Nears Record High\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/ordi-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ordi-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ordi-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ordi-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ordi-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ordi-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/ordi-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The price of the BRC20 token ordi (ORDI) slid more than 10% this week against the U.S. dollar after recording substantial gains over the three weeks prior. Despite the recent downturn, ORDI has risen over 300% during the last 30 days and it&#x2019;s a touch over 25% away from surpassing its all-time price high. ORDI [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-25T15:33:33.000Z",
    "title": "Amazing 2TB SSD Deal for Your PS5 Storage available on Black Friday",
    "url": "https://www.cryptopolitan.com/amazing-2tb-ssd-deal-for-your-ps5-storage/",
    "description": "The price of SSDs has been steadily declining in recent years, making it much more reasonable to enhance the storage capacity of your PS5. What was once considered a costly upgrade at the console&#8217;s launch has now become an accessible option, especially with Black Friday discounts like the one currently available for the Adata XPG ... <a title=\"Amazing 2TB SSD Deal for Your PS5 Storage available on Black Friday\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amazing-2tb-ssd-deal-for-your-ps5-storage/\" aria-label=\"More on Amazing 2TB SSD Deal for Your PS5 Storage available on Black Friday\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-25T15:14:00.000Z",
    "title": "Ethereum may retest $2,500, investors dig into Meme Moguls presale",
    "url": "https://crypto.news/ethereum-may-retest-2500-investors-dig-into-meme-moguls-presale/",
    "description": "The Meme Moguls presale is ongoing as bulls expect ETH to edge higher after Ethereum ETFs were recently submitted to the SEC for consideration"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-25T15:36:04.000Z",
    "title": "VESA at Cypher Capital",
    "url": "https://www.newsbtc.com/blockchain-art/vesa-at-cypher-capital/",
    "description": "&#160; Hi fam, Today we’re celebrating a union that took place recently when VESA travelled to Dubai for a month of meetings, partnership calls, keynotes, and conferences. A juicy sized catalogue of VESA works moved into the Cypher Capital Hub in October and this time, we want to celebrate this incredible handshake and share the stories behind the artworks you can see on the walls. In their own words, Cypher Capital is focused on investing in Web3 infrastructure and applications that will drive the digital economy in the future. The Cypher Capital Hub in Marina is shaping up to be one of the sleekest and most functional spots to work, meet and network. The Hub has always been a place for art, most notably two works by Banksy in the main conference room – now featuring a VESA as well. Let’s dive into the stories behind the pieces you can see on the walls of the Hub! Next time you stop by the Hub, please snap a picture of yourself and your favourite VESA work and tag: Cypher Capital Group / Vesa Kivinen // LinkedIn Cypher.capital / artbyvesa // Instagram Refresh has an honorary place at the VIP room alongside two Banksy pieces. &#160; Integration First VESA piece you see on the wall as you walk into the space is Integration. The piece represents the dichotomy of worldviews present in our society in relationships between men and women. On the one hand women occupy positions of power like never before and work incredibly hard to pursue and execute those positions. On the other hand, there is a view that supports tearing down all structures of hierarchy in capitalism and science, as they are seen as an oppressive force, rather than a liberating one. Integration was exhibited at Art Dubai 2022 via the Morrow Collective. &#160; Million Dirham Hotel Residing in the sleek meeting room, is the Million Dirham Hotel. The work is a part of the larger Mirrors- series, which explores value, experiences, and identity. Million Dirham Hotel evokes images of what a hotel with such a high-ticket price would look like. It is an invitation to a world that challenges the ownership vs access paradigm. The Million Dirham Hotel, like all works in the Mirrors- series entices the viewer with its offering of leveraging IP unseen in the traditional art market. Download the Artivive app and experience the AR version, when you stop by. &#160; Truth or Dare- the Currency of Ganesha Next to The Million Dirham Hotel is Truth or Dare- The Currency of Ganesh, or Ganesh for short. This work belongs to the pantheon of VESA’s early crypto art, inspired by the thousands of years old Hindu tradition of faith and worldview. Lord Ganesh is revered as the remover of obstacles, the patron of arts and sciences and a higher being of intellect and wisdom. In this piece, Lord Ganesh and his entourage have assimilated cryptocurrency symbols and blockchain code alongside traditional wealth displays. Gold, platinum, and diamonds hold a historical place in our minds as keepers of value, but as an example the smart contracts layered on top of Ethereum are building the wealth of today and tomorrow. Ganesh is probably THE most complicated work VESA has ever made. It took over 2000 layers of photography of individual paintings and other images before Ganesh started taking shape. &#160; Red Eye Red Eye shows the reality of someone falling into the rabbit hole of crypto. The whirlwind seems endless, and the new information pouring into your consciousness sometimes claims your ability to sleep. This piece is another one with stunning merits, as it was featured in Forbes in their first ever article on this new movement of art and money in January 2019. Red Eye was also exhibited at the opening of the immersive Dubai gallery Art In Space. It launces into its AR version via the Artivive app to showcase motion and sound. &#160; Compound Defiance On the way to the VIP room, you can see Compound Defiance on the wall. This work is steeped in legendary moments and is a part of crypto art history. The fluid motion forming a solid symbolizes the decentralized financial system that has no point of central control and therefore free to define its own rules. This freedom has its positives and negatives, but more options mean a more expansive, rather than repressive experience. The jarring pattern blending endlessly might seem chaotic at first, before the beautiful pattern presents its holistic face. Compound Defiance was the first artwork used on a street legal NFT VESA Art Car in Dubai and it has a VR version made by Zoan. &#160; Refresh Residing in the elegant VIP room, is a piece made in honour of the UAE, called Refresh. It was made in 2020 and it represents the forward-thinking, technologically competent, and culturally mesmerizing country in an artistic way. The round planet in the centre of the piece is Mars, referencing the Emirati space program. Galloping alongside is a tokenized royal horse, modelled after a real-life specimen. The two people featured are the CEO of the Dubai Blockchain Centre, Dr. Marwan Al Zarouni and his wife, Mariam Al Zarouni. In the artwork, the two are immersed in the Bitcoin genesis code, as they witness the evolution of their country. Refresh comes alive with the Artivive app. It has an original soundtrack, and it has been exhibited on large stages in Dubai and Abu Dhabi, as well as extensively in crypto media. &#160; Team VESA wants to thank Cypher Capital for showcasing these works! Until next time,  VESA &#38; Lotta Crypto &#38; NFT Artist All links to physical, NFTs, and more below http://linktr.ee/ArtByVesa &#160;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-25T15:20:10.000Z",
    "title": "Dogecoin (DOGE) Set For Major Price Upswing, Analyst Says",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-doge-set-for-major-price-upswing-analyst-says/",
    "description": "In the last week, DOGE, alongside other cryptocurrencies, suffered a significant price dip following reports of US enforcement action on the world&#8217;s largest exchange, Binance, and the company&#8217;s CEO, Changpeng “CZ” Zhao. In particular, DOGE recorded a cumulative price loss of 6.85%, ranking as one of the biggest losers in the last seven days, according to data from CoinMarketCap. However, there are some positive developments regarding the meme coin, which indicate that investors may soon record a significant price gain. Related Reading: Big Money Returns To Dogecoin: Rally To $0.2 Already Programmed? DOGE Record Transactions Worth Over $100,000 &#8211; Price Gain Imminent?  In an X post on November 23, popular crypto analyst Ali Martinez shared that the DOGE market recorded $100,000 in transactions in the past month based on data from In The Block. According to Martinez, this development marks a rising interest in DOGE from major institutional players as well as crypto whales, which means the maiden meme coin could be set for a price boost soon. Providing more insight into this positive trend in the  DOGE market, blockchain analytics firm Santiment reported that 121 new wallets containing over 1 million DOGE have been created in the last month, terming it “a Sign of Big Money Interest.” Santiment noted that Dogecoin has also recently recorded its largest spike in activity from dormant wallets, which indicates an incoming reversal of the token’s price trend, which is currently negative.  Related Reading: Is Dogecoin About To Reverse? Key Factors To Watch Behind DOGE’s Rise In Transaction &#8211; Dogecoin Co-Founder Weighs In  In explaining the driving force behind increasing Dogecoin transactions, the token’s founder Billy Markus, with the X username Shibetoshi Nakamoto pointed out the introduction of ordinals and shitcoins. This information was revealed in a separate post on X in response to a crypto enthusiast who highlighted the “parabolic” trend in the number of transactions on the Dogecoin network. DOGE Ordinals, popularly known as “Doginals,” are quite similar to the Bitcoin Ordinals. They are referred to as DRC-20 token standards, which allow users to inscribe information on the smallest individual units of a Dogecoin, i.e., shibes. With the DRC-20 standard, DOGE users can now create non-fungible tokens (NFTs) supported by the Dogecoin network. Understandably, this has led to a substantial rise in the transactions on the Dogecoin network. While this development marks an increased network adoption, which could attract investors, the increase in transactions is also accompanied by high network fees, which may drive away network users.  At the time of writing, DOGE trades at $0.078 with a 0.4% gain in the 24 hours. Meanwhile, its trading volume is up by 13.20% and valued at $374.16 million. DOGE trading at $0.0775 on the daily chart &#124; Source: DOGEUSDT chart on Tradingview.com Featured image from PYMNTS, chart from Tradingview"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-25T15:30:52.000Z",
    "title": "Bitcoin Surging by up to 960% This Bull Cycle ‘Very Reasonable’, Says Michaël van de Poppe – Here’s His Outlook",
    "url": "https://dailyhodl.com/2023/11/25/bitcoin-surging-by-up-to-960-this-bull-cycle-very-reasonable-says-michael-van-de-poppe-heres-his-outlook/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/Very-Reasonable-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/Very-Reasonable-btc.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2023/11/Very-Reasonable-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/Very-Reasonable-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/Very-Reasonable-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/Very-Reasonable-btc.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2023/11/Very-Reasonable-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto trader Michaël van de Poppe is predicting a massive Bitcoin (BTC) surge in the current bull market cycle. In a new strategy session, Van de Poppe tells his 161,000 YouTube subscribers that based on previous bull market cycles and the laws of diminishing returns Bitcoin could explode 961% from its current value to as [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/25/bitcoin-surging-by-up-to-960-this-bull-cycle-very-reasonable-says-michael-van-de-poppe-heres-his-outlook/\">Bitcoin Surging by up to 960% This Bull Cycle ‘Very Reasonable’, Says Michaël van de Poppe – Here’s His Outlook</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]