[
  {
    "source": "CoinDesk",
    "date": "2024-03-20T23:13:16.000Z",
    "title": "FTX Was Down to Last 105 Bitcoins When Bankruptcy Rescue Crew Arrived: John Ray",
    "url": "https://www.coindesk.com/policy/2024/03/20/ftx-was-down-to-last-105-bitcoins-when-bankruptcy-rescue-crew-arrived-john-ray/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "John J. Ray III Fires Back Against SBF’s ‘Delusional’ Claims Customers Lost No Money in FTX Collapse"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-20T23:28:09.000Z",
    "title": "If SEC classifies ETH as a security, it challenges CFTC’s commodity perspective, says analyst",
    "url": "https://cryptobriefing.com/sec-ethereum-securities-debate/",
    "description": "SEC's rumored legal push to classify Ethereum as a security could directly oppose CFTC's views and sparking widespread debate."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-20T23:30:12.000Z",
    "title": "Hold Your Horses: ‘Buying The Crypto Dip Is Still Too Early’ Warns Top Analyst — Here’s Why",
    "url": "https://www.newsbtc.com/news/bitcoin/hold-your-horses-buying-the-crypto-dip-is-still-too-early-warns-top-analyst-heres-why/",
    "description": "Amid a recent downturn in the broader crypto market, the concept of &#8220;buying the dip&#8221; has once again surfaced, tempting traders and investors with the prospect of snagging assets at lower prices. However, caution is the watchword from Markus Thielen, CEO of 10x Research, a top analyst in the crypto space. Thielen&#8217;s latest advisories suggest that the current market conditions may not yet be ripe for the optimistic strategy of dip purchasing. Related Reading: High-Stakes Week For Bitcoin And Ethereum As Central Bank Decisions Approach: Key Predictions The Basis Of Bearish Sentiment Thielen&#8217;s recent analysis, released earlier today, underscores a bearish outlook on flagship cryptocurrencies Bitcoin (BTC) and Ethereum (ETH), advising that it may be premature to buy the dip. This guidance is rooted in a comprehensive approach to market analysis, combining analog models, data-driven predictive models, and objective analysis. At the heart of Thielen&#8217;s cautionary stance is a detailed report outlining the factors contributing to the firm, 10x Research&#8217; bearish outlook on Bitcoin and Ethereum. Despite a seemingly attractive price point for these cryptocurrencies, Thielen believes the market has not yet bottomed out, suggesting further declines before any significant rally. The report pinpoints $63,000 and $60,000 as critical support levels for Bitcoin. A breach below $60,000, Thielen warns, could precipitate a fall into the $52,000-$54,000 range. Yet, despite these short-term bearish indicators, Thielen remains optimistic about Bitcoin&#8217;s potential, envisioning a climb to heights of over $100,000 within the year. Thielen noted: Buying this dip is still too early. Technically, we still expect Bitcoin to trade below 60,000 before a more meaningful rally attempt is started. Based on the previous new high signals, we could paint a rosy picture of 83,000 and 102,000 upside targets, but for the time being, we are more focused on managing the downside. The Crypto Market&#8217;s Critical Juncture The current state of the crypto market reflects a tense anticipation of the upcoming central bank announcements from the US Federal Reserve. This decision is expected to significantly influence monetary policy and, by extension, the cryptocurrency market. Particularly, insights from crypto futures exchange Blofin suggest that the outcome of this announcement could sway market sentiment substantially. Meanwhile, the market reacts in real-time, with Bitcoin slightly increasing 2.4% in the past 24 hours but still showing a notable decline over the past week. Adding to the complexity of the market dynamics are observations from Alex Krüger, a respected figure in macroeconomics and cryptoanalysis. Related Reading: Bitcoin Might Be Poised For A ‘Double Pump Cycle,’ Reveals Analyst – Here’s Why Krüger attributes the recent price collapse to several factors, including market over-leverage, the negative sentiment ripple from Ethereum, and speculative fervor around certain altcoins. These elements combine to paint a picture of a market at a crossroads, with significant volatility and uncertainty ahead. Reasons for the crash, in order of importance (for those who need them) #1 Too much leverage (funding matters) #2 ETH driving market south (market decided ETF not passing) #3 Negative BTC ETF inflows (careful, data is T+1) #4 Solana shitcoin mania (it went too far) — Alex Krüger (@krugermacro) March 20, 2024 Featured image from Unsplash, Chart from TradingView &#160;"
  }
]