[
  {
    "source": "CoinDesk",
    "date": "2023-11-29T23:54:45.000Z",
    "title": "Celo Developer Proposes Mid-January Timeline for Evaluating Closely Watched Layer-2 Move",
    "url": "https://www.coindesk.com/tech/2023/11/29/celo-developer-proposes-mid-january-timeline-for-evaluating-closely-watched-layer-2-move/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "With hot competition between layer-2 technology providers like Optimism, Polygon and Matter Labs, Celo's choice is being closely watched by the blockchain industry."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-30T00:04:48.000Z",
    "title": "Research the dynamics of market manipulation before you jump in Bitcoin ETFs",
    "url": "http://cointelegraph.com/news/research-the-dynamics-of-market-manipulation-before-you-jump-in-bitcoin-etfs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/7739e65e-385a-400f-9d74-ddc1527aec45.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin ETFs could be subject to manipulation in the spot Bitcoin market. The SEC's chief concern is figuring out how to prevent manipulation induced by ETFs.</p>\n                    <p><p>Investors are eagerly anticipating the potential approval of a spot bitcoin exchange-traded fund (ETF) by the United States Securities and Exchange Commission (SEC). The excitement began in early June when the investment giant BlackRock submitted a filing for the product and gained further momentum after a court decision mandated the SEC reconsider its rejection of <a href=\"https://cointelegraph.com/news/court-mandate-grayscale-sec-spot-bitcoin-etf\">Grayscale's proposal to transform its Bitcoin Trust</a> (GBTC) into a spot ETF.</p><p>The SEC’s objection to ETFs is related to the fact that Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is traded in unregulated venues around the world, which poses a challenge in preventing fraud and price manipulation.</p><p>One attempt to address the issue has included surveillance-sharing agreements (SSA) with some cryptocurrency exchanges. In theory, this would allow the identification of bad actors who attempt to manipulate the market. Critics question the efficacy of these SSAs given they cannot cover the entire market. ETFs are based on precedent decisions that allowed spot commodity ETFs based on the relevance of the underlying commodity futures markets.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-halving-months-away-may-time-risk-on\"><strong><em>With Bitcoin’s halving months away, it may be time to go risk-on</em></strong></a></p><p>The SEC has established that the futures should lead the spot in price formation in order to be considered a “regulated market of significant size.” In other words, information from the futures market takes precedence over the spot market in the price discovery process. Yet, even if price discovery is led by the futures market, there are still some cases where manipulation in the spot markets can spread to the ETF. The devil is in the details, and more specifically, in the price source for the net asset value (NAV) calculation and in the creations and redemptions method (in-cash or in-kind). </p><p>Consider a scenario where a manipulator successfully drives the underlying commodity price down by 5% in unregulated spot markets.</p><p>If the creations and redemptions are in-kind, there is a straightforward arbitrage that acts like communicating vessels between the ETF and the unregulated spot markets. In this example, the arbitrageur can exploit it by simply buying underpriced spot commodity and selling the corresponding amount of the ETF, and then using the bought commodity to create new ETF units and cover the short ETF position. The profitability of this trade will last until there is a substantial convergence of the spot commodity price and the equivalent amount of the ETF. How much each price will move toward the convergence depends on their liquidity, but some of the adjustment will come from the ETF price, meaning that the manipulation in the spot market spreads to the ETF, at least in part.</p><p>In a case where the creations and redemptions are in cash and the NAV is calculated with commodity prices derived from the unregulated spot markets, a very similar arbitrage is possible. The arbitrageur buys underpriced spot commodity and sells the ETF, uses cash to create ETF units to cover the short position and sells the commodity trying to replicate the pricing methodology used in the NAV calculation (which determines the price paid for the creations). Apart from worse capital efficiency (due to cash disbursement for creation) and a small execution risk when replicating the NAV price, the trade is basically the same as with in-kind creation and the consequences are similar.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/futures-best-crypto-game-even-after-bitcoin-spot-etf\"><strong><em>Futures will be the best crypto game in town even after a Bitcoin spot ETF</em></strong></a></p><p>Is there a setup that effectively shields the ETF from manipulation? The use of spot prices derived from the futures curve for calculating NAV, coupled with in-cash creations and redemptions, emerges as the most promising alternative. If an arbitrageur attempts to apply the same method as in the previous case, there is no guarantee of selling the commodity at a price similar to that used in NAV calculation, especially in the presence of a manipulator in the spot market. The trade is no longer an arbitrage. The pipes connecting the spot price and the ETF price are obstructed.</p><p>On the flip side, this setup facilitates a straightforward arbitrage path between the ETF and futures. Whenever the ETF price diverges from the spot price implied by the futures curve, an arbitrageur can execute a trade in the opposite position with perfect hedging on futures, establishing a robust link between the ETF and the futures market. It is reasonable to believe that an ETF with such characteristics would be as resistant to manipulation in unregulated spot markets as the futures contracts or a futures ETF.</p><p>Both academics and practitioners have already found some robust evidence supporting the idea that CME Bitcoin Futures are dominant in Bitcoin’s price discovery. Undoubtedly, a spot Bitcoin ETF in the U.S. would be a good development for the traditional markets and the crypto industry. As the American pastor Chuck Swindoll once said, \"The difference between something good and something great is attention to detail.\" By keeping the devils away, a Bitcoin ETF has the potential to be truly great for investors.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>João Marco Braga da Cunha</strong> is the portfolio manager at Hashdex. He obtained a master of science in economics from Fundação Getulio Vargas before obtaining a doctorate in electrical and electronics engineering from the Pontifical Catholic University of Rio de Janeiro.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-30T00:03:59.000Z",
    "title": "Over 75% of Web3 games ‘failed’ in last five years: CoinGecko",
    "url": "http://cointelegraph.com/news/three-quarters-web3-blockchain-games-failed-last-five-years-coingecko",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/7df7ab5d-eaa5-4d7c-90fe-e57b6fdc1446.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The “failed” blockchain games are those that have seen their 14-day moving average number of active users down more than 99% from its peak.</p>\n                    <p><p>More than three-quarters of all blockchain games launched in the last five years are dead in the water, <a href=\"https://www.coingecko.com/research/publications/how-many-gamefi-dead?utm_campaign=Data%2BVisualization&amp;utm_medium=social\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to a recent study from CoinGecko.</p><p>Out of 2,817 games launched between 2018 and 2023, which were included in the study, only 690 of them still have a somewhat active player base. </p><p>CoinGecko defines a “failed” Web3 game as one where the 14-day moving average number of active users drops 99% or more from its peak.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/49113633-6aee-49df-b6c6-81b1919dca04.png\"  /><figcaption style=\"text-align: center;\"><em>More than 75% of Web3 games have failed over the last five years. Source: CoinGecko</em></figcaption></figure><p>While 2021 saw the highest number of blockchain games launched in a single year with 738 games, the following year — marred by <a href=\"https://cointelegraph.com/news/7-biggest-crypto-collapses-of-2022-the-industry-would-like-to-forget\">major crypto collapses,</a> saw the highest number of games to fizzle out, with 742 failing in a single year.</p><p>This puts the average failure rate of Web3 games at around 80% for any given year since 2018, according to CoinGecko. </p><p>CoinGecko noted that years of lower failure tended to coincide with the back of bull markets, while higher failure years came toward the start of bear market cycles. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/free-to-play-web3-games-mass-adoption-ygg-gabby-dizon\"><strong><em>Free-to-play Web3 games hold the key to mass adoption — YGG co-founder</em></strong></a></p><p>CryptoKitties was one of the first Web3 games that gathered hype in late 2017, but its adoption has since fizzled out. Decentraland, The Sandbox and Axie Infinity are among other Web3 games that have launched in the earlier years and are still widely used today.</p><p>Per recent data, Alien Worlds, Splinterlands and Planet IX had the three highest average unique active wallets used between Jan. 1 and Apr. 22, 2023, <a href=\"https://www.coingecko.com/research/publications/top-web3-games#:~:text=The%20most%20popular%20world%2Dbuilding,all%2020%20top%20web3%20games.\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to CoinGecko.</p><p>While 2022 had the highest number of failed games, 2023 has <a href=\"https://cointelegraph.com/news/play-to-earn-has-fatal-flaws-how-can-web3-gaming-be-more-sustainable\">slowed the trend</a>, with only 507 failed projects as of Nov. 27.</p><p>“The lower failure rate could perhaps indicate a stabilization in the state of web3 gaming,” CoinGecko said.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/plunge-web3-games-2023-real-hits-shrapnel-26m-nfl-rivals-nft-web3-gamer/\"><strong><em>65% plunge in Web3 Games in ’23 but ‘real hits’ coming, $26M NFL Rivals NFT: Web3 Gamer</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-29T23:45:16.000Z",
    "title": "FTX approved to liquidate $744M in Grayscale assets to pay creditors",
    "url": "https://cryptoslate.com/ftx-approved-to-liquidate-744m-in-grayscale-assets-to-pay-creditors/",
    "description": "<p>In a significant move towards paying billions owed to creditors, FTX has gained bankruptcy court approval to begin liquidating its $744 million worth of stakes in digital trusts managed by Grayscale Investments. FTX, embroiled in bankruptcy since last year following its collapse, has since been working under new leadership to locate assets and unravel a [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ftx-approved-to-liquidate-744m-in-grayscale-assets-to-pay-creditors/\">FTX approved to liquidate $744M in Grayscale assets to pay creditors</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-29T23:43:00.000Z",
    "title": "XRP Wallet Xumm Sees 45% Increase in Active Users as Holders Register for Upcoming Airdrop",
    "url": "https://www.cryptoglobe.com/latest/2023/11/xrp-wallet-xumm-sees-45-increase-in-active-users-as-holders-register-for-upcoming-airdrop/",
    "description": "Popular XRP wallet Xumm has recently seen a significant surge in the number of users behind it ahead of an upcoming token airdrop that will reward XRP token holders. The airdrop, is coming from layer-2 smart contract platform Evernode. According to available data, Xumm had 17,330 unique active users on November 26, with the figure […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-30T00:05:27.000Z",
    "title": "Crypto Recap: Highlights from today’s events",
    "url": "https://www.cryptopolitan.com/crypto-recap-highlights-from-todays-events/",
    "description": "In today&#8217;s rapidly evolving crypto world, several key events have made headlines, impacting the landscape of digital currencies and blockchain technology. From regulatory actions against a crypto mixer linked to North Korea to Binance&#8217;s operational status in the Philippines and a significant legal development involving Genesis and Digital Currency Group (DCG), the day has been ... <a title=\"Crypto Recap: Highlights from today&#8217;s events\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-recap-highlights-from-todays-events/\" aria-label=\"More on Crypto Recap: Highlights from today&#8217;s events\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T23:58:52.000Z",
    "title": "Binance set to phase out BUSD by next month",
    "url": "https://www.cryptopolitan.com/binance-set-to-phase-out-busd-by-next-month/",
    "description": "In a significant shift within the cryptocurrency market, Binance, a major player in the digital currency exchange sphere, has announced its decision to discontinue support for Binance USD (BUSD). This move, set to begin on December 15th, follows the announcement by Paxos to halt the minting of new BUSD coins. This development signals a pivotal ... <a title=\"Binance set to phase out BUSD by next month\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-set-to-phase-out-busd-by-next-month/\" aria-label=\"More on Binance set to phase out BUSD by next month\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T23:50:25.000Z",
    "title": "Masking the real story: Inflation’s complex journey for central banks",
    "url": "https://www.cryptopolitan.com/inflations-complex-journey-for-central-banks/",
    "description": "Inflation&#8217;s recent trajectory has sparked a standoff between central banks and the markets. On one side, central bankers are cautiously refraining from celebrating the slowdown in inflation across advanced economies, while on the other, investors are already betting on imminent rate cuts. This divergence in perspectives hinges on the future path of inflation, which remains ... <a title=\"Masking the real story: Inflation&#8217;s complex journey for central banks\" class=\"read-more\" href=\"https://www.cryptopolitan.com/inflations-complex-journey-for-central-banks/\" aria-label=\"More on Masking the real story: Inflation&#8217;s complex journey for central banks\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T23:50:00.000Z",
    "title": "Estonian court blocks extradition of Hashflare founders to U.S.",
    "url": "https://www.cryptopolitan.com/estonian-court-blocks-extradition-of-hashflare-founders-to-u-s/",
    "description": "The Tallinn Circuit Court in Estonia has overturned previous rulings that approved the extradition of Ivan Turogin and Sergei Potapenko, co-founders of the cryptocurrency mining service Hashflare, to the United States. This decision, announced on November 29, challenges the U.S. authorities&#8217; efforts to prosecute the duo for their alleged involvement in a substantial fraud and ... <a title=\"Estonian court blocks extradition of Hashflare founders to U.S.\" class=\"read-more\" href=\"https://www.cryptopolitan.com/estonian-court-blocks-extradition-of-hashflare-founders-to-u-s/\" aria-label=\"More on Estonian court blocks extradition of Hashflare founders to U.S.\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-29T23:42:26.000Z",
    "title": "U.S. banks in limbo with their quest for liquidity",
    "url": "https://www.cryptopolitan.com/us-banks-in-limbo-their-quest-for-liquidity/",
    "description": "The U.S. banking landscape is currently navigating a complex financial terrain, marked by a quest for liquidity amidst the Federal Reserve&#8217;s quantitative tightening (QT) measures. Contrary to the anticipated reduction in bank reserves due to the Fed&#8217;s QT, 2023 has seen a surprisingly stable level of reserves. This stability, initially perceived as a buffer for ... <a title=\"U.S. banks in limbo with their quest for liquidity\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-banks-in-limbo-their-quest-for-liquidity/\" aria-label=\"More on U.S. banks in limbo with their quest for liquidity\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-30T00:00:14.000Z",
    "title": "Bitcoin Decouples with XRP, BNB But Correlates With Dogecoin and Cardano",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-decouples-xrp-bnb-correlates-dogecoin-cardano/",
    "description": "In the last two months, Bitcoin (BTC), the world&#8217;s most valuable cryptocurrency, has been increasingly decoupling from XRP, the native currency of the XRP Ledger (XRPL), and BNB, the coin priming the broader Binance ecosystem. While this pans out, Dogecoin (DOGE) and Cardano (ADA) remain mostly correlated with Bitcoin.  XRP, BNB Decoupling From Bitcoin While rising de-correlation suggests that the market is maturing and becoming more sophisticated, secondary factors could make some of the top altcoins decouple and chart their courses away from the tight grasp of Bitcoin.  Related Reading: XRP Community And Cardano Founder Engage In Heated Clash Sharing data from Kaiko, a blockchain analytics firm, @cryptobusy on X notes that the correlation between Bitcoin, XRP, and BNB has been contracting in the last two months. Meanwhile, BTC, Dogecoin, and Cardano prices have been moving in sync despite fundamental factors of each project impacting price action over this period. The drop in correlation indicates that altcoins are increasingly gaining more market share from Bitcoin. This drop in Bitcoin dominance happens especially whenever certain altcoins move independently and are not influenced by how Bitcoin trends.  In most cases, like it has been the case in Q4 2023, a spike in Bitcoin prices triggers altcoin demand, lifting them as a result. Besides Cardano and Dogecoin, for instance, Solana (SOL) and Tron (TRX) are two altcoins that have been rallying and tracking Bitcoin. Additionally, the drop in correlation could mean the altcoin scene is maturing, and more investors are keen on picking out projects that offer more utility, not just BTC proxies. With more investors, altcoins tend to be more liquid, drawing even more capital. BNB, XRP, BTC Impacted By Fundamental Factors Even so, there could be more that explains the decoupling, especially with BNB and XRP. Seismic fundamental events have impacted BTC, XRP, and BNB ecosystems in the last two months.  Related Reading: A Golden Opportunity For Ethereum? 600% Buy Signal Returns The United States Securities and Exchange Commission (SEC), for instance, is likely to approve multiple spot Bitcoin ETFs filed by several heavyweights, including BlackRock and Fidelity, in the coming weeks. Hopes of the regulator authorizing these derivatives tracking spot BTC prices have catalyzed demand, lifting the coin to new 2023 highs.  Meanwhile, a United States court ruled in favor of XRP being a utility when sold to retailers. The case initially forced prices higher, but the coin tracked lower throughout late Q3 2023 and 2024, only steadying as BTC rallied. At the same time, BNB was negatively impacted by Changpeng Zhao, the founder of Binance, resigning in November 2023. The Department of Justice also fined Binance with a $4.3 billion penalty as a settlement. Feature image from Canva, chart from TradingView"
  }
]