[
  {
    "source": "Cointelegraph",
    "date": "2023-10-10T23:13:00.000Z",
    "title": "Bitcoin needs Ethereum VM to reach its full potential — Web3 exec",
    "url": "https://cointelegraph.com/news/bitcoin-needs-ethereum-evm-botanix-founder",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/f70fa00c-2039-4901-ada9-8a053a5eba1d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Botanix Labs founder Willem Schroé argues a “huge amount of value” from real-world assets will be captured on Bitcoin, provided it connects to the Ethereum Virtual Machine.</p>\n                    <p><p>Mainstream Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) adoption won’t happen until it bridges to the Ethereum Virtual Machine (EVM) — the first point of entry for many real-world assets moving on-chain, a Web3 executive argues.</p><p>Speaking to Cointelegraph, the founder of cross-chain infrastructure firm Botanix Labs, Willem Schroé, claimed Bitcoin “needs to start playing in the EVM world” for it to build real-world use cases to increase its adoption and utility.</p><p>“Bitcoin is the most technologically secure and truly decentralized protocol [and] the EVM has proven itself to be the application layer for the global financial system,” Schroé said.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Our Botanix Protocol positions Ethereum as a Layer-2 solution on top of <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a>. <br><br>We&#39;ve added Ethereum onto the Bitcoin Network&#39;s secure foundation to harness the security of its Proof-of-Work mechanism.<br><br>Also, enjoy the developmental ease of Ethereum.</p>&mdash; Botanix Labs  (@BotanixLabs) <a href=\"https://twitter.com/BotanixLabs/status/1706317642213073088?ref_src=twsrc%5Etfw\">September 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>While Bitcoin is typically used as a peer-to-peer payment system or for storing value, Schroé said its potential won’t be fulfilled unless the cryptocurrency can connect to the broader financial system, such as with security and commodity markets.</p><p>Connecting Bitcoin to Ethereum-based real-world assets, stablecoins, decentralized finance and nonfungible tokens via the EVM is the first step in that direction, Schroé argued. </p><blockquote>“That’s a huge amount of value and development waiting to happen.”</blockquote><p>Schroé’s Botanix Labs aims to connect the Bitcoin and Ethereum ecosystems through its “Spiderchain” — a proof-of-stake layer 2 that implements EVM to EVM bridges to enable Bitcoin to interact with the EVM.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Bitcoin and Ethereum may seem like opposites, but they can co-exist and complement each other.<br><br>However, this does present some challenges.<br><br>Multi-chain ecosystems with cross-chain bridges can have security and centralization risks, hindering the potential of collaboration.</p>&mdash; Botanix Labs  (@BotanixLabs) <a href=\"https://twitter.com/BotanixLabs/status/1708923285910548577?ref_src=twsrc%5Etfw\">October 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Staked assets are secured by a decentralized multisignature mechanism, and its design doesn’t require Bitcoin to be forked.</p><p>Schroé believes the current solutions involving wrapped Bitcoin on Ethereum and other EVM-compatible chains are problematic and argues they are susceptible to censorship and regulatory scrutiny, as they’re operated by the centralized United States-based company BitGo.</p><p>A similar proposal to bring Ethereum functionality to Bitcoin is also being proposed through “drivechains,” also known as the <a href=\"https://cointelegraph.com/news/bitcoin-bip300-drivechain-proposal-sparks-debate-and-alternate-solutions\">Bitcoin Improvement Proposal-300</a>, which Bitcoin developers are again discussing. If implemented, it would allow “sidechains” to be built on the network.</p><p>On Oct. 9, Bitcoin developer Robin Linus released a white paper titled “BitVM: Compute Anything on Bitcoin,” which details how Ethereum-like optimistic rollup smart contracts could be made on the Bitcoin network.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/el-salvador-kids-taught-how-to-send-bitcoin\"><strong><em>El Salvador’s Bitcoiners teach 12-year-olds how to send sats</em></strong></a></p><p>Unlike the Spiderchain, BIP-300 would require Bitcoin to <a href=\"https://cointelegraph.com/learn/soft-fork-vs-hard-fork-differences-explained\">soft fork</a> and would be activated by miners — similar to <a href=\"https://cointelegraph.com/news/breaking-the-bitcoin-network-welcomes-taproot-soft-fork-upgrade\">the Taproot soft fork</a> in November 2021 that paved the way for the NFT-emulating Ordinals and BRC-20 tokens.</p><p>The BIP’s creator, Paul Sztroc, says those favoring BIP-300 believe it will offer new privacy and scaling use cases to Bitcoin, among other benefits.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">So far at <a href=\"https://twitter.com/tabconf?ref_src=twsrc%5Etfw\">@tabconf</a>:<br><br>* Many pro Bip300 -- popular usecases are Privacy, Scaling, and experimentation (get new OP codes now)<br>* Very popular question is: when is my debate with Peter Todd (Friday at 2 PM)<br>* Many complained about off-base Twitter dialog and nonsense propaganda <br>*…</p>&mdash; Paul Sztorc (@Truthcoin) <a href=\"https://twitter.com/Truthcoin/status/1699780731801567272?ref_src=twsrc%5Etfw\">September 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, not everyone likes the idea of expanding Bitcoin’s ecosystem beyond its current use cases.</p><p>Cory Klippsten, the CEO of BTC-only exchange Swan Bitcoin, <a href=\"https://twitter.com/coryklippsten/status/1695822467963490417\" target=\"_blank\" rel=\"noopener nofollow\">believes</a> drivechains and solutions that bring other assets to Bitcoin will bring an influx of scammers.</p><p><a href=\"https://www.google.com/search?sca_esv=571776918&amp;sxsrf=AM9HkKlLVcucYcKOIfFpdIaXQZLReMWyVw:1696804370345&amp;q=Saifedean+Ammous&amp;stick=H4sIAAAAAAAAAONgVuLVT9c3NExPSitITjKxeMRowS3w8sc9YSn9SWtOXmPU5OIKzsgvd80rySypFJLmYoOyBKX4uVB18ixiFQhOzExLTUlNzFNwzM3NLy0GAKLYhbRfAAAA&amp;sa=X&amp;ved=2ahUKEwi9p_3twOeBAxXn3jgGHe1YCqQQzIcDKAB6BAgXEAE\" target=\"_blank\" rel=\"noopener nofollow\">Saifedean Ammous</a>, the author of The Bitcoin Standard, opposes the idea of issuing altcoins on Bitcoin, suggesting that “good money” is the only token needed.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">People only think tokens are a good idea because we live in a world of broken money. A good money is the only token anyone ever needs. Bitcoin is going to detokenize the world. <a href=\"https://t.co/q8Nhc7XcOX\">https://t.co/q8Nhc7XcOX</a></p>&mdash; Saifedean Ammous (@saifedean) <a href=\"https://twitter.com/saifedean/status/1696201724699066497?ref_src=twsrc%5Etfw\">August 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, Schroé said he thinks bringing together Bitcoin and Ethereum could produce a new array of applications “with decentralization and security as first principles.“</p><p>“EVM is the winning virtual machine, and Bitcoin is the best money,” he said.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethereum-eating-world-only-need-one-internet/\"><strong><em>Ethereum is eating the world — ‘You only need one internet’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]