[
  {
    "source": "CoinDesk",
    "date": "2023-11-07T20:47:27.000Z",
    "title": "Bitcoin Squeezes to $35.5K as 'Mini Altcoin Season' Lifts Crypto Market Cap to $1.3 Trillion",
    "url": "https://www.coindesk.com/markets/2023/11/07/bitcoin-squeezes-to-355k-as-mini-altcoin-season-lifts-crypto-market-cap-to-13-trillion/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "tktk"
  },
  {
    "source": "Decrypt",
    "date": "2023-11-07T20:55:45.000Z",
    "title": "Elon Musk’s Neuralink Wants Human Volunteers—After Killing 1,500 Animals",
    "url": "https://decrypt.co/204700/elon-musk-neuralink-animal-testing-death-toll",
    "description": "Excitement surrounding the controversial startup peaked again Tuesday. But how much blood will be spilt on its path to success?"
  },
  {
    "source": "Decrypt",
    "date": "2023-11-07T20:53:42.000Z",
    "title": "Don't Look Now Gary, CFTC Says It's the 'Premier Enforcement Agency' in Crypto",
    "url": "https://decrypt.co/204685/cftc-says-its-premier-enforcement-agency-in-crypto",
    "description": "CFTC Chair Rostin Behnam said he's proud the regulator hit more crypto projects than ever before with enforcement actions."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-07T20:36:57.000Z",
    "title": "Neuralink Vision Chip Coming In ‘A Few Years’, Says Elon Musk",
    "url": "https://decrypt.co/204694/neuralink-vision-eyesight-implant-chip",
    "description": "Responding to a Twitter user, Musk said the device is awaiting regulatory approval before human trials can begin."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-07T20:31:29.000Z",
    "title": "Anime Streaming Service Crunchyroll Adds Games—Here's What You Can Play",
    "url": "https://decrypt.co/204688/crunchyroll-adds-games-anime-subscriptions-heres-what-you-can-play",
    "description": "Crunchyroll has added five mobile games for its top-tier subscribers. From RPGs to visual novels and puzzles, here's what's on offer."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-07T19:49:18.000Z",
    "title": "NFT Volume Hits 3-Month High—You Can Thank This Massive CryptoPunks Sale",
    "url": "https://decrypt.co/204674/nft-volume-hits-3-month-high-thank-massive-cryptopunks-sale",
    "description": "Sales of NFTs hit a three-month high on Monday, building on a positive trend that emerged in October before \"The Simpsons\" took on NFTs."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-07T20:32:00.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "http://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Bitcoin's (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) supply continues to be bought up by long-term holders, according to new data from Glassnode. Kenyan lawmakers have asked the local Blockchain Association to develop a regulatory framework on which they could craft a crypto bill. Meanwhile, lawmakers have proposed cutting SEC Chairman Gary Gensler's salary to $1, and Binance's spot trading volume has fallen sharply.</p><h3>Bitcoin supply held by long-term hodlers continues to rise</h3><p>The <a href=\"https://cointelegraph.com/news/bitcoin-supply-held-long-term-holders-hits-all-time-high\">quantity of Bitcoin</a> held by its most ardent supports has reached a new all-time high, according to data from Glassnode.</p><p>A new report by the blockchain data provider suggests Bitcoin holders are accumulating the asset due to their long-term bullish conviction. \"If we isolate only entities on the smaller end of the scale, such as Shrimps (&lt;1 BTC), Crabs (1-10 BTC) and Fish (10-100 BTC), we can see their accumulation pattern is quite significant,\" Glassnode said, adding:</p><blockquote>\"The combined rate of balance increase for this sub-group is currently equivalent to 92% of newly mined supply and has remained elevated since May 2022.”</blockquote><p>Bitcoin's price has caught favorable tailwinds amid rumors that the U.S. Securities and Exchange Commission was laying the groundwork for <a href=\"https://cointelegraph.com/news/bitcoin-btc-price-breaks-34000-etf-excitement-grows\">spot ETF approval</a>. The largest digital currency by market cap traded above $35,400 on Nov. 7.</p><h3>Kenyan lawmakers ask local Blockchain Association to come up with crypto bill</h3><p>Kenya could become the first country in the world where the industry’s representatives would develop the regulatory framework for crypto. According to the Blockchain Association of Kenya (BAK), The National Assembly’s Departmental Committee on Finance and National Planning has directed it to prepare the first draft of “what could become a virtual asset service provider’s bill.”</p><p>On Oct. 31, the Committee on Finance and National Planning invited BAK representatives to discuss the digital assets regulation. BAK’s legal and policy director, Allan Kakai, shared the details behind the meeting with the local media, Mariblock:</p><blockquote>“Basically, we are telling [the] parliament: ‘Look, Kenya has always branded itself as the Silicon Savannah; we are top three for digital assets [volume in Africa], and if we do not develop a clear licensing and regulatory framework, Nigeria, South Africa, Botswana, Namibia, Mauritius would take the lead, and the capital flow that would have come to Kenya would have flocked elsewhere.”</blockquote><p>In response, the committee gave the BAK two months to draft the crypto bill. The message in the committee’s official X (formerly Twitter) account notes only that it “urged the Association to undertake robust public education on cryptocurrency trade to demystify it.”</p><h3>US lawmaker proposes to cut SEC chair Gary Gensler’s salary to $1</h3><p>A United States lawmaker wants to strip the Securities and Exchange Commission chair Gary Gensler of his salary <a href=\"https://cointelegraph.com/news/gary-gensler-salary-one-dollar-sec-proposed-bill-lawmaker\">by paying him just $1 per year.</a></p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">you gotta admit - this bill&#39;s proposed cutting the wealthy SEC Chair Gary Gensler&#39;s salary from $300,000 to $1 is pretty fitting considering how regulatory positions are so often a revolving door into private industry!</p>&mdash; Northeast (@Northeast603) <a href=\"https://twitter.com/Northeast603/status/1721741121292820691?ref_src=twsrc%5Etfw\">November 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In a proposed amendment to the Financial Services and General Government (FSGG), Rep. Tim Burchett suggested that Gensler’s salary be brought down to $1, as part of wider proposal to defund the regulator.</p><p>First introduced on July 13 this year, the FSGG <a href=\"https://www.congress.gov/118/crpt/hrpt145/CRPT-118hrpt145.pdf\" target=\"_blank\" rel=\"noopener nofollow\">bill</a> is a wide-ranging piece of legislation that aims to significantly reduce government spending across the board.</p><p>It’s <a href=\"https://www.sec.gov/about/careers/sec-compensation\" target=\"_blank\" rel=\"noopener nofollow\">estimated</a> that Gensler earns north of $300,000 per year for his duties as head of the SEC.</p><h2>Binance’s spot trading market share falls to 40% in 2023</h2><p>Binance’s spot trading market share has fallen to 40%. A year ago it stood at 63%, indicating that one of the world’s most popular cryptocurrency exchange platforms has <a href=\"https://cointelegraph.com/news/binance-spot-trading-market-share-falls-40-percent-2023\">lost about a third of the market</a> in just 12 months. This, according to a Nov. 6 report by blockchain analytics firm 0xScope. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Binance used to be the go-to for crypto trading, but it’s now sharing more of the market. A sign of healthy competition or a change in trader preferences? <a href=\"https://t.co/4nvrIzZGtL\">https://t.co/4nvrIzZGtL</a></p>&mdash; Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1721594070504497570?ref_src=twsrc%5Etfw\">November 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to the report:</p><blockquote>“Binance’s spot trading volume has seen a significant decline in the past year, perhaps due to its listing strategy. Most popular coins experienced a downturn immediately after being listed on Binance.”</blockquote><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-07T20:09:22.000Z",
    "title": "US CFPB proposes supervising digital app providers, including crypto wallets ",
    "url": "http://cointelegraph.com/news/us-cfpb-proposes-supervising-digital-app-providers-including-crypto-wallets",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/5978037f-3d8f-4258-98d1-28094d584d60.jpeg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The proposal would affect retail transactions carried out from crypto wallets, but not crypto trading.</p>\n                    <p><p>The United States Consumer Financial Protection Bureau (CFPB) has proposed a rule to allow it to supervise large non-bank digital wallet and app providers. The rule is part of a larger move by the agency that has seen it extend its supervision to consumer reporting, consumer debt collection, student loan servicing, international money transfers and automobile financing.</p><p>The rule would extend the supervisory role it already has in depository institutions such as banks and credit unions. The rule would <a href=\"https://files.consumerfinance.gov/f/documents/cfpb_nprm-digital-payment-apps-lp-rule_2023-11.pdf\" target=\"_blank\" rel=\"noopener nofollow\">apply</a> to companies that handle more than 5 million transactions per year, such as PayPal, Apple, Amazon, Google and Meta. The agency <a href=\"https://www.consumerfinance.gov/about-us/newsroom/cfpb-proposes-new-federal-oversight-of-big-tech-companies-and-other-providers-of-digital-wallets-and-payment-apps/#:~:text=The%20proposed%20rule%20would%20subject,financial%20laws%20across%20the%20marketplace.\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a statement:</p><blockquote>“Big Tech and other companies operating in consumer finance markets blur the traditional lines that have separated banking and payments from commercial activities. The CFPB has found that this blurring can put consumers at risk.”</blockquote><p>CFPB director Rohit Chopra said the rule “would crack down on one avenue for regulatory arbitrage.” </p><p>According to the agency, digital apps have at least as many users as credit and debit cards, but currently lack protections such as deposit insurance and privacy and consumer rights guarantees. It already has enforcement authority over tech companies, but the rule would extend its supervisory role.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/us-consumer-watchdog-mulls-electronic-fund-transfer-laws-for-crypto\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-consumer-watchdog-mulls-electronic-fund-transfer-laws-for-crypto/amp\">US consumer watchdog mulls applying e-banking laws to crypto</a></em></strong></p><p>The proposed rule specifically targets crypto wallets by noting that the definitions of “funds” should be extended to crypto assets in line with other federal statutes. The rule is aimed at transfers of funds for retail purchases and the purchase or sale of securities or commodities. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Big Tech companies and popular apps now control more and more of the consumer payments system. Today, the <a href=\"https://twitter.com/CFPB?ref_src=twsrc%5Etfw\">@CFPB</a> proposed a rule to subject the biggest players to similar inspections currently required of banks.  <a href=\"https://t.co/iimpU6nq9Q\">https://t.co/iimpU6nq9Q</a></p>— Rohit Chopra (@chopracfpb) <a href=\"https://twitter.com/chopracfpb/status/1721947061027815449?ref_src=twsrc%5Etfw\">November 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The rule would mainly apply to the retail use of crypto, as the purchase or sale of crypto with fiat currency and the exchange of one type of crypto for another would be excluded. </p><p>The CFPB has been building up to this rule proposal for months. It <a href=\"https://cointelegraph.com/news/money-stored-on-mobile-payment-apps-may-not-be-fdic-insured-us-watchdog-warns\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/money-stored-on-mobile-payment-apps-may-not-be-fdic-insured-us-watchdog-warns/amp\">released a warning</a> in June that many mobile payment apps do not have deposit insurance. Chopra <a href=\"https://cointelegraph.com/news/cfpb-examines-big-tech-role-mobile-payment-systems-ahead-rulemaking\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cfpb-examines-big-tech-role-mobile-payment-systems-ahead-rulemaking/amp\">spoke critically about</a> the role of Big Tech in the U.S. payments system in September and <a href=\"https://www.consumerfinance.gov/about-us/newsroom/prepared-remarks-of-cfpb-director-rohit-chopra-at-the-brookings-institution-event-on-payments-in-a-digital-century/\" target=\"_blank\" rel=\"noopener nofollow\">repeated</a> those objections in a speech last month.</p><p><em><strong>Magazine:</strong></em><strong><em> </em></strong><em><strong><a href=\"https://cointelegraph.com/magazine/powers-on-biden-blockchain-benefits-adoption/\">Powers On… Biden accepts blockchain technology, recognizes its benefits and pushes for adoption</a></strong></em></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-07T20:07:13.000Z",
    "title": "Bitcoin supply held by long-term holders hits all-time high — Research",
    "url": "http://cointelegraph.com/news/bitcoin-supply-held-long-term-holders-hits-all-time-high",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/e9414c7c-c808-4196-8c0b-ecd802035d3e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin’s recent rally to a 2023 high is backed by on-chain and sentiment data.</p>\n                    <p><p>Data from <a href=\"https://insights.glassnode.com/the-week-onchain-week-45-2023/\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://insights-glassnode-com.cdn.ampproject.org/c/s/insights.glassnode.com/the-week-onchain-week-45-2023/amp/\">Glassnode</a> suggests that Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is in an accumulation pattern with its available supply reaching a new historical low. According to the report, Bitcoin’s illiquid supply and long-term holders cohort rise.<strong></strong></p><p>As Bitcoin’s supply tightens, available BTC is being purchased by smaller, long-term holding entities.</p><p>Bitcoin accumulation among a majority of investor cohorts and the bullish conviction of long-term holders equates to investors gobbling up “92% of the newly mined supply” according to <a href=\"https://cointelegraph.com/news/glassnode-exits-bitcoin-tax-space\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/glassnode-exits-bitcoin-tax-space/amp\">Glassnode</a> analysis. </p><blockquote>“If we isolate only entities on the smaller end of the scale, such as Shrimps (<figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/f189fd7e-cbdc-4c80-956d-0f82f41a0679.png\"><figcaption style=\"text-align: center;\"><em>Entity Bitcoin balance changes versus issuance. Source: Glassnode</em></figcaption></figure><p>On the backs of smaller entities gobbling up Bitcoin’s minted supply, long-term holders have reached new highs versus short-term holders, something not seen since July 2023. In addition to the solid long-term holder ratio, short-term holder supply diminished to all-time lows. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/1d806538-3a33-4ce4-bc9d-391a47b7fc2f.png\"><figcaption style=\"text-align: center;\"><em>Long-term versus short-term Bitcoin holder ratio. Source: Glassnode</em></figcaption></figure><p>The combined effect is creating a tightening of the BTC supply available for purchase, which is possibly helping to keep Bitcoin price above $34,000 and providing strong support above $30,000. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/magazine/6-questions-for-lugui-tillier-about-bitcoin-ordinals-and-the-future-of-crypto/\"><strong><em>6 Questions for Lugui Tillier about Bitcoin, Ordinals, and the future of crypto</em></strong></a></p><p>In comments to Cointelegraph, LMAX Group market strategist<strong><em> </em></strong>Joel Kruger explained how a Bitcoin price breakout to $40,000 could occur, </p><blockquote>“We don’t see anything specific going on with the price of Bitcoin to start the week other than the usual run of steady demand from medium and longer-term players looking to build exposure. If anything, Bitcoin has actually been more contained of late relative to currencies and risk assets, which have been in notable rally mode on expectations for a more accommodative shift in Fed policy in the aftermath of a run of softer U.S. economic data. Technically speaking, it would take a break above $36,000 to really turn heads and trigger the next wave of bullish momentum.”</blockquote><p>Illiquid coins with Bitcoin’s finite supply are typically a bullish market indicator. The illiquid Bitcoin supply continues on pace for monthly inflows for another year. The net increase of illiquid Bitcoin is 71,000 BTC per month. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/40a05f13-3fd9-4c44-9d05-c99f22da8eec.png\"><figcaption style=\"text-align: center;\"><em>Bitcoin illiquid supply change. Source: Glassnode</em></figcaption></figure><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/exchange-flow-gap-10k-btc-5-things-bitcoin-this-week\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/exchange-flow-gap-10k-btc-5-things-bitcoin-this-week/amp\"><strong><em>Exchange flow gap hits 10K BTC — 5 things to know in Bitcoin this week</em></strong></a></p><p>The growing confidence in Bitcoin amidst the tightening supply is not limited only to smaller entities. Nearly all entity cohorts are increasing their Bitcoin holdings year-to-date, an action that is well illustrated by the chart below.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/6525f233-1518-4f08-be61-d90e2f58614e.png\"><figcaption style=\"text-align: center;\"><em>Bitcoin accumulation across all cohorts. Source: Glassnode</em></figcaption></figure><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p>\n</blockquote>\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-07T19:48:33.000Z",
    "title": "YouTube is testing experimental AI that chats with you about what you’re watching",
    "url": "http://cointelegraph.com/news/google-you-tube-testing-experimental-ai-chats-about-what-watching",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/3e09fe44-42d9-49c1-b0d4-31aa4d9bc6d2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Google’s also testing a tool that will help creators manage their comment sections.</p>\n                    <p><p>Google’s <a href=\"https://support.google.com/youtube/thread/242690316/testing-new-experimental-generative-ai-features\" target=\"_blank\" rel=\"noopener nofollow\">testing</a> a pair of experimental artificial intelligence (AI) systems for creators and viewers on its YouTube video sharing platform. </p><p>The first experiment, according to a post on YouTube Help, involves an “AI that organizes large comment sections of long-form videos into easily digestible themes.” This tool will allow content creators to organize their comment sections by topic, highlight specific comments, and even delete comments related to a given topic. </p><p>This experiment is currently active and “running on a small number of videos in English that have large comment sections.” YouTube Premium subscribers can <a href=\"https://www.youtube.com/new\" target=\"_blank\" rel=\"noopener nofollow\">opt in</a> as part of YouTube’s experimental features program. </p><p>Meanwhile, the second appears slightly more ambitious. It comes in the form of a generative AI chatbot, ostensibly similar to Google’s Bard or OpenAI’s ChatGPT, whose aim is to interact with viewers while they watch videos.</p><p>According to YouTube:</p><blockquote>“To help you dive deeper into the content you’re watching, we’re experimenting with a conversational AI tool. This tool lets you get answers to questions about the video you’re watching, recommendations for related content, and more, all without interrupting playback.”</blockquote><p>The chatbot can also provide increased interactivity such as creating quizzes for users watching certain academic videos. </p><p>This experiment is currently active for a “small number of people on a subset of videos” and, according to YouTube, will be rolling out more widely in the coming weeks to Premium subscribers in the U.S. on the Android platform. </p><p>There’s no mention as to whether these features are planned for wide scale implementation and YouTube appears quick to offer the standard, boilerplate warning that the new features are experimental and “we may not always get it right.” </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/xbox-integrate-ai-dialogues-games-partnership\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/xbox-integrate-ai-dialogues-games-partnership/amp\"><strong><em>Xbox to enhance game dialogues with generative AI through new partnership</em></strong></a></p><p>While many YouTube denizens may welcome the tools, it’s worth noting that there’s little in the way of public testing when it comes to AI systems that interact with both the general public and video/audio content at scale. It’ll be interesting to see how YouTube navigates the sometimes unpredictable outputs produced by generative AI systems.</p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-07T21:00:17.000Z",
    "title": "Half of CFTC’s enforcement cases in the last year involved digital assets",
    "url": "https://cryptoslate.com/half-of-cftcs-enforcement-cases-in-the-last-year-involved-digital-assets/",
    "description": "<p>The U.S. Commodity Futures Trading Commission (CFTC) released its enforcement results for the 2023 fiscal year on Nov. 7., in which the agency reported 96 enforcement actions. Of these, 47 of those cases were related to digital assets. Some of those actions are accounted for by charges alleging that Sam Bankman-Fried, FTX, Alameda Research, and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/half-of-cftcs-enforcement-cases-in-the-last-year-involved-digital-assets/\">Half of CFTC&#8217;s enforcement cases in the last year involved digital assets</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-07T19:40:16.000Z",
    "title": "Acting OCC chief says tokenization holds immense promise, but crypto still risky",
    "url": "https://cryptoslate.com/acting-occ-chief-says-tokenization-holds-immense-promise-but-crypto-still-risky/",
    "description": "<p>The acting chief of the U.S. Office of the Comptroller of the Currency (OCC), Michael Hsu, said he is optimistic about the transformative potential of tokenization but continues to be wary of the crypto due to high levels of risk. Hsu made the statement during a talk at the DC Fintech Week in Washington on [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/acting-occ-chief-says-tokenization-holds-immense-promise-but-crypto-still-risky/\">Acting OCC chief says tokenization holds immense promise, but crypto still risky</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-07T19:49:55.000Z",
    "title": "Broker Complaint Alert (BCA) Marks 3 Years of Successful Crypto Scam Recovery, Bringing Hope to Victims Worldwide",
    "url": "https://www.cryptoglobe.com/latest/2023/11/broker-complaint-alert-bca-marks-3-years-of-successful-crypto-scam-recovery-bringing-hope-to-victims-worldwide/",
    "description": "Alpharetta, USA, November 7th, 2023, Chainwire “Just like there’s a possibility and time for loss, there’s always time for recovery” – Jenny Brown, head of the Recovery Technical Team at BCA. Broker Complaint Alert (BCA) Celebrates 3 Remarkable Years of Helping Victims of Crypto Scams Recover Their Lost Crypto. Broker Complaint Alert (BCA) celebrates three years of […]\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-07T20:00:47.000Z",
    "title": "Hacker exploits defi protocol TheStandard.io for $264k",
    "url": "https://crypto.news/hacker-exploits-defi-protocol-standard-io-for-264k/",
    "description": "TheStandard.io suffers a $264,000 theft via a PAXG liquidity pool exploit on Arbitrum."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-07T19:42:29.000Z",
    "title": "Magic Eden enhances Polygon integration with latest feature rollout",
    "url": "https://crypto.news/magic-eden-enhances-polygon-integration-with-latest-feature-rollout/",
    "description": "Magic Eden has introduced new features to enhance its support for the Polygon network, including an aggregation tool and royalty enforcement for its marketplace."
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-07T21:00:44.000Z",
    "title": "Shiba Inu Sees Surge In Whale Activity, Will This Affect SHIB?",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-whale-transactions-surges-following-a-recent-whale-transaction/",
    "description": "Recent data has revealed that Shiba Inu has experienced a significant surge in whale transactions following a recent whale transaction of a whopping 4.43 trillion SHIB tokens. This has since caused quite a stir in the cryptocurrency space. Shiba Inu Experiences Surge In Whale Activity According to data, Shiba Inu has been exhibiting astounding whale transactions over the past 24 hours amid the latest actions taken by the SHIB community to increase token support.  Currently, the total inflows of SHIB tokens held by major holders are at an impressive 7.84 trillion SHIB. This indicates a significant 48.48% increase in inflows from these major holders over the past 24 hours. What makes this surge so impressive is the fact that the numbers were 410.21 billion SHIB tokens. The recent numbers present a spectacular 1,911.2% increase in SHIB held by the major holders. The Shiba Inu&#8217;s surge in whale activity came just after a recent whale activity from an unknown wallet involving approximately 4.43 trillion SHIB tokens. Related Reading: Shiba Inu Update: 530% Spike In Shibarium Metric Could Trigger SHIB Recovery According to data from Whale Alert, the unknown wallet 0x8d14cc60…6e5c7e24dc, transferred the 4.43 trillion SHIB tokens, currently valued at approximately $35.82 million, to another unknown wallet, 0x3ba943c7…225e6dabee. The alleged transaction is said to have occurred in a freshly created wallet, with just two transactions being carried out in the wallet in 12 hours. In addition, the Amsterdam-based cryptocurrency exchange Bitvavo, a centralized crypto exchange, also sent trillions of SHIB tokens to the same alleged wallet. Whales&#8217; large SHIB hoarding is increasing at the same time as the token&#8217;s remarkable price movement. The price of SHIB spiked sharply in tandem with this wave of large-scale Shiba Inu token transactions. SHIB price has since experienced a significant 20% surge in recent weeks. Currently, the price of SHIB is sitting at $0.0000082, slowly gaining momentum at a critical point of $0.0000084, marking the highest price level the token has seen since August. If the token can surpass this critical point, it might pick up speed and eventually reach $0.00001 and beyond. This is because the last time this happened was back in July; according to historical data, the price of SHIB experienced a significant 37% surge after this happened. So far, crypto experts are particularly curious about the recent wave of large transactions involving SHIB tokens. These wallet-to-wallet transfers ignite optimistic sentiment in the colossal crypto market. Shibarium Sparks Price Growth The achievements of Shiba Inu layer 2 blockchain Shibarium have always had a positive impact on the price of SHIB. The blockchain milestones have caused quite a hype in the Shiba Inu ecosystem, which could bolster SHIB&#8217;s growth past its current price of $0.0000082. Related Reading: Avengers Assemble: Shiba Inu Lead Dev Issues Call To Influencers To Push SHIB Growth The adoption rate of Shibarium will only increase as more SHIB holders become familiar with its advantages. These include reduced costs and quicker transaction times.  Concurrently, several events have suggested that SHIB&#8217;s price will continue to rise, such as the recently launched Shib Name Service (SNS) and Shibdentity. Featured image from The Cryptonomist, chart by Tradingview.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-07T20:00:20.000Z",
    "title": "XRP News: Ripple CEO Teases Major Announcements At Swell Event",
    "url": "https://www.newsbtc.com/ripple-2/xrp-ripple-ceo-swell-event/",
    "description": "Ripple CEO Brad Garlinghouse has expressed his anticipation for the upcoming DC Fintech week, dropping major hints and teasers about significant announcements and heated discussions slated for the event.  Ripple Swell Event Sparks Community Interest Chief Executive Officer of Ripple, Brad Garlinghouse has teased the X (formerly Twitter) community with hints of discussions and ideas about the upcoming Ripple Swell 2023 event scheduled for November 8th and 9th in Dubai.  Related Reading: Why Ark Invest’s Cathie Wood Picks Bitcoin Over Cash And Gold Garlinghouse stated that he was always excited about the DC Fintech Week which occurred every year. He emphasized the importance of the event in bringing together different people with similar interests in one room interacting and sharing their different ideas and perspectives on substantial topics and issues in the finance and blockchain industry.  In his post, Garlinghouse dropped a cryptic message, likening the Ripple Swell event to a “proverbial cage match.” “Every year I look forward to DCFintechWeek — everyone from the public to private participants in one room, discussing (and sometimes debating) the substantive issues with no holds barred. wondering…a proverbial cage match?!” Garlinghouse stated.  Some of the headlining speakers excluding Garlinghouse appearing at the DC Fintech Week include United States Under Secretary of the Treasury for Domestic Finance, Nellie Liang, CEO of Grayscale Investments, Michael Sonnenshein, Chairman of the United States Securities and Exchange Commission (SEC), Gary Gensler, Vice Chair of Supervision at the Federal Reserve, Michael Barr, and others. As the Ripple Swell event approaches, many crypto enthusiasts are looking forward to witnessing what could be a defining moment in the Ripple ecosystem as the event may provide more insight into Ripple’s future developments and present challenges. XRP price shows strength ahead of Swell event &#124; Source: XRPUSD on Tradingview.com Garlinghouse To Share Stage With Gensler At Swell Event Following the conclusion of one of the most heated high-stakes legal battles in the crypto space, Garlinghouse and SEC Chair Gary Gensler are set to share a stage in the DC Fintech Week, discussing and possibly debating on various topics in the fintech and blockchain space.  The legal battle between Gensler and Ripple’s top Executives Chris Larsen and Garlinghouse has been one of the most closely watched conflicts in the crypto space. The SEC sued both executives, accusing them of violating US securities laws by supporting the sales of XRP tokens in unregistered security offerings to investors.  Related Reading: Shiba Inu-Based BONE Eyes $1 As This On-Chain Metric Explodes The regulator eventually dropped all charges and claims against Larsen and Garlinghouse earlier in October, earning Ripple a partial win against the agency.  Many XRP community members have rallied behind Garlinghouse’s label of the Ripple Swell event as a “proverbial cage match.” This sentiment is particularly strong when considering participants like Gensler and Garlinghouse who have a history of legal disagreements and Grayscale and US SEC who are currently in a legal dispute concerning the approval of Spot Bitcoin ETFs.  Featured image from Bitcoin Sistermi, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-07T19:49:20.000Z",
    "title": "Ripple’s Rising Profile: MENA Media Buzz Preceding Ripple (XRP) Swell and IPO Speculations",
    "url": "https://www.crypto-news-flash.com/ripples-rising-profile-mena-media-buzz-preceding-ripple-xrp-swell-and-ipo-speculations/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-rising-profile-mena-media-buzz-preceding-ripple-xrp-swell-and-ipo-speculations",
    "description": "<img width=\"1038\" height=\"584\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE.png 1038w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-24x14.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-36x20.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-48x27.png 48w\" sizes=\"(max-width: 1038px) 100vw, 1038px\" />Amid rising popularity for Ripple products &#8211; including XRP, and Ripplenet &#8211; in the Middle East and the North African region, the blockchain payment company has set its annual two-day Swell conference in Dubai beginning November 08. The Swell conference has already attracted mega media attention from the Middle East amid notable partnerships between Ripple [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-07T19:40:41.000Z",
    "title": "South Korea’s Largest Mobile Carrier, SK Telecom, Partners with Aptos for Crypto Wallet Development",
    "url": "https://www.crypto-news-flash.com/south-koreas-largest-mobile-carrier-sk-telecom-partners-with-aptos-for-crypto-wallet-development/?utm_source=rss&utm_medium=rss&utm_campaign=south-koreas-largest-mobile-carrier-sk-telecom-partners-with-aptos-for-crypto-wallet-development",
    "description": "<img width=\"512\" height=\"256\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-5.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SK Telecom\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-5.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-5-300x150.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />SK Telecom has partnered with Aptos and Atomrigs Lab to develop a T wallet, marking its first integration with a non-Ethereum blockchain. The T wallet aims to provide a seamless web3 experience and connect users to a growing ecosystem of decentralized applications. SK Telecom has entered into a significant partnership with blockchain organizations Aptos and [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-07T20:37:00.000Z",
    "title": "XAI Meme Coin Takes a Hit as Elon Musk Denies Token Connection",
    "url": "https://coinedition.com/xai-meme-coin-takes-a-hit-as-elon-musk-denies-token-connection/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"PEPE, DOGE, and SHIB Crash What Meme Coins Are Poised to Explode Next\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/PEPE-DOGE-and-SHIB-Crash-What-Meme-Coins-Are-Poised-to-Explode-Next-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Meme coin XAI has seen a significant drop in its value and trade volume following recent statements from billionaire tech founder Elon Musk. As previously reported, Musk, in a recent tweet on X &#8211; formerly Twitter &#8211; stated that none of his companies will ever create a crypto token. Notably, Musk’s tweet came in reaction [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/xai-meme-coin-takes-a-hit-as-elon-musk-denies-token-connection/\">XAI Meme Coin Takes a Hit as Elon Musk Denies Token Connection</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-07T20:07:00.000Z",
    "title": "Evmos Ends Cosmos Support, Focuses on Ethereum- Based Transactions",
    "url": "https://coinedition.com/evmos-ends-cosmos-support-focuses-on-ethereum-based-transactions/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/The_Cosmos_ecosystem_has_shown_notable_strength_over_the_past_few.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Evmos Ends Cosmos Support, Focuses on Ethereum- Based Transactions\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/The_Cosmos_ecosystem_has_shown_notable_strength_over_the_past_few.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/The_Cosmos_ecosystem_has_shown_notable_strength_over_the_past_few-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/The_Cosmos_ecosystem_has_shown_notable_strength_over_the_past_few-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/The_Cosmos_ecosystem_has_shown_notable_strength_over_the_past_few-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/The_Cosmos_ecosystem_has_shown_notable_strength_over_the_past_few-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Evmos, the layer-one blockchain solution that facilitates Ethereum smart contracts integration within the Cosmos blockchain, is planning to stop supporting Cosmos transactions, according to reports. The reason stated by the Evmos core team is that it wants to focus exclusively on Ethereum-based transactions. The Evmos team claimed that by transitioning to a single transaction format, [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/evmos-ends-cosmos-support-focuses-on-ethereum-based-transactions/\">Evmos Ends Cosmos Support, Focuses on Ethereum- Based Transactions</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-07T21:00:10.000Z",
    "title": "Large Chainlink Wallets Reach New All-Time High as LINK Launches Parabolic Rally: Santiment",
    "url": "https://dailyhodl.com/2023/11/07/large-chainlink-wallets-reach-new-all-time-high-as-link-launches-parabolic-rally-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/large-chainlink-reach-all.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/large-chainlink-reach-all.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/large-chainlink-reach-all.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/large-chainlink-reach-all.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/large-chainlink-reach-all.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/large-chainlink-reach-all.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/large-chainlink-reach-all.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The latest data from a leading crypto analytics firm say the number of large Chainlink (LINK) wallets has reached a new all-time high as the project&#8217;s native asset surges in price. Santiment notes that the number of wallets holding at least 1,000 LINK reached a new record number of 27,152 on Sunday. The firm also [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/07/large-chainlink-wallets-reach-new-all-time-high-as-link-launches-parabolic-rally-santiment/\">Large Chainlink Wallets Reach New All-Time High as LINK Launches Parabolic Rally: Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-07T20:55:01.000Z",
    "title": "One of the Most Reliable On-Chain Bitcoin Indicators Just Flashed Bullish, According to Glassnode Founders",
    "url": "https://dailyhodl.com/2023/11/07/one-of-the-most-reliable-on-chain-bitcoin-indicators-just-flashed-bullish-according-to-glassnode-founders/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/trader-bitcoin-bottom-is.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/trader-bitcoin-bottom-is.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/trader-bitcoin-bottom-is.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/trader-bitcoin-bottom-is.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/trader-bitcoin-bottom-is.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/trader-bitcoin-bottom-is.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/trader-bitcoin-bottom-is.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The co-founders of a top crypto data analytics firm say that a reliable Bitcoin (BTC) indicator is signaling bullish moves for BTC. Glassnode co-founders Jan Happel and Yann Allemann, who share the Negentropic handle on the social media platform X, tell their followers that BTC&#8217;s market demand is outpacing its supply. Additionally, the Bitcoin network recently saw [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/07/one-of-the-most-reliable-on-chain-bitcoin-indicators-just-flashed-bullish-according-to-glassnode-founders/\">One of the Most Reliable On-Chain Bitcoin Indicators Just Flashed Bullish, According to Glassnode Founders</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-07T20:08:35.000Z",
    "title": "Broker Complaint Alert (BCA) Marks Three Years of Successful Crypto Scam Recovery, Bringing Hope to Victims Worldwide",
    "url": "https://dailyhodl.com/2023/11/07/broker-complaint-alert-bca-marks-three-years-of-successful-crypto-scam-recovery-bringing-hope-to-victims-worldwide/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-BCA-Industry-Announcement-Featured-Image-Template.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-BCA-Industry-Announcement-Featured-Image-Template.jpg 1500w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-BCA-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-BCA-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-BCA-Industry-Announcement-Featured-Image-Template.jpg?resize=768,768 768w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-BCA-Industry-Announcement-Featured-Image-Template.jpg?resize=1024,1024 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-BCA-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-BCA-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-BCA-Industry-Announcement-Featured-Image-Template.jpg?resize=750,750 750w, https://dailyhodl.com/wp-content/uploads/2023/11/UPSCALED-BCA-Industry-Announcement-Featured-Image-Template.jpg?resize=1140,1140 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>November 7, 2023 – Alpharetta, United States Broker Complaint Alert (BCA) celebrates three remarkable years of helping victims of crypto scams recover their lost crypto. Jenny Brown, head of the recovery technical team at BCA, said, &#8220;Just like there’s a possibility and time for loss, there’s always time for recovery.&#8221; BCA celebrates three years of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/07/broker-complaint-alert-bca-marks-three-years-of-successful-crypto-scam-recovery-bringing-hope-to-victims-worldwide/\">Broker Complaint Alert (BCA) Marks Three Years of Successful Crypto Scam Recovery, Bringing Hope to Victims Worldwide</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-07T19:45:58.000Z",
    "title": "Bankrupt Crypto Exchange FTX Files Motion To Sell $744,000,000 Worth of Assets",
    "url": "https://dailyhodl.com/2023/11/07/bankrupt-crypto-exchange-ftx-files-motion-to-sell-744000000-worth-of-assets/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/ftx-file-motion-woth.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/ftx-file-motion-woth.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/ftx-file-motion-woth.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/ftx-file-motion-woth.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/ftx-file-motion-woth.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/ftx-file-motion-woth.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/ftx-file-motion-woth.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Bankrupt crypto exchange FTX is asking a judge for permission to sell off $744 million worth of assets. A new bankruptcy court filing shows that FTX and its debtors want permission to sell the company&#8217;s Grayscale and Bitwise assets through an investment adviser. According to the filing, &#8220;Similar to the debtors’ prior request to monetize [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/07/bankrupt-crypto-exchange-ftx-files-motion-to-sell-744000000-worth-of-assets/\">Bankrupt Crypto Exchange FTX Files Motion To Sell $744,000,000 Worth of Assets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-07T19:41:18.000Z",
    "title": "Banker Loses Access to $450,000,000 Worth of Ethereum (ETH) After Misplacing Wallet Keys: Report",
    "url": "https://dailyhodl.com/2023/11/07/banker-loses-access-to-450000000-worth-of-ethereum-eth-after-misplacing-wallet-keys-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/11/banker-launches-crypto-fund.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/11/banker-launches-crypto-fund.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/11/banker-launches-crypto-fund.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/11/banker-launches-crypto-fund.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/11/banker-launches-crypto-fund.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/11/banker-launches-crypto-fund.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/11/banker-launches-crypto-fund.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An Estonian banker has confirmed himself to be the owner of an Ethereum address with over 250,000 ETH worth nearly half a billion dollars – but says he lost the keys. In a new interview with Vikerraadio in Estonia, LHV Bank founder Rain Lõhmus was asked about something he said years ago about getting into [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/07/banker-loses-access-to-450000000-worth-of-ethereum-eth-after-misplacing-wallet-keys-report/\">Banker Loses Access to $450,000,000 Worth of Ethereum (ETH) After Misplacing Wallet Keys: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]