[
  {
    "source": "CryptoSlate",
    "date": "2023-12-18T10:25:47.000Z",
    "title": "Crypto funds break 11-week hot streak of inflows with $16M outflows, amid record $3.6B traded",
    "url": "https://cryptoslate.com/crypto-funds-break-11-week-hot-streak-of-inflows-with-modest-16m-outflows/",
    "description": "<p>Following 11 weeks of consistent inflows into digital asset investment products, outflows totaling $16 million showcased a slight reversal in the market. The latest CoinShares report highlights this subtle shift in the investment landscape of digital assets. The overall trading activity for the week stood at $3.6 billion, significantly higher than the year-to-date average of [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/crypto-funds-break-11-week-hot-streak-of-inflows-with-modest-16m-outflows/\">Crypto funds break 11-week hot streak of inflows with $16M outflows, amid record $3.6B traded</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T10:29:24.000Z",
    "title": "Pepe (PEPE), Bonk (BONK), and Retik Finance (RETIK) are making some serious waves in the crypto world right now",
    "url": "https://www.cryptopolitan.com/pepe-pepe-bonk-bonk-and-retik-finance-retik-are-making-some-serious-waves-in-the-crypto-world-right-now/",
    "description": "Three projects—Pepe (PEPE), Bonk (BONK), and Retik Finance (RETIK)—are making a splash. Each has something special to offer, catching the eye of crypto fans and investors. Let&#8217;s dive into what makes Pepe and Bonk unique and what to look forward to in 2024.&#160; After that, we&#8217;ll check out the cool features that Retik Finance brings [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T10:19:49.000Z",
    "title": "Emerging Trends in AI: Transforming Consumer Behavior and Market Dynamics",
    "url": "https://www.cryptopolitan.com/trends-in-ai-transforming-consumer-behavior/",
    "description": "Artificial Intelligence (AI) is revolutionising the way businesses understand and cater to consumer needs. Recent advancements in AI technology have enabled companies to predict consumer behavior and market trends with unprecedented precision. This shift is particularly evident in e-commerce and the garment industry, where AI-driven analytics create more personalised shopping experiences. The personalisation paradigm AI&#8217;s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T10:19:18.000Z",
    "title": "OKX emerges as leading NFT marketplace with $50.33 million daily trading volume",
    "url": "https://www.cryptopolitan.com/okx-emerges-as-leading-nft-marketplace/",
    "description": "OKX&#8217;s NFT trading platform has surged ahead, surpassing industry giants Blur and OpenSea in daily trading volume. As of 2 p.m. Hong Kong time, the OKX NFT Marketplace recorded an impressive 24-hour trading volume of $50.33 million, establishing itself as the foremost NFT marketplace based on daily trading activity. Bitcoin Ordinals NFTs drive OKX to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-18T10:12:21.000Z",
    "title": "The Rise of AI in the 2024 Workplace",
    "url": "https://www.cryptopolitan.com/the-rise-of-ai-in-the-2024-workplace/",
    "description": "In a significant development, recent surveys have revealed that over 50% of companies are now actively utilizing generative AI, such as ChatGPT, in their daily operations. This adoption marks a profound shift in the way employees work, promising increased productivity and insights. While discussions around artificial intelligence have often revolved around its potential drawbacks and [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-18T10:38:17.000Z",
    "title": "Crypto Mass Adoption On The Way: Bitcoin (BTC), Arbitrum (ARB) and Meme Moguls (MGLS) surge in popularity",
    "url": "https://nulltx.com/crypto-mass-adoption-on-the-way-bitcoin-btc-arbitrum-arb-and-meme-moguls-mgls-surge-in-popularity/",
    "description": "The winds of change are blowing through the cryptocurrency market, heralding a new era of mass adoption. Three tokens, Bitcoin (BTC), Arbitrum (ARB), and Meme Moguls (MGLS), are at the forefront of this transformative wave. Each of these digital assets embodies unique aspects of the crypto evolution, capturing the attention [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-12-18T10:29:40.000Z",
    "title": "Imagine Getting In Early On The Next Solana (SOL)! Analysts Tout Arbitrum (ARB), Aptos (APT) And Pullix (PLX) As Top Hidden Gems Now",
    "url": "https://nulltx.com/imagine-getting-in-early-on-the-next-solana-sol-analysts-tout-arbitrum-arb-aptos-apt-and-pullix-plx-as-top-hidden-gems-now/",
    "description": "Solana (SOL) has surprised the crypto market after its December 2022 woes. Currently, it has shown a year-to-date gain of 640%. Luckily, there is good news for those looking for the next Solana coin. Analysts have picked Arbitrium, Aptos, and Pullix as the best crypto to buy for Solana-like gains. [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-18T10:36:50.000Z",
    "title": "Improbable sells gaming venture for $97m as analysts skeptical on commercialization",
    "url": "https://crypto.news/improbable-sells-gaming-venture-for-97m-as-analysts-skeptical-on-commercialization/",
    "description": "SoftBank-backed metaverse firm Improbable has sold one of its major gaming ventures to an Irish video game developer. According to a CNBC report, Improbable sold its multiplayer games developer The Multiplayer Group (MPG) for $97.1 million to Keywords Studios, an&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-18T10:15:25.000Z",
    "title": "Polkadot, Cosmos, and Everlodge: key crypto players set for growth in 2024",
    "url": "https://crypto.news/polkadot-cosmos-and-everlodge-key-crypto-players-set-for-growth-in-2024/",
    "description": "Cosmos’s IBC protocol expands, Polkadot is set to undergo network upgrades, and Everlodge expects to disrupt the $280 trillion market. Polkadot (DOT) recently saw an upswing in value, leading many traders to follow this upward momentum and diversify their holdings.&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-18T10:30:13.000Z",
    "title": "Changelly Releases Updated Predictions For XRP Price, When Will It Cross $10?",
    "url": "https://www.newsbtc.com/analysis/xrp/changelly-xrp-price-10/",
    "description": "Cryptocurrency exchange Changelly has released an updated prediction for the XRP price that spans almost a decade from now. The prices in the new predictions deviate heavily from their previous predictions, and this time around, the predictions include when the XRP price will cross $10. XRP Price Will Cross $10 In 2030 While the XRP community members remain very optimistic that the XRP price will cross $10 in the next few years, with a number of crypto analysts presenting chart data to support this, Changelly does not believe that this will happen anytime soon. In fact, for the next couple of years, the crypto exchange expects a lot of growth but double-digits is seemingly off the table. Related Reading: VeChain (VET) Set To Explode: Analyst Predicts 7,500% Rally To $2.3 By 2024, the crypto exchange predicts that the XRP price will reach a max price of $1.11, but still expects it to stay relatively high with a minimum price of around $0.94. In the next few years, the growth is expected to continue, rising to as high as $5 in 2028. Source: Changelly However, for the XRP price to reach $10, investors would still have to wait another extra two years according to the report. In 2029, it predicts a maximum price of $8.07. And then finally, in 2030, Changelly expects the price to beat the coveted $10 mark. Moving further from 2030, expectations are that the price will not fall below $10 again. Rather, it is expected to double in the next two years, hitting as high as $24.95 by the year 2032, which is nine years from now. XRP trending at $0.596 &#124; Source: XRPUSD on Tradingview.com Expecting A Very Underwhelming 2024 The price predictions by Changelly for 2024 broken down into the individual months paints a picture of lackluster performance from the coin. The highest point expected for the XRP price puts it at only a 35% increase from the current price of $0.59 at the time of writing. The expectation given is that the highest price point would come at $0.8. Related Reading: Polygon (MATIC) Price Faces Crucial Turning Point That Could Trigger 50% Rally, Analyst Says Changelly’s prediction seems to be a deviation from the norm where a number of predictions expect the XRP price to hit the high prices in the next two years. One crypto analyst known as EGRAG Crypto expects the price of the altcoins to reach $5.5. Interestingly, the analyst expects the price to hit this price in the next two weeks. Another analyst known as Austin Hilton has also predicted that the XRP price will reach $1.5 once the SEC approves the Spot Bitcoin ETFs. According to Bloomberg analysts, these funds could be approved in January 2024, which means the XRP price could reach $1.5 in a month. Featured image from Crypto News Flash, chart from Tradingview.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-12-18T10:33:06.000Z",
    "title": "Are IDOs Worth your Time? Pros and Cons",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/are-idos-worth-your-time-pros-and-cons/",
    "description": "<p>Most of our members are usually busy and it is very difficult for them to find time to keep track and participate in IDOs, add to that vesting schedules. So the question comes, “I would have to move other things from my agenda &#38; prioritize IDOs. Is it worth it? To earn just 100 USD [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/are-idos-worth-your-time-pros-and-cons/\">Are IDOs Worth your Time? Pros and Cons</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-18T10:37:03.000Z",
    "title": "Released FTX Liquidation Data “Does Not Make Sense”: Influencer",
    "url": "https://coinedition.com/released-ftx-liquidation-data-does-not-make-sense-influencer/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/FTX-1-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/FTX-1-1.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/FTX-1-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/FTX-1-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/FTX-1-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/FTX-1-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/FTX-1-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The liquidation data for FTX, the defunct cryptocurrency exchange, has been published, and Martin Folb, the renowned crypto influencer known as MartyParty thinks the published information is inaccurate. Folb shared an unlabelled screenshot of the liquidation data in tabular form, showing various crypto assets liquidated by the company and their valuation in three intervals between [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/released-ftx-liquidation-data-does-not-make-sense-influencer/\">Released FTX Liquidation Data “Does Not Make Sense”: Influencer</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-18T10:16:49.000Z",
    "title": "Technical Indicators Support Analyst’s $0.55 XRP Target",
    "url": "https://coinedition.com/technical-indicators-support-analysts-0-55-xrp-target/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/The_positive_outlook_closing_above_0_55c_will_push_XRP_to_1_3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"The_positive_outlook,_closing_above_0_55c_will_push_#XRP_to_1_3\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/The_positive_outlook_closing_above_0_55c_will_push_XRP_to_1_3.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/The_positive_outlook_closing_above_0_55c_will_push_XRP_to_1_3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/The_positive_outlook_closing_above_0_55c_will_push_XRP_to_1_3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/The_positive_outlook_closing_above_0_55c_will_push_XRP_to_1_3-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/The_positive_outlook_closing_above_0_55c_will_push_XRP_to_1_3-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/The_positive_outlook_closing_above_0_55c_will_push_XRP_to_1_3-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The well known cryptocurrency analyst and trader Ali Martinez shared in an X post yesterday that the price of XRP could be at risk of dropping in the next few days. This prediction came after the remittance token got rejected from the middle line in an ascending parallel channel that it has recently been trading [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/technical-indicators-support-analysts-0-55-xrp-target/\">Technical Indicators Support Analyst’s $0.55 XRP Target</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-18T10:15:21.000Z",
    "title": "Ethereum Rival That’s Up About 7x Year-to-Date Primed To Explode Over 400% During Bull Run: Crypto Analyst",
    "url": "https://dailyhodl.com/2023/12/18/ethereum-rival-thats-up-about-7x-year-to-date-primed-to-explode-over-400-during-bull-run-crypto-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/the-Fire-of-Crypto.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/the-Fire-of-Crypto.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/the-Fire-of-Crypto.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/the-Fire-of-Crypto.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/the-Fire-of-Crypto.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/the-Fire-of-Crypto.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/the-Fire-of-Crypto.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto analyst says that one Ethereum (ETH) rival that has exploded about 600% year to date is gearing up to spark another move to the upside. In a new video update, the host of InvestAnswers tells his 458,000 YouTube subscribers that smart contract platform Solana (SOL) has a lot more gas left [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/18/ethereum-rival-thats-up-about-7x-year-to-date-primed-to-explode-over-400-during-bull-run-crypto-analyst/\">Ethereum Rival That’s Up About 7x Year-to-Date Primed To Explode Over 400% During Bull Run: Crypto Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]