[
  {
    "source": "CoinDesk",
    "date": "2023-11-21T20:37:42.000Z",
    "title": "Binance to Make 'Complete Exit' From U.S., Pay Billions to FinCEN, OFAC on Top of DOJ Settlement",
    "url": "https://www.coindesk.com/policy/2023/11/21/binance-to-make-complete-exit-from-us-pay-billions-to-fincen-ofac-on-top-of-doj-settlement/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto exchange Binance will leave the U.S., pay billions in fines and appoint a monitor for five years to settle charges with the Financial Crimes Enforcement Network (FinCEN) and Office of Foreign Asset Control (OFAC), the U.S. Treasury Department's money laundering and sanctions watchdogs, according to press releases shared Tuesday."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-21T20:55:25.000Z",
    "title": "Binance Must 'Completely Exit' From US as It Settles Years-Long Criminal Investigation",
    "url": "https://decrypt.co/206904/binance-must-completely-exit-from-us-as-it-settles-years-long-criminal-investigation",
    "description": "The $4.3 billion settlement is one of the largest corporate penalties in U.S. history, says DOJ."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-21T20:44:09.000Z",
    "title": "Binance's CZ: 'I Made Mistakes', Confirms Richard Teng Will Takeover as CEO",
    "url": "https://decrypt.co/206907/binances-cz-i-made-mistakes-confirms-richard-teng-will-takeover-as-ceo",
    "description": "Binance founder Changpeng Zhao has resigned as CEO, and confirmed that Richard Teng will take over the role."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-21T19:45:14.000Z",
    "title": "Someone Got $8.4 Million in Blur NFT Marketplace's Latest Airdrop",
    "url": "https://decrypt.co/206893/someone-got-8-4-million-blur-nft-marketplace-latest-airdrop",
    "description": "One JPEG flipper saw millions of dollars in rewards from Blur's Season 2 airdrop. Now the marketplace is teasing its own Ethereum layer-2 network, Blast."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-21T20:59:11.000Z",
    "title": "US officials announce $4.3B settlement with Binance, plea deal with CZ",
    "url": "http://cointelegraph.com/news/us-officials-announce-binance-settlement",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/6527fe7f-becd-4a51-9163-87328c83e8f5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Officials with the U.S. Justice Department, Treasury, and CFTC alleged Binance \"lacked basic safeguards\" to protect against sanctions and Changpeng Zhao committed criminal acts. </p>\n                    <p><p>Officials with the United States Department of Justice announced that Binance CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/changpeng-zhao\">Changpeng \"CZ\" Zhao</a> will plead guilty to one felony charge as part of a settlement over criminal and civil cases with the exchange.</p><p>In a Nov. 21 press conference, Attorney General Merrick Garland <a href=\"https://www.justice.gov/live\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> CZ entered his plea in person in U.S. federal court despite residing outside the country. He added there would be a $4.3-billion settlement with Binance and CZ covering \"civil regulatory enforcement actions\" by government departments including the U.S. Treasury and Commodity Futures Trading Commission (CFTC).</p><p>According to Garland, Binance's policies allowed criminals involved in illicit activities to move \"stolen funds\" through the exchange. He alleged the exchange \"pretended to comply\" with U.S. federal laws by offering paths for certain users to access Binance despite their ties to illicit funds. The Attorney General said the exchange would be subject to monitoring and reporting requirements, and required to file suspicious activity reports for past transactions.</p><p>\"Binance priortized its profits over the safety of the American people,\" said Garland. \"Using new technology to break the law does not make you a disruptor — it makes you a criminal.\"</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/76a9b34e-e9c1-467c-bcbe-4c05a40a4cbc.png\"  /><figcaption style=\"text-align: center;\"><em>U.S. Treasury Secretary Janet Yellen addressing reporters. Source: <a href=\"https://www.justice.gov/live\" target=\"_blank\" rel=\"noopener nofollow\">Justice.gov</a></em></figcaption></figure><p>Follwing Garland, Treasury Secretary Janet Yellen said Binance would pay more than $3 billion to the Financial Crimes Enforcement Network (FinCEN) and roughly $1 billion to Treasury's Office of Foreign Assets Control (OFAC) as part of the settlement. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/binance-indictment-unsealed-cz-guilty-plea\">Court unseals indictments against Binance and CZ, detailing expected guilty pleas</a></em></strong></p><p>According to the indictment against CZ filed under seal on Nov. 14, the Binance CEO <a href=\"https://cointelegraph.com/news/binance-indictment-unsealed-cz-guilty-plea\">faced one charge</a> for failure to maintain an effective anti-money laundering program at the crypto exchange, violating the Bank Secrecy Act. Court records concerning charges against Binance CZ had been kept under seal from Nov. 14 to Nov. 21 following motions from prosecutors in agreement with both parties.</p><p>The settlement between U.S. officials and Binance largely concluded many of the civil and criminal investigations into the exchange going back months. The crypto exchange still <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">has a pending civil case</a> with the U.S. Securities and Exchange Commission (SEC), which charged Binance, Binance.US, and CZ for securities law violations in June.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/us-enforcement-agencies-turning-up-heat-crypto-related-crime/\">US enforcement agencies are turning up the heat on crypto-related crime</a></em></strong></p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-21T20:45:01.000Z",
    "title": "Binance names Richard Teng CEO amid Changpeng Zhao’s forced departure",
    "url": "http://cointelegraph.com/news/binance-richard-teng-ceo-amid-changpeng-zhao-s-forced-departure",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/1947b10c-fbfe-49bc-9588-5d45300041ce.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The house that CZ built will now be helmed by its Head of Regional Markets as the U.S. Department of Justice has barred the former CEO from his position.</p>\n                    <p><p>Binance has named its head of regional markets outside of the U.S., Richard Teng, as its new CEO. The change comes as founder and former CEO Changpeng “CZ” Zhao has resigned and plead guilty to charges levied against him by the U.S. Department of Justice. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today, I stepped down as CEO of Binance. Admittedly, it was not easy to let go emotionally. But I know it is the right thing to do. I made mistakes, and I must take responsibility. This is best for our community, for Binance, and for myself.<br><br>Binance is no longer a baby. It is…</p>&mdash; CZ  Binance (@cz_binance) <a href=\"https://twitter.com/cz_binance/status/1727063503125766367?ref_src=twsrc%5Etfw\">November 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As Cointelegraph reported earlier, <a href=\"https://cointelegraph.com/news/breaking-binance-changpeng-zhao-pleads-guilty-violating-anti-money-laundering-requirements-wsj\">CZ and Binance have agreed to a plea deal</a> with the DOJ over alleged anti-money laundering violations. The resulting settlement will cost the company $4.3 billion dollars and, reportedly, bars CZ from serving as an executive at any cryptocurrency companies. He'll also be on the hook for a $50 million dollar fine assessed directly to him. He won’t have to give up his shares, however, and will apparently serve no jail time.</p><p>Teng’s promotion was confirmed by former CEO CZ in a post on X coinciding with the start of a DOJ press event announcing the actions against Binance. </p><p>According to CZ:</p><blockquote>“Richard is a highly qualified leader and, with over three decades of financial services and regulatory experience, he will navigate the company through its next period of growth. He will ensure Binance delivers on our next phase of security, transparency, compliance, and growth.”</blockquote><p>Teng also posted on X approximately 15 minutes after the DOJ presser went live.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">It is an honour and with the deepest humility that I step into the role of Binance’s new CEO.<br><br>We operate the world&#39;s largest cryptocurrency exchange by volume. The trust placed on us by our 150m users and thousands of employees is a responsibility that I take seriously and hold…</p>&mdash; Richard Teng (@_RichardTeng) <a href=\"https://twitter.com/_RichardTeng/status/1727066202047164562?ref_src=twsrc%5Etfw\">November 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In his first public communique as CEO, Teng sought to reassure Binance users and establish a clear path from the day’s events. He laid out three areas of focus for himself and the company, starting with “reassuring users that they </p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-21T19:42:08.000Z",
    "title": "Court unseals indictments against Binance and CZ, detailing expected guilty pleas",
    "url": "http://cointelegraph.com/news/binance-indictment-unsealed-cz-guilty-plea",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/9eb24dc2-5afc-4cf4-a889-01e6a7dc1406.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The U.S. Justice Department, Treasury and CFTC reportedly plan to announce settlements for many of the criminal and civil cases against Binance and CZ on Nov. 21.</p>\n                    <p><p>A federal court has released the indictments against Binance and CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/changpeng-zhao\">Changpeng “CZ” Zhao</a> filed under seal on Nov. 14, in which the United States government said it expected the cryptocurrency exchange and CZ to enter guilty pleas. </p><p>In Nov. 14 filings in the U.S. District Court for the Western District of Washington at Seattle, the U.S. government said it requested to file the indictments against Binance and CZ under seal, as any potential plea deals with the exchange and CEO and any regulatory settlements were “likely to have a major effect on the company, its customers, and global cryptocurrency markets.” Authorities charged CZ with one felony count for failure to maintain an effective Anti-Money Laundering program at Binance, violating the Bank Secrecy Act. </p><p>“On the day of the plea hearings, the Government anticipates that the criminal resolutions with Defendant Zhao and Defendant Binance will be announced simultaneously with significant civil resolutions by the U.S. Department of the Treasury Office of Foreign Assets Control [OFAC], the U.S. Department of the Treasury Financial Crimes Enforcement Network [FinCEN], and the Commodity Futures Trading Commission [CFTC],” said the Nov. 14 filing, adding: </p><blockquote>“While Binance is not a publicly traded company, Binance is the largest cryptocurrency exchange in the world and news related to Zhao and Binance’s criminal and civil liability is likely to have a significant effect on trading of various cryptocurrencies.” </blockquote><p>“Cryptocurrency markets are volatile, subject to significant swings based on external events,” said the filing. “Here, given the status that Binance and Zhao have among participants in the cryptocurrency and related markets, even the simple docketing of a federal criminal case against either would by itself have a significant market impact.”</p><p>The government compared <a href=\"https://cointelegraph.com/news/bnb-pops-reported-doj-binance-settlement\">potential volatility in the price</a> of BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) to that of FTX Token (FTT) when the crypto exchange collapsed in November 2022 and former CEO Sam “SBF” Bankman-Fried was indicted on federal fraud charges. SBF was subsequently <a href=\"https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-found-guilty-on-all-charges\">found guilty on seven charges</a> and awaits sentencing in March 2024. </p><p>According to court records, lawyers representing Binance and CZ appeared in court for separate hearings scheduled on the morning of Nov. 21 to discuss pleas and possible detention. Attorneys for CZ filed sealed motions concerning the Binance CEO’s conditional release pending sentencing in the case, but the contents were not available at the time of publication.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/69ecb835-eec4-471f-839b-bcfa1b4f2b54.png\"  /><figcaption style=\"text-align: center;\"><em>Source: U.S. District Court for the Western District of Washington at Seattle</em></figcaption></figure><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-3-9b-usdt-move-gains-community-attention-amid-doj-settlement-claims\"><strong><em>Binance $3.9B USDT move gains community attention amid DOJ settlement claims</em></strong></a></p><p>A settlement for many of the criminal and civil cases against Binance and CZ in the United States is expected to be announced at 8:00 pm UTC on Nov. 21 as part of a joint statement by the Justice Department, CFTC, and Department of the Treasury. According to many reports, CZ has <a href=\"https://cointelegraph.com/news/breaking-binance-changpeng-zhao-pleads-guilty-violating-anti-money-laundering-requirements-wsj\">agreed to plead guilty</a>, and Binance will pay more than $4 billion as part of the settlement. </p><p>It’s unclear at the time of publication if any part of the announcement will concern Binance’s pending civil case with the U.S. Securities and Exchange Commission. In June, the regulator <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">filed 13 charges</a> against the crypto exchange, Binance.US and CZ for securities law violations.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/binances-exec-exodus-nasdaq-to-trade-ai-orders-and-sbf-loses-bail-appeal-hodlers-digest-sept-3-9/\"><strong><em>Binance’s exec exodus, Nasdaq to trade AI orders and SBF loses bail appeal: Hodler’s Digest, Sept. 3-9</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-21T20:50:26.000Z",
    "title": "Apple entered anti-crypto agreements with competitors, class action suit claims",
    "url": "https://cryptoslate.com/apple-entered-anti-crypto-agreements-with-competitors-class-action-suit-claims/",
    "description": "<p>A class action suit filed on Nov. 17 in California alleged that Apple entered anti-competitive agreements that partially restricted the use of cryptocurrency. Specifically, plaintiffs said that agreements between Apple and its competitors prevent iOS Peer-to-Peer Payment Market apps from offering decentralized crypto features. The plaintiffs asserted that Apple&#8217;s agreements apply to various other payment [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/apple-entered-anti-crypto-agreements-with-competitors-class-action-suit-claims/\">Apple entered anti-crypto agreements with competitors, class action suit claims</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-21T20:00:55.000Z",
    "title": "Can PancakeSwap (CAKE) and Uniswap (UNI) Green Streak Escalate to Yearly Triumphs?",
    "url": "https://cryptodaily.co.uk/2023/11/can-pancakeswap-cake-and-uniswap-uni-green-streak-escalate-to-yearly-triumphs",
    "description": "Delve into the intriguing market journey of PancakeSwap (CAKE) and Uniswap (UNI) as they navigate a landscape ripe with opportunity. Our analysis examines their recent upswing, with both CAKE and UNI showing promising monthly gains. Could this be the precursor to achieving their yearly highs, especially with the festive season approaching? Uncover the nuances of their potential ascent in our comprehensive overview, offering expert insights to guide you through the possible bullish surges or unexpected shifts in the crypto market."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-21T21:00:05.000Z",
    "title": "DOJ Announces $4.3 Billion Settlement With Binance; CZ to Step Down as Part of Plea Deal",
    "url": "https://news.bitcoin.com/doj-announces-4-3-billion-settlement-with-binance-cz-to-step-down-as-part-of-plea-deal/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/dojbibabbbbb-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/dojbibabbbbb-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/dojbibabbbbb-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/dojbibabbbbb-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/dojbibabbbbb-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/dojbibabbbbb-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/dojbibabbbbb-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/dojbibabbbbb.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The United States Department of Justice (DOJ) has revealed a landmark settlement involving Binance, the world&#8217;s largest crypto exchange by trading volume. Under the agreement, Binance will pay $4.3 billion to settle with the law enforcement authority. This significant development was disclosed during a DOJ press briefing on cryptocurrency enforcement, which took place at 3:36 [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-21T20:30:17.000Z",
    "title": "Africa-Focused Remittances Fintech Zazuu Shut Downs After Failing to Secure Additional Funding",
    "url": "https://news.bitcoin.com/africa-focused-remittances-fintech-zazuu-shut-downs-after-failing-to-secure-additional-funding/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_1725814660-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Africa-Focused Remittances Fintech Zazuu Shut Downs After Failing to Secure Additional Funding\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_1725814660-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_1725814660-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_1725814660-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_1725814660-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_1725814660-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_1725814660-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/shutterstock_1725814660.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />An Africa-focused remittances firm, Zazuu, has become the latest fintech startup to close shop after it failed to raise extra funding. Zazuu and other African fintechs&#8217; funding problems are said to be linked to the collapse of Silicon Valley Bank in the U.S. Zazuu Shuts Down Just Over a Year After Raising $2 Million Zazuu, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-21T20:41:14.000Z",
    "title": "Wolverine from Insomniac Released in 2025 with a Darker Edge",
    "url": "https://www.cryptopolitan.com/wolverine-released-in-2025/",
    "description": "Discover the latest updates on Insomniac Games' Wolverine, set for a 2025 release with a mature, darker theme in the intriguing setting of Madripoor."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-21T20:02:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-21T20:45:18.000Z",
    "title": "Coingecko: Coinbase tops crypto lobbying spenders in 2023",
    "url": "https://crypto.news/coingecko-coinbase-tops-crypto-lobbying-spenders-in-2023/",
    "description": "56 companies have spent an estimated $20 million on crypto lobbying in the U.S., with America’s biggest digital asset exchange Coinbase leading the pack during 2023. "
  },
  {
    "source": "BTCManager",
    "date": "2023-11-21T20:23:36.000Z",
    "title": "Binance sees over $45m in funds withdrawn amidst criminal charges",
    "url": "https://crypto.news/binance-sees-over-45m-in-funds-withdrawn-amidst-criminal-charges/",
    "description": "Binance faces significant user fund outflows and a drop in BNB value following the DOJ’s criminal charges and CEO Changpeng Zhao's potential departure."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-21T20:19:02.000Z",
    "title": "Bitcoin miner Phoenix Group’s $370m IPO overwhelms with massive subscription rate",
    "url": "https://crypto.news/bitcoin-miner-phoenix-groups-370m-ipo-overwhelms-with-massive-subscription-rate/",
    "description": "Phoenix Group, a major bitcoin mining service provider based in Abu Dhabi, recently announced the successful completion of its Initial Public Offering (IPO), securing a substantial $370 million in capital. "
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-21T21:00:10.000Z",
    "title": "Did The OpenAI and Microsoft Saga Just Trigger Massive Interest in AI Tokens?",
    "url": "https://www.newsbtc.com/news/openai-and-microsoft-saga-trigger-massive-interest-ai-tokens/",
    "description": "The recent saga surrounding OpenAI and its co-founder Sam Altman has sparked a surge of interest in AI tokens, with total weekly trade volume surpassing $2 billion for the first time since March, fresh data from Kaiko, a blockchain analytics platform, shows. According to statistics, WLD, the native token on Worldcoin, a project co-founded by Altman, and other tokens, including FET, the primary coin behind the AI-reliant blockchain, Fetch.ai, appear to be primary gainers. Even so, WLD prices remain below November 2023 lows when writing. WLD Remains Volatile  Even so, looking at market data, the spike in crypto AI trading volume seems driven mainly by WLD activity. Looking at the project&#8217;s share, trading volume comprises over 33% of all related crypto AI trading volume.  While there is a noticeable spike in activity, it remains below the all-time high of above $4 billion in Q1 2023. Then, traders and investors were keen on AGIX, the SingularityNET token. However, over the months, Worldcoin has since taken over as investor interest shifted to WLD, evidenced by the gradual rise of trading volume. Looking at WLD price action over the past three days, prices have been volatile, though trading volume has been mostly up from November 13. Following news of Altman&#8217;s removal as CEO of OpenAI, prices fell before slightly expanding with news of negotiations to return to the role, followed by his appointment to lead Microsoft&#8217;s AI team.  Related Reading: Analyst Sets $30,000 Floor For Bitcoin, But Can We Forget 2021’s Misfire? All these events have contributed to the market&#8217;s heightened interest in WLD. Accordingly, trading volume across the broader crypto AI scene stands above the $2 billion level for the first time since March.   The Sam Altman And OpenAI Drama Turns Attention To Worldcoin Though there is no direct connection between OpenAI and Worldcoin, crypto participants focus on events at OpenAI and how the board handled Altman as a factor catalyzing WLD&#8217;s activity.  The general lack of clarity on why the board ousted Altman as CEO worsens the situation, sparking speculation that this could also impact WLD&#8217;s prices and how Worldcoin is governed, considering the former CEO is also behind the crypto AI project. Looking at the co-founder&#8217;s previous role as the team leading Worldcoin&#8217;s developments, Altman also holds significant sway, contributing to discussions on how the government should regulate AI at the end of the day.  Related Reading: Solana Forms Sell Signal, Decline To $30 Ahead? Altman&#8217;s influential role has impacted Worldcoin and its prices since the blockchain project aims to create a global identity system. Worldcoin&#8217;s operations would rely on AI, including fraud prevention, data analysis, verification, and more.  Feature image from Canva, chart from TradingView"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-21T20:00:32.000Z",
    "title": "Fetch AI Breakout Confirmed: Analysts Reveal Bullish Targets For FET Price",
    "url": "https://www.newsbtc.com/altcoin/fetch-ai-fet-breakout/",
    "description": "Fetch AI (FET) has been riding the bullish artificial intelligence (AI) narrative following Sam Altman being ousted from OpenAI. Its native FET token has seen an impressive move upward since then, maintaining its bullish headwinds at the same time. But even after the altcoin has grown so much, crypto analysts are convinced that the coin is only at its starting level, and will continue to rise. Analyst Who Called FET Initial Rise Is Back Again Crypto analyst Tony The Bull, Founder of CoinChartist, was one of the most vocal voices for buying FET when the price fell to $0.09 back in 2022. The coin has since risen more than 5x from this level but even this has not deterred the analyst, who believes that there is more to come. Related Reading: Solana Captures Institutional Investors’ Attention, Inflows Rise To $135 Million In a recent analysis, Tony presented the reasoning behind why he is still bullish on the FET price. The analyst had previously expected a retracement. But from the current level, expect the price to increase once more. The chart shows an initial bounce above the $2.5 mark before a retracement that takes it back down to around $0.55. Then from here, there is another bounce upward to over $4 once more. If this plays out as expected, then the FET price could be looking toward multiple bounces of over 500% from here. Updated plan pic.twitter.com/pkfhHBQxCC — Tony &#8220;The Bull&#8221; (@tonythebullBTC) November 20, 2023 Fetch AI On Bulls’ Radar In the same vein as Tony The Bull, another crypto analyst has predicted that the price of FET is headed for more rallies. The analyst who goes by TradingShot posted the analysis on TradingView where they revealed their target for the price. Similar to Tony’s first target, TradingShot expects a rally that will bring the price above $2. The analyst identified a Golden Cross on the 1-day (1D) chart, noting that this is the fourth bullish pattern that has shown up in the FET long-term channel. Source: Tradingview.com According to the crypto analyst, whenever such a bullish pattern emerged, the price had already started moving up. But actually, it is just the beginning as the main rally often happens after this 1D Golden Cross on the price chart is noted. Related Reading: Crypto Market Expert Identifies The Trigger For 600% Bitcoin Price Surge “The 1D RSI&#8217;s similarities of the November 2020 &#8211; February 2021 Bullish Megaphone are a testament that we are on a similar pattern, which then peaked just below the 1.5 Fibonacci extension. As a result, we remain buyers on FET, targeting 1.8000,” TradingShot said. FET is currently in a downtrend after a tremendous run. According to data from CoinMarketCap, the altcoin’s price is sitting at $0.5 after falling 11.62% in the last 24 hours. FET price sitting above $0.5 &#124; Source: FETUSDT on Tradingview.com Featured image from DailyFX, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-21T21:00:52.000Z",
    "title": "Crypto Investor Arthur Cheong Says One Ethereum-Based Altcoin Set for Big Rallies",
    "url": "https://dailyhodl.com/2023/11/21/crypto-investor-arthur-cheong-says-one-ethereum-based-altcoin-set-for-big-rallies/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/one-set-big-rallies.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/one-set-big-rallies.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/one-set-big-rallies.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/one-set-big-rallies.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/one-set-big-rallies.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/one-set-big-rallies.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/one-set-big-rallies.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Veteran crypto investor Arthur Cheong says that one altcoin project operating on the Ethereum (ETH) network is set for big moves to the upside. Cheong, the founder of DeFiance Capital, tells his 153,300 followers on the social media platform X that the decentralized finance (DeFi) protocol Synthetix (SNX) could surge by more than 75% from [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/21/crypto-investor-arthur-cheong-says-one-ethereum-based-altcoin-set-for-big-rallies/\">Crypto Investor Arthur Cheong Says One Ethereum-Based Altcoin Set for Big Rallies</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-21T20:55:56.000Z",
    "title": "Crypto Analyst Issues Bitcoin Warning, Says BTC Could Crash up to 40% Near 2024 Halving",
    "url": "https://dailyhodl.com/2023/11/21/crypto-analyst-issues-bitcoin-warning-says-btc-could-crash-up-to-40-near-2024-halving/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/02/merten-on-track.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/02/merten-on-track.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/02/merten-on-track.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/02/merten-on-track.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/02/merten-on-track.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/02/merten-on-track.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/02/merten-on-track.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader is warning that Bitcoin (BTC) could witness a dramatic correction around the next halving event in 2024. Crypto analyst Rekt Capital tells his 370,300 followers on the social media platform X that Bitcoin could repeat a 2016 price pattern and decline by 40% after a pre-halving rally. The next halving [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/21/crypto-analyst-issues-bitcoin-warning-says-btc-could-crash-up-to-40-near-2024-halving/\">Crypto Analyst Issues Bitcoin Warning, Says BTC Could Crash up to 40% Near 2024 Halving</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-21T19:45:41.000Z",
    "title": "Friend.tech Total Value Locked Plummets 19% in One Weekend As New User Count Stays Flat: On-Chain Data",
    "url": "https://dailyhodl.com/2023/11/21/friend-tech-total-value-locked-plummets-19-in-one-weekend-as-new-user-count-stays-flat-on-chain-data/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/friend-total-value-locked.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/friend-total-value-locked.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/friend-total-value-locked.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/friend-total-value-locked.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/friend-total-value-locked.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/friend-total-value-locked.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/friend-total-value-locked.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The total value locked (TVL) on the decentralized social finance (SocialFi) application Friend.tech fell 19% in a few days as user adoption slows down. Friend.tech, which launched in August, is built on Base, an Ethereum (ETH) scaling solution supported by the Coinbase crypto exchange. The application allows users to tokenize themselves by selling shares or [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/21/friend-tech-total-value-locked-plummets-19-in-one-weekend-as-new-user-count-stays-flat-on-chain-data/\">Friend.tech Total Value Locked Plummets 19% in One Weekend As New User Count Stays Flat: On-Chain Data</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-21T19:41:36.000Z",
    "title": "BNB Rallies Following Reports of DOJ Seeking $4,000,000,000 Settlement With Binance: Report",
    "url": "https://dailyhodl.com/2023/11/21/bnb-rallies-following-reports-of-doj-seeking-4000000000-settlement-with-binance-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/cyrypto-binance-burns-bnb.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/cyrypto-binance-burns-bnb.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/cyrypto-binance-burns-bnb.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/cyrypto-binance-burns-bnb.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/cyrypto-binance-burns-bnb.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/cyrypto-binance-burns-bnb.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/cyrypto-binance-burns-bnb.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>BNB is rallying on the news that the U.S. Department of Justice (DOJ) is seeking to close a criminal case against Binance. According to a new Bloomberg report, the DOJ is seeking over $4 billion from the largest crypto exchange by trading volume to settle a multi-year investigation. A separate report from the Wall Street Journal [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/21/bnb-rallies-following-reports-of-doj-seeking-4000000000-settlement-with-binance-report/\">BNB Rallies Following Reports of DOJ Seeking $4,000,000,000 Settlement With Binance: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]