[
  {
    "source": "Cointelegraph",
    "date": "2023-10-03T18:00:00.000Z",
    "title": "Bitcoin drives digital asset inflows for the first time in 6 weeks: Report",
    "url": "https://cointelegraph.com/news/bitcoin-solana-ethereum-xrp-drives-digital-asset-inflows-6-weeks",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/a8a8003c-76d8-4d0c-8d45-34f8e1489fab.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>But Solana was the only other major asset to show inflows for the week.</p>\n                    <p><p>Cryptocurrency assets experienced inflows for the first time in six weeks during the week of Sep. 22-28, according to the latest Digital Asset Fund Flows Weekly Report from European digital assets management firm CoinShares.</p><p>Bitcoin was the biggest gainer with inflows in the amount of $20.4 million for the week. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Good week, everyone. Here are the latest <a href=\"https://twitter.com/hashtag/FundFlows?src=hash&amp;ref_src=twsrc%5Etfw\">#FundFlows</a> and observations by CoinShares Head of Research <a href=\"https://twitter.com/jbutterfill?ref_src=twsrc%5Etfw\">@JButterfill</a>.<br><br> This week inflows: US$21m (after 6 weeks of outflows)<br><br> We believe these inflows are a reaction to a combination of positive price momentum, fears over US… <a href=\"https://t.co/0VHHBh1n50\">pic.twitter.com/0VHHBh1n50</a></p>&mdash; CoinShares (@CoinSharesCo) <a href=\"https://twitter.com/CoinSharesCo/status/1708838830625759466?ref_src=twsrc%5Etfw\">October 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Solana took second with $5 million as the only other asset to show inflows. Per CoinShares, this is its 27th week of inflows with only four weeks of outflows for 2023, making it “the most loved altcoin this year.” </p><p>On the flip side, Ethereum experiences outflows in the amount of $1.5 million. This marks its seventh consecutive week of outflows and, according to CoinShares, solidifies its status as “the least loved altcoin.” </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-sees-outflows-for-6th-consecutive-week-xrp-sol-gain-investor-confidence\"><strong><em>CoinShares says US not lagging in crypto adoption and regulation</em></strong></a></p><p>Flows for other altcoins, including XRP after it saw more inflows than Solana in the previous week, were negative and minimal. </p><p>CoinShares analysts <a href=\"https://blog.coinshares.com/volume-151-digital-asset-fund-flows-weekly-report-9be13b6861c3\" target=\"_blank\" rel=\"noopener nofollow\">attributed</a> the the lack of altcoin movement alongside Bitcoin’s trend-breaking momentum to a combination of factors:</p><blockquote>“We believe the inflows are a reaction to a combination of positive price momentum, fears over US government debt prices and the recent quagmire over government funding.”</blockquote><p>The quagmire referenced by CoinShares involves the <a href=\"https://edition.cnn.com/politics/live-news/government-shutdown-deadline-09-30-23/index.html\" target=\"_blank\" rel=\"noopener nofollow\">ongoing</a> negotiations over U.S. government funding. Earlier in the previous week’s cycle, fears over a republican-wrought stalemate led to predictions that the U.S. government would shut down on Oct. 2. However, a last-minute effort by senate leaders allowed for the passage of a stopgap that ensures funding through November 17. Whether congress and the president can come to terms to fund the government beyond the current measure’s expiration remains to be seen. </p><p>Geographically, Germany, Canada, and Switzerland lead the charge for the week with inflows amounting to $17.7 million, $17.2 million, and $7.4 million respectively. Australia and France held the line, metaphorically speaking, with $0.1 million for the former and a nil push for the latter. </p><p>The United States played foil to Europe and Canada’s inflows, registering $18.5 million in outflows with Sweden and Brazil following suit at $1.8 and $0.9 outgoing respectively. </p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-10-03T17:53:33.000Z",
    "title": "Bitcoin Spot ETF Approval On The Horizon, Say VanEck & Bitwise Leaders",
    "url": "https://cryptobriefing.com/bitcoin-spot-etf-approval-horizon-vaneck-bitwise/?utm_source=feed&utm_medium=rss",
    "description": "SEC stance on crypto ETFs softening say VanEck and Bitwise leaders, spot Bitcoin product approval likely in 2024."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-03T18:00:31.000Z",
    "title": "Twitter IPO: Dogecoin Takes Center Stage In Elon Musk’s X IPO Rumors",
    "url": "https://www.newsbtc.com/news/dogecoin/twitter-ipo-dogecoin-x/",
    "description": "The crypto community is buzzing with excitement as rumors spread about a possible collaboration between the CEO of Pershing Square Capital Management and Elon Musk’s X. Ackman’s desire to potentially work with X has grabbed the attention of investors, raising questions about the possible impact on the cryptocurrency market, specifically on digital coins like Dogecoin.  Ackman Signals Willingness To Strike Deal With Musk’s X According to reports from The Wall Street Journal, Bill Ackman, an American Billionaire hedge fund manager and founder and CEO of Pershing Square, has stated his interest in striking a deal with Elon Musk’s recently rebranded X social media platform.  Related Reading: Pro-XRP Lawyer Reveals The Impact Of SEC’s Lawsuit Against Ripple When asked by The WSJ if he would be interested in enacting a deal with X, Ackman responded by saying “Absolutely.” The American billionaire has been an avid user of X platform, amassing almost 800,000 followers and broadcasting his views on various global topics and issues.  The Pershing Square CEO also recently disclosed the regulatory approval of its unique investment vehicle, SPARC by the United States Securities and Exchange Commission (SEC), allowing the financial vehicle to target and invest in privately held firms and move them into a public domain.  Ackman announced in an X post, urging private companies looking to go public to consider Pershing Square as an investor.  &#8220;If your large private growth company wants to go public without the risks and expenses of a typical IPO, with Pershing Square as your anchor shareholder, please call me. We promise a quick yes or no,” Ackman stated.  Although Ackman has revealed his willingness to potentially collaborate with X, Musk has not released any acknowledgment or confirmation of Ackman’s statement. Investors, however, are curious about the potential influence the alleged collaboration would have on Dogecoin cryptocurrency.  DOGE price struggles to hold $0.06 &#124; Source: DOGEUSD on Tradingview.com What Does This Mean For Dogecoin? The speculation about X’s dealing with Ackman’s investment vehicle has led to whispers about potential market changes and possibilities for Dogecoin.  Since Dogecoin is known to be highly favored by Musk, who is believed to be one of the largest investors of the cryptocurrency, industry investors see the possibility of cooperation between Ackman and X driving Dogecoin’s market price toward a $0.75 mark.  There have also been previous speculations that Musk would implement DOGE payments as he deploys X bots in his new X payment plans. Related Reading: Bitcoin Creator Satoshi Nakamoto Sparks Speculation As Cryptic Email, X Account Resurfaces Crypto enthusiasts and industry investors have seen Musk’s heavy influence on the price of Dogecoin over the years and are looking forward to the changes the cryptocurrency would have if rumors of Ackman’s alignment with X come to fruition.  Currently, the price of Dogecoin is trading at $0.062 with a 24-hour trading volume of over $238 million. The cryptocurrency is presently facing a bullish uphill climb to the $0.07 mark, however, market metrics have revealed challenges in Dogecoin&#8217;s upsurge. Featured image from Decrypt, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-03T18:04:23.000Z",
    "title": "Kenyan Parliament Takes a Stand Against Worldcoin: Privacy Concerns and Calls for Regulation",
    "url": "https://www.crypto-news-flash.com/kenyan-parliament-takes-a-stand-against-worldcoin-privacy-concerns-and-calls-for-regulation/?utm_source=rss&utm_medium=rss&utm_campaign=kenyan-parliament-takes-a-stand-against-worldcoin-privacy-concerns-and-calls-for-regulation",
    "description": "<img width=\"960\" height=\"637\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/06/eye-2913297_960_720.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/06/eye-2913297_960_720.jpg 960w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/eye-2913297_960_720-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/eye-2913297_960_720-768x510.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/eye-2913297_960_720-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/eye-2913297_960_720-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/eye-2913297_960_720-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/eye-2913297_960_720-48x32.jpg 48w\" sizes=\"(max-width: 960px) 100vw, 960px\" />The Kenyan National Assembly Committee that has been investigating Worldcoin operations in the country has urged the Communications Authority of Kenya (CA) to immediately close the project. The parliamentary committee urged the National Treasury to formulate a comprehensive virtual assets regulatory framework as the investigative arms continue to probe the Worldcoin data storage. A Kenyan [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-03T18:05:32.000Z",
    "title": "Bitcoin Will Flip ‘Super Bullish’ and Begin Run to New All-Time High When This Happens, Says Crypto Trader",
    "url": "https://dailyhodl.com/2023/10/03/bitcoin-will-flip-super-bullish-and-begin-run-to-new-all-time-high-when-this-happens-says-crypto-trader/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/07/Bitcoin-Doesnt-Mean-Much.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/07/Bitcoin-Doesnt-Mean-Much.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/07/Bitcoin-Doesnt-Mean-Much.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/07/Bitcoin-Doesnt-Mean-Much.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/07/Bitcoin-Doesnt-Mean-Much.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/07/Bitcoin-Doesnt-Mean-Much.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/07/Bitcoin-Doesnt-Mean-Much.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto strategist believes Bitcoin (BTC) will skyrocket and trend towards a new all-time high after a crucial level is shattered. In a new strategy session video, crypto analyst Kevin Svenson tells his 70,600 YouTube subscribers that once Bitcoin flips a key 2021 price level into support, the king crypto will likely spark a massive [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/03/bitcoin-will-flip-super-bullish-and-begin-run-to-new-all-time-high-when-this-happens-says-crypto-trader/\">Bitcoin Will Flip ‘Super Bullish’ and Begin Run to New All-Time High When This Happens, Says Crypto Trader</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]