[
  {
    "source": "Crypto Daily",
    "date": "2023-07-28T18:00:00.000Z",
    "title": "eToro Registration Is Approved by Bank of Spain",
    "url": "https://cryptodaily.co.uk/2023/07/etoro-registration-is-approved-by-bank-of-spain",
    "description": "<p>Investment platform eToro has officially achieved its registration as a provider for crypto-fiat exchange and other e-wallet custody services.</p>\nBank of Spain Registers eToro as a Virtual Asset Exchange\n<p>eToro, a social investment and multi-asset brokerage company based in Israel, is expanding its connections worldwide.&nbsp;</p>\n<p>On Friday, July 29, the company announced that a month ago, on June 29, the Bank of Spain had approved the registration of eToro as &ldquo;a service provider of exchange of virtual currency for fiat currency and electronic wallet custody services&rdquo;. eToro (Europe) Digital Assets Ltd. is now registered in the Virtual Asset Service Provider Register maintained by the Bank of Spain under code number D848.</p>\n\n<p>Tali Salomon, eToro&rsquo;s Regional Manager for Iberia and LatAm, commented on the news: &ldquo;This registration is a testament to our commitment to operating a growing business which prioritises consumer protection while also nurturing innovation and ensuring access for individual investors. As a multi-asset platform which has been a long standing supporter of crypto and blockchain technology, we are proud to have received this registration from the Bank of Spain. We will continue to empower our Spanish users by providing them with access to a diverse range of asset classes, investment tools and educational resources to enable them to grow their knowledge and wealth.&rdquo;</p>\n\neToro Social and Investment Services\n<p>eToro is a large trading platform that offers both investment and educational opportunities. Founded in 2007, the company now has over 32 million registered users across more than 100 countries. One of eToro&rsquo;s key features is its collaborative investment community that provides tools for growing users&rsquo; knowledge and wealth. The platform&rsquo;s educational tools include tutorials and articles for traders of all levels, as well as a virtual portfolio.</p>\n<p>Both traditional and digital assets are available on eToro. The platform also offers different ways for investment: direct trade, investing in a portfolio, and copy trading. You can read more about eToro copy trading features compared to that of Bybit in this article.</p>\n<p>Last month, eToro delisted four cryptocurrencies on its platform for the US customers.</p>\nSpain Expands its Range of Digital Asset Providers\n<p>The Bank of Spain now has a list of 81 firms registered to operate as providers of virtual asset services. Only a month ago, a Singapore-based crypto exchange Crypto.com also secured its registration as a Virtual Asset Service Provider (VASP). Other crypto platforms that have obtained the license of VASP in Spain include Binance and Bit2Me.&nbsp;</p>\n<p>At the end of last year, the Central Bank of Spain announced its plans to launch an experimental program for the country&rsquo;s wholesale Central bank digital currency (CBDC).</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T18:03:07.000Z",
    "title": "Algorand Price Prediction 2023-2032: Resurgence possible?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices considering investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand’s price prediction from 2023 to 2032, its expected minimum price, and what it brings. For ... <a title=\"Algorand Price Prediction 2023-2032: Resurgence possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Resurgence possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T17:54:00.000Z",
    "title": "Bank of England appoints former Fed chair to review inflation forecasting misjudgment ",
    "url": "https://www.cryptopolitan.com/bank-of-england-appoints-former-fed-chair/",
    "description": "The Bank of England(BoE) has announced today that Ben Bernanke, who presided over the U.S. Federal Reserve during the global financial crisis, will oversee a review of the institution&#8217;s forecasting procedures. The BoE has been under fire from British legislators for failing to foresee the magnitude of last year&#8217;s inflation spike, which reached a 41-year ... <a title=\"Bank of England appoints former Fed chair to review inflation forecasting misjudgment \" class=\"read-more\" href=\"https://www.cryptopolitan.com/bank-of-england-appoints-former-fed-chair/\" aria-label=\"More on Bank of England appoints former Fed chair to review inflation forecasting misjudgment \">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-28T18:00:36.000Z",
    "title": "Bitcoin Whales Make Alarming Deposits To Exchanges Amid Falling Prices",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-whales-deposits-to-exchanges/",
    "description": "It would appear that Bitcoin whales are shifting their BTC into exchanges at an alarming rate, which is a warning that they may be getting ready to liquidate their holdings. Recent on-chain data shows that Bitcoin whale exchange deposits reached $275 million in a single day as the cryptocurrency continues to struggle to cross over $30,000. Bitcoin Whales Moving Funds to Exchanges Tweets from the whale transaction tracker @whale_alert indicate that a total of 9,406 Bitcoins, with an approximate worth of $275 million, have been moved into exchanges through separate transactions.  Related Reading: Ripple Attorney Withdraws From SEC Lawsuit, Will It Affect XRP? The vast majority of these trades entered Binance twice, with the largest single deposit being the entry of 2,459 BTC with a total value of $72.6 million. Another significant transaction included the deposit of 1,499 BTC with a total value of $44.3 million into the Binance exchange.  The actions of these Bitcoin whales, or large holders, often significantly impact the overall market. There are a few possible for big money transfers, but when whales make large deposits to exchanges, it usually signals they are preparing to sell in large volumes, which can crash the market, at least temporarily. Many traders consider this a bearish signal and can spark worry that prices may soon drop. For smaller investors, this can mean opportunity or risk ahead. The price of Bitcoin crossed over $30,000 last month, showing promising signs of an upward trend for investors. However, the cryptocurrency has experienced a slight decline in the last seven days, dropping by around 1.57%. Further massive selloffs by whales can have a counter effect on this bullish sentiment. BTC price trending above $29,300 &#124; Source: BTCUSD on TradingView.com BTC HODLer Net Position Change Reaches 1-Month Low In the same vein of waning bullish sentiment, the number of net Bitcoin position changes recently reached a 1-month low. The metric, which measures the position change of long-term investors on a monthly basis, shows whether investors are opening or closing positions in Bitcoin.  Related Reading: VC Firm Sequoia Capital Slashes Crypto Fund By 65% Amid Bear Market According to data from Glassnode alerts, this metric just reached a one-month low of 17,604.723. This shows that more holders have been closing out their BTC positions to withdraw their profits for the past few weeks than those opening new ones. 📉 #Bitcoin $BTC HODLer Net Position Change just reached a 1-month low of 17,604.723 Previous 1-month low of 22,095.894 was observed on 18 July 2023 View metric:https://t.co/CU3jPaaHXh pic.twitter.com/8k2EHP0nsi — glassnode alerts (@glassnodealerts) July 28, 2023 It is important to keep an eye on whale selloffs, but other factors, like the shift in the net position of HODLers, also help to reveal where the price of Bitcoin is headed in the short term. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T18:00:55.000Z",
    "title": "Utility Crypto Revolution: Uwerx (WERX) The Freelance Platform Sensation Outperforms Crypto Market Mainstays!",
    "url": "https://www.crypto-news-flash.com/utility-crypto-revolution-uwerx-werx-the-freelance-platform-sensation-outperforms-crypto-market-mainstays-2/?utm_source=rss&utm_medium=rss&utm_campaign=utility-crypto-revolution-uwerx-werx-the-freelance-platform-sensation-outperforms-crypto-market-mainstays-2",
    "description": "<img width=\"1200\" height=\"768\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/xxc.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/xxc.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/xxc-300x192.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/xxc-1024x655.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/xxc-768x492.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />With its groundbreaking features and forward-thinking approach, Uwerx has become the go-to platform for freelancers and clients seeking a thriving and rewarding ecosystem. &#160; Join Uwerx,  and have a view into the its extraordinary world  and witness immediately how it outshines the competition in the ever-evolving crypto market. In a world where innovation and practicality [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-28T18:05:28.000Z",
    "title": "Analyst Who Accurately Predicted Bitcoin’s 2022 Bottom Turns Pessimistic on BTC – Here’s Why",
    "url": "https://dailyhodl.com/2023/07/28/top-analyst-who-accurately-predicted-bitcoins-2022-bottom-turns-pessimistic-on-btc-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/Bitcoin-Metric-Flashing-Concerning-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/Bitcoin-Metric-Flashing-Concerning-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/Bitcoin-Metric-Flashing-Concerning-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/Bitcoin-Metric-Flashing-Concerning-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/Bitcoin-Metric-Flashing-Concerning-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/Bitcoin-Metric-Flashing-Concerning-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/Bitcoin-Metric-Flashing-Concerning-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular trader who called Bitcoin’s (BTC) 2022 market bottom is turning bearish on the king crypto as it stalls below the $30,000 level. Pseudonymous analyst DonAlt tells his 498,300 Twitter followers that he won’t even start to consider whether Bitcoin is in a bull market cycle until it closes the weekly chart greater than [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/28/top-analyst-who-accurately-predicted-bitcoins-2022-bottom-turns-pessimistic-on-btc-heres-why/\">Analyst Who Accurately Predicted Bitcoin’s 2022 Bottom Turns Pessimistic on BTC – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]