[
  {
    "source": "Cointelegraph",
    "date": "2023-10-01T21:58:08.000Z",
    "title": "VC Roundup: Investors eyes blockchain analytics, gaming and crypto privacy  ",
    "url": "https://cointelegraph.com/news/vc-roundup-investors-blockchain-analytics-gaming-crypto-privacy",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/01031e37-0d8e-4727-bbd0-9d815a0e4fed.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bubblemaps, CoinScan, Hinkal Protocol, and Mythic Protocol are among the latest crypto and blockchain funding deals. </p>\n                    <p><p>Crypto startups keep raising capital despite tight liquidity and adverse macroeconomic conditions. September saw major developments in the space, such as Farmville co-creator Amitt Mahajan<a href=\"https://cointelegraph.com/news/farmville-co-creator-led-company-raises-33-million-create-web3-games\"> raising $33 million</a> to create Web3 games, and Animoca Brands<a href=\"https://cointelegraph.com/news/animoca-to-develop-web3-digital-ids-point-system\"> disclosing $20 million capital</a> gathered to push forward the development of its Mocaverse platform.</p><p>In another related development, Blockchain Capital<a href=\"https://cointelegraph.com/news/blockchain-capital-closes-funds-totaling-580-million-blockchain-investments-crypto-gaming-de-fi\"> closed two new funds</a> in September, with $580 million to be deployed in crypto gaming and decentralized finance projects in the coming months. Cointelegraph’s VC roundup showcases the latest projects raising capital despite the market’s long downward trend.</p><h3>Bubblemaps secures $3.2M for data visualization</h3><p>Data visualization startup Bubblemaps secured 3 million euros ($3.2 million) in a seed funding round spearheaded by INCE Capital. According to the startup, the funding will be used to grow its team, recruit additional developers, and expand its social media marketing initiatives. Stake Capital, Momentum 6, Lbank, V3ntures, Nicolas Bacca of Ledger, Dyma Budorin of Hacken, and French entrepreneur Owen ‘Hasheur’ Simonin also contributed to the funding. The company has the ambitious goal of becoming the Google Analytics of Web3. Partnerships have reportedly been set up with Arbitrum, Polygon, Avalanche, and BNB Chain. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We&#39;re thrilled to share the closing of 2 new funds – our 6th early stage fund and 1st opportunity fund.<br><br>Together, they total $580 million and serve to reinforce our commitment to leading the global transition to decentralized, blockchain-based systems. ↓<a href=\"https://t.co/Vr2uYnGlF7\">https://t.co/Vr2uYnGlF7</a></p>&mdash; Blockchain Capital (@blockchaincap) <a href=\"https://twitter.com/blockchaincap/status/1703788962538815709?ref_src=twsrc%5Etfw\">September 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>Blockchain analytics CoinScan raises $6.3M </h3><p>Crypto analytics platform CoinScan raised $6.3 million in September seeking to offer safety checks, holders and airdrop analysis, and social sentiment analysis across the crypto community. CoinScan is the first product from CryptoHub, a Web3 company focused on the blockchain economy and backed by DraftKings’ top individual shareholder and billionaire Shalom MecKenzie alongside investors from Playtech and, iAngels. “Crypto, much like sports betting, should give people the tools and data to make their own assessments about risk and reward,” said MecKenzie in a statement, claiming CoinScan will provide data pulled from multiple sources to provide charting insights. </p><h3>Hinkal Protocol secures $4.1M to enhance privacy in DeFi trading</h3><p>Privacy protocol Hinkal secured $4.1 million in a pre-seed funding round led by Draper Associates. The protocol is designed to offer an advanced privacy layer, where transactions and assets across various decentralized finance (DeFi) protocols are shielded from public visibility, according to a statement. The round also saw participation from Psalion Hedge Fund, NGC Ventures, NoLimit Holdings, Draper Dragon, Peer VC, Orange DAO, Web3.com Ventures, and others. Draper Associates has invested in a range of tech companies, including Hotmail, Skype, Baidu, Tesla, SpaceX, Twitch, Cruise, Carta, Webflow, Robinhood, and Coinbase.</p><h3>Mythic Protocol raises $6.5M seed round for collaborative entertainment</h3><p>Mythic Protocol closed a $6.5M seed round co-led by Shima Capital’s Yida Gao alongside Alpha JWC, Saison Capital, GDP Ventures, and Planetarium Labs, among other investors. The team behind the project is working in a collaborative entertainment ecosystem that utilizes a game-first strategy to acquire, retain, and scale users. The funds will be deployed in the coming months to develop and launch the initial core offerings with a focus on gamers, creators, and investors. “With a founding team that has launched over 250 game titles since 2009 from one of the biggest gaming studios in SEA, we have no doubt that they will carry their track record of success into the next cycle of gaming,” said in a statement, Yida Gao, founder at Shima Capital. </p><h3>Before you go: ConsenSys launches pre-accelerator program for Web3 founders</h3><p>Technology company ConsenSys announced the launch of its pre-accelerator program, ConsenSys Fellowship<em>,</em> to support early-stage Web3 startups. The Fellowship goal is to help early-stage startups bridge the gap between an idea with potential and a functional business, product, or tool. The 12-week program will offer guided workshops, weekly curricula, mentorship and access to ConsenSys’ network to accelerate up to 15 startups. Fellowship teams will be eligible for follow-on investments from a $1.5 million fund. </p><p><strong><em>Magazine:</em></strong> <a href=\"https://cointelegraph.com/magazine/ai-killed-translation-industry-easytranslate-boss-change-human-jobs/\"><strong><em>‘AI has killed the industry’ — EasyTranslate boss on adapting to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-01T22:00:00.000Z",
    "title": "Here Are 3 Sectors for New Crypto Investment Opportunities 2024",
    "url": "https://coinedition.com/here-are-3-sectors-for-new-crypto-investment-opportunities-2024/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/10/Crypto-Investment-Opportunities.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Crypto Investment Opportunities\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/10/Crypto-Investment-Opportunities.jpg 730w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Investment-Opportunities-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Investment-Opportunities-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Investment-Opportunities-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Investment-Opportunities-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Investment-Opportunities-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Investment-Opportunities-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Investment-Opportunities-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Investment-Opportunities-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Investment-Opportunities-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Investment-Opportunities-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Investment-Opportunities-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Investment-Opportunities-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Investment-Opportunities-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Investment-Opportunities-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/10/Crypto-Investment-Opportunities-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent video from the YouTube channel Crypto Banter, the host discussed three major crypto sectors poised to be the driving forces of the next market cycle. According to the host, these sectors should form the foundation of any crypto investor&#8217;s portfolio. Firstly, the host emphasized the enduring appeal of speculation in the crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/here-are-3-sectors-for-new-crypto-investment-opportunities-2024/\">Here Are 3 Sectors for New Crypto Investment Opportunities 2024</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]