[
  {
    "source": "Decrypt",
    "date": "2024-02-20T22:04:39.000Z",
    "title": "Metaverse Games With 40,000 Players in the Same Space? The Tech Is Coming",
    "url": "https://decrypt.co/218189/metaverse-games-40000-players-tech-coming",
    "description": "Improbable Chief Product Officer likened the expansive metaverse experience to \"a digital Glastonbury or a digital Coachella.\""
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-20T21:55:37.000Z",
    "title": " Crypto advocacy group calls on Senate Banking Chair not to support Elizabeth Warren’s AML bill ",
    "url": "https://cointelegraph.com/news/crypto-advocacy-group-senate-banking-elizabeth-warren-bill",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNDZlMzJlMzQtNmQ5NC00MWU3LTkwOTQtMDM2ZjRmMDc3NDRhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Chamber of Digital Commerce claimed Senators Elizabeth Warren and Sherrod Brown were “trying to kill the entire industry” with the Digital Asset Anti-Money Laundering Act.</p>\n                    <p><p>The Chamber of Digital Commerce (CDC), a United States-based crypto advocacy group, has urged the chair of the Senate Banking Committee not to consider an Anti-Money Laundering bill that has received criticism from many in the industry.</p><p>In a Feb. 20 X post, the CDC <a href=\"https://twitter.com/DigitalChamber/status/1760016133602848797\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> Senator Elizabeth Warren and Senate Banking Committee Chair Sherrod Brown were “trying to kill the entire [digital asset] industry” by considering the Digital Asset Anti-Money Laundering Act (DAAMLA). The Senate Banking Committee will hold hearings to potentially consider the bill, which CDC founder and CEO Perianne Boring <a href=\"https://digitalchamber.org/wp-content/uploads/2024/02/Chair-Sherrod-Brown-S2669.pdf\" target=\"_blank\" rel=\"noopener nofollow\">branded</a> as a “clear and present danger to U.S. national security and the broader economy” in a letter to Brown. </p><p>“This bill, if passed, will erase hundreds of billions of dollars in value for U.S. start-ups and decimate the savings of countless Americans invested in this asset class legally,” said Boring. “[It] represents an effective prohibition on digital assets, setting forth compliance requirements that are not only impractical but also unattainable for organizations tasked with securing blockchain infrastructure.”</p><p><a href=\"https://cointelegraph.com/news/crypto-advocacy-group-senate-banking-elizabeth-warren-bill\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-20T21:48:46.000Z",
    "title": " Data points to approaching altcoin season even as Bitcoin dominance holds ",
    "url": "https://cointelegraph.com/news/data-points-to-approaching-altcoin-season-even-as-bitcoin-dominance-holds",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvY2UxZjAxZDItYmU2MS00NzdiLThjNTQtYjZjYTc0YmZjZmYzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin dominance remains strong at 52%, but on-chain and technical data suggest that altcoin season is fast approaching.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) experienced a sharp correction on Feb. 20, sinking as much as 4% from an intra-day high of $53,019 to a low of $50,812, threatening to wipe out the gains of the past seven days.</p><p>This pull-back led traders to re-evaluate the general condition of the crypto market, initiating a debate on whether the <a href=\"https://cointelegraph.com/news/is-the-altcoin-season-here-how-to-trade-small-cap-coins-amid-high-volatility#:~:text=The%20crypto%20community%20recognizes%20an,seen%20if%20altcoins%20succeed%20further.\">altcoin season</a> (altseason) is here. </p><p>Traders and market analysts believe the ongoing price crash is a part of the 5 phases of the <a href=\"https://cointelegraph.com/learn/bitcoin-halving-how-does-the-halving-cycle-work-and-why-does-it-matter\">Bitcoin halving cycle </a>and that BTC might be experiencing a pre-halving retrace before entering a widely expected post-halving parabolic uptrend.</p><p><a href=\"https://cointelegraph.com/news/data-points-to-approaching-altcoin-season-even-as-bitcoin-dominance-holds\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NullTX",
    "date": "2024-02-20T21:45:22.000Z",
    "title": "World Coin (WLD) Surges To New All-Time High Before Slight Pullback",
    "url": "https://nulltx.com/world-coin-wld-surges-to-new-all-time-high-before-slight-pullback/",
    "description": "The AI token, World Coin (WLD), witnessed an impressive surge yesterday, climbing by over 40% to achieve a new all-time high at $7.965. This remarkable price increase reflects the growing interest and optimism surrounding the Worldcoin project. Worldcoin has garnered significant attention from investors, having raised a substantial total of [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-20T21:46:32.000Z",
    "title": "Celsius CEO selects Bankman-Fried lawyers for upcoming trial",
    "url": "https://crypto.news/celsius-ceo-sam-bankman-fried-lawyers/",
    "description": "Former Celsius CEO Alex Mashinsky has chosen to be represented by the same legal team as FTX’s Sam Bankman-Fried against allegations of wire fraud and artificially inflating the company’s token value."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-20T21:41:07.000Z",
    "title": "Optimism’s fourth airdrop distributed nearly $41m in tokens",
    "url": "https://crypto.news/optimism-airdrop-41-million-tokens/",
    "description": "Layer 2 network Optimism unveiled its fourth airdrop, targeting web3 artists with a generous distribution of over 10 million OP tokens, valued at approximately $40.8 million."
  }
]