[
  {
    "source": "Cointelegraph",
    "date": "2023-08-13T23:00:03.000Z",
    "title": "An ETF will bring a revolution for Bitcoin and other cryptocurrencies",
    "url": "https://cointelegraph.com/news/etf-revolution-bitcoin-cryptocurrencies",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/bf6ff07a-e7e3-4961-8c5a-d96934e197e3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A Bitcoin ETF is on the cusp of receiving approval in the United States — and it may not be long before we see one in Hong Kong or elsewhere in Asia.</p>\n                    <p><p>But not everyone’s on board with the crypto ETF train. Critics argue that Bitcoin-linked ETFs could be even worse than centralized exchanges for the crypto market. Their main beef? There’s zero possibility of withdrawing the underlying instrument. This means the holders are never able to take advantage of the single most important feature of Bitcoin: the ability to control their funds without a need to trust anyone.</p><p>And it’s not just talk. The potential of these investment vehicles is already being realized in markets like Canada. The Purpose Bitcoin ETF, for example, raked in over $400 million in assets under management <a href=\"https://cointelegraph.com/news/north-america-s-first-bitcoin-etf-sees-explosive-debut-with-564m-in-assets\">within just two days of its launch</a>. It’s no longer a question of whether crypto is an asset class.</p><p>It’s like a starter pistol has been fired, and the institutional investors are off to the races, setting the stage for a seismic shift in the financial landscape, with crypto ETFs as the starting block.</p><h2>Crypto ETFs unleash a domino effect</h2><p>ETFs are a huge business. BlackRock alone <a href=\"https://www.bloomberg.com/news/articles/2023-07-13/blackrock-fidelity-and-invesco-race-to-become-first-spot-bitcoin-etf\" target=\"_blank\" rel=\"noopener nofollow\">managed</a> circa $3 trillion in client assets in ETFs at the end of March 2023 across a range of stocks, bonds and commodities.</p><p>The approval of crypto ETFs indicates more than just mainstream acceptance — it can drive market maturity, establish price stability and foster innovation, leading to the creation of ETFs for a broader range of digital assets and decentralized finance (DeFi) tokens, similar to how the approval of the first ETF in 1993 led to a diverse range of ETFs today.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blacks-misguided-crypto-dummies-etf\"><strong><em>BlackRock’s misguided effort to create ‘Crypto for Dummies’</em></strong></a></p><p>But not everyone’s on board with the crypto ETF train. Critics argue that Bitcoin-linked ETFs could be even worse than centralized exchanges for the crypto market. Their main beef? There’s zero possibility of withdrawing the underlying instrument. This means the holders are never able to take advantage of the single most important feature of Bitcoin: the ability to control their funds without a need to trust anyone.</p><p>With the potential to become as mainstream as their stock or bond counterparts, crypto ETFs could usher in a diverse range of investors. But the real disruptive element? Institutional-grade custody.</p><h2>Race for crypto ETFs fuels the impetus for institutional custody</h2><p>To be clear, it’s not just the custody technology that is disruptive but also the investor protection standards imposed on licensed custodians. As traditional financial institutions take the plunge and launch crypto-related trading products in the United States, the demand for institutional-grade custody solutions is skyrocketing. Early August alone saw <a href=\"https://cointelegraph.com/news/asset-managers-file-ethereum-futures-etf-applications\">six major asset managers</a> file applications to launch Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) futures ETFs to U.S. customers.</p><p>BlackRock’s expansion into crypto this past year has been bolstered by its partnership with Coinbase, which, <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-filing-coinbase-surveillance-partner\">according to filings</a>, would be in charge of safekeeping the Bitcoin in the BlackRock ETF and provide market surveillance to reduce fraud and market manipulation. </p><p>The crypto custody market itself is expanding rapidly. According to Markets and Markets, the crypto custody market was worth an <a href=\"https://s201.q4cdn.com/666322591/files/doc_downloads/2023/05/Tech-Talk-4-Crypto-Custody.pdf\" target=\"_blank\" rel=\"noopener nofollow\">estimated</a> $223 billion in January 2022, up from $32 billion in January 2019. And it’s not slowing down anytime soon, with estimates predicting a compound annual growth rate of 26.7% through 2028.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-etfs-even-worse-for-crypto-than-central-exchanges\"><strong><em>Bitcoin ETFs: Even worse for crypto than central exchanges</em></strong></a></p><p>The complexity and risk associated with a broader range of digital assets necessitate robust custodial services. As we transition into Custody 3.0 — an era characterized by active participation in the decentralized economy — these services are evolving to include connectivity to on-chain services and DeFi applications. The key for digital asset custodians is to build on existing infrastructure and offer comprehensive services to monetize digital assets within a high-standard operational framework.</p><p>In this context, fully licensed digital asset custodians become trusted partners, enabling financial institutions to integrate digital assets into their business operations in a safe, scalable, compliant manner.</p><h2>Regulatory hurdles and triumphs</h2><p>It’s been a brutal stretch for the crypto industry since the market peak in late 2021, but the frenzy of crypto ETF filings from Wall Street’s biggest names has shown that this corner of the market is generating attention.</p><p>Regulation remains the biggest hurdle in the United States. Various fund companies have been trying for years to get crypto ETFs approved, only to be rejected over concerns of fraud and market manipulation.</p><p>But it’s not all gloom on the regulatory front. Outside of the U.S., we’re seeing a global trend toward clearer regulatory frameworks for digital assets. It’s like a regulatory domino effect, paving the way for the creation of strategic digital asset hubs in locations such as Singapore,<a href=\"https://cointelegraph.com/news/hong-kong-uae-central-banks-collab-crypto-rules\"> Hong Kong, the United Arab Emirates</a> and <a href=\"https://cointelegraph.com/news/eu-s-new-crypto-law-how-mica-can-make-europe-a-digital-asset-hub\">Europe</a>. The implementation of these frameworks will not only accommodate the growth and diversity of the crypto market but also increase transparency and investor protection, benefiting both the industry and its participants. And as they become more robust, they’re laying the groundwork for investment vehicles like crypto ETFs, further fuelling institutional demand.</p><p>With <a href=\"https://cointelegraph.com/news/crypto-hong-kong-debuts-retail-crypto-trading-with-hash-key-exchange\">Hong Kong recently debuting</a> retail crypto trading via licensed exchanges, it may not be long before we see the first spot crypto ETF in Asia.</p><h2>Gradually, then suddenly</h2><p>The domino effect triggered by crypto ETFs is not just a shift — it’s a revolution. It’s an impending transformation that will redefine the financial landscape. And it’s not just about money. It’s about the potential for a more inclusive, transparent and efficient financial system that paves the way for broader market access.</p><p>So, the question is not whether to embrace the crypto revolution to get ahead but rather how to do so effectively or risk getting left behind. The dominos are falling. The time to act is now.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Calvin Shen</strong> has more than 10 years of financial services and investment experience across fintech startups and asset management. As the managing director at Hex Trust, Shen works closely with clients globally to provide bespoke blockchain and custody solutions to help them bridge the worlds of digital assets and traditional finance. Prior to joining Hex Trust, Calvin held numerous roles across institutional sales and business development at leading firms such as PIMCO, Figure Technologies, Deloitte and BNY Mellon. He holds an MBA from Columbia Business School and a BA in economics from UC San Diego, and is a CFA and CAIA charterholder.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-13T23:06:58.000Z",
    "title": "Oman takes a significant leap forward with Proposed 2023 Digital Asset Laws",
    "url": "https://www.cryptopolitan.com/oman-proposes-2023-digital-asset-laws/",
    "description": "The Capital Market Authority (CMA) of Oman is finalizing a comprehensive framework to regulate digital assets and virtual asset service providers (VASPs) in the country. The CMA recently published a consultation paper outlining key aspects of the proposed regulations. The framework aims to provide a platform for digital asset issuance and investment while mitigating risks. ... <a title=\"Oman takes a significant leap forward with Proposed 2023 Digital Asset Laws\" class=\"read-more\" href=\"https://www.cryptopolitan.com/oman-proposes-2023-digital-asset-laws/\" aria-label=\"More on Oman takes a significant leap forward with Proposed 2023 Digital Asset Laws\">Read more</a>"
  }
]