[
  {
    "source": "Cointelegraph",
    "date": "2024-04-08T04:43:59.000Z",
    "title": " Paraguay’s proposed Bitcoin mining ban could cost it $200M a year ",
    "url": "https://cointelegraph.com/news/paraguays-proposed-bitcoin-mining-ban-cost-200-million-per-year",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvNDBmMjE4YTItM2ZkYi00MTEyLTg1NzEtNmU1MGM0YTA3OWZhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin mining has provided a “positive contribution to Paraguay’s trade balance,” and a ban could dent the economy, argues Hashlabs Mining’s co-founder. </p>\n                    <p><p>The Paraguayan economy could lose more than $200 million annually if the country’s lawmakers pass a recently introduced bill to ban crypto mining in the country.</p><p>Lawmakers introduced the draft bill on April 4, claiming illegal <a href=\"https://cointelegraph.com/news/paraguay-draft-temporary-crypto-mining-ban-power-grid-failures\">cryptocurrency mines are stealing power</a> and disrupting the country’s electricity supply. If passed, the ban would last 180 days or until new laws are enacted and the national power grid operator can ensure it can supply sufficient energy. </p><p>But a ban on lawful miners operating in the region could prove costly for the South American country, according to Hashlabs Mining’s co-founder and chief mining strategist Jaran Mellerud, who recently spoke with Cointelegraph:</p><p><a href=\"https://cointelegraph.com/news/paraguays-proposed-bitcoin-mining-ban-cost-200-million-per-year\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-08T04:57:13.000Z",
    "title": "Bitcoin Price Hints At Potential Correction, Buy The Dip?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-correction-68800/",
    "description": "Bitcoin price is showing a few positive signs above the $68,500 resistance. BTC must settle above the $70,000 resistance to continue higher in the near term. Bitcoin is eyeing a steady increase above $69,500 and $70,000 levels. The price is trading above $68,000 and the 100 hourly Simple moving average. There is a key bullish trend line forming with support near $68,800 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start another increase if it stays above the $68,000 support zone. Bitcoin Price Holds Support Bitcoin price started a decent increase above the $67,500 resistance zone. BTC cleared the $68,500 and $68,800 resistance levels to move into a positive zone. The price even spiked above the $70,000 resistance zone. A high was formed near the $70,300 level and the price is now correcting gains. There was a move below the $70,000 level. There was a move below the 23.6% Fib retracement level of the upward move from the $65,116 swing low to the $70,300 high. Bitcoin is now trading above $68,000 and the 100 hourly Simple moving average. Immediate resistance is near the $69,800 level. The first major resistance could be $70,000. Source: BTCUSD on TradingView.com The next resistance now sits at $70,300. If there is a clear move above the $70,300 resistance zone, the price could start a fresh increase. In the stated case, the price could rise toward $71,200. The next major resistance is near the $72,000 zone. Any more gains might send Bitcoin toward the $73,500 resistance zone in the near term. Are Dips Limited In BTC? If Bitcoin fails to rise above the $70,000 resistance zone, it could start a downside correction. Immediate support on the downside is near the $69,000 level or the trend line. The first major support is $67,800 or the 50% Fib retracement level of the upward move from the $65,116 swing low to the $70,300 high. The next support sits at $66,500. If there is a close below $66,500, the price could start a drop toward the $65,350 level. Any more losses might send the price toward the $62,500 support zone in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now near the 50 level. Major Support Levels – $68,800, followed by $67,800. Major Resistance Levels – $69,800, $70,000, and $71,200."
  }
]