[
  {
    "source": "Cointelegraph",
    "date": "2023-11-16T19:30:00.000Z",
    "title": "Vivek Ramaswamy unveils crypto policy platform criticizing mixer sanctions",
    "url": "http://cointelegraph.com/news/vivek-ramaswamy-unveils-cryptocurrency-policy-platform-criticizing-mixer-sanctions",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/6444541d-2600-4052-9c23-8a8c6a554453.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Republican candidate claimed that mixers are protected by the U.S. Constitution’s First Amendment.</p>\n                    <p><p>Republican U.S. Presidential candidate Vivek Ramaswamy unveiled a crypto policy framework on November 16 at the North American Blockchain Summit (NABS) in Fort Worth, Texas. </p><p>Called, “The Three Freedoms of Crypto,” the framework states that developers of smart contract code should not be held liable for the actions of people who use the code. </p><p>In the document, Ramaswamy vowed to “direct government prosecutors to prosecute bad actors, not the code they use and not the developers who write that code,” if elected President. In an accompanying speech, Ramaswamy specifically targeted sanctions against crypto mixer Tornado Cash, stating “the case brought against the Tornado Cash folks, for example … you can’t go after the developers of code.”</p><p>In the document, Ramaswamy also promised to provide regulatory clarity that gives new cryptocurrencies “safe harbor” exemptions from securities laws for a period of time after they are launched and to prevent any federal agency from creating rules that limit the use of self-hosted wallets.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">.<a href=\"https://twitter.com/VivekGRamaswamy?ref_src=twsrc%5Etfw\">@VivekGRamaswamy</a> is a U.S. presidential candidate with a pro-crypto policy<br><br>These are his 'Three Planks' of crypto protection that, if elected, he plans to implement in the United States <a href=\"https://t.co/hT9sAyUFS7\">pic.twitter.com/hT9sAyUFS7</a></p>— Bankless (@BanklessHQ) <a href=\"https://twitter.com/BanklessHQ/status/1725174387127751071?ref_src=twsrc%5Etfw\">November 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Tornado Cash and other crypto mixers allow users to deposit crypto and have it sent to a different address than the one they deposit with. But in the process, it is mixed with other users’ crypto. This effectively obscures the identity of the person receiving the funds. </p><p>In August, 2022, Tornado Cash was <a href=\"https://cointelegraph.com/news/us-treasury-sanctions-usdc-and-eth-addresses-connected-to-tornado-cash\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-treasury-sanctions-usdc-and-eth-addresses-connected-to-tornado-cash/amp\">sanctioned by the US Government</a> on the grounds that it was being used to facilitate money laundering. Critics of this decision have long argued that sanctioning Tornado Cash was a violation of freedom of speech, as it applied to the code itself rather than a person or group of persons operating an enterprise.</p><p>In his speech, Ramasway agreed with the critics, claiming that sanctions against mixers violate the First Amendment, stating:</p><blockquote>“I believe that code is a form of speech and is protected by the First Amendment. So when you take an example, like the case brought against the Tornado Cash folks for example, put aside the specifics of whether what was done is right or wrong. You can't go after the developers of code. What you actually need to implement is going after individual bad actors that are breaking the laws that already exist on the books.”</blockquote><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/vivek-ramaswamy-grayscale-win-path-for-bitcoin-innovation\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/vivek-ramaswamy-grayscale-win-path-for-bitcoin-innovation/amp\"><strong>Vivek Ramaswamy: Grayscale win ‘clears a path’ for Bitcoin innovation</strong></a></p><p>According to RealClearPolitics, the latest Republican Presidential Primary polls for New Hampshire show Ramaswamy in third or fourth place, behind Donald Trump, Nikki Haley, and possibly Ron DeSantis, depending on which poll is consulted. He is currently getting between 0% and 8% of the Republican vote, according to these November 16 polls. Ramaswamy announced on May 21 that he <a href=\"https://cointelegraph.com/news/us-presidential-candidate-vivek-ramaswamy-to-accept-bitcoin-for-campaign-donations\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-presidential-candidate-vivek-ramaswamy-to-accept-bitcoin-for-campaign-donations/amp\">would accept Bitcoin campaign donations</a>.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-16T19:18:19.000Z",
    "title": "Polkadot (DOT) and Chainlink (LINK) Set on Different Courses But One Might Get Trapped",
    "url": "https://cryptodaily.co.uk/2023/11/polkadot-dot-and-chainlink-link-set-on-different-courses-but-one-might-get-trapped",
    "description": "Explore the intriguing paths of Polkadot (DOT) and Chainlink (LINK) as they navigate through the complex cryptocurrency terrain. Our insightful analysis examines their contrasting trajectories, with DOT displaying resilience and LINK facing market challenges. Gain a deeper understanding of their recent performance, technical indicators, and market sentiment, offering a well-rounded perspective on their potential future directions. Keep abreast of the crypto world with our expert analysis, equipping you to make informed decisions amidst the twists and turns of this dynamic and often unpredictable market."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-16T19:32:12.000Z",
    "title": "Dubai’s chief crypto regulator exits as VARA prepares to fine major companies",
    "url": "https://crypto.news/dubais-chief-crypto-regulator-exits-as-vara-prepares-to-fine-major-companies/",
    "description": "Dubai's VARA CEO Henson Orser resigns amid impending fines on non-compliant crypto firms."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-16T19:20:26.000Z",
    "title": "Analyst shares recommendations to invest in crypto on a budget",
    "url": "https://crypto.news/analyst-shares-recommendations-to-invest-in-crypto-on-a-budget/",
    "description": "Turning an initial investment of a few hundred dollars into thousands is realistic over 1-2 years as the crypto market recovers, according to one analyst."
  }
]