[
  {
    "source": "CoinDesk",
    "date": "2023-09-29T12:47:11.000Z",
    "title": "Gemini to Cease Offering Crypto Services in Netherlands in November",
    "url": "https://www.coindesk.com/policy/2023/09/29/gemini-to-cease-offering-crypto-services-in-netherlands-in-november/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Gemini said it is taking the step \"due to requirements imposed by the De Nederlandsche Bank (DNB),\""
  },
  {
    "source": "Decrypt",
    "date": "2023-09-29T12:59:04.000Z",
    "title": "OpenTrade Launches Tokenized Treasury Bills on Protocol Developed by Circle",
    "url": "https://decrypt.co/199291/opentrade-launches-tokenized-treasury-bills-on-protocol-developed-by-circle",
    "description": "For every tokenized t-bill an investor purchases, OpenTrade will be buy an actual treasury bill and provide an on-chain identifier it."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-29T13:00:44.000Z",
    "title": "Record highs in Bitcoin’s long-term holder supply signal market confidence",
    "url": "https://cryptoslate.com/record-highs-in-bitcoins-long-term-holder-supply-signal-market-confidence/",
    "description": "<p>Bitcoin&#8217;s long-term holders are addresses that have held onto their Bitcoin for over 155 days. And while 155 days might not sound like a lot of time in the context of Bitcoin, addresses that have held onto their assets for longer than that have a statistically lower chance of selling their BTC. Therefore, the actions [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/record-highs-in-bitcoins-long-term-holder-supply-signal-market-confidence/\">Record highs in Bitcoin’s long-term holder supply signal market confidence</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-29T12:47:56.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Above $27,000, ETH Reaches 1-Month High ",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-above-27000-eth-reaches-1-month-high/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1401474077-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis:BTC Above $27,000, ETH Reaches 1-Month High \" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1401474077-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1401474077-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1401474077-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1401474077-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1401474077-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1401474077-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1401474077.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin continued to trade above the $27,000 level on Friday, after a surge beyond this point towards the end of yesterday&#x2019;s session. Ethereum rallied to a one-week high. Bitcoin Bitcoin remained above the $27,000 level on Friday, following a late rise in bullish sentiment towards the end of Thursday&#x2019;s session. Following a low of $26,424.95 [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T13:02:52.000Z",
    "title": "U.S. Democrat advocates for centralized record-keeping of off-chain crypto transactions",
    "url": "https://www.cryptopolitan.com/u-s-democrat-advocates-for-centralized-record-keeping-of-off-chain-crypto-transactions/",
    "description": "U.S. Rep. Don Beyer, a Democrat from Virginia, is spearheading legislation to bring transparency to off-chain crypto transactions. The proposed bill seeks to compel major crypto exchanges to share their internal transaction data with centralized repositories. This move is designed to allow regulatory bodies like the Commodity Futures Trading Commission (CFTC) and the Securities and ... <a title=\"U.S. Democrat advocates for centralized record-keeping of off-chain crypto transactions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/u-s-democrat-advocates-for-centralized-record-keeping-of-off-chain-crypto-transactions/\" aria-label=\"More on U.S. Democrat advocates for centralized record-keeping of off-chain crypto transactions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T12:55:07.000Z",
    "title": "AI Race Intensifies as France and UK Compete for Global Dominance",
    "url": "https://www.cryptopolitan.com/ai-race-intensifies-france-uk-compete/",
    "description": "In a bid for supremacy in the rapidly advancing field of artificial intelligence, French billionaire Xavier Niel, chairman of the Iliad group, has set the stage for an intense competition by announcing the hosting of a groundbreaking AI conference in Paris. Simultaneously, across the English Channel, the United Kingdom is gearing up for its own ... <a title=\"AI Race Intensifies as France and UK Compete for Global Dominance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-race-intensifies-france-uk-compete/\" aria-label=\"More on AI Race Intensifies as France and UK Compete for Global Dominance\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T12:53:55.000Z",
    "title": "UAE issues stablecoin and new digital asset regulations and legislation",
    "url": "https://www.cryptopolitan.com/uae-issues-stablecoin-and-new-digital-asset-regulations-and-legislation/",
    "description": "In the last week of September, two huge regulatory entities, the Dubai virtual assets regulatory authority and DIFC (Dubai International Financial Center) in the UAE announced updates in their crypto regulations, targeting digital assets, security tokens and stablecoins. Dubai’s Virtual asset regulatory authority (VARA) updated its virtual asset rulebook and added new regulations with regards ... <a title=\"UAE issues stablecoin and new digital asset regulations and legislation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uae-issues-stablecoin-and-new-digital-asset-regulations-and-legislation/\" aria-label=\"More on UAE issues stablecoin and new digital asset regulations and legislation\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-09-29T13:00:04.000Z",
    "title": "The Path To Riches Is Paved With Avalanche (AVAX) And Bitcoin Spark (BTCS)",
    "url": "https://nulltx.com/the-path-to-riches-is-paved-with-avalanche-avax-and-bitcoin-spark-btcs/",
    "description": "The primary reason many people get into the crypto space is to build riches, and these cryptocurrencies, Avalanche(AVAX) and Bitcoin Spark (BTCS) have emerged as two contenders, each having unique features and potential for those seeking the path to riches. This content examines AVAX and BTCS&#8217;s prospects and current events. Avalanche Recovery (AVAX) Avalanche, AVAX, [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-29T12:50:30.000Z",
    "title": "Fireblocks acquires Australian defi startup BlockFold for $10m",
    "url": "https://crypto.news/fireblocks-acquires-australian-defi-startup-blockfold-for-10m/",
    "description": "Blockchain company Fireblocks, which is backed by Sequoia Capital, has acquired BlockFold for a reported $10 million"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-29T13:00:52.000Z",
    "title": "Important Events That Could Have A Massive Impact On XRP Price",
    "url": "https://www.newsbtc.com/analysis/xrp/events-impact-on-xrp-price/",
    "description": "Despite some analysts noting why XRP is unlikely to end on a high, certain macro (and micro) factors could significantly impact the token’s price and possibly see it enjoy the same trajectory it did following Judge Analisa Torres’ ruling in favor of Ripple.  SEC-Related Factors Could Impact XRP Price On August 17, the US Securities and Exchange Commission (SEC) was given approval by Judge Analisa Torres to file its motion seeking an interlocutory appeal against her ruling at the Court of Appeals.  Related Reading: IPO Frenzy: What Happens To XRP Price If Ripple Stock Climbs To $600? However, this wasn’t an approval of the SEC’s appeal, and that is something that everyone in the XRP community is currently anticipating, as the court can either choose to accept or reject the appeal after considering the grounds for appeal and whether it meets the requirements needed to allow it. As a former SEC official Marc Fogel noted, the specific requirements for an interlocutory appeal are “hard to meet,” and the odds seem to be against the SEC. As such, the court is expected to deny the SEC’s request for an interlocutory appeal. If that happens, we could see XRP again enjoy most of the gains it saw following Judge Torres’ ruling when the token’s market cap rose significantly, overtaking Binance’s BNB to become the fourth-largest crypto by market cap (although it has dropped back to 5th). Another factor that could spark an upward trend for XRP is if a settlement between Ripple and the SEC becomes more feasible. Stakeholders in the crypto community have commented on the possibility of this happening and factors that could prompt both parties to settle. Pro-XRP legal expert John Deaton once stated that a settlement could happen this year if Judge Failla granted Coinbase’s motion to dismiss the SEC’s lawsuit against it. If that were to happen, the Judge would likely be adopting Judge Torres’ ruling that programmatic sales do not constitute investment contracts and crypto tokens bought through exchanges cannot be labeled as one.  It is believed that this could force the SEC into settling as it will become more established (especially if its interlocutory appeal was rejected alongside) that it doesn’t have jurisdiction over token sales on exchanges as they do not constitute investment contracts.  Related Reading: Analyst Presents 4 Charts That Prove Crypto Is Not Dead A more interesting factor that could force the SEC into a settlement is the revelations (and future ones) being made about the ETH Gate. As a form of damage control, the Commission could propose a settlement with Ripple rather than dragging the case to trial, where its credibility could be jeopardized.  The SEC proposing a settlement (not necessarily in the public eye) will be considered a major win for Ripple. It could restore investors’ confidence in the ecosystem, leading to a price increase in the XRP token.  XRP continues the recovery trend to rest above $0.51 &#124; Source: XRPUSD on Tradingview.com Ripple’s Expansion Plans Ripple has proven not to be deterred by the long-running battle against the SEC as the crypto firm has continued to build amidst it. In fact, the company’s President, Monica Lang, recently mentioned that the court case (following Judge Torres’ ruling) has helped them to expand their business not just in the US but “even more globally.” According to her, the ruling gave the company much-needed clarity, especially amid regulatory uncertainty. With this in mind, the company can map out a proper framework going forward, bearing in mind that Judge Torres had ruled that XRP isn’t a security in itself. On the back of Judge Torres’ ruling, Ripple’s general counsel Stuart Alderoty had revealed to CNBC in an interview that Ripple could potentially begin talks with US financial firms about them adopting Ripple’s On-Demand Liquidity (ODL) product, which can be used to facilitate cross-border transactions.  Related Reading: Ripple CTO Addresses Bitcoin Adviser’s Claims That XRP Is Centralized If this were to happen, it would undoubtedly represent a bullish signal for the XRP community. Although Ripple and XRP have enjoyed outstanding success overseas (especially in Asia), many still believe that more work needs to be done to penetrate the American market. Therefore, a move like that could convince investors of the great strides the company is making in America. Meanwhile, there are also rumors of Ripple going public. Ripple is set to hold its “proper victory party” on September 29 in New York, and many in the XRP community speculate that the crypto firm could announce its initial public offering (IPO) plans at the event. Such an announcement will be huge and could generate more buzz and interest in the company, with XRP’s price being a beneficiary of this news. XRP is currently trading at $0.50, up by close to 2% in the last twenty-four hours as anticipation towards the party builds up.  Featured image from Finbold, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-29T13:00:30.000Z",
    "title": "Disappointing Dogecoin Performance Leads Investors To Bitcoin Spark",
    "url": "https://www.crypto-news-flash.com/disappointing-dogecoin-performance-leads-investors-to-bitcoin-spark/?utm_source=rss&utm_medium=rss&utm_campaign=disappointing-dogecoin-performance-leads-investors-to-bitcoin-spark",
    "description": "<img width=\"512\" height=\"362\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-174.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-174.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-174-300x212.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />It&#8217;s no news that the cryptocurrency market is highly volatile, but one of the more significant recent shocks has been the performance of Dogecoin. While Dogecoin, often known as DOGE, created waves with its meme-inspired origins, investors have been looking elsewhere, and one significant alternative is Bitcoin Spark (BTCS). Let&#8217;s look at what&#8217;s causing Dogecoin&#8217;s [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-29T13:07:00.000Z",
    "title": "SOL Escapes a Negative Trend but Is Not Out of the Woods Yet",
    "url": "https://coinedition.com/sol-escapes-a-negative-trend-but-is-not-out-of-the-woods-yet/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/Solana-Chain-Mints-NFTs-Record.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SOL Escapes a Negative Trend but Is Not Out of the Woods Yet\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/Solana-Chain-Mints-NFTs-Record.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/Solana-Chain-Mints-NFTs-Record-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/Solana-Chain-Mints-NFTs-Record-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/Solana-Chain-Mints-NFTs-Record-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/Solana-Chain-Mints-NFTs-Record-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/Solana-Chain-Mints-NFTs-Record-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/Solana-Chain-Mints-NFTs-Record-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/Solana-Chain-Mints-NFTs-Record-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/Solana-Chain-Mints-NFTs-Record-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/Solana-Chain-Mints-NFTs-Record-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/Solana-Chain-Mints-NFTs-Record-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/Solana-Chain-Mints-NFTs-Record-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/Solana-Chain-Mints-NFTs-Record-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/Solana-Chain-Mints-NFTs-Record-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/Solana-Chain-Mints-NFTs-Record-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/Solana-Chain-Mints-NFTs-Record-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The analyst Blunts revealed in a X post today that SOL is in an interesting situation. SOL was attempting to escape a negative trend but was also bouncing off of a long-term positive trend line. At press time, CoinMarketCap indicated that SOL was one of the best performers in the top 10 list. The cryptocurrency [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sol-escapes-a-negative-trend-but-is-not-out-of-the-woods-yet/\">SOL Escapes a Negative Trend but Is Not Out of the Woods Yet</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]