[
  {
    "source": "CoinDesk",
    "date": "2024-03-27T02:00:00.000Z",
    "title": "NEAR Launches Multichain Transaction From One Account Feature",
    "url": "https://www.coindesk.com/business/2024/03/27/near-launches-multichain-transaction-from-one-account-feature/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Chain signatures allow users to transact on any network from one account."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-27T02:00:58.000Z",
    "title": "Bitcoin’s ‘Next Leg Higher Has Started,’ Says Analyst: Reveals $100,000 Target On The Horizon",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-next-leg-higher-has-started-says-analyst/",
    "description": "Jelle, a well-regarded crypto analyst, recently shared via the latest post on X that Bitcoin is on the verge of a significant upward movement, potentially reaching the $100,000 mark much sooner than many have anticipated. This optimistic prediction comes when Bitcoin has shown considerable resilience, bouncing back from various challenges and solidifying its position as a leading digital asset. Related Reading: Analyst Warns Of Bitcoin Pre-Halving Retrace Echoing Troubling 2020 Trend The Bitcoin Path To $100,000 Jelle&#8217;s assertion that Bitcoin is gearing up for a significant price rally to $100,000 is supported by recent market movements and the strategic positioning of investors within the ecosystem. The analyst&#8217;s confidence is rooted in observing Bitcoin&#8217;s market behavior, including establishing a new higher low and a push toward previous highs. Such patterns have historically preceded substantial gains for Bitcoin, making the $100,000 target seem increasingly attainable. The new higher low has locked in, and #Bitcoin is pushing back towards the highs. The next leg higher has started. $100,000 is a matter of time, imo. https://t.co/EA1TvcUlN5 pic.twitter.com/qt55a0Uy7f — Jelle (@CryptoJelleNL) March 26, 2024 This forecast is further bolstered by the market&#8217;s reaction to Bitcoin&#8217;s recent performance. Despite some volatility, the cryptocurrency has managed to reclaim and maintain a price point above $69,000. Mysterious Movements And Market Signals Adding to the intrigue surrounding Bitcoin&#8217;s potential surge is a mysterious on-chain activity involving one of the cryptocurrency&#8217;s dormant addresses. This address, the fifth richest Bitcoin wallet, suddenly sprang to life after years of inactivity, moving roughly $6 billion worth of Bitcoin. The transaction, executed over the weekend, divided the sum into smaller amounts distributed across new wallets. The 5th richest Bitcoin address just moved over $6 BILLION in BTC to three new addresses. 37X moved almost its ENTIRE BALANCE of 94.5K BTC ($6.05B) in the early hours of Saturday 23rd March, leaving only 1.4 BTC in the address. The 94.5K BTC had not been moved since 37X… pic.twitter.com/mAjpg0oqnD — Arkham (@ArkhamIntel) March 25, 2024 This activity has raised eyebrows within the crypto community, as large BTC wallets are typically linked to exchanges. Still, the lack of exchange-related activity and interactions with this particular wallet has led to speculation about its ownership and purpose. Related Reading: Bitcoin Price Surges Past $71,000: 4 Key Reasons Behind The Rally However, BTC&#8217;s ability to sustain its price above $69,000 in the days following this activity indicates that whoever is responsible for this mysterious activity might not have made any sell move. Meanwhile, Analyst Rekt Capital has recently drawn parallels between the current market conditions and the pre-halving phase of 2020, suggesting that Bitcoin may be poised for a similar growth trajectory as witnessed in previous cycles. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-27T01:42:53.000Z",
    "title": "Bitcoin Price Consolidates Above $70K As Bulls Prepare For More Gains",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-consolidates-70k/",
    "description": "Bitcoin price is consolidating gains above the $70,000 resistance zone. BTC could rally again if there is a move above the $71,500 resistance in the near term. Bitcoin price moved in a positive zone above the $66,500 level. The price is trading above $70,000 and the 100 hourly Simple moving average. There is a key bullish trend line forming with support at $68,500 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start another increase if it clears the $71,500 resistance zone. Bitcoin Price Regains Strength Bitcoin price started a decent increase above the $68,800 resistance zone. BTC climbed higher above the $69,500 and $70,000 resistance levels. Finally, the price tested the $71,500 resistance zone. A new weekly high was formed near $71,557 and the price is now consolidating gains. There was a minor decline below the 23.6% Fib retracement level of the upward move from the $66,811 swing low to the $71,557 high. However, the price remained stable above $69,000. Bitcoin is now trading above $70,000 and the 100 hourly Simple moving average. There is also a key bullish trend line forming with support at $68,500 on the hourly chart of the BTC/USD pair. The trend line is close to the 61.8%% Fib retracement level of the upward move from the $66,811 swing low to the $71,557 high. Source: BTCUSD on TradingView.com Immediate resistance is near the $70,800 level. The first major resistance could be $71,500. If there is a clear move above the $71,500 resistance zone, the price could continue to gain strength. In the stated case, the price could even clear the $72,500 resistance zone in the near term. The next key resistance sits at $73,500. Another Decline In BTC? If Bitcoin fails to rise above the $71,500 resistance zone, it could start another decline. Immediate support on the downside is near the $70,000 level. The first major support is $69,000. The next support sits at $68,500 and the trend line. If there is a close below $68,500, the price could start a drop toward the $67,000 level and the 100 hourly SMA. Any more losses might send the price toward the $66,000 support zone in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $68,500, followed by $67,000. Major Resistance Levels – $70,500, $71,500, and $73,500."
  }
]