[
  {
    "source": "Cointelegraph",
    "date": "2024-01-26T08:20:00.000Z",
    "title": " Algorand CEO’s hacked account dances into pole position ",
    "url": "https://cointelegraph.com/news/algorand-ceo-social-media-x-hacked-warning",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZDMxMGYxNDgtNTE5My00NzVhLWE5ZDQtNzUyZjYzNGFjNzlkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Some community members criticized Warden, saying she qualifies as an intern for the U.S. Securities and Exchange Commission.</p>\n                    <p><p data-ct-non-breakable=\"true\">The Algorand Foundation announced on X (formerly Twitter) that its CEO Staci Warden’s X account was compromised and asked its community to refrain from clicking links or responding to direct messages. </p><p>The hacker also used satire to allege Sun’s projects will be responsible for the next “major financial collapse in crypto.”</p><p data-ct-non-breakable=\"true\">Apart from these, the hacker also posted music on the account and changed Warden’s profile bio, alleging that the CEO drained six figures from the community and gaslighted them into thinking it was a hack. The hacker also changed Warden’s bio to purport that Warden had already exited Algorand Foundation and is now a “semi-professional pole dancer.”</p><p><a href=\"https://cointelegraph.com/news/algorand-ceo-social-media-x-hacked-warning\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T08:37:21.000Z",
    "title": "Bitcoin faces potential drop to $30,000, warns crypto investor",
    "url": "https://www.cryptopolitan.com/bitcoin-faces-potential-drop-to-30000/",
    "description": "Renowned crypto investor and partner at Placeholder, Chris Burniske, has predicted that Bitcoin (BTC) could see further declines in the coming months, potentially dropping to at least $30,000. Burniske, known for his insightful analysis of the crypto market, made this prediction in a recent post on social media platform X (formerly Twitter) on January 25. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-26T08:19:48.000Z",
    "title": "Bitcoin bulls rejoice as largest ETFs halt outflows – What does this mean for BTC? ",
    "url": "https://www.cryptopolitan.com/bitcoin-surges-as-largest-etfs-halt-outflows/",
    "description": "Bitcoin bulls are finding reason to rejoice as the largest exchange-traded funds (ETFs) have halted their outflows. This recent shift in market dynamics has sparked intrigue and speculation within the crypto community as enthusiasts and investors eagerly analyze the potential implications for Bitcoin (BTC). Bitcoin’s weekend performance As of this writing, the current value of [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-26T08:15:35.000Z",
    "title": "Bitcoin Price: Head Fund Manager Predicts ‘Opportunity Of The Year’ Soon",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-opportunity-of-the-year/",
    "description": "Charles Edwards, the founder of hedge fund Capriole Investments, offered an in-depth analysis of the Bitcoin market yesterday. His review offers a granular perspective on the aftermath of the historic ETF launches, the pivotal role of major players like Grayscale, and the interplay of market mechanics shaping Bitcoin&#8217;s trajectory. Bitcoin Market Summary: ETF Launch Edwards acknowledged the ETF launches as a pivotal moment, characterizing it as &#8220;ETF Mania.&#8221; He emphasized the hindsight realization that the ETF launch triggered a short-term &#8220;sell the news event.&#8221; Edwards elucidated, &#8220;A portion of this can be attributed to the Grayscale outflows of over $4B, approximately half of which was forced selling by the FTX bankruptcy estate and another couple billion likely to cover Grayscale’s debt obligations.&#8221; However, he projects a shift in the outflow rate from Grayscale, stating, &#8220;I expect the current rate of outflow will drop to a more sustainable trickle over the next few weeks (after another few billion out).&#8221; Edwards also highlighted the end of Grayscale’s multi-year lock-up period, allowing long-term investors to finally close their GBTC positions at market prices. Related Reading: $130M Silk Road Bitcoin Stash To Be Sold By US Government Regarding Blackrock and Fidelity ETFs, Edwards noted their significance, saying, &#8220;The brand names of these two behemoths in the traditional asset management space means every billion they bring in, adds an order of magnitude more credibility (and therefore flows) into Bitcoin and crypto as a whole.&#8221; BTC Technical Analysis In his high timeframe technicals (HTF) analysis, Edwards observed a strong rejection at mid-range resistance during the ETF launch. He pointed out, &#8220;The nearest HTF support at $35K would likely represent a great opportunity to get long for the 2024 Halving year (if we are lucky enough to get there).&#8221; Edwards also mentioned, &#8220;Alternatively, a strong close above $44K will likely see the trend continue to range highs ($60K).&#8221; For low timeframe technicals (LTF), he dissected the December/January consolidation and the $44K &#8220;fakeout&#8221; during the ETF launch. Edwards explained, &#8220;Fakeouts often resolve in price movements to the other side of the range, as we saw.&#8221; He added: Therefore, the most interesting price point locally is $41K. A daily close above $41K would likely represent a downtrend fakeout and a swift return to range high at $44K (+). If we simply wick into $41K and start trending back down, that would be a great risk-off trigger for a potential move lower toward $35K HTF support. Fundamentals: The Role Of On-Chain Data Edwards underscored the importance of fundamentals and on-chain data in understanding market dynamics. He introduced Capriole’s Bitcoin Macro Index, stating, &#8220;This Index includes over 50 of the most powerful Bitcoin on-chain, macro market and equities metrics combined into a single machine learning model. This is a pure fundamentals-only value investing approach to Bitcoin. Price isn’t an input.&#8221; Related Reading: Bitcoin Attracts Millions In Chinese Capital Despite Ban: Report According to him, fundamentals have entered a period of slowdown which aligned with the near top at the ETF launch. &#8220;That fundamental slowdown continues today with price down -20% from the highs in January so far,&#8221; Edwards remarked. Chart Of The Week The hedge fund manager also introduced the Advance-Decline (AD) Line as a chart of the week. He explained, &#8220;The AD Line is calculated as the cumulative sum through time of each day&#8217;s count of advances less declines.&#8221; Edwards highlighted its relevance, stating, &#8220;Today we are seeing the first such breakout since 2016.&#8221; He drew parallels between the AD Line&#8217;s breakout and Bitcoin&#8217;s historical performance, noting, &#8220;During these periods in 2013 and 2016, Bitcoin was also in a drawdown from all-time-highs (like today) and began two of its largest cyclical rallies in history.&#8221; The Opportunity Of The Year In conclusion, Edwards offered a nuanced outlook. He cautioned, &#8220;Bitcoin at $39-40K is not a screaming buy today.&#8221; However, he projected, &#8220;The opportunity of the year likely awaits in the $32-35K region, which if we are lucky enough to see, will probably be the last time we ever see it.&#8221; Edwards concluded with a forward-looking perspective, stating, &#8220;Pending that, we await patiently for a momentum breakout of $41K (aggressive) and $44K (conservative) for resumption of the meat of the primary 2024 trend. Up.&#8221; At press time, BTC traded at $40,003. Featured image created with DALL·E, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-26T08:32:26.000Z",
    "title": "Terra Classic’s Remarkable Rebound: LUNC Staking Surges After Recent Dip",
    "url": "https://www.crypto-news-flash.com/terra-classics-remarkable-rebound-lunc-staking-surges-after-recent-dip/?utm_source=rss&utm_medium=rss&utm_campaign=terra-classics-remarkable-rebound-lunc-staking-surges-after-recent-dip",
    "description": "<img width=\"1600\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/LUNA.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/LUNA.png 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/LUNA-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/LUNA-1200x675.png 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/LUNA-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/LUNA-1536x864.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/LUNA-150x84.png 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/LUNA-450x253.png 450w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />Terra Classic has printed a dramatic rebound in its staking ratio. LUNC price is in uncharted territories with hopes of a sustained recovery as well. Recently, Terra Classic&#8217;s native token, LUNC, experienced a remarkable rebound as the token&#8217;s staking ratio surged after a brief downturn that caused concerns among investors and stakers. LUNC’s Price Dip [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-26T08:15:00.000Z",
    "title": "Solana Ecosystem Booms With Memecoins, NFTs, DeFi, Gaming Apps",
    "url": "https://coinedition.com/solana-grows-rapidly-with-enhancements-analyst-insights/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/Solana-Ecosystem-Tokens-Surge-by-300-Over-the-Last-24-Hours.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Solana Grows Rapidly with Enhancements: Analyst Insights\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/Solana-Ecosystem-Tokens-Surge-by-300-Over-the-Last-24-Hours.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/Solana-Ecosystem-Tokens-Surge-by-300-Over-the-Last-24-Hours-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/Solana-Ecosystem-Tokens-Surge-by-300-Over-the-Last-24-Hours-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/Solana-Ecosystem-Tokens-Surge-by-300-Over-the-Last-24-Hours-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/Solana-Ecosystem-Tokens-Surge-by-300-Over-the-Last-24-Hours-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/Solana-Ecosystem-Tokens-Surge-by-300-Over-the-Last-24-Hours-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto influencer Altcoin Daily shared their thoughts on the growth of the Solana ecosystem in a post on X on January 15. At the onset of 2024, Solana boasts a plethora of NFT projects and infrastructure, memecoins, and Web3 gaming applications. In addition, Solana’s DeFi space and infrastructure have benefited from enhancements, contributing to the [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/solana-grows-rapidly-with-enhancements-analyst-insights/\">Solana Ecosystem Booms With Memecoins, NFTs, DeFi, Gaming Apps</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]