[
  {
    "source": "Decrypt",
    "date": "2024-01-25T22:06:36.000Z",
    "title": "Microsoft Cuts 1,900 Xbox and Activision Staff Amid Gaming Industry Crisis",
    "url": "https://decrypt.co/214331/microsoft-cuts-1900-xbox-activision-staff-amid-gaming-industry-crisis",
    "description": "Nearly 6,000 game industry employees have lost their jobs already in 2024, with Microsoft now responsible for nearly one-third of the cuts."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-25T21:40:22.000Z",
    "title": " Crypto energy use to increase over 30% by 2026, AI by even more ",
    "url": "https://cointelegraph.com/news/crypto-energy-use-increase-over-30-percent-2026-ai-even-more",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvN2EwYjY5NmYtYmE1NS00MDM2LWJmZGItMTQ1MTZjYmE4NGVhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The International Energy Agency expects AI’s energy consumption to skyrocket, but it still pointed the finger at crypto as an over-consumer.</p>\n                    <p><p>The world electricity market is undergoing profound changes as the industry leads the way in decarbonization and faces new consumption patterns. Cryptocurrency mining and artificial intelligence (AI) are expected to see big shifts in energy usage in coming years, according to the multinational intergovernmental International Energy Agency (IEA).</p><p>Not all the news about power consumption is bad, according to the IEA’s 2024 report, which <a href=\"https://iea.blob.core.windows.net/assets/ddd078a8-422b-44a9-a668-52355f24133b/Electricity2024-Analysisandforecastto2026.pdf\" target=\"_blank\" rel=\"noopener nofollow\">forecasts</a> usage through 2026. “Power generation is currently the largest source of carbon dioxide (CO2) emissions in the world, but it is also the sector leading the transition to net zero emissions,” the report said. Renewables will become the main sources of power in 2025.</p><p>The growth of consumption fell from 2.4% in 2022 to 2.2% in 2023 but is expected to rise to 3.4% through 2026. China and India will be major contributors to that growth.</p><p><a href=\"https://cointelegraph.com/news/crypto-energy-use-increase-over-30-percent-2026-ai-even-more\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-25T21:46:21.000Z",
    "title": "‘Britcoin’ moves to design phase, but final decision awaits",
    "url": "https://cryptobriefing.com/britcoin-design-phase-final-decision-awaits/?utm_source=feed&utm_medium=rss",
    "description": "Bank of England (BOE) is exploring the feasibility and design of a digital pound, dubbed 'Britcoin', but a final decision is pending."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-25T22:07:58.000Z",
    "title": "U.S. to auction off $130m in Bitcoin seized from Silk Road",
    "url": "https://www.cryptopolitan.com/us-to-sell-130m-in-bitcoin-from-silk-road/",
    "description": "Buckle up, folks, because the U.S. is rolling up its sleeves to dive into the digital treasure trove of the century. We&#8217;re talking about a whopping $130 million in Bitcoin, not just any Bitcoin, but ones with a backstory darker than your favorite espresso. Seized from the underbelly of the internet, the infamous Silk Road, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-25T22:04:30.000Z",
    "title": "Nigeria Central Bank sets bold 21% inflation reduction goal",
    "url": "https://www.cryptopolitan.com/nigeria-central-bank-sets-bold-21-inflation/",
    "description": "Nigeria&#8217;s Central Bank, under the leadership of Governor Olayemi Cardoso, has set a goal to reduce the nation&#8217;s inflation rate to approximately 21%. This ambitious target comes in response to the December inflation rate reaching 28.92%, marking the highest level in over 27 years. The Central Bank of Nigeria (CBN) plans to implement this through [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-25T21:50:25.000Z",
    "title": "SEC postpones approval of Grayscale’s Spot Ethereum ETF",
    "url": "https://www.cryptopolitan.com/sec-grayscales-spot-ethereum-etf/",
    "description": "The crypto sphere was on the edge of its seat, waiting for a green light from the SEC on Grayscale&#8217;s bold move to morph its Ethereum trust into a shiny new spot ETF. But, in a twist that had many spilling their morning coffee, the SEC hit the pause button, sending ripples of anticipation and [&#8230;]"
  }
]