[
  {
    "source": "Crypto Daily",
    "date": "2023-06-26T09:30:00.000Z",
    "title": "Has True Blockchain Interoperability Been Achieved?",
    "url": "https://cryptodaily.co.uk/2023/06/has-true-blockchain-interoperability-been-achieved",
    "description": "<p>Blockchain users could be forgiven for losing count of the number of different networks they interact with. As established blockchains such as Bitcoin and Ethereum experience limitations over the number of use cases they support and their scalability, crypto projects are looking to newer chains to support their activities. By building on alternative blockchains, projects can tap into the new capabilities they offer and benefit from faster transactions and lower processing costs.&nbsp;</p>\n<p>As a result, the number of blockchain networks competing for market share in industries like decentralized finance, gaming, metaverse, and other areas is growing. There is no single blockchain that has emerged as the platform for every type of use case, as each network comes with trade-offs. As a result, developers simply select the most appropriate blockchain for whatever it is they&rsquo;re trying to achieve.&nbsp;</p>\n<p>&nbsp;</p>\nThe Need For Interoperability\n<p>Given this reality, it has become clear that a solution for blockchain interoperability is imperative for all users. In a world where businesses of every shape and size are so reliant on collaboration, it&rsquo;s necessary to find a way for the different blockchains they use to safely interact with one another. By building interoperability, networks provide a more user-friendly experience, enabling frictionless sharing of data and smoother execution of transactions governed by smart contracts.&nbsp;</p>\n<p>With traditional software systems, the makers of those programs and applications strive for interoperability as they know it&rsquo;s beneficial for their users. For instance, imagine if it were not possible to send an email from a Gmail account to a Yahoo account. It would throw a massive spanner in the works of mass communication. As such, software has become highly integrated in many ways. Not only can we email any address from any provider, but we can also import our contacts into messenger software like Skype. In the enterprise world, software interoperability is even more important, allowing business workers to import data from Salesforce into Excel spreadsheets where it can be analyzed, for example.&nbsp;</p>\n<p>Blockchain networks recognize that use cases such as DeFi, healthcare, gaming, and digital identity cannot exist in siloes, and so interoperability has become a key goal of most projects. Luckily for blockchain users, a number of projects have made rapid progress in this area, enabling both data and digital assets to traverse across blockchain networks with remarkable ease.&nbsp;</p>\n<p>&nbsp;</p>\nHow Blockchain Interoperability Is Achieved\n<p>One of the most successful examples of blockchain interoperability is the Cosmos ecosystem, which bills itself as the &ldquo;Internet of blockchains&rdquo;. Within Cosmos, developers can access a wealth of applications and services built for distributed networks.&nbsp;</p>\n<p>Cosmos enables blockchain interoperability through its Inter Blockchain Protocol, known as IBC. It supports a suite of cross-chain applications and makes it possible for users to exchange data and digital assets freely across multiple supported blockchains, including Binance Chain and Crypto.org.&nbsp;</p>\n<p>IBC is best understood as an open-source protocol that works by relaying messages between independent blockchain networks, and linking them together. Because not every chain is IBC compatible, Cosmos has gotten around this with the introduction of a &ldquo;peg zone&rdquo; that&rsquo;s able to bridge zones within Cosmos to external blockchains such as Ethereum and Bitcoin. Cosmos also offers a software development kit that can be used by coders to create alternative versions of their dApps for different, compatible blockchains.&nbsp;</p>\n<p>Another blockchain that&rsquo;s following the ecosystem approach is Polkadot, which has developed a network of interoperable parachains that are linked to its central Relay Chain. Each of the parachains on Polkadot&rsquo;s network hosts its own, specific project or dApp, with some of the most interesting being Moonbeam, Centrifuge, Manta Network, and Parallel Finance. Each parachain is designed in a way that ensures optimal performance for the specific dApp it supports.&nbsp;</p>\n<p>To ensure scalability, Polkadot provides a common set of validators for every parachain within its ecosystem. By spreading transactions across its ecosystem of parachains, they can be processed faster. At the same time, because the parachains all share the same architecture, they all support cross-chain transactions.&nbsp;</p>\n<p>Polkadot is strongly supportive of developers too. It&rsquo;s possible to create a customized blockchain using Substrate that&rsquo;s natively compatible with all other chains on the Polkadot network.&nbsp;</p>\n<p>Horizen bills itself as the most secure, interoperable blockchain ecosystem supported by the most decentralized, multi-tier node infrastructure in the crypto industry. It enables interoperability between blockchains through a protocol called Zendoo, which uses a novel sidechain construction that&rsquo;s tailored to be compatible with Horizen&rsquo;s main chain while adapting to other blockchains. Secure, decentralized cross-chain communications are conducted via a sidechain that&rsquo;s enhanced with privacy-preserving zk-SNARK technology.&nbsp;</p>\n<p>With Zendoo, a Bitcoin-based protocol can operate with any other domain-specific blockchain or blockchain-like ecosystem, with the protocol only updated once to introduce the required mechanism for deploying sidechains that enable cross-chain transfers.&nbsp;</p>\n<p>One key advantage of Horizen&rsquo;s method is that Zendoo enables backward transfers to be verified by the main chain without the use of external certifiers or validators. In other words, the main chain does not monitor the sidechains and knows nothing about their internal structure, boosting security. Zendoo does this through the generation of recursive proofs of each sidechain state transition.&nbsp;</p>\n<p>Any discussion of blockchain interoperability should also mention the efforts of Chainlink, which is a Web3 platform that provides oracle services to smart contracts hosted on any blockchain network. Its primary focus is not so much on blockchain-to-blockchain interactions, but rather on enabling smart contracts to interact with real-world networks. It gives new industries access to any blockchain, enabling dApps to integrate with Web2 software and systems.&nbsp;</p>\n<p>Oracles play a key role in facilitating communication between blockchains and things that happen in the real world. For example, they allow blockchains to monitor traditional financial markets, and react to events such as sports results, the weather, and more. By enabling this kind of interoperability, Chainlink is emerging as a crucial link between blockchains and third-party data.&nbsp;</p>\n<p>&nbsp;</p>\nBlockchain Interoperability Is Crucial\n<p>The success of any dApp has long been tied to its ability to interact with the growing number of blockchain networks and legacy-based systems in the world. Blockchain interoperability is crucial because it lowers the barrier of entry, enabling more users to engage with protocols and conduct transactions freely.&nbsp;</p>\n<p>As blockchain interoperability has improved thanks to the efforts mentioned above, users now have multiple ways to move their data and assets across networks, making the dApps that use them much more flexible. Instead of being restricted to a single blockchain, smart contracts can now interact with almost any network and even tap into real-world data. Interoperability allows dApps to support more flexible use cases, helping to spur more widespread adoption of crypto in general.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n<p>&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-26T09:32:46.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s Solana price is $16.94 with a 24-hour trading volume of $130,897,839. Solana is down 2.19% in the last 24 hours. The current CoinMarketCap ranking is #10, with a live market cap of $1,273,881,101. It has a circulating supply of 394,890,490 SOL coins and the max. supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T09:36:47.000Z",
    "title": "Call of Duty Embraces Chainlink-Powered NFTs to Revolutionize Digital Ownership in Gaming",
    "url": "https://www.crypto-news-flash.com/call-of-duty-embraces-chainlink-powered-nfts-to-revolutionize-digital-ownership-in-gaming/?utm_source=rss&utm_medium=rss&utm_campaign=call-of-duty-embraces-chainlink-powered-nfts-to-revolutionize-digital-ownership-in-gaming",
    "description": "Call of Duty announces its Warzone Caldera including players&#8217; progression and other online services would shut down in three months.  Chainlink in response explains how NFTs could transform digital ownership in gaming with its ability to offer permanence.   A recent post by the Call of Duty team announced that Call of Duty®: Warzone™ Caldera would [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-26T09:26:28.000Z",
    "title": "Coinbase Paves the Way: Stellar Integration Unleashes Faster and Low-Cost USDC Transactions",
    "url": "https://www.crypto-news-flash.com/coinbase-paves-the-way-stellar-integration-unleashes-faster-and-low-cost-usdc-transactions/?utm_source=rss&utm_medium=rss&utm_campaign=coinbase-paves-the-way-stellar-integration-unleashes-faster-and-low-cost-usdc-transactions",
    "description": "Coinbase&#8217;s integration of USDC on the Stellar network enables faster and low-cost transactions, with near-instant speeds and settlement times as quick as 5 seconds. This collaboration expands access to the global digital dollar, allowing seamless conversion between fiat cash and USDC through partnerships with Moneygram, Coinme, and supporting wallets across over 180 countries. Coinbase, a [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-26T09:15:46.000Z",
    "title": "New Capital Will Soon Arrive to Crypto Markets Following BlackRock ETF Filing, According to Macro Guru Raoul Pal",
    "url": "https://dailyhodl.com/2023/06/26/new-capital-will-soon-arrive-to-crypto-markets-following-blackrock-etf-filing-according-to-macro-guru-raoul-pal/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Investors-Snap-Up.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Investors-Snap-Up.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Investors-Snap-Up.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Investors-Snap-Up.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Investors-Snap-Up.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Investors-Snap-Up.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/Crypto-Investors-Snap-Up.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Real Vision founder and macro guru Raoul Pal says that BlackRock&#8217;s Bitcoin (BTC) exchange-traded fund (ETF) filing is a potential catalyst that could lead to fresh capital flowing into the crypto markets.  Earlier this month, the world’s largest asset manager filed for the registration of the iShares Bitcoin Trust designed to give investors exposure to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/26/new-capital-will-soon-arrive-to-crypto-markets-following-blackrock-etf-filing-according-to-macro-guru-raoul-pal/\">New Capital Will Soon Arrive to Crypto Markets Following BlackRock ETF Filing, According to Macro Guru Raoul Pal</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]