[
  {
    "source": "CoinDesk",
    "date": "2023-08-07T14:14:23.000Z",
    "title": "Bitcoin Remains King While Crypto Hedge Funds Get Rekt",
    "url": "https://www.coindesk.com/markets/2023/08/07/bitcoin-remains-king-while-crypto-hedge-funds-get-rekt/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Even though crypto hedge funds managed positive returns during the first half of 2023, bitcoin trounced them, according to a 21e6 Capital report."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-07T14:30:04.000Z",
    "title": "Curve Finance opens $1.85M bounty to public for help recovering funds after DeFi exploits",
    "url": "https://cryptoslate.com/curve-finance-opens-1-85m-bounty-to-public-for-help-recovering-funds-after-defi-exploits/",
    "description": "<p>Decentralized finance (DeFi) protocol Curve Finance (CRV) has offered a $1.85 million public bounty to recover the remaining funds stolen on its platform through a reentrancy bug on July 30. In an on-chain message dated Aug. 6, Curve conveyed that the deadline for the hacker to voluntarily return the stolen funds had passed at 08:00 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/curve-finance-opens-1-85m-bounty-to-public-for-help-recovering-funds-after-defi-exploits/\">Curve Finance opens $1.85M bounty to public for help recovering funds after DeFi exploits</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-07T14:21:02.000Z",
    "title": "PayPal Launches Ethereum-Powered Stablecoin ‘PayPal USD’ ($PYUSD)",
    "url": "https://www.cryptoglobe.com/latest/2023/08/paypal-launches-ethereum-powered-stablecoin-paypal-usd-pyusd/",
    "description": "In a landmark development, PayPal Holdings, Inc., a titan in the digital payments space, has taken the wraps off its own stablecoin pegged to the U.S. dollar, dubbed PayPal USD (PYUSD). This initiative marks PayPal’s strategic foray into the rapidly evolving universe of Web3 and digital-centric payments. According to PayPal’s press release, the newly minted […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-07T14:19:35.000Z",
    "title": "CryptoMinerBros Celebrates 5 Years of Building the Future in the Crypto Mining Community",
    "url": "https://cryptodaily.co.uk/2023/08/cryptominerbros-celebrates-5-years-of-building-the-future-in-the-crypto-mining-community",
    "description": "<p>Kowloon city, HongKong, August 7th, 2023, Chainwire</p><p>Founded in August 2018 and headquartered in Hong Kong, Crypto Miner Bros has become one of the leading crypto mining hardware distributors within five years of its launch. With a dedicated team of blockchain experts, e-commerce specialists, and crypto mining professionals, Crypto Miner Bros has become a reputable name in the crypto mining industry.&nbsp;</p><p>Crypto Miner Bros has built an incredible mining community that wholeheartedly believes in the company&rsquo;s vision of making crypto mining accessible to everyone. The company&rsquo;s progress and achievements would not have been possible without the invaluable support of the clients. Crypto Miner Bros is committed to giving back to the community by offering the world&rsquo;s finest crypto mining tools and comprehensive end-to-end crypto mining solutions.</p><p>In August 2018, Crypto Miner Bros started as an E-commerce platform specializing in crypto mining hardware with a vision of providing miners with a positive crypto mining experience. Within one year of its launch, the company had already become one of the world&rsquo;s most trusted platforms for crypto mining hardware. Crypto Miner Bros is endorsed by globally recognized brands such as Nicehash, Asic Miner Value, Crypto Compare, Whattomine, and CoinWarz. The company&rsquo;s goal for the upcoming year is to continue making crypto mining accessible to everyone, spreading the benefits of this technology far and wide.</p><p>Buying crypto mining hardware from a reliable source has always been challenging for international buyers. Crypto Miner Bros provides an excellent platform for miners by joining hands with reputed mining hardware manufacturers in China and Hong Kong. Miners can find all the reputed mining hardware brands from Bitmain to Canaan Avalon Goldshell, Jasminer, MicroBT, Innosilicon, and more on the Crypto Miner Bros website.</p><p>Entering its sixth year, Crypto Miner Bros focuses on bridging the gap between miners and manufacturers and getting quality crypto mining products to the global market. The company constantly strives to expand the mining community of Crypto Miner Bros in the coming year by introducing P2P (Peer-to-Peer) deals. Thus, miners can readily access advanced ASICs at better deals and enjoy hassle-free buying. The company also aids faster shipping to customers worldwide with its dedicated sales team. Though Crypto Miner Bros has an active international sales team, the organization plans to have dedicated technical support centers in every continent. Thus, the company can promptly ship the miners to any location and assist the customer with their queries. Besides, Crypto Miner Bros will continue to act as a reliable platform for all crypto miners with a rich source of information related to crypto mining, cryptocurrencies, blockchain, and other related topics. Moreover, the company&rsquo;s dedicated customer support team will assist the customers 24/7 in setting up the ASIC or any hiccups customers may face with crypto mining.</p>About Crypto Miner Bros<p>Crypto Miner Bros, a leading Asic hardware provider, continues delivering high-quality products and services worldwide to all crypto mining enthusiasts. The company partners with reputed mining hardware manufacturers and deals with high-quality mining equipment to provide a positive mining experience to its customers. For more information visit Crypto Miner's official website.</p><p>Crypto Miner Bros extends its heartfelt gratitude to its customers, stakeholders, and employees. Crypto Miner Bros promises to continue delivering excellent products and services in the years to come. Miners can look forward to Crypto Miner Bros for advanced mining equipment, informative videos, educational content, and, of course, 24/7 assistance.</p>Contact Crypto Miner Bros<p>Whatsapp / Wechat / Call : +86-13530796464</p><p>USA Hotline: +1-806-305-324</p>ContactCOOHan SuCrypto Miner Broscontact@cryptominerbros.com+86-13530796464"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-07T14:15:00.000Z",
    "title": "Introducing ChainGPT V1, The AI-Powered Dashboard for Navigating Web3 - Launching August 10th",
    "url": "https://cryptodaily.co.uk/2023/08/introducing-chaingpt-v1-the-ai-powered-dashboard-for-navigating-web3-launching-august-10th",
    "description": "<p>With a vision to unite all of the ChainGPT products into one intuitive, user-friendly interface, and enable an engaging AI-powered experience for all Web3 participants, ChainGPT will be releasing the highly-anticipated V1 web application to the public.</p>\n<p>Starting on August 10, at 12:00 pm UTC, every participant of the crypto, blockchain, and Web3 space will have access to the most sophisticated AI with on-chain and off-chain capabilities to date.</p>\nWhat is the ChainGPT V1?\n<p>Acting as an AI powered operating system of fundamental tools for traders, investors, researchers, developers, and everyone in between, the ChainGPT V1 is a dashboard that encompasses the full suite of ChainGPT products including the NFT Generator, smart contract auditor, and chat assistant, with its ecosystem components including the ChainGPT DAO, the staking modules, and API access that will facilitate a new generation of informational management and discovery for all in the crypto and blockchain space. The ultimate hub for Crypto AI Tools.</p>\nWhat are some of the V1 Features?\n<p>Loaded with all of the individual products ChainGPT has released over the last few months, the V1 web app has a rich set of functionality that builds on previous versions of ChainGPT.</p>\n<p>AI Chatbot Already deployed throughout a multitude of Web3 communities via Telegram and Discord, the ChainGPT AI Chatbot has already become a staple as an interactive, dynamic database for engaging and entertaining users. With the release of the V1 the Chatbot is receiving an upgrade with new capabilities &amp; bug fixes that supersede its predecessor beta version. Its capabilities now extend across a much broader range of sources for gathering live Web3 news and insights. It will be able to conduct much deeper, more granular market analysis through the application of technical indicators (such as the RSI and EMA) to aid traders and investors in their research. It has been tuned to track all major launchpad and IDO platforms, providing a more holistic view of the startup landscape. Initially having a surface level set of assets that were limited in scope, the upgraded chatbot has been plugged in to service over 5,000 coins/tokens (and will be constantly expanding).</p>\n<p>As it pertains to the bug fixes, all minor and major points of friction for the users have been mended. Response times have been compressed, accuracy has been calibrated for higher contextual fidelity, and error potential has been minimized.</p>\n<p></p>\nMaster Dashboard\n<p>User experience with slow, clunky and disorganized applications has kept many away from participating in the world of Web3; ChainGPT decided to approach this problem head on and was able to construct what might be the most complete AI interface in the industry.</p>\n<p>Integrating every $CGPT application, while being able to neatly package the visual elements without disrupting its aesthetics, the V1 dashboard is transforming user accounts into AI-powered Web3 operating systems.&nbsp;</p>\n<p></p>\nAutomated AI Newsfeed\n<p>Staying up-to-date in the fast paced crypto, blockchain, and Web3 space has been notoriously challenging, until now.</p>\n<p>The first (and only) of its kind, ChainGPT&rsquo;s automated AI newsfeed has been developed from the ground up to deliver the most complete informational experience. Scanning the entire internet, the ChainGPT AI newsfeed aggregates all the leading trusted outlets and social sources, digests the information, and produces succinct summarizations in an comprehensive manner.</p>\n<p></p>\nPrompt Marketplace\n<p>An AI is only as useful as the prompt that it is given. Quickly becoming one of the most sought after skills in the greater tech industry, prompting is a form of vernacular art; in fact prompts have become a digital asset class of its own.&nbsp;</p>\n<p>Catering to the evolving demands of AI communities, the V1 dashboard is equipped with its own prompt marketplace, becoming a focal point for the exchange of generative AI ideas. Users will be able to buy, bell, &amp; trade prompts with the expansive $CGPT community; effectively adding a vector for users to monetize their skills.</p>\n<p></p>\nAI NFT Generator\n<p>ChainGPT released the first ever AI NFT Generator on June 1st, with already over 4,500,000 NFTs generated! In the evolving landscape of digital art, ChainGPT's AI NFT Generator stands out as an avant-garde tool, seamlessly melding technology with artistic expression. With just a simple text prompt, this groundbreaking generator harnesses the power of advanced AI to bring to life high-quality NFT collections, ranging from distinctive single pieces to vast galleries of up to 10,000 NFTs, all within an astonishing 30 to 60 seconds. Offering unparalleled versatility, it supports a myriad of platforms including BNB Chain, opBNB Chain, Polygon, Avalanche, and Ethereum. While individual NFT creation and minting are graciously offered for free, those aiming to craft expansive 10,000 NFT collections can easily do so under the umbrella of ChainGPT's Freemium or Paid plans. The ChainGPT AI NFT Generator is not just a tool&mdash;it's a revolution, redefining the boundaries of what's possible in the world of NFT creation.</p>\n<p></p>\nAI Powered Solidity Smart-Contracts Auditor &amp; Generator\n<p>Navigating the intricate realm of Solidity smart-contracts just became remarkably intuitive with ChainGPT's cutting-edge AI models and tools. Whether you're looking to birth a new contract or rigorously assess an existing one, ChainGPT simplifies the process. Users can effortlessly generate tailor-made smart-contracts by merely articulating their requirements, eliminating the technical jargon and complexities traditionally associated with such tasks. Similarly, auditing a contract is now as straightforward as presenting its code to ChainGPT's AI. This innovation heralds a new era, making the creation and assessment of Solidity smart-contracts more accessible and efficient than ever before.</p>\nMembership and Access\n<p>The V1 release will be engaging a three tier membership system based on what applications and the degree of access that users desire to have.&nbsp;</p>\nFree Plan\n<p>The basic configuration of functions granted to every account on the V1. Restricted from the more advanced applications, the free plan provides limited access to five of the core applications including the General AI model (chatbot), the news feed, the Ask Crypto People app, Single NFT Generation, and participation in the prompt marketplace.&nbsp;</p>\nPPP Plan\n<p>The pay-per-prompt plan offers unlimited, flexible access to the entire application suite. Smart Contact auditing and generations, multi-NFT (collection) generation, the trading assistant, as well as everything in the free plan.&nbsp;</p>\nFreemium Plan\n<p>The Freemium plan requires that users accumulate 20,000 CGPTsp by staking $CGPT tokens. This plan provides 20,000 monthly CGPT credits for use as needed throughout any and every single application. In addition to the full product suite, users at the Freemium level will also be granted DAO proposal rights, allowing them to submit ideas for the ChainGPT DAO to vote on.</p>\n\n<p>In order to unlock the full spectrum of functionality, a user will be able to swiftly create their accounts by linking their Web3 wallets (Metamask, Trust Wallet, Rainbow wallet, etc..)</p>\n\nAbout ChainGPT\n<p>ChainGPT is the leading provider of AI-powered Infrastructure for the crypto, blockchain, and Web3 industry. From automated smart contract generation and auditing, to autonomous community management, advanced Web3 AI chatbot, AI-powered news aggregation, and NFT generation, ChainGPT is the most sophisticated, end-to-end AI solution on the market.</p>\n<p>&nbsp;</p>\n<p></p>\n<p>ChainGPT Links:&nbsp;Website | AI App | ChainGPT Pad | Whitepaper&nbsp;DAO | NFT Generator | Staking v2 | Staking v1 | Blog Community and Social Media: Twitter | Telegram | Discord | Instagram | LinkedIn | Youtube | TikTok</p>\n<p>BD</p>\n<p>Contact Person(s): Jake Wallace / Cameron French / Ilan RakhmanovContact Email(s): jacob@chaingpt.org / cameron@chaingpt.org / ceo@chaingpt.org</p>\n<p>&mdash;&gt; To learn more about ChainGPT visit the official ChainGPT.org website</p>\n<p>&mdash;&gt; For all other inquiries, please contact info@chaingpt.org</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T14:34:22.000Z",
    "title": "AI Language Models Raise Concerns Over Bioterrorism and Biological Weapons",
    "url": "https://www.cryptopolitan.com/ai-language-concerns-over-bioterrorism/",
    "description": "The rapid advancement of artificial intelligence has led to numerous breakthroughs in science and healthcare, revolutionizing various fields for the better. However, it also raises serious concerns about potential misuse, particularly in the context of bioterrorism and biological weapons. The infamous case of Aum Shinrikyo, a Japanese cult attempting a bioterror attack using botulinum toxin, ... <a title=\"AI Language Models Raise Concerns Over Bioterrorism and Biological Weapons\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-language-concerns-over-bioterrorism/\" aria-label=\"More on AI Language Models Raise Concerns Over Bioterrorism and Biological Weapons\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T14:27:26.000Z",
    "title": "OPNX  Exchange extends $30 million offer to acquire ailing crypto lender Hodlnaut",
    "url": "https://www.cryptopolitan.com/opnx-exchange-extends-30-million-offer-to-acquire-ailing-crypto-lender-hodlnaut/",
    "description": "Open Exchange (OPNX), a digital-asset exchange linked to the founders of Three Arrows Capital, which collapsed in 2022, has submitted an offer to take control of struggling crypto lender Hodlnaut. The restructuring of Hodlnaut is currently being overseen by a court in Singapore, and OPNX&#8217;s offer involves an injection of the equivalent of $30 million ... <a title=\"OPNX  Exchange extends $30 million offer to acquire ailing crypto lender Hodlnaut\" class=\"read-more\" href=\"https://www.cryptopolitan.com/opnx-exchange-extends-30-million-offer-to-acquire-ailing-crypto-lender-hodlnaut/\" aria-label=\"More on OPNX  Exchange extends $30 million offer to acquire ailing crypto lender Hodlnaut\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T14:20:57.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-07T14:14:27.000Z",
    "title": "CryptoMinerBros Celebrates 5 Years of Building the Future in the Crypto Mining Community",
    "url": "https://www.cryptopolitan.com/cryptominerbros-celebrates-5-years-of-building-the-future-in-the-crypto-mining-community/",
    "description": "Kowloon city, HongKong, August 7th, 2023, Chainwire Founded in August 2018 and headquartered in Hong Kong, Crypto Miner Bros has become one of the leading crypto mining hardware distributors within five years of its launch. With a dedicated team of blockchain experts, e-commerce specialists, and crypto mining professionals, Crypto Miner Bros has become a reputable ... <a title=\"CryptoMinerBros Celebrates 5 Years of Building the Future in the Crypto Mining Community\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cryptominerbros-celebrates-5-years-of-building-the-future-in-the-crypto-mining-community/\" aria-label=\"More on CryptoMinerBros Celebrates 5 Years of Building the Future in the Crypto Mining Community\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-07T14:33:38.000Z",
    "title": "Another Major Crypto Exchange in Trouble With Binance Rumored to be Involved in Manipulation- Is Bitcoin and the Crypto Market Going to Crash?",
    "url": "https://www.crypto-news-flash.com/another-major-crypto-exchange-in-trouble-with-binance-rumored-to-be-involved-in-manipulation-is-bitcoin-and-the-crypto-market-going-to-crash/?utm_source=rss&utm_medium=rss&utm_campaign=another-major-crypto-exchange-in-trouble-with-binance-rumored-to-be-involved-in-manipulation-is-bitcoin-and-the-crypto-market-going-to-crash",
    "description": "<img width=\"2560\" height=\"1707\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/01/AdobeStock_Von-Phongphan-Supphakank-scaled.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ziliqa, Avax, Litecoin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/01/AdobeStock_Von-Phongphan-Supphakank-scaled.jpeg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2021/01/AdobeStock_Von-Phongphan-Supphakank-300x200.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/01/AdobeStock_Von-Phongphan-Supphakank-1024x683.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/01/AdobeStock_Von-Phongphan-Supphakank-104x69.jpeg 104w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Fintech investor Adam Cochran points out major cracks in Huobi&#8217;s financial strength and calls the exchange to be deeply insolvent. Huobi chief Justin Sun denied rumors calling them FUD and added Huobi continues to build up. Over the last weekend between August 5-6, crypto exchange Huobi witnessed massive outflows worth $64 amid rumors of its [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-07T14:22:00.000Z",
    "title": "Pro-XRP Analyst Sets High Expectations Despite Looming SEC Appeal",
    "url": "https://coinedition.com/pro-xrp-analyst-sets-high-expectations-despite-looming-sec-appeal/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/XRP-news-comes-with-a-price-analysis-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/XRP-news-comes-with-a-price-analysis-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/XRP-news-comes-with-a-price-analysis-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/XRP-news-comes-with-a-price-analysis-2-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/XRP-news-comes-with-a-price-analysis-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/XRP-news-comes-with-a-price-analysis-2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/XRP-news-comes-with-a-price-analysis-2-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/XRP-news-comes-with-a-price-analysis-2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/XRP-news-comes-with-a-price-analysis-2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/XRP-news-comes-with-a-price-analysis-2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/XRP-news-comes-with-a-price-analysis-2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/XRP-news-comes-with-a-price-analysis-2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/XRP-news-comes-with-a-price-analysis-2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/XRP-news-comes-with-a-price-analysis-2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/XRP-news-comes-with-a-price-analysis-2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/XRP-news-comes-with-a-price-analysis-2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/XRP-news-comes-with-a-price-analysis-2-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Dedicated Ripple (XRP) supporter Alex Cobb shared in a Twitter post yesterday that traders should think about “stacking up their bags” as much as possible. According to the post, Cobb believes XRP will likely face one more “shakeout” before the sleeping giant awakes. Cobb’s tweet also stated that investors’ brutal patience will be rewarded. Although [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/pro-xrp-analyst-sets-high-expectations-despite-looming-sec-appeal/\">Pro-XRP Analyst Sets High Expectations Despite Looming SEC Appeal</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-07T14:30:54.000Z",
    "title": "Criminal Actors Posing As NFT Developers in Crypto Phishing Scams, Warns FBI",
    "url": "https://dailyhodl.com/2023/08/07/criminal-actors-posing-as-nft-developers-in-crypto-phishing-scams-warns-fbi/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/NFTs-Are-Underhyped.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/NFTs-Are-Underhyped.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/NFTs-Are-Underhyped.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/NFTs-Are-Underhyped.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/NFTs-Are-Underhyped.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/NFTs-Are-Underhyped.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/NFTs-Are-Underhyped.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The Federal Bureau of Investigation (FBI) is issuing a warning to investors saying that criminals are posing as developers of non-fungible token (NFT) projects in crypto phishing scams. In a new public service announcement, the FBI says that bad actors are depicting themselves as legitimate NFT developers to run fraud schemes on social media. According [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/07/criminal-actors-posing-as-nft-developers-in-crypto-phishing-scams-warns-fbi/\">Criminal Actors Posing As NFT Developers in Crypto Phishing Scams, Warns FBI</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]