[
  {
    "source": "Cointelegraph",
    "date": "2023-10-22T02:13:19.000Z",
    "title": "Crypto advocates file amicus brief to address users' Fourth Amendment privacy rights",
    "url": "https://cointelegraph.com/news/crypto-advocates-file-amicus-brief-addressing-crypto-privacy-rights-under-fourth-amendment",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/72b78c32-0f96-4272-8200-20b3f297ea96.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The amicus brief was filed to support an appeal against the Internal Revenue Service in relation to a 2017 court order where Coinbase was forced to hand over data from more than 14,300 of its users to the IRS. </p>\n                    <p><p>Cryptocurrency advocacy group DeFi Education Fund (DEF) has urged a United States court to consider the unique aspects of blockchain technology when evaluating the privacy rights of cryptocurrency users under the Fourth Amendment.</p><p>DEF <a href=\"https://www.defieducationfund.org/_files/ugd/e53159_492b137460ef4263aa43f3fcb946a1cd.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> an amicus brief to the U.S. Court of Appeals (First Circuit) on Oct. 20, supporting James Harper’s appeal against the Internal Revenue Service as part of a fight to prevent the U.S. government from having unfettered access to a user's transaction history on cryptocurrency platforms.</p><p>Harper was one of 14,355 Coinbase users whose data was <a href=\"https://cointelegraph.com/news/coinbase-informs-13k-affected-customers-of-imminent-data-handover-to-irs\">handed over by the cryptocurrency exchange</a> to the IRS<u> </u>following a court order in 2017, which sparked a fight for stronger digital privacy rights.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">DEF is proud to support the industry by filing amicus briefs in precedent-setting cases, such as Harper v. IRS, which involves a John Doe subpoena to Coinbase that resulted in over 14,000 users’ private financial information being sent to the IRS.<br><br>Our CLO <a href=\"https://twitter.com/amandatums?ref_src=twsrc%5Etfw\">@amandatums</a> breaks down… <a href=\"https://t.co/JidwyPMzcj\">https://t.co/JidwyPMzcj</a></p>&mdash; DeFi Education Fund (@fund_defi) <a href=\"https://twitter.com/fund_defi/status/1715409633152553074?ref_src=twsrc%5Etfw\">October 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>DEF argued that the Fourth Amendment needs to be revised to rebalance law enforcement’s investigative powers and an individual’s right to financial privacy in the digital age.</p><blockquote>“When old precedents meet new technology, courts must ‘assure preservation of that degree of privacy against government that existed when the Fourth Amendment was adopted.’”</blockquote><p>The Fourth Amendment of the U.S. Constitution serves to protect people from unreasonable searches and seizures by the government. </p><p>DEF also pointed to the case of Carpenter v United States to argue that the Fourth Amendment limits the U.S. government’s capacity to obtain data from third-parties platforms like Coinbase.</p><p>The advocacy group further explained that because cryptocurrency transactions are traceable on public ledgers, it is possible to connect real-life identities to their pseudonymous addresses. </p><p>This impacted the livelihoods of all 14,355 users in the Coinbase case, DEF explained:</p><blockquote>“The government’s request in this case therefore implicated every user’s every transaction, now and forever, including their ‘familial, political, professional, religious, and sexual associations.”</blockquote><p>“It gave the government a “detailed, encyclopedic, and effortlessly compiled” synopsis of the lives of Harper and 14,354 others,” DEF added.</p><p>This degree of insight far exceeds what is attainable through traditional banking records, the lobby group argued.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blockchain-privacy-groups-urge-new-us-congresspeople-to-protect-privacy-rights\"><strong><em>Blockchain privacy groups urge new US Congress to protect privacy rights </em></strong></a></p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">4/ We argue that the Court must take into account core differences between crypto technology and TradFi because blockchain data provides the government with an intimate view into a person’s financial life in the past, present, and future. <a href=\"https://t.co/KORSLRhqNY\">pic.twitter.com/KORSLRhqNY</a></p>&mdash; Amanda Tuminelli (@amandatums) <a href=\"https://twitter.com/amandatums/status/1715409119962652993?ref_src=twsrc%5Etfw\">October 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The DeFi Education Fund's mission is to educate policymakers about the benefits of decentralized finance and to achieve regulatory clarity for the DeFi ecosystem.</p><p>The final decision of Harper v Werfel and Internal Revenue Services is expected to set a precedent for digital privacy rights and law enforcement measures in the U.S.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\"><strong><em>Best and worst countries for crypto taxes — Plus crypto tax tips</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  }
]