[
  {
    "source": "Cointelegraph",
    "date": "2023-07-20T18:40:40.000Z",
    "title": "Former Binance​.US CEO joins Hashdex board",
    "url": "https://cointelegraph.com/news/former-binance-us-ceo-joins-hashdex-board",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/e0636b00-7dec-4323-a969-f1aec6f3531b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Brian Brooks has worked as Coinbase’s chief legal officer, acting comptroller of the currency, CEO of Binance.US and CEO of Bitfury.</p>\n                    <p><p>Brian Brooks, former acting comptroller of the currency for the United States government, has joined the board of directors for crypto-focused asset manager Hashdex.</p><p>In a July 20 announcement, Hashdex <a href=\"https://www.globenewswire.com/news-release/2023/07/20/2708209/0/en/Hashdex-Announces-Addition-of-Brian-Brooks-to-Board-of-Directors.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a> Brooks had become the fifth member of its board and will serve as a strategic adviser to the firm. Brooks was the chief legal officer of Coinbase from 2018 to 2020, served as acting comptroller of the currency from 2020 to 2021, worked as the CEO of Binance.US for roughly four months and was the CEO of Bitfury from October 2021 to December 2022. </p><p>Hashdex co-founder and CEO Marcelo Sampaio cited Brooks’ experience in “financial regulation and the crypto industry” in having him join the board. Brooks is currently employed as a managing partner at venture capital firm Valor Capital Group, which has previously backed crypto companies through various funding rounds. </p><p>“Crypto assets are changing the economics of nearly every industry across the globe, allowing individuals to have an ownership stake in the networks in which they participate,” said Brooks. “I look forward to helping [Hashdex] deliver on their vision of bridging the divide between traditional financial markets and the crypto economy.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Hashdex is excited to announce <a href=\"https://twitter.com/valorcapgroup?ref_src=twsrc%5Etfw\">@valorcapgroup</a> Managing Partner & experienced <a href=\"https://twitter.com/hashtag/crypto?src=hash&ref_src=twsrc%5Etfw\">#crypto</a> executive Brian Brooks (<a href=\"https://twitter.com/BrianBrooksUS?ref_src=twsrc%5Etfw\">@BrianBrooksUS</a>) to our Board of Directors. <br><br>More Here: <a href=\"https://t.co/cZV5OzD1z2\">https://t.co/cZV5OzD1z2</a></p>— Hashdex (@hashdex) <a href=\"https://twitter.com/hashdex/status/1682036524999929857?ref_src=twsrc%5Etfw\">July 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/us-is-unquestionably-behind-the-curve-on-crypto-etfs-says-brian-brooks\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-is-unquestionably-behind-the-curve-on-crypto-etfs-says-brian-brooks/amp\"><strong><em>US is 'unquestionably' behind the curve on crypto ETFs, says Brian Brooks</em></strong></a></p><p>Brooks’ short stint as the CEO of Binance.US in 2021 — taking over from former CEO Catherine Coley — seemed to surprise many in the crypto space. He cited “differences over strategic direction” at the time, but a June filing in the Securities and Exchange Commission’s case against Binance reportedly <a href=\"https://cointelegraph.com/news/crypto-community-in-shock-over-brian-brooks-resignation-from-binance-us\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-community-in-shock-over-brian-brooks-resignation-from-binance-us/amp\">claimed Binance CEO Changpeng Zhao</a> did not allow Brooks the autonomy to run the U.S. exchange.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoins-great-accumulation-binance-us-resumes-fiat-withdrawals-and-other-news-hodlers-digest-june-18-24/\"><strong><em>Bitcoin’s ‘Great Accumulation,’ Binance.US resumes fiat withdrawals, and other news: Hodler’s Digest, June 18-24</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T19:07:59.000Z",
    "title": "Where is the crypto market headed in Q2 2023?",
    "url": "https://www.cryptopolitan.com/where-is-the-crypto-market-headed-in-q2-2023/",
    "description": "The future of crypto and all the industries tied to it in question. A U.S. judge ruled last week that XRP is not a security, and the SEC accepted BlackRock&#8217;s application for a bitcoin ETF, advancing it to the next stage of approval. Within minutes, the price of XRP rose from $0.45 to $0.61, an ... <a title=\"Where is the crypto market headed in Q2 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/where-is-the-crypto-market-headed-in-q2-2023/\" aria-label=\"More on Where is the crypto market headed in Q2 2023?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-20T18:59:01.000Z",
    "title": "Internet Computer (ICP) Price Prediction: Will The Golteum (GLTM) Presale Be More Profitable?",
    "url": "https://nulltx.com/internet-computer-icp-price-prediction-will-the-golteum-gltm-presale-be-more-profitable/",
    "description": "As seasoned investors know, acquiring promising projects early is imperative for big gains. As a result, crypto market analysts have focused more on Golteum (GLTM) &#8211; a forefront project currently in the Round 2 phase of its presale, with an exciting growth trajectory. This buzzing presale star has caught the attention of several investors, including [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-20T19:01:16.000Z",
    "title": "Terraform appoints interim CEO after Do Kwon’s arrest",
    "url": "https://crypto.news/terraform-appoints-interim-ceo-after-do-kwons-arrest/",
    "description": "Chris Amani, previously the COO and CFO, is now the CEO of Terraform Labs, succeeding co-founder Do Kwon"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-20T19:00:15.000Z",
    "title": "SEC Allegedly Delays Assistance For US Crypto Market Bill",
    "url": "https://www.newsbtc.com/news/sec-allegedly-delays-assistance-for-us-crypto-market-bill/",
    "description": "The United States Securities and Exchange Commission (SEC) has allegedly held up assistance needed in a congressional bill to regulate the crypto markets. This has been considered a potential hurdle if the bill is to pass in Congress. Through multiple sources, the Block found that the SEC has yet to provide sufficient technical assistance for the bill after almost six weeks of request. The report stated that this appears to be the case despite the supposed commission’s good communication with the House.  SEC officials have recently provided briefings to the staff of Democratic members of the House Financial Services Committee. These briefings reportedly covered their opinions on digital asset regulation in light of the committee&#8217;s upcoming consideration of bills to establish a comprehensive framework for cryptocurrency markets in the United States. Related Reading: Arkansas Senator Calls For Reversal Of Controversial New Crypto Mining Law While the Securities and Exchange Commission seems to be dragging its feet in responding to the House’s request, the Commodity Futures Trading Commission (CFTC) is said to have been receptive so far, providing the congressional staff with some technical assistance. Final Draft Of Crypto Market Bill To Be Unveiled  Various House committees have been working together for months to create a new bill for crypto markets in the country. This crypto market bill, led primarily by Republican members, is expected to direct the U.S. market regulators on how a digital asset can transition from a security to a commodity.  Additionally, it would temporarily confer the Commodity Futures Trading Commission superior power over crypto commodities markets &#8211; mainly Bitcoin trading. A final draft of this multi-committee bill will reportedly be introduced today, July 20, 2023. This is in anticipation of a committee debate and vote next week. Initially, a committee debate and amendment process for the Financial Services Committee part of the bill was scheduled on Wednesday, July 19. However, this “markup” has been rescheduled to the following week to allow enough time for additional review by committee members. Senators Urge SEC Chairman To Crack Down On Crypto Companies On Wednesday, July 19, two prominent figures in the U.S. Senate criticized the crypto industry, pressing the Securities and Exchange Commission to be more aggressive in its regulatory style.  Democrat Senator Dick Durbin D-III condemned the activities of crypto companies in the United States. The government official said: They spent billions on sports arena or stadium naming rights deals to gain misguided credibility with everyday Americans and manipulate prices with phony tokens of no underlying value. Related Reading: Terraform Labs Appoints New CEO Following Do Kwon’s Sentencing In Montenegro Senator John Kennedy, a Republican from Louisiana, asked Gensler why there was &#8220;no emergency injunction to force the bankrupt FTX exchange to halt its operations before collapsing last November.&#8221;  The SEC chairman responded, saying: We investigate by the book. You, I&#8217;m sure, and the American public, want us to follow the facts, follow the law, properly get people subpoenas. Although Gensler agreed with the Senators’ claims about the crypto industry and the need for more policies, he made a case for the underlying technology. Meanwhile, he took the opportunity to request more funding for his agency. Crypto Total Market Cap at $1.16 trillion &#124; Source: TOTAL chart from TradingView Featured image from Tekedia, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-20T18:45:36.000Z",
    "title": "Pennsylvania Lawmaker Says New Crypto Bill Is Coming After Positive Ripple Lawsuit Outcome",
    "url": "https://dailyhodl.com/2023/07/20/pennsylvania-lawmaker-says-new-crypto-bill-is-coming-after-positive-ripple-lawsuit-outcome/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/lawmaker-says-new-after.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/lawmaker-says-new-after.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/lawmaker-says-new-after.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/lawmaker-says-new-after.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/lawmaker-says-new-after.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/lawmaker-says-new-after.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/lawmaker-says-new-after.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A Pennsylvania Republican is reportedly planning to propose new crypto legislation after last week&#8217;s verdict in the U.S. Securities and Exchange Commission (SEC) lawsuit against Ripple. Bloomberg reports that Representative Glenn Thompson is optimistic about getting support for the crypto bill he is championing following the court’s decision that Ripple did not violate securities law [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/20/pennsylvania-lawmaker-says-new-crypto-bill-is-coming-after-positive-ripple-lawsuit-outcome/\">Pennsylvania Lawmaker Says New Crypto Bill Is Coming After Positive Ripple Lawsuit Outcome</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-20T18:41:58.000Z",
    "title": "DeFi Altcoin Jumps As Binance’s Venture Capital Arm Invests $10,000,000 in the Crypto Project",
    "url": "https://dailyhodl.com/2023/07/20/defi-altcoin-jumps-as-binances-venture-capital-arm-invests-10000000-in-the-crypto-project/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/DeFi-Altcoins-Flashing-Strength-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/DeFi-Altcoins-Flashing-Strength-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/DeFi-Altcoins-Flashing-Strength-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/DeFi-Altcoins-Flashing-Strength-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/DeFi-Altcoins-Flashing-Strength-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/DeFi-Altcoins-Flashing-Strength-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/DeFi-Altcoins-Flashing-Strength-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A decentralized finance (DeFi) altcoin is surging after the venture capital arm of the world’s biggest crypto exchange by volume invested millions of dollars into it. In a new company blog post, Binance says that Binance Labs has invested $10 million into Radiant Capital (RDNT), a cross-chain lending and borrowing crypto protocol built on top [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/20/defi-altcoin-jumps-as-binances-venture-capital-arm-invests-10000000-in-the-crypto-project/\">DeFi Altcoin Jumps As Binance’s Venture Capital Arm Invests $10,000,000 in the Crypto Project</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]