[
  {
    "source": "Cointelegraph",
    "date": "2023-06-27T03:14:28.000Z",
    "title": "Binance Australia got 12 hours' notice before it was debanked, says exec",
    "url": "https://cointelegraph.com/news/binance-australia-debanked-on-short-notice-says-regional-manager",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/6267eb1b-9f15-4b9a-9b46-3fc9ed53dfee.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Binance Australia head Ben Rose claimed the exchange got less than a day's warning from its payments partner before it was \"cut off\" from the local banking system in May.</p>\n                    <p><p>In the middle of the night, Binance Australia’s team was suddenly told it would be “cut off” from Australia’s banking system. There was no prior warning, consultation or redress, the exchange’s regional manager Ben Rose has claimed.</p><p>On May 18, Binance Australian announced its dollar services <a href=\"https://cointelegraph.com/news/binance-suspends-aud-services\">were suspended</a> after its payments provider Zepto was told to stop support for Binance from Cuscal — Zepto’s partner banking and payments provider.</p><p>Rose told an audience at the Australian Blockchain Week on June 26 that the move impacted around 1 million customers based in Australia. </p><blockquote>“We received 24 hours' notice of debanking at 11:30 pm in the evening, that was later turned into 12 hours, and so we had our banking cut off.”</blockquote><p>“The reasons given were not entirely clear and didn't look that great in the media,” said Rose. Previously, a Cuscal spokesperson <a href=\"https://cointelegraph.com/news/binance-australia-cuscal-statement-on-debanking-exchange\">declined to comment</a> on Binance Australia-related matters to Cointelegraph but did point to crypto-related “scams and fraud.” </p><p>The limited information initially worried Binance customers but “that tone changed pretty quickly” when it became clear it was the wider local crypto industry “impacted by these banking changes,” Rose said.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/8d0268ae-85e3-43c5-90b6-1300f3da2d37.jpg\"  /><figcaption style=\"text-align: center;\"><em>Ben Rose (right) on stage at the Australian Blockchain Week. Source: Cointelegraph</em></figcaption></figure><p>The same day Cuscal offboarded Binance, “Big Four” bank Westpac said it would begin <a href=\"https://cointelegraph.com/news/australian-big-4-bank-begins-trial-for-cryptocurrency-payment-blocks\">trials that block payments</a> to crypto exchanges. Less than a month later Commonwealth Bank, another major Australian bank, started similar <a href=\"https://cointelegraph.com/news/commonwealth-bank-decline-limit-payments-to-high-risk-crypto-exchanges\">crypto-related payment blocks</a>.</p><p>Speaking to Cointelegraph after his on-stage interview, Rose declined to provide any extra information about Binance Australia’s search for an alternate third-party payments provider as discussions were ongoing.</p><p>Rose said there are other providers but admitted that Cuscal “bank the majority of this industry.”</p><p>Australia’s crypto industry has long relied on crypto-friendly payments providers including Monoova, Zai and Zepto — all of who are partnered with Cuscal to access the local banking system.</p><p>Cuscal-backed payment rails are used by Binance’s peer crypto exchanges including BTC Markets, Kraken Australia, CoinJar, Independent Reserve and many other crypto-related fintech firms.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blockchain-australia-new-ceo-takes-aim-regulation-by-enforcement-united-states\"><strong><em>Don’t follow the US: Blockchain Aus CEO hammers ‘regulation by enforcement’</em></strong></a></p><p>On stage, Rose claimed losing access to their banking partner “hasn't had a real impact on the business.” He added Binance users are “using other methods,” likely the purchases and deposits to bank cards that are still supported on the platform.</p><p>He stressed the need to work with regulators and the banking sector and the possibility of implementing “sensible licensing” for the industry.</p><p>“We would call for Australia to move relatively quickly because jurisdictions all around the world are now moving forward,\" Rose said.</p><blockquote>\"We have a window as a country and we think there's an opportunity, but there's also a risk if we don't move on licensing relatively quickly.”</blockquote><p><a href=\"https://cointelegraph.com/magazine/crypto-city-guide-sydney-harbor-bridge-synthetix-finder/\"><strong><em>Crypto City guide to Sydney: More than just a ‘token’ bridge</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-27T03:30:01.000Z",
    "title": "Yuan Usage Soars in Argentina: Over 500 Companies Request to Pay for Imports in Chinese Currency, Report",
    "url": "https://news.bitcoin.com/yuan-usage-soars-in-argentina-over-500-companies-request-to-pay-for-imports-in-chinese-currency-report/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/argentina-yuan-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"More Than 500 Argentine Companies Request to Pay for Imports in Chinese Yuan: Report\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/argentina-yuan-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/argentina-yuan-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/argentina-yuan-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/argentina-yuan-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/argentina-yuan-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/argentina-yuan-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/argentina-yuan.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Over 500 companies in Argentina have reportedly requested to pay for imports using Chinese yuan as the U.S. dollar shortage worsens. “The central bank doesn’t have dollars so it needs the emergency aid China is offering,” a trade economist in Buenos Aires explained. Chinese Yuan Usage Hits Record High in Argentina The Argentine customs agency [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-27T03:36:38.000Z",
    "title": "Ethereum Price Lacks Momentum Above $1,900 But Dips Likely To Be Limited",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-lacks-momentum-above-1900/",
    "description": "Ethereum price is struggling to settle above the $1,920 resistance against the US Dollar. ETH is still at risk of a drop toward the $1,790 support. Ethereum is still facing a major hurdle near the $1,920 resistance. The price is trading near $1,870 and the 100-hourly Simple Moving Average. There was a break below a short-term contracting triangle with support near $1,890 on the hourly chart of ETH/USD (data feed via Kraken). The pair could decline further if it remains below $1,920 and $1,930 for a long time. Ethereum Price Grinds Lower Ethereum’s price remained below the key $1,920 resistance zone. ETH failed to stay above the $1,900 zone and extended its decline, similar to Bitcoin. There was a break below a short-term contracting triangle with support near $1,890 on the hourly chart of ETH/USD. The pair dipped below the $1,865 support and the 100-hourly Simple Moving Average. However, losses were limited below $1,850. A low is formed near $1,838 and the price is now moving higher. It broke the 23.6% Fib retracement level of the recent decline from the $1,930 high to the $1,838 low. Ether is now trading near $1,870 and the 100-hourly Simple Moving Average. Immediate resistance is near the $1,885 level or the 50% Fib retracement level of the recent decline from the $1,930 high to the $1,838 low. The next major resistance is near the $1,900 level. Source: ETHUSD on TradingView.com The key breakout zone is still near the $1,920 and $1,930 levels. If the bulls manage to pump Ethereum above the $1,930 zone, the price might gain bullish momentum. The next resistance sits near $2,000, above which the price could rise toward the $2,050 level. Any more gains could send Ether toward the $2,120 resistance. More Losses in ETH? If Ethereum fails to clear the $1,900 resistance, it could continue to move down. Initial support on the downside is near the $1,850 level. The next major support is near the $1,840 level. If there is a move below $1,840 and the recent low, the price could test $1,790. Any more losses may perhaps send the price toward the $1,750 support. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,840 Major Resistance Level – $1,900"
  }
]