[
  {
    "source": "CoinDesk",
    "date": "2023-06-23T21:11:44.000Z",
    "title": "2020 Twitter Hacker Sentenced to 5 Years on Crypto Theft, SIM Swapping Scheme ",
    "url": "https://www.coindesk.com/policy/2023/06/23/2020-twitter-hacker-sentence-to-5-years-on-crypto-theft-sim-swapping-scheme/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Joseph O'Conner, a British man who made roughly $900,000 in an elaborate Twitter hack and a separate crypto-related SIM-swapping scheme, received a 5 year sentence from a federal judge on Friday, Inner City Press reported."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-23T21:28:58.000Z",
    "title": "Why is Bitcoin price up today?",
    "url": "https://cointelegraph.com/news/why-is-bitcoin-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2022-10/2975699c-abdd-4f7b-bd35-74267a570117.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin price hits a year-to-date high as investors’ excitement over BlackRock and Fidelity Investments applying for spot BTC ETFs fuels dreams of a new bull market.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price is up today, reaching a 2023 high at $31,431. The fresh BTC price year-to-date high comes amid recent <a href=\"https://cointelegraph.com/news/rising-institutional-interest-is-a-bullish-sign-for-crypto-seba-bank-exec\">growing institutional interest</a> in Bitcoin from companies like BlackRock and Fidelity Investments, both of which filed for a spot Bitcoin ETF within the past two weeks.</p><p>The institutional interest seems to have negated the negative news of the <a href=\"https://cointelegraph.com/news/lawmakers-vs-the-sec-vs-binance-law-decoded-june-12-19\">SEC cracking down on Binance and Coinbase</a> and <a href=\"https://cointelegraph.com/news/bitcoin-holds-30k-as-bulls-flaunt-their-advantage-in-fridays-btc-options-expiry\">bullish traders continue</a> to overpower BTC shorts. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/2d6e8814-196a-47ff-91a2-3fff09495830.png\"  /><figcaption style=\"text-align: center;\">Crypto price map. Source: Coin360</figcaption></figure><p>Here is why Bitcoin price is up today. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-miami-2023-shitcoins-for-bitcoin/\"><strong><em>Bitcoin 2023 in Miami comes to grips with ‘shitcoins on Bitcoin’</em></strong></a></p><h2>Institutional interest sparks a Bitcoin rally</h2><p>Bitcoin price started to rally <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">after BlackRock filed</a> for a spot BTC ETF in the United States on June 15. While BlackRock is not the first to apply with the SEC for a Bitcoin ETF, they are the largest of all current applicants. </p><p>To date, the SEC has refused to approve a spot Bitcoin ETF, despite numerous applicants including <a href=\"https://cointelegraph.com/news/third-time-s-the-charm-ark-and-21shares-again-file-with-sec-for-bitcoin-etf\">Cathie Wood’s ARK</a> and 21Shares which has filed for approval three times. Another company that was denied a Bitcoin ETF is Grayscale. After the rejection, the company took the <a href=\"https://cointelegraph.com/news/judges-hear-oral-arguments-in-grayscale-suit-against-sec-over-btc-spot-etf-rejection\">SEC to the appeals court</a> to argue for the soundness of Bitcoin futures.</p><p>BlackRock is the world’s <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-trust-good-or-bad-for-btc\">largest asset manager</a> with over $8.5 trillion in assets under management. The firm will also utilize Coinbase to custody the BTC in the trust according to the filing with the <a href=\"https://www.sec.gov/Archives/edgar/data/1980994/000143774923017574/bit20230608_s1.htm\" target=\"_blank\" rel=\"noopener nofollow\">SEC</a>. </p><p>The application has also <a href=\"https://cointelegraph.com/news/grayscale-bitcoin-trust-2023-high-blackrock-etf-filing-buyers\">provided a boost</a> to the Grayscale ETF and the discount is approaching 2023 highs under 35%. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/863d3bd3-f8ef-4cfb-ac86-96833485cf52.png\"  /><figcaption style=\"text-align: center;\"><em>Grayscale holdings. Coinglass</em></figcaption></figure><p>Another financial services giant, <a href=\"https://cointelegraph.com/news/deutsche-bank-applies-digital-asset-custody-license\">Deutsche Bank</a>, applied for a digital asset custody license in Germany in addition to <a href=\"https://cointelegraph.com/news/valkyrie-submits-btc-spot-etf-application-to-go-with-its-futures-miners-etfs\">Valkyrie applying</a> for a BTC spot ETF and a Bitcoin Miner ETF. </p><h2>Liquidations could be sending Bitcoin price higher</h2><p>In early June 2023, short-sellers were liquidated at a lower rate than longs. The BlackRock ETF filing announcement on June 15 has shifted fortunes away from short-sellers with over $220 million in shorts liquidated since that date. In the past 24-hours alone, over $31 million BTC shorts have been liquidated. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/24a3b3af-353d-4af7-8bd5-091e760932d6.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin futures liquidations. Source: Coinglass</em></figcaption></figure><p>Despite the short-seller losing streak, it seems that this investor group is doubling down. On June 23, 53% of options were skewed short which could potentially create an opportunity for a short-squeeze and greater Bitcoin price upside.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/303c87be-da9c-43e1-a538-8d79ca40cf84.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin short vs. long ratio. Souce: Coinglass</em></figcaption></figure><h2>The cooling US dollar index could be good for Bitcoin price</h2><p>Another positive sign for Bitcoin price is the cooling U.S. dollar index (DXY). Historically when the DXY index retracts, sentiment for risk assets like Bitcoin increases.  </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/033ec507-b909-4247-9a64-56f1086e8dfe.png\"  /><figcaption style=\"text-align: center;\"><em>U.S. dollar index. Source: TradingView</em></figcaption></figure><p>Since interest rate increases were paused by the Federal Reserve last week, some market participants think that the U.S. economy may grow and the dollar could continue to cool. If this happens, Bitcoin could continue to rally alongside equities markets. The better the macro climate, the better for Bitcoin price. </p><p>Typically, there is a close correlation between <a href=\"https://cointelegraph.com/news/bitcoin-and-correlations-examining-the-relationship-between-btc-gold-and-the-nasdaq\">Bitcoin and equity indices</a> like the S&amp;P 500. After interest rate increases were paused by the Federal Reserve on June 14, equities saw a large bounce while Bitcoin price retracted. Now it seems like the current Bitcoin rally is allowing the BTC price to catch-up. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/3da7e6bc-1ffd-47a7-b46f-5855b9986553.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\">Bitcoin price versus the S&amp;P 500. Source: TradingView</figcaption></figure><p>Some market participants think that the U.S. economy may grow and the dollar could continue to cool. If this happens, Bitcoin could continue to rally alongside equities markets. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-parabolic-advance-btc-price-all-time-high-2023\"><strong><em>Bitcoin ‘parabolic advance’ means BTC price all-time high in 2023 — Trader</em></strong></a></p><p>While Bitcoin price is showing some bullish momentum in the short-term after the BlackRock news and cooling dollar, the <a href=\"https://cointelegraph.com/news/bitcoin-price-this-week-fear-26k-key-5-things\">Bitcoin Fear &amp; Greed Index</a> has reached a 3-month high. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/73634108-5c06-4de5-92be-00c6d6357f32.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Fear &amp; Greed Index. Source: Alternative.me</em></figcaption></figure><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-23T21:26:00.000Z",
    "title": "Crypto Biz: The race for a Bitcoin spot ETF, Wall Street’s new crypto exchange, and other news",
    "url": "https://cointelegraph.com/news/crypto-biz-the-race-for-bitcoin-spot-etf-wall-street-new-crypto-exchange",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/68ca10e6-dba0-41b8-a2ec-4e04e3a53ba7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The bid for the first Bitcoin (BTC) spot exchange-traded fund (ETF) in the United States is gaining traction following BlackRock’s recent application.</p>\n                    <p><p>The bid for the first Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) spot exchange-traded fund (ETF) in the United States is gaining traction following BlackRock’s recent application, with both former applicants and new players seeking permission from the U.S. Securities and Exchange Commission (SEC) to list a crypto ETF.</p><p>Although it’s unclear whether the SEC will finally allow a Bitcoin ETF, BlackRock’s initiative appears to have “breathed new life into the race” amid the ongoing crackdown on the crypto industry. </p><p>Other headline news includes Wall Street titans backing a newly launched crypto exchange despite the current regulatory landscape. The newcomer is EDX Markets, supported by names such as Citadel Securities, Fidelity Investments and Charles Schwab — among others. </p><p>Meanwhile, crypto pioneers keep fighting for survival. On June 17, a U.S. judge <a href=\"https://cointelegraph.com/news/us-court-approves-sec-binanceus-agreement\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-court-approves-sec-binanceus-agreement/amp\">approved an agreement</a> between Binance.US and the SEC to avoid the exchange’s assets being frozen, while Gemini is seeking to expand operations beyond U.S. authorities’ reach. </p><p>This week’s Crypto Biz looks at the wave of applications for a Bitcoin spot ETF, the most recent centralized exchange (CEX) launch in the U.S., and CleanSpark’s aggressive mining expansion despite the bear market. </p><h2>Wall Street giants back EDX Markets, a new cryptocurrency exchange</h2><p>The U.S. crypto industry has a new player: EDX Markets. The new CEX made a notable entry with backing from prominent financial institutions such as Citadel Securities, Fidelity Investments, Paradigm, Sequoia Capital and Charles Schwab. Currently, the exchange supports trading only four cryptocurrencies: Bitcoin, Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) and Bitcoin Cash (<a href=\"https://cointelegraph.com/bitcoin-cash-price-index\">BCH</a>). In the coming months, EDX plans to introduce EDX Clearing, a clearinghouse to settle trades executed on the EDX Markets platform.</p><h2>Blackrock’s spot Bitcoin ETF renews optimism, sparks wave of new filings</h2><p>At least three investment firms <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-new-sec-filings-wisdomtree-invesco\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/blackrock-spot-bitcoin-etf-new-sec-filings-wisdomtree-invesco/amp\">have filed for spot Bitcoin ETFs</a> following investment goliath BlackRock’s move to lodge a similar application on June 15. Asset management fund WisdomTree is seeking permission from the SEC to list its “WisdomTree Bitcoin Trust” for a third time. Less than four hours after the WisdomTree filing, global investment manager Invesco “reactivated” its application for a similar product, followed by a request from Valkyrie Investments on June 21. Moreover, rumors have begun circulating that the multitrillion-dollar fund manager Fidelity Investments may also be looking to capitalize on the newfound frenzy for spot Bitcoin ETFs. While the SEC has not yet approved a single spot Bitcoin ETF product, Bloomberg senior ETF analyst Eric Balchunas noted that “BlackRock breathed new life into the race.” </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">WisdomTree has filed for spot bitcoin ETF h/t <a href=\"https://twitter.com/NateGeraci?ref_src=twsrc%5Etfw\">@NateGeraci</a> <a href=\"https://t.co/JwXj8rTs2X\">pic.twitter.com/JwXj8rTs2X</a></p>— Eric Balchunas (@EricBalchunas) <a href=\"https://twitter.com/EricBalchunas/status/1671271876339933184?ref_src=twsrc%5Etfw\">June 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>CleanSpark buys two Bitcoin mining campuses for $9.3 million</h2><p>Crypto mining firm CleanSpark continues its aggressive infrastructure expansion in the U.S. by <a href=\"https://cointelegraph.com/news/cleanspark-buys-two-bitcoin-mining-campuses-georgia\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cleanspark-buys-two-bitcoin-mining-campuses-georgia/amp\">acquiring two Bitcoin mining facilities</a> in a $9.3 million cash deal. The facilities will host over 6,000 Antminer S19 XPs and S19J Pro+s, which are expected to add about one exahash per second (EH/s) to CleanSpark’s hash rate following the deal’s completion. According to Zach Bradford, CEO of CleanSpark, the newly acquired infrastructure will enable the company to reach its target of 16 EH/s by the end of 2023. The purchase follows several other acquisitions by CleanSpark in recent months, despite a slump in BTC mining profitability during the bear market.</p><h2>Gemini plans Asia-Pacific expansion as part of “next wave of growth for crypto”</h2><p>Cryptocurrency exchange Gemini <a href=\"https://cointelegraph.com/news/gemini-plans-asia-pacific-expansion-as-part-of-next-wave-of-growth-for-crypto\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/gemini-plans-asia-pacific-expansion-as-part-of-next-wave-of-growth-for-crypto/amp\">has announced plans to expand</a> into the Asia-Pacific (APAC) region by increasing the staff at the firm’s Singapore office and establishing an engineering division in India. In a blog post, Gemini hinted at “larger” plans for expanding into the region in the next 12 months. “We believe that APAC will be a great driver of the next wave of growth for crypto and Gemini,” said the exchange. Gemini seemed to be exploring different markets amid the crackdown on many crypto firms in the United States. In April, the exchange took the first steps to become a restricted dealer with Canada’s Ontario Securities Commission. Last month, it chose Ireland as a base to grow the firm’s services across Europe.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ We’re expanding in the Asia Pacific region!<br><br>Our Singapore office will serve as a hub for our larger APAC operations and we plan to increase our headcount to 100+ in Singapore  <a href=\"https://t.co/4fo06cKiLb\">pic.twitter.com/4fo06cKiLb</a></p>— Gemini (@Gemini) <a href=\"https://twitter.com/Gemini/status/1671128649850933252?ref_src=twsrc%5Etfw\">June 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Before you go: Bitcoin hits $28,000 after BlackRock files for BTC ETF</h2><p>In the latest episode of The Market Report, Cointelegraph analyst and writer Marcel Pechman explains <a href=\"https://cointelegraph.com/news/bitcoin-hits-28-000-after-blackrock-files-for-btc-etf\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-hits-28-000-after-blackrock-files-for-btc-etf/amp\">what’s behind Bitcoin reaching 50% crypto market dominance</a> for the first time in two years amid Blackrock’s spot ETF filing and the U.S. SEC’s crackdown on altcoins. You won’t want to miss it!</p><p><em>Crypto Biz is your weekly pulse of the business behind blockchain and crypto, delivered directly to your inbox every Thursday.</em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T21:37:00.000Z",
    "title": "Monero Price Prediction 2023-2032: Should You Buy XMR Now?",
    "url": "https://www.cryptopolitan.com/monero-price-prediction/",
    "description": "Monero Price Prediction 2023-2032 This Monero Price Prediction will cover details about Monero, applications, price history, and factors affecting the native currency. There are plenty of things to consider before moving on to the Monero (XMR) price prediction. How much is Monero worth? Today&#8217;s Monero price is $154.30 USD with a 24-hour trading volume of $79,400,475 ... <a title=\"Monero Price Prediction 2023-2032: Should You Buy XMR Now?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/monero-price-prediction/\" aria-label=\"More on Monero Price Prediction 2023-2032: Should You Buy XMR Now?\">Read more</a>"
  }
]