[
  {
    "source": "Cryptopolitan",
    "date": "2023-10-09T15:05:19.000Z",
    "title": "OpenSea responds to allegations against its former employee",
    "url": "https://www.cryptopolitan.com/opensea-responds-allegations-former-employee/",
    "description": "OpenSea, a prominent nonfungible token (NFT) platform, has issued a response to recent accusations on social media suggesting that a former employee, Kevin Pawlak, was linked to the infamous AnubisDAO rug pull in 2021. The allegations surfaced in an October 6th thread on X (formerly Twitter), initiated by the anonymous account NFT Ethics. NFT Ethics ... <a title=\"OpenSea responds to allegations against its former employee\" class=\"read-more\" href=\"https://www.cryptopolitan.com/opensea-responds-allegations-former-employee/\" aria-label=\"More on OpenSea responds to allegations against its former employee\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-09T14:56:00.000Z",
    "title": "How to Effectively Use JSON-RPC (Remote Procedure Calls)",
    "url": "https://www.cryptopolitan.com/how-to-use-json-rpc-remote-procedure-calls/",
    "description": "The world of API protocols has seen a continuous rise in recent times, and among them, JSON-RPC stands out as a popular choice. It has become a favored tool for developers looking to create feature-rich and high-speed websites. But what exactly is JSON, and what makes RPC (Remote Procedure Call) unique when combined? JSON, short ... <a title=\"How to Effectively Use JSON-RPC (Remote Procedure Calls)\" class=\"read-more\" href=\"https://www.cryptopolitan.com/how-to-use-json-rpc-remote-procedure-calls/\" aria-label=\"More on How to Effectively Use JSON-RPC (Remote Procedure Calls)\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-09T15:00:29.000Z",
    "title": "Bitcoin Trader Shares The “Only Chart” You Need To Profit From BTC In 2024",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-trader-shares-the-only-chart-you-need-to-profit-from-btc-in-2024/",
    "description": "The Bitcoin price has been retracing over today’s trading session after reclaiming some lost ground. The selling pressure could push BTC back to critical support levels unless buyers can stop the current price action. Related Reading: Bitcoin Price Ready For Blast-Off As Key Metrics Signal A Bull Run: Top Analyst As of this writing, Bitcoin trades at $27,400 with a 2% loss in the last 24 hours. Over the previous week, the cryptocurrency recorded a 3% loss as the rest of the crypto top 10 by market cap moves in a similar direction. The One Bitcoin Chart For Success? Crypto analyst and trader Rekt Capital shared a thesis supported on the upcoming Bitcoin Halving. This event was designed to halve the rewards miners granted to include new blockchain transactions. In 2024, these rewards will drop from the current 6.25 BTC per block to 3.125 BTC. The halving is one of the most important events in the Bitcoin ecosystem as it directly impacts the supply and demand dynamics of the BTC market. Rekt Capital believes that the cryptocurrency behaves in a certain way as the Halving approaches. In 2019, after years of trending to the downside and moving sideways, Bitcoin experienced a relief rally. The analyst believes the upside momentum experienced in the past weeks coincides with this relief rally. The chart below shows that the 2019 and the current price action are similar. The chart shows the cryptocurrency crashed from the short-term top formed after the relief rally. If history repeats, the Bitcoin price will drop to the lows of the triangle, targeting a critical resistance of around $30,000. Following The Roadmap In the financial world, traders often look at past price data to predict future results, but history rarely repeats similarly. However, Rekt Capital believes a crash from the current levels or the area closest to $30,000 could be an opportunity and a roadmap. Market participants should be on the look of this crash and of a spike in trading volume as BTC reaches a critical point. Two months before the halving, this spike in volume should hint at an imminent rally. Related Reading: Crypto Analyst Presents Data To Prove That XRP Is Deflationary In the short term, traders should keep an eye on the low pointed out by the analyst; if Bitcoin touches these levels, there is an opportunity to set up a position before BTC reclaims the area above $30,000. As the chart above shows, the cryptocurrency often breaks critical resistance very close to the Halving. Rekt Capital wrote: ~60 days before the Halving, a Pre-Halving rally tends to occur (light blue). In anticipation of the Halving, investors &#8220;Buy the Hype&#8221; in an effort to &#8220;Sell the News.” Once Bitcoin breaks out from the re-accumulation area breakout into the parabolic uptrend (green). It is during this phase Bitcoin experiences accelerated growth on its way to new All Time Highs. Cover image from Unsplash, chart from Tradingview"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-09T14:52:00.000Z",
    "title": "Analysts Predict XRP, Others to Rival Gold as US Dollar Collapses",
    "url": "https://coinedition.com/analysts-predict-xrp-others-to-rival-gold-as-us-dollar-collapses/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/XRP-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/XRP-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/XRP-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/XRP-1-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Analysts in the United States have predicted that cryptocurrency tokens, such as XRP, may see renewed institutional and individual interest, Forbes reported. These predictions come in the wake of the U.S. dollar collapse. In particular, the report captured that analysts at investment firm Jefferies Group have warned the U.S. dollar may crash further as the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/analysts-predict-xrp-others-to-rival-gold-as-us-dollar-collapses/\">Analysts Predict XRP, Others to Rival Gold as US Dollar Collapses</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]