[
  {
    "source": "CoinDesk",
    "date": "2023-06-07T08:48:42.000Z",
    "title": "Bitcoin, Dogecoin Lead Bounce in Crypto Majors Day After Record 8-Month Liquidations",
    "url": "https://www.coindesk.com/markets/2023/06/07/bitcoin-dogecoin-lead-bounce-in-crypto-majors-day-after-record-8-month-liquidations/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto markets added 3.3% to overall capitalization in the past 24 hours as some opined the recent SEC filings could strengthen bitcoin's value proposition among investors."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-07T08:39:41.000Z",
    "title": "U.S. Lawmakers Urge IRS, Treasury to Hurry Crypto Tax Rules",
    "url": "https://www.coindesk.com/policy/2023/06/07/us-lawmakers-urge-irs-treasury-to-hurry-crypto-tax-rules/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Congressmen Brad Sherman and Stephen Lynch called the crypto industry \"a major source of tax evasion\" in a letter asking for the prompt release of proposed regulations."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-07T09:05:00.000Z",
    "title": "The Philippines delays publishing crypto framework",
    "url": "https://cointelegraph.com/news/the-philippines-delays-publishing-crypto-framework",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/1b395357-a399-4ed5-959d-aa7b5b8f17ec.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Despite the wave of market failures in 2022, the Philippines' financial regulator decided not to rush the legal framework on the crypto industry, earlier planned to be published late last year.</p>\n                    <p><p>Despite the wave of market failures in 2022, the Philippines' financial regulator decided not to rush the legal framework on the crypto industry, earlier planned to be published late last year. However, the work on the guidelines is still going and the results could be made public this year. </p><p>Being <a href=\"https://www.philstar.com/business/2023/06/05/2271456/sec-delays-issuance-framework-crypto-assets\" target=\"_blank\" rel=\"noopener nofollow\">cited</a> by the local media outlet, the chairman of the Philippines Securities and Exchange Commission (SEC), Emilio Aquino, revealed that previous deadlines for introducing the crypto framework in the country were moved. The regulatory authority was planning to introduce guidelines for the industry in 2022 but held back the initiative to study the reasons behind the collapse of the FTX exchange to ensure the investors' protection. </p><p>However, according to Aquino, the framework still might be issued until the end of 2023:</p><blockquote>“We haven’t closed the door. We really just have to make sure people don’t get burned.”</blockquote><p>Earlier this year, the SEC partnered with the University of the Philippines Law Center (UPLC) to work on the guidelines for digital assets together. In January 2023, the Commission had in fact <a href=\"https://cointelegraph.com/news/philippines-securities-regulator-seeks-more-authority-to-police-the-crypto-industry\">put forward for public comment</a> the Implementing Rules and Regulations (IRR) of Republic Act No. 11765, signed into law last year. However, the Act itself doesn’t contain a single “crypto” or “blockchain” word. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/hong-kong-s-regulatory-lead-sets-it-up-to-be-major-crypto-hub\"><strong><em>Hong Kong’s regulatory lead sets it up to be major crypto hub</em></strong></a></p><p>The pressure on the industry has been growing last year in the Philippines. The country’s central bank has been <a href=\"https://cointelegraph.com/news/the-philippines-pushes-back-against-foreign-exchanges-continuing-a-protectionist-streak\">urging citizens not to engage</a> in any operations with unregistered or foreign crypto exchanges, the SEC has been making <a href=\"https://cointelegraph.com/news/philippine-sec-warns-against-unlicensed-crypto-exchanges-amid-ftx-collapse\">the same claims</a>. In May 2023, the SEC called Gemini Derivatives an <a href=\"https://cointelegraph.com/news/philippines-sec-says-gemini-derivatives-is-unregistered-securities-product\">unregistered security product</a> under national law. </p><p>Still, the country remains a <a href=\"https://cointelegraph.com/news/philippines-digital-transformation-could-make-it-a-new-crypto-hub\">hypothetically attractive destination</a> for crypto. It is considered one of the fastest-growing economies in the world, and over 11.6 million Filipinos own digital assets, putting it 10th worldwide in terms of adoption.</p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\"><strong><em>Tornado Cash 2.0: The race to build safe and legal coin mixers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-07T08:48:44.000Z",
    "title": "SEC lawsuit claims Binance.US, Changpeng Zhao put customer funds ‘at significant risk’  ",
    "url": "https://cointelegraph.com/news/sec-lawsuit-binance-us-cz-put-funds-at-risk",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/58bf3030-c71b-40fb-936c-d86f48bcfc8d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> One of the latest SEC filings in its lawsuit against Binance says billions in customer funds are at the “mercy” of Binance CEO Changpeng Zhao.  </p>\n                    <p><p>The United States Securities and Exchange Commission (SEC) has filed another document in its <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">lawsuit against Binance.US</a>, saying investors’ funds are at risk. </p><p>In the <a href=\"https://www.courtlistener.com/docket/67474542/1/securities-and-exchange-commission-v-binance-holdings-limited/\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> entered on June 5, the regulators claim that the defendants, including Binance CEO Changpeng Zhao and Binance Holdings Ltd., “have enriched themselves by billions of U.S. dollars while placing investors’ assets at significant risk.”</p><p>It goes on to say that the defendants’ made “purposeful efforts” to bypass U.S. regulatory oversight while providing securities-related services to U.S. users. </p><blockquote>“[This] puts the safety of billions of dollars of U.S. investor capital at risk and at Binance’s and Zhao’s mercy.”</blockquote><p>A <a href=\"https://www.cnbc.com/2023/06/06/2point2-billion-of-binance-customer-assets-at-significant-risk-sec-says.html\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from CNBC claims that the number cited by the SEC goes as high as $2.2 billion. </p><p>The filing gives an example of billions of U.S. dollars of customer funds from both Binance platforms being “commingled” in an account operated by a “Zhaocontrolled entity,” which it identified as Merit Peak Limited. </p><p>It said funds were then transferred to a third party “apparently in connection” with the purchase and sale of crypto assets. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/sec-gensler-parallels-binance-ftx-sued\"><strong><em>SEC's Gensler claims ‘parallels’ between Binance and FTX, yet one wasn't sued</em></strong></a></p><p>According to regulators the arrangement has given and continues to give Zhao “free reign” of billions in deposited assets on the Binance.US platform, “with no oversight or controls to ensure that the assets are properly secured.”</p><p>At the time of writing, Binance.US has said that user funds on the platform <a href=\"https://cointelegraph.com/news/binance-us-user-funds-safe-amid-sec-injunction-freeze-assets\">“remain safe”</a> amid the SEC’s attempts to freeze assets.</p><p>On June 6, the U.S. regulators <a href=\"https://cointelegraph.com/news/sec-files-motion-for-restraining-order-against-binance\">filed a motion for a restraining order</a> against Binance due to mishandling user funds and operating with unregistered securities. The freezing of assets was one of the requested actions included in the motion. </p><p>The latest lawsuit of the SEC vs Binance, as well as its lawsuit against Coinbase has resulted in the regulator labeling at least <a href=\"https://cointelegraph.com/news/sec-labels-61-cryptocurrencies-securities-after-binance-suit\">67 different cryptocurrencies</a> as securities. This affects more than $100 billion worth of tokens in the market.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\"><strong><em>Tornado Cash 2.0: The race to build safe and legal coin mixers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-07T08:57:00.000Z",
    "title": "Coinbase CEO Brian Armstrong Unfazed By SEC Lawsuit",
    "url": "https://cryptodaily.co.uk/2023/06/coinbase-ceo-brian-armstrong-unfazed-by-sec-lawsuit",
    "description": "<p>Coinbase CEO Brian Armstrong has welcomed the SEC lawsuit against his exchange, stating that a court battle will help establish much-needed clarity around crypto rules and regulations.&nbsp;</p>\n<p>The CEO expressed complete confidence in the exchange&rsquo;s legal team and the facts and the law around crypto.&nbsp;</p>\nA Chance For Better Clarity&nbsp;\n<p>Coinbase CEO Armstrong appeared unfazed in the face of a new lawsuit against the exchange by the United States Securities and Exchange Commission (SEC). Both Coinbase and its CEO issued separate statements discussing Coinbase&rsquo;s views and chances of victory against the latest legal battle against the regulator. In a tweet shared on Tuesday, Armstrong stated that Coinbase would be proud to represent the crypto ecosystem against the SEC, adding that a court battle was probably required to get some much-needed clarity around crypto and the rules governing it.&nbsp;</p>\n\n<p>&ldquo;Regarding the SEC complaint against us today, we&rsquo;re proud to represent the industry in court to finally get some clarity around crypto rules. We&rsquo;ll get the job done. In the meantime, let&rsquo;s all keep moving forward and building as an industry. America will get this right in the end.&rdquo;</p>\n\n<p>Armstrong added that the Securities and Exchange Commission had reviewed Coinbase&rsquo;s business and allowed it to become a public company in 2021. He also added that the exchange does not list securities, rejecting a vast number of assets that they review. Armstrong also talked about conflicting statements emerging from the SEC and the Commodity Futures Trading Commission (CFTC), adding that they can&rsquo;t agree among themselves on what is a security and what is a commodity.&nbsp;</p>\n\n<p>&ldquo;There is no path to &ldquo;come in and register&rdquo; - we tried, repeatedly - so we don&rsquo;t list securities. We reject the vast majority of assets we review. The SEC and CFTC have made conflicting statements and don&rsquo;t even agree on what is a security and what is a commodity.&rdquo;</p>\n\nWhy Is The SEC Suing Coinbase?&nbsp;\n<p>The SEC sued Coinbase, alleging that the New York-based crypto exchange broke US securities laws by offering unregistered securities. The lawsuit alleged that Coinbase never registered as a clearing agency, broker, or national securities exchange. The regulator further alleged that several crypto tokens offered by the exchange, including prominent assets such as Polygon (MATIC), Cardano (ADA), Solana (SOL), and several others, qualified as securities. The lawsuit also alleges that Coinbase has been operating as an unregistered security broker since 2019, two years before its initial public offering.&nbsp;</p>\nA Tetchy Relationship&nbsp;\n<p>Coinbase and Armstrong have been extremely critical of the SEC for failing to draft clear rules and clarifying how securities laws apply to the crypto industry. The crypto space has long requested clarification about which digital assets would qualify as securities and which as commodities. Coinbase had sued the SEC in April when the latter failed to respond to a petition by Coinbase to provide rules governing digitally traded securities. At the time, the SEC stated that crypto already had clear rules and regulations to govern it and responded to the suit by arguing for dismissal on the 5th of May. In response, Coinbase filed a mandamus reply supporting its suit against the SEC.&nbsp;</p>\n<p>The United States Congress is looking to introduce crypto-specific legislation, which could lend some clarity to the situation. For the moment, Coinbase and the Securities and Exchange Commission are entangled in separate legal proceedings against each other.&nbsp;</p>\nCoinbase Committed To Regulatory Compliance&nbsp;\n<p>Coinbase also provided stats to prove that it is committed to regulatory compliance and failure on the SEC&rsquo;s part to cooperate. The exchange stated that it had mentioned &ldquo;staking&rdquo; 57 times in its S1 report, which the SEC approved. It also added that it met the SEC privately to seek guidance on how to stay legally compliant. The exchange criticized the SEC, stating that it had established no rules pertaining to crypto and relied on a test written in 1946 (Howey test) to determine if assets are securities.</p>\n<p>However, others have pointed out that the SEC had made it clear in its approval that it did not necessarily approve the legality of the exchange&rsquo;s underlying business.&nbsp;</p>\n\n<p>&ldquo;To the folks posting that it&rsquo;s unfair that the SEC is filing an action when they approved the Coinbase IPO, please stop. @coinbase was warned that approval of the registration statement didn&rsquo;t mean approval of the underlying business activity.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-07T08:54:08.000Z",
    "title": "How Blockchain Technology Offers a New Paradigm for Decentralized Philanthropy",
    "url": "https://www.cryptopolitan.com/blockchain-offers-decentralized-philanthropy/",
    "description": "The emergence of decentralized systems is reshaping the traditional model of philanthropy. Decentralized philanthropy, driven by the transformative potential of blockchain technology, offers a new paradigm for charitable giving that aims to revolutionize how we engage with social causes. This Cryptopolitan guide explores the concept of decentralized philanthropy, its foundations in blockchain technology, and its ... <a title=\"How Blockchain Technology Offers a New Paradigm for Decentralized Philanthropy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blockchain-offers-decentralized-philanthropy/\" aria-label=\"More on How Blockchain Technology Offers a New Paradigm for Decentralized Philanthropy\">Read more</a>"
  }
]