[
  {
    "source": "CoinDesk",
    "date": "2023-08-02T11:16:48.000Z",
    "title": "A New Bitcoin-Based Arcade Game Is Leaving a Mark on Gamers",
    "url": "https://www.coindesk.com/tech/2023/08/02/a-new-bitcoin-based-arcade-game-is-leaving-a-mark-on-gamers/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A platform that went live last week looks to expand bitcoin usage by attracting players to win-to-earn games that run wholly on the Bitcoin blockchain."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-02T10:26:44.000Z",
    "title": "Sam Bankman-Fried's Lawyers Say Basis for Revoking Bail Is 'Extremely Thin'",
    "url": "https://decrypt.co/150946/sam-bankman-frieds-lawyers-say-basis-revoking-bail-is-extremely-thin",
    "description": "Bankman-Fried's defense fights back against the DOJ’s recent motion, saying it's based on “innuendo” and “assumptions.”"
  },
  {
    "source": "Decrypt",
    "date": "2023-08-02T09:41:15.000Z",
    "title": "Kenya Suspends Worldcoin Operations Amid Privacy Concerns",
    "url": "https://decrypt.co/150942/kenya-suspends-worldcoin-operations-privacy-concerns",
    "description": "Worldcoin faces further scrutiny over its iris-scanning project, despite over 2 million sign-ups worldwide."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-02T09:05:56.000Z",
    "title": "Coinbase Mulling Best Ways to Integrate Lightning Network for Bitcoin",
    "url": "https://decrypt.co/150938/coinbase-mulling-best-ways-integrate-lightning-network-bitcoin",
    "description": "Coinbase CEO Brian Armstrong has reiterated the crypto exchange’s intention to add support for Bitcoin’s Layer-2 scaling solution. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T11:31:42.000Z",
    "title": "Mixed signals: Binance denies reports of $90 billion in crypto trades in China ",
    "url": "https://cointelegraph.com/news/binance-denies-reports-of-billions-in-crypto-trades-in-china",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/11635533-cb70-4908-a628-d4484e307eb1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Binance has refuted claims published in the Wall Street Journal that despite China’s crypto ban, the exchange has conducted billions in crypto-related business in the country. </p>\n                    <p><p>Binance has reportedly continued operations in China, despite the country’s ban on cryptocurrencies, even conducting billions of dollars worth of transactions monthly, according to a Wall Street Journal <a href=\"https://www.wsj.com/articles/crypto-is-illegal-in-china-binance-does-90-billion-of-business-there-anyway-2a0af975?mod=latest_headlines\" target=\"_blank\" rel=\"noopener nofollow\">investigation</a>. </p><p>The WSJ report says its reporters, along with current and former employees of Binance, viewed “internal figures” that revealed users traded $90 billion in cryptocurrency-related assets in China during the time span of only one month. </p><p>However, as these claims surfaced Binance has come out in denial of conducting any business in China. In a statement given to Cointelegraph via email, a Binance representative said: </p><blockquote>“The Binance.com website is blocked in China and is not accessible to China-based users.\"</blockquote><p>Cointelegraph is waiting for additional comments from the cryptocurrency exchange on whether it is looking into the claims and any next steps it plans to take. </p><p>This is not the first time Binance has been accused of continuing ties with Chinese customers after the country imposed its nationwide ban on cryptocurrencies. In March, Binance employees <a href=\"https://cointelegraph.com/news/binance-employees-allegedly-help-customers-in-china-bypass-kyc-controls\">allegedly helped customers</a> in mainland China bypass its KYC controls. </p><p>In this incident, the exchange did not refute the claims. Rather said that it has, “taken action” against the employees who “may have violated” its internal policies, which it said included “wrongly soliciting or making recommendations that are not allowed or in line with our standards.”</p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/binance-launches-regulated-platform-in-kazakhstan\"><strong><em>Binance launches regulated platform in Kazakhstan amid troubles in the West</em></strong></a></p><p>That same day, speaking to Cointelegraph a Binance employee said the company would be doing <a href=\"https://cointelegraph.com/news/binance-launches-internal-investigation-following-kyc-bypass-rumors\">an “internal investigation”</a> into the accused employees. </p><p>In the weeks following, another report was released claiming that <a href=\"https://cointelegraph.com/news/binance-concealed-ties-to-china-for-years-even-after-2017-crypto-crackdown-report\">Binance continued to keep staff</a> and operations in China although it announced its departure in 2017 after China’s initial ban on crypto. </p><p>Binance’s remaining presence was reported to include an office that was still in use at the end of 2019, along with a Chinese bank account used to pay employees.</p><p>In recent months, Binance has been facing turmoil regarding its operations with regulators around the world. Belgian authorities asked Binance to <a href=\"https://cointelegraph.com/news/belgian-financial-regulator-orders-binance-cease-virtual-currency-services\">cease all digital currency services </a>in the country back in June. </p><p>The cryptocurrency exchange<a href=\"https://cointelegraph.com/news/binance-withdraws-crypto-license-germany\"> withdrew its crypto license</a> application in Germany on July 26, after reports of rejections from the German financial authority. </p><p>Most recently on Aug. 2, Binance came forward with “no comment” in regards to reports that alleged it mulled <a href=\"https://cointelegraph.com/news/binance-says-no-comment-on-report-it-mulled-closing-u-s-arm-to-protect-its-global-firm\">closing its U.S. branch </a>to protect its global operations. </p><p>Despite rough waters for the exchange, on Aug. 1 it <a href=\"https://cointelegraph.com/news/binance-japan-begins-launching-trading-services\">launched trading operations in Japan</a> with a warm welcome from local financial authorities. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/chinese-police-web3-blockchain-centralization-continues-asia-express/\"><strong><em>Chinese police vs. Web3, blockchain centralization continues: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T11:07:00.000Z",
    "title": "How to detect fake news with natural language processing",
    "url": "https://cointelegraph.com/news/detect-fake-news-with-natural-language-processing",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/0b73a953-a4e3-460e-98b5-e17e903a803e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Unravel the power of NLP in spotting fake news with various techniques and real-world examples. </p>\n                    <p><p>The sheer volume of information produced every day makes it difficult to distinguish between real and fake news, but advances in <a href=\"https://cointelegraph.com/news/5-real-world-applications-of-natural-language-processing-nlp\">natural language processing (NLP)</a> present a possible solution. </p><p>In today’s digital era, the spread of information via social media and internet platforms has given people the power to access news from many different sources. The growth of fake news, meanwhile, is a drawback of this independence. Fake news is inaccurate information that has been purposefully spread to confuse the public and undermine confidence in reputable journalism. Maintaining an informed and united global community requires identifying and eliminating fake news.</p><p>NLP, a subfield of <a href=\"https://cointelegraph.com/news/a-brief-history-of-artificial-intelligence\">artificial intelligence</a>, gives computers the capacity to comprehend and interpret human language, making it a crucial tool for identifying deceptive information. This article examines how NLP can be used to identify fake news and gives examples of how it can be used to unearth misleading data.</p><h2>Sentimental analysis</h2><p>To identify bogus news, sentiment analysis using NLP can be an effective strategy. NLP algorithms can ascertain the intention and any biases of an author by analyzing the emotions displayed in a news story or social media post. Fake news frequently preys on readers’ emotions by using strong language or exaggeration.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Extracting opinion phrases from user reviews with Stanford CoreNLP <a href=\"http://t.co/t6VIzfNRfz\">http://t.co/t6VIzfNRfz</a> <a href=\"https://twitter.com/hashtag/machinelearning?src=hash&amp;ref_src=twsrc%5Etfw\">#machinelearning</a> <a href=\"https://twitter.com/hashtag/nlp?src=hash&amp;ref_src=twsrc%5Etfw\">#nlp</a> <a href=\"http://t.co/RHiTl40Q7c\">pic.twitter.com/RHiTl40Q7c</a></p>&mdash; Julian Hillebrand (@JulianHi) <a href=\"https://twitter.com/JulianHi/status/510172682789617665?ref_src=twsrc%5Etfw\">September 11, 2014</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>A news item covering a political incident, for instance, can be identified by an NLP-based sentiment analysis model as being significantly biased in favor of a specific party and using emotionally charged language to affect public opinion.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/5-natural-language-processing-libraries-to-use\">5 natural language processing (NLP) libraries to use</a></em></strong></p><h2>Semantic analysis and fact-checking</h2><p>To confirm the accuracy of the material, fact-checking tools driven by NLP can analyze the content of a news piece against reliable sources or databases. By highlighting inconsistencies and contradictions that can point to fake news, semantic analysis aids in understanding the meaning and context of the language that is being used.</p><p>An NLP-based fact-checking system, for instance, can instantly cross-reference a news article’s assertion that a well-known celebrity endorses a contentious product with reliable sources to ascertain its veracity.</p><h2>Named entity recognition (NER)</h2><p>In NLP, named entity recognition (NER) enables computers to recognize and categorize particular entities referenced in a text, such as individuals, groups, places or dates. By identifying significant players, fake news can be debunked by discovering contradictions or made-up information.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Named Entity Recognition (NER) identifies and classifies entities in text.<br><br>You can extract structured information for information retrieval and knowledge management.</p>&mdash; Simform (@simform) <a href=\"https://twitter.com/simform/status/1685981551044300800?ref_src=twsrc%5Etfw\">July 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Examples of nonexistent organizations or locales that NER algorithms may highlight as potential signs of false news are mentions in news articles about purported environmental disasters.</p><h2>Recognizing sensationalism and clickbait</h2><p>NLP models may be trained to spot sensationalized language and clickbait headlines, both of which are characteristics of fake news. These methods can assist in filtering out false information and ranking trustworthy news sources.</p><p>For instance, sensational phrases and inflated claims that frequently accompany clickbait articles can be found by analyzing headlines and content using an NLP-powered algorithm.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/5-emerging-trends-in-deep-learning-and-artificial-intelligence\">5 emerging trends in deep learning and artificial intelligence</a></em></strong></p><h2>Assessing the reliability of the source</h2><p>NLP methods are capable of analyzing historical information on news organizations, such as their standing, reliability and historical reporting accuracy. This data can be used to evaluate the validity of fresh content and spot potential fake news sources.</p><p>For instance, an NLP-powered system may evaluate the legitimacy of a less well-known website that published a startling news report before deeming the content reliable.</p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T11:01:28.000Z",
    "title": "Abracadabra proposes hiking loan interest rate by 200% to manage Curve risk",
    "url": "https://cointelegraph.com/news/abracadabra-hike-loan-interest-rate-by-200-curve-risk",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/b4ed81a2-8080-4d6b-b6fe-a30a48b44cab.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Curve Finance exploit has created a liquidity crisis in the DeFi ecosystem, with several lending protocols rushing to minimize their exposure. </p>\n                    <p><p>Abracadabra Money, a cross-chain lending platform, has <a href=\"https://forum.abracadabra.money/t/aip-13-5-interest-rate-adjustment-for-the-crv-cauldrons/4320\" target=\"_blank\" rel=\"noopener nofollow\">proposed</a> increasing the interest rate on its outstanding loans to manage risks associated with its exposure to Curve DAO (CRV). The proposal drew mixed reactions from the community, with several questioning the modification of loan terms, while others called it a great plan to cut down exposure to CRV.</p><p>Abracadabra protocol allows users to earn money by using interest-bearing assets such as CRV, Convex Finance (CVX) and Yearn.finance (<a href=\"https://cointelegraph.com/yearn-finance-price-index\">YFI</a>) as collateral to mint Magic Internet Money (MIM) — a United States dollar-pegged stablecoin. Spell Token (SPELL) is the native governance and staking token of the Abracadabra platform. </p><p>Curve founder <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2022/michael-egorov\">Michael Egorov</a> has nearly $100 million in loans across various lending protocols backed by 427.5 million CRV which is 47% of the circulation supply of the Curve token. Curve founder has 51.65 million CRV collateral and 14 million MIM debt positions on Abracadabra.</p><p>Abracadabra is exposed to significant amounts of CRV risk due to recent exploits on the DeFi protocol, leading to a liquidity crisis. The incident has changed the liquidity conditions that led to the listing of CRV as collateral on Abracadabra. </p><p>In order to address this issue a new proposal has been made to apply collateral-based interest to both CRV cauldrons. Cauldrons allow users to borrow MIM using another asset as collateral and each cauldron is collateral specific.</p><p> The improvement proposal called for an increase in the interest rate in order to reduce Abracadabra’s total CRV exposure to around $5 million borrowed MIM.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/white-hat-returns-5-million-curve-finance-hack\"><strong><em>Ethical hacker retrieves $5.4M for Curve Finance amid exploit</em></strong></a></p><p>The proposal aims to apply collateral-based interest similar to what the decentralized autonomous organization (DAO) did with the WBTC and WETH cauldrons. All interest will be charged directly on the cauldron’s collateral and will immediately move into the protocol’s treasury to increase the reserve factor of the DAO. </p><p>The DeFi protocol proposal estimated that for an $18 million principal loan amount, the base rate would be 200%. At this interest rate, the loan would be fully covered within six months. The proposal noted that as the principal is repaid, the base rate would decrease.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/a2ccb36b-899a-4720-835b-e533e8e27476.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Interest rate hike proposal. Source: Abracadabra</em></figcaption></figure><p>The voting for the proposal opened on Aug. 1 and will last until Aug. 3, and at press time a mammoth 99% of the votes were cast in favor of the proposal. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/35d1a631-f6df-40a4-8c07-6f3c2bab42ba.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Abracadabra improvement proposal voting snapshot. Source: Abracadabra</em></figcaption></figure><p>The proposal also drew various reactions from the crypto community including Frax Finance executive Drake Evans who called it a governance rug. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I&#39;m sorry but jacking interest rates to 200% via governance is a rug.  Changing the fundamental terms of a loan (10x interest rate) in a single transaction is very bad and we should call it out.<br><br>Very sympathetic to protecting protocol integrity but rugging is not the way <a href=\"https://t.co/sqWy7R0YPq\">https://t.co/sqWy7R0YPq</a></p>&mdash; Drake Evans (version 3) (@DrakeEvansV1) <a href=\"https://twitter.com/DrakeEvansV1/status/1686614715554746368?ref_src=twsrc%5Etfw\">August 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Others supported the proposal claiming it could very well help the lending protocol get rid of CRV exposure.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">If <a href=\"https://twitter.com/MIM_Spell?ref_src=twsrc%5Etfw\">@MIM_Spell</a> really tries this, I&#39;d say there&#39;s a good chance <a href=\"https://twitter.com/search?q=%24MIM&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$MIM</a> loses all <a href=\"https://twitter.com/search?q=%24CRV&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$CRV</a> gauges fairly quickly.<br><br>41m MIM (61% of total mcap) is on Curve!<a href=\"https://twitter.com/search?q=%24SPELL&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$SPELL</a> <a href=\"https://twitter.com/hashtag/DeFi?src=hash&amp;ref_src=twsrc%5Etfw\">#DeFi</a> <a href=\"https://t.co/vpm3bH4xct\">https://t.co/vpm3bH4xct</a></p>&mdash; DefiMoon  (@DefiMoon) <a href=\"https://twitter.com/DefiMoon/status/1686623688957841409?ref_src=twsrc%5Etfw\">August 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>With the price of Curve experiencing a stress test, the risk of a token dump has increased. In the meantime, many of the lending protocols are looking for ways to clear from their CRV exposure.</p><p><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/curve-finance-founder-100-million-debt-could-trigger-defi-implosion&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\"><strong>Collect this article as an NFT</strong></a> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethics-101-crypto-projects-negotiate-hackers/\"><strong><em>Should crypto projects ever negotiate with hackers? Probably</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T10:58:53.000Z",
    "title": "Ether ETFs pending — Grayscale, VanEck and others file SEC applications ",
    "url": "https://cointelegraph.com/news/asset-managers-file-ethereum-futures-etf-applications",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/73187c87-db37-4ef7-b5ba-0dea2d4c3e52.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A handful of United States asset managers have filed fresh applications to launch ETH futures ETFs. </p>\n                    <p><p>Six major asset managers, including Grayscale and VanEck, have filed fresh applications in a bid to launch Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) futures exchange-traded funds (ETF) to United States customers.</p><p>Separate filings submitted to the U.S. Securities and Exchange Commission reviewed by Cointelegraph outline respective applications from the likes of Grayscale, VanEck, Bitwise, Volatility Shares, ProShares and Round Hill Capital.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We officially have 5 different <a href=\"https://twitter.com/hashtag/Ethereum?src=hash&amp;ref_src=twsrc%5Etfw\">#Ethereum</a>  futures ETF filings submitted to the SEC. Would love to know what has changed since May, other than the fact that someone (Volatility Shares) applied on Friday. ProShares went straight for the inverse/short ETF. <a href=\"https://t.co/Qi8he0OwrU\">https://t.co/Qi8he0OwrU</a> <a href=\"https://t.co/qVVUwrUjOI\">pic.twitter.com/qVVUwrUjOI</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1686499879495852032?ref_src=twsrc%5Etfw\">August 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Grayscale’s <a href=\"https://www.sec.gov/Archives/edgar/data/1976672/000168035923000254/gftn1aa082023.htm\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> includes two applications: a proposed Grayscale Global Bitcoin Composite ETF and a Grayscale Ethereum Futures ETF. Grayscale’s Ether ETF will invest in futures contracts that are set to be traded on the Chicago Mercantile Exchange. </p><p>The SEC filing notes that Grayscale’s fund will primarily invest “front-month” Ether futures, which are contracts with “the shortest time to maturity.” Grayscale added that it intends to “roll” Ether futures contracts before they expire.</p><p>Volatility Shares also <a href=\"https://www.sec.gov/Archives/edgar/data/1884021/000138713123009033/ethu-485apos_072823.htm\" target=\"_blank\" rel=\"noopener nofollow\">outlined</a> plans to list an Ether futures ETF, investing its assets in cash-settled contracts referencing ETH trading on the Chicago Mercantile Exchange. It’s noted that the fund will not invest directly in Ether.</p><p>Volatility’s filing also notes that it intends to enter into cash-settled Ether futures contracts as the buyer. Cash-settled futures markets typically see a counterparty pay cash to the buyer if the price of a futures contract goes up, while the buyer would pay the counterparty if the price of the futures contract goes down. </p><p><strong><em>Related:</em></strong> <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-could-unlock-30-trillion-worth-of-wealth-bloomberg-analyst-says\"><strong><em>BlackRock Bitcoin ETF could unlock $30 trillion worth of wealth, Bloomberg analyst says</em></strong></a></p><p>VanEck’s <a href=\"https://www.sec.gov/Archives/edgar/data/1137360/000113736023000537/vaneckethereumstrategyetf4.htm\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> also indicates that its investment strategy will look to invest in ETH futures contracts so that the value of ETH that the fund has exposure to is equal to 100% of the total assets of the fund. </p><p>The filing notes that any changes in the value of ETH would result in larger changes to VanEck’s Ether ETF fund. This would include the potential for “greater losses than if the Fund’s exposure to the value of ETH were unleveraged.”</p><p>ProShares <a href=\"https://www.sec.gov/Archives/edgar/data/1174610/000168386323005800/f25596d1.htm\" target=\"_blank\" rel=\"noopener nofollow\">gave</a> an overview of their Short Ether Strategy ETF, which will invest in daily contracts that look to profit on losses of the S&amp;P CME Ether Futures index. As explained, the ProShares fund would gain as much as the index loses on a given day, while the converse would apply.</p><p>These applications come in the wake of recent applications from various mainstream asset management firms looking to launch Bitcoin ETFs. The world’s largest asset manager, BlackRock, is <a href=\"https://cointelegraph.com/learn/blackrocks-bitcoin-etf\">among those looking to offer</a> what would be the first Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) ETFs offered in the country. </p><p><em><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/elegant-and-ass-backward-jameson-lopps-first-impression-of-bitcoin/\">‘Elegant and ass-backward’: Jameson Lopp’s first impression of Bitcoin</a></strong></em></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T10:30:39.000Z",
    "title": "Ripple CEO slams SEC over the use of XRP report in lawsuit",
    "url": "https://cointelegraph.com/news/xrp-ripple-ceo-slams-sec-over-use-of-xrp-report-in-lawsuit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/cdda82ac-e986-4ef6-bb1b-6f9ca85e3b33.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Brad Garlinghouse stressed Ripple’s unchanged commitment to transparency but hinted that future reports might undergo some changes.</p>\n                    <p><p>Ripple CEO Brad Garlinhouse on Aug. 2 expressed his disapproval of the United States Securities and Exchange Commission for utilizing Ripple’s quarterly XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) Markets Report, designed to enhance transparency in the cryptocurrency industry, as evidence against the company in the ongoing lawsuit. </p><p>Garlinghouse <a href=\"https://twitter.com/bgarlinghouse/status/1686618130674774016\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> that the company initiated the reports with the intention of voluntarily offering updates on its XRP holdings. However, the CEO said these reports were later “used against” the company in the SEC’s lawsuit. Garlinghouse reiterated the company’s commitment to transparency but hinted that future reports might undergo some changes.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We began these reports to voluntarily provide updates given our XRP holdings. Sadly, they were used against us in the SEC lawsuit - however, we remain steadfast in our commitment to transparency but I suspect they’re going to look a bit different moving forward <a href=\"https://t.co/oANR6WCG09\">https://t.co/oANR6WCG09</a></p>&mdash; Brad Garlinghouse (@bgarlinghouse) <a href=\"https://twitter.com/bgarlinghouse/status/1686618130674774016?ref_src=twsrc%5Etfw\">August 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As per the official <a href=\"https://ripple.com/insights/q2-2023-xrp-markets-report/\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a> on July 31, Ripple, the crypto payments solutions firm, unveiled its Q2 2023 XRP Markets Report. This report stands out from previous quarters, as it centers on key highlights, such as Judge Torres’ significant summary judgment ruling, clarifying misconceptions and shedding light on Ripple’s XRP holdings.</p><p>The report reveals that Ripple’s XRP holdings surged from 5,506,585,918 to 5,551,119,094, representing an increase of approximately 45 million. Simultaneously, the total XRP on ledger escrow decreased by nearly 1 billion, which can be attributed to the rising demand for XRP.</p><p>In addition to Ripple CEO’s criticism, XRP lawyer John Deaton also <a href=\"https://twitter.com/JohnEDeaton1/status/1686627185774166016\" target=\"_blank\" rel=\"noopener nofollow\">expressed</a> strong disapproval of the SEC’s use of these reports as evidence against the company and its executives in the ongoing lawsuit. He said that Ripple willingly publishes these reports on a quarterly basis, while other firms not only conceal token sales but also deliberately disguise such transactions.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">It is absolutely true that the SEC used the transparency of these reports against Ripple and its two executives. As a private company, Ripple was under no obligation to share this info. Other companies not only didn’t share token sales, but intentionally disguised those… <a href=\"https://t.co/mbAO6feEfW\">https://t.co/mbAO6feEfW</a></p>&mdash; John E Deaton (@JohnEDeaton1) <a href=\"https://twitter.com/JohnEDeaton1/status/1686627185774166016?ref_src=twsrc%5Etfw\">August 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Ripple acknowledged the significant ruling made by Judge Torres in the case of <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">Securities and Exchange Commission v. Ripple Labs</a> on July 13, which declared that XRP is not considered a security. However, the company clarified that, while all XRP sales are not classified as securities, sales executed under written contracts can be categorized as investment contracts and thus fall under the security classification.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/judge-denies-motion-dismiss-terraform-sec-case-reject-ripple-ruling\"><strong><em>Judge rejects motion to dismiss Terraform case, disagrees with Ripple decision</em></strong></a></p><p>Furthermore, Ripple addressed misconceptions surrounding its partial victory, stressing that while XRP is not a security in certain contexts, it may still be considered as such in specific circumstances. Additionally, the company clarified that the ruling provides protection to sophisticated institutions but does not extend the same protection to retail buyers.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T09:41:41.000Z",
    "title": "Bitcoin bulls falter after BTC price briefly spikes through $30K",
    "url": "https://cointelegraph.com/news/bitcoin-btc-price-briefly-spikes-30k",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/4c3e2f68-bc1d-41d8-b591-8cbfb8d005ae.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC’s price strength attempts a comeback, but bulls run out of steam after briefly storming through key resistance levels.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) spiked above $30,000 on Aug. 2 as a tour of its trading range saw BTC price volatility return.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/b75d146a-c2c3-428a-8d37-dc36df783274.png\"><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><h2>Bitcoin comes full circle after trip to $30,000</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> followed BTC/USD as buyers staged a brief rally through key resistance.</p><p>Local highs of $30,025 were short-lived, with bulls unable to maintain momentum or hold the market above levels previously identified as pivot points.</p><p>These included both $30,000 and $29,500, with Bitcoin trading below both at the time of writing.</p><p>“I’d like to see $29.3K hold on LTF and then a clean break through $30K,” Michaël van de Poppe, founder and CEO of trading firm Eight, <a href=\"https://twitter.com/CryptoMichNL/status/1686654316449497088\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> in part of his latest analysis.</p><p>Popular trader Skew revealed the impetus behind the overnight action, with market makers and market takers battling it out to steer trajectory on lower timeframes.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/search?q=%24BTC&src=ctag&ref_src=twsrc%5Etfw\">$BTC</a> LTF signals (when using Delta/CVDs & Orderbook software)<br><br>Price action & market participation is very important in understanding price direction as well when rotations or mean reversions occur<br><br>You have two types of market participants<br>Makers & Takers <br><br>Makers use limit… <a href=\"https://t.co/CM9SRaG6x3\">https://t.co/CM9SRaG6x3</a> <a href=\"https://t.co/PiCUxvNOao\">pic.twitter.com/PiCUxvNOao</a></p>— Skew Δ (@52kskew) <a href=\"https://twitter.com/52kskew/status/1686616907154337792?ref_src=twsrc%5Etfw\">August 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Skew added that the four-hour chart was “so far looking like a classic SFP into a HTF S/R,” referencing a swing failure pattern and high-timeframe support/resistance flip, respectively. </p><p>“Price currently testing 4H high prior to the dump Liquidity & trend confirmation likely lower,” he <a href=\"https://twitter.com/52kskew/status/1686607691429634049\" target=\"_blank\" rel=\"noopener nofollow\">forecast</a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/76849a8f-99d4-4175-966d-1ca33843fd3e.jpeg\"><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Skew/Twitter</em></figcaption></figure><p>Fellow trader and analyst Rekt Capital, meanwhile, <a href=\"https://cointelegraph.com/news/bitcoin-loses-29k-traders-btc-price-next\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-loses-29k-traders-btc-price-next/amp\">stuck by an existing theory</a> that $29,250 was the line in the sand for bulls to hold onto.</p><p>“This recent bounce means that BTC looks to have reclaimed ~$29250 as support,” part of his most recent Twitter update <a href=\"https://twitter.com/rektcapital/status/1686662237593698304\" target=\"_blank\" rel=\"noopener nofollow\">summarized</a>. </p><blockquote>“However, the moment it turns into resistance is the moment that we could expect lower prices. For now, ~$29250 continues to hold.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/5121b563-8ae4-4390-9779-8e7ddbf62238.jpeg\"><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Rekt Capital/Twitter</em><a href=\"https://servedbyadbutler.com/redirect.spark?MID=169476&plid=2032566&setID=592928&channelID=0&CID=743589&banID=520952491&PID=0&textadID=0&tc=1&type=tclick&mt=1&hc=cf3bd9099fbeb259be18478ef5cf3396552e3e54&location=\" target=\"_blank\" rel=\"noopener nofollow\"></a></figcaption></figure><h2>BTC’s price rising trend line remains intact</h2><p>Updating his own roadmap for BTC price action, meanwhile, chartered market technician Aksel Kibar hinted that current support levels were more reliable than <a href=\"https://cointelegraph.com/news/bitcoin-volume-lowest-early-2021-25k\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-volume-lowest-early-2021-25k/amp\">some believed</a>.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-price-risks-25k-macro-new-analysis\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-price-risks-25k-macro-new-analysis/amp\">Bitcoin price risks $25K dip despite ‘macro pivot point’ — New analysis</a></em></strong></p><p>Of interest on the day was $28,400, with Kibar’s target for upside lying at $34,000.</p><p>“BTCUSD Seems like the trend line is a valid one as it is recognized by market participants,” he <a href=\"https://twitter.com/TechCharts/status/1686613120540684288/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">tweeted</a> alongside a chart.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/945decb8-7431-4a73-a51f-ad0744241ce9.png\"><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Aksel Kibar/Twitter</em></figcaption></figure><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-human-digital-souls-agi-alignment-problem-replika/\"><strong><em>Experts want to give AI human ‘souls’ so they don’t kill us all</em></strong></a></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-02T08:44:46.000Z",
    "title": "India makes suggestions for G20 crypto roadmap",
    "url": "https://cointelegraph.com/news/crypto-india-puts-forward-suggestions-for-g20-crypto-roadmap",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/069241b9-c36d-4aef-a660-a21744cb1d95.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The country emphasizes the necessity of dealing with the risks of digital assets in developing economies. </p>\n                    <p><p>India, which currently holds the Group of Twenty (G20) presidency, has supported the Financial Stability Board’s (FSB) recommendations for a global crypto framework published in July. The country also emphasized the necessity of dealing with the risks of digital assets for developing economies.</p><p>On Aug. 1, India <a href=\"https://www.g20.org/content/dam/gtwenty/gtwenty_new/document/Presidency_note_on_Framework_for_Crypto_Assets.pdf\" target=\"_blank\" rel=\"noopener nofollow\">released</a> its presidency note for input in a roadmap on a global framework for crypto. The document concurs with the guidelines written by the FSB, the Financial Action Task Force (FATF) and the International Monetary Fund (IMF). </p><p>However, the note suggests some additions, including an emphasis on developing countries. While the IMF pays attention to developing economies’ specifics in its potential guidelines for crypto, India urges the FSB to implement them as well. It also calls for outreach to all jurisdictions to “generate awareness of risks,” starting from countries with higher crypto adoption and extending the future regulatory approach to the digital economy beyond the scope of the G20. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/india-central-bank-negotiates-cross-border-cbdc-payments-with-digital-rupee\"><strong><em>India negotiates cross-border CBDC payments with global central banks</em></strong></a></p><p>As revealed in the note, the so-called Synthesis Paper by the IMF and FSB is due to be released at the end of August and provides a broad roadmap to be considered by the G20. </p><p>In July, the FSB published its <a href=\"https://cointelegraph.com/news/crypto-fsb-finalizes-its-recommendations-for-a-global-crypto-framework\">guidelines for crypto</a> and stablecoins. The FSB states that crypto platforms must segregate clients’ digital assets from their own funds and clearly separate functions to avoid conflict of interest, with regulators ensuring tight cross-border cooperation and oversight. The guidelines also include the obligation for stablecoin issuers to obtain a national license in any single jurisdiction before they can operate there. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/elegant-and-ass-backward-jameson-lopps-first-impression-of-bitcoin/\">‘Elegant and ass-backward’. Jameson Lopp’s first impression of Bitcoin</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-02T10:30:12.000Z",
    "title": "Nvidia shrinks AI image generation method to size of a WhatsApp message",
    "url": "https://cryptoslate.com/nvidia-shrinks-ai-image-generation-method-to-size-of-a-whatsapp-message/",
    "description": "<p>Nvidia researchers have developed a new AI image generation technique that could allow highly customized text-to-image models with a fraction of the storage requirements. According to a paper published on arXiv, the proposed method called &#8220;Perfusion&#8221; enables adding new visual concepts to an existing model using only 100KB of parameters per concept. As the paper&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/nvidia-shrinks-ai-image-generation-method-to-size-of-a-whatsapp-message/\">Nvidia shrinks AI image generation method to size of a WhatsApp message</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-02T10:00:58.000Z",
    "title": "Fitch downgrades US credit rating, Bitcoin peaks to $30k in stable market",
    "url": "https://cryptoslate.com/insights/fitch-downgrades-u-s-credit-rating-as-bitcoin-retests-30k/",
    "description": "<p>Quick Take Fitch&#8217;s recent downgrade of the United States&#8217; credit rating from AAA to AA+ on Aug.1 has led to an interesting shift in the crypto market, with Bitcoin peaking at $30,000. ZeroHedge highlighted that a similar downgrade in 2011, triggered market turbulence, causing Treasury yields to crash and record-high gold prices. However, this time, the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/fitch-downgrades-u-s-credit-rating-as-bitcoin-retests-30k/\">Fitch downgrades US credit rating, Bitcoin peaks to $30k in stable market</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-02T08:48:07.000Z",
    "title": "Reports of secret $90B Chinese trading denied by Binance, claims no operation in the country",
    "url": "https://cryptoslate.com/reports-of-secret-90b-chinese-trading-denied-by-binance-claims-no-operation-in-the-country/",
    "description": "<p>Despite reports from the Wall Street Journal (WSJ) that China accounts for about 20% of Binance&#8217;s trading volume, the exchange told CryptoSlate in an Aug. 2 email that its website is blocked in the country and its platform is unavailable to China-based users. China reportedly accounts for $90B of Binance&#8217;s volume Earlier today, WSJ  reported [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/reports-of-secret-90b-chinese-trading-denied-by-binance-claims-no-operation-in-the-country/\">Reports of secret $90B Chinese trading denied by Binance, claims no operation in the country</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-08-02T08:44:46.000Z",
    "title": "India makes suggestions for G20 crypto roadmap",
    "url": "https://cointelegraph.com/news/crypto-india-puts-forward-suggestions-for-g20-crypto-roadmap",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/069241b9-c36d-4aef-a660-a21744cb1d95.jpg\"></p><p>The country emphasizes the necessity of dealing with the risks of digital assets in developing economies. </p>\n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-02T09:47:47.000Z",
    "title": "$ETH: Crypto Analyst Benjamin Cowen on Ethereum’s Average Return on Investment",
    "url": "https://www.cryptoglobe.com/latest/2023/08/eth-crypto-analyst-benjamin-cowen-on-ethereums-average-return-on-investment/",
    "description": "In a video update for the “Into The Cryptoverse” YouTube channel, Benjamin Cowen, a seasoned expert in Engineering with a background in Computational Mathematics and Programming, starts by discussing the concept of seasonality in the context of Ethereum. He explains that Ethereum tends to perform best in the first and second quarters of the year […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-02T09:25:00.000Z",
    "title": "$XRP: Ripple’s Chief Legal Officer Dissects Judge Rakoff’s Comments on Judge Torres’ Decision",
    "url": "https://www.cryptoglobe.com/latest/2023/08/xrp-ripples-chief-legal-officer-dissects-judge-rakoffs-comments-on-judge-torres-decision/",
    "description": "Judge Torres’ Ruling on 13 July 2023 in SEC v. Ripple Case On 13 July 2023, a significant ruling was delivered in the ongoing SEC vs Ripple Labs lawsuit. The U.S. Securities and Exchange Commission (SEC) had accused Ripple Labs and its two senior executives, Bradley Garlinghouse and Christian A. Larsen, of unlawfully offering and selling securities. […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-02T08:59:22.000Z",
    "title": "$XRP: Crypto Lawyer Says Better for Ripple and XRP Community if SEC Appeals Now Rather Than in a Year",
    "url": "https://www.cryptoglobe.com/latest/2023/08/xrp-crypto-lawyer-says-better-for-ripple-and-xrp-community-if-sec-appeals-now-rather-than-in-a-year/",
    "description": "The Landmark Ruling on 13 July 2023 On 13 July 2023, a significant ruling was delivered in the ongoing SEC vs Ripple Labs lawsuit. The U.S. Securities and Exchange Commission (SEC) had accused Ripple Labs and its two senior executives, Bradley Garlinghouse and Christian A. Larsen, of unlawfully offering and selling securities. The case was presided over […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-02T11:15:00.000Z",
    "title": "MensAi AI Trading Bot Released: \"Artificial Intelligence to Completely Replace Traders\"",
    "url": "https://cryptodaily.co.uk/2023/08/mensai-ai-trading-bot-released-artificial-intelligence-to-completely-replace-traders",
    "description": "<p>Utilizing AI with no preset prices to place orders at the optimal price is the point.</p>\n<p>- AI's capabilities will shine through considering factors like information processing time.</p>\n<p>Artificial Intelligence (AI) trading specialist, \"MensAi,\" is gaining attention for introducing a new paradigm in the trading field.</p>\n<p>With the recent launch of the AI trading bot called \"MensAi Bot,\" there is a growing</p>\n<p>expectation that AI will completely replace traders in the securities and cryptocurrency markets.</p>\n<p>MensAi is an automatic Ai trading bot that was first released on the global cryptocurrency exchange \"OKX Exchange\". Notably, it is based on raw data from OKX Exchange and has undergone AI training led by a group of experts from global corporations.</p>\n<p>The program specializes in portfolio tracking, management, and trade performance analysis.</p>\n<p>Its merit lies in its ability to autonomously select coins, expanding its capabilities beyond conventional trading bots. Furthermore, MensAi Bot's key feature is its expertise in machine learning AI for perpetual swaps, enabling it to perform both long and short trades. Its strength lies in conservative asset management, ensuring profitability while safeguarding investors' assets. As a result, it has been highly regarded as a valuable bot for novice investors.</p>\n<p>MensAi Bot performs specialized functions based on the vast big data of the exchange, including backtesting and paper trading using indicators and tools.</p>\n<p>MensAi emphasized the increasing role of AI in the virtual asset investment sector with the launch of MensAi Bot. As traditional trading bot functions, which were previously limited to use by a few financial institutions and experts, continue to advance, there has been a recent increase in the utilization by individual investors.</p>\n<p>An official from MensAi stated,</p>\n\n<p>\"Unlike conventional programs that automatically buy and</p>\n<p>sell at specific preset prices, AI has no predefined prices.\"</p>\n<p>They added, \"The key is for AI to capture real-time fluctuations in the stocks or coins that need to be traded and place orders when it determines the optimal price.\" In essence, AI-based trading involves no preset prices and continually monitors market fluctuations to maximize investor convenience by placing orders at the best price or profit potential.</p>\n\n<p>MensAi highlighted that even beginners can benefit from the trading bot, which repeatedly executes buy and sell actions based on familiar and well-known indicators.</p>\n<p>Representative indicators include MACD (Moving Average Convergence and Divergence),moving averages used for predicting stock prices, the golden cross known as a bullish signal, RSI (Relative Strength Index), and the volatility indicator, Bollinger Bands.</p>\n<p>Additionally, MensAi backed its claims with actual performance cases, stating that AI trading bots outperformed conventional programs.</p>\n<p>It asserted that, over the long term, the difference in profits can reach as high as 5 to 13</p>\n<p>basis points (bps), which translates to significant amounts due to the large order volume in real performance.</p>\n<p>Regarding the potential of AI, a MensAi representative stated,</p>\n\n<p>\"Ultimately, AI is highly likely</p>\n<p>to surpass human capabilities in finding patterns in data and identifying trading opportunities.</p>\n<p>However, while humans will still be needed for decision-making in new environments or</p>\n<p>understanding the context of information, AI is already making a difference when considering</p>\n<p>factors like information processing time.\"</p>\n<p>They added, \"Though individual trader performance may vary, comparing human and AI trading skills are incomparable. It's similar to the situation when cars were invented, but some people still continued using horse-drawn carriages.\"</p>\n\n<p>About MensAi</p>\n<p>To learn more about MensAi and its innovative features, visit our website to connect with our community and stay updated on the latest developments.</p>\n<p>Only use the Official links and beware of Scammers.</p>\n<p>Website</p>\n<p>Telegram</p>\n<p>Youtube</p>\n<p>MensAi is the source of this content. This Press Release is for informational purposes only. The information does not constitute investment advice or an offer to invest.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-02T10:58:59.000Z",
    "title": "Binance Japan Launches Crypto Trading Platform",
    "url": "https://cryptodaily.co.uk/2023/08/binance-japan-launches-crypto-trading-platform",
    "description": "<p>Crypto exchange Binance announced the launch of Binance Japan, a dedicated platform for the Japanese crypto market. Binance Japan customers can access 34 tokens for spot trading. </p>\n<p>The world&rsquo;s largest cryptocurrency exchange, Binance, officially launched Binance Japan, its crypto trading platform dedicated to Japanese customers. The platform grants its customers access to 34 tokens for spot trading &ndash; the largest number of tokens offered by any exchange in Japan.</p>\n\n<p dir=\"ltr\" lang=\"en\">We&rsquo;re proud to announce that #Binance has officially launched in Japan as Binance Japan K.K. Users in the country now have access to more tradable tokens than any other exchange, with Spot and Earn products available. Find more details below.https://t.co/grxPYSsp84</p>\n&mdash; Binance (@binance) August 1, 2023\n<p>\n\n</p>\nBinance Japan Launches, $BNB Now Available\n<p>Binance has re-entered the crypto market in Japan with the launch of its new trading platform. The exchange announced in May that it would suspend the use of its global platform to Japanese residents. The exchange said Japanese residents would no longer be able to use its global platform after November 30.</p>\n<p>The exchange said it would launch Binance Japan on August 1, 2023, and the platform would fully comply with local regulations. Customers were advised that they could start migrating to the new platform through a new identity verification process after August 14.</p>\n<p>The exchange was previously known as SAKURA Exchange BitCoin, which Binance acquired as a licensed local crypto exchange service provider in November 2022. Since the acquisition, the business was renamed Binance Japan Inc.</p>\n<p>The platform will offer its customers a range of services and tokens, including $BNB, which becomes available in Japan for the first time. Binance Japan users will have access to spot trading and Earn products with a selection of 34 tokens for spot trading.</p>\n<p>Binance has turned to acquiring operating licenses after Japan&rsquo;s Financial Services Agency warned it of its failure to register.</p>\nJapan Welcomes Crypto\n<p>Japan is becoming a welcoming space for crypto in Asia as it continuously introduces regulations to attract crypto firms and investors to its shores. Most recently, the country said it would offer a 30% tax break for companies issuing cryptocurrencies.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-02T10:15:00.000Z",
    "title": "Thailand-Based KX Kicks Off Crypto Initiative",
    "url": "https://cryptodaily.co.uk/2023/08/thailand-based-kx-kicks-off-crypto-initiative",
    "description": "<p>Image source: KX</p>\n<p>Crypto venture firm KX says it&rsquo;s putting Thailand at the forefront of Web3 development with its latest investments in Magic and Transak. It says it invested in the startups earlier this year as part of a wider push to accelerate its vision around decentralized commerce and Web3.&nbsp;</p>\n<p>KX, the venture building arm of Kasikorn Business Technology Group, aims to become a key player in Thailand&rsquo;s active Web3 scene, which has been aided by the huge popularity of cryptocurrency in the country. According to the 2022 Global Crypto Adoption Index by Chainalysis, Thailand is ranked 8th in the world in terms of crypto adoption and it has emerged as the home for a number of Web3 startups, thanks in part to its reputation as a hub for digital nomads.&nbsp;</p>\n<p>The investments in Magic and Transak are strategic, as part of KX&rsquo;s plan to boost decentralized commerce in the region. Magic is an established crypto wallet-as-a-service provider that enables Web3 developers to create customized wallets, complete with onboarding tools and fiat on- and off-ramps. Meanwhile, Transak is a payment and onboarding infrastructure provider that makes it possible to acquire and sell crypto in a way that feels intuitive to Web2 users. It&rsquo;s notable that both startups are focused on technology that makes it simple to bring new users into Web3, as per KX&rsquo;s mission.&nbsp;</p>\n<p>Besides investing in promising Web3 projects, KX has also developed its own crypto applications. It&rsquo;s the creator of one of the most popular NFT marketplaces in Thailand, known as Coral NFT, which makes it possible to buy digital assets with local currency. In addition, it has created an on-chain wealth management app called Bigfin.</p>\n\n<p>KX Venture Director Paul Thanaarmates Arriyavat said the investments in Magic and Transak underscore its commitment to shaping the future of decentralized commerce. &ldquo;We are deeply invested in unlocking the true potential of the Web3 ecosystem, and by backing these trailblazing companies, we aim to nurture a digital landscape that is secure, compliant and accessible for all,&rdquo; he said.</p>\n\n<p>&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-02T10:06:53.000Z",
    "title": "Litecoin halving - today is the day",
    "url": "https://cryptodaily.co.uk/2023/08/litecoin-halving-today-is-the-day",
    "description": "<p>As Bitcoin approaches its own halving next year, Litecoin&rsquo;s has already arrived, as miner block rewards go from 12.5 to 6.25 LTC per block later on today.</p>\nThe silver to Bitcoin&rsquo;s gold\n<p>When Litecoin creator Charlie Lee read an article in 2011 about this new form of payment that was being used on the Silk Road at the time he was immediately intrigued, and set about copying many aspects of the Bitcoin code in order to produce his own blockchain which he called Litecoin.</p>\n<p>Litecoin, often called the silver to Bitcoin&rsquo;s gold, is still with us, and holders will celebrate its third halving event at around 15:08 UTC (16:08 BST). The mining rewards will be cut in half, leading to what founder Charlie Lee calls a &ldquo;disinflationary&rdquo; system.</p>\nThe Litecoin price history\n<p>It can be argued that the Litecoin halving, although a disinflationary event, does not actually impact the price, at least not in the short term. At the time of the first Litecoin halving in August 2015 price remained flat, with the odd spike to the up or downside, all the way up until late March of 2017 when the first great hyperbolic rise in price began.&nbsp;</p>\n<p>Litecoin went from $4 to around $370 by the end of the year. A bear market then ensued, which took the price all the way back down to $21.&nbsp;</p>\n<p>Litecoin&rsquo;s second halving in August 2019 happened as the price was on the way down to a double bottom which finally arrived at $23 in early March 2020. From here another hyperbolic rise took place which coincided with Bitcoin&rsquo;s first double-top peak. Litecoin hit $413.&nbsp;</p>\n<p>However, whereas Bitcoin&rsquo;s second top went even higher, the second Litecoin spike came short of $300 before both cryptos began their descent into the next bear market.</p>\n<p>This time, Litecoin looked to have bottomed at around $40. Since then the price has ground higher, turning the major resistance at $90 into support, and also the very critical 200-day moving average.</p>\n<p>Just as Bitcoin is battling to turn its own major resistance at $30,000 into support, Litecoin needs to now hold where it is, making a higher low, and potentially going on to make a higher high in the coming bull market.</p>\n<p>Litecoin certainly isn&rsquo;t Bitcoin, but it does share many of its characteristics, and this latest halving will reduce supply by half, making it a lot more attractive for those looking for what might be seen as a cheaper alternative to Bitcoin.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-02T09:07:13.000Z",
    "title": "LBank Labs Summer Bootcamp Concludes a Successful Global Competition in Collaboration with Top University Blockchain Clubs",
    "url": "https://cryptodaily.co.uk/2023/08/lbank-labs-summer-bootcamp-concludes-a-successful-global-competition-in-collaboration-with-top-university-blockchain-clubs",
    "description": "<p>San Francisco, USA, August 2nd, 2023, Chainwire</p><p>LBank Labs Summer Bootcamp is proud to announce the successful completion of its competition, bringing together the brightest minds from esteemed University Blockchain Clubs worldwide. LBank Labs, a leading player in the web3 space with a $100AUM fund launched at the end of 2022, hosted the competition to foster innovation and drive collaboration among students in the blockchain and cryptocurrency industry.</p><p>With a diverse pool of participants from various universities and regions, LBank Labs showcased its commitment to nurturing talent and promoting cutting-edge developments in the blockchain ecosystem. Leveraging its experienced team of web3 veterans hailing from prestigious entities such as Binance Labs, Binance NFT, Bitmain, Huobi Listing teams, and Consensys, LBank Labs has built an extensive network of expertise and connections that go beyond specific protocols and exchanges.</p><p>The summer bootcamp's investment strategy focuses on fund-of-fund investments, direct investments in early-stage projects, and liquid projects, enabling exploration of diverse opportunities in the rapidly evolving crypto landscape. The program has already made significant strides in setting a high standard of excellence by collaborating with top educational institutions and promising innovators worldwide.</p><p>The competition, which was launched over three months ago, garnered an overwhelming response, with more than 70+ teams submitting their projects for a chance to win an exclusive trip of a lifetime to Cabo San Lucas. The prize included coveted mentorship opportunities from some of the most esteemed crypto funds in the world, including Generative Ventures, BAI Capital, Youbi Capital, Stake Capital, and Web3 Ventures, among others.</p><p>The participating student teams hailed from prestigious institutions such as Harvard, MIT, Duke, Stanford, Cornell, UPenn, Imperial College of London, Taras Shevchenko University of Kyiv, Istanbul Technical University, Tokyo University, HSG St. Gallen in Switzerland, Goethe University Germany, and many more, representing a global spectrum of talent and creativity.</p><p>The winning student teams were meticulously selected by LBank Labs' senior researchers, who possess extensive expertise in cryptography, token design, decentralized computing, and infrastructure. The quality of submissions was exceptional, reflecting the program's ability to attract top-notch projects and minds eager to make a significant impact in the blockchain industry.</p>\"We are thrilled with the remarkable response and the exceptional talent that participated in our Summer Bootcamp competition,\" said Valeria Kholostenko, Principal at LBank Labs. \"It is inspiring to witness the passion and innovation that these young minds bring to the table. As LBank Labs, we remain dedicated to empowering the next generation of blockchain leaders and supporting groundbreaking projects that will shape the future of the web3 ecosystem.\"<p>LBank Labs Summer Bootcamp 2023 Winning Teams:&nbsp;</p><ol><li>Lila Finance, Carnegie Mellon University. Fixed income DeFi Markets saving, lending, and market making. https://www.lila.finance/</li><li>AminoChain, Columbia University. AminoChain is a platform that provides integrated &amp; seamless Web 3.0 capabilities to Biobanks &amp; Medical Research Bodies. https://aminochain.io/&nbsp;</li><li>Zcaptcha, Columbia University. ZKaptcha makes novel use of zero-knowledge cryptography and AI to generate powerful primitives to generate user interactions, empowering protocols and dApps to confidently onboard new users and thrive in the decentralized landscape. https://docs.zkaptcha.xyz/&nbsp;</li><li>Crossify, Istanbul Technical University, https://www.crossify.xyz/. Payment gateway that simplifies the complexities of crypto payments for both buyers and sellers.</li><li>Headquarters, Singapore Management University. Unified dashboard for Web3 founders to get visibility and control over their treasury.https://www.hq.xyz/&nbsp;</li><li>Hinkal, Stanford. Embedded privacy of on-chain assets and transactions. https://hinkal.pro/</li><li>VPN3, Stanford. AI-Powered Decentralized VPN3 https://www.hotspotvpn.io/&nbsp;</li><li>0xblu, Stanford. Smart Wallet for Web3 powered by ERC 4337. https://www.0xblu.com/&nbsp;</li><li>Mexiverse, Universidad Panamericana. http://mexiverse.net/ Indigenous art enhanced with NFTs.</li><li>Crecy, National Autonomous University of Mexico.Crecy is the first crypto-backed credit card in LATAM&nbsp;https://www.crecy.io/</li><li>Kryptik, Carnegie Mellon University. Kryptik is an open-source wallet for the decentralized web https://www.kryptik.app/&nbsp;</li><li>Cashstream. Dartmouth College. CashStream is a blockchain-based solution for initiating recurring SaaS payments, paid out by the second. https://cashstreamcrypto.com/&nbsp;</li><li>XLetter, Ewha Womans University, Yonsei University, Sungkyunkwan University. https://www.xletter.io/&nbsp;</li><li>WalletZK, Leiden and Hanse University, Groningen, Netherlands. The First Smart Contract Wallet on Mina Protocol.https://www.walletzk.app/&nbsp;</li><li>Nodekit, University of Wisconsin.Building the Next Generation of Rollups https://www.nodekit.xyz/&nbsp;</li><li>Aegis Protocol, Harvard University, MIT, Duke University. Aegis is a decentralized consumer protection layer for blockchain transactions. aegisprotocol.io&nbsp;</li></ol><p>Teams will be joined by mentors and leads from LBank Labs in Cabo San Lucas, Mexico.&nbsp;</p><p>About LBank Labs</p><p>LBank Labs is a prominent player in the web3 space, managing a versatile $100 Million fund that extends beyond specific protocols and exchanges. The firm's team comprises experienced web3 veterans from renowned entities such as Binance Labs, Binance NFT, Bitmain, Huobi Listing teams, and Consensys. With a focus on fund of fund investments, direct investments in early-stage projects, and liquid projects, LBank Labs aims to explore diverse opportunities and drive innovation in the blockchain industry.</p><p></p><p></p>ContactLBank Labsjunjie.niu@lbanklabs.com"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-02T08:52:00.000Z",
    "title": "Tether Blacklists Scammer After $20 Million USDT Heist",
    "url": "https://cryptodaily.co.uk/2023/08/tether-blacklists-scammer-after-20-million-usdt-heist",
    "description": "<p>A scammer managed to steal $20 million worth of Tether (USDT) on the 1st of August, using a zero transfer phishing attack.&nbsp;</p>\n<p>Tether immediately swung into action, blocking the scammer&rsquo;s address and blacklisting them, all within an hour of the attack being orchestrated.&nbsp;</p>\nZero Transfer Attack&nbsp;\n<p>Blockchain users have to always be on their guard when making on-chain transactions, primarily due to the threat of hackers and scammers. One such scammer managed to steal $20 million worth of Tether (USDT) by orchestrating a zero-transfer phishing attack. Most zero-transfer attacks operate using the same modus operandi. Hackers trick the user into sending a $0 transaction to a phishing address similar to an address the victim frequently transacts with or transfers funds to.&nbsp;</p>\n<p>Users typically check only the first and last few digits of a wallet address and ignore reading the complete address. This is the loophole that hackers are able to use, outsmarting the intended victim with a phishing address that looks similar to the original address. Users that don&rsquo;t bother to check the whole address typically fall for such attacks. For example, if a user sends 100 coins to a particular address, the hacker could send 0 coins from the victim&rsquo;s wallet to a similar address controlled by the attacker.&nbsp;</p>\n<p>The victim views the transaction in their transaction history and assumes that the address in question is the proper address and ends up sending the transaction to the phishing address instead.&nbsp;</p>\nThe Tether Attack&nbsp;\n<p>Data from On-chain analytic firm PeckShield has shown that a scammer managed to grab $20 million worth of USDT using this type of attack. The intended address to which the victim wanted to send the funds was 0xa7B4BAC8f0f9692e56750aEFB5f6cB5516E90570. However, the scammer tricked the victim into sending the funds to another address, 0xa7Bf48749D2E4aA29e3209879956b9bAa9E90570, as shown by PeckShield in its analysis.&nbsp;</p>\n<p>Data shows that the victim&rsquo;s wallet address initially received $10 million from a Binance account.&nbsp;</p>\n<p>This was sent to another address before the scammer jumped into the middle of the transaction, sending a fake Zero USDT transfer from the victim&rsquo;s account to the phishing address in question. Following this, the victim inadvertently ended up sending 20 million USDT to the phishing address, thinking they were transferring it to the original address.&nbsp;</p>\n\n<p>&ldquo;#PeckShieldAlert A #ZeroTransfer scammer grabbed 20M $USDT from 0x4071...9Cbc. Intended Address: 0xa7B4BAC8f0f9692e56750aEFB5f6cB5516E90570 Phishing Address: 0xa7Bf48749D2E4aA29e3209879956b9bAa9E90570.&rdquo;</p>\n\n<p>Tether Swings Into Action&nbsp;</p>\n<p>Tether was extremely proactive in dealing with the scammer, almost immediately freezing the stolen funds by putting the scammer&rsquo;s address on a blacklist. This was done barely an hour after the attack. Tether&rsquo;s quick response has raised plenty of eyebrows regarding the victim&rsquo;s identity, with on-chain sleuth ZachXBT tweeting his curiosity about the victim&rsquo;s identity.&nbsp;</p>\n\n<p>&ldquo;Curious who this would be if it were blacklisted within ~1 hr. Tether takes days to do that after obvious hacks but was acted here extremely quickly.&rdquo;</p>\n\n<p>According to some members of the crypto community, the victim could be an influential individual or a very large firm. Zero transfer scams are becoming increasingly common in the crypto space over the past year. The first instance of a big zero transfer scam occurred in December 2022, with the ecosystem losing around $40 million to similar attacks since.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-02T11:30:57.000Z",
    "title": "Binance Obtains Dubai License to Provide Crypto Exchange Services",
    "url": "https://news.bitcoin.com/binance-obtains-dubai-license-to-provide-crypto-exchange-services/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1757555312-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Binance Obtains Dubai License to Provide Crypto Exchange Services\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1757555312-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1757555312-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1757555312-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1757555312-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1757555312-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1757555312-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_1757555312.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The world’s largest cryptocurrency exchange, Binance, has received a license to operate in Dubai as a regulated platform. The authorization will allow the crypto giant to offer exchange and other services for virtual assets to institutional and qualified retail investors. Dubai Virtual Assets Regulatory Authority Grants Binance MVP License Crypto exchange Binance announced Monday that [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-02T09:30:22.000Z",
    "title": "Ripple CLO Stuart Alderoty Explains Securities in ‘After Hours’ Parody Skit",
    "url": "https://news.bitcoin.com/ripple-clo-stuart-alderoty-explains-securities-in-after-hours-parody-skit/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/1280-x-720-en-blanco-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Ripple CLO Stuart Alderoty Explains Securities in &quot;After Hours&quot; Parody Skit\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/1280-x-720-en-blanco-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/1280-x-720-en-blanco-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/1280-x-720-en-blanco-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/1280-x-720-en-blanco-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/1280-x-720-en-blanco-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/1280-x-720-en-blanco-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/1280-x-720-en-blanco.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Stuart Alderoty, CLO of Ripple, prepared a skit explaining the definition of securities according to the company, supported by the recent ruling in the SEC v. Ripple case. The segment, titled &#x201C;After Hours,&#x201D; parodies U.S. Securities and Exchange Commission (SEC) Chair Gary Gensler&#x2019;s &#x201C;Office Hours&#x201D; series of videos, where he briefly explains investment subjects. Ripple [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T11:37:13.000Z",
    "title": "Coinbase Co-founder embraces Bitcoin Lightning to propel mainstream adoption",
    "url": "https://www.cryptopolitan.com/coinbase-co-founder-embraces-bitcoin-lightning-to-propel-mainstream-adoption/",
    "description": "Coinbase Co-founder Brian Armstrong announced the company&#8217;s intention to embrace Bitcoin Lightning, further bolstering Bitcoin&#8217;s potential as a mainstream payment option. Armstrong&#8217;s statement came in response to accusations that Coinbase had ignored Bitcoin&#8217;s Layer 2 technology, the Lightning Network. &#8220;We&#8217;re investigating the most efficient means of incorporating Lightning,&#8221; said Armstrong. &#8220;It&#8217;s not easy, but it&#8217;s ... <a title=\"Coinbase Co-founder embraces Bitcoin Lightning to propel mainstream adoption\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-co-founder-embraces-bitcoin-lightning-to-propel-mainstream-adoption/\" aria-label=\"More on Coinbase Co-founder embraces Bitcoin Lightning to propel mainstream adoption\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T11:36:45.000Z",
    "title": "65 University Presidents Emphasize Digitalization Opportunities at Beijing World Forum",
    "url": "https://www.cryptopolitan.com/univ-presidents-digitalization-opportunities/",
    "description": "The World University Presidents Forum, held in Beijing, brought together over 500 participants from 36 countries and regions to discuss digitalization opportunities and challenges in education. The forum featured 65 university presidents who delivered speeches on various topics, including the impact of artificial intelligence (AI), big data, and cloud computing in higher education. Digital transformation ... <a title=\"65 University Presidents Emphasize Digitalization Opportunities at Beijing World Forum\" class=\"read-more\" href=\"https://www.cryptopolitan.com/univ-presidents-digitalization-opportunities/\" aria-label=\"More on 65 University Presidents Emphasize Digitalization Opportunities at Beijing World Forum\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T11:24:08.000Z",
    "title": "India’s presidency note reveals game-changing crypto recommendations",
    "url": "https://www.cryptopolitan.com/indias-presidency-on-crypto-recommendations/",
    "description": "India, currently holding the presidency of the Group of Twenty (G20), has taken a proactive step in shaping global cryptocurrency regulations by releasing its presidency note on crypto. This official document outlines India&#8217;s recommendations and seeks to influence the framing of international crypto rules in the upcoming synthesis paper jointly produced by the International Monetary ... <a title=\"India&#8217;s presidency note reveals game-changing crypto recommendations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/indias-presidency-on-crypto-recommendations/\" aria-label=\"More on India&#8217;s presidency note reveals game-changing crypto recommendations\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T11:13:00.000Z",
    "title": "Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?",
    "url": "https://www.cryptopolitan.com/binance-coin-price-prediction/",
    "description": "Binance Coin Price Prediction 2023-2032 Despite the gains made in the past couple of months, BNB and the entire crypto market seem to be experiencing winter in the summer. BNB prices have dropped by 23.95% since April 2023. What does the future hold for Binance Coin? How much is BNB worth? The current Binance coin ... <a title=\"Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-coin-price-prediction/\" aria-label=\"More on Binance Coin Price Prediction 2023-2032: Is BNB Ready for the Bull Run?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T11:02:55.000Z",
    "title": "AI-Supported Breast Cancer Detection Increased by 20% in Swedish Trial",
    "url": "https://www.cryptopolitan.com/ai-supported-breast-cancer-detection-20-more/",
    "description": "Results from a groundbreaking study in Sweden have revealed the potential of artificial intelligence (AI) in mammography, showing it to be an effective tool in detecting breast cancer. Early findings from the first randomized controlled trial exploring the use of AI-supported breast cancer detection demonstrate that AI-supported analysis of mammograms, in combination with radiologists, accurately ... <a title=\"AI-Supported Breast Cancer Detection Increased by 20% in Swedish Trial\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-supported-breast-cancer-detection-20-more/\" aria-label=\"More on AI-Supported Breast Cancer Detection Increased by 20% in Swedish Trial\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T11:01:43.000Z",
    "title": "Why is the crypto market up today?",
    "url": "https://www.cryptopolitan.com/why-is-the-crypto-market-up-today/",
    "description": "The crypto markets have seen a dark 24 hours following hacks and false news in the market. However, that did not last long. The digital asset market&#8217;s resilience has been witnessed since Asian markets opened this morning. As reported, Bitcoin&#8217;s price sits above $29,400. Both bitcoin and ether started the Asian trading day in the ... <a title=\"Why is the crypto market up today?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/why-is-the-crypto-market-up-today/\" aria-label=\"More on Why is the crypto market up today?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T11:00:07.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T10:54:06.000Z",
    "title": "Voyager Digital’s financial turmoil attracts cunning scammers",
    "url": "https://www.cryptopolitan.com/voyager-digitals-financial-scammers/",
    "description": "In a shocking turn of events, fraudulent actors targeted patrons of the insolvent cryptocurrency brokerage, Voyager Digital, as they briefly gained a window of opportunity to withdraw portions of their funds. The scammers employed a range of cunning tactics, as detailed in a report by Bloomberg, with promises of elevated returns through counterfeit websites being ... <a title=\"Voyager Digital&#8217;s financial turmoil attracts cunning scammers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/voyager-digitals-financial-scammers/\" aria-label=\"More on Voyager Digital&#8217;s financial turmoil attracts cunning scammers\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T10:37:51.000Z",
    "title": "MicroStrategy posts impairment charge of $24 million in Bitcoin holdings; returns to profitability amid Bitcoin surge",
    "url": "https://www.cryptopolitan.com/microstrategy-posts-impairment-charge-of-24-million-in-bitcoin-holdings/",
    "description": "In its second quarter, MicroStrategy (MSTR) recorded an impairment charge of $24.1 million on its Bitcoin (BTC) holdings, according to the latest earnings report. However, this is a notable decrease from the $917.8 million recorded in the same quarter of the previous year, and a slight increase from $18.9 million in Q1. The impairment reflects ... <a title=\"MicroStrategy posts impairment charge of $24 million in Bitcoin holdings; returns to profitability amid Bitcoin surge\" class=\"read-more\" href=\"https://www.cryptopolitan.com/microstrategy-posts-impairment-charge-of-24-million-in-bitcoin-holdings/\" aria-label=\"More on MicroStrategy posts impairment charge of $24 million in Bitcoin holdings; returns to profitability amid Bitcoin surge\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T10:25:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-02T09:36:23.000Z",
    "title": "Bank of England releases new paper on Ripple use cases",
    "url": "https://crypto.news/bank-of-england-releases-new-paper-on-ripple-use-cases/",
    "description": "The Bank of England (BoE) has released a new paper that explores the use of Ripple’s Interledger Protocol for synchronized settlement of payments. The new step taken by the Bank of England shows the increasing interest of central banks in&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-02T09:01:04.000Z",
    "title": "Meme coin fever takes over, DigiToads’ P2E model draws bulls",
    "url": "https://crypto.news/meme-coin-fever-takes-over-digitoads-p2e-model-draws-bulls/",
    "description": "DigiToads has a loyal following due to its play-to-earn (P2E) gaming ecosystem that rewards activity. TOADS presale has raised over 6.5m"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-02T08:53:43.000Z",
    "title": "Former Mt. Gox CEO breaks silence on 1Feex address",
    "url": "https://crypto.news/former-mt-gox-ceo-breaks-silence-on-1feex-address/",
    "description": "Mark Karpelès, the former CEO of the fallen crypto exchange Mt. Gox, officially revealed the funds in the 1Feex address are “considered stolen property.” According to a recent tweet, Karpelès claims that the 79956.55 Bitcoins (BTC) were sent to the&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-02T10:58:44.000Z",
    "title": "Sell The News? Litecoin Traders Capitulate Ahead Of Today’s Halving",
    "url": "https://www.newsbtc.com/news/litecoin/sell-the-news-litecoin-traders-capitulate-ahead-halving/",
    "description": "On-chain data shows that Litecoin traders are showing signs of capitulation as the asset&#8217;s much-anticipated halving event is only a few hours away now. Is Litecoin Halving A Buy The Rumor, Sell The News Event? The &#8220;halving&#8221; here refers to a periodic event where Litecoin&#8217;s block rewards (that is, rewards that miners receive for mining blocks) are permanently cut down in half. This event takes place approximately every four years and the next one, which would be the third, is scheduled to happen in around five hours if data from the mining platform NiceHash is to go by. The LTC halving is only a few hours away now &#124; Source: NiceHash This third halving event will reduce the cryptocurrency&#8217;s block rewards from 12.5 LTC to 6.25 LTC. Historically, these events have been important for the asset, as they mark points where the cryptocurrency&#8217;s production rate (which is nothing but the block rewards, as miners releasing these coins is the only way to mint new LTC) shrinks, and hence, the coin becomes more scarce. As these halving events are so significant, the market naturally speculates around them, leading to the coin experiencing volatility. In a new tweet, the on-chain analytics firm Santiment has revealed how the traders have been behaving in anticipation of today&#8217;s Litecoin halving. The data for the two indicators &#124; Source: Santiment on X In the above graph, Santiment has attached the data of two metrics related to LTC: &#8220;social dominance&#8221; and the &#8220;ratio of on-chain transaction volume in profit to loss.&#8221; The former of these tells us what percentage of discussion on social media related to the 100 largest assets in the cryptocurrency sector is coming from Litecoin alone. Related Reading: Why Is The Bitcoin And Crypto Market Up Today? From the chart, it&#8217;s visible that this indicator has observed a large spike today, showing that investors are participating in a large number of discussions related to today&#8217;s halving. The other indicator keeps track of the ratio between the profit-taking and loss-taking volumes on the network. As displayed in the graph, this metric has taken a plunge below the 1 mark recently. The ratio being less than 1 implies that loss-taking is the dominant force on the market at the moment. The loss volume is not only more than the profit volume right now, but it&#8217;s actually outweighing it at a ratio of more than 2:1. Related Reading: BlackRock CEO Larry Fink Is The Best Thing To Happen To Bitcoin, Mike Novogratz Says This extraordinary loss-taking may be coming from the investors who purchased coins ahead of the halving believing it to be a bullish event, but as Litecoin has only gone down lower recently, the holders have panicked and are selling at losses in an attempt to avoid going further underwater. The high social dominance of the asset may also likewise be because of FUD-related discussions blowing up. Based on these signs, it&#8217;s possible that Litecoin may be going through a classic &#8220;buy the rumor, sell the news&#8221; event. LTC Price At the time of writing, Litecoin is trading around $91, up 1% in the last week. Looks like the asset has gone down during the past day &#124; Source: LTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-02T09:30:18.000Z",
    "title": "Weeks of Prosperity: MKR Holders See Wealth Grow By Over 100% Amidst Price Boom",
    "url": "https://www.newsbtc.com/all/weeks-of-prosperity-mkr-holders-see-wealth-grow-by-over-100-amidst-price-boom/",
    "description": "MakerDAO (MKR) has navigated a tumultuous path in the Decentralized Finance (DeFi) market since June, marked by regulatory pressures and various challenges numerous projects face. Nonetheless, a shift in focus has occurred as altcoins, spearheaded by MKR, appear to overshadow this turbulence. Presently, the value of MKR on CoinGecko stands at $1,346, showing a noteworthy 9.1% surge within the past 24 hours, accompanied by an impressive week-long ascent of 18.0%. Related Reading: Curve DAO (CRV) Price Recovery Post-Exploit: What Would Be A Realistic Scenario? From mid-June, MKR has achieved an increase exceeding 115%. This growth has effectively diminished the proportion of investors encountering losses by a significant margin of 26%. MKR Price Report Reveals Sustained Accumulation, Whale Activity MKR has emerged as a notable hotbed of investor interest, with a recent price report shedding light on intriguing market dynamics. The journey of MKR&#8217;s price has been marked by a distinct trend of accumulation (see chart below) that has been underway since March, underscoring the growing interest and confidence among investors. Source: Santiment As the calendar flipped to June, the accumulation of MKR gained considerable traction. Notably, this month saw a strategic move by prominent investors, often called &#8220;whales,&#8221; who opted to divest a portion of their holdings. This strategic decision, seemingly aimed at capitalizing on profits, had the unintended consequence of temporarily affecting the supply. However, the cryptocurrency market is known for its intricate interplays, and MKR&#8217;s case was no exception. While whales reduced their holdings, more oversized wallet holders recognized an opportune moment and swiftly absorbed the newly available supply. This orchestrated shift in ownership demonstrated the agility and resilience of the MKR ecosystem. Resurging Interest In DeFi Tokens DeFi has recently witnessed a fascinating shift in dynamics, drawing attention from analysts and investors. Glassnode&#8217;s insightful observations highlight a distinct surge of interest in DeFi tokens sparked by lackluster performances within the ecosystem. The backdrop against which this resurgence unfolds is crucial to understanding its significance. The previous dip in DeFi token prices was undeniably attributed to a significant event &#8211; the release of a memo by the US Securities and Exchange Commission (SEC). Maker (MKR) is currently in a positive trend, trading at $1,328 on TradingView.com This regulatory communication deemed approximately 68 tokens unregistered securities, casting a shadow of uncertainty over the DeFi landscape. Related Reading: Uniswap (UNI) Stays Afloat With 11% Gain As Rest Of Top 50 Coins Sink Amidst the tumultuous landscape, the resurgence of interest is indeed noteworthy. Glassnode&#8217;s analytical lens zooms in on this intriguing development, offering valuable insights into the changing sentiment. The data analysis firm aptly captures the essence of this rebound: &#8220;This is the first outperformance since September 2022, with very similar performance thus far.&#8221; This assessment not only underscores the significance of the current uptick but also draws parallels to a prior period, hinting at the potential of a sustained trajectory. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from The Coin Republic"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-02T11:06:39.000Z",
    "title": "Ripple (XRP) Pulls Back After Recent Pump: Still Time to Buy?",
    "url": "https://www.crypto-news-flash.com/ripple-xrp-pulls-back-after-recent-pump-still-time-to-buy/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-xrp-pulls-back-after-recent-pump-still-time-to-buy",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T133732.542.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T133732.542.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T133732.542-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T133732.542-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Unlike what some analysts want us to believe, cryptocurrencies are not independent of what happens around us. The case of Ripple’s (XRP) legal tussle with the Securities and Exchange Commission (SEC) and the impact it had on the crypto’s price is a good example. However, the pump didn&#8217;t last for long as recent price performance [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-02T10:23:26.000Z",
    "title": "Presidential Hopeful DeSantis Accuses Biden of ‘War on Bitcoin,’ Pledges to Defend Crypto if Elected – Move to Drive Mass BTC Adoption",
    "url": "https://www.crypto-news-flash.com/presidential-hopeful-desantis-accuses-biden-of-war-on-bitcoin-pledges-to-defend-crypto-if-elected-move-to-drive-mass-btc-adoption/?utm_source=rss&utm_medium=rss&utm_campaign=presidential-hopeful-desantis-accuses-biden-of-war-on-bitcoin-pledges-to-defend-crypto-if-elected-move-to-drive-mass-btc-adoption",
    "description": "<img width=\"1280\" height=\"848\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/bitcoin-g79c18d319_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Brics Bitcoin vs Gold\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/bitcoin-g79c18d319_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/bitcoin-g79c18d319_1280-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/bitcoin-g79c18d319_1280-1024x678.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/bitcoin-g79c18d319_1280-768x509.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/bitcoin-g79c18d319_1280-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />US Presidential Candidate Ron DeSantis has highlighted his grand plans for Bitcoin. He claimed the crackdown on crypto is fueled by fear of the technology by the current administration. United States presidential candidate and Florida Governor Ron DeSantis has accused the Biden administration of engaging in a &#8220;war on Bitcoin,&#8221; promising to put an end [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-02T10:06:19.000Z",
    "title": "Binance Japan Empowers Millions of Crypto Traders with Exclusive Platform for SHIB, XRP, ADA, SOL, DOGE, and 27 Other Cryptos",
    "url": "https://www.crypto-news-flash.com/binance-japan-empowers-millions-of-crypto-traders-with-exclusive-platform-for-shib-xrp-ada-sol-doge-and-27-other-cryptos/?utm_source=rss&utm_medium=rss&utm_campaign=binance-japan-empowers-millions-of-crypto-traders-with-exclusive-platform-for-shib-xrp-ada-sol-doge-and-27-other-cryptos",
    "description": "<img width=\"1600\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/06/Binance.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/06/Binance.jpg 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/Binance-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/Binance-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/Binance-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/Binance-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/Binance-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/Binance-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/06/Binance-48x27.jpg 48w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />Binance Japan aims to provide diverse products and services, including Spot Trading and Earn options, granting access to carefully selected tokens like Shiba Inu and XRP.  The platform allows users to deposit Japanese yen and cryptocurrencies, with Japanese yen withdrawals available starting August 20.  Binance, the biggest cryptocurrency exchange globally, has launched a dedicated platform [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-02T10:05:26.000Z",
    "title": "What To Buy In 2023? Analysts Suggest Tradecurve Over Cosmos (ATOM) And Polygon (MATIC)",
    "url": "https://www.crypto-news-flash.com/what-to-buy-in-2023-analysts-suggest-tradecurve-over-cosmos-atom-and-polygon-matic/?utm_source=rss&utm_medium=rss&utm_campaign=what-to-buy-in-2023-analysts-suggest-tradecurve-over-cosmos-atom-and-polygon-matic",
    "description": "<img width=\"512\" height=\"330\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T104017.575.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T104017.575.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T104017.575-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Gear up for the ultimate trading revelation of 2023! The anticipation is palpable as industry analysts reveal their top pick: Tradecurve (TCRV)! Investors are skipping Cosmos (ATOM) and Polygon (MATIC) as this revolutionary platform takes the lead. Let&#8217;s unlock the secrets to success with this new crypto project! &#62;&#62;Register For The Tradecurve Presale&#60;&#60; Cosmos&#8217; (ATOM) [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-02T10:04:35.000Z",
    "title": "Bitcoin Adoption: 2024 U.S. Presidential Candidate Shows Support for Bitcoin, but Remains Cautious on Using It to Stabilize the Dollar",
    "url": "https://www.crypto-news-flash.com/bitcoin-adoption-2024-u-s-presidential-candidate-shows-support-for-bitcoin-but-remains-cautious-on-using-it-to-stabilize-the-dollar/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-adoption-2024-u-s-presidential-candidate-shows-support-for-bitcoin-but-remains-cautious-on-using-it-to-stabilize-the-dollar",
    "description": "<img width=\"1280\" height=\"848\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/bitcoin-g79c18d319_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Brics Bitcoin vs Gold\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/bitcoin-g79c18d319_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/bitcoin-g79c18d319_1280-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/bitcoin-g79c18d319_1280-1024x678.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/bitcoin-g79c18d319_1280-768x509.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/bitcoin-g79c18d319_1280-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />A 2024 U.S. Presidential candidate expresses support for Bitcoin and accepts cryptocurrency donations for their campaign. However, the candidate remains cautious about using Bitcoin as a commodity to stabilize the U.S. dollar, citing technical reasons. As the 2024 U.S. Presidential election draws closer, the topic of Bitcoin adoption has emerged as a significant point of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-02T09:45:00.000Z",
    "title": "Whiskey, Wine, and Champagne NFTs Offered by Golden Cask Club (GCC) Pop the Competition: Leaving Arbitrum (ARB) and Avalanche (AVAX) Behind",
    "url": "https://www.crypto-news-flash.com/whiskey-wine-and-champagne-nfts-offered-by-golden-cask-club-gcc-pop-the-competition-leaving-arbitrum-arb-and-avalanche-avax-behind/?utm_source=rss&utm_medium=rss&utm_campaign=whiskey-wine-and-champagne-nfts-offered-by-golden-cask-club-gcc-pop-the-competition-leaving-arbitrum-arb-and-avalanche-avax-behind",
    "description": "<img width=\"512\" height=\"256\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T102940.501.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T102940.501.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T102940.501-300x150.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Discover the fascinating world of Whiskey, Wine, and Champagne NFTs with Golden Cask Club (GCC)!  Pop the competition as Golden Cask Club (GCC) leaves Arbitrum (ARB) and Avalanche (AVAX) behind. Excitingly, Golden Cask Club (GCC) is now in the first phase of its presale, offering an extraordinary investment opportunity.  This article highlights why you shouldn&#8217;t [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-02T09:41:35.000Z",
    "title": "Wells Fargo Bullish on XRP: Predicts $100 to $500 Price Range in the Next 7 Months, Cites Utility As Main Drive",
    "url": "https://www.crypto-news-flash.com/wells-fargo-bullish-on-xrp-predicts-100-to-500-price-range-in-the-next-7-months-cites-utility-as-main-drive/?utm_source=rss&utm_medium=rss&utm_campaign=wells-fargo-bullish-on-xrp-predicts-100-to-500-price-range-in-the-next-7-months-cites-utility-as-main-drive",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/jack-cohen-vOCJLn1TB2U-wells-fargo.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/jack-cohen-vOCJLn1TB2U-wells-fargo.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/jack-cohen-vOCJLn1TB2U-wells-fargo-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/jack-cohen-vOCJLn1TB2U-wells-fargo-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/jack-cohen-vOCJLn1TB2U-wells-fargo-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/jack-cohen-vOCJLn1TB2U-wells-fargo-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/jack-cohen-vOCJLn1TB2U-wells-fargo-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Wells Fargo staffer Shannon Thorp has waded in to predict a $100 to $500 price tag for XRP. Shannon wants XRP Army to be more focused on utility than technical indicators. Shannon Thorp, a Business Support Manager at Wells Fargo, is optimistic that Ripple Lab&#8217;s associated XRP coin could surge and significantly reach a price [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-02T09:07:16.000Z",
    "title": "LBank Labs Summer Bootcamp Concludes a Successful Global Competition in Collaboration with Top University Blockchain Clubs",
    "url": "https://www.crypto-news-flash.com/lbank-labs-summer-bootcamp-concludes-a-successful-global-competition-in-collaboration-with-top-university-blockchain-clubs/?utm_source=rss&utm_medium=rss&utm_campaign=lbank-labs-summer-bootcamp-concludes-a-successful-global-competition-in-collaboration-with-top-university-blockchain-clubs",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/img_v2_0329388f-f194-4684-8fba-55b19117ba3h_1690965937TV11S04t7T.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/img_v2_0329388f-f194-4684-8fba-55b19117ba3h_1690965937TV11S04t7T.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/img_v2_0329388f-f194-4684-8fba-55b19117ba3h_1690965937TV11S04t7T-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/img_v2_0329388f-f194-4684-8fba-55b19117ba3h_1690965937TV11S04t7T-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/img_v2_0329388f-f194-4684-8fba-55b19117ba3h_1690965937TV11S04t7T-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />San Francisco, USA, August 2nd, 2023, Chainwire LBank Labs Summer Bootcamp is proud to announce the successful completion of its competition, bringing together the brightest minds from esteemed University Blockchain Clubs worldwide. LBank Labs, a leading player in the web3 space with a $100AUM fund launched at the end of 2022, hosted the competition to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-02T09:00:26.000Z",
    "title": "VeChain and Huobi Token Struggle To Maintain Price Stability, Tradecurve Looks To Become The Next Crypto King",
    "url": "https://www.crypto-news-flash.com/vechain-and-huobi-token-struggle-to-maintain-price-stability-tradecurve-looks-to-become-the-next-crypto-king/?utm_source=rss&utm_medium=rss&utm_campaign=vechain-and-huobi-token-struggle-to-maintain-price-stability-tradecurve-looks-to-become-the-next-crypto-king",
    "description": "<img width=\"512\" height=\"330\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T102001.793.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T102001.793.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-02T102001.793-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Despite the gloomy market conditions, Tradecurve’s (TCRV) presale has begun to amass a significant amount. Therefore, investors are joining Tradecurve to earn big profits, and avoid any bearish outcomes. However, the market has not been kind to VeChain (VET) and Huobi Token (HT), which have succumbed to massive sell-off activities. Experts believe that the Tradecurve [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-02T08:58:20.000Z",
    "title": "GameStop Halts Cryptocurrency Wallet Service, Raises Concerns for Blockchain Gaming Adoption",
    "url": "https://www.crypto-news-flash.com/gamestop-halts-cryptocurrency-wallet-service-raises-concerns-for-blockchain-gaming-adoption/?utm_source=rss&utm_medium=rss&utm_campaign=gamestop-halts-cryptocurrency-wallet-service-raises-concerns-for-blockchain-gaming-adoption",
    "description": "<img width=\"512\" height=\"292\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-04T090123.752.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-04T090123.752.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-04T090123.752-300x171.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />GameStop, a major player in the gaming industry, has decided to discontinue its cryptocurrency wallet service, citing regulatory uncertainty in the crypto space. The move could have implications for the mainstream adoption of blockchain-powered video games and NFTs. In a surprising move, GameStop announced that it will be ending its cryptocurrency wallet service, leaving users [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-02T09:47:26.000Z",
    "title": "3 Top EXPLOSIVE Altcoins in Cardano ADA Ecosystem",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/3-top-explosive-altcoins-in-cardano-ada-ecosystem/",
    "description": "<p>The Cardano ecosystem has been exploding with activity. And there are top-quality projects building on it. Today, we’ll shine the spotlight on three top Cardano projects. These projects have good value propositions, good teams, and an active community. All this generally leads to good price pumps in the bull market. Let’s look at our list. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/3-top-explosive-altcoins-in-cardano-ada-ecosystem/\">3 Top EXPLOSIVE Altcoins in Cardano ADA Ecosystem</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-02T11:30:47.000Z",
    "title": "BONE Price Soars to 90-Day High; Overbought Signals Spark Caution",
    "url": "https://coinedition.com/bone-price-soars-to-90-day-high-overbought-signals-spark-caution/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/04.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"shib bone price analysis\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/04.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/04-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/04-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/04-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/04-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/04-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>After consolidation in the Bone ShibaSwap (BONE) market, support was established at $1.51. This level had previously served as a strong resistance zone but now appears to be a solid support zone. As a result, bulls swept away the bears&#8217; reign and began pushing BONE prices higher. The increased buying pressure resulted in a significant [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bone-price-soars-to-90-day-high-overbought-signals-spark-caution/\">BONE Price Soars to 90-Day High; Overbought Signals Spark Caution</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-02T11:18:49.000Z",
    "title": "Did SBF Leak Caroline Ellison’s Diary to the NYT to Intimidate Her?",
    "url": "https://coinedition.com/did-sbf-leak-caroline-ellisons-diary-to-the-nyt-to-intimidate-her/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/FTX_co_founder_Samuel_Bankman_Fried_claims_jailing_him_for_speaking.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/FTX_co_founder_Samuel_Bankman_Fried_claims_jailing_him_for_speaking.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/FTX_co_founder_Samuel_Bankman_Fried_claims_jailing_him_for_speaking-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/FTX_co_founder_Samuel_Bankman_Fried_claims_jailing_him_for_speaking-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/FTX_co_founder_Samuel_Bankman_Fried_claims_jailing_him_for_speaking-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/FTX_co_founder_Samuel_Bankman_Fried_claims_jailing_him_for_speaking-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/FTX_co_founder_Samuel_Bankman_Fried_claims_jailing_him_for_speaking-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/FTX_co_founder_Samuel_Bankman_Fried_claims_jailing_him_for_speaking-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/FTX_co_founder_Samuel_Bankman_Fried_claims_jailing_him_for_speaking-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/FTX_co_founder_Samuel_Bankman_Fried_claims_jailing_him_for_speaking-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/FTX_co_founder_Samuel_Bankman_Fried_claims_jailing_him_for_speaking-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/FTX_co_founder_Samuel_Bankman_Fried_claims_jailing_him_for_speaking-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/FTX_co_founder_Samuel_Bankman_Fried_claims_jailing_him_for_speaking-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/FTX_co_founder_Samuel_Bankman_Fried_claims_jailing_him_for_speaking-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/FTX_co_founder_Samuel_Bankman_Fried_claims_jailing_him_for_speaking-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/FTX_co_founder_Samuel_Bankman_Fried_claims_jailing_him_for_speaking-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/FTX_co_founder_Samuel_Bankman_Fried_claims_jailing_him_for_speaking-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The former CEO of the infamous FTX, Sam Bankman-Fried, is once again in the news, this time for his latest statement. The fallen tech entrepreneur has claimed that his free-speech rights are being violated by restrictions on speaking to the media and revoking his bond. This concern from Bankman-Fried’s team follows the U.S. prosecutor’s request [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/did-sbf-leak-caroline-ellisons-diary-to-the-nyt-to-intimidate-her/\">Did SBF Leak Caroline Ellison’s Diary to the NYT to Intimidate Her?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-02T11:12:04.000Z",
    "title": "China’s Crypto Crackdown Fails as Binance Records $90B Trading",
    "url": "https://coinedition.com/chinas-crypto-crackdown-fails-as-binance-records-90b-trading/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Crypto_Is_Illegal_in_China_Binance_Does_90_Billion_of_Business.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Crypto_Is_Illegal_in_China_Binance_Does_90_Billion_of_Business.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Is_Illegal_in_China_Binance_Does_90_Billion_of_Business-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Is_Illegal_in_China_Binance_Does_90_Billion_of_Business-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Is_Illegal_in_China_Binance_Does_90_Billion_of_Business-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Is_Illegal_in_China_Binance_Does_90_Billion_of_Business-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Is_Illegal_in_China_Binance_Does_90_Billion_of_Business-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Is_Illegal_in_China_Binance_Does_90_Billion_of_Business-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Is_Illegal_in_China_Binance_Does_90_Billion_of_Business-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Is_Illegal_in_China_Binance_Does_90_Billion_of_Business-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Is_Illegal_in_China_Binance_Does_90_Billion_of_Business-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Is_Illegal_in_China_Binance_Does_90_Billion_of_Business-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Is_Illegal_in_China_Binance_Does_90_Billion_of_Business-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Is_Illegal_in_China_Binance_Does_90_Billion_of_Business-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Is_Illegal_in_China_Binance_Does_90_Billion_of_Business-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Is_Illegal_in_China_Binance_Does_90_Billion_of_Business-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Crypto_Is_Illegal_in_China_Binance_Does_90_Billion_of_Business-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In defiance of China&#8217;s cryptocurrency regulatory crackdown, Binance, the world&#8217;s largest crypto exchange, has witnessed an astounding $90 billion in crypto trading by China-based users in May 2023. Remarkably, this activity accounts for a substantial 20% of Binance&#8217;s total global trading volume, excluding trades by a small group of large traders. The staggering figure was [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/chinas-crypto-crackdown-fails-as-binance-records-90b-trading/\">China&#8217;s Crypto Crackdown Fails as Binance Records $90B Trading</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-02T11:00:40.000Z",
    "title": "Lookonchain Spots Whale Borrowing $34M in BNB to Farm CYBER, SEI",
    "url": "https://coinedition.com/lookonchain-spots-whale-borrowing-34m-in-bnb-to-farm-cyber-sei/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/A-whale-borrowed-140K-BNB.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/A-whale-borrowed-140K-BNB.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/A-whale-borrowed-140K-BNB-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/A-whale-borrowed-140K-BNB-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/A-whale-borrowed-140K-BNB-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/A-whale-borrowed-140K-BNB-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/A-whale-borrowed-140K-BNB-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/A-whale-borrowed-140K-BNB-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/A-whale-borrowed-140K-BNB-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/A-whale-borrowed-140K-BNB-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/A-whale-borrowed-140K-BNB-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/A-whale-borrowed-140K-BNB-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/A-whale-borrowed-140K-BNB-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/A-whale-borrowed-140K-BNB-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/A-whale-borrowed-140K-BNB-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/A-whale-borrowed-140K-BNB-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/A-whale-borrowed-140K-BNB-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to Lookonchain, the smartmoney on-chain platform, a whale borrowed 140,000 BNB worth $34 million from Venus and deposited it into the Binance exchange. Lookonchain suspects the whale intends to stake the deposited BNB to farm CYBER and SEI. The whale’s action has raised significant interest among crypto users. Some respondents to Lookonchain’s tweet expressed [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/lookonchain-spots-whale-borrowing-34m-in-bnb-to-farm-cyber-sei/\">Lookonchain Spots Whale Borrowing $34M in BNB to Farm CYBER, SEI</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-02T10:53:50.000Z",
    "title": "Ripple CEO: SEC Weaponized Our Transparency Efforts Against Us",
    "url": "https://coinedition.com/ripple-ceo-sec-weaponized-our-transparency-efforts-against-us/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/We_began_these_reports_to_voluntarily_provide_updates_given_our.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/We_began_these_reports_to_voluntarily_provide_updates_given_our.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/We_began_these_reports_to_voluntarily_provide_updates_given_our-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/We_began_these_reports_to_voluntarily_provide_updates_given_our-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/We_began_these_reports_to_voluntarily_provide_updates_given_our-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/We_began_these_reports_to_voluntarily_provide_updates_given_our-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/We_began_these_reports_to_voluntarily_provide_updates_given_our-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/We_began_these_reports_to_voluntarily_provide_updates_given_our-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/We_began_these_reports_to_voluntarily_provide_updates_given_our-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/We_began_these_reports_to_voluntarily_provide_updates_given_our-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/We_began_these_reports_to_voluntarily_provide_updates_given_our-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/We_began_these_reports_to_voluntarily_provide_updates_given_our-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/We_began_these_reports_to_voluntarily_provide_updates_given_our-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/We_began_these_reports_to_voluntarily_provide_updates_given_our-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/We_began_these_reports_to_voluntarily_provide_updates_given_our-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/We_began_these_reports_to_voluntarily_provide_updates_given_our-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/We_began_these_reports_to_voluntarily_provide_updates_given_our-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent tweet, Ripple CEO Brad Garlinghouse commented on Q2 XRP Markets Report, which shed light on the landmark court ruling, and debunked misconceptions surrounding it. Garlinghouse explained that Ripple began publishing reports to voluntarily update its stakeholders about its XRP holdings. But in an unfortunate turn of events, he added, the U.S. Securities [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ripple-ceo-sec-weaponized-our-transparency-efforts-against-us/\">Ripple CEO: SEC Weaponized Our Transparency Efforts Against Us</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-02T10:47:09.000Z",
    "title": "FTX Reboot ‘Worse Than Starting From Scratch’: Kraken Co-founder",
    "url": "https://coinedition.com/ftx-reboot-worse-than-starting-from-scratch-kraken-co-founder/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/FTX-2.0-would-be-worse-than-starting-from-scratch.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/FTX-2.0-would-be-worse-than-starting-from-scratch.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/FTX-2.0-would-be-worse-than-starting-from-scratch-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/FTX-2.0-would-be-worse-than-starting-from-scratch-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/FTX-2.0-would-be-worse-than-starting-from-scratch-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/FTX-2.0-would-be-worse-than-starting-from-scratch-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/FTX-2.0-would-be-worse-than-starting-from-scratch-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/FTX-2.0-would-be-worse-than-starting-from-scratch-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/FTX-2.0-would-be-worse-than-starting-from-scratch-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/FTX-2.0-would-be-worse-than-starting-from-scratch-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/FTX-2.0-would-be-worse-than-starting-from-scratch-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/FTX-2.0-would-be-worse-than-starting-from-scratch-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/FTX-2.0-would-be-worse-than-starting-from-scratch-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/FTX-2.0-would-be-worse-than-starting-from-scratch-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/FTX-2.0-would-be-worse-than-starting-from-scratch-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/FTX-2.0-would-be-worse-than-starting-from-scratch-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/FTX-2.0-would-be-worse-than-starting-from-scratch-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Days after FTX unveiled a reboot plan, Kraken FX co-founder Jesse Powell said an FTX relaunch might be worse than starting from scratch. Under its new leadership, the bankrupt crypto exchange unveiled a new plan to relaunch and pay off its debts on Monday. However, there is a lot of skepticism about whether the plan [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ftx-reboot-worse-than-starting-from-scratch-kraken-co-founder/\">FTX Reboot ‘Worse Than Starting From Scratch’: Kraken Co-founder</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-02T10:34:12.000Z",
    "title": "Bitcoin (BTC) Climbing Past $30K Triggers Positive Sentiments",
    "url": "https://coinedition.com/bitcoin-btc-climbing-past-30k-triggers-positive-sentiments/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Bitcoin_Rises_While_Altcoins_Consolidate_The_Pre_Halving_Impact.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Bitcoin_Rises_While_Altcoins_Consolidate_The_Pre_Halving_Impact.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin_Rises_While_Altcoins_Consolidate_The_Pre_Halving_Impact-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin_Rises_While_Altcoins_Consolidate_The_Pre_Halving_Impact-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin_Rises_While_Altcoins_Consolidate_The_Pre_Halving_Impact-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin_Rises_While_Altcoins_Consolidate_The_Pre_Halving_Impact-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin_Rises_While_Altcoins_Consolidate_The_Pre_Halving_Impact-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin_Rises_While_Altcoins_Consolidate_The_Pre_Halving_Impact-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin_Rises_While_Altcoins_Consolidate_The_Pre_Halving_Impact-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin_Rises_While_Altcoins_Consolidate_The_Pre_Halving_Impact-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin_Rises_While_Altcoins_Consolidate_The_Pre_Halving_Impact-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin_Rises_While_Altcoins_Consolidate_The_Pre_Halving_Impact-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin_Rises_While_Altcoins_Consolidate_The_Pre_Halving_Impact-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin_Rises_While_Altcoins_Consolidate_The_Pre_Halving_Impact-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin_Rises_While_Altcoins_Consolidate_The_Pre_Halving_Impact-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin_Rises_While_Altcoins_Consolidate_The_Pre_Halving_Impact-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Bitcoin_Rises_While_Altcoins_Consolidate_The_Pre_Halving_Impact-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Things are looking up for the market leader Bitcoin (BTC) after its price was able to conquer the $30K level over the past 24 hours of trading. This came after BTC’s price rose by more than 2% during this time period. Since then, its price has fallen below the psychological level and it was trading [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-btc-climbing-past-30k-triggers-positive-sentiments/\">Bitcoin (BTC) Climbing Past $30K Triggers Positive Sentiments</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-02T10:12:46.000Z",
    "title": "Coinbase CEO Defends Bitcoin Strategy As Jack Dorsey Raises Questions",
    "url": "https://coinedition.com/coinbase-ceo-defends-bitcoin-strategy-as-jack-dorsey-raises-questions/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Were-looking-into-how-to-best-add-Lightning.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Were-looking-into-how-to-best-add-Lightning.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Were-looking-into-how-to-best-add-Lightning-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Were-looking-into-how-to-best-add-Lightning-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Were-looking-into-how-to-best-add-Lightning-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Were-looking-into-how-to-best-add-Lightning-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Were-looking-into-how-to-best-add-Lightning-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Were-looking-into-how-to-best-add-Lightning-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Were-looking-into-how-to-best-add-Lightning-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Were-looking-into-how-to-best-add-Lightning-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Were-looking-into-how-to-best-add-Lightning-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Were-looking-into-how-to-best-add-Lightning-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Were-looking-into-how-to-best-add-Lightning-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Were-looking-into-how-to-best-add-Lightning-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Were-looking-into-how-to-best-add-Lightning-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Were-looking-into-how-to-best-add-Lightning-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Were-looking-into-how-to-best-add-Lightning-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In one of his recent tweets, Coinbase CEO Brian Armstrong responded to Jack Dorsey’s question on why he was continuing to ignore Bitcoin and Lightning. In his response, Armstrong stated that they are actively exploring Lightning integration while acknowledging the complexity of the process. He expressed his enthusiasm for the potential growth of Bitcoin payments. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coinbase-ceo-defends-bitcoin-strategy-as-jack-dorsey-raises-questions/\">Coinbase CEO Defends Bitcoin Strategy As Jack Dorsey Raises Questions</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-02T09:15:30.000Z",
    "title": "Dogecoin (DOGE) Could Correct Nearly 30% in Worst-Case Scenario, Says Crypto Strategist – Here’s His Outlook",
    "url": "https://dailyhodl.com/2023/08/02/dogecoin-doge-could-correct-nearly-30-in-worst-case-scenario-says-crypto-strategist-heres-his-outlook/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/DOGE-Could-Correct-Nearly.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/DOGE-Could-Correct-Nearly.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/DOGE-Could-Correct-Nearly.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/DOGE-Could-Correct-Nearly.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/DOGE-Could-Correct-Nearly.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/DOGE-Could-Correct-Nearly.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/DOGE-Could-Correct-Nearly.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto analyst believes that top memecoin Dogecoin (DOGE) is now primed for a significant move to the downside following its strong performance last month. Pseudonymous analyst Rekt Capital tells his 348,900 Twitter followers that DOGE looks bearish for now after failing to take out the resistance of a falling wedge pattern. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/02/dogecoin-doge-could-correct-nearly-30-in-worst-case-scenario-says-crypto-strategist-heres-his-outlook/\">Dogecoin (DOGE) Could Correct Nearly 30% in Worst-Case Scenario, Says Crypto Strategist – Here’s His Outlook</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-08-02T11:13:46.000Z",
    "title": "Bitfinex Turkiye Introduces Low-Cost Deposits Following Integration with Vakıfbank, and offers reduced fees for TRY/USDt Trading Pair",
    "url": "https://blog.bitfinex.com/media-releases/bitfinex-turkiye-introduces-low-cost-deposits-following-integration-with-vakifbank-and-offers-reduced-fees-for-try-usdt-trading-pair/",
    "description": "<p>Istanbul, Turkiye, August 2, 2023 Bitfinex Turkiye*, (https://www.bitfinextr.com/), a state-of-the-art digital asset trading platform, is pleased to announce the successful integration of an API connection with Vakıfbank, one of the largest banks in Turkiye. This integration empowers Bitfinex Turkiye customers to deposit Turkish Lira (TRY)...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/media-releases/bitfinex-turkiye-introduces-low-cost-deposits-following-integration-with-vakifbank-and-offers-reduced-fees-for-try-usdt-trading-pair/\">&lt;strong&gt;Bitfinex Turkiye Introduces Low-Cost Deposits Following Integration with Vakıfbank, and offers reduced fees for TRY/USDt Trading Pair&lt;/strong&gt;</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]