[
  {
    "source": "Decrypt",
    "date": "2023-11-08T22:58:16.000Z",
    "title": "5 Questions With SCENE: LoVid",
    "url": "https://decrypt.co/205009/5-questions-with-scene-lovid",
    "description": "Welcome the latest guests in the \"5 Questions\" hot seat: tech innovators, artistic duo, and married couple LoVid. "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-08T23:00:40.000Z",
    "title": "Former NYSC president, two others vying to buy and revive FTX",
    "url": "https://cryptoslate.com/former-nysc-president-two-others-vying-to-buy-and-revive-ftx/",
    "description": "<p>Efforts to revive FTX are drawing near a close with three possible buyers, according to reports from the Wall Street Journal on Nov. 8. That report indicates that former New York Stock Exchange (NYSE) president Tom Farley could buy FTX through his crypto exchange, Bullish. The crypto VC firm Proof Group and the fintech startup [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/former-nysc-president-two-others-vying-to-buy-and-revive-ftx/\">Former NYSC president, two others vying to buy and revive FTX</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-08T23:00:00.000Z",
    "title": "Institutional Investors’ Crypto Investment Product Inflows Top $760 Million, Highest Since 2021 Bull Market",
    "url": "https://www.cryptoglobe.com/latest/2023/11/institutional-investors-crypto-investment-product-inflows-top-760-million-highest-since-2021-bull-market/",
    "description": "As the cryptocurrency market recovers, institutional investors are growing their bets on crypto investment products, with inflows over the past six weeks now reaching $767 million, the largest figure seen since the 2021 bull market and topping last year’s figures. According to CoinShares’ latest Digital Asset Fund Flows weekly report, last week’s inflows totaled $261 […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-08T23:00:54.000Z",
    "title": "Shiba Inu Burn Rate Flatlines With 99.35% Drop, Here’s Why",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-burn-rate-99-35/",
    "description": "Shiba Inu has seen its burn rate basically flatlined in the last after recording one of its highest jumps in history. The 99% decline in the SHIB burn rate raises concerns over the involvement of the community and whether burning SHIB tokens has lost its appeal. SHIB Burn Rate Declines 99.35% Shibburn data on Wednesday, November 8, shows a 99.35% decline in the Shiba Inu burn rate in the last 24 hours. The burning of Shiba Inu tokens is an effort to drastically reduce the supply but interest seems to be waning, especially since the burn seems to have no effect on the price. Related Reading: Crypto Analyst Says XRP Price Has Entered Markup Phase, Why This Is Important Only 1.12 million tokens were burned in the 24-hour period, a very low number for a full day. However, the previous day’s activities also contributed to making this burn figure look incredibly small. On Tuesday, November 7, Shiba Inu marketing lead, Lucie, revealed the Shib Dream team had burned 550 million SHIB, leading to an over 14,000% surge in the burn rate. #Shibarium Projects ♥️$SHIB BURNS https://t.co/Q9OXhl3QSX — 𝐋𝐔𝐂𝐈𝐄 &#124; ✨Shib.io✨ (@LucieSHIB) November 7, 2023 Given this incredibly high burn figure spiking the burn rate, the numbers for Wednesday pale in comparison. In total, there were 10 Shiba Inu burn transactions recorded on the blockchain, with the largest transaction carrying only 553,521 tokens. The daily burn rate is not the only one that has taken a hit though as the weekly timeframe has not fared well. With the burn figure sitting at 308.74 million in the last 7 days, the SHIB burn rate is down 35.44% on the weekly timeframe. SHIB price rests at $0.0000082 &#124; Source: SHIBUSD on Tradingview.com Shiba Inu Layer 2 Follows Downtrend As the Shiba Inu burn rate falls, its Layer 2 Shibarium network has seen a decline in its operations as well. ShibariumScan data shows that the daily transactions for the last 24 hours are 9,930 transactions, making it the first time that the transaction count has fallen below 10,000 since the network was launched Related Reading: Top 3 Altcoins For November 2023 That Could 100x Your Crypto Portfolio This decline in the number of daily transactions could suggest that investor participation is declining on the network. And a drop in transaction count could have a ripple effect across the entire network. It could also contribute to a decreased burn rate. As for the SHIB price, it continues to demonstrate strength in the market after recovering above $0.000008 once more. Its gains for the last day come out to 1% but is seeing much higher gains of 7.63% on the weekly chart. Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from CoinMarketCap, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-08T23:01:01.000Z",
    "title": "Former NYSE President Makes Move To Relaunch Bankrupt Crypto Exchange FTX: Report",
    "url": "https://dailyhodl.com/2023/11/08/former-nyse-president-makes-move-to-relaunch-bankrupt-crypto-exchange-ftx-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/FTX-Exchange-Sees-Assets-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/FTX-Exchange-Sees-Assets-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/FTX-Exchange-Sees-Assets-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/FTX-Exchange-Sees-Assets-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/FTX-Exchange-Sees-Assets-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/FTX-Exchange-Sees-Assets-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/FTX-Exchange-Sees-Assets-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The former president of the New York Stock Exchange (NYSE) is reportedly attempting to relaunch bankrupt crypto exchange platform FTX. According to a new report by The Wall Street Journal, a company run by former NYSE president Tom Farley is joining an auction and placing bids to purchase the remnants of collapsed digital assets exchange [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/08/former-nyse-president-makes-move-to-relaunch-bankrupt-crypto-exchange-ftx-report/\">Former NYSE President Makes Move To Relaunch Bankrupt Crypto Exchange FTX: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]