[
  {
    "source": "Cointelegraph",
    "date": "2024-03-31T00:51:53.000Z",
    "title": " Tornado Cash co-founder requests dismissal of money laundering charges ",
    "url": "https://cointelegraph.com/news/tornado-cash-roman-storm-dismiss-charges-money-laundering",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMmI0MzY4NTctMzQ2ZC00OTcwLThiYjAtZDE3MTMzMGM2YzdkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Roman Storm’s lawyers argued that the charges are “fatally flawed” and must be dismissed, given “there was nothing” Storm could have done to prevent sanctioned entities from using the crypto mixer.</p>\n                    <p><p>Roman Storm, co-founder of cryptocurrency mixer Tornado Cash, has filed a motion to dismiss all three charges against him, alleging he operated a money laundering business and violated the International Emergency Economic Powers Act.</p><p>“By no stretch can Mr. Storm be deemed to have conspired to launder funds,” Storm’s lawyers stated in a March 29 <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.604938/gov.uscourts.nysd.604938.30.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> to the United States District Court for the Southern District of New York.</p><p>Storm’s lawyers argued that Tornado Cash was developed, \"became immutable, ” and publicly available before it was used by the hacking groups sanctioned by the U.S. Department of Treasury.</p><p><a href=\"https://cointelegraph.com/news/tornado-cash-roman-storm-dismiss-charges-money-laundering\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-31T00:48:10.000Z",
    "title": "AI’s Brave New World: Whatever happened to security? Privacy?",
    "url": "https://cryptoslate.com/ais-brave-new-world-whatever-happened-to-security-privacy/",
    "description": "<p>The following is a guest post from John deVadoss, Governing Board of the Global Blockchain Business Council in Geneva and co-founder of the InterWork Alliance in Washington, DC. Last week, I had the opportunity in Washington, DC to present and discuss the implications of AI relating to Security with some members of Congress and their [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ais-brave-new-world-whatever-happened-to-security-privacy/\">AI’s Brave New World: Whatever happened to security? Privacy?</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-31T01:06:56.000Z",
    "title": "LENX wallet drain sparks rumors of a potential rug pull",
    "url": "https://www.cryptopolitan.com/lenx-wallet-drain-rumors-of-rug-pull/",
    "description": "Liquidity protocol LENX has been rocked with fresh rumors of a potential rug pull, throwing the whole crypto community into confusion. According to recent reports from pseudonymous user AstroBoy and data from Etherscan, there has been a series of transfers involving LENX Finance founders, John Kim and another individual named Paul. LENX transfers $10 million [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-31T00:58:08.000Z",
    "title": "Custodia Bank’s plea for a Federal Reserve master account denied",
    "url": "https://www.cryptopolitan.com/custodia-banks-fed-reserve-master-account/",
    "description": "The United States District Court in Wyoming has ruled against Custodia Bank’s plea to own a Federal Reserve master account. The court also dismissed the bank&#8217;s plea for a declaratory judgment. However, the bank remains adamant and would seek out every possible option available. Custodia Bank denied a Federal Reserve master account In a filing [&#8230;]"
  }
]