[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-26T13:05:49.000Z",
    "title": "Red-Teaming Challenge Uncovers AI Bias, Making A Step Towards Equity",
    "url": "https://www.cryptopolitan.com/red-teaming-challenge-uncovers-ai-bias/",
    "description": "Artificial Intelligence (AI) has been under scrutiny for its biases, prompting a groundbreaking effort led by the White House to address this concern. The recently held Def Con, an annual hacking convention, witnessed an unprecedented public red-teaming challenge, where independent hackers joined forces with tech companies to expose and rectify AI biases. This collaborative endeavor ... <a title=\"Red-Teaming Challenge Uncovers AI Bias, Making A Step Towards Equity\" class=\"read-more\" href=\"https://www.cryptopolitan.com/red-teaming-challenge-uncovers-ai-bias/\" aria-label=\"More on Red-Teaming Challenge Uncovers AI Bias, Making A Step Towards Equity\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-26T12:55:56.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-26T12:50:38.000Z",
    "title": "A look at the BRICS expansion -Is it a threat to US dominance or sheer optimism?",
    "url": "https://www.cryptopolitan.com/the-brics-expansion-a-threat-or-optimism/",
    "description": "The BRICS (Brazil, Russia, India, China, and South Africa) economic bloc is set to expand with the admission of six new countries: Argentina, Ethiopia, Iran, Saudi Arabia, Egypt, and the United Arab Emirates. This expansion aims to enhance the economic heft and global influence of the BRICS bloc, countering the influence of the US and ... <a title=\"A look at the BRICS expansion -Is it a threat to US dominance or sheer optimism?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-brics-expansion-a-threat-or-optimism/\" aria-label=\"More on A look at the BRICS expansion -Is it a threat to US dominance or sheer optimism?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-26T12:43:46.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-26T13:00:05.000Z",
    "title": "This Ethereum Metric Has Sparked Centralization Concerns Over ETH Ownership",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-ownership-centralization/",
    "description": "Crypto blockchains are designed to be fully decentralized so that no single person or group has control. However, new data has shown that the top 10 Ethereum addresses control over 35% of the total ETH supply. For a network that was designed to be decentralized, this has sparked some serious concerns over how centralized ETH has become.  The 10 Largest Ethereum Addresses Hold Over 35% Of The Available Supply While sharing the metric on social media platform X, crypto market intelligence platform Santiment showed how holdings of the 10 largest Ethereum addresses have now climbed to 35% of the total supply. Related Reading: Shiba Inu Whale Buys 708 Billion SHIB, Sparks Speculation Of Price Recovery This indicates that while small traders have been trying to offload their supply during the recent price crash, many ETH whales are taking the chance to buy the dip.  🐳 The 10 largest addresses on the #Ethereum network are now holding over 35% of the available supply. By no means does this mean the #2 asset in #crypto is suddenly #centralized, but it shows the capitulation of smaller traders showing #FUD from this dip. https://t.co/G3wIeBzelb pic.twitter.com/TXkKjSwwmn — Santiment (@santimentfeed) August 25, 2023 Over the past 5 years, the top 10 largest Ethereum addresses have seen their share of the total ETH supply grow substantially. Data shows that these addresses held only 11.2% of the total supply in August 2018, and then rose to 24% in August 2022. The current level means these 10 largest holders have accumulated 11% more in the past year. 📈 #Ethereum has been seeing its top 10 addresses expand and accumulate more and more of the total available coin supply. In 5 years, the top 10 largest addresses have gone from owning 11.2% to now 34.6% of $ETH. The 27.86M $ETH added is worth $51.6B. 😮 https://t.co/utI8W6DkRX pic.twitter.com/klgb7pus7K — Santiment (@santimentfeed) August 9, 2023 Etherscan, an Ethereum block explorer, shows the top account balances in ETH, with the largest address alone (Beacon Deposit Contract) controlling over 24% of all supply. Next comes in Wrapped Ether at 2.7%.  However, most of the largest ETH holders are cryptocurrency exchanges like Binance and Kraken. One of Binance’s wallets (Binance 7) holds over 1.66%, while the exchange also holds large ETH amounts in other wallets, making it the largest of any single entity.  In comparison, the top 10 addresses of Bitcoin, the largest crypto in the world, own only 5.35% of the total supply. This, of course, does not take into account Satoshi Nakamoto&#8217;s Bitcoin cache.   ETH price struggles amid centralization concerns &#124; Source: ETHUSD on Tradingview.com  ETH Centralization Concerns? Whales are known to have considerable control over the price movement of cryptocurrencies in the crypto market and large selloffs by these holders can lead to an increase in selling pressure from smaller investors, causing a dump in the price of ETH.  However, considering the largest holder is the Ethereum is the Beacon Deposit Contract used for staking ETH, an increase in the contract spells positive news. More deposits into the contract signal that more investors are depositing to become validators in ETH 2.0. Related Reading: MasterCard Axes Partnership With Binance Amid Regulatory Pressures Interestingly, the number of wallets holding between 10 and 10,000 ETH has risen to 355,000, and 1,788 more 10-10,000 ETH wallets have been added since the beginning of June. Whale transactions in the past week alone have also crossed 23,073 ETH, the highest since May. As for ETH’s price, the token is currently trading at around $1,600, down 11% in the past month. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-26T13:06:12.000Z",
    "title": "Ripple-SEC Trial Doubt: XRP Lawyer Foresees Unexpected Twist",
    "url": "https://www.crypto-news-flash.com/ripple-sec-trial-doubt-xrp-lawyer-foresees-unexpected-twist/",
    "description": "Ripple lawyer takes to X to reveal reasons for siding with claims suggesting that the SEC will not face Ripple execs in court.  Amongst many other reasons, the lawyer cites the SEC’s back to back trials as an example of the many roadblocks.  Fred Rispoli, an XRP community lawyer, has taken to X, formerly known [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-26T12:41:06.000Z",
    "title": "Bitcoin Holds Tight at $26K as Investors Await Powell’s Speech and Binance Boosts Liquidity",
    "url": "https://www.crypto-news-flash.com/bitcoin-holds-tight-at-26k-as-investors-await-powells-speech-and-binance-boosts-liquidity/",
    "description": "<img width=\"921\" height=\"515\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Bitcoin-Lightning.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Bitcoin-Lightning.jpg 921w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Bitcoin-Lightning-300x168.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Bitcoin-Lightning-768x429.jpg 768w\" sizes=\"(max-width: 921px) 100vw, 921px\" />Bitcoin&#8217;s price initially recovered, then declined on August 24th after trying to stay above $26k.  Fed Chairman&#8217;s speech and a $150M Binance withdrawal impacted Bitcoin&#8217;s trajectory. The price of Bitcoin demonstrated signs of recovery only to experience another decline on the evening of Thursday, August 24th. Throughout the previous week, the value of the cryptocurrency [...]"
  }
]