[
  {
    "source": "Cointelegraph",
    "date": "2024-02-15T13:06:09.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">YouTuber-turned crypto pundit KSI has attracted the attention of crpSpot Bitcoin ETFs aren’t just scooping up Bitcoin, they’re getting faster at it, according to new data. Meanwhile, a fake app impersonating Curve Finance has appeared on Apple’s App Store and Bitcoin tore through the $1 trillion market cap ceiling as the price eclipsed $50,000.</p><p>Olajide Olayinka Williams Olatunji, more commonly known as “KSI,” has come under the microscope of crypto investigators ZachXBT and Coffeezilla after he reopened his X account and started posting about the watch-to-earn project XCAD Network (XCAD), which the investigators allege is a pump-and-dump scam.</p><p>A few hours later, crypto investigator ZachXBT <a href=\"https://twitter.com/zachxbt/status/1757537982108844441\" target=\"_blank\" rel=\"noopener nofollow\">commented</a> on KSI’s post, saying that the YouTuber would start “sharing garbage again.” The crypto detective followed up his reply by sharing a screenshot of KSI posting about his investment paired with another screen grab of KSI’s crypto wallet dumping $850,000 in XCAD tokens</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-15T13:04:21.000Z",
    "title": " Telefónica taps Chainlink to combat SIM swap attacks ",
    "url": "https://cointelegraph.com/news/telefonica-taps-chainlink-to-combat-sim-swap-attacks",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZjVjMDFkODEtZTk2Zi00Njc1LTk3NjItMTFmMWVmZWFiNGY0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Telefónica said that the integration with Chainlink ensures that devices' SIM cards will not undergo unauthorized changes.</p>\n                    <p><p data-ct-non-breakable=\"true\">Telefónica, Spain’s largest telecom brand, has announced a collaboration with Web3 oracle provider Chainlink to enhance protections against SIM swaps — a popular attack vector that hackers use to gain access to their targets. </p><p>On Feb. 15, Telefónica <a href=\"https://www.telefonica.com/en/communication-room/press-room/telefonica-integrates-chainlink-to-strengthen-web3-security-with/\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the strategic alliance between the two parties will “enable the secure connection” of smart contracts with other GSMA Open Gateway APIs. The integration allows the verification of data from different sources using Chainlink along with a framework of common network APIs that is designed to provide access to operator networks. </p><p>A SIM swap attack is a type of identity theft where hackers <a href=\"https://cointelegraph.com/news/crypto-sim-swap-how-easy-is-sim-swap-crypto-hack\">take over their victim’s</a> mobile phone number, gaining access to information like crypto accounts, credit cards or bank accounts. It is a prevalent and efficient hacking technique that even big organizations like the United States Securities and Exchange Commission (SEC) have fallen victim to. </p><p><a href=\"https://cointelegraph.com/news/telefonica-taps-chainlink-to-combat-sim-swap-attacks\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-15T13:02:41.000Z",
    "title": "Blockchain Breakthrough: Citigroup Partners for Private Equity Tokenization",
    "url": "https://cryptodaily.co.uk/2024/02/blockchain-breakthrough-citigroup-partners-for-private-equity-tokenization",
    "description": "Citigroup has become the latest major financial institution to complete a proof-of-concept to tokenize private equity funds."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-15T12:50:35.000Z",
    "title": "Top trader who sold $35M worth of Solana (SOL) last week reveals what he is buying next",
    "url": "https://cryptodaily.co.uk/2024/02/top-trader-who-sold-35m-worth-of-solana-sol-last-week-reveals-what-he-is-buying-next",
    "description": "The world of cryptocurrency trading is a dynamic landscape characterised by volatility, innovation, and rapid shifts in market sentiment."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T13:05:05.000Z",
    "title": "AI PCs Separating Expectation from Reality in the 2024 Tech Scene",
    "url": "https://www.cryptopolitan.com/ai-pcs-separating-expectation-from-reality/",
    "description": "In the rapidly evolving landscape of technology, the emergence of AI PCs has stirred significant buzz and speculation. However, discerning the true capabilities and practical implications of these devices amidst the marketing hype is crucial for consumers navigating the market. Defining AI PCs At the core of the AI PC phenomenon lies the integration of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T13:02:51.000Z",
    "title": "Indian Enterprises Leading Global AI Adoption, IBM Report Reveals",
    "url": "https://www.cryptopolitan.com/indian-enterprises-lead-global-ai-adoption/",
    "description": "In an era where technology relentlessly advances, Artificial Intelligence (AI) has emerged as a beacon of innovation, particularly in India. According to the latest findings from the ‘IBM Global AI Adoption Index 2023,’ a striking 59% of enterprise-scale organizations in India, those boasting over 1,000 employees, have not just dabbled in AI but have actively [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T13:00:00.000Z",
    "title": "Discover the Next Big Crypto: Expert Highlights Upcoming Token Set to Outdo Shiba Inu’s Success",
    "url": "https://www.cryptopolitan.com/discover-the-next-big-crypto-expert-highlights-upcoming-token-set-to-outdo-shiba-inus-success/",
    "description": "In the dynamic world of cryptocurrency, where fortunes can turn on a dime, investors are constantly on the lookout for the next big opportunity. Amidst this search, a new cryptocurrency has emerged, catching the keen eye of industry experts who believe it has the potential to surpass the success of Shiba Inu. This upcoming token, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T12:59:03.000Z",
    "title": "Palworld Continues to Dominate, Eyes Potential Expansion to PlayStation 5",
    "url": "https://www.cryptopolitan.com/palworld-continues-to-dominate-eyes/",
    "description": "Palworld, the survival crafting adventure developed by PocketPair, has solidified its position as the breakout hit of the year, captivating gamers worldwide with its unique blend of gameplay elements. Since its launch, Palworld has amassed an impressive player base of over 19 million users globally, spanning Steam and Xbox platforms.&#160; Notably, its availability on Xbox [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T12:55:06.000Z",
    "title": "Indonesia chooses crypto-friendly leaders in landmark election",
    "url": "https://www.cryptopolitan.com/indonesia-chooses-crypto-friendly-leaders/",
    "description": "Indonesia&#8217;s recent presidential election has concluded with Prabowo Subianto, the former defense minister, securing the presidency with a commanding lead of nearly 60% of the votes, based on quick count results. This victory positions Prabowo and his vice-presidential running mate, Gibran Rakabuming Raka, at the helm of the Indonesian government. Gibran, the son of the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T12:48:36.000Z",
    "title": "From Chips to Clouds: US Tightens Grip on Technology Race with China",
    "url": "https://www.cryptopolitan.com/from-chips-to-clouds-us-grip-on-china/",
    "description": "While not fought with conventional weapons, the rivalry between the US and China for technological dominance simmers just below the surface. Over the past months, this &#8220;unseen war&#8221; has unfolded across multiple sectors, including semiconductors and artificial intelligence, and is now stretching to cloud computing services. But why Cloud services? AI models require large datasets [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T12:45:55.000Z",
    "title": "Over 400 illegal crypto ads flagged by UK financial watchdog in 2023",
    "url": "https://www.cryptopolitan.com/450-crypto-ads-flagged-uk-financial-watchdog/",
    "description": "The Financial Conduct Authority (FCA), the UK&#8217;s independent regulator for financial services, has intensified its scrutiny of financial promotions, particularly focusing on the crypto sector. A February 14 report from the FCA highlighted &#8220;significant levels of non-compliance&#8221; with the crypto promotion rules established on October 8, 2023. The regulator&#8217;s findings indicate a range of issues [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T12:45:41.000Z",
    "title": "Most-Played League of Legends Champions: Insights and Analysis",
    "url": "https://www.cryptopolitan.com/most-played-league-of-legends-champions/",
    "description": "League of Legends (LoL) continues to captivate players worldwide with its ever-evolving meta, shaping the landscape of ranked play. Champion popularity reflects current trends and strategic value, influencing victory or defeat. Let&#8217;s delve into the most-played LoL champions, offering insights into their dominance and strategic importance. Champion analysis: Identifying the top picks Smolder leads the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-15T12:43:36.000Z",
    "title": "Avatar Competitive Multiplayer Fighting Game Announced",
    "url": "https://www.cryptopolitan.com/avatar-competitive-multiplayer-fighting-game/",
    "description": "In a thrilling development for gaming enthusiasts, a new competitive multiplayer fighting game set in the beloved universe of Avatar: The Last Airbender has been announced. The announcement has sent ripples of excitement throughout the gaming community, as fans eagerly anticipate the opportunity to immerse themselves in battles within the iconic Avatar world. Game announcement [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-15T13:00:36.000Z",
    "title": "Bitcoin ETF Surges: Last 4 Days Inflows Outpace Initial Weeks",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-etf-surges-last-4-days-inflows-outpace-initial-weeks/",
    "description": "Bitcoin (BTC) Spot Exchange-Traded Funds (ETFs) are currently in the limelight as the products have seen massive net inflows in the past few days than in the initial weeks of introduction, dominating the market of crypto investment products. Bitcoin ETF Inflows Surges In The Last 4 Days Thomas Fahrer, the co-founder of Bitcoin tracking platform Apollo, took to the social media platform X (formerly Twitter) to share the development with the community. Fahrer pointed out that BTC spot ETFs are presently experiencing a &#8220;total acceleration&#8221; of inflows. Related Reading: Fee Cuts in Bitcoin ETF Battle: Invesco and Galaxy Respond; Render Competitor Attracts Key Investors Fahrer emphasized that Bitcoin ETFs underperformed in the first few weeks compared to the last four days. He noted that BTC had a significant inflow of 42,000 BTC during the first 20 days of trading. Meanwhile, the products in the past 4 days have witnessed an inflow of 43,000 BTC tokens valued at $2.3 billion. This latest surge in inflows suggests renewed adoption of the products from crypto players and investors. Data from Apollo reveals that Grayscale is the leading firm in Assets Under Management (AUM). Registered as Grayscale Bitcoin Trust (GBTC), the company boasts a whopping $23.7 billion AUM. However, this is a notable drop from $28 billion in assets it had on January 11, after transitioning to an ETF. This is due to the daily net outflows the fund has seen since it was approved by the US Securities and Exchange Commission (SEC). Blackrock comes in second after Grayscale, with an asset under management of over $5 billion since it started trading. It is followed by Wise Origin Bitcoin Trust (FBTC) and Ark/21Shares Bitcoin Trust (ARKB), which come in third and fourth place, respectively. Investment firm Bitwise&#8217;s Bitcoin ETF (BITB) is the latest company to reach the billion-dollar milestone. As of the press, the company&#8217;s BTC ETF is the fifth largest behind the aforementioned asset management companies. Blackrock Records Its Largest Inflow On Tuesday, Blackrock recorded its largest inflow day ever since Bitcoin ET products were approved. A senior Bloomberg Intelligence analyst, Eric Balchunas, revealed information regarding the update on X. Related Reading: Breaking Down Bitcoin ETFs’ Early Trading Days; a New Render Challenger Emerges He stated that Blackrock&#8217;s BTC ETF was booming on Tuesday, seeing almost &#8220;half a billion&#8221; inflow. According to the data shared by Balchunas, IBIT made $493 million in revenue during the trading day. IBIT&#8217;s previous largest daily net inflow was $386 million, recorded on the second trading day of January 12. Consequently, Blackrock&#8217;s Bitcoin ETF overall inflow exceeded the $5 billion mark after the Tuesday event. So far, of all ETFs, Blackrock&#8217;s IBIT leads by &#8220;7% by size in just 23 days of trading.&#8221; These developments came in light of the recent rally around Bitcoin in the past few days, which took BTC&#8217;s price above $ 50,000. Many market enthusiasts believe that a major factor in the rally is the reason surrounding the BTC ETF flows. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-15T13:00:22.000Z",
    "title": "Could The $GFOX Presale 500X To $1, Beating The Wider Market?",
    "url": "https://www.crypto-news-flash.com/could-the-gfox-presale-500x-to-1-beating-the-wider-market/?utm_source=rss&utm_medium=rss&utm_campaign=could-the-gfox-presale-500x-to-1-beating-the-wider-market",
    "description": "<img width=\"1200\" height=\"799\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-15T092510.805.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-15T092510.805.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-15T092510.805-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-15T092510.805-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-15T092510.805-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-15T092510.805-450x300.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Crypto enthusiasts are increasingly excited about the new innovative cryptocurrency called $GFOX for succeeding remarkably in its ongoing presale and introducing many exciting ways to earn handsomely in the industry. Although the crypto market is currently bullish, Experts believe $GFOX that has risen by over 260% since the start of its presale may outperform most [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-15T13:00:11.000Z",
    "title": "Ripple (XRP), and Algorand (ALGO) Price Prediction, Traders Crazy For Everlodge (ELDG)",
    "url": "https://www.crypto-news-flash.com/ripple-xrp-and-algorand-algo-price-prediction-traders-crazy-for-everlodge-eldg/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-xrp-and-algorand-algo-price-prediction-traders-crazy-for-everlodge-eldg",
    "description": "<img width=\"1200\" height=\"700\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-15T151833.975.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-15T151833.975.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-15T151833.975-300x175.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-15T151833.975-768x448.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-15T151833.975-150x88.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-15T151833.975-450x263.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Ripple (XRP) and Algorand (ALGO) are both altcoins that are showcasing green on-chart performance and could soon break past major resistance points to reach new heights. In the meantime, the Everlodge (ELDG) presale concluded, and the token has been listed on Uniswap, sparking significant hype among its community as it is projected to spike by [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-15T13:00:00.000Z",
    "title": "Hedera and Mondelēz Partner: Food Giant Envisions Leveraging DLT",
    "url": "https://coinedition.com/hedera-and-mondelez-partner-food-giant-envisions-leveraging-dlt/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/02/Hedera_and_Mondelez_Partner_Food_Giant_Envisions_Leveraging_DLT.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Hedera_and_Mondelēz_Partner_Food_Giant_Envisions_Leveraging_DLT\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/02/Hedera_and_Mondelez_Partner_Food_Giant_Envisions_Leveraging_DLT.jpg 730w, https://coinedition.com/wp-content/uploads/2024/02/Hedera_and_Mondelez_Partner_Food_Giant_Envisions_Leveraging_DLT-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/02/Hedera_and_Mondelez_Partner_Food_Giant_Envisions_Leveraging_DLT-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/02/Hedera_and_Mondelez_Partner_Food_Giant_Envisions_Leveraging_DLT-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/02/Hedera_and_Mondelez_Partner_Food_Giant_Envisions_Leveraging_DLT-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/02/Hedera_and_Mondelez_Partner_Food_Giant_Envisions_Leveraging_DLT-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/02/Hedera_and_Mondelez_Partner_Food_Giant_Envisions_Leveraging_DLT-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/02/Hedera_and_Mondelez_Partner_Food_Giant_Envisions_Leveraging_DLT-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/02/Hedera_and_Mondelez_Partner_Food_Giant_Envisions_Leveraging_DLT-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/02/Hedera_and_Mondelez_Partner_Food_Giant_Envisions_Leveraging_DLT-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/02/Hedera_and_Mondelez_Partner_Food_Giant_Envisions_Leveraging_DLT-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/02/Hedera_and_Mondelez_Partner_Food_Giant_Envisions_Leveraging_DLT-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/02/Hedera_and_Mondelez_Partner_Food_Giant_Envisions_Leveraging_DLT-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/02/Hedera_and_Mondelez_Partner_Food_Giant_Envisions_Leveraging_DLT-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/02/Hedera_and_Mondelez_Partner_Food_Giant_Envisions_Leveraging_DLT-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/02/Hedera_and_Mondelez_Partner_Food_Giant_Envisions_Leveraging_DLT-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent press release, the Hedera Council, which stewards the Hedera open-source proof-of-stake public network, announced its strategic collaboration with Mondelēz International, an American multinational food company. As per the announcement, Mondelēz International envisions enhancing “digital transformation initiatives, supply chain management, and enriched business processes” with the alliance. The company mentioned that it aims [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/hedera-and-mondelez-partner-food-giant-envisions-leveraging-dlt/\">Hedera and Mondelēz Partner: Food Giant Envisions Leveraging DLT</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-15T12:45:30.000Z",
    "title": "Crypto Analyst Issues Bitcoin Alert, Says BTC Could Crash by up to 30% – Here’s the Timeline",
    "url": "https://dailyhodl.com/2024/02/15/crypto-analyst-issues-bitcoin-alert-says-btc-could-crash-by-up-to-30-heres-the-timeline/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/BTC-Could-Crash-30.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/BTC-Could-Crash-30.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2024/02/BTC-Could-Crash-30.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/02/BTC-Could-Crash-30.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/02/BTC-Could-Crash-30.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/BTC-Could-Crash-30.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2024/02/BTC-Could-Crash-30.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto analyst is warning that Bitcoin (BTC) could have a severe market correction in the coming weeks. In a new strategy session video, pseudonymous analyst Rekt Capital tells his 54,700 YouTube subscribers that Bitcoin may repeat a historical pattern and crash by up to 30% before the halving event in April. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/15/crypto-analyst-issues-bitcoin-alert-says-btc-could-crash-by-up-to-30-heres-the-timeline/\">Crypto Analyst Issues Bitcoin Alert, Says BTC Could Crash by up to 30% – Here’s the Timeline</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]