[
  {
    "source": "Bitcoin.com",
    "date": "2023-07-14T03:30:49.000Z",
    "title": "Spot Volumes Rise on Centralized Exchanges but Traffic Falls Further, Report",
    "url": "https://news.bitcoin.com/spot-volumes-rise-on-centralized-exchanges-but-traffic-falls-further-report/",
    "description": "<img width=\"768\" height=\"433\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2123351174-768x433.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Spot Volumes Rise on Centralized Exchanges but Traffic Falls Further, Report\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2123351174-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2123351174-1024x577.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2123351174-768x433.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2123351174-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2123351174-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2123351174-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2123351174.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Spot and futures trading volumes on centralized crypto exchanges (CEXs) have increased in June, a new report shows. At the same time, website traffic to major trading platforms for digital assets continued to decline, according to the study which also tracks its geographical distribution. Spot Volume on Leading Exchanges Jumped by Over 10% in a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-14T03:32:00.000Z",
    "title": "Is UNESCO’s Concern over AI-Supercharged Neurotech’s Threat to Mental Privacy Valid?",
    "url": "https://www.cryptopolitan.com/unescos-ai-neurotechs-threat-mental-privacy/",
    "description": "UNESCO ( United Nations Educational, Scientific and Cultural Organization), the United Nations&#8217; agency for science and culture, has issued a warning about the potential risks to mental privacy arising from the combination of rapid advancements in neurotechnology and artificial intelligence (AI). This convergence poses significant ethical concerns, prompting Unesco to develop a global &#8220;ethical framework&#8221; to ... <a title=\"Is UNESCO&#8217;s Concern over AI-Supercharged Neurotech&#8217;s Threat to Mental Privacy Valid?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/unescos-ai-neurotechs-threat-mental-privacy/\" aria-label=\"More on Is UNESCO&#8217;s Concern over AI-Supercharged Neurotech&#8217;s Threat to Mental Privacy Valid?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-14T03:39:39.000Z",
    "title": "Ethereum Price Breaks $2,000 As The Bulls Take Over Crypto Market",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-breaks-2000/",
    "description": "Ethereum price is up over 7% and trading above $2,000 against the US Dollar. ETH gained pace after XRP jumped over 80% and cleared $0.90. Ethereum is up over 7% from the $1,850 support zone. The price is trading above $1,980 and the 100-hourly Simple Moving Average. There was a break above a key contracting triangle with resistance near $1,885 on the hourly chart of ETH/USD (data feed via Kraken). The pair could rise further toward the $2,050 and $2,120 resistance levels. Ethereum Price Aims Higher Ethereum’s price remained well-bid above the $1,850 zone. ETH started a decent increase after XRP surged over 50%. There was a move above the key $1,890 resistance zone. Many altcoins, including MATIC, SOL, BNB, and ADA gained handsomely in the past few hours. There was also a break above a key contracting triangle with resistance near $1,885 on the hourly chart of ETH/USD. The pair gained over 7% and even surpassed the $2,000 resistance zone. A high is formed near $2,027 and the price is now consolidating gains. Ether is trading above $1,980 and the 100-hourly Simple Moving Average. It is also well above the 23.6% Fib retracement level of the upward move from the $1,865 swing low to the $2,027 high. Source: ETHUSD on TradingView.com On the upside, immediate resistance is near the $2,025 level. The first major resistance is near the $2,050 zone, above which the price could rise toward the $2,120 resistance zone. The next major resistance is near the $2,200 level. Any more gains could send Ether toward the $2,250 resistance or even $2,350. Are Dips Limited in ETH? If Ethereum fails to clear the $2,025 resistance, it could start a downside correction. Initial support on the downside is near the $2,000 level. The first major support is near the $1,980 level, below which the price might test the $1,945 level. It is close to the 50% Fib retracement level of the upward move from the $1,865 swing low to the $2,027 high. The next major support is near the $1,905 level. Any more losses could send Ether toward the $1,865 support level in the near term. Technical Indicators Hourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,945 Major Resistance Level – $2,050"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-14T03:17:14.000Z",
    "title": "Bitcoin Price Attempts To Follow XRP But This Resistance Is The Key",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-attempts-to-follow-xrp/",
    "description": "Bitcoin price started a fresh increase after XRP’s massive rally. BTC is trading above $31,400 and might rally if there is a close above $32,000. Bitcoin is moving higher above the $31,000 and $31,400 resistance levels. The price is trading above $31,000 and the 100 hourly Simple moving average. There was a break above a key contracting triangle with resistance near $30,700 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could gain bullish momentum if there is a close above $32,000. Bitcoin Price Starts Fresh Increase Bitcoin price was able to clear the $30,500 resistance zone. BTC started a fresh increase after a court ruling in favor of Ripple, stating XRP is not a security. There was a break above the $30,650 resistance. Besides, there was a break above a key contracting triangle with resistance near $30,700 on the hourly chart of the BTC/USD pair. The pair even climbed above the $31,400 resistance zone. A high is formed near $31,790 and the price is now consolidating gains. It is trading near the 23.6% Fib retracement level of the recent increase from the $30,217 swing low to the $31,790 high. Bitcoin is now trading above $31,000 and the 100 hourly Simple moving average. Source: BTCUSD on TradingView.com Immediate resistance is near the $31,600 level. The first major resistance is near $31,800, above which the price could gain bullish momentum. In the stated case, BTC might rise toward the $32,000 resistance. The next major resistance is near the $32,500 level. Any more gains could open the doors for a move toward the $33,200 resistance zone. Are Dips Supported in BTC? If Bitcoin fails to clear the $31,800 resistance, it could start a downside correction. Immediate support on the downside is near the $31,200 level. The next major support is near the $31,000 level or the 50% Fib retracement level of the recent increase from the $30,217 swing low to the $31,790 high, below which there could be a drop toward the $30,800 support zone. Any more losses might send the price toward the $30,550 level in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $31,200, followed by $31,000. Major Resistance Levels – $31,650, $31,800, and $32,000."
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-14T03:40:27.000Z",
    "title": "How BaaS Is Driving Innovation and Accelerating the New Age of Finance",
    "url": "https://dailyhodl.com/2023/07/13/how-baas-is-driving-innovation-and-accelerating-the-new-age-of-finance/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/10/crypto-pressures-banking.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/10/crypto-pressures-banking.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/10/crypto-pressures-banking.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/10/crypto-pressures-banking.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/10/crypto-pressures-banking.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/10/crypto-pressures-banking.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/10/crypto-pressures-banking.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The BaaS market has garnered a lot of attention in recent times. According to a fresh study, it is set to expand to $11.4 billion in the next seven years at a 16.9% CAGR. Another report projects the sector to grow to $66 billion during the same period. While the projections vary greatly, one thing [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/13/how-baas-is-driving-innovation-and-accelerating-the-new-age-of-finance/\">How BaaS Is Driving Innovation and Accelerating the New Age of Finance</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]