[
  {
    "source": "Cointelegraph",
    "date": "2023-07-14T22:56:09.000Z",
    "title": "It’s time for the SEC to settle with Coinbase and Ripple",
    "url": "https://cointelegraph.com/news/time-for-the-sec-to-settle-with-coinbase-ripple",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/cfa4a98d-a2d1-4db0-9d66-fb16e42a1b58.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Securities and Exchange Commission should recognize it’s time to settle its cases against Coinbase and Ripple Labs.</p>\n                    <p><p>In every major litigation, there comes a moment when you realize it’s time to settle. A ruling doesn’t go your way, a juror gives your legal team the side eye, the judge makes it clear it’s time for a settlement conference. After Judge Analisa Torres’ <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\">decision in SEC v. Ripple</a><em>, </em>the time has come for the United States Securities and Exchange Commission to settle the remainder of its case against Ripple Labs — as well as its case against Coinbase.</p><p>The SEC’s attack on crypto has used a flexible legal definition of what constitutes a security that must register with the SEC under a legal test established by the Supreme Court in the 1946 case SEC v. Howey. Through most of its history, the SEC used this tool to go after outright frauds and scams with little economic reality behind them. You can understand why judges tended to give the SEC the benefit of the doubt and made the test increasingly flexible over a series of historical scam cases. Using this flexible test to attach legitimate crypto projects is different and, ultimately, leaves crypto projects with no way to register.</p><p>Torres ruled that sales to retail investors of the XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) token were not necessarily linked to the entrepreneurial efforts of Ripple as a firm and, thus, failed one element of the Howey test. This is a unique crypto twist on the Howey test. Linking the investment to the entrepreneurial efforts of whoever is selling the interest is going to be harder in crypto because tokens don’t represent an equity interest in the issuer. Thus, the purchaser of a crypto token is not as closely linked to the efforts of the founder of a new blockchain as equity investors in traditional firms.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/supreme-court-could-stop-the-sec-war-on-crypto\"><strong><em>The Supreme Court could stop the SEC’s war on crypto</em></strong></a></p><p>This turns the SEC’s <a href=\"https://cointelegraph.com/news/coinbase-shares-up-50-since-sec-sued-exchange\">case against Coinbase</a> on its head — and Coinbase knows it. It sent a strong message to the SEC when Coinbase relisted the XRP token within hours of Torres’ decision. This victory was only a partial victory, but it makes it very difficult for the SEC to target secondary markets in crypto securities like secondary trading on Coinbase’s platform. </p><p>All of this analysis doesn’t even begin to explore the challenges the SEC will face with the Supreme Court eager to reign in administrative agencies with the evolving major questions doctrine that could dramatically curtail the SEC’s war on crypto.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">People are speculating what will happen if SEC appeals Ripple case to 2nd Circuit. Ya’ll don’t forget Ripple might still win the whole thing at SCOTUS.  <a href=\"https://t.co/MaWU940Ms1\">https://t.co/MaWU940Ms1</a></p>&mdash; BlockProf (@JWVerret) <a href=\"https://twitter.com/JWVerret/status/1679794717767221250?ref_src=twsrc%5Etfw\">July 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The SEC’s best move now is to settle and make a deal with Coinbase. Coinbase already extended the olive branch to the SEC a year ago by filing a request for rulemaking to create an adapted listing process for crypto assets. I suggested the same about six months earlier after a hearing of the SEC’s investor advisory committee — which I led. The committee found that crypto tokens could not feasibly register with the SEC without adaptation of the listing process.</p><p>There is no shortage of crypto lawyers ready to work with the SEC to figure out an adaptive regulatory regime for crypto tokens. There are hundreds of securities lawyers who are SEC alumni or big law alumni working in crypto right now who could help the SEC adapt their rules in the same way the SEC has adapted its rules in the past for asset-backed securities, master limited partnership, real estate investment trusts and dozens of other hybrid assets and asset vehicles.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/demand-driving-bitcoin-price-to-130k\"><strong><em>Demand is driving the price of Bitcoin to $130K</em></strong></a></p><p>Many of the disclosure requirements in the SEC’s disclosure rules about boards of directors, executive compensation, shareholder proposals and financial statements simply don’t fit crypto projects. Who would “register” Ethereum today? It has no board and no CEO. </p><p>What assets and liabilities would be on the balance sheet of an entity filing documents about Ethereum, given that no entity actually controls the well-decentralized Ethereum blockchain? None of that is clear.</p><p>And things crypto asset buyers want to know, such as tokenomics or audits of blockchain security or the smart contracts underlying <a href=\"https://cointelegraph.com/news/sec-charges-binance-coinbase-terrible-defi\">decentralized finance (DeFi)</a> exchanges, aren’t mentioned in SEC disclosure rules. </p><p>The game of chicken that the SEC has been playing with Coinbase and Ripple needs to end because the SEC is about to get run off the road. There is a better path consistent with the rule of law. It’s time for the SEC to work with crypto lawyers to develop a workable crypto asset listing and disclosure regime and quit the blithe “just come in and register” talking points. This alternative approach will better protect crypto asset buyers.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>J.W. Verret </strong>is an associate professor at George Mason University’s Antonin Scalia Law School. He is a practicing crypto forensic accountant and also practices securities law at Lawrence Law LLC. He is a member of the Financial Accounting Standards Board’s Advisory Council and a former member of the SEC Investor Advisory Committee. He also leads the Crypto Freedom Lab, a think tank fighting for policy change to preserve freedom and privacy for crypto developers and users.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-14T22:40:22.000Z",
    "title": "Mysterious self-proclaimed Binance stakeholder “Eeon” seeks to intervene in SEC’s suit against the exchange",
    "url": "https://cryptoslate.com/mysterious-binance-stakeholder-eeon-seeks-to-intervene-in-sec-suit/",
    "description": "<p>&#8220;Eeon,&#8221; an individual that claims to represent Binance customers, attempted to enter an ongoing securities case concerning the exchange company on July 14. Eeon and the affected customers wrote in a filing: &#8220;We are the proper parties to this matter as we have been identified by the Court in its Order issued on June 17, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/mysterious-binance-stakeholder-eeon-seeks-to-intervene-in-sec-suit/\">Mysterious self-proclaimed Binance stakeholder &#8220;Eeon&#8221; seeks to intervene in SEC&#8217;s suit against the exchange</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  }
]