[
  {
    "source": "Decrypt",
    "date": "2024-03-29T21:31:02.000Z",
    "title": "Bitcoin Runes Coming to Magic Eden After Ordinals Bet Pays Off",
    "url": "https://decrypt.co/224139/bitcoin-runes-magic-eden-after-ordinals-bet-pays-off",
    "description": "The upcoming Runes fungible token standard will “supercharge the Bitcoin ecosystem,” a Magic Eden co-founder told Decrypt."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-29T21:28:17.000Z",
    "title": "Vitalik believes memecoins should be used for philanthropy and social impact",
    "url": "https://cryptoslate.com/vitalik-believes-memecoins-should-be-geared-toward-philanthropy-and-social-impact/",
    "description": "<p>Ethereum co-founder Vitalik Buterin recently articulated a reflective and forward-looking perspective on the evolution of memecoins within the crypto ecosystem. Memecoins, initially popularized by Dogecoin and later by a plethora of imitators, have been a subject of much debate and scrutiny for their volatile nature and, at times, controversial impacts. Buterin&#8217;s latest blog post delved [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/vitalik-believes-memecoins-should-be-geared-toward-philanthropy-and-social-impact/\">Vitalik believes memecoins should be used for philanthropy and social impact</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-29T21:38:23.000Z",
    "title": "Whale Investors Shift Over $618 Million in Crypto, Signaling Major Market Moves",
    "url": "https://www.cryptopolitan.com/whales-millions-move-shakes-crypto-waters/",
    "description": "A large translation of financial power from high-net-worth cryptocurrency investors, generally called &#8220;whales,&#8221; took place recently; it is worth noticing that over $618 million in major digital currencies was transferred. The current wave covers Bitcoin (BTC), Ethereum (ETH), and other alternative crypto family members, impressing the market and raising questions concerning asset pricing and investor [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-29T21:37:00.000Z",
    "title": "Uniswap Price Prediction 2024-2033: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2024-2033 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-29T21:30:21.000Z",
    "title": "Dogwifhat (WIF) Flips PEPE As The 3rd Largest Memecoin After Hitting $4",
    "url": "https://www.newsbtc.com/news/dogwifhat-wif-flips-pepe-as-the-3rd-largest-memecoin-after-hitting-4/",
    "description": "Memecoins are again in the spotlight as some of the most popular dog-themed tokens performed remarkably during this bull cycle. Dogwifhat (WIF), Floki Inu (FLOKI), and Dogecoin (DOGE) have done impressive numbers this month. WIF’s market capitalization skyrocketed to almost $4 billion, surpassing PEPE and taking third place as the largest memecoin in the market by this metric. Related Reading: Analysts Bullish On FLOKI As Price Surges 9.8%, New ATH Soon? Hats On, Is WIF Going To The Moon? Yesterday, WIF’s price increased 32% in half a day, setting a new all-time high (ATH) of $4. Simultaneously, its market capitalization jumped from $3.04 billion to $3.98 billion, according to CoinMarketCap data, which represents a 30% increase in the same timeframe. This remarkable performance saw dogwifhat flipping PEPE as the third largest memecoin by market cap, now ranking just below Dogecoin and Shiba Inu (SHIB) in this category. Top 5 memecoins by market capitalization. Source: CoinMarketCap As reported by EmberCN, this performance gave wifto100billy.sol, the largest WIF holder, $134 million in unrealized profits. This whale bought 37 million WIF for approximately $9.33 million at an average of $0,248. When it reached its ATH price of $4, the wallet saw a 1440% gain on the inversion. Since then, WIF’s market cap has decreased to $3.65 billion, which still represents a 15.25% increase from 24 hours ago and remains above PEPE’s $3.82 market cap. $WIF approaching $4 like pic.twitter.com/SyXLRHUPnL &#8212; risicare (@risicare_eth) March 29, 2024 Similarly, WIF saw an 8.5% correction from its ATH price. At the time of writing, the token changes hands at $3.66, a 20% increase in 24 hours. Moreover, WIF’s market activity skyrocketed by 70%, with its daily trading volume reaching $808.4 million. Dogwifhat Shows “Organic&#8221; Growth, But What’s Going On With Memecoins Dogwifhat is one of the newest players in the market, and it has accomplished incredible achievements since its launch in November 2023. The token has amassed a loyal community that seems to be focused on bringing the project “to the moon.” After putting on their hats, WIF investors raised over $700,000 in a few days as part of its Las Vegas Sphere project, displaying the community’s extent. Furthermore, Cryptonary’s CTO, Asad Saddique, revealed in an X post that Dogwifhat has recently reached 100,000 “organic” holders. WIF just crossed 100,000 holders no brute force or gamed bs i know bc ive manually tracked it daily since early dec pic.twitter.com/K1W4GHG98d &#8212; asad (@xbtcas) March 28, 2024 Nonetheless, the divisive memecoin presale frenzy has created a fear of fatigue from overexposure to these tokens, with some investors arguing that memecoins are taking a turn for the worse. Despite this, interest has not faded away. Ethereum’s founder, Vitalik Buterin, recently published a blog post titled “What Else Could Memecoins Be?” In the post, Buterin discussed the current state of the memecoins landscape and expressed his &#8220;disappointment&#8221; that innovation is not driving these projects to the market. Just this month, many controversies have surrounded the crypto community regarding memecoins, including the appalling launch of racist and antisemitic tokens. Undoubtedly, the memecoin market is broad, diverse, and full of enough potential that projects can develop and grow a strong community. Still, it appears efforts from projects working to be more than a meme are overshadowed by the controversial actors in the market. Related Reading: Shiba Inu Going To $0.0001: Crypto Analyst Reveals What Will Drive The Rally WIF is trading at 3.68 in the 1-day chart. Source: WIFUSDT on Tradingview.com  Featured Image from X.com, Chart from TradingView.com"
  }
]