[
  {
    "source": "Decrypt",
    "date": "2023-08-22T00:01:02.000Z",
    "title": "K-Pop Titans Blackpink Launch Roblox Metaverse Experience",
    "url": "https://decrypt.co/153251/k-pop-titans-blackpink-launch-roblox-metaverse-experience",
    "description": "Blackpink: The Palace launches this week in Roblox and will evolve over the next year with metaverse experiences for K-pop fans."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-21T23:51:07.000Z",
    "title": "Gaming Influencers FaZe Banks, Nadeshot Among Friend.tech's Top Earners",
    "url": "https://decrypt.co/153243/gaming-influencers-faze-banks-nadeshot-among-friend-tech-top-earners",
    "description": "The esports and gaming titans behind FaZe Clan and 100 Thieves respectively are making bank on buzzy social token app Friend.tech."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T23:53:22.000Z",
    "title": "Nano Price Prediction 2023-2032: Is XNO a Good Investment?",
    "url": "https://www.cryptopolitan.com/nano-price-prediction-2023-to-2032/",
    "description": "Nano Price Prediction 2023-2032 What&#8217;s distinctive about the Nano network and its native currency XNO? Nano is a cryptocurrency that claims to be &#8220;a low-latency payment platform that requires minimal resources.&#8221; Nano&#8217;s initial objective, like that of other cryptocurrencies, is to serve as a viable replacement for fiat currency. Nano has a delegated Proof-of-Stake (DPoS) ... <a title=\"Nano Price Prediction 2023-2032: Is XNO a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nano-price-prediction-2023-to-2032/\" aria-label=\"More on Nano Price Prediction 2023-2032: Is XNO a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-22T00:00:46.000Z",
    "title": "AVAX Price Bucks Under The Pressure Of Upcoming $102 Million Token Unlock",
    "url": "https://www.newsbtc.com/analysis/avax/avax-price-bucks-under-the-pressure-of-upcoming-102-million-token-unlock/",
    "description": "While most altcoins are looking toward a recovery from the recent market crash, the AVAX price seems to be gearing up for the opposite. The reason behind this is the massive token unlock that is set to occur this week, which will undoubtedly place more sell pressure on the already struggling price of the digital asset. $102 Million In AVAX Set To Be Unlocked The Avalanche network, like a lot of others, has locked a portion of its total token supply to be released into circulation on a periodic basis. Given that these unlock events can put bearish pressure on a token, they can often be a signal to exit. Related Reading: Bitcoin Liquidations Top $500 Million Amid $1 Billion Crypto Decimation For AVAX, the next token unlock event is set to take place on August 26, five days from now. But the most interesting thing about this event is the number of tokens set to be brought into circulation. According to the token tracking website Token Unlocks, a total of 9.54 million tokens are set to be unlocked on Saturday. This accounts for 2.77% of the total circulating supply of the asset, worth $102.29 million at current prices. 2.77% of token supply set to be unlocked &#124; Source: Token Unlocks The website also shows that the unlocked tokens are being distributed in four allocations. These include 1.13 million tokens ($12.06 million) for airdrop, 1.67 million tokens (17.87 million) for Foundation, 2.25 million tokens ($24.12 million) for strategic partners, and 4.5 million tokens ($48.24 million) for the team. With this unlock, over 55% of the total token supply will be unlocked, leaving less than 45% of the supply locked. And as these 9.54 million tokens make their way to the market, it could be very bad for investors. Will AVAX Price Be Impacted? Given the allocation of the $102 million in tokens set to be unlocked, it is likely that a large chunk of it is going to hit the open market. As a result of such a large amount of selling, the AVAX price will certainly be impacted, making an already bad situation worse. This will likely see the price of the digital asset fall below $10 for the first time since July 2021. Trading in the single-digit will see AVAX holders plunged further into losses, even though the vast majority are already sitting in the red, according to data from IntoTheBlock. Related Reading: Why Is Dogecoin Price Down Today? AVAX’s indicators are also incredibly bearish at this point with the price sitting below the 100-day and 200-day simple moving averages. This rules out a recovery for the digital asset in the short term, especially with the unlock event coming up. At the time of writing, the AVAX price is sitting tentatively at $10.56, down 13.15% in the last week. Avalanche price crashes to $10.5 &#124; Source: AVAXUSD on Tradingview.com Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from FXLeaders, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-22T00:04:01.000Z",
    "title": "BRICS Crafting Massive Expansion Agreement With Dozens of Countries Looking to Join: Official",
    "url": "https://dailyhodl.com/2023/08/21/brics-crafting-massive-expansion-agreement-with-dozens-of-countries-looking-to-join-official/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/brics-agreement-expand.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/brics-agreement-expand.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/brics-agreement-expand.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/brics-agreement-expand.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/brics-agreement-expand.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/brics-agreement-expand.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/brics-agreement-expand.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The economic coalition of BRICS is nearing an agreement to expand its membership in the face of flooding interest from other nations, an insider reports. South Africa&#8217;s Ambassador to BRICS Anil Sooklal says in a new Bloomberg interview that a criteria for expanding the group, which currently consists of Brasil, Russia, India, China and South [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/21/brics-crafting-massive-expansion-agreement-with-dozens-of-countries-looking-to-join-official/\">BRICS Crafting Massive Expansion Agreement With Dozens of Countries Looking to Join: Official</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-22T00:00:57.000Z",
    "title": "Ethereum Layer-2s Gaining Momentum Despite Market Doldrums, Says Analytics Firm IntoTheBlock",
    "url": "https://dailyhodl.com/2023/08/21/ethereum-layer-2s-gaining-momentum-despite-market-doldrums-says-analytics-firm-intotheblock/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/07/eth-scaling-activity.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/07/eth-scaling-activity.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/07/eth-scaling-activity.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/07/eth-scaling-activity.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/07/eth-scaling-activity.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/07/eth-scaling-activity.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/07/eth-scaling-activity.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Ethereum (ETH) layer-2s are continuing to establish themselves as bright spots on the crypto landscape despite a lengthy bear market, analytics firm IntoTheBlock reports. In a new article, IntoTheBlock takes a look at the hottest Ethereum layer-2s, including Optimism (OP), Arbitrum (ARB) and Base. The firm says that Ethereum scaling solutions have been getting an [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/21/ethereum-layer-2s-gaining-momentum-despite-market-doldrums-says-analytics-firm-intotheblock/\">Ethereum Layer-2s Gaining Momentum Despite Market Doldrums, Says Analytics Firm IntoTheBlock</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]