[
  {
    "source": "Cointelegraph",
    "date": "2023-10-04T06:00:55.000Z",
    "title": "Lawyers debate over Ripple case after rejection of SEC’s motion for appeal",
    "url": "https://cointelegraph.com/news/lawyers-debate-over-ripple-case-judge-reject-sec-motion-appeal",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/20c2e298-6157-4289-ba79-62078b736dd5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Crypto lawyer Jeremy Hogan described the recent order as a “disaster” for the SEC, but other legal commentators are urging the community to temper its excitement for now.</p>\n                    <p><p>Crypto lawyers are seemingly divided over the significance of a recent court order from Judge Analisa Torres, which denied the United States Securities and Exchange Commission’s (SEC) plan to file an interlocutory appeal against Ripple.</p><p>While many lawyers and commentators chalked the decision up as a substantive win for Ripple in its case against the regulator, other legal experts have urged the public to temper their enthusiasm. </p><p>Judge Torres’ denied the SEC’s interlocutory appeal based on the grounds of her previous ruling which sided partially in favor of Ripple. She said this did not necessitate an order that “involved a controlling question of law,” which is an essential condition for approving an interlocutory appeal. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Breaking: Judge rejects SEC’s motion to file an appeal against Ripple ruling</p>&mdash; Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1709344673582723308?ref_src=twsrc%5Etfw\">October 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>An interlocutory appeal is simply an appeal made during the course of a trial — which in this case, is the ongoing proceedings by the SEC against Ripple and its CEO Brad Garlinghouse and executive chairman Christian Larsen. </p><p>Bill Hughes, a lawyer at blockchain firm Consensys, told Cointelegraph that the rejection of the SEC’s appeal was something that he’d expected, explaining that it's not typical for such an appeal to make it through during this part of a trial. </p><p>On the other hand, crypto lawyer Jeremey Hogan was more confident that the decision was a “disaster” for the SEC. Hughes however disagreed.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The SEC&#39;s motion for interlocutory appeal DENIED.<br><br>Which means, the case either goes to trial in April, or goes away.<br><br>AND, this Order allowed the Judge to explain parts of her ruling even better, making appeal that much harder for the SEC to win.<br><br>Disaster for the agency. <a href=\"https://t.co/y1Gz8LolrG\">https://t.co/y1Gz8LolrG</a> <a href=\"https://t.co/hkktKMD4Ut\">pic.twitter.com/hkktKMD4Ut</a></p>&mdash; Jeremy Hogan (@attorneyjeremy1) <a href=\"https://twitter.com/attorneyjeremy1/status/1709358286850675193?ref_src=twsrc%5Etfw\">October 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“The court says that [Torres’] ruling is limited to this case. Frankly, that’s fine for the SEC if they don't mind one case not telling you very much about the next,” Hughes explained.</p><p>Similarly, Gabriel Shapiro, the General Counsel at Delphi Labs, warned crypto advocates to temper their excitement over the ruling, explaining that the decision wasn’t an all-out loss for the SEC. </p><p>In an Oct. 3 <a href=\"https://twitter.com/lex_node/status/1709346799591289248\" target=\"_blank\" rel=\"noopener nofollow\">post</a> on X (formerly known as Twitter), Shapiro said that while the SEC’s motion for an appeal had been denied in this instance, the SEC could still appeal the case later. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">don&#39;t get too excited about the denial of SEC&#39;s interlocutory appeal in Ripple...it doesn&#39;t mean the SEC &quot;lost its appeal&quot;...it means that if the SEC wants to appeal it has to appeal everything at once after the trial... <br><br>still, some useful clarifications of Torres&#39; opinion</p>&mdash; _gabrielShapir0 (@lex_node) <a href=\"https://twitter.com/lex_node/status/1709346799591289248?ref_src=twsrc%5Etfw\">October 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“It doesn't mean the SEC ‘lost its appeal’... it means that if the SEC wants to appeal it has to appeal everything at once after the trial,” he said. </p><p>Still, as Scott Chamberlain, an entrepreneurial fellow at the ANU College of Law <a href=\"https://twitter.com/scotty2ten/status/1709362786802000332\" target=\"_blank\" rel=\"noopener nofollow\">explained</a>, the decision may prove more significant for Ripple than others are willing to give credit for. </p><p>“Yes, the SEC can appeal later, but it is stuck with [a] shitty factual record that makes successful appeal much more difficult,” Chamberlain wrote.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ripple-approval-singapore-payments-license\"><strong><em>Ripple gets formal approval for Singapore payments license</em></strong></a></p><p>Chamberlain added that any future appeal from the Commission would most likely be heard in the Supreme Court as there’s no major legal questions left to decide. All that’s left is the “difficult but ultimately mundane task of applying known law to a complicated fact matrix that doesn’t support the SECs claim.”</p><blockquote>“The law didn’t change. SEC failed to prove its case. Now it has to push shit uphill with a pointy stick if it wants to win.”</blockquote><p>Ripple CEO Brad Garlinghouse also added his take to the mix, taking to social media to express his enthusiasm.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The SEC’s request to file an interlocutory appeal is DENIED. I’m not a lawyer but it seems the Court just told the SEC: You asked me to apply the “Howey” test, I did, and like it or not, you lost. <a href=\"https://t.co/0E4MS0iuRY\">https://t.co/0E4MS0iuRY</a> <a href=\"https://t.co/bkhCpum17n\">pic.twitter.com/bkhCpum17n</a></p>&mdash; Brad Garlinghouse (@bgarlinghouse) <a href=\"https://twitter.com/bgarlinghouse/status/1709410982194532514?ref_src=twsrc%5Etfw\">October 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As set out in the most recent court order, the trial on the matter is currently scheduled for April 23, 2024. If the SEC wishes to lodge an appeal, it will need to do so after the trial has concluded. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Blockchain detectives — Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-04T05:56:32.000Z",
    "title": "SBF Trial: Day 1 concludes without a final jury selected",
    "url": "https://cryptoslate.com/sbf-trial-day-1-concludes-without-a-final-jury-selected/",
    "description": "<p>The first day of the Sam Bankman-Fried (SBF) trial ended without a final jury being selected, and the process will continue for another day. The U.S. District Court for the Southern District of New York plans to choose 12 jurors and six alternates through the process, which is expected to conclude on Oct. 4. Judge [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sbf-trial-day-1-concludes-without-a-final-jury-selected/\">SBF Trial: Day 1 concludes without a final jury selected</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-04T06:07:47.000Z",
    "title": "Ripple Receives Digital Payments License in Singapore",
    "url": "https://cryptodaily.co.uk/2023/10/ripple-receives-digital-payments-license-in-singapore",
    "description": "The news comes in on the same day with a renewed thrust from the crypto firm after a recent ruling from U.S. courts denies the SEC from filing an appeal against Ripple Labs."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-04T05:51:23.000Z",
    "title": "How Do Gold-Backed Cryptocurrencies Serve As Safeguard Against Inflation?",
    "url": "https://www.cryptopolitan.com/gold-backed-cryptocurrencies-safeguard/",
    "description": "Gold-backed cryptocurrencies are a fusion of digital convenience and the enduring stability of gold. These digital assets are straightforward in concept: they derive value from physical gold reserves, offering investors a unique bridge between the digital and tangible worlds. Unlike many cryptocurrencies with volatile price swings, these tokens are anchored to gold&#8217;s reliable and time-tested ... <a title=\"How Do Gold-Backed Cryptocurrencies Serve As Safeguard Against Inflation?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gold-backed-cryptocurrencies-safeguard/\" aria-label=\"More on How Do Gold-Backed Cryptocurrencies Serve As Safeguard Against Inflation?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-04T05:49:59.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\">Read more</a>"
  }
]