[
  {
    "source": "Cointelegraph",
    "date": "2023-10-11T04:44:48.000Z",
    "title": "Immutable links with AWS in latest Web3 gaming push",
    "url": "https://cointelegraph.com/news/immutable-aws-partner-for-web3-gaming-devs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/3fef7055-12fd-492c-8c5c-290e27fe3c01.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The blockchain gaming firm said it will gain access to a vast pipeline of game studio leads and support for successful deal closures. </p>\n                    <p><p>Web3 gaming platform Immutable has partnered with Amazon Web Services to extend options for game developers as the cloud service provider expands its startup accelerator programs.</p><p>In an Oct. 10 blog <a href=\"https://www.immutable.com/blog/immutable-and-amazon-investing-in-the-next-evolution-of-gaming\" target=\"_blank\" rel=\"noopener nofollow\">post</a>, <a href=\"https://cointelegraph.com/explained/what-is-immutable-explained\">Immutable</a> said AWS added it to a list of companies within its ISV (independent software vendors) Accelerate Program, where organizations provide software solutions that run on or integrate with AWS.</p><p>Additionally, developers looking to build on Immutable’s blockchain can join AWS Activate, a program that provides perks including technical support, training and $100,000 worth of AWS cloud credits.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Immutable?src=hash&amp;ref_src=twsrc%5Etfw\">#Immutable</a>  <a href=\"https://twitter.com/amazon?ref_src=twsrc%5Etfw\">@amazon</a><br><br>Amazon Web Services and Immutable are working together to shape the future of gaming!<br><br>Through our collaboration with Amazon, we will gain access to a vast pipeline of game studio leads, support for successful deal closures, and up to $100k in AWS cloud… <a href=\"https://t.co/SX7xfFqrtK\">pic.twitter.com/SX7xfFqrtK</a></p>&mdash; Immutable (@Immutable) <a href=\"https://twitter.com/Immutable/status/1711865035612733594?ref_src=twsrc%5Etfw\">October 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>AWS head of startups Australia, John Kearney, told Cointelegraph that Immutable is a “great example of a local Aussie startup that has gone global” and reaffirmed the cloud provider’s commitment to expanding Web3 game development using its infrastructure.</p><p>Immutable has been built with Amazon EventBridge and AWS Lambda, serverless services that use events to connect application components together. This has enabled the platform to \"increase its scalability to handle a 10x increase in partnered games,” according to the announcement.</p><p>Concerns have previously been raised <a href=\"https://cointelegraph.com/news/ethereum-dev-addresses-node-centralization-concerns-in-runup-to-the-merge\">about the centralization</a> of gaming and Ethereum along with the <a href=\"https://cointelegraph.com/news/3-cloud-providers-accounting-for-over-two-thirds-of-ethereum-nodes-data\">reliance on Amazon</a> — the market leader capturing about a third of the cloud services market. </p><p>Immutable product marketing lead, Michael Powell, alleviated some of those concerns — explaining to <a href=\"https://fortune.com/crypto/2023/10/10/amazon-aws-immutable-partnership-activate-isv-accelerate-cloud-computing/\" target=\"_blank\" rel=\"noopener nofollow\">Fortune</a> in an Oct. 11 report:</p><blockquote>“A lot of blockchain purists are very big into the idea of decentralization and that everything has to be on-chain and that’s a massive deviation from where game developers actually build.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/immutable-s-gods-unchained-launches-epic-games-store\"><strong><em>Immutable’s Gods Unchained launches on Epic Games Store</em></strong></a></p><p>In August, Immutable <a href=\"https://cointelegraph.com/news/immutable-zkevm-begins-testnet-phase-with-polygon\">began public testing</a> its zkEVM, or zero-knowledge Ethereum Virtual Machine, in collaboration with Polygon Labs.</p><p>According to the firm, zkEVM will lower development costs for game developers while providing the security and network effects that come with the Ethereum ecosystem.</p><p>Immutable was valued at $2.5 billion in March 2022 following a <a href=\"https://cointelegraph.com/news/immutable-raises-200m-to-invest-in-blockchain-gaming-bringing-valuation-to-2-5b\">$200 million Series C</a> funding round led primarily by Singaporean state-owned investment firm Temasek.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/singer-verites-web3-music-nfts-community/\">Singer Vérité’s fan-first approach to Web3, music NFTs and community building</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-11T05:02:25.000Z",
    "title": "UK MPs push for NFT copyright protection and code of conduct, addressing risks",
    "url": "https://www.cryptopolitan.com/uk-mps-push-for-nft-copyright-protection/",
    "description": "A UK cross-party Committee is urging the government to collaborate with non-fungible token (NFT) marketplaces to combat copyright infringement and implement a code of conduct to safeguard creators.&#160; The concern revolves around instances where NFTs are generated from original creative works without obtaining proper authorization from the rightful creators and owners. Such actions can potentially ... <a title=\"UK MPs push for NFT copyright protection and code of conduct, addressing risks\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uk-mps-push-for-nft-copyright-protection/\" aria-label=\"More on UK MPs push for NFT copyright protection and code of conduct, addressing risks\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-11T04:50:28.000Z",
    "title": "Google Launches AI-Created Demand Gen Ads to Rival Against Competitors",
    "url": "https://www.cryptopolitan.com/google-launches-ai-created-demand-gen-ads/",
    "description": "In a strategic move to reclaim its dominance in the digital advertising space, Google has officially launched its highly anticipated Demand Gen AI-created video adverts on a global scale. The campaign, initially revealed in June, promises businesses innovative methods to engage with their target audience. By automatically pairing tailored campaign assets and copy with specific ... <a title=\"Google Launches AI-Created Demand Gen Ads to Rival Against Competitors\" class=\"read-more\" href=\"https://www.cryptopolitan.com/google-launches-ai-created-demand-gen-ads/\" aria-label=\"More on Google Launches AI-Created Demand Gen Ads to Rival Against Competitors\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-11T04:48:14.000Z",
    "title": "Ethereum Price Targets Fresh Lows, Can Bulls Save This Key Support?",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-targets-fresh-lows-1540/",
    "description": "Ethereum price is struggling to stay above the $1,550 support against the US dollar. ETH could take a hit if it settles below $1,550 and then $1,540. Ethereum is showing bearish signs and struggling to clear the $1,600. The price is trading below $1,600 and the 100-hourly Simple Moving Average. There is a major bearish trend line forming with resistance near $1,600 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a recovery wave if the bulls defend the $1,550 support zone. Ethereum Price Struggles Ethereum failed to start a recovery wave above the $1,600 resistance zone. ETH remained in a bearish zone and extended its decline toward $1,550, like Bitcoin. It seems like the bears already attempted a close below the $1,550 support zone. A new swing low was formed near $1,542 and the price is now consolidating losses. The price is back above the $1,550 level, but it is still showing heavy bearish signs. Ethereum is now trading below $1,600 and the 100-hourly Simple Moving Average. Besides, there is a major bearish trend line forming with resistance near $1,600 on the hourly chart of ETH/USD. On the upside, the price might face resistance near the $1,570 level. It is near the 23.6% Fib retracement level of the downward move from the $1,664 swing high to the $1,542 low. The first major resistance is near the trend line and $1,600 or the 100-hourly Simple Moving Average. Source: ETHUSD on TradingView.com The 50% Fib retracement level of the downward move from the $1,664 swing high to the $1,542 low is also near the trend line. The next major resistance is $1,620, above which the price could rise toward the $1,665 resistance zone. A close above the $1,665 resistance might send the price toward the main resistance at $1,750. Any more gains might open the doors for a move toward $1,880. Downside Break in ETH? If Ethereum fails to clear the $1,600 resistance, it could continue to move down. Initial support on the downside is near the $1,550 level. The next key support is $1,540. A downside break below the $1,540 support might start another strong decline. In the stated case, the price could revisit the $1,480 level. Any more losses may perhaps send Ether toward the $1,420 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,540 Major Resistance Level – $1,600"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-11T05:03:40.000Z",
    "title": "XRP News: SEC vs. Ripple – Unraveling the Future After Appeal Denial",
    "url": "https://www.crypto-news-flash.com/xrp-news-sec-vs-ripple-unraveling-the-future-after-appeal-denial/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-news-sec-vs-ripple-unraveling-the-future-after-appeal-denial",
    "description": "<img width=\"1280\" height=\"960\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-1024x768.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-768x576.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />The SEC has recently been dealt another blow in its ongoing XRP lawsuit after the presiding judge denied its motion for appeal. Legal expert Jeremy Hogan has highlighted what could happen in the Ripple case following this development. As CNF has been reporting, there has been a positive development for the XRP community in the [...]"
  }
]