[
  {
    "source": "CoinDesk",
    "date": "2023-10-19T18:21:47.000Z",
    "title": "Bitcoin Eyes $29K, Defying Fresh Crypto Lawsuit, Rate Fears",
    "url": "https://www.coindesk.com/markets/2023/10/19/bitcoin-eyes-29k-defying-fresh-crypto-lawsuit-rate-fears/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The New York Attorney General filed early Thursday a lawsuit against Genesis, Gemini and DCG for allegedly defrauding investors of $1 billion."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-19T18:17:35.000Z",
    "title": "U.S. Treasury Seeks to Name Crypto Mixers as 'Money Laundering Concern'",
    "url": "https://www.coindesk.com/policy/2023/10/19/us-treasury-seeks-to-name-crypto-mixers-as-money-laundering-concern/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Department of the Treasury's financial crimes arm is proposing to label crypto mixers as a \"primary money laundering concern\" in its effort to combat illicit crypto finance, highlighting the terrorist groups that have benefited from anonymous crypto funds, including possibly Hamas."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-19T18:30:00.000Z",
    "title": "Binance Q3 report appraises crypto market as ‘challenging’ amid high interest rates",
    "url": "https://cointelegraph.com/news/binance-q3-report-crypto-market-challenging-high-interest-rates",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/b0890292-1286-4ea2-8de5-675b0dba8f29.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The world’s largest cryptocurrency exchange painted a somber picture of the market, with occasional bright spots for individual players.</p>\n                    <p><p>It’s been a challenging quarter for crypto, Binance has confirmed in its Q3 market pulse report. The market was down in many sectors, the report <a href=\"https://public.bnbstatic.com/static/files/research/3q23-market-pulse.pdf\" target=\"_blank\" rel=\"noopener nofollow\">found</a>, although the entry of institutional players such as Deutsche Bank, Sony and PayPal helped offset some of the pain. </p><p>The global crypto market capitalization was down 8.6% quarter-on-quarter (QoQ) “with the ‘higher for longer’ interest rate rhetoric set to persist.” Fundraising was at its lowest since Q4 2020 and down 21.4% QoQ, with infrastructure doing significantly better than other sectors. </p><p>Activity was down slightly on blockchains, with NEAR being the big exception. It saw an increase of about 120% QoQ. NEAR also saw a spike in active addresses that started in August. BNB fell sharply, while Ethereum rose slightly and Solana fell slightly. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/700-m-loss-crypto-hacks-exploits-scams-q3-certik\">Q3 2023 crowned most ‘damaging’ quarter for crypto amid $700M losses: Report</a></em></strong></p><p>Total value locked (TVL) dropped 13.1% across decentralized finance despite an influx of real-world assets, while liquid staking saw a 10.5% increase. Ethereum was the leading blockchain with 55.1% of TVL, despite an 18.6% decline. Tron’s TVL rose by 17.9% QoQ. Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) accounted for 67.2% of the stablecoin market's share.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Our latest State of Crypto Report summarises all the key insights, events, and learnings from Q3.<br><br>Find everything you need to know about developments in the space, including analysis of:<br><br> Layer 1s &amp; 2s<br> DeFi<br> NFTs<br> Gaming<br><br>Start reading here ⤵️<a href=\"https://t.co/ES5z6g8FMU\">https://t.co/ES5z6g8FMU</a></p>&mdash; Binance Research (@BinanceResearch) <a href=\"https://twitter.com/BinanceResearch/status/1714946953010651277?ref_src=twsrc%5Etfw\">October 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Nonfungible token (NFT) sales continued their slide. September was the worst month for NFT sales since January 2021 at around $300 million. Their average sale price that month was $38.17, down from a high of $791.84 in August 2021. However, transactions with NFTs were up overall despite a sharp downturn in September. </p><p>Gaming tokens led the way in NFT sales, even though they were also the loss leaders in price with a 44.9% decrease QoQ. Less than 28% of Web3 games have gone live. Google’s decision to allow NFTs in the games on its Play Store may give the market new impetus, Binance said. Sweat Economy and SuperWalk have taken the second and third places, respectively, by unique active wallets, showing increased interest in move-to-earn games. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/3d439791-bdcc-4728-aec6-6485040cae8d.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Cryptocurrency price performance in Q3 2023. Source: Binance</em></figcaption></figure><p>Six of the ten top coins saw increases this year. Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SO</a>L) had the best showing, up 113.73%, and Ton debuted on the list, down 3.11%. Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is up 63.05% so far, and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) is up 39.9%. BNB (<a href=\"https://cointelegraph.com/ethereum-price\">BNB</a>) had lost 12.77% by the end of Q3 2023. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ethereum-restaking-blockchain-dangerous/\">Ethereum restaking: Blockchain innovation or dangerous house of cards?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-19T18:18:55.000Z",
    "title": "Latest update — Former FTX CEO Sam Bankman-Fried trial [Day 12]",
    "url": "https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-updates",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/8c987bc0-629b-4bdf-bdc1-a38e679df2f9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The former FTX CEO faces seven counts of conspiracy and fraud. A New York court will decide his fate.</p>\n                    <p><p>Cointelegraph reporters are on the ground in New York for the trial of former FTX CEO Sam “SBF” Bankman-Fried. As the saga unfolds, check below for the latest updates.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/72729d3e-fa60-4a48-96c3-8eb652ddf672.png\"  /></figure><h3>Oct. 19: Former FTX legal counsel presents spreadsheet used to track $2.1 billion in loans to SBF, other execs</h3><p>FTX’s former general counsel Can Sun was unaware of the exchange's commingling of funds with Alameda Research, he told jurors on Oct. 19 as part of his testimony in <a href=\"https://cointelegraph.com/news/alameda-research-withdraw-unlimited-funds-gary-wang\">Sam Bankman-Fried's criminal trial</a>.</p><p>In August 2022, Sun learned about Alameda's exemption from the liquidation engine system from other employees. Normally, the system would liquidate loss-making trades, but Alameda bypassed the mechanism due to its exception.</p><p>Upon learning about the problem, Sun allegedly worked on a plan to fix the issue. The plan would include a delay-liquidation mechanism to replace the non-exemption on Alameda's account. According to the plan, the delayed mechanism would later be applied to other market makers on FTX, which also sought to notify customers and regulators about the issue. According to San, the plan was stalled by other FTX departments and was never implemented.</p><p>Furthermore, Sun acknowledged that he relied on Bankman-Fried's statements about segregating customer funds to develop the company's terms of service and answer regulators' inquiries. FTX's Terms of Services said that \"none of the Digital Assets in your account are the property of, or shall or may be loaned to, FTX Trading” — in opposition to what was happening between the sister companies. The same terms would apply to fiat assets, Sun noted in his testimony.</p><p>Additionally, the former FTX attorney disclosed a spreadsheet he used to trace loans made by Alameda to Bankman-Fried, Gary Wang, Ryan Salame and <a href=\"https://cointelegraph.com/news/nishad-singh-remembering-ftx-sbf-trial\">Nishad Singh</a>. According to the spreadsheet, Alameda loaned them $2.1 billion across 35 loans.</p><p>These loans were used to fund other venture investments by FTX. While this process wasn't the most transparent way of carrying out investments, it was a legal option at the time, Sun said.</p><p>According to prosecutors, the spreadsheet did not include millions of dollars transferred to Salame and Bankman-Fried. Sun said he was unaware of the additional transactions.</p><p>Sun traveled from Japan to testify in court as part of his non-prosecution agreement with the Department of Justice.</p><p>The trial of Bankman-Fried will resume on Oct. 26. The prosecution expects to rest its case on that date. Defense counsel has not yet confirmed whether a case will be brought.</p><h3>Oct. 18: \"Lawyers should do better than this\" — Judge Kaplan</h3><p>District Judge Lewis Kaplan had run out of patience during Sam Bankman-Fried’s trial on Oct. 18, calling out on lawyers representing both parties in the criminal court case. The judge’s comments came after a witness fleeing Texas for the trial testified for roughly 15 minutes. </p><p>Cory Gaddis, a policy specialist at Google, spent over three hours flying only to confirm that Google’s metadata indicates Caroline Ellison and Bankman-Fried owned a fabricated balance sheet of Alameda Research. According to Ellison’s testimony from last week, she developed seven alternative spreadsheets to mislead Alameda’s lenders about its financial health in 2022.</p><p>In cross-examination, Bankman-Fried defense counsel ended Gaddis' testimony at the third question, after realizing he wasn’t a technical expert. His testimony stretched to a mere 15 minutes. </p><p>\"Lawyers should do better than this,\" Judge Kaplan said, complaining about prosecutors and the defense counsel's witness strategies. </p><p>Judge Kaplan definitely has a point. In the morning, Eliora Kats, former FTX lobbyist, took a short test just to confirm FTX had publicly advocated in Washington, D.C. for crypto regulation, which is already public knowledge, noted Judge Kaplan. </p><p>\"These people [jurors] are giving up weeks of their lives, and I care about it,\" he noted. </p><p>Prosecutors are expected to rest their case on Oct. 25. The defense counsel has not yet confirmed a case. </p><h3>Oct. 18: Forensic analysis of Alameda and FTX accounts</h3><p>Accounting professor Peter Easton provided a breakdown of the alleged commingling of funds between FTX and Alameda Research since 2021. Easton is an accounting specialist working on forensic financial analysis and testified on Oct. 18 at the Southern District Court of New York as part of Bankman-Fried’s criminal trial. </p><p>According to Easton’s analysis, Alameda invested in Genesis Capital, K5 Global Holdings, Anthropic PBC, Dave Inc, Modulo Capital and other ventures, partially using funds from FTX customers. In June 2022, Alameda had a negative balance of $11.3 billion with FTX, while the companies’ liquid assets stood at $2.3 billion, meaning a gap of $9 billion between the sister firms.</p><p>Another critical point from the analysis: Alameda has 57 accounts with FTX that could have negative balances, whereas no other customer could do so. The analysis challenges Bankman-Fried’s defense argument that Alameda had similar privileges as other market makers on FTX.</p><p>Another finding of the analysis is that Alameda repaid $6.6 billion in loans to crypto lenders during the bear market in 2022. Of these funds, 68% ($4.5 billion) were traced as customer assets, while 32% ($2.1 billion) came from its own funds.</p><p>At least 35 properties in the Bahamas were purchased with customer funds totaling $228.5 million, according to Easton.</p><h2>Oct. 13: BlockFi would not have filed for bankruptcy without the FTX debacle</h2><p>The BlockFi team warned its leadership about the crypto lender’s over-exposure to FTX Token (FTT) in August 2021, according to evidence presented in court on Oct. 13 during Sam Bankman-Fried’s trial.</p><p>A credit memo prepared by BlockFi’s team in August 2021 recommended against a loan of 10,000 Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) to Alameda Research, worth nearly $470 million at the time. </p><p>Zac Prince, founder and former CEO of BlockFi, said the loan was denied, but Alameda increased its borrowings with BlockFi in the following months, reaching $1 billion in the second quarter of 2022. Prince testified that Alameda had always paid its loans on time until the collapse of FTX in November 2022, and that the loans had always been overcollateralized. He was unfamiliar with the fact that Alameda was paying the loans using funds from FTX customers.</p><p>One of the stress scenarios presented by BlockFi’s team in 2021 observed that if Alameda entered into default, with all lenders calling for repayment at the same time, the price of FTT would drop 60% to 75% in a day (or more). </p><p>Another stress evaluation during the same period noted that even in a scenario in which all collaterals decline 100%, FTX would still have a positive balance of $638 million in assets. The projections were made based on consolidated balance sheets presented by Alameda.</p><p>The connection between Alameda and BlockFi started at the end of 2021, when the first $15 million was lent to Alameda. Prince noted that Alameda went through due diligence processes across many departments on BlockFi, but the financial documents provided were unaudited. </p><p>Alameda was lent capital under open-term loans, which allowed borrowers such as BlockFi to call for repayment of funds at any time. In June 2022, following the collapse of the Terra ecosystem, BlockFi called back millions in loans owned by Alameda. </p><p>According to Prince, the loans were paid, and the companies deepened their relationship amid the bear market.</p><p>Seeking capital from investors during the same period, BlockFi entered into an agreement with FTX US that included $400 million in credit and a potential acquisition of BlockFi in July 2023, which never happened since both companies went bankrupt as a result of last November’s events.</p><p>Alameda offered FTT, SOL (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) and SRM as collateral for loans. According to Prince’s testimony, those tokens were held on BlockFi’s account on FTX. BlockFi also used FTX as a trading platform for its clients’ orders. At the time of FTX bankruptcy, the crypto lending platform had $650 million lent to Alameda and $350 million in funds available for trading. </p><p>Once it became clear that funds were impaired and loans wouldn’t be repaid, BlockFi filed for bankruptcy. Prince noted that despite the challenges of the bear market, BlockFi would not have filed for bankruptcy without the FTX debacle.</p><h2>Oct. 12: Ellison’s testimony continues, with further focus on relationship with Sam Bankman-Fried</h2><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Caroline Ellison alleges <a href=\"https://twitter.com/hashtag/SBF?src=hash&amp;ref_src=twsrc%5Etfw\">#SBF</a> utilized Thai sex worker IDs in a bid to unfreeze $1B in Alameda funds before resorting to bribery. <a href=\"https://t.co/COPHbaECz6\">pic.twitter.com/COPHbaECz6</a></p>&mdash; Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1712441772821873143?ref_src=twsrc%5Etfw\">October 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The cross-examination of Caroline Ellison started in the Southern District Court of New York on Oct. 12, with the former CEO of Alameda Research discussing the decision-making process between Alameda and FTX, as well as how her romantic relationship with Bankman-Fried played a role in the events leading up to the exchange’s collapse. </p><p>The defense counsel first explored the capital lent to Alameda by crypto lenders Genesis and Voyager. According to Ellison’s testimony, funds borrowed by Alameda could be legally used for a range of purposes, including trading activities and covering the company’s operating expenses. The defense used her remarks to show that Alameda’s lenders knew the capital was being used for undefined purposes.</p><p>She also reported that communication with Bankman-Fried deteriorated after their last breakup in April 2022, with her avoiding meeting with the former partner one-on-one and preferring to communicate via Signal or group meetings instead. The communication challenges a her concerns about FTX venture investments made Ellison consider resigning as CEO of Alameda in early 2022.</p><p>In response to questions from Bankman-Fried’s defense attorney, Ellison acknowledged having held at least 20 meetings with prosecutors since December 2022 as part of her cooperation agreement, including a review of her answers on Oct. 9, one day prior to her testifying as a witness in the case. In December, before an agreement was in place with the U.S. government, she acknowledged the Federal Bureau of Investigation searched her house.</p><p>During the bear market, Ellison also created financial forecasts of how much money would be needed to hedge Alameda against market downturns, according to her testimony. She discovered that Alameda would have to sell billions of dollars in assets to have an appropriate hedge.</p><p>Additionally, Ellison discussed Alameda’s Northern Dimension bank account, which FTX used while it had difficulty opening its own. Later on, around the end of 2021 and the beginning of 2022, FTX was able to get its account and began redirecting users’ funds. However, legacy customers still sent funds to Northern Dimension’s account. As evidence, the defense pointed to one of her meetings with prosecutors in December 2022, in which she suggested that Bankman-Fried was unaware that FTX customers’ funds were still being sent to Alameda. </p><h2>Oct. 11: Caroline Ellison details the final months of FTX</h2><p>On her second day of testimony at the trial of Sam “SBF” Bankman-Fried trial on Oct. 11, Caroline Ellison provided more information about the months leading up to the FTX debacle in November 2022. Lenders required Alameda Research to repay millions in loans in mid-June following the market downturn in May, according to Ellison. “I was very stressed out,” she said.</p><p>Genesis Capital was one of these lenders, recalling $500 million in loans, according to screenshots taken from conversations between Ellison, Bankman-Fried and Genesis employees via Telegram.</p><p>At the time, Alameda had over $13 billion of debt on its credit line with FTX, while its open-term loans exceeded $1.3 billion. As per Ellison’s testimony, <a href=\"https://cointelegraph.com/news/caroline-ellison-alternative-balance-sheets-alameda-exposure-ftx\">Bankman-Fried instructed her</a> to devise “alternative ways” to disclose Alameda’s financial information to lenders, specifically Genesis.</p><p>According to Ellison, Genesis could recall all loans to Alameda if it were aware of Alameda’s true financial status, as well as damage its reputation. “I didn’t want Genesis to know that,” she stated about Alameda’s multibillion-dollar liability toward FTX.</p><p>As per prosecutors’ evidence, Ellison worked on at least seven alternative spreadsheets for Genesis. A spreadsheet sent by Alameda to Genesis in June listed $10.3 billion in total liabilities, whereas the actual amount was approximately $15 billion at the time.</p><p>Bankman-Fried’s plans to survive the storm <a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-equity-saudi-crown-prince-mbs\">included raising capital from Mohammed bin Salman</a>, the crown prince of Saudi Arabia. According to evidence presented in court, Ellison made a list of “things Sam is freaking out about” months before the exchange collapsed. </p><p>The list featured raising capital from “the MBS,” borrowing more capital from BlockFi, which had already lent Alameda over $660 million, as well as “getting regulators to crack down on Binance,” in an effort by Bankman-Fried to expand FTX’s market share, Ellison said.</p><p>She also mentioned a $150 million bribe that FTX allegedly paid to a Chinese official in 2021 to release funds frozen there as part of an investigation into money laundering. The alleged bribe is not included in the trial.</p><h3>Oct. 10: Gary Wang is cross-examined, star witness Ellison enters</h3><p>The fourth day of the trial began with <a href=\"https://cointelegraph.com/news/ftx-co-founder-wang-plea-deal-knowledge-financial-concepts-sbf-trial\">Gary Wang concluding</a> his testimony. He was cross-examined by one of SBF’s lawyers, Christian Everdell. </p><p>During the cross-examination, Wang was asked about Bankman-Fried’s intention to shut down Alameda, to which Wang responded that SBF thought there was a “30% chance” it should be shut down. He also said he wasn’t sure whether the tweet by Binance CEO Changpeng Zhao or leaked financials caused the FTX bank run. </p><p>After Wang was dismissed by Judge Lewis Kaplan,<a href=\"https://cointelegraph.com/news/sbf-trial-alameda-ceo-caroline-ellison-sam-bankman-fried\"> Ellison, the former CEO of Alameda</a> and an ex-girlfriend of Bankman-Fried, was called to the witness stand.</p><p>In the opening questions, Ellison was asked why she was guilty of the crimes for which she was accused and responded that “Alameda took several billions of dollars from FTX customers and used it for investments.”</p><p>She reportedly <a href=\"https://cointelegraph.com/news/caroline-ellison-testifies-sam-bankman-fried-trial\">placed the entire blame</a> for the misuse of FTX user funds on Bankman-Fried. Ellison claimed he “set up the systems” that allowed Alameda to take $14 billion from the exchange.</p><p>Ellison also revealed personal information about her relationship with the defendant, including his <a href=\"https://cointelegraph.com/news/sam-bankman-fried-us-president-says-caroline-ellison\">aspirations to be U.S. president</a> and that he considered paying former U.S. President Donald Trump not to run for reelection. </p><p>Additionally, she testified on the firm <a href=\"https://cointelegraph.com/news/binance-s-ftx-acquisition-seen-as-chess-move-by-crypto-community\">buying back FTX Tokens (FTT)</a> from Binance or else “Binance would cause trouble,” along with using loans from Genesis in 2021 as a funding source.</p><p>“Alameda took several billions of dollars from FTX customers and used it for investments,” said Ellison, according to reports. “I sent balance sheets that made Alameda look less risky than it was.”</p><p>Ellison admitted to not feeling qualified for the CEO role at Alameda, though she was encouraged by SBF, and said she took a $3.5 million loan from the firm “for a gambling company people at FTX wanted to put in my name” and for political contributions. </p><h3>Oct. 6 Gary Wang’s testimony continues admits to “special privileges” given to FTX on Alameda</h3><p>The trial continued for the fourth day on Friday, Oct. 6, with a shorter session ending at 2:00 pm Eastern Time because jurors opted not to take a lunch break. </p><p>Wang, the former chief technology officer of FTX, continued to testify after a brief stint the previous afternoon. On this day, Wang testified that the back-end code and the database for FTX.com kept track of many coins a user had and the availability of a feature called “allow negative.”</p><p>According to Inner City Press, the prosecutor asked Wang what would happen if that feature was checked to which Wang said, “<a href=\"https://cointelegraph.com/news/alameda-research-withdraw-unlimited-funds-gary-wang\">Then you are allowed to go beyond.</a> “</p><p>He then said that Alameda’s account was <a href=\"https://cointelegraph.com/news/alameda-account-ftx-special-privileges-gary-wang\">allowed this special privilege</a> and could, therefore, “trade more than it had in its account. They had a large line of credit. And it could trade faster than others.”</p><p>“It withdrew more than it had in its account, like $8 billion in fiat and crypto,” Wang said. When asked where the money came from, he said, “from FTX customers.”</p><p>According to Wang’s testimony, he overheard Bankman-Fried saying Alameda could withdraw up to $50–$100 million from FTX. He said that after a 2020 database query, he saw Alameda’s balance was negative to an amount greater than the revenue of FTX itself. </p><p>Wang pleaded <a href=\"https://cointelegraph.com/news/caroline-ellison-gary-wang-plead-guilty-to-fraud-charges\">guilty to four charges</a> in December 2022, one of which was wire fraud. Like Ellison, Wang has agreed to cooperate with officials via a plea deal that could see him avoid up to 50 years in prison. </p><h3>Oct. 5: Wang details relationship between FTX and Alameda Research</h3><p>In over four hours of testimony, Wang provided in-depth details about the relationship between the companies and how the crypto empire ended up with an $8 billion hole in customer assets.</p><p>According to Wang, a few months after FTX’s inception, in 2019, Alameda received special privileges from FTX. Prosecutors used screenshots of FTX’s database and code available on GitHub to show that Alameda was allowed to have an unlimited negative balance at FTX, a special line of credit of $65 billion in 2022 and an exemption from the liquidation engine. </p><p>The commingling of funds and problems between companies evolved over time. In 2020, Bankman-Fried instructed Wang that Alameda’s negative balance should not exceed FTX’s revenue — a rule that changed over the years, according to Wang’s testimony. In late 2021, for example, Alameda’s liability to FTX stood at $3 billion, up from $300 million in 2020. </p><p>“I trusted his judgment,” Wang said when asked why he agreed to Alameda’s privileges. </p><p>However, these alleged privileges were part of Alameda’s role as a primary market maker for FTX, the defense argued later during Wang’s testimony. The defense counsel also noted that other market makers had similar privileges at FTX, and being able to go negative was a key feature of any market maker. </p><p>Another point emphasized by prosecutors was the MobileCoin exploit in 2021. Bankman-Fried allegedly told Wang and Ellison to add the multimillion-dollar deficit to Alameda’s balance sheet instead of keeping it on FTX to hide the loss from FTX investors.</p><p>Months before FTX’s collapse, Bankman-Fried, Wang and former engineering director Nishad Singh discussed shutting down Alameda and replacing its role with other market makers. The company’s liabilities, however, were too high at the time, sitting at $14 billion. Alameda remained in operation until November 2022.</p><p>Wang’s testimony will continue on Oct. 10, the same day Ellison’s will be heard.</p><h3>Oct. 5: Yedidia cross-examination, witness testimonies in focus</h3><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Day 3 of the <a href=\"https://twitter.com/hashtag/SBF?src=hash&amp;ref_src=twsrc%5Etfw\">#SBF</a> trial, we’re here bright and early! ☀️ <a href=\"https://t.co/PQ1rQV38Px\">pic.twitter.com/PQ1rQV38Px</a></p>&mdash; Cointelegraph (@Cointelegraph) <a href=\"https://twitter.com/Cointelegraph/status/1709907602056892822?ref_src=twsrc%5Etfw\">October 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>A liability of $8 billion from Alameda to FTX was at the center of prosecutors’ cross-examination of Adam Yedidia on Oct. 5. Yedidia is a close friend of Bankman-Fried and was a developer at FTX. He was also one of ten people to live in Bankman-Fried’s $35 million luxury resort in the Bahamas.</p><p>According to Yedidia’s testimony, since early 2021, FTX used an Alameda account labeled North Dimension to deposit users’ funds while facing difficulties opening its own bank account. Funds would be considered Alameda’s liability toward FTX, which reached $8 billion in June 2022.</p><p>While Yedidia was aware of the funds sent to Alameda’s account, he didn’t see it as a concern when he first heard about it in 2021. However, after learning about the liability amount in 2022, he voiced his concerns to Bankman-Fried during a tennis game. According to Yedidia, Bankman-Fried said the debt should be settled between the companies within six months to three years.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/84814733-30c3-475b-a6c5-6330993246a1.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Scenes from outside Bankman-Fried’s trial location in New York. Source: Ana Paula Pereira/Cointelegraph</em></figcaption></figure><p>“I trusted Sam, Caroline, and others in Alameda to handle the situation,” he said, answering questions from prosecutors. Upon learning that Alameda was not only holding the funds but using them to pay its debtors, Yedidia resigned in November 2022.</p><p>While prosecutors used the case to illustrate how the companies were commingling funds, Bankman-Fried’s defense counsel sought to share a broader picture of FTX and Alameda’s relationship with the jury.</p><p>The defense highlighted that FTX was growing fast, with its leadership working over 10 hours a day during the 2021 bull market, including Bankman-Fried, who oversaw several parts of the company at the time.</p><p>The defense counsel also pointed out that Yedidia had been under several inquiries from prosecutors under an immunity order, meaning cooperation with prosecutors would protect him from facing any charges regarding his role at FTX. </p><p>Also, according to Bankman-Fried’s defense, FTX’s difficulties opening a bank account and its reliance on Alameda’s North Dimension to deposit funds were well known. Yedidia’s cross-examination will resume this afternoon in the federal courtroom in lower Manhattan.</p><p>Two witnesses testified during the second part of the Bankman-Fried trial on Oct. 5: Matthew Huang, co-founder of Paradigm and Wang, co-founder of FTX and Alameda Research.</p><p>Paradigm invested a total of $278 million in FTX in two funding rounds between 2021 and 2022. According to Huang, the venture capital firm was not aware of the commingling of funds between FTX and Alameda, nor of the privileges that Alameda had with the crypto exchange.</p><p>Such privileges included Alameda’s exemption from FTX’s liquidation engine (a tool that closes positions at risk of liquidation). With the exemption, Alameda was able to leverage its position and maintain a negative balance with FTX.</p><p>The Paradigm co-founder also acknowledged that the firm did not conduct deeper due diligence on FTX, instead relying on information provided by Bankman-Fried.</p><p>Another concern for Paradigm was FTX not having a board of directors. According to Huang, Bankman-Fried was “very resistant” to the idea of having investors on FTX’s board of directors but promised to build one and appoint experienced executives to serve on it.</p><p><a href=\"https://cointelegraph.com/news/alameda-research-withdraw-unlimited-funds-gary-wang\">During his brief testimony</a>, Wang acknowledged that he, along with Bankman-fried and Ellison, had committed wire fraud, securities fraud and commodities fraud.</p><p>Wang also noted that Alameda had special privileges with FTX, such as the ability to withdraw unlimited funds from the exchange, as well as a line of credit of $65 billion. To illustrate these privileges, Wang pointed out that any other market maker would have a credit line in the millions, while Alameda had a credit line in the billions. </p><p>A loan of approximately $200 million to $300 million from Alameda was also mentioned by Wang, allegedly as part of the purchase of other crypto firms. However, the loans were never credited to his account. His testimony will continue on Oct. 6.</p><h3>Oct. 4: DOJ and Bankman-Fried’s defense state their arguments</h3><p>The first hours of SBF’s trial have offered a glimpse of the arguments the U.S. Department of Justice (DOJ) and the former FTX CEO’s defense will bring to court in the coming weeks.</p><p>After a jury selection in the morning, both parties gave opening statements to the 12-person jury present in the court.</p><p>The DOJ took a tough stance against Bankman-Fried in its first statement, portraying the FTX founder as someone who deliberately lied to investors to enrich himself and expand his crypto empire.</p><p>According to the DOJ, Bankman-Fried lied to FTX customers and investors, using Alameda as a key partner to “steal customers’ funds,” a phrase that was frequently used during the opening statements.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/1004794e-c2f7-4865-9c1b-39a97e4c06f2.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>A sign outside Bankman-Fried’s trial location in New York. Source: Ana Paula Pereira/Cointelegraph</em></figcaption></figure><p>As per the trial preview, the DOJ will focus its arguments on allegations that Bankman-Fried misled customers, investors and lenders regarding the safety of their funds while using Alameda to steal their money and influence politicians in Washington.</p><p>The defense, meanwhile, brought arguments about Bankman-Fried being a young entrepreneur who made business decisions that “didn’t work out.” The defense denied the existence of secret transactions between Alameda and FTX or a backdoor used to steal customer funds. According to the previous arguments presented, all transactions were legitimate or made in good faith by Bankman-Fried during the crypto market downturn and the subsequent collapse of FTX in November 2022.</p><p>The defense also highlighted the role of Binance in the bank run that led to FTX’s collapse. Testimonies will continue throughout the day.</p><p>According to the defense, Bankman-Fried assumed FTX was allowed to loan funds to Alameda as part of a business relationship with the market maker, and there was no secret door for transactions between the companies.</p><p>Prosecutors also noted that Ellison, Wang and Singh would offer the jury insider details about Bankman-Fried’s role in FTX’s operations and alleged crimes. However, the defense pointed out that as part of the cooperation agreement with the government, they were supposed to give testimony against Bankman-Fried, raising doubts about their credibility.</p><p>The defense also downplayed the accusations against the nature of the relationship between FTX and Alameda, arguing that FTX margin traders were aware of the risks associated with transactions.</p><p>“There was no theft,” the defense claimed. “It’s not a crime to be the CEO of a company that files for bankruptcy.”</p><p>In the second half of the first day of the trial, the jury heard from two witnesses: Mark Julliard, a French trader and former client of FTX, and Adam Yedidia, a friend of Sam Bankman-Fried and former employee at Alameda Research and FTX.</p><p>In his testimony, Julliard said he had four Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) held at FTX at the time of the exchange’s collapse, worth nearly $100,000. He admitted that FTX and Bankman-Fried’s marketing efforts, as well as the notable venture capital companies backing FTX, gave him the confidence to use the exchange for crypto trading. He assumed that venture capital firms had done due diligence on FTX and its leadership.</p><p>During the questioning, prosecutors emphasized that the trader used FTX exclusively for spot trading and was unaware that the exchange used client funds for crypto trading with Alameda Research.</p><p>Questions for Yedidia were focused on his educational background at the Massachusetts Institute of Technology, where he first met Bankman-Fried and had two professional experiences with the FTX founder. Yedidia worked at Alameda briefly in 2017 as a trader and then returned to work for FTX in 2021 as a developer. He was among 10 people living in the Bahamas on FTX’s $30 million real estate.</p><p>In Yedidia’s testimony, prosecutors used former FTX ads as evidence that the company was always positioning itself as a safe, trusted and easy way to invest in cryptocurrency, including marketing campaigns with NFL player Tom Brady and comedian Larry David. The trial will resume Oct. 5.</p><h3>Oct. 3: SBF trial begins</h3><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/2a41313e-7417-40e7-99d5-fb2eee7cb785.jpg\"  /><figcaption style=\"text-align: center;\"><em>Bankman-Fried’s trial will take place in a Manhattan federal court. Source: Ana Paula Pereira/Cointelegraph</em></figcaption></figure><p>The trial of Bankman-Fried began on Oct. 3 with jury selection. Bankman-Fried is charged with seven counts of conspiracy and fraud in connection with the collapse of FTX, the cryptocurrency exchange he co-founded. He <a href=\"https://cointelegraph.com/news/ftx-s-sam-bankman-fried-pleads-not-guilty-to-fraud-charges-report\">has pleaded not guilty</a> to all charges. The case is being heard by Judge Lewis Kaplan, who has presided over a long list of other high-profile cases, including ones involving detainees at Guantanamo Bay, the Gambino crime family, Prince Andrew and Donald Trump.</p><p>Bankman-Fried <a href=\"https://cointelegraph.com/news/judge-orders-sam-bankman-fried-bail-revoked-following-allegations-witness-intimidation\">was ordered to be jailed</a> on Aug. 11 after Kaplan found that his sharing of former Alameda Research CEO Caroline Ellison’s personal papers amounted to witness intimidation. Alameda Research was a trading house also founded by Bankman-Fried. Previously, he had <a href=\"https://cointelegraph.com/news/sbf-sent-home-after-his-parents-put-up-their-house-to-cover-his-astronomical-bail-bond\">been under house arrest</a> in his parents’ home in Stanford, California, on a $250-million bond.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/gB1zBrqHPLw\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><h3>December: SBF arrested</h3><p>Bankman-Fried was arrested in the United States on his arrival from the Bahamas on Dec. 21, 2022. He had <a href=\"https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-arrested-and-in-custody-attorney-general\">been arrested in the Bahamas</a> on Dec. 12 after the U.S. government formally notified the country of charges the U.S. was filing against him. He declared his intention to fight extradition from the Caribbean nation but changed his mind after a week in Bahaman jail and <a href=\"https://cointelegraph.com/news/sam-bankman-fried-seeks-to-reverse-decision-on-contesting-extradition-report\">consented to extradition</a>.</p><p>Meanwhile, FTX co-founder Gary Wang and Alameda Research CEO (and reportedly sometime SBF girlfriend) Ellison <a href=\"https://cointelegraph.com/news/caroline-ellison-gary-wang-plead-guilty-to-fraud-charges\">agreed to plead guilty</a> in the burgeoning case.</p><h3>November: FTX collapses</h3><p>Bankman-Fried’s troubles began when reports emerged on Nov. 2 that Alameda Research had a large holding of FTX Token (<a href=\"https://cointelegraph.com/ftx-token-ftt-price-index\">FTT</a>), FTX’s utility token. That revelation led to questions about the relationship between the two entities. On Nov. 6, Changpeng Zhao, CEO of rival exchange Binance, announced that his exchange <a href=\"https://cointelegraph.com/news/binance-to-liquidate-its-entire-ftx-token-holdings-after-recent-revelations\">would liquidate its FTT</a> holdings, which were estimated to be worth $2.1 billion. Zhao turned down an offer tweeted by Ellison to buy Binance’s FTT.</p><p>A run <a href=\"https://cointelegraph.com/news/ftx-addresses-user-withdrawal-complaints-amid-major-token-movement\">began on FTX</a>. Bankman-Fried gave reassurances on Twitter (now X) that the exchange’s “assets are fine” and accused “a competitor” of spreading rumors. By Nov. 8, the price of FTT had <a href=\"https://cointelegraph.com/news/ftx-token-price-risks-30-plunge-as-a-23m-ftt-part-moves-to-binance\">fallen from $22</a> to $15.40.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">It’s only been one week since SBF’s notorious “FTX is fine. Assets are fine.” <a href=\"https://t.co/zKoILqquHF\">pic.twitter.com/zKoILqquHF</a></p>&mdash; Robert Smith (@BondHack) <a href=\"https://twitter.com/BondHack/status/1592250606747799552?ref_src=twsrc%5Etfw\">November 14, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Also on Nov. 8, Bankman-Fried announced on Twitter that he had <a href=\"https://cointelegraph.com/news/binance-ceo-announces-intent-to-acquire-ftx-to-help-cover-the-liquidity-crunch\">come to an agreement</a> with Zhao “on a strategic transaction.” He wrote, “Our teams are working on clearing out the withdrawal backlog as is. This will clear out liquidity crunches; all assets will be covered 1:1.”</p><p>On Nov. 9, Zhao announced that Binance <a href=\"https://cointelegraph.com/news/ftx-s-binance-rescue-deal-falls-apart-in-less-than-48-hours\">would not pursue the acquisition of FTX</a> after due diligence and more reports of mishandled funds. The price of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) <a href=\"https://cointelegraph.com/news/bitcoin-price-hits-multi-year-low-at-15-6k-analysts-expect-further-downside\">plummeted to $15,600</a>. The FTX and Alameda Research <a href=\"https://cointelegraph.com/news/alameda-s-research-and-ftx-ventures-websites-taken-down\">websites went dark</a> for a few hours. When the FTX website came back, it bore a warning against making deposits and was unable to process withdrawals.</p><p>On Nov. 10, Bankman-Fried <a href=\"https://cointelegraph.com/news/sam-bankman-fried-apologizes-over-ftx-liquidity-crisis-i-fucked-up-twice\">posted a 22-part Twitter thread</a> that began with “I’m sorry.” It was the first of a long string of public statements he made about the exchange’s fall. The following day, the entire staff of Alameda Research quit, and FTX, FTX US and Alameda Research <a href=\"https://cointelegraph.com/news/ftx-ftx-us-and-alameda-file-for-chapter-11-bankruptcy-in-us-sbf-resigns\">filed for bankruptcy in the United States</a>. Bankman-Fried resigned as FTX CEO and was replaced by John J. Ray III, who was best known for his role in the Enron bankruptcy.</p><h3>SBF and FTX before the fall</h3><p>At the beginning of 2022, FTX <a href=\"https://cointelegraph.com/news/ftx-exchange-breaks-32b-valuation-despite-crypto-winter-fears\">had a $32-billion valuation</a> and <a href=\"https://cointelegraph.com/news/ftx-revenue-reportedly-grew-1000-in-one-year-leaked-documents-reveal\">was thought to be in enviable financial condition</a>. Bankman-Fried was seen as a respected business leader by much of the crypto community and the world at large. He was photographed with political leaders and <a href=\"https://www.agriculture.senate.gov/imo/media/doc/Testimony_Bankman-Fried_0209202211.pdf\" target=\"_blank\" rel=\"noopener nofollow\">spoke</a> at congressional <a href=\"https://docs.house.gov/meetings/AG/AG00/20220512/114729/HHRG-117-AG00-Wstate-Bankman-FriedS-20220512.pdf\" target=\"_blank\" rel=\"noopener nofollow\">hearings</a>. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Maxine Waters is chairing the investigation into FTX <a href=\"https://t.co/oFMctH4rRh\">https://t.co/oFMctH4rRh</a> <a href=\"https://t.co/Ox6O5w4nOl\">pic.twitter.com/Ox6O5w4nOl</a></p>&mdash; Jordan Schachtel @ dossier.today (@JordanSchachtel) <a href=\"https://twitter.com/JordanSchachtel/status/1593289220755525632?ref_src=twsrc%5Etfw\">November 17, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>He had <a href=\"https://cointelegraph.com/magazine/sam-bankman-fried-the-crypto-whale-who-wants-to-give-billions-away/\">gained a reputation as a philanthropist</a>, pursuing a philosophy popular among academics known as “effective altruism.” Part of his implementation of that philosophy <a href=\"https://cointelegraph.com/news/sam-bankman-fried-could-spend-up-to-1b-in-2024-to-thwart-trump-comeback\">was political activism</a> in the form of financial support for candidates.</p><p>As the crypto winter set in, Bankman-Fried <a href=\"https://cointelegraph.com/news/sbf-and-alameda-step-in-to-prevent-crypto-collapse-contagion\">spoke of FTX and Alameda Research’s</a> “responsibility to seriously consider stepping in, even if it is at a loss to ourselves, to stem contagion.” The companies made a bid for Voyager Digital <a href=\"https://cointelegraph.com/news/voyager-rejects-alameda-buyout-offer-as-it-harms-customers\">that was rebuffed</a>.</p><p>FTX <a href=\"https://cointelegraph.com/news/ftx-and-visa-partner-to-permit-crypto-payments-in-40-countries\">made a deal with Visa</a> to introduce its own debit card in 40 countries.</p><p>Bankman-Fried, Ellison and other alumni of Jane Street Capital founded Alameda Research in 2017. Bankman-Fried went on to found FTX with Wang in 2019. Zhao was an early investor in the exchange.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-19T18:21:08.000Z",
    "title": "Hommiestoken: Redefining the Crypto Landscape with Real-World Utility and a November Launch",
    "url": "https://cryptodaily.co.uk/2023/10/hommiestoken-redefining-the-crypto-landscape-with-real-world-utility-and-a-november-launch",
    "description": "Hommiestoken: Redefining the Crypto Landscape with Real-World Utility and a November Launch"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-19T18:21:11.000Z",
    "title": "Hommiestoken: Redefining the Crypto Landscape with Real-World Utility and a November Launch",
    "url": "https://www.cryptopolitan.com/hommiestoken-redefining-the-crypto-landscape-with-real-world-utility-and-a-november-launch/",
    "description": "melbourne, Australia, October 19th, 2023, Chainwire The cryptocurrency market is rapidly evolving, and at the forefront of this revolution is Hommiestoken, a project that&#8217;s set to redefine the landscape of blockchain-based utility. Hommiestoken is on a mission to empower the middle class worldwide with a comprehensive multi-utility dapp system. As the launch date approaches (scheduled ... <a title=\"Hommiestoken: Redefining the Crypto Landscape with Real-World Utility and a November Launch\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hommiestoken-redefining-the-crypto-landscape-with-real-world-utility-and-a-november-launch/\" aria-label=\"More on Hommiestoken: Redefining the Crypto Landscape with Real-World Utility and a November Launch\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-19T18:10:35.000Z",
    "title": "Binance announces more EUR fiat channels",
    "url": "https://crypto.news/binance-announces-more-eur-fiat-channels/",
    "description": "In an Oct. 19 post, Binance shares the news of its growing European presence by collaborating with multiple regulated fiat partners to offer EUR services. "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-19T18:29:12.000Z",
    "title": "Bitcoin Miner Marathon Bolsters Security with $4,300,000,000,000 Asset Manager Fidelity Digital Custody Partnership",
    "url": "https://www.crypto-news-flash.com/bitcoin-miner-marathon-bolsters-security-with-4300000000000-asset-manager-fidelity-digital-custody-partnership/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-miner-marathon-bolsters-security-with-4300000000000-asset-manager-fidelity-digital-custody-partnership",
    "description": "<img width=\"2560\" height=\"1536\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/bitcoin-3406638-1-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/bitcoin-3406638-1-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/bitcoin-3406638-1-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/bitcoin-3406638-1-1024x614.jpg 1024w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />In a bid to diversify its custodial services and reduce associated risks, Marathon Digital entered into an agreement with Fidelity Digital Assets Services, which is terminable at any time by either party upon 30 days prior written notice. Marathon Digital is a major Bitcoin miner that produced 1,242 BTCs in September hence holding about 13,726 [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-19T18:15:21.000Z",
    "title": "Blockchain.com and TON Foundation Team Up to Bring Toncoin to Telegram Users Worldwide",
    "url": "https://www.crypto-news-flash.com/blockchain-com-and-ton-foundation-team-up-to-bring-toncoin-to-telegram-users-worldwide/?utm_source=rss&utm_medium=rss&utm_campaign=blockchain-com-and-ton-foundation-team-up-to-bring-toncoin-to-telegram-users-worldwide",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-58-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-58-1.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-58-1-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-58-1-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-58-1-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />The Open Network Foundation has partnered with Blockchain.com to enable retailers to buy, sell, and trade cryptocurrency worldwide. Over 800 million monthly active Telegram users will gain easy access to cryptocurrencies starting next month. The Open Network Foundation (TON) is collaborating with Blockchain.com to offer the buying, selling, and trading of cryptocurrencies for retail and [...]"
  }
]