[
  {
    "source": "NewsBTC",
    "date": "2023-08-15T03:00:14.000Z",
    "title": "Cardano Whales Rapidly Accumulating, ADA Bull Run Incoming?",
    "url": "https://www.newsbtc.com/news/cardano/cardano-whales-rapidly-accumulating-ada-bull-run-incoming/",
    "description": "There are encouraging on-chain activities in Cardano. According to Santiment, an on-chain analytics platform, on August 14, there were 25,294 wallet addresses with at least 100,000 ADA, the highest in over 16 months. The uptick could signal interest, especially considering that prices are under pressure looking at the performance in the daily chart.  ADA Whales Accumulating Looking at Santiment trends, it appears that ADA whales began accumulating as early as June 2022, and the number has been rising steadily ever since. However, amid this encouraging &#8220;bullish&#8221; signal, ADA prices have fluctuated, edged lower, and diverged with whales&#8217; actions in the past 16 months. ADA is changing hands at around $0.289 at spot rates, down from $0.465 when whales began loading up in mid-June 2022, as seen below.  There are over 25,000 whales with at least 100,000 ADA of writing in mid-August, up by over 3,000 since June 2022. Overall, and as aforementioned, this is a vote of confidence for Cardano and may signal optimism in how ADA&#8217;s future prices could pan out.  Related Reading: Michael Burry’s Massive $1.6 Billion Short: Is A $DXY Collapse The Catalyst For A Crypto Bloodbath? In crypto, token holders closely monitor whale activity, as their actions often influence market sentiment. Their continued accumulation, for example, of ADA, is an endorsement of a project&#8217;s potential and could ignite demand, lifting prices. Conversely, when they offload, it could trigger a sell-off, forcing asset prices lower. ADA whales are buying more of the coin when Cardano&#8217;s market capitalization has been pulling back from 2023 highs. At spot rates, the project&#8217;s market cap is down by at least 35%, dropping from $15.76 billion to $10.1 billion as of mid-August. Even so, ADA is one of the most liquid coins looking at the average daily trading volumes and position in the leader board.  Cardano Building, ADA Resilient But Weak Presently ranked eighth, Cardano is ahead of Solana and Tron but trailing XRP and Dogecoin in the top 10. ADA is trading at $0.289, down roughly 10% from August 2023 highs. While ADA remains within the June to July 2023 trading range, ADA buyers hold an advantageous position looking at candlestick arrangements in the daily chart. Despite recent lower lows, sellers have not yet reversed the gains of July 13, a conspicuous bar that shapes the immediate price action. Related Reading: HBAR Token Spikes 16% In One Day, Can Bulls Sustain the Momentum? Cardano is in the Basho era, where developers look at enhancing scalability and network performance to support intensive decentralized applications (dapps), particularly those in decentralized finance (DeFi). Notable improvements in this phase include pipelining and the release of Mithril, aimed at bolstering network security. Additionally, Cardano&#8217;s leading developer IOG is working on Hydra, a layer-2 solution to boost scalability further using off-chain channels.  Feature image from Canva, chart from TradingView"
  }
]