[
  {
    "source": "Cointelegraph",
    "date": "2023-09-17T20:50:00.000Z",
    "title": "3 steps crypto investors can take to avoid hacks by the Lazarus Group",
    "url": "https://cointelegraph.com/news/lazarus-group-safeguard-cryptocurrency-steps",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/7ba9f757-7046-4904-a84b-5cab1a6cd282.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Lazarus Group has mastered the art of stealing crypto investors’ assets. Here are a few tips on how investors can protect their portfolios.</p>\n                    <p><p>Cryptocurrency users frequently fall prey to online hacks with Mark Cuban being just <a href=\"https://cointelegraph.com/news/mark-cuban-hot-wallet-hacked\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/mark-cuban-hot-wallet-hacked/amp\">the latest high-profile example</a> how nearly a million dollars can leave your digital wallet. </p><p>It is possible to substantially bolster the security of your funds by heeding three simple guidelines that will be outlined in this article. But before delving into these, it's crucial to understand the type of threat that exists today. </p><h2>FBI has clear evidence on the Lazarus Group</h2><p>The Lazarus Group is a North Korean state-sponsored hacking group, known for their sophisticated attacks linked to various cyberattacks and cybercriminal activities, including the <a href=\"https://cointelegraph.com/news/us-charges-three-north-korean-hackers-over-crypto-attacks-and-wannacry-ransomware\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-charges-three-north-korean-hackers-over-crypto-attacks-and-wannacry-ransomware/amp\">WannaCry ransomware attack</a>.</p><p>WannaCry disrupted critical services in numerous organizations, including healthcare institutions and government agencies by encrypting files on infected computers and demanding a ransom payment in Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>).</p><p>One of its earliest crypto-related hacks was the <a href=\"https://cointelegraph.com/news/korean-bitcoin-exchange-yapizon-confirms-5-mln-hack-all-customers-to-pay-with-balances\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/korean-bitcoin-exchange-yapizon-confirms-5-mln-hack-all-customers-to-pay-with-balances/amp\">breach of South Korean crypto exchange Yapizon</a> (later rebranded to Youbit) in April 2017, resulting in the theft of 3,831 Bitcoin, worth over $4.5 million at the time.</p><p>The Lazarus Group's activities in the cryptocurrency space have raised concerns about its ability to generate funds for the North Korean regime and evade international sanctions. For instance, in 2022 the group was tied to a number of high-profile cryptocurrency hacks, including the <a href=\"https://cointelegraph.com/news/norwegian-police-recover-5-9m-stolen-from-axie-infinity-ronin-hack\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/norwegian-police-recover-5-9m-stolen-from-axie-infinity-ronin-hack/amp\">theft of $620 million from Axie Infinity bridge</a> Ronin. </p><p>The Federal Bureau of Investigation (FBI) blamed Lazarus Group for the Alphapo, CoinsPaid and Atomic Wallet hacks, stating that losses from all of these hacks add up to over $200 million the group has stolen in 2023.</p><p>This month, the FBI <a href=\"https://cointelegraph.com/news/stake-hack-of-41m-was-performed-by-north-korean-group-fbi\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/stake-hack-of-41m-was-performed-by-north-korean-group-fbi/amp\">have attributed</a> Lazarus Group to a $41 million hack of the crypto gambling site Stake, which was carried out through a spear-phishing campaign that targeted some of its employees. </p><p>Lastly, according to blockchain security firm SlowMist, the <a href=\"https://cointelegraph.com/news/coinex-north-korea-s-lazarus-group-responsible-for-55-m-coin-ex-hack-report\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/coinex-north-korea-s-lazarus-group-responsible-for-55-m-coin-ex-hack-report/amp\">$55 million hack of the crypto exchange CoinEx</a> was carried out by the North Korean state sponsored hackers.</p><h2>Most hacks involve social engineering and exploit human error</h2><p>Contrary to what movies usually display, meaning hackers either gaining physical access to devices or brute forcing passwords, most hacks occur <a href=\"https://cointelegraph.com/learn/what-is-a-phishing-attack-in-crypto-and-how-to-prevent-it\">through phishing</a> and social engineering. The attacker relies on human curiosity or greed to entice the victim.</p><p>Those hackers may pose as customer support representatives or other trusted figures in order to trick victims into giving up their personal information. </p><p>For instance, a hacker might impersonate a company's IT support and call an employee, claiming they need to verify their login credentials for a system update. To build trust, the attacker might use public information about the company and the target's role.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/north-korean-crypto-hacks-down-but-could-change-overnight-chainalysis\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/north-korean-crypto-hacks-down-but-could-change-overnight-chainalysis/amp\">North Korean crypto hacks down 80%, but that could change overnight: Chainalysis</a></em></strong></p><p>Phishing attacks involve sending deceptive emails or messages to trick recipients into taking malicious actions. An attacker might impersonate a reputable organization, such as a bank, and send an email to a user, asking them to click on a link to verify their account. The link takes them to a fraudulent website where their login credentials are stolen.</p><p>Baiting attacks offer something enticing to the victim, such as free software or a job opportunity. An attacker poses as a recruiter and creates a convincing job posting on a reputable job search website. To further establish trust, they may even conduct a fake video interview, and later inform the candidate that they have been selected. The hackers proceed by sending a seemingly innocuous file, like a PDF or a Word document, which contains malware.</p><h2>How crypto investors can avoid hacks and exploits</h2><p>Luckily, despite the increasing sophistication and capabilities of hackers today, there are three simple steps you can take to keep your funds safe. Namely: </p><ul><li>Use <a href=\"https://cointelegraph.com/news/how-to-use-a-crypto-hardware-wallet\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/how-to-use-a-crypto-hardware-wallet/amp\">hardware wallets</a> for long-term storage of your crypto assets, not directly connected to the internet, making them highly secure against online threats like phishing attacks or malware. They provide an extra layer of protection by keeping your private keys offline and away from potential hackers.</li></ul><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/ea30de53-68de-4945-9b54-58bd316eb23f.jpeg\"><figcaption style=\"text-align: center;\"><em>Common crypto hardware wallets. Source: Enjin</em></figcaption></figure><ul><li>Enable <a href=\"https://cointelegraph.com/news/the-rising-wave-of-crypto-two-factor-authentication\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/the-rising-wave-of-crypto-two-factor-authentication/amp\">Two-Factor Authentication</a>, or 2FA, on all your crypto exchange and wallet accounts. This adds an extra security step by requiring you to provide a one-time code generated by an app like Google Authenticator or Authy. Even if an attacker manages to steal your password, they won't be able to access your accounts.</li><li>Be extremely cautious when clicking on links on emails and social media. Scammers often use enticing <a href=\"https://cointelegraph.com/news/scientists-used-ai-to-find-and-track-95k-cryptocurrency-free-giveaway-scams-on-twitter-x\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/scientists-used-ai-to-find-and-track-95k-cryptocurrency-free-giveaway-scams-on-twitter-x/amp\">offers or giveaways</a> to lure victims. Use separate \"burner\" accounts or wallets for experimenting with new decentralized applications and for airdrops to reduce the risk of losing your funds. </li></ul><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n</p>\n                \n            "
  }
]