[
  {
    "source": "CoinDesk",
    "date": "2024-01-09T13:04:40.000Z",
    "title": "U.S. Arrests 'Bitcoin Rodney,' Alleged HyperVerse Crypto Scheme Promoter, on IRS Charges of Fraud",
    "url": "https://www.coindesk.com/policy/2024/01/09/us-arrests-bitcoin-rodney-alleged-hyperverse-crypto-scheme-promoter-on-irs-charges-of-fraud/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Rodney Burton was arrested on Friday in Florida and will be transferred to Maryland."
  },
  {
    "source": "CoinDesk",
    "date": "2024-01-09T13:24:42.000Z",
    "title": "Protocol Village: ZkLink, Multi-Chain Rollup Platform, Releases 2024 Roadmap, Plans $ZKL Token",
    "url": "https://www.coindesk.com/tech/2024/01/04/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Jan. 4-10."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-09T13:26:11.000Z",
    "title": " Bitcoin price briefly slips below $46K on Binance amid BlackRock’s new S-1 ",
    "url": "https://cointelegraph.com/news/bitcoin-briefly-drops-46000-blackrock-s1",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNzkzM2M1YWYtMWQ0ZC00MTJjLWE4NWQtZTk5YWRkMDVlZWIyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>BTC's price dropped 3% in a matter of minutes as Eric Balchunas tweeted news of the refiling before quickly recovering to almost pare the loss.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price is facing some turbulence amid asset managers filing last-minute S-1 updates for their spot Bitcoin exchange-traded funds (ETF).</p><p>On Jan. 9, Bitcoin briefly slipped 3% on Binance, with BTC price tumbling from $47,000 to $45,600 in five minutes, <a href=\"https://www.tradingview.com/symbols/BTCUSDT/\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to data from TradingView. Bitcoin price has quickly bounced back to near $47,000, trading at $46,717 at the time of writing.</p><p>The spike of volatility came amid asset managers like BlackRock and VanEck filing more S-1 updates just a day before the expected spot Bitcoin ETF approval date on Jan. 10.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-briefly-drops-46000-blackrock-s1\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-09T12:45:16.000Z",
    "title": " New York Times lawsuit faces pushback from OpenAI over ethical AI practices ",
    "url": "https://cointelegraph.com/news/openai-responds-to-nyt-lawsuit-ethical-ai-practices",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOGUxMjkwYTktMDQyOC00OTk0LWEyYjEtNmE0Y2MxOTViZWZhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>OpenAI said it views the NYT lawsuit as being “without merit” and listed its media partnerships and opt-out options for publishers, dismissing claims of misuse of information as “not typical or allowed.”</p>\n                    <p><p data-ct-non-breakable=\"true\">In a blog <a href=\"https://openai.com/blog/openai-and-journalism\" target=\"_blank\" rel=\"noopener nofollow\">post</a> on Jan. 8, OpenAI addressed a lawsuit brought against it by The New York Times (NYT), saying it is “without merit” and listed its collaborative efforts with various news organizations. </p><p>According to the blog post, OpenAI was in discussions with the NYT that appeared to be “progressing constructively.”</p><p data-ct-non-breakable=\"true\">The NYT <a href=\"https://cointelegraph.com/news/nyt-ai-case-vs-openai-microsoft-could-be-watershed-moment-community-responds\">lawsuit against OpenAI and Microsoft</a> alleges the unauthorized use of its content for training artificial intelligence (AI) chatbots. OpenAI’s rebuttal disagrees with the NYT claims and says it views this as a moment to “clarify our business, intent and how we build out the technology.”</p><p><a href=\"https://cointelegraph.com/news/openai-responds-to-nyt-lawsuit-ethical-ai-practices\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-09T13:14:26.000Z",
    "title": "Mash revolutionizes online giveaways with Bitcoin rewards via Lightning Network",
    "url": "https://cryptoslate.com/mash-revolutionizes-online-giveaways-with-bitcoin-rewards-via-lightning-network/",
    "description": "<p>Mash, the Lightning wallet-powered online platform for monetizing media, has introduced a Rewards Page, enabling publishers and creators to conduct Bitcoin giveaways via marketing initiatives. The platform revealed that its partners, including CryptoSlate, publishing firm TFTC, The Cymes, Nic Carter, and Lord Miles on X (formerly Twitter), have simultaneously launched giveaway campaigns for their users. [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/mash-revolutionizes-online-giveaways-with-bitcoin-rewards-via-lightning-network/\">Mash revolutionizes online giveaways with Bitcoin rewards via Lightning Network</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-09T13:35:17.000Z",
    "title": "Bitcoin at Crossroads: How ETF Approval Could Skyrocket BTC to Record Heights",
    "url": "https://cryptodaily.co.uk/2024/01/bitcoin-at-crossroads-how-etf-approval-could-skyrocket-btc-to-record-heights",
    "description": "Explore how the potential approval of Bitcoin ETFs could revolutionize the cryptocurrency market, pushing BTC towards record heights. Dive into our comprehensive analysis of Bitcoin's current market stance, bolstered by strong technical indicators, growing institutional interest, and the bullish trend in BTC mining stocks. Understand the implications of ETFs for mainstream investors and navigate the promising yet challenging path ahead for Bitcoin."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-09T13:32:25.000Z",
    "title": "How To Boost The Success of Your Crypto PR Campaign",
    "url": "https://cryptodaily.co.uk/2024/01/how-to-boost-the-success-of-your-crypto-pr-campaign",
    "description": "After a long crypto winter, the blockchain industry is finally starting to thaw. With massive movements in leading cryptocurrencies and new Web 3 products launching in 2024, the general public is once again turning toward the world of crypto."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-09T13:29:24.000Z",
    "title": "The whale wallet that was one of the first few to buy Shiba Inu (SHIB) has entered the Retik Finance (RETIK) Presale in Presale stage 4",
    "url": "https://cryptodaily.co.uk/2024/01/the-whale-wallet-that-was-one-of-the-first-few-to-buy-shiba-inu-shib-has-entered-the-retik-finance-retik-presale-in-presale-stage-4",
    "description": "In the unpredictable world of cryptocurrencies, few stories capture the imagination quite like that of the whale investor."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-09T13:23:36.000Z",
    "title": "Revolutionizing Digital Marketing: Payvertise Leads with NFTs and $PVT Token for Transparent, Engaging Ad Spaces",
    "url": "https://cryptodaily.co.uk/2024/01/revolutionizing-digital-marketing-payvertise-leads-with-nfts-and-pvt-token-for-transparent-engaging-ad-spaces",
    "description": "Revolutionizing Digital Marketing: Payvertise Leads with NFTs and $PVT Token for Transparent, Engaging Ad Spaces"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T13:24:44.000Z",
    "title": "Revolutionizing Digital Marketing: Payvertise Leads with NFTs and $PVT Token for Transparent, Engaging Ad Spaces",
    "url": "https://www.cryptopolitan.com/revolutionizing-digital-marketing-payvertise-leads-with-nfts-and-pvt-token-for-transparent-engaging-ad-spaces/",
    "description": "Granite city, United States, January 9th, 2024, Chainwire In the fast-paced world of digital marketing, the integration of Non-Fungible Tokens (NFTs) marks a significant turning point. Leading this innovative wave is Payvertise with its $PVT token, ushering in a new era where transparency and engagement are not just goals, but realities. This movement isn&#8217;t just [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T13:24:24.000Z",
    "title": "AI Companionship: A Cure for Loneliness or Ethical Challenge?",
    "url": "https://www.cryptopolitan.com/ai-companionship-a-cure-for-loneliness/",
    "description": "In an increasingly digital world, the dynamics of human interaction have evolved significantly. The advent of the internet and technological advancements have reshaped our lives, including how we connect with others. Loneliness, once a private struggle, has become a global public health concern affecting millions of people. With the rise of conversational artificial intelligence (AI) [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T13:12:19.000Z",
    "title": "Video Games Lose Top Spot in UK Entertainment",
    "url": "https://www.cryptopolitan.com/video-games-lose-top-spot-in-uk/",
    "description": "In a surprising turn of events, video games have lost their decade-long reign as the UK&#8217;s primary entertainment medium, according to the Entertainment Retailers Association (ERA).&#160; The ERA, a trade body representing video, music, and games retailers, has reported that for the first time in over ten years, video games have been eclipsed by the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T13:10:52.000Z",
    "title": "Mintel Launches Groundbreaking Market Intelligence AI, Mintel Leap",
    "url": "https://www.cryptopolitan.com/mintel-launches-market-intelligence-leap/",
    "description": "Mintel, renowned for its expertise in understanding consumer preferences, has unveiled Mintel Leap, an innovative Market Intelligence AI designed to revolutionize the way businesses conduct research. Mintel Leap, built exclusively on Mintel&#8217;s proprietary research and analyst expertise, offers real-time answers to complex strategic questions, providing invaluable insights for businesses seeking to shape their innovation and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T13:08:32.000Z",
    "title": "Top Crypto To Buy Today With Big Investment Potential",
    "url": "https://www.cryptopolitan.com/top-crypto-to-buy-today-with-big-investment-potential/",
    "description": "In 2024, the cryptocurrency market is undergoing significant changes. Despite expectations, Bitcoin didn&#8217;t break the $100,000 barrier last year, but still experienced growth from $16,000 to $44,000 in 2023, even amid SEC investigations and stricter regulations. Key factors influencing the market include the potential approval of a spot BTC-ETF and the anticipated Bitcoin halving in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T12:58:09.000Z",
    "title": "Exciting Game Pass Additions for Xbox Players in January 2024",
    "url": "https://www.cryptopolitan.com/game-pass-additions-for-xbox-players/",
    "description": "Xbox players with Game Pass subscriptions have much to look forward to in 2024 as the service kicks off with some remarkable additions. Two massive games, Assassin&#8217;s Creed Valhalla and Figment, have recently landed on Game Pass, offering players an exciting start to the year. Assassin&#8217;s Creed Valhalla is the first major addition to Game [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T12:54:50.000Z",
    "title": "Jay Clayton says spot Bitcoin ETF approval is coming",
    "url": "https://www.cryptopolitan.com/jay-clayton-bitcoin-etf-approval-is-coming/",
    "description": "The crypto world is abuzz with anticipation as former SEC Chair Jay Clayton makes a bold prediction: the approval of the first spot Bitcoin ETF in the United States could be announced as soon as tomorrow. Clayton&#8217;s recent appearance on CNBC&#8217;s &#8220;Squawk Box&#8221; has sent ripples across financial markets, sparking renewed interest and speculation in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T12:52:08.000Z",
    "title": "Why Nvidia Could Lose Big in China",
    "url": "https://www.cryptopolitan.com/why-nvidia-could-lose-big-in-china/",
    "description": "Leading US chip maker, Nvidia appears to be in a tricky spot with the US regulations and could suffer a significant blow to its business in China.&#160; The company is currently facing restrictions on the export of its most advanced AI chips to China due to US regulations. The ban applies to Nvidia&#8217;s top-of-the-line chips, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T12:47:13.000Z",
    "title": "Bitcoin surges back to $46,000 amidst spot ETF frenzy",
    "url": "https://www.cryptopolitan.com/bitcoin-surges-back-to-46000/",
    "description": "Bitcoin&#8217;s value has surged back to a remarkable $46,000, energized by a flurry of activity around spot exchange-traded funds (ETFs). BlackRock Inc., Ark, and several other potential ETF issuers have filed amended forms, sparking widespread anticipation and driving up Bitcoin&#8217;s price. This resurgence comes after a period of notable growth last year, where the pioneering [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T12:45:18.000Z",
    "title": "Tech Innovations for Dogs: Improving Canine Lives in 2024",
    "url": "https://www.cryptopolitan.com/tech-innovations-for-dogs-canine-lives/",
    "description": "Amid the challenges faced by dogs and their owners in 2023 due to the return-to-office policies and increased shelter intakes, 2024 brings hope for our furry companions with the advent of innovative AI-powered technologies designed to enhance their quality of life. In this article, we will explore some of these groundbreaking innovations that aim to [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-09T12:50:29.000Z",
    "title": "SOLANA PRICE ANALYSIS & PREDICTION (January 9) – Sol Dips Below $100 Amid Correction, Bigger Drops Ahead? ",
    "url": "https://nulltx.com/solana-price-analysis-prediction-january-9-sol-dips-below-100-amid-correction-bigger-drops-ahead/",
    "description": "After last week&#8217;s crash, which sent most altcoins their new lows, SOL fell below an important mark level and continued to show signs of weakness. It bounced off a low today but is likely to resume selling shortly.  During the late 2023 mini rally, Solana enjoyed a massive volume inflow [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-09T13:20:13.000Z",
    "title": "Fear & Greed Index reaches highest level since November 2021",
    "url": "https://crypto.news/fear-and-greed-index-reaches-highest-level-since-november-2021-record/",
    "description": "The crypto market&#8217;s index of fear and greed has reached its highest level since the end of 2021, indicating greed. According to the latest data from the Alternative.me platform, the Fear and Greed Index in the crypto market has reached&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-09T13:00:44.000Z",
    "title": "Jim Cramer Says Bitcoin Is Topping Off, Time To Buy Bitcoin?",
    "url": "https://www.newsbtc.com/news/bitcoin/jim-cramer-bitcoin-topping-off/",
    "description": "Counter-trading CNBC’s Jim Cramer has gone from being a meme to something that Bitcoin investors have begun to take seriously. As the inverse of what Cramer says has usually been the case, taking a stand in the opposite direction has proved positive for some investors. Once more, Cramer has shared his thoughts on where the BTC price is headed, so is it time to buy or sell? Jim Cramer Calls The Bitcoin Top In a new episode, the Mad Money host, a show hosted on the CNBC Network, called out a possible top for Bitcoin. Now, the price of BTC has been steadily rising this week, which saw the price eventually rise above $47,000 for the first time in almost two years. Related Reading: Rocket Carrying Physical Dogecoin To The Moon Takes Off, But Why Is Price Struggling? Following this brief surge, Cramer took to the show to reveal that he thinks the price of the asset has reached a possible top. However, instead of the usual one-sided argument, Cramer would go on to tell investors to buy BTC if they want. So while the former hedge fund manager did call for Bitcoin to top out, he is not advising investors to not buy the cryptocurrency. “Let’s stop fooling around,” Cramer states. “You want Bitcoin, buy Bitcoin. I think Bitcoin is topping out, by the way. So I’m going to say enough is enough.” This statement tends to play on both sides of the coin for now, no longer discouraging investors from buying the asset. BTC shows strength ahead of SEC decision &#124; Source: BTCUSD on Tradingview.com BTC Goes The Opposite Way Of Cramer Going through the path of counter-trading Jim Cramer would actually see investors buying Bitcoin at this time. If the same inverse correlation holds, then the Bitcoin price could be rocketing up from here once more. Related Reading: Forbes Says Spot Bitcoin ETF Approval Will Send BTC Price To $80,000 This school of thought did not just emerge out of nowhere as even as recently as last week, the act of counter-trading Cramer seems to remain a profitable venture. Last week, Cramer had taken to his Mad Money show to praise Bitcoin after being previously bearish. Cramer explained that Bitcoin cannot be killed, saying BTC was “here to stay” and the likes of Charlie Munger were blind to it. However, in true Cramer fashion, the price of Bitcoin would tank not long after, crashing from above $45,000 to below $42,000 on January 3. This is also not limited to crypto as there was an ETF dedicated to investing in the opposite direction of Cramer’s stock picks, although that ETF was closed in 2023. Nevertheless, as news of Cramer’s new stance hits the headlines, it’ll be interesting to see where the BTC price goes from here. If it follows previous trends, then the BTC price could be headed toward a price crash once again. Featured image from Siam Blockchain, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-09T13:00:19.000Z",
    "title": "Steering Through Avalanche’s Decline: Is Rebel Satoshi the Answer to Maintaining Portfolio Equilibrium?",
    "url": "https://www.crypto-news-flash.com/steering-through-avalanches-decline-is-rebel-satoshi-the-answer-to-maintaining-portfolio-equilibrium/?utm_source=rss&utm_medium=rss&utm_campaign=steering-through-avalanches-decline-is-rebel-satoshi-the-answer-to-maintaining-portfolio-equilibrium",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-59-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-59-1.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-59-1-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-59-1-150x94.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-59-1-450x281.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Avalanche (AVAX) is predicted to drop further and go below $40 shortly.  Rebel Satoshi ($RBLZ) to rise to $0.025 before token launch in February.  One of the top altcoins, Avalanche (AVAX), has been dipping despite the market growing exponentially recently. As a result, its investors are looking for the best crypto to invest in to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-09T12:41:08.000Z",
    "title": "Binance’s Asset Assurance: 100% Backing for 597,658.074 Bitcoins (BTC), 4,265,238.882 Ethereum (ETH), and All Coins",
    "url": "https://www.crypto-news-flash.com/binances-asset-assurance-100-backing-for-597658-074-bitcoins-btc-4265238-882-ethereum-eth-and-all-coins/?utm_source=rss&utm_medium=rss&utm_campaign=binances-asset-assurance-100-backing-for-597658-074-bitcoins-btc-4265238-882-ethereum-eth-and-all-coins",
    "description": "<img width=\"1920\" height=\"1277\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Binance has released its 12th audit of reserves held on the exchange which proves all its digital assets are 100% backed. These audits were introduced by former CEO Changpeng Zhao who recently stepped down and is facing sentencing in the U.S. Binance, the world&#8217;s largest cryptocurrency exchange by trading volume has released its 12th audit [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-09T12:54:35.000Z",
    "title": "Crypto Trends for 2024 — Part 3",
    "url": "https://www.altcoinbuzz.io/spotlight/messari-report-crypto-trends-for-2024-part-3/",
    "description": "<p>This is Part — 3 of our 4 part series on Crypto Trends for 2024. We look into trends that should headline this year. The articles are loosely based on this Messari Report. We dive straight into this new Crypto Trends chapter for 2024. #17 Ethereum remains all-in on its rollup centric view of the [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/spotlight/messari-report-crypto-trends-for-2024-part-3/\">Crypto Trends for 2024 — Part 3</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-09T13:21:16.000Z",
    "title": "Arthur Hayes Voices Confidence in Solana Amid Market Volatility",
    "url": "https://coinedition.com/arthur-hayes-voices-confidence-in-solana-amid-market-volatility/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/01/Arthur_Hayes_Voices_Confidence_in_Solana_Amid_Market_Volatility.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/01/Arthur_Hayes_Voices_Confidence_in_Solana_Amid_Market_Volatility.jpg 730w, https://coinedition.com/wp-content/uploads/2024/01/Arthur_Hayes_Voices_Confidence_in_Solana_Amid_Market_Volatility-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/01/Arthur_Hayes_Voices_Confidence_in_Solana_Amid_Market_Volatility-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/01/Arthur_Hayes_Voices_Confidence_in_Solana_Amid_Market_Volatility-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/01/Arthur_Hayes_Voices_Confidence_in_Solana_Amid_Market_Volatility-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/01/Arthur_Hayes_Voices_Confidence_in_Solana_Amid_Market_Volatility-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/01/Arthur_Hayes_Voices_Confidence_in_Solana_Amid_Market_Volatility-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/01/Arthur_Hayes_Voices_Confidence_in_Solana_Amid_Market_Volatility-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/01/Arthur_Hayes_Voices_Confidence_in_Solana_Amid_Market_Volatility-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/01/Arthur_Hayes_Voices_Confidence_in_Solana_Amid_Market_Volatility-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/01/Arthur_Hayes_Voices_Confidence_in_Solana_Amid_Market_Volatility-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/01/Arthur_Hayes_Voices_Confidence_in_Solana_Amid_Market_Volatility-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/01/Arthur_Hayes_Voices_Confidence_in_Solana_Amid_Market_Volatility-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/01/Arthur_Hayes_Voices_Confidence_in_Solana_Amid_Market_Volatility-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/01/Arthur_Hayes_Voices_Confidence_in_Solana_Amid_Market_Volatility-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/01/Arthur_Hayes_Voices_Confidence_in_Solana_Amid_Market_Volatility-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The cryptocurrency market is experiencing a significant increase, with significant attention on Solana (SOL). Recently, Solana has distinguished itself among the top 10 coins by market capitalization. Arthur Hayes, co-founder of BitMEX and CIO at MaelstromFund, made news with his positive outlook on Solana&#8217;s future. Arthur Hayes recently took to X to express his bullish [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/arthur-hayes-voices-confidence-in-solana-amid-market-volatility/\">Arthur Hayes Voices Confidence in Solana Amid Market Volatility</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-09T13:00:00.000Z",
    "title": "Honeyland 2.0 Launch: Game-Changing Updates Have Arrived",
    "url": "https://coinedition.com/honeyland-2-0-launch-game-changing-updates-have-arrived/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/01/PR-1-169.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2024/01/PR-1-169.jpg 730w, https://coinedition.com/wp-content/uploads/2024/01/PR-1-169-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/01/PR-1-169-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/01/PR-1-169-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/01/PR-1-169-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/01/PR-1-169-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/01/PR-1-169-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/01/PR-1-169-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/01/PR-1-169-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/01/PR-1-169-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/01/PR-1-169-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/01/PR-1-169-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/01/PR-1-169-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/01/PR-1-169-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/01/PR-1-169-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/01/PR-1-169-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Honeyland, the blockchain-based beekeeping sensation, is thrilled to announce the highly anticipated launch of Honeyland 2.0 this week. This major update brings many exciting features designed to elevate player experience and engagement. Key features of Honeyland 2.0 include: The Honeyland team is dedicated to optimizing player experience and accessibility, solidifying its status as one of [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/honeyland-2-0-launch-game-changing-updates-have-arrived/\">Honeyland 2.0 Launch: Game-Changing Updates Have Arrived</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-09T12:59:29.000Z",
    "title": "Can You Really Play and Earn Big? Polywin Shows You How",
    "url": "https://coinedition.com/can-you-really-play-and-earn-big-polywin-shows-you-how/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/01/Can-You-Really-Play-and-Earn-Big-Polywin-Shows-You-How.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2024/01/Can-You-Really-Play-and-Earn-Big-Polywin-Shows-You-How.jpg 730w, https://coinedition.com/wp-content/uploads/2024/01/Can-You-Really-Play-and-Earn-Big-Polywin-Shows-You-How-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/01/Can-You-Really-Play-and-Earn-Big-Polywin-Shows-You-How-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/01/Can-You-Really-Play-and-Earn-Big-Polywin-Shows-You-How-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/01/Can-You-Really-Play-and-Earn-Big-Polywin-Shows-You-How-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/01/Can-You-Really-Play-and-Earn-Big-Polywin-Shows-You-How-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/01/Can-You-Really-Play-and-Earn-Big-Polywin-Shows-You-How-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/01/Can-You-Really-Play-and-Earn-Big-Polywin-Shows-You-How-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/01/Can-You-Really-Play-and-Earn-Big-Polywin-Shows-You-How-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/01/Can-You-Really-Play-and-Earn-Big-Polywin-Shows-You-How-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/01/Can-You-Really-Play-and-Earn-Big-Polywin-Shows-You-How-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/01/Can-You-Really-Play-and-Earn-Big-Polywin-Shows-You-How-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/01/Can-You-Really-Play-and-Earn-Big-Polywin-Shows-You-How-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/01/Can-You-Really-Play-and-Earn-Big-Polywin-Shows-You-How-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/01/Can-You-Really-Play-and-Earn-Big-Polywin-Shows-You-How-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/01/Can-You-Really-Play-and-Earn-Big-Polywin-Shows-You-How-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Polywin redefines online entertainment, merging the world of crypto trading and the fun of gaming. Built on the Polygon blockchain, this platform grants access to thrilling 45-second rounds where strategic wagers reap substantial rewards. No cumbersome registrations or deposits—Polywin dives straight into action. Users can place their bets within 30 seconds and then brace for [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/can-you-really-play-and-earn-big-polywin-shows-you-how/\">Can You Really Play and Earn Big? Polywin Shows You How</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-09T12:41:23.000Z",
    "title": "NFT Craze Explodes: Collectible Tokens Like ICP, STX, IMX, RNDR, THETA Soar!",
    "url": "https://coinedition.com/nft-craze-explodes-collectible-tokens-like-icp-stx-imx-rndr-theta-soar/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/01/NFT_Craze_Explodes_Collectible_Tokens_Like_ICP_STX_IMX_RNDR.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2024/01/NFT_Craze_Explodes_Collectible_Tokens_Like_ICP_STX_IMX_RNDR.jpg 730w, https://coinedition.com/wp-content/uploads/2024/01/NFT_Craze_Explodes_Collectible_Tokens_Like_ICP_STX_IMX_RNDR-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/01/NFT_Craze_Explodes_Collectible_Tokens_Like_ICP_STX_IMX_RNDR-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/01/NFT_Craze_Explodes_Collectible_Tokens_Like_ICP_STX_IMX_RNDR-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/01/NFT_Craze_Explodes_Collectible_Tokens_Like_ICP_STX_IMX_RNDR-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/01/NFT_Craze_Explodes_Collectible_Tokens_Like_ICP_STX_IMX_RNDR-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/01/NFT_Craze_Explodes_Collectible_Tokens_Like_ICP_STX_IMX_RNDR-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/01/NFT_Craze_Explodes_Collectible_Tokens_Like_ICP_STX_IMX_RNDR-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/01/NFT_Craze_Explodes_Collectible_Tokens_Like_ICP_STX_IMX_RNDR-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/01/NFT_Craze_Explodes_Collectible_Tokens_Like_ICP_STX_IMX_RNDR-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/01/NFT_Craze_Explodes_Collectible_Tokens_Like_ICP_STX_IMX_RNDR-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/01/NFT_Craze_Explodes_Collectible_Tokens_Like_ICP_STX_IMX_RNDR-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/01/NFT_Craze_Explodes_Collectible_Tokens_Like_ICP_STX_IMX_RNDR-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/01/NFT_Craze_Explodes_Collectible_Tokens_Like_ICP_STX_IMX_RNDR-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/01/NFT_Craze_Explodes_Collectible_Tokens_Like_ICP_STX_IMX_RNDR-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/01/NFT_Craze_Explodes_Collectible_Tokens_Like_ICP_STX_IMX_RNDR-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Cryptocurrencies with links to NFT projects are having a field day in the market, according to CoinMarketCap data. But out of all the tokens, Internet Computer (ICP), Stacks (STX), Immutable (IMX), Render (RNDR), and Theta Network (THETA) have had the most gains. At press time, ICP’s price was $13.70. This was after its value increased [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/nft-craze-explodes-collectible-tokens-like-icp-stx-imx-rndr-theta-soar/\">NFT Craze Explodes: Collectible Tokens Like ICP, STX, IMX, RNDR, THETA Soar!</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-09T12:45:29.000Z",
    "title": "Massive ‘Smart Whale’ With Profitable Track Record Withdraws $76,900,000 Worth of Bitcoin (BTC) From Binance",
    "url": "https://dailyhodl.com/2024/01/09/massive-smart-whale-with-profitable-track-record-withdraws-76900000-worth-of-bitcoin-btc-from-binance/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/Massive-Smart-Whale.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/Massive-Smart-Whale.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2024/01/Massive-Smart-Whale.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/Massive-Smart-Whale.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/Massive-Smart-Whale.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/Massive-Smart-Whale.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2024/01/Massive-Smart-Whale.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto whale with a recent track record of raking in big profits from Bitcoin just accumulated tens of millions of dollars worth of BTC, according to on-chain data. Crypto tracker Lookonchain says between August 24th and September 2nd, the unknown whale accumulated 6,000 BTC worth $158.66 million at an average price of $26,444 per [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/09/massive-smart-whale-with-profitable-track-record-withdraws-76900000-worth-of-bitcoin-btc-from-binance/\">Massive ‘Smart Whale’ With Profitable Track Record Withdraws $76,900,000 Worth of Bitcoin (BTC) From Binance</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2024-01-09T13:22:42.000Z",
    "title": "Bitfinex to List Memecoin (MEME), the Ecosystem Token of Memeland by 9GAG",
    "url": "https://blog.bitfinex.com/media-releases/bitfinex-to-list-memecoin-meme-the-ecosystem-token-of-memeland-by-9gag/",
    "description": "<p>ROAD TOWN, British Virgin Islands – January 9, 2024 –&#160;Bitfinex (https://www.bitfinex.com/), a premier digital asset trading platform, is pleased to announce the upcoming listing of Memecoin (MEME). MEME is the native ecosystem token of Memeland, a web3 venture studio by 9GAG, the globally renowned meme...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/media-releases/bitfinex-to-list-memecoin-meme-the-ecosystem-token-of-memeland-by-9gag/\">Bitfinex to List Memecoin (MEME), the Ecosystem Token of Memeland by 9GAG</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]