[
  {
    "source": "Decrypt",
    "date": "2024-03-21T23:49:02.000Z",
    "title": "Notcoin: How to Boost Your Earnings Before the Telegram Game's Airdrop",
    "url": "https://decrypt.co/220160/notcoin-how-to-boost-earnings-telegram-game-airdrop",
    "description": "UPDATED: Are you tapping your way to millions of Notcoin? Here's how to make the most of the game before the token airdrop."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-21T23:45:57.000Z",
    "title": " Bitcoin halving will be a litmus test for inefficient ops: Mining execs ",
    "url": "https://cointelegraph.com/news/bitcoin-halving-will-test-inefficient-crypto-miners-ceos-say",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYTk2NmMzYzYtYTY5NC00YmQwLTgzMDYtNjZiOTc3NWIzZTc4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Major mining firms expect the Bitcoin halving to reduce profitability and cause an increase in network fees, which could challenge the existence of less efficient miners.</p>\n                    <p><p>The Bitcoin halving will likely wreak havoc on small, less efficient Bitcoin miners but should be no issue for wellestablished players, according to industry executives.</p><p>In under a month, Bitcoin miners face the reality of reduced block rewards, which is anticipated to significantly impact profitability and income. Bitcoin mining CEOs tell Cointelegraph that the efficiency and scale of mining operations will be critically important as firms clamber for a share of the reduced rewards. </p><p>Marathon Digital, considered one of the largest mining firms in North America, is among the players that have long been planning for the halving. The firm’s chief growth officer Adam Swick tells Cointelegraph the halving will be a test to reveal the most efficient and well-funded entities.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-halving-will-test-inefficient-crypto-miners-ceos-say\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-21T23:47:42.000Z",
    "title": "Estonia passes legislation to regulate crypto service providers",
    "url": "https://cryptoslate.com/estonia-passes-legislation-aimed-at-regulating-crypto-service-providers/",
    "description": "<p>The government of Estonia has enacted a bill that introduces stringent legal requirements for digital assets service providers, local media reported on March 21. The legislation — approved on March 20 — is part of the country&#8217;s efforts to regulate the crypto industry and enhance its reliability. Regulatory supervision on the horizon Estonia has been [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/estonia-passes-legislation-aimed-at-regulating-crypto-service-providers/\">Estonia passes legislation to regulate crypto service providers</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-22T00:00:18.000Z",
    "title": "Bitcoin Brief Bounce Back Above $67,000: Triggers Nearly $300 Million In Total Liquidations",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-bounces-back-above-67000-triggers/",
    "description": "The crypto market has recently experienced a wave of liquidations, amounting to nearly $300 million, closely following Bitcoin&#8217;s sharp reclaim of the $67,000 mark. This surge in Bitcoin&#8217;s value, a stark reversal from its previous downtrend, caught many traders off guard, especially those who had placed bets on the continuation of the market&#8217;s decline. Related Reading: Bitcoin Might Be Poised For A ‘Double Pump Cycle,’ Reveals Analyst – Here’s Why Over 80,000 Traders Faces Liquidation The data provided by Coinglass sheds light on the magnitude of the liquidations, revealing that approximately 86,047 traders suffered losses exceeding $250 million within a mere 24-hour period. Major exchanges like Binance, OKX, Bybit, and Huobi were the arenas for these significant financial setbacks, with Binance traders bearing the brunt of the liquidations. Particularly, Binance recorded $128.7 million in liquidations, while other major platforms such as OKX, Bybit, and Huobi also experienced significant liquidations, amounting to $99.87 million, $33.18 million, and $17.70 million, respectively. Meanwhile, despite also facing liquidations, the smaller exchanges had a comparatively minor impact. Most affected positions were short trades, reflecting a widespread anticipation of a market downturn that did not materialize as expected. Short positions recorded an estimated 57.55% of the liquidations, equivalent to $164.10 million, from traders betting against the market. On the flip side, long position holders also faced their share of losses, contributing to nearly 40% of the total liquidations, amounting to $121.07 million.  Bitcoin Recovery And Future Prospects The sharp recovery of Bitcoin, momentarily reclaiming highs above $67,000, has reignited interest in its market behavior and future trajectory. Despite a 6.6% dip in its market capitalization over the past week, Bitcoin&#8217;s value saw a notable 6% increase in the last 24 hours, with its market cap presently sitting above $140 billion. This resurgence in trading activity, with daily volumes climbing from below $60 billion to heights above this mark, signifies renewed investor confidence and heightened trading interest. Adding to the discourse, cryptocurrency analyst Willy Woo presents an optimistic outlook for Bitcoin, suggesting the possibility of a &#8220;double pump&#8221; cycle reminiscent of the market patterns observed in 2013. According to Woo, this pattern could herald two significant price surges for Bitcoin in the coming years, with the first peak anticipated by mid-2024 and a subsequent, more substantial rise in 2025. Related Reading: Bitcoin Halving Retrace Spooks Investors: What Is It And Why Does It Matter? While such dual surge scenarios are rare, Woo&#8217;s analysis, based on current market conditions and Bitcoin&#8217;s growth potential, offers a glimpse into the future of the world&#8217;s leading cryptocurrency. At the rate the #Bitcoin Macro Index is pumping, I wouldn&#8217;t be surprised if we get a top by mid-2024, which would hint at a double pump cycle like 2013&#8230; a second top in 2025. pic.twitter.com/i2a0V5ytPv — Willy Woo (@woonomic) March 19, 2024 Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-22T00:00:55.000Z",
    "title": "Goldman Sachs Analyst Says Retail Traders Driving Current Crypto Rally Amid ‘Big Sea Change’: Report",
    "url": "https://dailyhodl.com/2024/03/21/goldman-sachs-analyst-says-retail-traders-driving-current-crypto-rally-amid-big-sea-change-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/03/retail-traders-driving-current.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/03/retail-traders-driving-current.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/03/retail-traders-driving-current.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/03/retail-traders-driving-current.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/03/retail-traders-driving-current.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/03/retail-traders-driving-current.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/03/retail-traders-driving-current.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Retail traders have so far been in the driver&#8217;s seat of the current Bitcoin (BTC) and crypto bull markets, according to a Goldman Sachs executive. Matthew McDermott, the investment banking giant&#8217;s global head of digital assets, says institutions have just started to get in on the action, Reuters reports. Goldman Sachs first launched a crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/21/goldman-sachs-analyst-says-retail-traders-driving-current-crypto-rally-amid-big-sea-change-report/\">Goldman Sachs Analyst Says Retail Traders Driving Current Crypto Rally Amid ‘Big Sea Change’: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]