[
  {
    "source": "Decrypt",
    "date": "2023-07-10T17:58:47.000Z",
    "title": "Vanguard Now Owns $560 Million Worth of Bitcoin Mining Stocks",
    "url": "https://decrypt.co/147950/vanguard-owns-560-million-bitcoin-mining-stocks",
    "description": "The $7.2 trillion asset manager now owns half a billion dollars worth of Riot Blockchain and Marathon Digital shares."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-10T17:41:33.000Z",
    "title": "Grayscale lawyers refer to SEC allowing Volatility Shares' investment vehicle in push for ETF",
    "url": "https://cointelegraph.com/news/grayscale-lawyers-sec-approval-volatility-shares-etf-lawsuit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/d1b91741-3257-4736-8f0e-222471cb1ed7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to Grayscale, the Volatility Shares ETF was an “even riskier\" product than Bitcoin futures ETFs, suggesting the SEC should allow its spot crypto ETF to begin trading.</p>\n                    <p><p>Digital asset manager Grayscale has filed a letter in its lawsuit against the United States Securities and Exchange Commission (SEC) over the rejection of a spot Bitcoin exchange-traded fund (ETF), citing a possible precedent in furtherance of its case.</p><p>In a letter dated July 10, Grayscale’s legal team <a href=\"https://grayscale.com/wp-content/uploads/2023/07/Grayscale-28j-letter-re-2x-BTC-futures-ETF-7.7.23.pdf\" target=\"_blank\" rel=\"noopener nofollow\">notified</a> the U.S. Court of Appeals for the District of Columbia Circuit of the listing of Volatility Shares Trust’s leveraged Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) futures ETF. The crypto investment vehicle started trading on June 27 without interference from the SEC, which to date has not approved any spot crypto ETFs but ones tied to BTC futures. </p><p>According to Grayscale, the Volatility Shares ETF exposes investors to an “even riskier investment product” than BTC futures ETFs, suggesting a possible avenue for the SEC to approve its offering. The asset manager <a href=\"https://cointelegraph.com/news/breaking-grayscale-launches-legal-challenge-to-bitcoin-spot-etf-rejection\">filed a legal challenge</a> against the commission in June 2022 after the SEC denied an application to convert its Grayscale Bitcoin Trust into a spot Bitcoin ETF.</p><p>“The fact that the Commission has allowed a leveraged bitcoin futures ETP to begin trading demonstrates that the Commission continues to arbitrarily treat spot bitcoin ETPs differently than bitcoin futures,” said Grayscale. “The 2x Bitcoin Strategy ETF is therefore exposed to even more risks of the bitcoin markets than Grayscale’s proposed spot bitcoin ETP.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/why-a-bitcoin-etf-approval-would-be-a-big-deal\"><strong><em>Why a Bitcoin ETF approval would be a big deal</em></strong></a></p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today, our attorneys filed a letter with the DC Circuit highlighting the disparity between the SEC’s approval of a leveraged <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcoin</a> futures ETF while continuing to deny approval of spot bitcoin ETFs like <a href=\"https://twitter.com/search?q=%24GBTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$GBTC</a>. Let’s dive deeper. /6 <a href=\"https://t.co/z7WyGBthhT\">pic.twitter.com/z7WyGBthhT</a></p>&mdash; Grayscale (@Grayscale) <a href=\"https://twitter.com/Grayscale/status/1678431528156794880?ref_src=twsrc%5Etfw\">July 10, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The letter added:</p><blockquote>“The only way to eliminate the Commission’s unequal treatment of bitcoin-based ETPs is to allow proposed spot bitcoin ETPs like Grayscale’s to begin trading.”</blockquote><p>Several firms have filed applications for spot crypto ETFs with the SEC including BlackRock — the largest asset management company in the world — and ARK Investment Management. Following a June report in which SEC officials claimed the crypto ETF filings were not “sufficiently clear and comprehensive,” some of the applications were <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-filing-coinbase-surveillance-partner\">refiled to include crypto exchange Coinbase</a> as a surveillance partner. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/sec-calls-etf-filings-inadequate-binance-loses-euro-partner-and-other-news-hodlers-digest-june-25-july-1/\"><strong><em>SEC calls ETF filings inadequate, Binance loses euro partner and other news: Hodler’s Digest, June 25 – July 1</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-10T17:52:22.000Z",
    "title": "SEC’s Approval of Riskier Bitcoin ETF Draws Criticism from Grayscale",
    "url": "https://cryptobriefing.com/sec-draws-criticism-from-grayscale/?utm_source=feed&utm_medium=rss",
    "description": "Digital asset manager Grayscales lawyers have criticized the U.S. Securities and Exchange Commission (SEC) for approving a leveraged Bitcoin-based exchange-traded fund (ETF) at a time when the company is embroiled..."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-10T18:00:56.000Z",
    "title": "Binance US Arbitrage: Social Media Users Say BTC Discount Not Indication of an Opportunity",
    "url": "https://news.bitcoin.com/binance-us-arbitrage-social-media-users-say-btc-discount-not-indication-of-an-opportunity/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1172166757-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Binance US Arbitrage: Social Media Users Say BTC Discount Not Indication of an Opportunity\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1172166757-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1172166757-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1172166757-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1172166757-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1172166757-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1172166757-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1172166757.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />For several days since Binance US announced the resumption of withdrawals, bitcoin (BTC) has changed hands at a discount and was trading at more than $2,500 below the prevailing market price on July 10. The emergence of a discount on crypto assets paired with USD on Binance US has fueled speculation about the affiliate&#x2019;s future [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T18:02:22.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and the platform they need to build blockchain solutions. At this time, we can only make educated guesses ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T18:01:00.000Z",
    "title": "NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?",
    "url": "https://www.cryptopolitan.com/near-price-prediction/",
    "description": "NEAR Price Prediction 2023-2032 Near Protocol (NEAR) is a blockchain platform with significant attention and partnerships within the cryptocurrency industry. Initially established by a small team in San Francisco, NEAR Protocol has rapidly expanded its influence and formed collaborations with industry giants. As a result, it has witnessed a consistent upward trajectory since its inception. ... <a title=\"NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-price-prediction/\" aria-label=\"More on NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T17:57:50.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T17:55:59.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T17:42:50.000Z",
    "title": "Binance announces Arkham token sale on launchpad with subscription-based model",
    "url": "https://www.cryptopolitan.com/binance-announces-arkham-token-sale-on-launchpad-with-subscription-based-model/",
    "description": "Binance has unveiled its 32nd token sale project on the Launchpad platform, featuring the Arkham (ARKM) project. With a total hard cap of $2.5 million, the Arkham token sale on Binance Launchpad will offer users the opportunity to acquire a maximum of 300,000 ARKM tokens, equivalent to $15,000, as the project aims to raise funds ... <a title=\"Binance announces Arkham token sale on launchpad with subscription-based model\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-announces-arkham-token-sale-on-launchpad-with-subscription-based-model/\" aria-label=\"More on Binance announces Arkham token sale on launchpad with subscription-based model\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T17:41:41.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? Today&#8217;s live Aave price is $70.23, with a 24-hour trading volume of $69,071,450. Aave is down 3.46% in the last 24 hours. The current CoinMarketCap ranking is #41, with a live market cap of $1,016,449,672. It has a circulating supply of 14,472,172 AAVE coins and ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-10T17:41:26.000Z",
    "title": "Bitcoin hash rate hits an all-time high of 465 EH/s over the weekend",
    "url": "https://www.cryptopolitan.com/bitcoin-hash-rate-hits-an-all-time-high/",
    "description": "Bitcoin&#8217;s hash rate climbed to an all-time high over the weekend, spiking to 465 EH/s on Saturday from 406 EH/s. Even though the value decreased by 6% to 428 EH/s on Sunday, the hash rate is still at its highest. Meanwhile, there was also a 3-day average rise of more than 18% to 444 EH/s. ... <a title=\"Bitcoin hash rate hits an all-time high of 465 EH/s over the weekend\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-hash-rate-hits-an-all-time-high/\" aria-label=\"More on Bitcoin hash rate hits an all-time high of 465 EH/s over the weekend\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-10T17:54:59.000Z",
    "title": "Looking For Crypto With High Growth Potential? Litecoin (LTC), Monero (XMR), and InQubeta (QUBE) Are Top Investment Prospects",
    "url": "https://nulltx.com/looking-for-crypto-with-high-growth-potential-litecoin-ltc-monero-xmr-and-inqubeta-qube-are-top-investment-prospects/",
    "description": "Amidst the ever-evolving world of cryptocurrencies, three digital assets have emerged as beacons of unparalleled potential. InQubeta (QUBE), Litecoin (LTC), and Monero (XMR) have captured the imagination of investors, offering a new perspective on investment opportunities. These revolutionary tokens have been captivating the market with their unique attributes and top investment prospects. InQubeta is a [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-10T17:52:24.000Z",
    "title": "BLUR versus DigiToads: Why TOADS is Rapidly Being Accumulated by NFT Enthusiasts",
    "url": "https://nulltx.com/blur-versus-digitoads-why-toads-is-rapidly-being-accumulated-by-nft-enthusiasts/",
    "description": "The battle for supremacy in the NFT space has reached a fever pitch, with Blur (BLUR) and DigiToads (TOADS) emerging as the leading contenders. Amidst the fierce competition, the swift and unprecedented accumulation of TOADS has ignited excitement and garnered the attention of collectors, investors, and industry observers. Hence, DigiToads has gained significant prominence in [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-10T18:00:32.000Z",
    "title": "Bitcoin Sharks And Whales Go On $2.15 Billion Buying Spree, Is It Time To Sell?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-sharks-and-whales-go-on-2-15-billion-buying-spree-is-it-time-to-sell/",
    "description": "Bitcoin has seen both highs and lows over the past month as various developments in the space put the digital asset’s price into a pull-and-push trend. However, investors have remained undeterred by the cryptocurrency’s movements and have rather chosen to continue to accumulate. This accumulation trend is more prominent in the shark and whale BTC addresses which have added 71,000 BTC to their holdings. Bitcoin Sharks And Whales Buy $2.15 Billion Worth Of BTC According to the on-chain data aggregator platform Santiment, the Bitcoin sharks and whales have been at one of their most active points over the last month. The data aggregator took to Twitter to share that these shark and whale addresses have bought a significant amount of BTC, amounting to $2.15 billion in less than a month. Related Reading: Analysts Puts Bitcoin At $125,000 By 2024, How Is This Possible? The shark and whale addresses being referred to in this report are addresses that hold between 10-10,000 BTC. This puts the lower band of these holders at $300,000 with the upper band sitting as high as $300 million. This means that these are the addresses that have the means to buy a large number of BTC. Santiment reveals that these shark and whale addresses started accumulating on June 17, and by July 8, they had added a total of 71,000 BTC to their holdings. A look at the Bitcoin price chart over the last month shows that these addresses started accumulating the digital asset at a low price of around $27,000. Then they continued to purchase coins all through to the $30,000-$31,000 range. Sharks and whales buy $2.15 billion worth of BTC &#124; Source: Santiment The biggest spike in their balances during this period looks to have happened around June 26, when the chart shows that BTC was trending at $30,300. In total, their holdings went from just under 12.95 million BTC to 13.02 million BTC in the span of 21 days. Is It Time To Sell? Going by the chart shared by Santiment, it looks like these Bitcoin shark and whale addresses have already made some sell-offs, which could point to there being a cool-off period before they start selling again. There were significant dips in their holdings toward the end of June, as well as on July 7, marking sell-off points. BTC price reclaims $30,300 &#124; Source: BTCUSD on TradingView.com Also, it is important to note that at the prices that these addresses accumulated most of their holdings, they are barely in any profit. So with the BTC price still hovering around $30,000, it sits close to the average at which these addresses are bought at, which is likely around the $29,000 range. So for now, these addresses could likely hold for better prices before selling. Related Reading: BlackRock CEO Larry Fink Says Bitcoin Is Digital Gold, So What’s The Digital Silver? If this is the case, then it is possibly a good time to get into the market as these large holders obviously see it as a good entry point. However, these large addresses can move the market and if there is a mass sell-off from them, then the price of BTC could tank. At the time of writing, BTC is trading at $30,300, which translates to a 0.09% decline in the last 24 hours. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-10T18:09:02.000Z",
    "title": "Unlocking the Future: Top Economic Triggers for Bitcoin and Crypto This Week",
    "url": "https://www.crypto-news-flash.com/unlocking-the-future-top-economic-triggers-for-bitcoin-and-crypto-this-week/?utm_source=rss&utm_medium=rss&utm_campaign=unlocking-the-future-top-economic-triggers-for-bitcoin-and-crypto-this-week",
    "description": "The duo of Bitcoin and Ethereum have continued to lead the broader crypto market. Top economic data from both the US and China can impact market momentum. Some economic and financial metrics have been earmarked for investors to look out for while trading crypto this week. So far Bitcoin (BTC) and Ethereum (ETH) have been [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-10T18:00:25.000Z",
    "title": "Decoding Twin Peaks Digital’s Onboarding Strategy for Top-Tier Crypto Teams",
    "url": "https://www.crypto-news-flash.com/decoding-twin-peaks-digitals-onboarding-strategy-for-top-tier-crypto-teams/?utm_source=rss&utm_medium=rss&utm_campaign=decoding-twin-peaks-digitals-onboarding-strategy-for-top-tier-crypto-teams",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-88.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-88.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-88-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Introduction to Twin Peaks Digital and their Focus on the Crypto Industry Twin Peaks Digital, one of the largest crypto companies globally, is a trailblazing entity in the crypto industry. They have carved a niche for themselves by offering a plethora of services geared towards the crypto market. By focusing on advanced technology, security, and [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-10T18:05:01.000Z",
    "title": "$819,000,000,000 Standard Chartered Doubles Down on Bitcoin With Massive 2024 Price Target",
    "url": "https://dailyhodl.com/2023/07/10/819000000000-standard-chartered-doubles-down-on-bitcoin-with-massive-2024-price-target/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/btc-Remains-Rock-Solid.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/btc-Remains-Rock-Solid.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/btc-Remains-Rock-Solid.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/btc-Remains-Rock-Solid.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/btc-Remains-Rock-Solid.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/btc-Remains-Rock-Solid.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/btc-Remains-Rock-Solid.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>British multinational financial giant Standard Chartered is reportedly predicting a huge Bitcoin (BTC) price for next year, upping its last bullish forecast. According to a new report from Reuters, Standard Chartered, which has $819 billion in assets, is predicting BTC will be worth $120,000 in 2024. Says one of the bank&#8217;s top foreign exchange analysts, Geoff [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/10/819000000000-standard-chartered-doubles-down-on-bitcoin-with-massive-2024-price-target/\">$819,000,000,000 Standard Chartered Doubles Down on Bitcoin With Massive 2024 Price Target</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]