[
  {
    "source": "Cointelegraph",
    "date": "2024-03-17T18:21:41.000Z",
    "title": " Bitcoin price consolidation preps NEAR, APT, RNDR and MKR for more upside ",
    "url": "https://cointelegraph.com/news/bitcoin-price-consolidation-preps-near-apt-rndr-and-mkr-for-more-upside",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMTUyZjBlODUtNzg4OS00ZWZkLWJlODItMTRjMTk3NDAyMDhhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin recovered the $68,000 level, triggering buying in NEAR, APT, RNDR and MKR. </p>\n                    <p><p>It was a wild week for Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), which rose to a new all-time high of $73,777 but then quickly gave back all its gains and dropped near $64,500. As of publication time, Bitcoin is on track to end the week down marginally by about 1% over the previous week’s close.</p><p>Analysts anticipate a shallow correction as they believe <a href=\"https://cointelegraph.com/news/bitcoin-traders-60k-btc-price-support-futures-gap\">lower levels will attract solid buying</a> from the spot Bitcoin exchange-traded fund investors. Thomas Fahrer, CEO of crypto-focused reviews portal Apollo, said on X that the fall is a “Bear Trap.” </p><p>The strength in the rebound will give a better idea of whether the correction is over or not. A weak recovery indicates continued selling pressure from the bears. That increases the possibility of a deeper pullback. On the other hand, a strong bounce will indicate aggressive buying at lower levels and enhance the prospects of the resumption of the uptrend. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-price-consolidation-preps-near-apt-rndr-and-mkr-for-more-upside\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-17T18:14:04.000Z",
    "title": " VC Roundup: AI-blockchain solutions winning investors’ hearts  ",
    "url": "https://cointelegraph.com/news/vc-roundup-ai-blockchain-solutions-winning-investors-hearts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYzJjZTMwMDUtNDY2OC00YzY3LTgzZDgtNDEyMGQ5NDAxNDE0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Utila, Synnax, Sahara, TON Foundation, UXLINK, and TEN are among the startups securing funding in the first half of March.</p>\n                    <p><p>The first quarter of 2024 is drawing to a close with signs of improved sentiment surrounding cryptocurrencies thanks to the launch of Bitcoin exchange-traded funds (ETFs) in January. </p><p>The favorable market dynamics could boost venture capital investment after a long winter. In 2023, venture capital firms in crypto and blockchain raised $5.75 billion across 58 funds, down from 2022’s record year of $37.7 billion across 262 funds,<a href=\"https://www.galaxy.com/insights/research/2024-institutional-crypto-hedge-fund-and-venture-report/\" target=\"_blank\" rel=\"noopener nofollow\"> according</a> to a report from Galaxy Digital. </p><p>The first signs of recovery came in the last quarter of 2023, when venture funding reached $1.9 billion, up 2.5% from the previous quarter — the first time venture capital investments in crypto startups have grown since early 2022.</p><p><a href=\"https://cointelegraph.com/news/vc-roundup-ai-blockchain-solutions-winning-investors-hearts\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-17T18:38:42.000Z",
    "title": "Crypto Market Dynamics: InsanityBets (IBET) Captures Attention Beyond Litecoin (LTC) and Tron (TRX)",
    "url": "https://cryptodaily.co.uk/2024/03/crypto-market-dynamics-insanitybets-ibet-captures-attention-beyond-litecoin-ltc-and-tron-trx",
    "description": "The crypto landscape is witnessing significant shifts, with Litecoin (LTC) and Tron (TRX) experiencing varied fortunes. Despite these fluctuations, the emerging token InsanityBets (IBET) has eclipsed both, fueled by anticipation surrounding its presale."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-17T18:33:14.000Z",
    "title": "Kelexo (KLXO) Presale Sees Surge as Ethereum (ETH) Hits $4K Mark, Attracting Tether (USDT) and Binance Coin (BNB) Investors",
    "url": "https://cryptodaily.co.uk/2024/03/kelexo-klxo-presale-sees-surge-as-ethereum-eth-hits-4k-mark-attracting-tether-usdt-and-binance-coin-bnb-investors",
    "description": "The early months of 2024 have experienced a potential crypto bull market for Ethereum (ETH). This upswing looks like it's going to keep going, spurred by the approaching Bitcoin (BTC) Halving event in April, which has usually generated bull runs."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-17T18:27:20.000Z",
    "title": "Investing in This Cryptocurrency at $0.055 Could Mirror the Early Gains of Solana (SOL) When It Was Just $10",
    "url": "https://cryptodaily.co.uk/2024/03/investing-in-this-cryptocurrency-at-0055-could-mirror-the-early-gains-of-solana-sol-when-it-was-just-10",
    "description": "Discover the potential growth of investing in a new cryptocurrency priced at $0.055 which can possibly imitate the early gains of Solana (SOL) when it was worth just $10. Learn the similarity and risks involved in the investment journey."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-17T18:22:54.000Z",
    "title": "Expert Ben Armstrong Closes on Xrp (Xrp) Trade, What This Means for Ethereum (Eth) Based Meme Coins $KANG",
    "url": "https://cryptodaily.co.uk/2024/03/expert-ben-armstrong-closes-on-xrp-xrp-trade-what-this-means-for-ethereum-eth-based-meme-coins-kang",
    "description": "Even with its battle with the Securities and Exchange Commission (SEC), crypto analysts such as Ben Amstrong are heavily bullish on XRP (XRP) tokens."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-17T18:16:15.000Z",
    "title": "Tether (USDT) and Ethereum Classic (ETC) Holders Eye Kelexo (KLXO) Presale Amidst Bitcoin (BTC) ATH Surge",
    "url": "https://cryptodaily.co.uk/2024/03/tether-usdt-and-ethereum-classic-etc-holders-eye-kelexo-klxo-presale-amidst-bitcoin-btc-ath-surge",
    "description": "Cryptocurrency prices are growing at a phenomenal rate in the first quarter of 2024. Propelled by a range of causes, Bitcoin (BTC)"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-17T18:30:02.000Z",
    "title": "Solana surpasses Ethereum L2 solutions, SOL co-founder reacts",
    "url": "https://crypto.news/solana-surpasses-ethereum-l2s-elon-musk-sol-reacts/",
    "description": "Solana has outperformed Ethereum and other EVM-based Layer-2 solutions in terms of 24-hour transaction volume, reaching a total of $3.654 billion against Ethereum's $2.397 billion."
  }
]