[
  {
    "source": "CoinDesk",
    "date": "2023-12-28T09:42:32.000Z",
    "title": "Indonesian Crypto Exchanges Must Register With New Bourse or Face Shutdown",
    "url": "https://www.coindesk.com/policy/2023/12/28/indonesian-crypto-exchanges-must-register-with-new-bourse-or-face-shutdown/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The government wants to use the crypto bourse to make the ecosystem safer and gather transaction data for tax purposes."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T10:05:08.000Z",
    "title": "Crypto community backs Congressman Davidson’s call for SEC leadership change in 2024",
    "url": "https://www.cryptopolitan.com/crypto-community-backs-congressman/",
    "description": "In a year marked by global acceptance and adoption of cryptocurrencies, the United States Securities and Exchange Commission (SEC) has come under increasing scrutiny and criticism from the crypto industry.&#160; The focal point of this criticism is Gary Gensler, who assumed the role of SEC Chair in April 2021, and his aggressive stance on enforcement [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T10:02:20.000Z",
    "title": "Navigating the Digital Landscape: Balancing Risk and Opportunity in 2023",
    "url": "https://www.cryptopolitan.com/digital-balancing-risk-and-opportunity/",
    "description": "In the rapidly evolving digital age, businesses are facing a dual challenge: managing the rising cyber and digital technology risks while capitalizing on the potential of Generative AI (GenAI). PwC&#8217;s 2023 Global Risk Survey, involving over 3,900 business and risk leaders, sheds light on this dynamic landscape, revealing that while 60% see GenAI as a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T09:54:44.000Z",
    "title": "Worldcoin’s  identity verification services now in Singapore amid India pause",
    "url": "https://www.cryptopolitan.com/worldcoins-in-singapore-amid-india-pause/",
    "description": "Worldcoin, the global identity verification project, has announced the launch of its iris-scanning verification services for residents of Singapore. This expansion comes following a temporary pause in operations for India, where privacy concerns led to a halt in scans.&#160; With a mission to provide secure and convenient identity verification, Worldcoin has gained over five million [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T09:51:31.000Z",
    "title": "Japan and USA Collaborate on AI Research for Unmanned Aircraft",
    "url": "https://www.cryptopolitan.com/japan-and-usa-collaborate-on-ai-research/",
    "description": "Japan and the United States have formalized a research partnership to explore the applications of artificial intelligence (AI) in unmanned air vehicles (UAVs). The collaboration aims to investigate the integration of AI technologies into UAVs that will operate alongside the next generation of fighter aircraft. This joint endeavor is a significant step towards advancing the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T09:47:54.000Z",
    "title": "Telcoin Announces Resolution of Security Incident and Plans for Service Restoration",
    "url": "https://www.cryptopolitan.com/telcoin-security-incident-plans-restoration/",
    "description": "Telcoin, a key player in the digital finance sector, has successfully navigated through a significant security challenge, showcasing its resilience and commitment to user security. The company has recently announced the successful resolution of a security incident, marking a pivotal moment in its journey. Telcoin is now focused on restoring wallets to their pre-incident state [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-28T10:08:30.000Z",
    "title": "GBA Capital Fund commits over $10b to web3 industry",
    "url": "https://crypto.news/gba-capital-fund-commits-over-10b-to-web3-industry/",
    "description": "GBA Capital Fund announced at a digital economic development conference its plan to invest over $10 billion in the web3 industry, focusing on the Metaverse, NFTs, and real-world assets. The latest move by GBA Capital Fund comes at a time&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-28T10:07:10.000Z",
    "title": "BREAKING: Cathie Wood’s Ark Invest Sells Entire Grayscale Bitcoin Trust (GBTC) Holdings to Purchase BTC Futures ETF – Is a $30,000 Correction on the Horizon?",
    "url": "https://www.crypto-news-flash.com/breaking-cathie-woods-ark-invest-sells-entire-grayscale-bitcoin-trust-gbtc-holdings-to-purchase-btc-futures-etf-is-a-30000-correction-on-the-horizon/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-cathie-woods-ark-invest-sells-entire-grayscale-bitcoin-trust-gbtc-holdings-to-purchase-btc-futures-etf-is-a-30000-correction-on-the-horizon",
    "description": "<img width=\"640\" height=\"424\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/bitcoin-3741065_640.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/bitcoin-3741065_640.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/bitcoin-3741065_640-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/bitcoin-3741065_640-104x69.jpg 104w\" sizes=\"(max-width: 640px) 100vw, 640px\" />Ark Invest divests completely from Grayscale Bitcoin Trust (GBTC) in its ARKW portfolio, opting for a shift towards Bitcoin futures through ProShares&#8217; Bitcoin Strategy ETF ($BITO). Ark Invest, as part of its portfolio rebalancing, sold 148,885 shares of Coinbase and reinvested around $92 million in ProShares Bitcoin Strategy ETF ($BITO). In a significant development in [...]"
  }
]