[
  {
    "source": "Cointelegraph",
    "date": "2023-07-02T06:44:23.000Z",
    "title": "Vitalik Buterin declares he is not staking all of his ETH, merely a 'small portion’",
    "url": "https://cointelegraph.com/news/vitalik-buterin-declares-not-staking-all-eth-a-small-portion",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/0b66ffb1-c20b-498e-a4dd-3480da5dab61.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ethereum co-founder Vitalik Buterin explained the “biggest reason” is because it has to be on a multisig – which are still “fairly difficult” to set up.</p>\n                    <p><p>Ethereum co-founder Vitalik Buterin stated that he does not stake all of his Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) due to multisignature (multisig) wallets being “complicated in a bunch of ways.”</p><p>On the 29 June <a href=\"https://www.youtube.com/watch?v=aP9f_1v9Ulc\" target=\"_blank\" rel=\"noopener nofollow\">episode</a> of the Bankless Podcast, titled <em>Restaking Alignment,</em> Buterin revealed the “biggest reason” why he is only staking a small fraction of his Ethereum, as opposed to staking the entirety of it. He explained:</p><blockquote>“Because if you stake your ETH, the keys that access it have to be public on a subsystem that is online. For safety, it has to be a Multisig, Multisig for staking is still fairly difficult to set up, it gets complicated in a bunch of ways.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/385252ef-5cfa-4228-adf1-26d8e42fb8db.png\"  /><figcaption style=\"text-align: center;\"><em>Vitalik Buterin speaking on the Bankless Podcast on June 29. Source: Bankless Podcast</em></figcaption></figure><p>Charles Hoskinson, the co-founder of Ethereum and founder of Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) took to Twitter on June 30 stating he is “at a loss for words” after hearing Buterin only stakes a small portion of his Ether.</p><p>Hoskinson added that “all” of his Cardano is staked.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I had to listen to this a few times. I&#39;m just at a loss for words. All of our Ada is staked. Guess what that&#39;s how it&#39;s supposed to be for a properly designed Proof of Stake protocol. <a href=\"https://t.co/ye6va1DH06\">https://t.co/ye6va1DH06</a></p>&mdash; Charles Hoskinson (@IOHK_Charles) <a href=\"https://twitter.com/IOHK_Charles/status/1674446869143928833?ref_src=twsrc%5Etfw\">June 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Buterin also <a href=\"https://cointelegraph.com/news/ethereum-re-staking-protocol-eigenlayer-launches-on-testnet\">discussed the EigenLayer protocol</a> – a protocol that allows Ethereum validators and stakers to “re-stake” their assets onto other emerging networks.</p><p>He said the challenge is that it creates “centralization risks,\" stating:</p><blockquote>“Trustworthy stakers would be valued more by the system than untrustworthy stakers. Trustworthy stakers are much less likely to actually get slashed.”</blockquote><p>Sreeram Kaanan, founder of EigenLayer, explained there are “complex risks” with re-staking and it is important to take a \"constrained approach in building restaking.\"</p><p>\"Constraints being what is really good for the ecosystem? And having constraints on building what new innovation can be unleashed based on this concept. The driving value is permissionless innovation\" he stated.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/bd0ee33c-5b61-42e2-a6d3-8f8249553c98.png\"  /><figcaption style=\"text-align: center;\"><em>Panellists on the June 29 Bankless Podcast episode. Source: Bankless Podcast</em></figcaption></figure><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/vitalik-buterin-and-polygon-founder-to-help-send-100m-covid-19-donation\"><strong><em>Vitalik Buterin and Polygon co-founder to help send $100M toward COVID-19 research</em></strong></a></p><p>This comes after Buterin stated in a June 9 blog that the <a href=\"https://cointelegraph.com/news/vitalik-buterin-ethereum-fails-without-these-three-transitions\">Ethereum blockchain outright</a> “fails” without sufficient scaling infrastructure to make transactions cheap.</p><p>He also noted another point of failure relates to smart contract wallets. </p><p>He explained that a move to smart contract wallets has resulted in certain challenges arising due to the complexities associated with the user experience side of things when users take control of multiple addresses at once. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/sec-calls-etf-filings-inadequate-binance-loses-euro-partner-and-other-news-hodlers-digest-june-25-july-1/\"><strong><em>SEC calls ETF filings inadequate, Binance loses euro partner and other news: Hodler’s Digest, June 25 – July 1</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-02T06:58:09.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The $2Million bet by ex-CTO of Coinbase has been the subject of much discussion and debate in the crypto world. At the heart of the controversy is Srinivasan’s prediction that Bitcoin will reach $1 million per coin within just 90 days. This Bitcoin Price Prediction intends to shed light on the ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-02T06:55:57.000Z",
    "title": "Binance Pay and Alternative Airlines Introduce Exclusive Crypto Booking Promotion",
    "url": "https://www.cryptopolitan.com/binance-pay-and-airlines-crypto-booking/",
    "description": "Binance Pay, the renowned cryptocurrency payment platform, has teamed up with Alternative Airlines, a leading online flight booking platform, to introduce an exciting promotion for crypto enthusiasts. This collaboration allows Binance Pay users to enjoy a 3% discount on all bookings made at Alternative Airlines using the exclusive &#8220;BINANCE3&#8221; discount code. The promotion aims to ... <a title=\"Binance Pay and Alternative Airlines Introduce Exclusive Crypto Booking Promotion\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-pay-and-airlines-crypto-booking/\" aria-label=\"More on Binance Pay and Alternative Airlines Introduce Exclusive Crypto Booking Promotion\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-02T07:00:00.000Z",
    "title": "Filecoin onchain metrics falling, ChatGPT recommends diversifying with Tradecurve’s TCRV",
    "url": "https://crypto.news/filecoin-onchain-metrics-falling-chatgpt-recommends-diversifying-with-tradecurves-tcrv/",
    "description": "After SEC's classified filecoin (FIL) as a security, ChatGPT recommends investors consider diversifying with other projects like Tradecurve"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-02T07:08:29.000Z",
    "title": "ENS Rises 10% As Ethereum Name Service Considers Expanding To Layer-2",
    "url": "https://www.newsbtc.com/news/ens-risesethereum-name-service-layer-2/",
    "description": "In a recent community call, the team behind the Ethereum Name Service (ENS) revealed plans to adopt a Layer-2 platform in light of increasing gas fees on the mainnet. In response to this planned move, ENS prices climbed roughly 10%, floating higher with increasing trading volumes, evident in the daily chart. The Ethereum Name Service ENS is a decentralized naming system on Ethereum. It provides an easy-to-use and human-readable naming system that allows users to rename mainnet addresses, smart contracts, and other resources. This system permits users to create and employ memorable domain names instead of complicated addresses. Related Reading: Stellar (XLM) Takes Investors By Surprise With 23% Rally The team behind the ENS believes their solution makes it easier for everyone to interact with the pioneer smart contracting platform, and is handy, especially in sending and receiving transactions. In this arrangement, the platform maps a user’s domain, the human-readable address, with their original address or deployed smart contract on the Ethereum mainnet.  However, since ENS maps all addresses on the Ethereum mainnet, transaction fees apply, a concern considering the fluctuating gas fees on Ethereum. In Ethereum, all transactions, including transfers or smart contract deployment, must be paid for. The amount paid depends on the level of demand in the network, and the value tends to be volatile. Over the past few weeks, Ethereum gas fees have been rising.  Fluctuating Gas Fees  According to YCharts data on June 30, the average gas fee for sending a transaction stood at $34.62, down from $42.77 recorded on June 5. As of May 12, it stood at $77.88. The only time gas fees on Ethereum fell was on June 25, when it was at $16.58. At this level, the gas fee is relatively high compared to other networks. For example, the average transaction fee in Bitcoin was $2.383 on June 30, down from $9.018 on May 12. Meanwhile, in layer-2 platforms, transaction fees and smart contract deployment costs are relatively lower, according to trackers. As an illustration, gas fees on Optimism, a popular Ethereum layer-2, is $0.03 as of July 2. Related Reading: Polygon 2.0 Upgrade – Potential Bullish Implications For MATIC Price? Considering the high gas fees on Ethereum, ENS, via two improvement proposals, ENSIP-10 and EIP-3668, will further expand to a Layer-2 platform as a relief for users sensitive to high gas fees on Ethereum as part enhancing interoperability. During the call, the team said this would scale the platform and open the service to more people. In response, ENS prices are up 10% on the last trading day, changing hands at $9.42 at the back of increasing trading volumes. Still, it remains to be seen whether prices will continue edging higher once the platform migrates to a Layer-2 platform. For now, ENS has registered over 2.73 million names owned by more than 697,000 entities. Featured image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-02T07:04:48.000Z",
    "title": "Billionaire Tim Draper Predicts Bitcoin (BTC) Cracks $250,000 Level – Here’s His Timeline",
    "url": "https://dailyhodl.com/2023/07/02/billionaire-tim-draper-predicts-bitcoin-btc-cracks-250000-level-heres-his-timeline/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/04/btc-explode-between-macro.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/04/btc-explode-between-macro.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/04/btc-explode-between-macro.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/04/btc-explode-between-macro.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/04/btc-explode-between-macro.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/04/btc-explode-between-macro.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/04/btc-explode-between-macro.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Billionaire and long-time Bitcoin (BTC) bull Tim Draper is doubling down on his call that the crypto king will burst above $250,000. The venture capitalist tells his 253,500 Twitter followers that he was a bit off in his previous prediction that BTC would reach $250,000 in 2023. With Bitcoin trading just above $30,000, Draper is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/02/billionaire-tim-draper-predicts-bitcoin-btc-cracks-250000-level-heres-his-timeline/\">Billionaire Tim Draper Predicts Bitcoin (BTC) Cracks $250,000 Level – Here’s His Timeline</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]