[
  {
    "source": "Decrypt",
    "date": "2023-06-09T21:30:39.000Z",
    "title": "Generative AI Will Have 'Enormous Impact' on Business, Execs Admit—But Not Right Away",
    "url": "https://decrypt.co/144011/generative-ai-enormous-impact-business-execs-admit-not-right-away",
    "description": "Corporate executives are optimistic about the benefits of generative AI, according to a KPMG study, but it'll take time to implement."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-09T21:30:00.000Z",
    "title": "Crypto Biz: The SEC’s summer crackdown, Apple’s ‘spatial computing,’ and Mercado Bitcoin gears up",
    "url": "https://cointelegraph.com/news/crypto-biz-the-sec-summer-crackdown-apple-spatial-computing-and-mercado-bitcoin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/6ee13070-240c-431c-9a00-05ca4d711986.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Along with the recent wave of lawsuits, this week’s Crypto Biz also explores Apple’s new headset, Brazil’s Mercado Bitcoin payments arm and how regulators are targeting AI-generated fake news.</p>\n                    <p><p>After a period of relative calm, the United States Securities and Exchange Commission (SEC) kicked off its summer crypto crackdown by targeting two major exchanges, Binance and Coinbase.</p><p>A total of 13 charges <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">have been filed</a> against Binance. One of the allegations in the suit claims that funds from Binance and Binance.US were commingled into an account controlled by the Changpeng Zhao-associated company, Merit Peak.</p><p>As for Coinbase, the SEC claims it <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">has been offering unregistered securities</a> and was never registered as a broker, securities exchange or clearing agency. Many in the crypto industry have been puzzled by the allegations against Coinbase, primarily because it is a publicly-traded company and received a previous green light from the regulator. </p><p>While not surprising, this week’s developments again shed light on the dubious practices of the SEC toward the crypto space, as it claimed companies failed to register with the regulator, despite the absence of a path to do so. Ripple CEO Brad Garlinghouse <a href=\"https://twitter.com/bgarlinghouse/status/1666126927583666176\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the latest string of lawsuits is an attempt by the SEC to “distract” from the agency’s “FTX debacle” Let’s not forget the SEC has not sued FTX, although it <a href=\"https://cointelegraph.com/news/sec-charges-ftx-ceo-sbf-for-defrauding-investors-a-day-after-the-arrest\">has charged its founder and former executives.</a> </p><p>The crypto space has seen sell-offs in tokens and stocks, services halted and heightened uncertainty in recent days, but these events may also bring something that the industry is eager for — legal clarity.</p><p>Along with the recent wave of lawsuits, this week’s Crypto Biz also explores Apple’s new headset moving beyond the metaverse, Brazil’s Mercado Bitcoin gets the green light for its fintech payments arm, and how European Union regulators are targeting fake news generated by artificial intelligence.</p><h2>SEC complaint hints at why Brian Brooks resigned as Binance​.US CEO</h2><p>The SEC’s latest complaint against Binance could explain why former Binance.US CEO Brian Brooks <a href=\"https://cointelegraph.com/news/sec-lawsuit-binance-brian-brooks-resign-us-ceo\">chose to step down in August 2021</a>, only three months after his appointment. According to legal sources, the complaint cites an “unnamed source” who ran Binance.US for a brief period in 2021. The dates correlate with the time that Brooks was CEO of the company. Brooks — a former top banking regulator — led operations at the crypto exchange after replacing former CEO Catherine Coley. According to comments cited in the complaint, Brooks quickly realized that he was “not actually the one running this company.” Upon recognizing this, <a href=\"https://cointelegraph.com/news/crypto-community-in-shock-over-brian-brooks-resignation-from-binance-us\">he decided to leave</a>, announcing his resignation just three months later. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ The SEC complaint against <a href=\"https://twitter.com/binance?ref_src=twsrc%5Etfw\">@Binance</a> appears to solve the mystery of why Brian Brooks abruptly resigned as CEO of <a href=\"https://twitter.com/BinanceUS?ref_src=twsrc%5Etfw\">@BinanceUS</a> in 2021. <br><br>CZ allegedly reneged on promises that Brooks would be given autonomy to run <a href=\"https://t.co/reBq6K7KAs\">https://t.co/reBq6K7KAs</a> independently from <a href=\"https://twitter.com/binance?ref_src=twsrc%5Etfw\">@Binance</a>.</p>&mdash; MetaLawMan (@MetaLawMan) <a href=\"https://twitter.com/MetaLawMan/status/1665779228464369669?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Brazilian crypto exchange Mercado Bitcoin licensed as payment provider</h2><p>Cryptocurrency exchange Mercado Bitcoin was <a href=\"https://cointelegraph.com/news/brazil-crypto-exchange-mercado-bitcoin-licensed-as-payment-provider\">granted a payment provider license</a> from Brazil’s central bank on June 2. With the license, the company will launch its fintech solution MB Pay. The fintech arm will provide Brazilian users with specific digital banking services using crypto assets held on the exchange, such as digital fixed-income investments, staking and other financial transactions. A debit card offering a crypto off-ramp for users is expected to go live soon. Global crypto exchanges operating in Brazil’s market include Binance, Coinbase, Crypto.com and Bitso.</p><h2>Apple’s Vision Pro headset reveal swaps metaverse for ‘spatial computing’</h2><p>Apple’s <a href=\"https://cointelegraph.com/news/apple-vision-pro-headset-wwdc-no-mention-metaverse\">newly revealed mixed-reality headset</a>, the Apple Vision Pro, has turned tech-enthusiast heads in the past few days. The company, however, deliberately labeled its technology the first “spatial computer” to move away from the metaverse concept and differentiate its virtual reality tool from competitors. Apple’s marketing is focused on the words “spatial” and “spatial computing” rather than words such as “metaverse,” “AR,” and “VR.” A clear step away from Microsoft’s Hololens and Meta’s headsets. Apple’s headset will be launched in the U.S. in early 2024, for a hefty retail price of $3,499, before expanding internationally.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/f99a3a78-502c-4276-9df1-3cd78e22fa9d.png\"  /><figcaption style=\"text-align: center;\"><em>Using apps with Apple Vision Pro. Source: Apple</em></figcaption></figure><h2>EU officials want all AI-generated content to be labeled</h2><p>A new effort by the European Union to <a href=\"https://cointelegraph.com/news/eu-officials-want-all-ai-generated-content-labeled\">stamp out fake news</a> targets artificial intelligence-generated content. According to EU officials, companies deploying generative AI tools should label their content to combat fake news. The statement comes as the EU prepares its forthcoming Artificial Intelligence Act, which will be a comprehensive set of guidelines for the public use of AI and the companies deploying it. Major tech companies, including Google, Microsoft and Meta Platforms, have already signed onto the EU’s 2022 Code of Practice on Disinformation.</p><p><em>Crypto Biz is your weekly pulse of the business behind blockchain and crypto, delivered directly to your inbox every Thursday.</em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-09T21:30:14.000Z",
    "title": "Digital Asset Trust Firm Bitgo Sets Sights on Prime Trust Acquisition ",
    "url": "https://news.bitcoin.com/digital-asset-trust-firm-bitgo-sets-sights-on-prime-trust-acquisition/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/bitgo-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Digital Asset Trust Firm Bitgo Sets Sights on Prime Trust Acquisition \" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/bitgo-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/bitgo-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/bitgo-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/bitgo-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/bitgo-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/bitgo-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/bitgo.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a recent development, Bitgo, the digital asset trust firm, disclosed that it has penned a letter of intent to acquire Prime Trust, a crypto custodian based in Nevada. Should the acquisition proceed, Prime Trust would become an integral part of Bitgo&#8217;s network of regulated trust companies. Bitgo Signs Letter of Intent to Acquire Crypto [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-09T21:25:20.000Z",
    "title": "Hut 8 smashes expectations in May with BTC mining records",
    "url": "https://www.cryptopolitan.com/hut-8-smashes-expectations-with-btc-mining/",
    "description": "May was a ground-breaking month for the North American digital asset mining pioneer, Hut 8. This innovation-driven infrastructure provider didn&#8217;t merely meet the expectations; it actually smashed them, setting new benchmarks in Bitcoin (BTC) mining, a sphere it has chosen to master. It seems the month had all the right ingredients for a fantastic recipe ... <a title=\"Hut 8 smashes expectations in May with BTC mining records\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hut-8-smashes-expectations-with-btc-mining/\" aria-label=\"More on Hut 8 smashes expectations in May with BTC mining records\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-09T21:30:16.000Z",
    "title": "Tron Upward Price Momentum At Risk Unless Key Resistance Is Breached",
    "url": "https://www.newsbtc.com/news/tron/tron-upward-price-momentum-at-risk-unless-key-resistance-is-breached/",
    "description": "Over the past few weeks, the price of Tron (TRX) has experienced an upward movement. However, it has struggled to break through a crucial resistance level for a significant period of time. In the last 24 hours, TRX saw a 1% increase, while on the weekly chart, it recorded a 3% gain. The bullish momentum has been maintained since surpassing the $0.68 price level. The technical outlook suggests a potential shift towards bullish influence. Related Reading: Cardano Price Threatens Multi-Month Low Unless Bulls Defend This Support Demand and accumulation indicators have shown improvement in the daily timeframe. While Tron has managed to resist the broader market sentiments affecting other altcoins, it remains vulnerable to fluctuations in the Bitcoin price. To sustain its daily gains, it is crucial for TRX to surpass the immediate resistance level. Failure to do so may result in a reversal of its upward trend. The increase in the TRX market capitalization indicates that demand has started to revisit the market. Tron Price Analysis: One-Day Chart At the time of writing, Tron (TRX) was trading at $0.078. The altcoin faced overhead resistance at $0.079, and a successful move above this level would likely propel TRX above the $0.080 mark. However, if it is rejected at $0.079, the coin could experience a significant decline. It is worth noting that TRX has previously faced rejection at the $0.083 level, which will serve as an important resistance. On the downside, the nearest support for Tron is located at $0.074. If TRX fails to hold above this support level, it may drop further to $0.068. The trading volume of TRX in the last session was green, suggesting that buyers have started to establish control over the price. Technical Analysis Following a period of decreased investor interest earlier this month, Tron (TRX) is currently showing signs of recovery in terms of demand on the daily chart. The Relative Strength Index (RSI) indicates that buyers are exerting dominance in the market, as it is above the half-line. This suggests a positive sentiment and increased buying pressure. Additionally, the price of TRX has moved above the 20-Simple Moving Average (SMA) line, indicating that buyers are in control of the price momentum in the market. This further supports the notion that buyer dominance is prevailing. To sustain this buyer momentum, it is crucial for TRX to break past the $0.079 resistance level. If TRX successfully surpasses this level, it may continue its upward movement Contrary to rising demand, TRX has maintained sell signals on the daily chart based on the Moving Average Convergence Divergence (MACD) indicator. The MACD histogram formed red bars, indicating sell signals for the altcoin. This suggests a potential decline in price if TRX fails to move above the immediate resistance level. Related Reading: MATIC Price Shows Bullish Formation – What’s Next? Furthermore, the Chaikin Money Flow (CMF), which measures capital inflows and outflows, is below the half-line. The upcoming trading sessions will be crucial for TRX to determine its future direction. Featured Image From UnSplash, Charts From TradingView.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-09T21:24:00.000Z",
    "title": "PayPal Senior VP Reveals How B2B Payments Could Ignite Crypto Adoption",
    "url": "https://coinedition.com/paypal-senior-vp-reveals-how-b2b-payments-could-ignite-crypto-adoption/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/PayPal-Senior-VP-Reveals-How-B2B-Payments-Could-Ignite-Crypto-Adoption-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"PayPal Senior VP Reveals How B2B Payments Could Ignite Crypto Adoption\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/PayPal-Senior-VP-Reveals-How-B2B-Payments-Could-Ignite-Crypto-Adoption-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/PayPal-Senior-VP-Reveals-How-B2B-Payments-Could-Ignite-Crypto-Adoption-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/PayPal-Senior-VP-Reveals-How-B2B-Payments-Could-Ignite-Crypto-Adoption.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Jose Fernandez da Ponte foresees blockchain revolutionizing payment systems. Digital currencies could optimize cross-border e-commerce transactions. Rapid surge expected in blockchain-powered B2B payments, predicts da Ponte. In an exclusive interview with Fortune, Jose Fernandez da Ponte, Senior Vice President and general manager of blockchain, crypto, and digital currencies at PayPal, revealed how blockchain technology and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/paypal-senior-vp-reveals-how-b2b-payments-could-ignite-crypto-adoption/\">PayPal Senior VP Reveals How B2B Payments Could Ignite Crypto Adoption</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]