[
  {
    "source": "NewsBTC",
    "date": "2023-12-12T01:00:02.000Z",
    "title": "Market Jolt: Bitcoin Falls Below $42,000 As Short Term Holders Rush To Cash In",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-falls-below-42000-short-term-holders-rush-to-cash-in/",
    "description": "Bitcoin is currently witnessing a decline in price, with its value dropping below the $42,000 mark. This movement comes on the heels of a significant uptick in the circulating supply of profitable Bitcoin, prompting a wave of profit-taking among investors. ETC Group&#8217;s Head of Research, André Dragosch, highlights this trend, noting an increase in Bitcoin being moved to exchanges for potential sale. Dragosch noted, citing data from Glassnode: Overall exchange balances for bitcoin have clearly picked up, implying a net inflow of coins to exchanges over the past week. More specifically, around +14k BTC have flown into exchanges on a net basis according to data provided by Glassnode. This will likely exert some downside pressure on prices in the short term. Bitcoin Short-Term Holders Drive Selling Pressure According to the ETC Group, the current market scenario presents a landscape where a substantial portion of Bitcoin and Ethereum addresses are profitable. Data from the firm indicates that 88.3% of BTC addresses and 77.6% of ETH addresses are currently profitable, figures hovering near the highest for the year. Related Reading: The Bitcoin Spot ETF Boom: VanEck Forecasts $2.4 Billion Inflows In Q1 2024 This environment of a high percentage of BTC and ETH addresses being in a state of profit has seemingly encouraged a segment of investors, particularly those with a short-term investment perspective, to capitalize on their gains, as indicated by the ETC Group&#8217;s analysis. The ETC group further revealed that these short-term investors, defined as those who have held Bitcoin for less than 155 days, have been transferring their profitable assets to exchanges at a rate not seen since July of this year. This surge in selling pressure is attributed to a key factor restraining the Bitcoin rally as the market adjusts to the increased availability of the cryptocurrency. Further illustrating the market&#8217;s reaction, the past week marked the first instance of &#8220;net outflows&#8221; from crypto asset exchange-traded products (ETPs) since early October. The total amount of these outflows was approximately $18.2 million, with Bitcoin ETPs experiencing the majority of these withdrawals, totaling $13.1 million. In contrast, Ethereum ETPs saw a &#8220;net inflow&#8221; of $5.8 million, suggesting a diverging investor interest between the two leading crypto. Market Impact And Trader Liquidations The recent decline in Bitcoin&#8217;s price from its previous high of around $44,000 has impacted investor sentiment and resulted in significant trader liquidations. According to data from Coinglass, over the last 24 hours, there have been 115,873 trader liquidations, culminating in roughly $424.67 million in total liquidations. Bitcoin has led these liquidations, with $105.51 million in long liquidations and $14.95 million in short liquidations. Ethereum follows closely, accounting for $78.53 million in long and $7.41 million in short liquidations. Related Reading: Holding For Gold: Micheal Saylor’s Poll Unveils Bitcoin Enthusiasts Aiming For $1 Million Mark It is worth noting that these liquidations and the fluctuating market dynamics underscore the division of trader&#8217;s fate in the crypto market. While some investors seize the opportunity to realize profits, others face the challenges of rapid market shifts. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-12T01:00:37.000Z",
    "title": "Plenty of Juice Left in the Tank for Solana, Says Top Crypto Trader – Here’s His Big Upside Target",
    "url": "https://dailyhodl.com/2023/12/11/plenty-of-juice-left-in-the-tank-for-solana-says-top-crypto-trader-heres-his-big-upside-target/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/institutional-look-solana.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/institutional-look-solana.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/institutional-look-solana.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/institutional-look-solana.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/institutional-look-solana.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/institutional-look-solana.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/institutional-look-solana.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A trader who nailed the bottom of Bitcoin&#8217;s (BTC) 2018 bear market is remaining bullish on Solana (SOL) despite its deep corrective move in the past day. Pseudonymous analyst Bluntz tells his 231,500 followers on the social media platform X that Solana is the fastest large-cap coin to recover after plunging to a 24-hour low [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/11/plenty-of-juice-left-in-the-tank-for-solana-says-top-crypto-trader-heres-his-big-upside-target/\">Plenty of Juice Left in the Tank for Solana, Says Top Crypto Trader – Here’s His Big Upside Target</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]