[
  {
    "source": "Decrypt",
    "date": "2024-02-28T22:16:02.000Z",
    "title": "Analysts Say This Is the Bitcoin Metric to Watch—And It's Higher Than Ever",
    "url": "https://decrypt.co/219561/bitcoin-mvrv-realized-cap-metric-more-higher-investors",
    "description": "The average Bitcoin investor has already doubled their money, Glassnode reports—and we’re still nowhere near the top."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-28T22:33:12.000Z",
    "title": "DeFi risk management firm Gauntlet partners with Morpho amid split with Aave",
    "url": "https://www.cryptopolitan.com/defi-risk-management-firm-gauntlet-partners/",
    "description": "In a strategic move within the decentralized finance (DeFi) landscape, Gauntlet, a prominent DeFi risk management firm, has swiftly transitioned its collaboration from Aave to Morpho. This transition comes days after Gauntlet departed from Aave, a leading DeFi lending protocol. Gauntlet&#8217;s shift to MorphoBlue Announced on February 27, the partnership between Gauntlet and Morpho entails [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-28T22:29:30.000Z",
    "title": "Donald Trump’s Ethereum Holdings Surge as TRUMP Meme Coin Skyrockets",
    "url": "https://www.cryptopolitan.com/trumps-eth-surge-as-meme-coin-skyrockets/",
    "description": "Trump&#8217;s cryptocurrency holdings have surged to almost $4 million, propelled by the soaring value of the MAGA (TRUMP) meme coin. Tracking Trump&#8217;s Ethereum wallet, blockchain analytics firm Arkham Intelligence notes a substantial uptick in his crypto assets, primarily invested in TRUMP tokens. Analysis reveals his Ethereum wallet contains about $6.4 million, with the majority, approximately [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-28T22:19:12.000Z",
    "title": "Elizabeth Warren ready to work with crypto industry – but she has a condition",
    "url": "https://www.cryptopolitan.com/warren-ready-to-work-with-crypto-industry/",
    "description": "US Senator Elizabeth Warren has thrown down the gauntlet to the cryptocurrency industry, stating her willingness to work together but under one major condition: the collaboration must adhere strictly to the rules that govern traditional finance. Warren made the statement during a Bloomberg interview, where she expressed her desire to work with the crypto sector [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-28T22:17:54.000Z",
    "title": "Bitcoin ETF trading volumes reach staggering heights",
    "url": "https://www.cryptopolitan.com/bitcoin-etf-trading-volumes-reach/",
    "description": "Bitcoin exchange-traded funds (ETFs) continue to surge in popularity, with trading volumes hitting unprecedented levels for the second consecutive day. Analysts are witnessing a genuine demand for these investment vehicles, as evidenced by the staggering $2 billion combined daily trading volume on Feb. 27. Record-breaking performance BlackRock&#8217;s iShares Bitcoin Trust ETF (IBIT) stole the spotlight, [&#8230;]"
  }
]