[
  {
    "source": "Cointelegraph",
    "date": "2023-10-13T02:29:03.000Z",
    "title": "US Space Force pauses use of ChatGPT-like tools  due to security fears: Report",
    "url": "https://cointelegraph.com/news/us-space-force-bans-chat-gpt-ai-tools-security-concerns",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/3fdded0b-415b-41a5-85bd-e9b4ac84451e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>At least 500 Space Force staff members have been affected, according to the department’s former chief software officer.</p>\n                    <p><p>The United States Space Force has temporarily banned its staff from using generative artificial tools while on duty to protect government data, according to reports.</p><p>Space Force members were informed that they “are not authorized” to web-based generative AI tools — to create text, images, and other media — unless specifically approved, <a href=\"https://www.bloomberg.com/news/articles/2023-10-11/space-force-pauses-generative-ai-based-on-security-concerns\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to an Oct. 12 report by Bloomberg, citing a memorandum addressed to the Guardian Workforce (Space Force members) on Sept. 29.</p><p>“Generative AI “will undoubtedly revolutionize our workforce and enhance Guardian’s ability to operate at speed,” Lisa Costa, Space Force's deputy chief of space operations for technology and innovation reportedly said in the memorandum.</p><p>However, Costa cited concerns over current cybersecurity and data handling standards, explaining that AI and large language model (LLM) adoption needs to be more “responsible.”</p><p>The United States Space Force is a space service branch of the U.S. Armed Forces tasked with protecting the U.S. and allied interests in space.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">US Space Force has temporarily banned the use of web-based generative artificial intelligence tools and so-called large language models that power them, citing data security and other concerns, according to a memo seen by Bloomberg News.<a href=\"https://t.co/Rgy3q8SDCS\">https://t.co/Rgy3q8SDCS</a></p>&mdash; Katrina Manson (@KatrinaManson) <a href=\"https://twitter.com/KatrinaManson/status/1712129989150167474?ref_src=twsrc%5Etfw\">October 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The Space Force’s decision has already impacted at least 500 individuals using a generative AI platform called “Ask Sage,” according to Bloomberg, citing comments from Nick Chaillan, former chief software officer for the United States Air Force and Space Force.</p><p>Chaillan reportedly criticized the Space Force’s decision. “Clearly, this is going to put us years behind China,” he wrote in a September email complaining to Costa and other senior defense officials.</p><p>“It’s a very short-sighted decision,” Chaillan added.</p><p>Chaillan noted that the U.S. Central Intelligence Agency and its departments have <a href=\"https://cointelegraph.com/news/cia-builds-its-own-chatgpt-style-ai-bot\">developed generative AI tools</a> of their own that meet data security standards.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/learn/data-protection-in-ai-chatting-does-chatgpt0comply-with-gdpr-standards\"><strong><em>Data protection in AI chatting: Does ChatGPT comply with GDPR standards?</em></strong></a></p><p>Concerns that LLMs could leak private information into the public has been a fear for some governments in recent months.</p><p><a href=\"https://cointelegraph.com/news/italy-blocks-chatgpt-investigates-suspected-violations\">Italy temporarily blocked AI chatbot ChatGPT</a> in March, citing suspected breaches of data privacy rules before <a href=\"https://cointelegraph.com/news/open-ai-chat-gpt-re-enters-italy-after-obliging-transparency-demands\">reversing its decision</a> about a month later.</p><p>Tech giants such as Apple, Amazon, and Samsung are among the firms that have also <a href=\"https://www.businessinsider.com/chatgpt-companies-issued-bans-restrictions-openai-ai-amazon-apple-2023-7#verizon-announced-that-chatgpt-is-not-accessible-from-our-corporate-systems-in-an-effort-to-limit-the-risk-of-losing-control-of-customer-information-and-source-code-3\" target=\"_blank\" rel=\"noopener nofollow\">banned</a> or restricted employees from using ChatGPT-like AI tools at work.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/musks-alleged-price-manipulation-the-satoshi-ai-chatbot-and-more-hodlers-digest-may-28-june-3/\"><strong><em>Musk’s alleged price manipulation, the Satoshi AI chatbot and more</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-13T02:37:15.000Z",
    "title": "U.S. Considers Closing AI Chip Access Loophole for Chinese Companies Abroad",
    "url": "https://www.cryptopolitan.com/u-s-closing-ai-chip-access-chinese-abroad/",
    "description": "In a move that could significantly impact the global AI chip landscape, the Biden administration is actively considering closing a loophole that grants Chinese companies access to American artificial intelligence (AI) chips via their overseas subsidiaries. This development comes as part of the ongoing effort to tighten restrictions on chip exports to China, particularly those ... <a title=\"U.S. Considers Closing AI Chip Access Loophole for Chinese Companies Abroad\" class=\"read-more\" href=\"https://www.cryptopolitan.com/u-s-closing-ai-chip-access-chinese-abroad/\" aria-label=\"More on U.S. Considers Closing AI Chip Access Loophole for Chinese Companies Abroad\">Read more</a>"
  }
]