[
  {
    "source": "CoinDesk",
    "date": "2023-09-14T16:24:08.000Z",
    "title": "Dueling CBDC Bills Heading for U.S. Digital Dollar Debate in Congressional Hearing",
    "url": "https://www.coindesk.com/policy/2023/09/14/dueling-cbdc-bills-heading-for-us-digital-dollar-debate-in-congressional-hearing/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The idea of a digital dollar in the U.S. is so egregious to Republican lawmakers that it’s become a presidential campaign talking point and the subject of multiple bills to strangle it before it takes a first breath. But Rep. Stephen Lynch (D-Mass.) reintroduced a bill Thursday calling for the exact thing they’re trying to stop."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-14T16:30:38.000Z",
    "title": "SSV.network hits mainnet to increase decentralization of Ethereum staking pools ",
    "url": "https://cointelegraph.com/news/ssv-network-mainnet-increase-ethereum-staking-pool-decentralization",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/420144e2-9289-4bce-bccc-f7ce466d7cbc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>SSV.network launches distributed validator technology network with more than 10 partner staking DApps to help decentralize Ethereum staking. </p>\n                    <p><p>Criticisms aimed at the perceived centralization of Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) staking pools may finally be quelled by an alternative staking infrastructure that aims to improve private key security and reduce validator down times and slashing penalties.</p><p>Speaking exclusively to Cointelegraph, SSV.network founder Alon Muroch outlined how the platform's distributed validator technology (DVT) developed in partnership with the Ethereum Foundation will help decentralize ETH staking pools and validators.</p><p>SSV.network launched its public mainnet with more than 10 staking decentralized applications deploying their platforms on the network on Sept. 14. DVT is envisaged to decentralized the current landscape of staking providers, which is currently dominated by a handful of ETH staking pools that command a significant share of ETH locked in the ETH2 staking contract.</p><p><a href=\"https://cointelegraph.com/news/ssv-launches-50m-ecosystem-fund-to-support-eth-staking-tech\"><strong><em>Related: SSV launches $50M ecosystem fund to support ETH staking tech</em></strong></a></p><p>According Muroch, the technology is an approach to validator security that spreads out key management and signing responsibilities across multiple parties, reducing single points of failure and increasing validator resiliency.</p><p>The technology splits a private key used to secure a validator across a cluster of computers. This increases security and allows for some nodes of a validator cluster to go offline, which also reduces single points of failure from the network and makes validator sets more robust.</p><blockquote>“By splitting keyshares between a diverse set of nodes in a cluster, validators become much more decentralized. Staking pools that use DVT can decentralize their own infrastructure or delegate it to SSV.network node operators.”</blockquote><p>Data from blockchain analytics firm Nansen shows that Lido Finance accounts for 32% of ETH locked in the Beacon Chain deposit contract. ETH staking pools offered by Coinbase (8%) and Binance (4%) also command a significant share of staked ETH. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/1522c36a-b305-4658-b34d-2e8450db2867.png\"  /><figcaption style=\"text-align: center;\">An overview of the largest ETH staking entities. Source: Nansen ETH2 Deposite Contract.</figcaption></figure><p>As SVV noted in an announcement marking the mainnet launch, centralized exchanges including Coinbase, Binance and Kraken hold around 18% of the total staked ETH, while liquid taking pools like Lido, RocketPool, Stader and Stakewise account for over 36% of the total market share.</p><p>Liquid staking pools became hugely popular in the build-up to Ethereum’s anticipated Shanghai upgrade in <a href=\"https://cointelegraph.com/innovation-circle/the-ethereum-shanghai-upgrade-everything-you-need-to-know\">July 2023</a>. The event introduced the ability for Ethereum users to withdraw staked ETH from the Beacon contract for the first time. </p><p>SSV intends to offer an alternative liquid and centralized staking pools, which it describes as “fundamentally centralized and custodial”. Muroch added that SSV can significantly increase increase validator private key security and maximize rewards through high performance and a fault tolerant setup that stops slashing penalties for offline validators.</p><p>SSV.network grabbed headlines in <a href=\"https://cointelegraph.com/news/ssv-launches-50m-ecosystem-fund-to-support-eth-staking-tech\">Jan. 2023</a> as it launched a $50 million ecosystem fund to support other projects developing using DVT.  The technology was previously highlighted as an important aspect of Ethereum's scaling roadmap laid out by co-founder <a href=\"https://cointelegraph.com/news/vitalik-buterin-outlines-endgame-roadmap-for-eth-2-0\">Vitalik Buterin in Dec. 2021.</a></p><p>Magazine: <a href=\"https://cointelegraph.com/magazine/dao-hyped-voting-decentralization/\">Are DAOs overhyped and unworkable? Lessons from the front lines</a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-14T16:28:50.000Z",
    "title": "Web3 company to have balloons featured during Macy's Thanksgiving Day Parade",
    "url": "https://cointelegraph.com/news/web3-company-balloons-featured-macys-thanksgiving-day-parade",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/0e6d0fe0-613a-41f0-8e4a-5eda48fe2429.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The iconic U.S. holiday event has previously introduced themed nonfungible tokens and held a virtual parade in the metaverse.</p>\n                    <p><p>The Macy's Thanksgiving Day Parade, one of the most iconic events surrounding the United States holiday in November, will feature characters from the crypto and blockchain space for one of the first times in its 99-year history.</p><p>In a Sept. 14 announcement, Web3 firm Cool Cats Group <a href=\"https://www.prnewswire.com/news-releases/cool-cats-beloved-characters-blue-cat-and-chugs-to-debut-as-a-balloon-in-the-2023-macys-thanksgiving-day-parade-301927666.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a> some of the characters from their nonfungible token (NFT) collection will appear as balloons in the Thanksgiving Day parade scheduled for Nov. 23 in New York City — a blue cat and a milk carton. According to the parade’s producer Jordan Dabby, the characters will be represented physically for thousands of New Yorkers watching from the streets and millions watching from their homes.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The design for the Cool Cats balloon has been revealed!<a href=\"https://twitter.com/hashtag/macysparade?src=hash&amp;ref_src=twsrc%5Etfw\">#macysparade</a> <a href=\"https://t.co/QoL40Yo7l2\">pic.twitter.com/QoL40Yo7l2</a></p>&mdash; Macy&#39;s Parade History (@ParadeHistory) <a href=\"https://twitter.com/ParadeHistory/status/1702320231123951679?ref_src=twsrc%5Etfw\">September 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>With roughly two months until Thanksgiving, it’s unclear whether any other firms in the crypto and blockchain space plan to have characters represented with parade floats or balloons. The lineup at the Macy's parade changes from year to year, and has featured characters including Baby Yoda from <em>The Mandalorian </em>series, Sonic the Hedgehog, Pikachu, and Charlie Brown. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/indonesian-government-looks-to-nfts-to-preserve-cultural-heritage\"><strong><em>Indonesian government looks to NFTs to preserve cultural heritage</em></strong></a></p><p>In 2021, when the parade returned to its full procession following the 2020 shutdowns amid the COVID-19 pandemic, the organizers also <a href=\"https://cointelegraph.com/news/crypto-thanksgiving-nft-drops-and-black-friday-deals-go-mainstream\">launched an NFT</a> series. The following year, in addition to the proceedings held in-person, the event <a href=\"https://cointelegraph.com/news/festivals-in-the-metaverse-how-web3-projects-are-taking-culture-virtual\">arranged for a virtual parade</a> within the metaverse. </p><p>Having a Web3 firm represented in a major event like the Thanksgiving Day parade will likely come amid other happenings in New York. Former FTX CEO Sam Bankman’s criminal trial is set to kick off on Oct. 3 and may still be going on at the time of the holiday parade.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-city-guide-to-new-york/\"><strong><em>Crypto City: Guide to New York</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-14T16:27:13.000Z",
    "title": "BTC price targets $27K as Bitcoin bulls shrug at PPI inflation surprise",
    "url": "https://cointelegraph.com/news/btc-price-27k-bitcoin-ppi-inflation-surprise",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/3f0a371e-814e-45ba-95ce-d1f6fd450d2f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC price gets a fresh boost from market calm over Fed interest rate policy, as Bitcoin traders eye further gains.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) headed higher into the Sep. 14 Wall Street open despite fresh macro data showing resurgent United States inflation.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/51bb59ed-2720-4a11-859a-8e01264f15bd.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><h2>Bitcoin gains while U.S. PPI beats forecast</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> followed BTC price action as it made new September highs, topping out at $26,762.</p><p>Bitcoin built on strength <a href=\"https://cointelegraph.com/news/bitcoin-cpi-ftx-btc-price-september-high\">seen after the previous daily close</a>, ignoring the implications of the U.S. inflation rebound as confirmed by both the Consumer Price Index (CPI) and <a href=\"https://www.bls.gov/ppi/\" target=\"_blank\" rel=\"noopener nofollow\">Producer Price Index (PPI) </a>August prints.</p><p>The latter came in at 1.6% year-on-year against market expectations of 1.3%.</p><p>Crypto nonetheless joined traditional markets in rejecting the idea that U.S. macro policy might stay more restrictive for longer in order to tame inflation. </p><p>According to CME Group’s <a href=\"https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html\" target=\"_blank\" rel=\"noopener nofollow\">FedWatch Tool</a>, there was practically no consensus over the Federal Reserve raising interest rates again later in the month. On the contrary, odds of a rate hike pause stood at 97% at the time of writing.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/4bb1de88-b03c-435a-ab8e-7985fca426d3.png\"  /><figcaption style=\"text-align: center;\"><em>Fed target rate probabilities chart. Source: CME Group</em></figcaption></figure><p>The disconnect between the data and market sentiment was underlined by a decision by the European Central Bank (ECB) to hike rates by 0.25% on the day.</p><p>“This is their 10th consecutive rate hike putting rates at 4.5%, their highest since 2001,” financial commentary resource The Kobeissi Letter wrote in part of a <a href=\"https://twitter.com/KobeissiLetter/status/1702300052151025854\" target=\"_blank\" rel=\"noopener nofollow\">reaction</a> on X (formerly Twitter). </p><blockquote>“The ECB also cut all their growth forecasts through 2025. The fight against inflation is far from over.”</blockquote><p>Kobeissi added that although the ECB had signalled that the latest hike could be the last in the current cycle, futures markets were still 30% sure of continuation.</p><p>“Central banks around the world are bracing for a LONG pause with elevated rates,” it concluded.</p><h2>BTC price predictions pass $27,000</h2><p>Eyeing the state of play on Bitcoin, market participants were hopeful that another leg up would take BTC/USD to $27,000.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-price-46k-2024-halving-interview-filbfilb\">Bitcoin price can hit $46K by 2024 halving — Interview with Filbfilb</a></em></strong></p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> Knocking on the door of the $26.4K level again.<br><br>It&#39;s key to break this level to leave this post grayscale dump range and attempt at filling the inefficiency up to ~$27K. <a href=\"https://t.co/yY0tiWT58w\">https://t.co/yY0tiWT58w</a> <a href=\"https://t.co/gkTLNKP5gB\">pic.twitter.com/gkTLNKP5gB</a></p>&mdash; Daan Crypto Trades (@DaanCrypto) <a href=\"https://twitter.com/DaanCrypto/status/1702289843043369373?ref_src=twsrc%5Etfw\">September 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“Bitcoin still acting out the Power of Three setup -- pushing into the local resistance,” popular trader Jelle <a href=\"https://twitter.com/CryptoJelleNL/status/1702209669710651769/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">told</a> X subscribers in part of the day’s analysis. </p><blockquote>“Break above $26,400 and I got my eyes on $27,600 next.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/5227da17-93d0-4b80-b494-3037c463c9e1.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Jelle/X</em></figcaption></figure><p>More conservative on the outlook for BTC price strength was trader and analyst Rekt Capital, who eyed an ongoing repeat of a chart fractal from 2021 — Bitcoin’s latest all-time high.</p><p>“Bitcoin bounces from ~$26,000. And as long as $26k holds as support, Phase A-B of the fractal could be in play,” he <a href=\"https://twitter.com/rektcapital/status/1702316333873193285/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> alongside explanatory charts. </p><blockquote>“But we've seen this fractal occur in 2019 and 2021 as well. A relief rally followed by rejection could reveal a weakening support at $26k.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/4837d9b5-416c-4cd6-ac65-6a28ffae38bb.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Rekt Capital/X</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-14T16:22:32.000Z",
    "title": "Hashing It Out: MobileCoin CEO says crypto must make space for more women",
    "url": "https://cointelegraph.com/news/hashing-it-out-mobilecoin-ceo-crypto-needs-more-women",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/8c1c7abe-d050-4097-9cf3-c01d37bf7db5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sara Drakeley says crypto has a reputation for being a ”bro space” and urges the industry to make provisions that would attract more women to the field.</p>\n                    <p><p>On Episode 30 of <em>Hashing It Out</em>, Elisha Owusu Akyaw speaks with Sara Drakeley, CEO of MobileCoin, a company enabling cryptocurrency payments through instant messaging applications such as Signal. Drakeley talks about going from working on animated films like <em>Frozen</em> and <em>Moana</em> at Disney to entering the cryptocurrency space. She also shares her experience as a mother in crypto and explains what is happening at MobileCoin.</p><p>Drakeley shares her journey in the Web3 space and highlights her encounters as a woman in leadership. She acknowledges that crypto has a reputation as being a “bro space,” especially when looking at the marketing of some projects. However, she also points out that there are some pockets of inclusiveness that create safe spaces for women in the arena. Drakeley adds that despite the existence of these safe spaces, the cryptocurrency world needs to find ways to accommodate the particular needs of women who are mothers, for instance. Although this may not be an accommodation necessary for many, the ability to manage these special cases will go a long way to creating a welcoming environment. </p><template data-ct-widget=\"buzzsprout\" data-buzzsprout-podcast-id=\"2096415\"></template><p>Drakeley also explains what is being built at MobileCoin. The project intends to combine the ease and affordability of cryptocurrency payments with the security of encrypted messaging platforms and the popularity of such applications to drive adoption. </p><p>On the future of cryptocurrency regulations, Drakeley believes regulations will catch up. She argues that part of the reason regulators haven’t yet done much is because there hasn’t yet been widespread adoption of cryptocurrency for payments. Once that changes, she says, regulators will step in to protect citizens. The same happened with data privacy on the web, and the same will happen with cryptocurrencies, according to the MobileCoin CEO. </p><p><strong><em>Magazine</em></strong><strong><em>: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</em></strong></a></p><p>Listen to the latest episode of<em> Hashing It Out</em> on <a href=\"https://open.spotify.com/show/3ibvcrJ87PAso4DBIiE5qn?si=5071800991044f7a\" target=\"_blank\" rel=\"noopener nofollow\">Spotify</a>, <a href=\"https://podcasts.apple.com/us/podcast/hashing-it-out/id1658998696?app=podcast\" target=\"_blank\" rel=\"noopener nofollow\">Apple Podcasts</a>, <a href=\"https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8yMDk2NDE1LnJzcw\" target=\"_blank\" rel=\"noopener nofollow\">Google Podcasts</a> or <a href=\"https://tunein.com/podcasts/Business--Economics-Podcasts/Hashing-It-Out-p3083469/\" target=\"_blank\" rel=\"noopener nofollow\">TuneIn</a>. You can also explore Cointelegraph’s complete catalog of informative podcasts on the <a href=\"https://cointelegraph.com/podcasts\">Cointelegraph Podcasts page</a>. </p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-14T16:20:25.000Z",
    "title": "Former chief revenue officer at Celsius pleads guilty to four criminal charges",
    "url": "https://cryptoslate.com/former-chief-revenue-officer-at-celsius-pleads-guilty-on-four-criminal-charges/",
    "description": "<p>Roni Cohen-Pavon, the former chief revenue officer of the now-bankrupt cryptocurrency lender Celsius Network, has pleaded guilty to U.S. criminal charges related to the collapse of the crypto lending network last year. Reuters reported this morning that Cohen-Pavon pleaded guilty to four charges, including manipulating the price of the exchange&#8217;s token, CEL. Cohen-Pavon, along with [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/former-chief-revenue-officer-at-celsius-pleads-guilty-on-four-criminal-charges/\">Former chief revenue officer at Celsius pleads guilty to four criminal charges</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-14T16:20:22.000Z",
    "title": "CZ: Singapore Became Conservative on Crypto After FTX",
    "url": "https://cryptodaily.co.uk/2023/09/cz-singapore-became-conservative-on-crypto-after-ftx",
    "description": "Binance CEO Changpeng ‘CZ’ Zhao said Singapore turned conservative in its approach to cryptocurrencies after the collapse of the demise of FTX but remains crypto-friendly."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T16:31:52.000Z",
    "title": "Paxos takes responsibility of mistaken $500,000 BTC transaction",
    "url": "https://www.cryptopolitan.com/paxos-take-responsibility-of-btc-transaction/",
    "description": "In an unexpected turn of events, Paxos, a prominent issuer of stablecoins and operator of a crypto brokerage firm, acknowledged that it overpaid a staggering $500,000 in fees for a Bitcoin transaction that occurred on September 10, 2023. The company, in a statement released on September 13, clarified that the erroneous transaction was solely its ... <a title=\"Paxos takes responsibility of mistaken $500,000 BTC transaction\" class=\"read-more\" href=\"https://www.cryptopolitan.com/paxos-take-responsibility-of-btc-transaction/\" aria-label=\"More on Paxos takes responsibility of mistaken $500,000 BTC transaction\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T16:26:27.000Z",
    "title": "How to Gain from the Interplay of Economics and Emotions of the Crypto Market",
    "url": "https://www.cryptopolitan.com/economics-and-emotions-of-the-crypto-market/",
    "description": "Emotions have always played a pivotal role in shaping the economic landscape. Whether it&#8217;s stock, securities, or fiat currency, emotion, and economics are always intertwined, so much so that market sentiment has become one of the metrics for predicting key financial events. This impact is more evident in the world of cryptocurrency. Despite its complex ... <a title=\"How to Gain from the Interplay of Economics and Emotions of the Crypto Market\" class=\"read-more\" href=\"https://www.cryptopolitan.com/economics-and-emotions-of-the-crypto-market/\" aria-label=\"More on How to Gain from the Interplay of Economics and Emotions of the Crypto Market\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T16:17:19.000Z",
    "title": "Thailand’s KBank launches $100 Million fund for Web3 and AI startups",
    "url": "https://www.cryptopolitan.com/thailands-kbank-launches-100-million-fund-web3-ai-startups/",
    "description": "Thailand&#8217;s financial giant, Kasikorn Bank, commonly known as KBank, has made a new move by earmarking $100 million for a venture capital fund. This fund, known as KXVC, is an initiative spearheaded by the bank&#8217;s technological division, Kasikorn Business Technology Group (KBTG). With a global reach that includes the Asia Pacific region, the United States, ... <a title=\"Thailand&#8217;s KBank launches $100 Million fund for Web3 and AI startups\" class=\"read-more\" href=\"https://www.cryptopolitan.com/thailands-kbank-launches-100-million-fund-web3-ai-startups/\" aria-label=\"More on Thailand&#8217;s KBank launches $100 Million fund for Web3 and AI startups\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T16:16:32.000Z",
    "title": "ECB raises interest rates to record high in an effort to cool consumer prices",
    "url": "https://www.cryptopolitan.com/ecb-raises-interest-rates-record-high/",
    "description": "The European Central Bank (ECB) has taken a bold step by raising interest rates to an unprecedented level, aiming to control consumer prices. This decision, reached during the governing council&#8217;s meeting in Frankfurt on Thursday, marked the 10th consecutive increase, with the deposit rate raised by 25 basis points to 4 percent. It&#8217;s worth noting ... <a title=\"ECB raises interest rates to record high in an effort to cool consumer prices\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ecb-raises-interest-rates-record-high/\" aria-label=\"More on ECB raises interest rates to record high in an effort to cool consumer prices\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T16:16:32.000Z",
    "title": "California lawmaker proposes bill to protect entertainers from AI threats",
    "url": "https://www.cryptopolitan.com/california-lawmaker-entertainers-ai-threats/",
    "description": "In a bid to shield actors, artists, and entertainers from the implications of artificial intelligence (AI), a Californian lawmaker, Ash Kalra, has put forth a bill aimed at ensuring informed consent in employment contracts concerning digital replicates. The proposed legislation, known as Assembly Bill 459, seeks to address the growing concerns surrounding the use of ... <a title=\"California lawmaker proposes bill to protect entertainers from AI threats\" class=\"read-more\" href=\"https://www.cryptopolitan.com/california-lawmaker-entertainers-ai-threats/\" aria-label=\"More on California lawmaker proposes bill to protect entertainers from AI threats\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-14T16:29:17.000Z",
    "title": "SOLD OUT Synthopia NFT Drop & Updates",
    "url": "https://www.newsbtc.com/nft-market/soldout/",
    "description": "Listen up, degens Summer’s out, and it is time to gear up for another season of Web3 and NFTs. Team VESA has enjoyed the refreshing (too much so at times) weather of our native Finland and some interesting connections and projects have immediately sprouted. Currently, VESA is in Switzerland for a top Web3 conference with the fastest growing crypto ecosystem in the world, Crypto Oasis, but more on that a little later. First, it’s time to give a shoutout to a friend who is a fellow pioneer in the scene with a sold out project VESA is an advisor for. Link to project Selling out was just the beginning. Fusing art, culture, music, gaming, film, and AI, &#8216;SYNTHTOPIA&#8217; is a creation of DESTABILIZED, an art collective founded by creative industry veteran &#8216;QVANTVM&#8216;, with contributions from Scott Page, renowned for his work with Pink Floyd, and a network of strong partners who have contributed to award-winning AAA games, music, and films, from Cyberpunk 2077 to Batman, Warner Bros, HBO, Universal, Netflix, and Disney. SYNTHTOPIA Rewards Of course, the project offers a range of rewards to its holders, categorized into different tiers based on the number of NFTs held &#8211; from TRAILBLAZER (1-4 NFTs) to PROMETHEUS (200+ NFTs). Each tier unlocks a unique set of benefits including but not limited to discounts on merchandise, special roles on Discord, exclusive access to events, earning passive income, and having a major influence over the project&#8217;s direction. For example, TRAILBLAZER holders can access discounts and participate in airdrops and raffles, whereas PROMETHEUS holders can receive signed designer toys, lifetime free access to all events, and the opportunity to co-create projects or influence the direction of major endeavours. Other notable privileges for intermediate tiers include: Executive producer credits for music/film Major involvement in project direction Character voice roles for movies and animations Collaborative opportunities with top-tier artists in the ecosystem The potential to become a project advisor Masterclasses from creative talent All-expense-paid trips to live shows Passive income from merchandise, video streaming, IP licensing Unique 1/1 art pieces tailored for the collector Token airdrops from the Synthtopia ecosystem (third party) Music team collaborations More dynamic utilities TBA More links on the project: Website: www.synthtopia.world Discord: https://discord.com/invite/cErcnDh2YM The very cool Live performance from ETH Toronto: https://www.youtube.com/live/UnIZlFrFWIY?si=js0D6SgRUVw1BRtm&#38;t=23105 VESA and QVANTVM are good friends and have collaborated on many projects. The soundtrack on VESA’s intro video was composed by QVANTVM. Switzerland ongoing right now Crypto Oasis home SWISS WEB3 EVENT Back to Switzerland. The ongoing Swiss Web3 Fest has established Switzerland as another Dubai-esque sizzle spot for all things Web3 and it was an honour to see how this maiden voyage to Switzerland facilitated a fantastic next chapter of VESA Digital, which is the Mirrors series Main player in the Swiss Web3 Fest is Arte Marketplace by Tokengate, an NFT platform associated with Crypto Oasis and the larger Arte community. Arte Marketplace is a highly curated platform that leverages the ecosystem. VESA’s new collection, Mirrors, is now featured on the platform, ready to be discovered. Check out Mirrors on the front page of Tokengate here. &#8220;Arbiter&#8221; is a motion artwork and now available as a 1/1 for 3.2424ETH Collect here Mind-Lama is an edition of 10 only available for 0.2919ETH Collect here THE MIRRORS SERIES The Mirrors started its lore at the Museum of the Future where it was the most collected artwork of the exhibition. A familiar face joining the Swiss Web3 Fest is Thomas Cermac from Cermac-Eisencraft gallery in the Czech Republic. His gallery that stands for impeccable taste and vision has represented VESA for a while now, and will soon be hosting the brand-new Mirrors- series at its location. More info on the Mirrors series here HER EXCELLENCY AND THE FINN TEAM  One of the most prestigious fine art events in Finland, the Night of the Arts, took place again mid-August. VESA exhibited notably at the event and one of our most treasured friends and patrons, Her Excellency Amna Fikri, the UAE Ambassador of Finland, attended the event called &#8220;Art Before AI&#8221; Her Excellency enjoyed the virtual reality version a selection of the Veena Malik project. The entire Finn Team was also in attendance. Anita ‘Krypto Granny’ Kalergis, Pekka Kelkka aka Papa Blockchain and Elias Ahonen are all Finnish Web3 professionals, who most of the year influence in Dubai, so this was a rare treat. VESA and the rest of the Finn Team want to thank Her Excellency for visiting the exhibit and sharing the evening with us.  WEB3 PLANS OF THE NATIONAL GALLERY OF FINLAND A fresh connection that kindled soon after returning to Finland courtesy of another Finnish Web3 enthusiast, Sointu Karjalainen, was meeting Johanna Eiramo, the Director of the Digital National Gallery in Finland. Johanna said that the iconic National Gallery is interested in energising its massive catalogue of works, digitizing, and possibly turning them into NFTs. We touched upon how these iconic institutions already have precious physical real estate and presence in the real world but are now turning their attention to their presence in the Metaverse and how to utilize technology going forward. We enjoyed the exhibit on the day and look forward to seeing what the future holds for this collaboration. VESA did a presentation at Sointu&#8217;s web3 gathering in Tampere in October THE DEEPEST WISH On a rare occasion, passion and profession collide. A community that has been incredibly important for team VESA is ISKCON, the International Society for Krishna Consciousness and especially our local Helsinki temple. During the biggest celebration of the year, the Sri Krishna Janmashtami, VESA presented a work called The Deepest Wish, portraying some of the spiritual themes paramount to a path of God consciousness. The objective was to auction the 1/10 artwork and donate the proceedings to the temple, since they had been struck with a large bill for the temple’s electrical repairs. To our great delight, after being introduced to the stage by the temple president Tapo Divyam Das, Mr. Veer Ji Wangoo immediately bought the 1/10 artwork and we got to connect with him off stage. Hopefully this project continues to serve the community and give thanks to God who ultimately gives us the talent and intelligence to pursue these extraordinary life paths. Let’s spring into this new season with energy, More on the Swiss Web3 journey soon, Keep your flag high, Lotta for V E S A Crypto &#38; NFT Artist All links to physical, NFTs, and more below http://linktr.ee/ArtByVesa"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-14T16:25:33.000Z",
    "title": "These Two Ethereum (ETH) Rivals Set to Surpass Cardano (ADA) and Offer Massive Investment Opportunities",
    "url": "https://www.crypto-news-flash.com/these-two-ethereum-eth-rivals-set-to-surpass-cardano-ada-and-offer-massive-investment-opportunities/?utm_source=rss&utm_medium=rss&utm_campaign=these-two-ethereum-eth-rivals-set-to-surpass-cardano-ada-and-offer-massive-investment-opportunities",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-117.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-117.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-117-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-117-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Polkadot and its sibling Kusama trump Cardano in GitHub development activity, according to Santiment. These findings underline the intensive efforts both platforms are investing to refine and innovate their projects. Blockchain Race Heats Up with New Contenders Leading blockchain analytics entity, Santiment, has thrown light on an intriguing trend in the crypto ecosystem. It appears [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-14T16:37:00.000Z",
    "title": "BTC Mining Embraces More Sustainable Energy Solutions: Crypto Analyst",
    "url": "https://coinedition.com/btc-mining-embraces-more-sustainable-energy-solutions-crypto-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Michael-Saylor-Defends-BTC-Mining.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Michael Saylor Defends BTC Mining\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Michael-Saylor-Defends-BTC-Mining.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Michael-Saylor-Defends-BTC-Mining-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Michael-Saylor-Defends-BTC-Mining-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Michael-Saylor-Defends-BTC-Mining-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Michael-Saylor-Defends-BTC-Mining-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Michael-Saylor-Defends-BTC-Mining-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Jamie Coutts, a crypto market analyst for Bloomberg, recently highlighted the rapid rise of sustainable energy sources in BTC mining. Coutts’ comments were in response to a new note on the Bloomberg Terminal, which cited data to contradict claims surrounding the heavy energy use associated with Bitcoin mining. Coutts took to X (formerly Twitter) earlier [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/btc-mining-embraces-more-sustainable-energy-solutions-crypto-analyst/\">BTC Mining Embraces More Sustainable Energy Solutions: Crypto Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]