[
  {
    "source": "NewsBTC",
    "date": "2023-10-08T13:40:37.000Z",
    "title": "Coinbase Ranks As Second Largest ETH Staking Entity As Lido’s Dominance Raises Concerns",
    "url": "https://www.newsbtc.com/news/ethereum/coinbase-ranks-as-second-largest-eth-staking-entity-as-lidos-dominance-raises-concerns/",
    "description": "Prominent crypto exchange Coinbase has emerged as the second largest ETH staking entity based on a recent scoop by Chinese reporter Colin Wu. This development comes amidst growing concerns about network centralization in regard to Lido’s dominance in the ETH staking market.  Related Reading: Is Ethereum’s Staking Boom A Ticking Time Bomb? JPMorgan Weighs In Coinbase Accounts For 14.1% Of ETH Staking Activity &#8211; Report According to Wu, a report from Dragonfly data scientist hildobby, using data from Dune analytics, reveals that Coinbase presently has 3.873 million staked ETH, representing 14.1% of all staked ETH.  Coinbase dominance in the ETH staking sphere is only superseded by that of the liquid staking platform, Lido DAO, which accounts for one-third of all staked ETH.  Other platforms with a significant staking percentage include the Binance and Kraken exchanges, with a 4.2% and 3.0% market share, respectively. Meanwhile, the Figment staking pool comes third with a 4.9% market dominance.  Notably, Coinbase experienced a 44% increase in ETH staking activity over the last six months. Coincidentally, this development falls within the period during which the Ethereum Shanghai upgrade has been active. Contrary to fears that the last Ethereum network update may induce a decline in staked ETH due to the ability to finally withdraw staked assets, the Shanghai upgrade has so far boosted stakers confidence, resulting in a net positive flow of 7.84 million ETH since its implementation in April. At the time of writing, the total amount of staked ETH stands at 27.42 million ETH, representing 22.81 of ETH’s circulating supply.  Related Reading: SSV Network Unveils Plan For Decentralized ETH Staking Infrastructure Lido’s Growing Dominance Sparks Centralization Concerns In other news, Wu stated there are community concerns about centralization in regard to Lido’s ETH staking dominance. Due to the Proof-of-Stake Consensus model, a higher amount of staked ETH translates to a higher voting power during governance processes.  Data from Dune Analytics shows that Lido accounts for 8.80 million staked ETH, representing 32.11% of the ETH staking market. Notably, the liquid staking platform experienced a 55% rise in staking activity over the last six months.  According to information from Ethereum&#8217;s official blog, concerns about centralization are quite valid, as any validator controlling a minimum of 33% of staked ETH can prevent the network from finalizing any block, even in the presence of a 66% majority. Moreover, if a validator acquires 55% of the staked ETH, they could theoretically split the Ethereum chain into two forks. All these are speculations, as there is no evidence indicating that Lido DAO has any malicious intentions toward the Ethereum network.  At press time, ETH trades at $1,620.18, with a 1.36% decline in the last day, based on data from CoinMarketCap. In tandem, the token’s daily trading volume is down by 36.41% and valued at $2.86 billion. ETH trading at $1,619.24 on the hourly chart &#124; Source: ETHUSDT chart on Tradingview.com Featured image from Ebunker, chart from Tradingview"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-08T14:08:00.000Z",
    "title": "Expert Explains Celsius Coming Crypto Distribution, Confirmation Hearing",
    "url": "https://coinedition.com/expert-explains-celsius-coming-crypto-distribution-confirmation-hearing/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/Independent-Group-Mandates-Celsius.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/Independent-Group-Mandates-Celsius.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/Independent-Group-Mandates-Celsius-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/Independent-Group-Mandates-Celsius-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/Independent-Group-Mandates-Celsius-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/Independent-Group-Mandates-Celsius-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/Independent-Group-Mandates-Celsius-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent YouTube livestream, prominent expert Simon Dixon, known to have been following the Celsius bankruptcy proceedings, provided crucial updates about the ongoing confirmation hearings and other significant developments.&#160; Specifically, Dixon sought to explain to stakeholders all they needed to know about the Celsius confirmation hearing alongside the upcoming substantive contribution hearings. Dixon intended [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/expert-explains-celsius-coming-crypto-distribution-confirmation-hearing/\">Expert Explains Celsius Coming Crypto Distribution, Confirmation Hearing</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]