[
  {
    "source": "Decrypt",
    "date": "2024-01-21T11:01:02.000Z",
    "title": "This Week on Crypto Twitter: Wall Street, Republican Candidates Embrace Crypto Ethos",
    "url": "https://decrypt.co/213609/this-week-on-crypto-twitter-wall-street-republican-candidates-embrace-crypto-ethos",
    "description": "Recent moves appear to have cemented Trump’s status as the most attractive presidential candidate for crypto"
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-21T11:01:31.000Z",
    "title": " Bitcoin ETFs amass 95,000 BTC in 6 days, approaching $4B AUM ",
    "url": "https://cointelegraph.com/news/bitcoin-etfs-amass-95-000-btc-in-6-days-approaching-4b-aum",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOGFhYWYwYTItNTQ2OC00NzFmLWFhMjctMzZmMTNiMGUzODNkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Among the nine ETFs, Fidelity’s (FBTC) and BlackRock's iShares (IBIT) have distinguished themselves, with both experiencing over $1.2 billion in inflows in the six days of trading.</p>\n                    <p><p>The nine approved spot Bitcoin exchange-traded funds (ETFs) now collectively hold 95,000 Bitcoin (BTC) after six full days of trading, with assets under management (AUM) approaching $4 billion.</p><p>In the data <a href=\"https://twitter.com/EricBalchunas/status/1748696162725458229\" target=\"_blank\" rel=\"noopener nofollow\">disclosed</a> by Eric Balchunas, a senior ETF analyst at Bloomberg, the capital influx into the nine recently launched ETFs has surpassed the outflows from the Grayscale Bitcoin Trust (GBTC). GBTC’s assets under management have decreased by $2.8 billion in the six days.</p><p>Among the nine ETFs, Fidelity’s (FBTC) and BlackRock's iShares (IBIT) have distinguished themselves, with both experiencing over $1.2 billion in inflows in the six days of trading. Although Fidelity’s ETF has slightly higher inflows, BlackRock's currently holds slightly more assets under management, with $1.4 billion compared to Fidelity’s nearly $1.3 billion.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-etfs-amass-95-000-btc-in-6-days-approaching-4b-aum\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-21T11:00:42.000Z",
    "title": "South African Fintech Startup Ukheshe Acquires 100% Stake in EFT Corporation",
    "url": "https://news.bitcoin.com/south-african-fintech-startup-ukheshe-acquires-100-stake-in-eft-corporation/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2037588638-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2037588638-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2037588638-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2037588638-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2037588638-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2037588638-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2037588638-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/shutterstock_2037588638.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />South African fintech startup Ukheshe recently announced that it has acquired a 100% stake in EFT Corporation, an Africa-focused payment services provider. According to the startup, the acquisition takes Ukheshe closer to its stated goal of attaining a larger footprint in Africa and beyond. Access to New Technologies and Markets The South African fintech startup, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-21T11:00:04.000Z",
    "title": "Innovative Augmented Reality Exhibit Revives Warwick’s Great Fire of 1694",
    "url": "https://www.cryptopolitan.com/augmented-reality-exhibit-revives-warwicks/",
    "description": "Warwick, UK &#8211; History enthusiasts and curious minds alike can now step back in time and witness a pivotal moment in Warwick&#8217;s history with the launch of an immersive augmented reality exhibit at the Market Hall Museum. Developed by leading augmented reality specialists, RiVR, this cutting-edge technology breathes life into the devastating Great Fire that [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-21T10:46:47.000Z",
    "title": "AI in Urban Governance: Balancing Potential and Concerns",
    "url": "https://www.cryptopolitan.com/ai-in-urban-governance-balancing-potential-and-concerns/",
    "description": "As AI technology continues to advance, its integration into urban governance raises questions about its impact on cities and their inhabitants. While AI holds promise for enhancing efficiency and sustainability, it also brings challenges and potential risks. The rise of AI urbanism In recent years, the concept of AI urbanism has emerged as a novel [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-21T10:50:17.000Z",
    "title": "Dogecoin (DOGE) Up By 11% As X Launches Dedicated Payment Account",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-doge-up-by-11-as-x-launches-dedicated-payment-account/",
    "description": "According to data from Coingecko, Dogecoin (DOGE) has soared by 10.5% in the last 24 hours, drawing much attention from market analysts and investors alike. Prior to this gain, the memecoin had shown little price movement, hovering around the $0.08 price region for most of the past week.  Dogecoin ranks as one of the top players in the crypto ecosystem, with a staggering market cap of $12.38 billion. The meme coin is particularly popular for its endorsements by famous figures such as Gene Simmons, Snoop Dogg, Mark Cuban and the world&#8217;s richest man Elon Musk. Related Reading: Dogecoin To See 24% Rally To $0.100 If This Holds: Analyst Behind’s DOGE Rise Interestingly, the current rise in DOGE’s price appears to be related to recent developments on Elon Musk’s social media platform X. On January 20, X launched a dedicated account for its X Payments initiative, a peer-to-peer payment service designed to enhance “user utility” and introduce “new opportunities for commerce”. Source: X The X Payments project was initially announced on January 9 as part of Elon Musk’s grand plan to position X as the “everything app”, providing a single interface which caters to user needs in terms of social media, advertising, content and video promotion, among others. DOGE’s reaction to the creation of the X Payments account is driven mainly by the potential role many investors believe the token may play in this payment system upon launch. Such expectations are mostly based on Elon Musk’s vocal and consistent support of the meme coin since as far back as 2019. Tesla, one of Elon Musk’s more valuable companies, already accepts payment in Dogecoin, and there are speculations the crypto asset could adopt a similar role in the X Payments project.  The potential of such incorporation could spell massive gains for DOGE in terms of adoption. According to X, its payment initiative is now registered in 32 states of the United States, securing a money transmitter license in 10.  However, it is worth stating that there are no statements or hints from credible officials that X Payments will indeed adopt DOGE as a settlement option following its expected launch in mid-2024. Alongside the memecoin, other cryptocurrencies being propped to act as payment options in X’s e-commerce feature include XRP, and Stellar (XLM), among others.  Related Reading: Top Analyst Anticipates Dogecoin Surge To $0.10, But There’s A Catch Dogecoin Price Overview  At the time of writing, DOGE trades at $0.0861, reflecting a 7.4% gain in the last seven and fourteen days. On the monthly chart, DOGE is down by 7.5% and has barely shown any growth in the last year, with a Year-To-Date (YTD) gain of 0.6%. As earlier stated, Dogecoin boasts of a market cap of  $12.38 billion, making it the 10th largest cryptocurrency. In addition, the memecoin’s daily trading volume is valued at around $1.17 billion. DOGE trading at $0.08584 on the daily chart &#124; Source: DOGEUSDT chart on Tradingview.com Featured image from Binance Academy, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-21T11:00:26.000Z",
    "title": "Sotheby’s Curates Bitcoin Sale; Top Investors Shift Focus to Decentraland and Borroe Finance",
    "url": "https://www.crypto-news-flash.com/sothebys-curates-bitcoin-sale-top-investors-shift-focus-to-decentraland-and-borroe-finance/?utm_source=rss&utm_medium=rss&utm_campaign=sothebys-curates-bitcoin-sale-top-investors-shift-focus-to-decentraland-and-borroe-finance",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-20T102052.757.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-20T102052.757.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-20T102052.757-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-20T102052.757-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-20T102052.757-450x253.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Bitcoin continues to take center stage in the crypto market after leading art auction platform Sotheby’s decided to roll out its first curated sale that comprises BTC ordinals and rare Satoshis. Meanwhile, investors continue giving Borroe Finance ($ROE) and Decentraland (MANA) a watchful eye based on these networks’ high adoption rates. &#62;&#62;BUY $ROE TOKENS NOW&#60;&#60; [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-21T10:44:42.000Z",
    "title": "Whales selling Solana (SOL) to buy this alternative token set to reach $16 and currently priced at only $0.08",
    "url": "https://www.crypto-news-flash.com/whales-selling-solana-sol-to-buy-this-alternative-token-set-to-reach-16-and-currently-priced-at-only-0-08/?utm_source=rss&utm_medium=rss&utm_campaign=whales-selling-solana-sol-to-buy-this-alternative-token-set-to-reach-16-and-currently-priced-at-only-0-08",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-21T133215.302.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-21T133215.302.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-21T133215.302-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-21T133215.302-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-21T133215.302-450x253.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the cryptocurrency realm, a noteworthy phenomenon is unfolding, seizing the interest of both seasoned investors and market enthusiasts. Whales, the influential individuals or entities with substantial holdings, are purportedly shifting their investments away from Solana (SOL) and redirecting their attention toward an emerging contender in the crypto space – Retik Finance (RETIK). Priced at [...]"
  }
]