[
  {
    "source": "BTCManager",
    "date": "2023-07-04T22:01:42.000Z",
    "title": "Fintech giant Nium, valued at $2b, sets sights on US IPO amid Ripple’s legal battle",
    "url": "https://crypto.news/fintech-giant-nium-valued-at-2b-sets-sights-on-us-ipo-amid-ripples-legal-battle/",
    "description": "Nium, a Ripple partner valued at $2 billion, is gearing up for a momentous move as it unveils plans to go public in the United States."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-04T22:00:30.000Z",
    "title": "Litecoin Primed For 13% Rally Soon Upon Breaking Past This Level",
    "url": "https://www.newsbtc.com/news/litecoin/litecoin-primed-for-13-rally-soon-upon-breaking-past-this-level/",
    "description": "Litecoin has demonstrated a consistently positive trend in recent weeks, reflecting a strong market sentiment. As the broader market has gained strength in recent trading sessions, Litecoin has managed to sustain its gains. The price of Bitcoin has surpassed $31,000 at present, resulting in an upward movement for other altcoins as well. Related Reading: XRP, Cardano Among Altcoins To Keep An Eye On: Santiment While Litecoin has not experienced significant changes in the past 24 hours, it has maintained a positive trajectory. On a weekly chart, however, the altcoin has surged by over 20%. This remarkable recovery began in June when Litecoin broke through the $70 price mark, and since then, the coin has gained more than 50%. From a technical outlook, the Litecoin outlook aligns with the bullish sentiment. Both demand and accumulation indicators on the chart have remained high, suggesting the possibility of further gains. However, there is an important resistance to consider. In the upcoming days, Litecoin is expected to experience a surge due to its halving event scheduled for 3rd August 2023. Additionally, the market capitalization of Litecoin has also improved, indicating an increase in demand for the cryptocurrency. Litecoin Price Analysis: One-Day Chart At the time of writing, LTC was priced at $106. Although the altcoin is below its resistance level of $108, this particular level is not the main obstacle. The crucial challenge for Litecoin lies in gaining sufficient strength to surpass the $115 resistance, a level at which the coin has historically faced rejection. In April of the previous year, Litecoin approached this level but could not sustain trading above it for the remainder of the year. Conversely, if Litecoin fails to break through the $115 resistance, it could experience a decline toward the $103 support level. Further downward movement from this point would bring LTC below the $100 mark, indicating a complete invalidation of the bullish intent. Technical Analysis The price surge from the $90 level in Litecoin has significantly bolstered investor confidence. The Relative Strength Index (RSI) indicator reached the overvalued zone, indicating increased buying activity. Although it retraced slightly from the overbought territory, it remained above the 60-mark, indicating sustained buying strength in the market. Furthermore, the LTC price movement was supported because it remained above the 20-Simple Moving Average (SMA) line. This suggests that buyers have assumed market control and are driving the price momentum. The Moving Average Convergence Divergence (MACD) indicator formed tall green histograms, indicating favorable buy signals for LTC. This suggests the potential for continued bullishness in the market. Additionally, the Bollinger Bands on the chart were wide open, indicating increased price volatility. The upper band coincided with one of the resistance levels at $108. Related Reading: Avalanche Stuck In A Range, Potential Shift Ahead If This Occurs This suggests that LTC will likely encounter price fluctuations and may face a barrier at the mentioned resistance level. The next trading sessions remain crucial for the altcoin. Featured image from UnSplash, charts from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-04T22:04:02.000Z",
    "title": "US Bank Paying $9,000,000 Fine for Allegedly Forcing Customers to Endure Illegal Credit Card and Billing Practices",
    "url": "https://dailyhodl.com/2023/07/04/us-bank-paying-9000000-fine-for-allegedly-forcing-customers-to-endure-illegal-credit-card-and-billing-practices/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/credit-card-dollar.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/credit-card-dollar.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/credit-card-dollar.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/credit-card-dollar.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/credit-card-dollar.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/credit-card-dollar.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/credit-card-dollar.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>One of the largest banks in the US will pay a $9 million for allegedly forcing its customers to suffer through illegal credit card and billing practices. The Consumer Financial Protection Bureau (CFPB) says Citizens Bank, which operates in 14 states and has $222 billion in assets, failed to properly respond to customers’ credit card [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/04/us-bank-paying-9000000-fine-for-allegedly-forcing-customers-to-endure-illegal-credit-card-and-billing-practices/\">US Bank Paying $9,000,000 Fine for Allegedly Forcing Customers to Endure Illegal Credit Card and Billing Practices</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-04T22:01:13.000Z",
    "title": "Majority of Canadians Willing To Use CBDC, Believe Their Privacy Will Be Guarded: Survey",
    "url": "https://dailyhodl.com/2023/07/04/majority-of-canadians-willing-to-use-cbdc-believe-their-privacy-will-be-guarded-survey/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/law-inforcement-metaverse.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/law-inforcement-metaverse.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/law-inforcement-metaverse.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/law-inforcement-metaverse.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/law-inforcement-metaverse.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/law-inforcement-metaverse.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/law-inforcement-metaverse.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The majority of citizens in the second-largest North American economy are willing to put their trust in a central bank digital currency (CBDC). According to a survey performed by WealthRocket, nearly 60% of surveyed Canadians say they are open to the idea of a CBDC. &#8220;59% of Canadians are willing, to varying degrees, to use [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/04/majority-of-canadians-willing-to-use-cbdc-believe-their-privacy-will-be-guarded-survey/\">Majority of Canadians Willing To Use CBDC, Believe Their Privacy Will Be Guarded: Survey</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]