[
  {
    "source": "Cointelegraph",
    "date": "2023-09-19T03:26:50.000Z",
    "title": "Former Andreessen Horowitz execs launch Bastion after $25M funding round",
    "url": "https://cointelegraph.com/news/former-andreessen-horowitz-execs-launch-bastion-after-seed-funding-round",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/caa8283d-0aac-46af-a309-1dfc575122bb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Web3 startup came out of stealth mode after a seed funding round led by a16z crypto, enabling firms to integrate web3 infrastructure into their existing enterprise technologies. </p>\n                    <p><p>Two former executives from Andreessen Horowitz (a16z)’s crypto division have managed to raise $25 million in seed funding for their newly launched Web3 startup Bastion — despite the recent drought in venture capital funding. </p><p>On Sept. 18, the new firm, Bastion, <a href=\"https://www.prnewswire.com/news-releases/former-andreessen-horowitz-executives-launch-bastion-announce-25m-in-seed-financing-301930764.html\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> the launch of its product suite. The firm’s goal is to enable companies to integrate <a href=\"https://cointelegraph.com/learn/what-is-web-3-0-a-beginners-guide-to-the-decentralized-internet-of-the-future\">Web3</a> infrastructure into their existing enterprise technologies.</p><p>Bastion was co-founded by two former executives with a16z’s crypto division, including former chief technology officer Riyaz Faizullabhoy and former chief security officer Nassim Eddequiouaq who left the firm in April.</p><p>The $25 million funding round was led by their former employer, a16z crypto. Nomura Group’s Laser Digital Ventures, Robot Ventures, <a href=\"https://cointelegraph.com/news/aptos-token-surges-after-partner-microsoft\">Aptos</a> Ventures, and Alchemy Ventures, were also investors in the seed funding round. </p><p>In a statement, Bastion said the funding will be used to scale company operations, recruit top engineering talent, and secure additional licensing to further diversify its product offerings.</p><p>Bastion co-founder Faizullabhoy added that the successful funding round came despite an ongoing crypto winter. </p><blockquote>“It was clear that even as crypto came back down into another bear market, this time crypto is very much here to stay.”</blockquote><p>Crypto venture funding has fallen dramatically this year. According to <a href=\"https://defillama.com/raises\" target=\"_blank\" rel=\"noopener nofollow\">DefiLlama</a>, there was just $283 million in fundraising in August. This is down 68% from the $877 in crypto venture funding in February. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/web-3-andreessen-horowitz-exec-sees-promising-paths-for-web3-social-platforms-eth-cc-6\"><strong><em>Andreessen Horowitz exec sees ‘promising paths’ for Web3 social platforms</em></strong></a></p><p>Bastion will offer <a href=\"https://cointelegraph.com/news/crypto-report-the-crypto-custody-market-reached-448-billion-in-2022\">custody</a> services, digital asset transactions, and wallets.</p><p>Bastion co-founder Eddequiouaq commented, “We founded Bastion to enable businesses to onboard their products and end-users into a web3 environment without the complicated, overwhelming experience we know today.”</p><p>While Arianna Simpson, general partner of a16z crypto <a href=\"https://a16zcrypto.com/posts/announcement/investing-in-bastion/\" target=\"_blank\" rel=\"noopener nofollow\">said</a>, “We believe in Nass and Riyaz’s vision of making web3 safe and accessible for companies in every industry and are extremely excited to support them in making it a reality.”</p><p>Earlier this month, a16z <a href=\"https://a16zcrypto.com/posts/announcement/investing-in-story-protocol/\" target=\"_blank\" rel=\"noopener nofollow\">led</a> a funding round for blockchain-based intellectual property (IP) ownership platform Story Protocol which raised $54 million.</p><p>In June the firm <a href=\"https://cointelegraph.com/news/a16z-open-london-office-international-expansion\">announced</a> the opening of a new London office amid ongoing regulatory pressure in the United States. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/6-questions-kei-oda-cryptocurrency/\">6 Questions for Kei Oda: From Goldman Sachs to cryptocurrency</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-19T03:30:56.000Z",
    "title": "From MATIC to POL: Polygon’s 2.0 Upgrade Targets Internet-Level Scalability",
    "url": "https://news.bitcoin.com/from-matic-to-pol-polygons-2-0-upgrade-targets-internet-level-scalability/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/cc-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"From MATIC to POL: Polygon&#039;s 2.0 Upgrade Targets Internet-Level Scalability\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/cc-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/cc-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/cc-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/cc-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/cc-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/cc-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/cc-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Details have been released about Polygon’s upcoming upgrade, Polygon 2.0. The company, known for its Ethereum scaling solutions, has introduced a few Polygon improvement proposals (PIPs) as part of its shift to a network of interconnected zero-knowledge-powered chains. Polygon 2.0 Unveiled in 3 PIPs According to the announcement, Polygon 2.0 focuses on scalability and interoperability [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-19T03:13:16.000Z",
    "title": "Bitcoin Price Sees Technical Correction, Here’s What Could Propel It Back To $28K",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-propel-to-28k/",
    "description": "Bitcoin price climbed higher and tested the $27,500 resistance. BTC is correcting gains, but it could start another increase unless there is a move below $26,500. Bitcoin is holding gains above the $26,500 support level. The price is trading above $26,550 and the 100 hourly Simple moving average. There is a key bullish trend line forming with support near $26,600 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start another increase if it stays above the $26,500 support zone. Bitcoin Price Eyes Another Increase Bitcoin price remained in a positive zone above the $26,200 resistance zone. BTC started a fresh increase and cleared the $26,500 resistance zone. There was a strong push above the $27,000 level before the bears appeared near $27,500. A high was formed near $27,468 and the price recently corrected gains. There was a drop below the $27,000 level. The price declined below the 50% Fib retracement level of the upward move from the $26,412 swing low to the $27,468 high. Bitcoin is now trading above $26,550 and the 100 hourly Simple moving average. There is also a key bullish trend line forming with support near $26,600 on the hourly chart of the BTC/USD pair. The price is now holding the 76.4% Fib retracement level of the upward move from the $26,412 swing low to the $27,468 high. It is consolidating gains and might eye a fresh increase. Immediate resistance on the upside is near the $26,950 level. The first major resistance is near the $27,500 zone, above which the price could gain pace. The next key resistance could be near the $28,200 level. A clear move above the $28,200 resistance could send the price toward the $29,000 resistance. Source: BTCUSD on TradingView.com The next major resistance is near $29,500, above which the bulls could gain strength. In the stated case, the price could test the $30,000 level. More Downsides In BTC? If Bitcoin fails to start a fresh increase above the $26,950 resistance, it could continue to move lower. Immediate support on the downside is near the $26,600 level and the trend line. The next major support is near the $26,500 level. A downside break and close below the $26,500 level might send the price toward the next support at $26,000. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now near the 50 level. Major Support Levels – $26,600, followed by $26,500. Major Resistance Levels – $26,950, $27,200, and $27,500."
  }
]