[
  {
    "source": "Cointelegraph",
    "date": "2023-11-21T04:47:53.000Z",
    "title": "Apple sued for blocking crypto tech for P2P payments",
    "url": "http://cointelegraph.com/news/apple-sued-over-crypto-payment-tech-blocks",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/ff14cb2b-c9b7-46f6-a95b-db61a4d44772.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Apple faces a class action over alleged anti-competitive conduct in the iOS peer-to-peer payments market.</p>\n                    <p><p>Disgruntled consumers have filed a class-action lawsuit against Apple claiming the tech giant has conspired to limit peer-to-peer payment options on its devices and block crypto technology from iOS payments apps.</p><p>The Nov. 17 complaint filed in a California District Court alleges Apple entered into anti-competitive agreements with PayPal’s <a href=\"https://cointelegraph.com/news/how-to-buy-bitcoin-with-venmo\">Venmo</a> and Block’s <a href=\"https://cointelegraph.com/news/how-to-buy-bitcoin-with-cash-app\">Cash App</a> to restrict the use of decentralized cryptocurrency technology in payment apps, which caused users to pay \"rapidly inflating prices.\"</p><p>“These agreements limit feature competition—and the price competition that would flow from it—marketwide, including by barring the incorporation of decentralized cryptocurrency technology within existing or new iOS Peer-to-Peer Payment apps,” the filing says.</p><p>The plaintiffs also claimed Apple uses “technological and contractual restraints,” including hardware-enforced App Store exclusivity and “contractual limitations on web browser technology” to “exercise unfettered control over every app installed and run on iPhones and iPads.” </p><p>With these restraints, Apple can — and does — force new to market iOS P2P payment apps to bar crypto \"as a condition for entry,\" the suit claimed.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/d253d560-9ca4-450d-b08d-bfd9c83a5a25.jpg\"  /><figcaption style=\"text-align: center;\"><em>Excerpt of the suit alleging Apple restricts decentralized payment technology. Source: PACER</em></figcaption></figure><p>The plaintiffs describe themselves as customers who have paid inflated fees due to Apple’s restraints of trade across the iOS P2P payment market. </p><p>They seek to recover for excessive fees and overcharging due to Apple’s alleged anticompetitive conduct and injunctive relief barring the firm from continuing to enter into and enforce anticompetitive agreements restraining iOS P2P Payment Market competitors and would-be entrants.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/apple-tax-rules-remain-for-now-epic-games-crypto-nfts\"><strong><em>Apple’s 30% tax rules will stay for now, crypto and NFTs may have to wait</em></strong></a></p><p>The 58-page class action details the history and rise of peer-to-peer payment apps and decentralized cryptocurrencies and Apple’s entry into this market. </p><p>In April, the Court of Appeals for the Ninth Circuit <a href=\"https://cointelegraph.com/news/apple-s-outside-payments-ban-upheld-as-unlawful-in-likely-win-for-nfts-and-crypto\">ruled Apple violated</a> California’s competition laws by not allowing apps to direct users to non-Apple linked payment solutions.</p><p><strong><em>Magazine:</em></strong><a href=\"https://cointelegraph.com/magazine/6-questions-for-lugui-tillier-about-bitcoin-ordinals-and-the-future-of-crypto/\"><strong><em> </em></strong><strong><em>6 Questions for Lugui Tillier about Bitcoin, Ordinals, and the future of crypto</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-21T05:01:39.000Z",
    "title": "Blockchain Festival Asia 2024: Uniting the World’s Leading Innovators in Blockchain Technology",
    "url": "https://www.cryptopolitan.com/blockchain-festival-asia-2024-uniting-the-worlds-leading-innovators-in-blockchain-technology/",
    "description": "November 13, 2023 &#8211; Blockchain enthusiasts, investors, and industry leaders will converge in a celebration of technological innovation and the future of blockchain at the highly anticipated Blockchain Festival Asia, set to take place on 2 March 2024 at The Marina Bay Sands Convention Center, Singapore. This most anticipated event promises to be the most ... <a title=\"Blockchain Festival Asia 2024: Uniting the World&#8217;s Leading Innovators in Blockchain Technology\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blockchain-festival-asia-2024-uniting-the-worlds-leading-innovators-in-blockchain-technology/\" aria-label=\"More on Blockchain Festival Asia 2024: Uniting the World&#8217;s Leading Innovators in Blockchain Technology\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-21T04:52:49.000Z",
    "title": "BNB Price Momentum Reignites – Why Bulls Could Aim For 15% Rally",
    "url": "https://www.newsbtc.com/analysis/bnb/bnb-price-momentum-reignites-268/",
    "description": "BNB price gained momentum and climbed above the $250 resistance. It is up over 5% and the bulls could soon aim for a move toward the $300 level. BNB price is moving higher above the $250 resistance. The price is now trading above $255 and the 100 simple moving average (4 hours). There is a major bullish trend line forming with support at $253.5 on the 4-hour chart of the BNB/USD pair (data source from Binance). The pair might continue to move up if there is a clear move above $268. BNB Price Jumps 8% These past few days, BNB price remained stable above the $240 resistance. The bulls stepped in and were able to clear a major hurdle at $250. It opened the doors for more upsides above $255. BNB gained traction and climbed above $260. It is up over 5% and outperforming both Bitcoin and Ethereum. A new multi-week high is formed near $267.9 and the price is now consolidating gains. It is above the 23.6% Fib retracement level of the upward move from the $238.9 swing low to the $267.9 high. BNB is also trading above $255 and the 100 simple moving average (4 hours). Besides, there is a major bullish trend line forming with support at $253.5 on the 4-hour chart of the BNB/USD pair. Source: BNBUSD on TradingView.com If there is a fresh increase, the price could face resistance near the $265 level. The next resistance sits near the $268 level. A clear move above the $268 zone could send the price further higher. In the stated case, BNB price could test $280. A close above the $280 resistance might set the pace for a larger increase toward the $300 resistance. Downside Correction? If BNB fails to clear the $265 resistance, it could start a downside correction. Initial support on the downside is near the $260 level. The next major support is near the $255 level. The main support sits at $253 or the trend line. It is close to the 50% Fib retracement level of the upward move from the $238.9 swing low to the $267.9 high. If there is a downside break below the $253 support, the price could drop toward the $245 support. Any more losses could initiate a larger decline toward the $238 level. Technical Indicators 4-Hours MACD – The MACD for BNB/USD is gaining pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for BNB/USD is currently above the 50 level. Major Support Levels – $260, $255, and $253. Major Resistance Levels – $265, $268, and $280."
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-11-21T04:40:17.000Z",
    "title": "Understanding and Mitigating Economic Risks in DeFi Lending Platforms",
    "url": "https://dailyhodl.com/2023/11/20/understanding-and-mitigating-economic-risks-in-defi-lending-platforms/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/12/bank-defi-warning.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/12/bank-defi-warning.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/12/bank-defi-warning.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/12/bank-defi-warning.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/12/bank-defi-warning.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/12/bank-defi-warning.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/12/bank-defi-warning.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The DeFi sector provides unparalleled opportunities for capital management. However, exercising this freedom requires conducting thorough research and evaluating the risks associated with depositing funds into a particular protocol. And the fact that this market is rather opaque in its structure and lacks in the way of sophisticated risk management tools means that the task [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/11/20/understanding-and-mitigating-economic-risks-in-defi-lending-platforms/\">Understanding and Mitigating Economic Risks in DeFi Lending Platforms</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]