[
  {
    "source": "Cointelegraph",
    "date": "2023-06-29T01:53:44.000Z",
    "title": "Hester Peirce: US crypto laws can’t assume ‘everything is a financial asset’",
    "url": "https://cointelegraph.com/news/hester-peirce-dont-label-all-crypto-financial-asset",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/63419b39-dca1-4676-9a50-0ba96efae0bd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>SEC commissioner Hester Peirce discussed a possible U.S. crypto legal framework, giving a reminder that not all uses are financial.</p>\n                    <p><p>Cryptocurrency laws in the United States should be “reserved” and not regulate the technology as though every use is financial, argues a commissioner at the U.S. Securities and Exchange Commission.</p><p>On June 29, Commissioner Hester Peirce — dubbed “Crypto Mom” — appeared remotely at <a href=\"https://cointelegraph.com/news/bitcoin-btc-price-surge-driven-retail-fireblocks-ceo\">Australian Blockchain Week</a> and was asked how she would regulate crypto, answering:</p><blockquote>“I think we have to make sure that whatever regulatory framework you have doesn't just assume that everything is a financial asset.”</blockquote><p>Peirce explained while crypto is thought of in “very financial terms” <a href=\"https://cointelegraph.com/news/100-teslas-democratize-and-decentralize-web3-ride-sharing\">other uses exist</a> such as enabling people to interact without requiring a centralized entity.</p><p>“That's useful in the financial context, but it's also useful in building a social media platform or whatever else,” she said.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Protecting investors is important, but the government needs to have a good reason to prevent people from investing their own money as they choose: <a href=\"https://t.co/QgPm38iSrp\">https://t.co/QgPm38iSrp</a></p>&mdash; Hester Peirce (@HesterPeirce) <a href=\"https://twitter.com/HesterPeirce/status/1673812153369763844?ref_src=twsrc%5Etfw\">June 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Peirce believes any legal framework should take “a reserved approach” but include “enough clarity that people feel that they can try things.”</p><blockquote>“There is something to be said for not putting a framework in place that is so inflexible that it doesn't accommodate the new uses of crypto and blockchain.”</blockquote><p>In a seeming swipe at the SEC’s current approach — which many have criticized <a href=\"https://cointelegraph.com/news/kraken-down-sec-commissioner-rebukes-own-agency-over-recent-action\">including Peirce</a> — the commissioner said the laws “can't be reserved then, all of a sudden, [regulators] come in five years later with a bunch of enforcement actions.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/gary-gensler-hurting-little-guys-for-wall-street\"><strong><em>Gary Gensler is hurting the little guys for Wall Street</em></strong></a></p><p>Asked about her crypto advocacy, Peirce said she thinks the SEC “can do better” and believes if she can't speak freely, “then I don't know why I'm in that position.”</p><p>“Crypto presents [the SEC] an opportunity to rethink how we approach innovation [...] I really think we've been taking an approach that is not appropriate,” she said.</p><p>Alluding to the collapse of FTX and the <a href=\"https://cointelegraph.com/news/ftx-recovered-7b-assets-has-almost-2b-to-go-to-cover-misappropriations\">allegations of misconduct</a> that followed, Peirce advised the crypto industry to undertake self-regulation and pay attention to counterparty risks, conflicts of interest and leverage.</p><p>“Those are things you don't need a government regulator to tell you to do, but I think government regulators can play a role in that.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-miami-2023-shitcoins-for-bitcoin/\"><strong><em>Bitcoin 2023 in Miami comes to grips with ‘shitcoins on Bitcoin’</em></strong></a><strong><em> </em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-29T01:44:06.000Z",
    "title": "Italy’s central bank calls for framework to prevent stablecoin runs",
    "url": "https://cointelegraph.com/news/bank-of-italy-urge-regulation-prevent-stablecoin-runs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/1129d6b6-aab0-4058-a376-1a3243aeff29.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bank of Italy is calling for closer regulator scrutiny of stablecoins, which they say “have not proved stable at all.”</p>\n                    <p><p>Italy’s top banking authority has called for a “robust, risk-based” regulatory framework for stablecoins, which could help prevent a worst case scenario — a “run” on stablecoins. </p><p>The central bank’s recently <a href=\"https://www.bancaditalia.it/pubblicazioni/mercati-infrastrutture-e-sistemi-di-pagamento/approfondimenti/2023-038/N.38-MISP.pdf?language_id=1\" target=\"_blank\" rel=\"noopener nofollow\">released</a> <em>Markets, Infrastructures and Payment Systems</em> report for June 2023 has called on regulators to apply the same financial conduct standards to stablecoin issuers in the industry.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Bankitalia?src=hash&amp;ref_src=twsrc%5Etfw\">#Bankitalia</a>  <a href=\"https://twitter.com/hashtag/26June?src=hash&amp;ref_src=twsrc%5Etfw\">#26June</a> Alessandra <a href=\"https://twitter.com/hashtag/Perrazzelli?src=hash&amp;ref_src=twsrc%5Etfw\">#Perrazzelli</a> discussed about the evolving regulatory landscape for <a href=\"https://twitter.com/hashtag/DigitalAssets?src=hash&amp;ref_src=twsrc%5Etfw\">#DigitalAssets</a> at <a href=\"https://twitter.com/pointzeroforum?ref_src=twsrc%5Etfw\">@pointzeroforum</a> Panel “State of Global Digital Asset Regulation: Navigating Opportunities in an Evolving Landscape”<a href=\"https://twitter.com/hashtag/PZF2023?src=hash&amp;ref_src=twsrc%5Etfw\">#PZF2023</a> <a href=\"https://twitter.com/hashtag/PointZeroForum?src=hash&amp;ref_src=twsrc%5Etfw\">#PointZeroForum</a> <a href=\"https://twitter.com/sif_sfi?ref_src=twsrc%5Etfw\">@sif_sfi</a> <a href=\"https://twitter.com/elevandi?ref_src=twsrc%5Etfw\">@elevandi</a> <a href=\"https://t.co/Jm0OBeifZh\">pic.twitter.com/Jm0OBeifZh</a></p>&mdash; Banca d&#39;Italia (@bancaditalia) <a href=\"https://twitter.com/bancaditalia/status/1673310957743886336?ref_src=twsrc%5Etfw\">June 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The bank said the rise of cryptocurrencies, coupled with several “boom and bust cycles” in a largely unregulated environment has caused “significant consumer harm.”</p><p>Regulatory attention on stablecoin issuers in particular should be a priority because of its close connection to DeFi, the bank said:</p><blockquote>“A robust, risk-based regulation of stablecoins ensuring the prevention of ‘runs’ on their issuers is a necessary condition to reduce the fragility of the DeFi ecosystem, given the prominent role of this asset class in decentralized finance.”</blockquote><p>“It is crucial that policy interventions on stablecoins and DeFi are well synchronized since the diffusion of stablecoins [...] is likely to spur new waves of DeFi innovation and increase the interconnection between traditional and decentralized finance,” it added.</p><p>The Italian banking authority also noted that stablecoins “have not proved stable at all” — citing the most notable <a href=\"https://cointelegraph.com/news/terra-luna-crash-anniversary-community-reflects-on-the-lessons-learned\">collapse of Terra’s algorithmic stablecoin</a> TerraClassicUSD (USTC) in May 2022.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The adoption of <a href=\"https://twitter.com/hashtag/DLT?src=hash&amp;ref_src=twsrc%5Etfw\">#DLT</a> solutions, especially if featured by weak organizational structures, could undermine the financial system due to lack of controls, lack of specific rules as mitigation tools, interdependence among regulated and non-regulated entities. The fragmentation is…</p>&mdash; Banca d&#39;Italia (@bancaditalia) <a href=\"https://twitter.com/bancaditalia/status/1673585423644237825?ref_src=twsrc%5Etfw\">June 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The bank said the industry also needs to debunk “the decentralization illusion” by acknowledging that most decentralized protocols are <a href=\"https://cointelegraph.com/news/defi-regulations-where-us-regulators-should-draw-the-line\">operated by core stakeholders</a> who can often “extract ownership benefits.”</p><p>“Such projects should be brought back to traditional, accountable business structures as a pre-condition for operating in the regulated financial sector,” the bank added.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/open-ai-chat-gpt-re-enters-italy-after-obliging-transparency-demands\"><strong><em>OpenAI’s ChatGPT reenters Italy after obliging transparency demands </em></strong></a></p><p>The bank however stressed that it isn’t necessary to subject every crypto asset or activity to financial services regulation:</p><blockquote>“Not all crypto activities and not all forms of crypto-assets need to be covered or should be covered by financial sector regulation, in particular where their issuance, trading and holding do not serve customers’ financial needs through a payment or investment function.”</blockquote><p>Among the non-financial use cases enabled by blockchain are <a href=\"https://cointelegraph.com/explained/what-is-decentralized-identity-in-blockchain\">decentralized identification,</a> real estate, supply chain, voting and <a href=\"https://cointelegraph.com/news/putting-carbon-credits-on-blockchain-won-t-solve-the-problem-alone-davos\">carbon credits.</a></p><p>Italy’s central bank has also called for countries to cooperate and establish an international regulatory framework because the technology operates irrespective of nation state borders.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\"><strong><em>Unstablecoins: Depegging, bank runs and other risks loom</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-29T02:00:52.000Z",
    "title": "FTT Flies 45% On Rumors Of FTX Planned Relaunch",
    "url": "https://www.newsbtc.com/ftx/ftt-flies-45-on-rumors-of-ftx-planned-relaunch/",
    "description": "FTT, the native currency of FTX and its ecosystem, is up 45% when writing on June 28. This positive price action follows a report by the Wall Street Journal that the exchange’s new management has started receiving proposals from parties interested in restarting the exchange. The unconfirmed report cited the chief executive officer, John J. Ray III, who took over FTX when it officially filed for bankruptcy in mid-November 2022. Will FTX Be Restarted? Sources report that the management team of the cryptocurrency exchange has been in discussions with investors interested in seeing the platform back up and running.  Different ownership and management structures are being considered as part of this effort. A joint venture is one option, which would involve compensating existing clients affected by the FTX bankruptcy through stakes in the new organization. Additionally, when the exchange is relaunched, it will operate under a new brand name to improve its reputation and regain trust. Related Reading: BNB Market Cap Down By 25% In June Amidst Binance Regulatory Pressure Rumors of this restart are six months after Ray III said he was setting up a task force to explore resuming operations. The CEO also added that despite the alleged illegal activities committed by executives, mainly Sam Bankman-Fried and Alameda Research, the exchange’s business model was feasible. A restructuring and a restart of the exchange, observers note, will be a better outcome for its millions of clients who were adversely affected after the exchange unexpectedly filed for bankruptcy last year. Following the collapse of FTX, the cryptocurrency market tanked, with Bitcoin and Ethereum sinking to new 2022 lows. In a bear market of last year, the FTX collapse forced BTC prices below $16k.  At the same time, FTT, the native currency of FTX, sank 92%. Despite the current expansion, the token is far from its October 2021 highs when each FTT was changing hands at over $69. When writing on June 28, FTT is trading at $1.73 with a market capitalization of $576,331,728. Charges Against Sam Bankman-Fried And Alameda Research Sam Bankman-Fried, the founder of FTX, is charged with wire fraud, commodities fraud, money laundering, and bribery, among others, following an investigation by the United States Commodity Futures Trading Commission (CFTC). The agency sought to discover whether FTX and Alameda Research knowingly engaged in market manipulation and if there was a conflict of interest. The CFTC also alleges that FTX and its trading wing, Alameda Research, failed to disclose their trading activities to clients while using their funds to support FTT prices.  Related Reading: Michael Saylor Doubles Down On Bitcoin, Adds 12,333 BTC To MicroStrategy’s Holdings Amid this, Bankman-Fried is accused of using Alameda funds to cover his expenses, including donating $10 million to a political party. He has pleaded not guilty to all charges, and a trial is planned for October 2023. Feature Image From Canva, Chart From TradingView"
  }
]