[
  {
    "source": "Cointelegraph",
    "date": "2023-06-03T21:49:13.000Z",
    "title": "Warren’s alleged work with short-seller shows anti-crypto army heating up",
    "url": "https://cointelegraph.com/news/warren-s-alleged-work-with-short-seller-shows-anti-crypto-army-heating-up",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/79dd824b-da4f-4998-948e-5ea256d24657.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Elizabeth Warren reportedly took advice from Wall Street short-seller Marc Cohodes, who cashed in on the collapse of Silvergate and Signature banks.</p>\n                    <p><p>What do progressive Democrats, Republican national security hawks and Wall Street traders have in common? They are all apparently enlisting in United States Senator Elizabeth Warren’s “anti-crypto army.” The progressive senator’s <a href=\"https://fortune.com/crypto/2023/03/31/the-curious-tale-of-elizabeth-warren-and-the-short-seller/\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> alliance with Marc Cohodes, a Wall Street short-seller who profited from the recent carnage at crypto banks, is the latest example. </p><p>Crypto natives likely see the unusual pairing as further proof that entrenched interests are conspiring to kill <a href=\"https://cointelegraph.com/blockchain-for-beginners/what-is-web-3-0-a-beginners-guide-to-the-decentralized-internet-of-the-future\">Web3</a> in the United States. They aren’t entirely wrong, but America’s polarized factions are uniting against crypto for a reason. The industry has consistently failed to address valid concerns about financial crime and national security. That needs to change, or Warren’s anti-crypto army will continue attracting recruits.</p><h2>Publicly traded crime scene?</h2><p>In late 2022, Cohodes circulated a memo on Capitol Hill flagging “existential” regulatory risks at Silvergate, a crypto-friendly bank. The short-seller dubbed the bank a “publicly traded crime scene” and claimed, among other things, that Silvergate had “huge” <a href=\"https://cointelegraph.com/news/know-thy-customer-the-future-of-kyc-in-crypto\">Know Your Customer (KYC)</a> and <a href=\"https://cointelegraph.com/news/aml-and-kyc-a-catalyst-for-mainstream-crypto-adoption\">Anti-Money Laundering (AML)</a> liabilities. These rules require U.S. financial institutions to carefully due-diligence their customers, and they are rigorously enforced.</p><p>​​<strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/elizabeth-warren-wants-the-police-at-your-door-in-2024\"><strong><em>Elizabeth Warren wants the police at your door in 2024</em></strong></a></p><p>Cohodes had reason to be concerned. Problems with KYC/AML compliance are rampant in crypto, and Silvergate appears to have been a striking example. <a href=\"https://nymag.com/intelligencer/2023/01/silvergate-crypto-industrys-favorite-bank-in-deep-trouble.html\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to New York magazine, Silvergate was “the go-to bank for more than a dozen crypto companies that ended up under investigation, shut down, fined, or in bankruptcy,” including FTX, the defunct crypto exchange. Cohodes claimed the bank went so far as to help FTX siphon user deposits into its sister fund, Alameda. </p><p>Silvergate shut down after FTX's flameout in March, but its collapse may be symptomatic of serious industry-wide problems. The crypto bank, Cahodes claimed, was “a worldwide money laundering story… with a crypto wrapper.”<a href=\"https://markets.businessinsider.com/news/stocks/short-seller-who-predicted-ftx-silvergate-capital-collapses-and-shorted-svb-financial-has-new-banking-target-a-worldwide-money-laundering-story-1032160796\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a>, was “a worldwide money-laundering story […] with a crypto wrapper.”</p><h2>Anti-crypto army</h2><p>Cohodes’ Silvergate memo reportedly found a receptive audience in Warren, who has become one of crypto’s most caustic critics. Unlike her<a href=\"https://elizabethwarren.com/plans/cannabis\" target=\"_blank\" rel=\"noopener nofollow\"> calls</a> for a wealth tax of up to 6% or a “just and equitable cannabis industry,” Warren’s crypto critiques are resonating far beyond progressive circles. Her message is simple: Crypto, Warren says, enables bad actors — from drug traffickers to rogue states — and is a threat to national security. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/elizabeth-warren-is-pushing-the-senate-to-ban-your-crypto-wallet\"><strong><em>Elizabeth Warren is pushing the Senate to ban your crypto wallet</em></strong></a></p><p>Her anti-crypto crusade is gaining traction. In January, three U.S. financial regulators <a href=\"https://cointelegraph.com/news/us-federal-agencies-release-joint-statement-on-crypto-asset-risks-and-safe-practices\">published a joint statement</a> on crypto banking. It heavily echoed Warren’s <a href=\"https://www.warren.senate.gov/newsroom/press-releases/warren-calls-on-treasury-to-use-every-tool-to-rein-in-crypto-market\" target=\"_blank\" rel=\"noopener nofollow\">proposals</a>, effectively laying the groundwork for a regulatory crackdown. The senator is working with Republicans on a <a href=\"https://www.warren.senate.gov/newsroom/press-releases/warren-marshall-introduce-bipartisan-legislation-to-crack-down-on-cryptocurrency-money-laundering-financing-of-terrorists-and-rogue-nations\" target=\"_blank\" rel=\"noopener nofollow\">bill</a> that would impose strict industrywide KYC requirements. She is even attracting cautious support from banking lobbyists.</p><p>The problem isn’t with Warren’s overarching concerns. Web3 should be accountable for filtering out bad actors. It’s that clumsy policy implementation risks damaging the nascent industry irreparably. For example, Warren’s proposed KYC/AML legislation appears to indiscriminately target almost every touchpoint in crypto, including validators. It could severely undermine network decentralization, arguably Web3’s most essential feature. </p><h2>Crypto should embrace KYC/AML to undermine Warren</h2><p>Silvergate may have collapsed, but KYC/AML liabilities still permeate Web3. It’s no accident. Anyone familiar with crypto’s cypherpunk origins knows that, for many users, anonymity is a feature, not a bug. Indeed, privacy and self-custody are Web3’s <em>raison d’etre</em>. </p><p>It’s a mistake to dismiss crypto as a tool for money laundering. Blockchain’s unique attributes have transformative applications in industries ranging from asset management to media. Unfortunately, they are also setting up the industry for a head-on collision with U.S. regulators. </p><p>Web3 isn’t out of options. Emerging technologies are creating new ways to address policy concerns without compromising crypto’s core values. For example, zero-knowledge identity proofs promise seamless on-chain KYC/AML checks that respect users’ privacy. Meanwhile, blockchain intelligence platforms, such as Chainalys have been a boon for financial crime enforcement agencies.</p><p>The industry should stop burning political capital on resisting KYC/AML requirements altogether. Instead, we need to start attacking these challenges ourselves — or Warren’s army will. </p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Alex O’Donnell</strong> is the founder and CEO of Umami Labs and worked as an early contributor to Umami DAO. Prior to Umami Labs, he worked for seven years as a financial journalist at Reuters, where he covered M&amp;As and IPOs.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  }
]