[
  {
    "source": "CoinDesk",
    "date": "2023-12-11T21:40:25.000Z",
    "title": "Bitcoin Dips 7% to Near $40K; Pullback Will Be Short-Lived, Say Experts",
    "url": "https://www.coindesk.com/markets/2023/12/11/bitcoin-dips-7-to-near-40k-pullback-will-be-short-lived-say-experts/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bitcoin endured its worst daily drawdowns in 4 months, dipping over 7% to nearly $40,000. $XRP, $LINK, $ADA declined 8%-10%."
  },
  {
    "source": "Decrypt",
    "date": "2023-12-11T21:54:17.000Z",
    "title": "Gods Unchained Rated 'Adults Only' for Play-to-Earn Elements, Booted From Epic Games Store",
    "url": "https://decrypt.co/209315/gods-unchained-rated-adults-only-play-earn-elements-booted-epic-games-store",
    "description": "The NFT game’s team is currently trying to appeal the ESRB rating to get back on Epic’s store."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-11T21:56:06.000Z",
    "title": " Bitcoin price sell-off continues, but data highlights need for healthy correction ",
    "url": "https://cointelegraph.com/news/bitcoin-price-sell-off-continues-but-data-highlights-need-for-healthy-correction",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNzliNjI1MjAtMTYxNy00MzQ3LTg3NTAtNDhlN2RhODY5YmQ0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin price opened the week with a sharp sell-off, but on-chain and technical data points to a much-needed cooling-off period.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price is down 5% over the last 24 hours to trade at $41,645 on Dec. 11. Despite the sharp price correction, technical indicators and on-chain data show that Bitcoin still displays strength as bulls strive to push the price back above $44,000.</p><p>Bitcoin dropped as much as 7.2% falling to $40,300 on Coinbase, triggering a conversation among analysts. Julio Moreno, head of research at on-chain analytics firm Cryptoquant said that the price of the flagship cryptocurrency was “overheating after the recent rally above” the $40,000 psychological level. </p><p>More data from on-chain data analysis firm Lookintobitcoin highlighted exhaustion among bulls. According to its <a href=\"https://preview.mailerlite.com/n7w8l5p6j9/2367398229949027846/s4v4/\" target=\"_blank\" rel=\"noopener nofollow\">December 2023 report</a>, the Bitcoin price has reached its golden ratio multiplier near-term target, highlighted by the Crosby Ratio, which shows Bitcoin’s near-term price at “over-extended levels” resulting in the need to correct, or at least slow down.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-price-sell-off-continues-but-data-highlights-need-for-healthy-correction\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-11T21:50:17.000Z",
    "title": "Analysts expect web3 gaming industry to hit $614B by 2030",
    "url": "https://cryptoslate.com/analysts-expect-web3-gaming-industry-to-hit-614b-by-2030/",
    "description": "<p>The blockchain gaming market could be on track for a meteoric rise fueled by the surging popularity of non-fungible tokens (NFTs) and innovative play-to-earn models, according to a recent report by Fortune Business Insights. The report predicts the global blockchain, or Web 3, gaming industry will balloon to a staggering $614.91 billion by 2030 from [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/analysts-expect-web3-gaming-industry-to-hit-614b-by-2030/\">Analysts expect web3 gaming industry to hit $614B by 2030</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-12-11T21:41:57.000Z",
    "title": "Binance to exit Russia and discontinue Ruble amid regulatory scrutiny",
    "url": "https://cryptobriefing.com/binance-exit-russia-discontinue-ruble-amid-regulatory-scrutiny/?utm_source=feed&utm_medium=rss",
    "description": "Binance scales back services associated with Russia, discontinuing Ruble trading pairs to enhance anti-money laundering controls."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-11T22:00:29.000Z",
    "title": "Galaxy Digital CEO Expresses Bullish Sentiment On XRP",
    "url": "https://www.newsbtc.com/xrp-news/galaxy-digital-ceo-expresses-bullish-sentiment-on-xrp/",
    "description": "Galaxy Digital Chief Executive Officer Mike Novogratz has shared his recent optimistic view on XRP, its army, and Ripple, asserting that he was wrong about his earlier skepticism towards them. Related Reading: Analyst Places XRP As The Top Coin For The 2024-2025 Bull Run Mike Novogratz&#8217;s Recent View On XRP And Ripple The Galaxy CEO revealed his optimism about the XRP token in a recent podcast known as Real Vision on Sunday. He previously doubted the token&#8217;s potential because he believed it would not last in the crypto market.  Novogratz stated: I was skeptical that XRP would have lasting power because payment company Ripple owns 60% of XRP, now 55% or 50%. And I was like, ‘That just doesn’t seem a proposition that’s going to work.’ And I’ve been dead wrong. His recent view follows Ripple&#8217;s significant court victories over the US Securities and Exchange Commission (SEC) in 2023. The United States Securities and Exchange Commission (SEC) has lost about three times to the crypto firm this year. In October 2021, Novogratz claimed that the asset&#8217;s value had tripled since the SEC&#8217;s actions. &#8220;It&#8217;s evidence that communities are incredibly resilient once they are established around shared interests,&#8221; he added.  Now, Mike Novogratz continued by praising the whole Ripple team and CEO Brad Garlinghouse. In addition, he also recognized Ripple&#8217;s development into a powerful player in the payment industry. The Galaxy Digital CEO Confirms XRP&#8217;s Army Is &#8220;Real&#8221; Furthermore, he also gave the &#8220;XRP Army&#8221; direct recognition, emphasizing the emotional community actively advancing and supporting its ecosystem. He confirmed the reality of the army while noting that they care about their asset and ecosystem. He stated: Hats off to Brad Garlinghouse and his team, Ripple is now an institution. The XRP army is real, they care about their ecosystem and their coin. Novogratz highlighted that the crypto asset presents use cases like Bitcoin (BTC). Due to this, it provides another &#8220;alternative for people who want to store value.&#8221; Related Reading: Billionaire Mike Novogratz Says Bitcoin At $30,000 Is Unlikely So far, Mike Novogratz&#8217;s recent optimism about the asset has generated much interest in its community. Prominent XRP influencer Crypto Eri highlighted Novogratz&#8217;s remark regarding the digital asset in a post. In a mocking response to Crypto Eri&#8217;s tweet, someone asked whether Novogratz had joined the ranks of XRP investors. He further asked whether he was still &#8220;confused&#8221; about its mission. Featured image from Shutterstock, chart from Tradingview.com"
  }
]