[
  {
    "source": "Cryptopolitan",
    "date": "2023-12-22T22:29:53.000Z",
    "title": "BarnBridge DAO settles SEC charges for unregistered cryptocurrency offerings",
    "url": "https://www.cryptopolitan.com/barnbridge-dao-settles-sec-charges/",
    "description": "BarnBridge DAO, a decentralized autonomous organization, and its founders, Tyler Ward, and Troy Murray, have agreed to pay over $1.7 million to settle charges brought by the Securities and Exchange Commission (SEC). The charges pertain to the failure to register the offer and sale of structured crypto asset securities, specifically the SMART Yield bonds, according [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-22T22:30:10.000Z",
    "title": "Crypto Analyst Predicts Massive 99% BNB Price Crash To $2",
    "url": "https://www.newsbtc.com/analysis/bnb/bnb-price-crash-to-2/",
    "description": "BNB, the native token of the Binance Exchange, has grown to become one of the largest cryptocurrencies in the world. Its current price of $260 puts its market cap above $39 billion, making it the fourth-largest asset in the market. However, despite the notoriety that the cryptocurrency has gained during this time, one crypto analyst still expects a massive price crash, one that could shake the entire crypto market to its very core. BNB Long-Term Distribution Points To Crash In the initial analysis that was posted to the TradingView website on Tuesday, December 19, crypto analyst Alan Santana pointed out that the BNB token had been in what “can be considered a long-term distribution phase.” He identifies this distribution phase on the chart shared which looks to have begun after the altcoin hit its $670 all-time high price in 2021. Related Reading: Solana Flips BNB To Become 4th-Largest Crypto, Is Ethereum Next While this is pointed out to be bearish, the levels at which Santana believes this bearish pressure could take the price back to 2018 lows. In addition to this, the analyst explains that the BNB price is still trading below its 200-day Moving Average (MA). This, in itself, is very bearish for the asset’s price, but cannot send it 99% below its current price. However, he explains that this metric coupled with bad news about the exchange could be devastating. Source: Tradingview.com It is no surprise that the Binance Exchange has endured its fair share of problems when it comes to dealing with regulators. The exchange’s stablecoin which was issued by Paxos halted minting following instructions from regulators. Later, CEO Changpeng Zhao stepped down after the exchange and the founder agreed to pay $4 billion in fines to the US Securities and Exchange Commission (SEC). The crypto analyst stated that the chart points lower in such a case but pinpointing a particular endpoint is impossible. “It is impossible to say exactly if the final target will be $11, $6, $2 or $0.10, it is very hard to predict an exact target but, the chart is pointing lower,” Santana said. Token price starts to recover &#124; Source: BNBUSD on Tradingview.com Waiting For The Best Timing Coupled with the indicators that the analyst has pointed out, he made follow-up posts to add other factors that could trigger a 99% crash in the BNB price. Pointing to the change in management that happened around a month ago, Santana explains that the next move by the exchange would be called “restructuring.” He stated: The company will undergo some &#8220;restructuring&#8221;, changes and improvements in the corporate network and thus everything most be frozen&#8230; Don&#8217;t worry though, the funds are SAFU. Related Reading: Solana Headed To $100? Here’s What’s Driving The Growth However, Santana explains that this will not just happen and that they would wait for the best time to actually carry out this move. According to the analyst, a drawdown from the current rally would be the best time for them. “So they would let the market correction play out after the SECs announcement late December or early January 2024. Once the market is about to bottom or hits bottom, then the ‘restructuring’ can start,” Santana said. “This would freeze billions of customers funds and allow time for the institutions, the big players, the Spot ETFs to buy Bitcoin low.” Despite the grim prediction that could crumble the crypto market if it happened, the crypto analyst believes that this is positive in the long term. “Life will continue to evolve, nature will pick who leaves and who stays, and time will decide who was right and who is wrong,” Santana concluded. Featured image from Portal do Bitcoin, chart from Tradingview.com"
  }
]