[
  {
    "source": "Decrypt",
    "date": "2024-03-06T02:52:28.000Z",
    "title": "Shuttered Crypto Exchange ShapeShift Settles Illegal Securities Charges With SEC",
    "url": "https://decrypt.co/220359/shapeshift-exchange-defi-token-sec-settlement-fine",
    "description": "Founded in 2014 by Erik Voorhees, ShapeShift shapeshifted to a decentralized, non-custodial model in 2018."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-06T02:57:20.000Z",
    "title": "Revolutionizing Warehouse Efficiency – New AI Model Optimizes Robotic Operations",
    "url": "https://www.cryptopolitan.com/ai-model-optimizes-robotic-operations/",
    "description": "In a breakthrough development poised to transform warehouse logistics, MIT researchers have unveiled a revolutionary AI model designed to streamline operations in robotic warehouses. With the surge in e-commerce and manufacturing, the demand for efficient warehouse management has never been higher. Traditional algorithms have grappled with the complexity of coordinating the movements of numerous robots [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-06T02:40:13.000Z",
    "title": "Exploring the Potential of AI for Government Benefits  Applications",
    "url": "https://www.cryptopolitan.com/potential-of-ai-for-government-benefits/",
    "description": "In a bid to tackle the bureaucratic hurdles faced by citizens seeking federal government benefits, AI startup Advocate, spearheaded by Emilie Poteat, proposes an innovative solution leveraging the potential of AI for Government Benefits. Poteat&#8217;s inspiration stemmed from observing her stepfather navigate the labyrinthine process of securing social security benefits. This revelation led her to [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-06T03:07:12.000Z",
    "title": "Bitcoin Price Crashes After New ATH, Are Dips Supported At $60K?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-crashes-60k/",
    "description": "Bitcoin price traded to a new all-time high above $69,000 before crashing. BTC is now consolidating near $63,000 and might decline toward the $60,000 support. Bitcoin price created history again and traded to a new all-time above $69,000. The price is trading below $65,000 and the 100 hourly Simple moving average. There was a break below a key bullish trend line with support at $66,000 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could extend losses and revisit the key $60,000 support zone. Bitcoin Price Takes Hit Bitcoin price extended its increase above the $68,000 resistance. BTC even broke the $68,800 level and traded to a new all-time high at $69,218. However, there was a strong bearish reaction from $69,200. The price crashed over 10% and dived toward the $60,000 zone. There was a break below a key bullish trend line with support at $66,000 on the hourly chart of the BTC/USD pair. A low was formed near $59,150 and the price is now attempting a recovery wave. There was a move above the $62,000 resistance. It is now facing resistance near the $64,000 zone and the 50% Fib retracement level of the downward move from the $69,218 swing high to the $59,150 low. Bitcoin is now trading below $64,000 and the 100 hourly Simple moving average. Immediate resistance is near the $64,000 level. The next key resistance could be $64,200, above which the price could rise toward the $65,500 resistance zone. Source: BTCUSD on TradingView.com If there is a clear move above the $65,500 resistance zone or the 61.8% Fib retracement level of the downward move from the $69,218 swing high to the $59,150 low, the price could rise toward the $67,000 level. Any more gains might send the price toward the $70,000 level. More Losses In BTC? If Bitcoin fails to rise above the $64,200 resistance zone, it could start another downside correction. Immediate support on the downside is near the $62,000 level. The first major support is $61,500. If there is a close below $61,500, the price could start a decent pullback toward the $60,000 zone. Any more losses might send the price toward the $58,500 support zone. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $62,000, followed by $60,000. Major Resistance Levels – $64,200, $65,500, and $67,000."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-06T03:00:23.000Z",
    "title": "Deribit Exchange Expects Bitcoin To Rise 20% In The Next 30 Days, Targeting $80,000",
    "url": "https://www.newsbtc.com/bitcoin-news/deribit-exchange-expects-bitcoin-to-rise-20-in-the-next-30-days-targeting-80000/",
    "description": "In a significant milestone for the cryptocurrency market, Bitcoin (BTC), the largest digital asset, shattered its previous records, surging past the $69,000 mark to establish a new all-time high (ATH) of $69,300 on Tuesday.  The achievement marked a historic moment for BTC, which hadn&#8217;t reached such levels in over two years. However, the crypto&#8217;s upward trajectory shows no signs of slowing down, with experts predicting further price gains. Bitcoin Price And ETFs In Perfect Harmony According to data from Deribit, an options and futures crypto exchange and analytics firm GenesisVol, BTC is anticipated to experience a potential increase of up to 20.8% within the next 30 days.  These projections suggest that, under ideal circumstances, Bitcoin&#8217;s price could break through the $80,000 barrier. Even conservative traders are optimistic, expecting BTC to easily surpass $70,000 and reach around $75,000. Related Reading: BREAKING: Bitcoin Price Soars To New All-Time High Above $69,000 In addition, the recent approval of spot Bitcoin exchange-traded funds (ETFs) has played a pivotal role in Bitcoin&#8217;s success, suggesting that the upward trend in BTC prices, coupled with bullish sentiment among options traders and institutional and retail investors, is far from over. Bloomberg ETF expert Eric Balchunas emphasized the significance of this development, stating that it represents a crucial moment for both Bitcoin and ETFs. Balchunas believes the surge from $25,000 to $69,000 was largely driven by hopes of ETF approval and subsequent flows.  The expert claimed that the synergy between ETFs and Bitcoin has proven mutually beneficial, as ETFs have enhanced liquidity, affordability, convenience, and standardization for investors.  Notably, the ten-spot Bitcoin ETFs have amassed over $50 billion in assets, with a staggering $8 billion generated from flows and the rest attributed to the rising value of Bitcoin. However, as Bitcoin reached its new peak, increased market volatility led to a liquidation surge. Journalist Colin Wu reported a sharp 5% drop in Bitcoin&#8217;s price within an hour, with Binance recording below $65,000. During this hour, liquidations amounted to a staggering $142 million.  BTC Sell Signal Although bullish investors are currently on cloud nine, renowned crypto analyst Ali Martinez has sounded the alarm as the TD Sequential indicator recently flashed a sell signal on the daily chart of Bitcoin. The TD Sequential indicator, developed by market expert Tom DeMark, utilizes price patterns and sequences to identify potential trend reversals in various financial markets, including cryptocurrencies.  Related Reading: Shiba Inu Price Skyrockets 45%, Surges Past $0.000045: Here’s Why Martinez emphasized the indicator&#8217;s notable track record in predicting Bitcoin&#8217;s price movements since the beginning of the year. The TD Sequential indicator issued a buy signal in early January, just before Bitcoin&#8217;s price surged 34%.  Conversely, a sell signal was given in mid-February, followed by a 4.44% drop in the value of BTC. So, considering the previous sell signals, a potential drop towards the $62,000 price level could be in the making for the largest cryptocurrency on the market, still holding the $60,000 support, which will be key for BTC&#8217;s prospects. Featured image from Shutterstock, chart from TradingView.com"
  }
]