[
  {
    "source": "Crypto Daily",
    "date": "2023-08-28T06:01:11.000Z",
    "title": "\n                        Friend.tech Declines as Trading and Fees Plummet\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/friendtech-declines-as-trading-and-fees-plummet",
    "description": "\n                        <p class=\"md-end-block md-p md-focus\">A mere three weeks post-launch, decentralized social platform Friend.tech is facing intense scrutiny as key performance metrics have dwindled, leading many to pronounce it as a \"dead\" platform.</p>\n<p class=\"md-end-block md-p\">Having launched its beta version on Coinbase&rsquo;s layer-2 Base on Aug. 11, Friend.tech initially generated significant buzz, especially after its fees eclipsed both Uniswap and the Bitcoin network, reaching over $1 million within a day on Aug. 19. Despite this, the initial momentum seems to have been short-lived, while also trouncing speculations that info from its users was leaked.</p>\n<p class=\"md-end-block md-p\">Comparisons have also been made between Friend.tech and the 2021 DeSo app BitCloud. Web3 marketer Legendary predicts a similar fate for Friend.tech, anticipating that it \"will collapse as BitClout did.\"</p>\n<p class=\"md-end-block md-p\">Aggregated blockchain data reveals a significant drop in daily fees, which hit a high of $1.7 million on Aug. 21 and subsequently plunged by over 87%, settling around $215,000 by Aug. 26. Concurrently, transaction activity on the platform saw an over 90% decrease, falling from a high of nearly 525,000 on Aug. 21 to just over 51,000 on Aug. 27, as indicated by data from Dune Analytics compiled by Crypto Koryo.</p>\n<p class=\"md-end-block md-p md-focus\">Social media, particularly X (formerly Twitter), is awash with commentary on the network's drastic decline. One such tweet by @beaniemaxi reads, \"RIP Friendtech. August 2023-August 2023.\"</p>\n\n<p dir=\"ltr\" lang=\"en\">RIP FriendtechAugust 2023-August 2023💀 pic.twitter.com/Fb0bh23Fyo</p>\n&mdash; Beanie (@beaniemaxi) August 26, 2023\n<p class=\"md-end-block md-p md-focus\">Friend.tech's operational model focuses on users buying and selling \"keys\" that grant buyers the ability to send private messages to sellers. For each transaction, the platform purportedly retains a 5% commission. This model attracted several prominent figures from both the crypto realm and beyond, including the host of the UpOnly podcast, Cobie, YouTuber Faze Banks, and the Russian protest group Pussy Riot.</p>\n<p class=\"md-end-block md-p\">However, the rapid decline has sparked criticism, with Coinbase payments risk manager Lisandro Rodriguez suggesting in an X post that the platform's downfall can be attributed to \"greed and poor execution.\"</p>\n<p class=\"md-end-block md-p\">The available data further underscores the downturn, showcasing a drop in the number of active buyers and sellers. From an Aug. 21 peak with over 58,000 buyers and 27,000 sellers, the numbers dwindled to about 10,000 buyers and 7,800 sellers by Aug. 27. Inflows, too, experienced a decline, plummeting nearly 90.5% from an Aug. 21 high of $16.8 million to approximately $1.6 million on Aug. 27.</p>\n<p class=\"md-end-block md-p\">Even before this steep decline, skepticism surrounded the platform. Crypto commentator Yazan, in the previous week, expressed concerns over the sustainability of user key price surges, wondering aloud about the feasibility of individuals paying 1 Ether (ETH) or more simply to gain access to private chats.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-28T06:00:13.000Z",
    "title": "Binance Removes Sanctioned Russian Banks From P2P Platform",
    "url": "https://news.bitcoin.com/binance-removes-sanctioned-russian-banks-from-p2p-platform/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2181652527-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Binance Removes Sanctioned Russian Banks From P2P Platform\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2181652527-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2181652527-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2181652527-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2181652527-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2181652527-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2181652527-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2181652527.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Crypto exchange Binance has dropped Russian banks under sanctions from the payment options on its peer-to-peer (P2P) platform. Russian traders can no longer use cards issued by these banks to make payments while transactions in foreign fiat currencies are also restricted for them. Binance No Longer Offers P2P Traders Option to Pay Through Sanctioned Russian [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T05:54:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T05:44:30.000Z",
    "title": "India’s digital finance leap: Aiming for the stars",
    "url": "https://www.cryptopolitan.com/india-digital-finance-aiming-for-the-stars/",
    "description": "As Prime Minister Narendra Modi celebrated India&#8217;s remarkable strides in space with its moon landing, another massive leap was taking place closer to home. The finance sector. India is not just evolving, it&#8217;s rocketing ahead with audacious reforms that might just reshape the global financial landscape. From cash-reliant chaos to digital dynamo Decades ago, India&#8217;s ... <a title=\"India&#8217;s digital finance leap: Aiming for the stars\" class=\"read-more\" href=\"https://www.cryptopolitan.com/india-digital-finance-aiming-for-the-stars/\" aria-label=\"More on India&#8217;s digital finance leap: Aiming for the stars\">Read more</a>"
  }
]