[
  {
    "source": "CoinDesk",
    "date": "2024-02-13T15:03:17.000Z",
    "title": "Bitcoin Drops 2% on Hotter-Than-Expected U.S. Inflation",
    "url": "https://www.coindesk.com/markets/2024/02/13/bitcoin-drops-2-on-hotter-than-expected-us-inflation/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The CPI reading reduced expectations for interest-rate cuts in the next months, weighing on risk assets such as crypto."
  },
  {
    "source": "CoinDesk",
    "date": "2024-02-13T15:00:00.000Z",
    "title": "Ripple to Buy New York Crypto Trust Company to Expand U.S. Options",
    "url": "https://www.coindesk.com/policy/2024/02/13/ripple-to-buy-new-york-crypto-trust-company-to-expand-us-options/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Ripple struck a deal to acquire Standard Custody & Trust Co., the company said Tuesday, in order to secure a New York trust charter in an ongoing expansion of its U.S. regulatory licensing."
  },
  {
    "source": "CoinDesk",
    "date": "2024-02-13T14:58:23.000Z",
    "title": "Ethereum Developers Create 'DN-404' Tokens After ERC-404s Send Network Fees Surging",
    "url": "https://www.coindesk.com/tech/2024/02/13/ethereum-developers-create-dn-404-tokens-after-erc-404s-send-network-fees-surging/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The new token type claims to solve some of the drawbacks with ERC-404s, an experimental standard that launched last week – to such popularity that it's already driven up congestion on the Ethereum blockchain."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-13T15:00:00.000Z",
    "title": " HectorDAO silence after $2.7M hack shocks investors ",
    "url": "https://cointelegraph.com/news/hector-dao-allegedly-ceases-communication-with-investors-after-hack",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvOGEwNjIxNDktOWUyNi00ZDQwLTg5YWItN2ExY2I2MDJhN2Y2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Investors claim the HectorDAO team failed to protect their assets after the protocol’s deployer account whitelisted a malicious hacker address.</p>\n                    <p><p data-ct-non-breakable=\"true\">Investors of the Hector decentralized autonomous organization, HectorDAO, on the Fantom network are demanding control of the protocol’s remaining funds after the tea allegedly halted all communications following a Jan. 16 hack that led to $2.7 million in losses.</p><p>In a conversation with Cointelegraph, a HectorDAO investor who wishes to remain anonymous stated that the HectorDAO team stopped communicating with its community on Jan. 19. According to the source, all project social channels were muted in September 2023. </p><p>At that time, the HectorDAO team still allowed contact through a Google Group email address. However, the DAO allegedly deleted this group sometime before Jan. 19.</p><p><a href=\"https://cointelegraph.com/news/hector-dao-allegedly-ceases-communication-with-investors-after-hack\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-13T14:52:41.000Z",
    "title": " Solana’s market cap overtakes BNB, secures 4th position ",
    "url": "https://cointelegraph.com/news/solana-flips-binance-bnb-fourth-largest-cryptocurrency",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZWYxMTM5MTItYzUwZS00Zjg5LWI0N2YtNjBhNGIzN2ZmMGJkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Solana becomes the 4th largest crypto by market cap despite a major network outage on Feb. 6.</p>\n                    <p><p>Solana’s SOL token has flipped Binance’s BNB token to become the fourth-largest cryptocurrency by market capitalization.</p><p>The SOL token rose 7.56% in the 24 hours leading up to 1:50 pm UTC to trade at $112.52, overtaking the BNB coin. Solana’s $49.36 billion market cap is 1.74% larger than BNB’s $48.5 billion market capitalization, according to <a href=\"https://coinmarketcap.com/\" target=\"_blank\" rel=\"noopener nofollow\">CoinMarketCap</a> data.</p><p>Solana’s price surge occurred the same day the Crypto Fear and <a href=\"https://cointelegraph.com/news/crypto-fear-greed-highest-bitcoin-69k\">Greed Index hit</a> its all-time high in Nov. 2021, when Bitcoin reached $69,000. The index’s spike came a day after <a href=\"https://cointelegraph.com/news/bitcoin-soars-above-50k-without-retail-fomo-and-high-leverage-use-why-this-is-good\">Bitcoin surpassed $50,000</a> for the first time since Dec. 2021.</p><p><a href=\"https://cointelegraph.com/news/solana-flips-binance-bnb-fourth-largest-cryptocurrency\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-13T14:47:18.000Z",
    "title": "MicroStrategy pivots to Bitcoin development, flaunts $3.5 billion in unrealized profit",
    "url": "https://cryptoslate.com/microstrategy-pivots-to-bitcoin-development-flaunts-3-5-billion-in-unrealized-profit/",
    "description": "<p>MicroStrategy is rebranding into a Bitcoin development company to reflect the success it enjoys with the flagship digital asset. In a Feb. 12 CNBC interview, Michael Saylor, the company&#8217;s executive chairman, said: &#8220;MicroStrategy is now a Bitcoin development company, in the same way you would see a real estate or petroleum developer.&#8221; This move marks a [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/microstrategy-pivots-to-bitcoin-development-flaunts-3-5-billion-in-unrealized-profit/\">MicroStrategy pivots to Bitcoin development, flaunts $3.5 billion in unrealized profit</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-13T15:00:14.000Z",
    "title": "Microsoft to Address Xbox Exclusivity Rumors at Business Update Event",
    "url": "https://www.cryptopolitan.com/microsoft-to-address-xbox-exclusivity/",
    "description": "Microsoft is set to quell rumors surrounding Xbox exclusivity at an eagerly anticipated business update event scheduled for February 15th. The event aims to provide clarity on the future of Xbox titles, with key figures such as CEO Phil Spencer expected to outline the company&#8217;s strategic vision for the gaming platform. Speculation surrounding multi-platform releases [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-13T15:00:00.000Z",
    "title": "Surge in Dogecoin Addresses Following Mark Cuban’s Approval; Emerging Altcoin is Disrupting Crypto Industry",
    "url": "https://www.cryptopolitan.com/surge-in-dogecoin-addresses-following-mark-cubans-approval-emerging-altcoin-is-disrupting-crypto-industry/",
    "description": "Dogecoin (DOGE) continues to take the center stage in the crypto news scene based on an exponential growth in its addresses after billionaire investor Mark Cuban approved the meme coin.&#160; Meanwhile, Borroe Finance ($ROE) is emerging as a game-changing altcoin that is breaking entry barriers in the Web3 sector. &#62;&#62;BUY $ROE TOKENS NOW&#60;&#60; Borroe Finance [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-13T14:46:58.000Z",
    "title": "Decoding Velas: insights into 2024 price predictions and long-term growth",
    "url": "https://crypto.news/velas-vlx-price-prediction/",
    "description": "Dive deep into Velas&#8217; role in the crypto sphere with our comprehensive analysis of Velas price predictions for 2024 and its long-term growth potential. In the crypto market dominated by Bitcoin (BTC) and Ethereum (ETH), Velas (VLX) is gaining traction&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-13T15:00:16.000Z",
    "title": "Ethereum ETF: Franklin Templeton Enters The Fray As ETH Rallies",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-etf-franklin-templeton-enters-the-fray-as-price-rallies/",
    "description": "Wall Street titan and Asset manager Franklin Templeton has applied for an Ethereum Spot Exchange-Traded Funds (ETF) after a struggle to gain approval for their Bitcoin Spot ETF in early January. Asset Manager Files For Spot Ethereum ETF Asset managers have gravitated toward the Ethereum spot ETF since the United States Securities and Exchange Commission (SEC) approved the Spot Bitcoin ETF. Franklin Templeton is the latest manager to apply with the SEC to get approval for this financial product.  Related Reading: SEC Delays Spot Ethereum ETF Decision; $GFOX to Outperform $ETH in 2024 The asset manager&#8217;s move came after successfully introducing the BTC spot ETFs. This is a notable step toward making more crypto investment products accessible to institutional and individual investors. James Seyffart, a senior analyst from Bloomberg Intelligence, also shared the update with the crypto community on X (formerly Twitter). Seyffart&#8217;s X post included a screenshot of the asset manager&#8217;s filing and data regarding other applicants. According to the post, Franklin Templeton is the eighth company in the cryptocurrency market to file for product approval. Previous asset managers to file applications for Ethereum ETFs include Hashdex, BlackRock, Fidelity, Ark and 21Shares, Grayscale, VanEck, Invesco, and Galaxy.  Per the official filing, a Delaware statutory trust is how the Franklin Ethereum Trust is set up. The ETF aims to give investors access to ETH in a regulated manner by allowing them to store it directly through a custodian. It states in the company&#8217;s S-1 filing that the proposed &#8220;Franklin Ethereum Trust&#8221; will hold ETH and &#8220;may, from time to time, stake a portion of the fund&#8217;s assets through one of the more trusted staking providers.&#8221; Staking is the act of locking up digital currency to maintain the operations of a blockchain network. They plan to stake some of the ETF&#8217;s ETH holdings to supplement its income through staking rewards. The Price Of ETH Rallies Amidst The Update Franklin Templeton&#8217;s spot Ethereum ETF application was made in light of the price of ETH experiencing an uptick. However, no solid proof exists that the latest development impacted the price of crypto assets. Related Reading: Ethereum ETFs Approval Date Set For May 23, Forecasts Suggest ETH Could Reach $4,000 Ethereum was trading at $2,661 as of press time, indicating an increase of over 7% in the past 24 hours. Data from CoinMarketCap shows that its market capitalization is also on the upside, marking an increase of over 7%.  Meanwhile, its trading volume has increased significantly by over 172% in the past day. Due to the rise, ETH now ranks third in the entire crypto market by trading volume. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-02-13T15:09:14.000Z",
    "title": "Binance Founder, CZ, to be Sentenced in April",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/binance-founder-cz-to-be-sentenced-in-april/",
    "description": "<p>Former Binance CEO and founder Changpeng Zhao (CZ) will continue to face legal uncertainty after a US court pushed back the date for his money laundering case to April 30. Zhao previously entered a guilty plea to counts of money laundering, and his sentencing was initially scheduled for February 23. CZ&#8217;s Sentencing: Binance Founder Faces [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/binance-founder-cz-to-be-sentenced-in-april/\">Binance Founder, CZ, to be Sentenced in April</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-13T15:05:00.000Z",
    "title": "Founders Fund Buys $200M Worth of BTC and ETH Ahead of the Bull Run",
    "url": "https://coinedition.com/founders-fund-buys-200m-worth-of-btc-and-eth-ahead-of-the-bull-run/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-update.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Founders Fund Buys $200M Worth of BTC and ETH Ahead of the Bull Run\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-update.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-update-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/BTC-and-ETH-update-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Founders Fund’s recent crypto purchase signals renewed interest in cryptocurrency from Silicon Valley. The renowned VC invested $200 million to acquire the crypto tokens from late summer to early fall last year. Founders Fund started an aggressive Bitcoin acquisition in 2014 before liquidating its holdings ahead of the 2022 crypto market crash. There is renewed [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/founders-fund-buys-200m-worth-of-btc-and-eth-ahead-of-the-bull-run/\">Founders Fund Buys $200M Worth of BTC and ETH Ahead of the Bull Run</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]