[
  {
    "source": "CoinDesk",
    "date": "2023-07-13T01:00:00.000Z",
    "title": "Binance Labs Invests $15M in Web3 Gaming Startup Xterio",
    "url": "https://www.coindesk.com/business/2023/07/13/binance-labs-invests-15m-in-web3-gaming-startup-xterio/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The capital will help Xterio add more games and artificial intelligence integrations to its platform."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-13T01:28:54.000Z",
    "title": "Hollywood Writers Weigh Actors Guild's Next Moves Amid AI Debate",
    "url": "https://decrypt.co/148389/ai-hollywood-writers-studios-actors-sag-aftra-strike",
    "description": "\"What they are doing is taking our work, dissecting it, and putting it into a machine, a blender, that spits it back out.\""
  },
  {
    "source": "Decrypt",
    "date": "2023-07-13T01:01:02.000Z",
    "title": "Binance Labs Invests $15 Million in Crypto Game Publisher Xterio",
    "url": "https://decrypt.co/148373/binance-labs-invests-15-million-crypto-game-publisher-xterio",
    "description": "Xterio, the publisher behind upcoming NFT and crypto games like Age of Dino and Overworld, nets funding from Binance's VC arm."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-12T22:41:15.000Z",
    "title": "Iconic Notorious B.I.G. Photo Up for Auction—Along With Ethereum NFT",
    "url": "https://decrypt.co/148378/iconic-notorious-big-photo-auction-ethereum-nft",
    "description": "Photographer Barron Claiborne’s \"King of New York\" series celebrates the late rapper, The Notorious B.I.G."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-12T21:31:08.000Z",
    "title": "Quantum Computers Could Be Even More Powerful With Latest Discovery",
    "url": "https://decrypt.co/148356/quantum-computers-could-be-even-more-powerful-with-latest-discovery",
    "description": "An unusual superconducting state observed in specific atoms may be the key to building the quantum computers of the future."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-12T20:44:44.000Z",
    "title": "McHenry Crypto Bill Would 'Weaken Consumer and Investor Protections', Say Lobbyists",
    "url": "https://decrypt.co/148340/mchenry-crypto-bill-weaken-consumer-investor-protections-letter",
    "description": "“While other tech has proven its usefulness many times over, crypto's big moment is always just over the horizon,\" the lobbyists said in their letter."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-12T20:31:02.000Z",
    "title": "Meet CancerGPT: An AI That Predicts the Results of Cancer Treatment Research",
    "url": "https://decrypt.co/148352/meet-cancergpt-an-ai-that-predicts-the-results-of-cancer-treatment-research",
    "description": "A new study says large pre-trained language models (LLMs) can predict how drug pairings affect rare tissues."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-13T00:54:29.000Z",
    "title": "IRS probes crypto traders using Puerto Rico tax breaks: Report",
    "url": "https://cointelegraph.com/news/puerto-rico-crypto-tax-probe-irs-investigation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/e8a7d6b8-6a81-47fb-8fcb-45f00fa2b6bb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>“The noose is tightening” for wealthy Americans suspected of exploiting Puerto Rico’s relaxed tax regime.</p>\n                    <p><p>Prosecutors from the United States and agents from the Internal Revenue Service (IRS) are reportedly investigating wealthy crypto traders and fund managers suspected of illegally benefiting from Puerto Rico’s tax breaks. </p><p>According to a June 12 <a href=\"https://www.bloomberg.com/news/articles/2023-07-12/irs-probes-puerto-rico-tax-breaks-that-lured-crypto-traders-fund-managers\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from Bloomberg, investigators are currently building civil and criminal cases against a number of hedge fund managers, crypto traders and other wealthy Americans who may have lied about the nature of their residency and key elements of their income in order to take unfair advantage of the tax breaks. </p><p>Officials from the U.S. are also delving into attorneys and accountants responsible for marketing the island territory’s tax program, with at least two criminal investigations expected to result in charges in the near future. Prosecutors are reportedly looking at conspiracy and wire fraud charges. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Many claimed Act 22 would drive investment to Puerto Rico and bring untold benefits.<br><br>Unfortunately, it's only worsened inequality & turned PR into a tax haven.<br><br>We need a serious analysis from the Federal gov’t on the impact of Act 22 & its ability to help Puerto Ricans. <a href=\"https://t.co/eBxrW2zmP7\">https://t.co/eBxrW2zmP7</a></p>— Rep. Nydia Velazquez (@NydiaVelazquez) <a href=\"https://twitter.com/NydiaVelazquez/status/1663987580407365633?ref_src=twsrc%5Etfw\">May 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Recalling a conversation with a U.S. federal prosecutor, attorney Carlos Ortiz said the prosecutors were working with “IRS agents” as well as officials from Puerto Rico. </p><blockquote>“The message is the noose is tightening.” </blockquote><p>Since Puerto Rico introduced its new tax policy in 2012, more than 5,000 American individuals relocated to the country, one of the benefits of doing so includes saving onfederal income tax.</p><p>Puerto Rico’s tax policy grants individuals a 100% exemption on dividends, 60% exemption on municipal taxes and zero federal taxes on source income earned within the region. </p><p>Additionally, more than 3,600 businesses have been able to avoid paying tax on dividends from earnings and profits and are only required to pay 4% tax on exports.</p><p>While the tax benefits stand as some of the most relaxed in the world, the requirements to take advantage of them are quite strict. </p><p>To qualify for the tax breaks, new residents must be able to prove that they live on the island for at least 183 days of each year and that the island territory is their “tax home.”</p><p>These stringent rules reportedly tempt many individuals to fudge numbers and cheat on their returns, according to lawyers familiar with the regime. </p><p>Notable residents who relocated to Puerto Rico for tax reasons <a href=\"https://www.capitalism.com/taxes-in-puerto-rico/\" target=\"_blank\" rel=\"noopener nofollow\">include</a> gold bug <a href=\"https://cointelegraph.com/tags/peter-schiff\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/tags/peter-schiff/amp\">Peter Schiff</a> and crypto investor Michael Terpin. On July 4, Puerto Rican regulators <a href=\"https://cointelegraph.com/news/peter-schiff-s-bank-closure-strengthens-bitcoin-case-for-financial-freedom\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/peter-schiff-s-bank-closure-strengthens-bitcoin-case-for-financial-freedom/amp\">closed down Schiff’s bank</a> for not meeting the net minimum capital requirements. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Despite no evidence of crimes, Puerto Rico regulators closed my bank anyway for net capital issues, rather than allow a sale to a highly qualified buyer promising to inject capital far in excess of regulatory minimums. As a result accounts are frozen and customers may lose money.</p>— Peter Schiff (@PeterSchiff) <a href=\"https://twitter.com/PeterSchiff/status/1543729010278113281?ref_src=twsrc%5Etfw\">July 3, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Speaking at the <a href=\"https://cointelegraph.com/news/bitcoin-2022-miami-conference-recap-and-major-themes\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-2022-miami-conference-recap-and-major-themes/amp\">Miami’s annual Bitcoin Conference</a> on May 19, Terpin <a href=\"https://www.youtube.com/watch?v=wRliSXbRUng\" target=\"_blank\" rel=\"noopener nofollow\">praised</a> Puerto Rico as the “only place that you can go and not have to pay on your global tax without renouncing U.S. citizenship.”</p><p>Unlike some, Terpin didn’t seem too concerned by the rigorous tax policy:</p><blockquote>“I’ve been told that every single person is going to get audited, and that’s fine. I keep incredibly precise notes. I get them run past both a tax lawyer and a CPA, and I’ve got two bookkeepers. So bring it on, I’m not afraid of an audit.”</blockquote><p>While the island’s wealthy residents have commended the tax breaks for bringing top fund managers and entrepreneurs to the island, the tax program has been subject to <a href=\"https://time.com/5955629/puerto-rico-tax-haven-opposition/\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://time-com.cdn.ampproject.org/c/s/time.com/5955629/puerto-rico-tax-haven-opposition/?amp=true\">protests</a> which declare the new hyper-wealthy residents to be low-tax “colonizers” that have driven up the cost of living. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/real-bedford-soccer-team-puts-bitcoin-on-the-map/\"><strong><em>Peter McCormack’s Real Bedford Football Club puts Bitcoin on the map</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T22:30:00.000Z",
    "title": "What to expect from the first Coinbase-SEC hearing",
    "url": "https://cointelegraph.com/news/what-to-expect-from-coinbase-sec-first-hearing",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/637a1165-84a8-4a77-b2dc-f72024e062be.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>As the first hearing since the SEC lawsuit on June 6, the conference is expected to be \"procedural and administrative,\" though it may also give a sense of the litigation's tone. </p>\n                    <p><p>A pre-motion hearing set to take place on July 13 between the Securities and Exchange Commission (SEC) and crypto exchange Coinbase should provide a sense of the litigation tone and its potential impacts on the broader crypto industry, legal sources told Cointelegraph. </p><p>Previously scheduled for August, the conference is a typical request presented by any party seeking a ruling on a specific matter prior to the trial. In this case, the motion was requested by Coinbase in late June. The exchange wants Judge Katherine Polk Faila <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-sues-coinbase-crypto-exchange/amp\">to dismiss the complaint filed by the regulator</a> on June 5.</p><p>As the first hearing between the parties, the conference will likely be \"procedural and administrative heavily\", explained Mark Kornfield, securities and regulatory attorney. \"Coinbase will try to position this case as one that is ripe for early dismissal on any number of grounds. Including that the tokens are not securities under the Howey test and thus the commission is overstepping its jurisdictional authority,\" Kornfield added. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/5485e333-15d1-434f-ad9e-635e36662869.png\"><figcaption style=\"text-align: center;\"><em>Screenshot of Coinbase's motion on June 28. Source: CourtListener.</em></figcaption></figure><p>In its reply to the motion on July 7, the SEC made strong criticisms of the exchange, including that it <a href=\"https://cointelegraph.com/news/coinbase-was-aware-of-securities-law-violations-the-sec-claims\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/coinbase-was-aware-of-securities-law-violations-the-sec-claims/amp\">was aware of possible violations of securities laws</a>, and it is deliberating “ignoring more than 75 years of controlling law under Howey” in an attempt “to construct its own test for what constitutes an investment contract.“ </p><p>Coinbase's motion also refers to its initial public offering in 2021. According to the exchange, the SEC is now seeking charges for activities “exhaustively described” to the regulator and the general public in the past years. </p><p>Although the SEC was aware of Coinbase's business activities, the claim could not be enough to win a case in court. According to corporate and securities lawyer Roland Chase, the federal securities laws governing the \"going public\" process are disclosure-based. “All that the SEC is authorized to do by Congress is to review the going public documents and provide comments and ask questions in an effort to improve the company’s disclosure to potential investors,” Chase told Cointelegraph. </p><p>Chase also noted that to go public, Coinbase reported to the SEC that it would subject each asset to a comprehensive legal analysis before allowing it to trade on its platform to ensure securities are not traded. \"The SEC eventually got comfortable with all this disclosure and cleared Coinbase to go public,\" he explained, adding that the SEC \"now thinks that Coinbase is, in fact, trading securities on its platform. In addition, it thinks that Coinbase is offering its own unregistered securities.\" </p><p>Without an agreement between the parties, the case may take years to be resolved. A well-known example is Ripple's legal battle that <a href=\"https://cointelegraph.com/news/ripple-ceo-brad-garlinghouse-fight-for-clarity\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ripple-ceo-brad-garlinghouse-fight-for-clarity/amp\">has been dragging on since 2020</a> when the SEC also deemed that its token XRP was a security. In a recent video about the ongoing litigation, Ripple CEO Brad Garlinghouse said the SEC has “knowingly created confusion about the rules, and they used that confusion through enforcement.”</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\">Crypto regulation — Does SEC Chair Gary Gensler have the final say?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T21:41:31.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting the Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Coinbase and Cboe have partnered up for surveillance-sharing agreements on five Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) ETFs. FTX was back in the headlines with reports that one of its former executives is under investigation for campaign finance violations. A United States blockchain group is urging regulators to investigate a \"sweetheart deal\" between the Securities and Exchange Commission (SEC) and crypto firm Prometheum.</p><h3>US crypto advocacy group asks SEC to investigate Prometheum</h3><p>The Blockchain Association, a D.C.-based advocacy group, has <a href=\"https://cointelegraph.com/news/blockchain-association-calls-for-investigation-prometheum-sweetheart-sec-deal\">called on regulators to investigate Prometheum</a> after the crypto company was controversially approved for a special purpose broker-dealer (SPBD) license. </p><p>In a July 12 letter, the Blockchain Association urged the SEC's Inspector General to look into the Financial Industry Regulatory Authority's SPBD approval of Prometheum. The letter also flagged concerns about how the company's co-CEO Aaron Kaplan secured a seat in congressional testimony in June. The association described the developments as\"concerning,\" given the uncertainty around crypto securities regulation in the country.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ Today, <a href=\"https://twitter.com/BlockchainAssn?ref_src=twsrc%5Etfw\">@blockchainassn</a> submitted a letter to the SEC Office of Inspector General requesting the OIG open an investigation into potential impropriety surrounding the approval of Prometheum as a first-of-its-kind Special Purpose Broker-Dealer.<a href=\"https://twitter.com/KMSmithDC?ref_src=twsrc%5Etfw\">@KMSmithDC</a> stated: <a href=\"https://t.co/dVtTs0yMEg\">pic.twitter.com/dVtTs0yMEg</a></p>&mdash; Blockchain Association (@BlockchainAssn) <a href=\"https://twitter.com/BlockchainAssn/status/1679155795508985856?ref_src=twsrc%5Etfw\">July 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>\"We are concerned that the Commission granted Prometheum a ‘sweetheart’ deal in exchange for support of the Commission’s policy goals, or that Prometheum is leveraging personal connections with the Commission to gain an unfair advantage in the market,” the association said, adding: </p><blockquote>“Most significantly, we are concerned that [SEC] Chair [Gary] Gensler is using Prometheum and the SPBD licensure process as a means to thwart congressional efforts toward legislation by continuing to spread the false narrative that the law is already clear with regard to digital asset securities.”</blockquote><h3>Cathie Wood’s ARK sells 135K Coinbase shares as price hits $90</h3><p>Pro-Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">BTC$30,744</a> Investment veteran <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/cathie-wood%5D\">Cathie Wood</a> is taking some profits from ARK Invest’s large Coinbase holdings by selling a small portion of its stash.</p><p>On July 11, Wood’s investment firm ARK offloaded 135,152 Coinbase shares ($12 million) from one of its major exchange-traded funds (ETF), the ARK Innovation ETF. According to the trade notification seen by Cointelegraph, the amount sold made up 0.14% of the fund’s total holdings.</p><p>The sale comes as the Coinbase stock price has sharply increased. On July 11, the price briefly <a href=\"https://www.tradingview.com/symbols/NASDAQ-COIN/\" target=\"_blank\" rel=\"noopener nofollow\">surpassed</a> $90, surging from around $82 to as high as $90.9, according to data from TradingView. Following Wood’s sale, the stock closed at $89 on Tuesday.</p><p>According to TradingView data, Coinbase stock is up more than 60% over the past month, while the year-to-date increase is more than 140%.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/69005c8a-da38-4013-bd77-fc49a0b0ef1f.png\"  /></figure><h3>Cboe and Coinbase ink surveillance agreements for 5 Bitcoin ETFs</h3><p>Exchange operator Cboe amended five spot Bitcoin (BTC) ETF applications to include a surveillance-sharing agreement (SSA) with Coinbase.</p><p>Cboe said it had \"reached an agreement on terms with Coinbase\" to enter into the SSA's. The initial ETF stated the parties were \"expecting to enter\" into the agreements.</p><p>The ETF bids from Invesco, VanEck, WisdomTree, Fidelity and the joint fund by ARK Invest and 21Shares were all amended to include the SSA's and are before the Securities and Exchange Commission (SEC).</p><p>The agreements attempt to meet the SEC's standards which are aimed at preventing fraudulent conduct and protecting investors.</p><p>Coinbase shares rallied on the news, gaining around 10% on the day and reached thier highest price since Aug. 16 according to Google Finance.</p><p>Coinbase’s share price jumped nearly 10% on June 11 in response to Cboe's SSA-related filings. Source: Google Finance</p><p>The five applications follow a refiled application by Nasdaq on June 29 to list a potential spot Bitcoin ETF from BlackRock which also added an SSA with Coinbase.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T21:30:00.000Z",
    "title": "US senators reintroduce crypto bill aimed at comprehensive regulation",
    "url": "https://cointelegraph.com/news/senators-reintroduce-crypto-bill-comprehensive-regulation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/3ccc3a7d-3d2e-4827-9a97-136160bfcf25.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Responsible Financial Innovation Act will establish guardrails “to prevent another FTX-style event from occurring” in the wake of the 2022 market crash and bankruptcies. </p>\n                    <p><p>United States Sens. Cynthia Lummis and Kirsten Gillibrand will reintroduce legislation aimed at establishing a comprehensive regulatory framework for digital assets.</p><p>The U.S. lawmakers <a href=\"https://twitter.com/SenLummis/status/1679149616175140864\" target=\"_blank\" rel=\"noopener nofollow\">said</a> they would reintroduce the Responsible Financial Innovation Act to the Senate on July 12 after roughly a year of being tabled in the previous session of Congress. The bipartisan piece of legislation — Lummis is a member of the Republican Party, and Gillibrand is a Democrat — was aimed at clarifying the roles of the Securities and Exchange Commission (SEC) and Commodity Futures Trading Commission in regulating digital assets, as well as providing consumer protection.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The crypto asset industry is here to stay.<br><br>Today, <a href=\"https://twitter.com/SenGillibrand?ref_src=twsrc%5Etfw\">@SenGillibrand</a> and I are reintroducing landmark legislation to create a federal regulatory framework that allows crypto businesses and investors to prosper here in America while protecting consumers from bad actors. <a href=\"https://t.co/z2pr0evWt2\">pic.twitter.com/z2pr0evWt2</a></p>— Senator Cynthia Lummis (@SenLummis) <a href=\"https://twitter.com/SenLummis/status/1679149616175140864?ref_src=twsrc%5Etfw\">July 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The Lummis-Gillibrand bill was first introduced in June 2022 amid the crypto market crash that resulted in the bankruptcies of several high-profile firms and the price of many tokens plummeting. According to the fact sheet provided by Lummis, the updated legislation will include updates to the U.S. tax code allowing the industry “to fund its own oversight,” as well as guardrails “to prevent another FTX-style event from occurring” — the crypto exchange collapsed in November 2022 after the bill was introduced.</p><p>Lummis’ and Gillibrand’s bill was drafted after the collapse of Terraform Labs, the South Korea-based firm that saw its algorithmic stablecoin depeg from the U.S. dollar. As a result, the legislation will also require payment stablecoins to be issued only by depository institutions.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/u-s-senator-lummis-revamps-efforts-for-crypto-regulations-amid-sec-lawsuits\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/u-s-senator-lummis-revamps-efforts-for-crypto-regulations-amid-sec-lawsuits/amp\"><strong><em>US senator revamps efforts for crypto regulations amid SEC lawsuits</em></strong></a></p><p>Some lawmakers and industry leaders have criticized U.S. regulators for a lack of clarity that would allow firms to operate without risk of enforcement actions or other crackdowns. Many in the space have <a href=\"https://twitter.com/krakenfx/status/1679205166929813509\" target=\"_blank\" rel=\"noopener nofollow\">praised</a> the Lummis-Gillibrand bill for taking bipartisan action at a time when some elected officials have politicized aspects of the crypto space — from Sen. Elizabeth Warren <a href=\"https://cointelegraph.com/news/sen-elizabeth-warren-points-to-crypto-payments-as-facilitating-fentanyl-trade-in-china\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sen-elizabeth-warren-points-to-crypto-payments-as-facilitating-fentanyl-trade-in-china/amp\">highlighting illicit uses</a> of digital assets to Florida governor and 2024 presidential candidate Ron DeSantis <a href=\"https://cointelegraph.com/news/florida-gov-and-us-presidential-hopeful-calls-for-cbdc-ban\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/florida-gov-and-us-presidential-hopeful-calls-for-cbdc-ban/amp\">calling for a ban</a> on central bank digital currencies.</p><p>While the Responsible Financial Innovation Act is one option, members of the House of Representatives have proposed other legislation aimed at addressing a framework for cryptocurrencies. A discussion draft released in June in the House would <a href=\"https://cointelegraph.com/news/us-lawmakers-aim-for-crypto-regulatory-clarity-with-proposed-bill-putting-the-screws-to-sec\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-lawmakers-aim-for-crypto-regulatory-clarity-with-proposed-bill-putting-the-screws-to-sec/amp\">largely limit the SEC’s authority</a> over crypto firms, while the House Financial Services Committee has also drafted legislation proposing the Federal Reserve <a href=\"https://cointelegraph.com/news/us-house-committee-releases-new-stablecoin-bill-draft\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-house-committee-releases-new-stablecoin-bill-draft/amp\">become the main regulator</a> behind establishing requirements for stablecoins.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/senators-reintroduce-crypto-bill-comprehensive-regulation&utm_source=cointelegraph_com&utm_medium=appendix&utm_campaign=articles\" data-amp=\"https://mint-cointelegraph-com.cdn.ampproject.org/c/s/mint.cointelegraph.com/?url=https://cointelegraph.com/news/senators-reintroduce-crypto-bill-comprehensive-regulation&utm_source=cointelegraph_com&utm_medium=appendix&utm_campaign=articles/amp\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n\n\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T21:13:28.000Z",
    "title": "US government moves nearly 10K Bitcoin worth over $300M related to Silk Road seizure",
    "url": "https://cointelegraph.com/news/us-government-doj-moves-nearly-10k-bitcoin-related-to-silk-road-seizure",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/6c7638e9-65c0-479a-aaa9-8ac58177fa51.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The government previously promised to liquidate approximately 40,000 remaining BTC from the seizure in “four more batches” over the remainder of the calendar year.</p>\n                    <p><p>A cryptocurrency wallet associated with the United States Department of Justice (DOJ) <a href=\"https://www.blockchain.com/explorer/addresses/btc/bc1qmxjefnuy06v345v6vhwpwt05dztztmx4g3y7wp\" target=\"_blank\" rel=\"noopener nofollow\">moved</a> approximately 9,825.25 Bitcoin worth around $299 million in a series of transactions on July 12. </p><p>It’s unclear at this time whether the transactions, which appear to have ultimately propagated to at least 101 new wallets, were sent to exchange addresses for sale or remain in the custody of the Justice Department.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/a9faa977-046c-40a6-bc5c-706ebadd8ffc.jpg\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>DOJ Bitcoin transactions. Source: Screenshot via Blockchain.com</em></figcaption></figure><p>Initially, approximately 9,825 of the Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) associated with the Silk Road seizure moved in a pair of transactions sent to three addresses at around 1:00 pm UTC. The bulk of the coins — 8,200 BTC worth nearly $250 million as of the time of this article’s publication — were sent to a single address, which subsequently <a href=\"https://www.blockchain.com/explorer/addresses/BTC/361yogPsasxJz6JAaFskmWZes14Gs38ikj\" target=\"_blank\" rel=\"noopener nofollow\">split</a> the total amount across 101 separate addresses a little over an hour later:</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/3813ac2e-63cc-401f-b8d7-dfa18e975bfe.jpg\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>An 8,200 BTC transaction from a wallet that received coins originating from the DOJ. Source: Screenshot via Blockchain.com</em></figcaption></figure><p>The U.S. government previously revealed that it had plans to offload the rest of its BTC from the Silk Road seizure over the course of four batch transactions throughout the remainder of the calendar year. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/us-government-plans-to-sell-41k-bitcoin-connected-to-silk-road\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-government-plans-to-sell-41k-bitcoin-connected-to-silk-road/amp\"><strong><em>US government plans to sell 41K Bitcoin connected to Silk Road</em></strong></a></p><p>According to current on-chain data, it’s possible the U.S. government could be <a href=\"https://www.blockchain.com/explorer/addresses/btc/367YoRXht9x28BupqPaVnYfoM1xQP6XG4k\" target=\"_blank\" rel=\"noopener nofollow\">testing</a> liquidity strategies. One account associated with batch transactions conducted on March 7, 2023 appears to have <a href=\"https://bitinfocharts.com/bitcoin/address/bc1qf2yvj48mzkj7uf8lc2a9sa7w983qe256l5c8fs\" target=\"_blank\" rel=\"noopener nofollow\">profited</a> in the amount of $237,934,919 on 30,174.7 in BTC holdings not currently associated with the July 12 batch of transactions.</p><p>However, another account that received 9,825.6 BTC from the DOJ during the March 7 batch distributed those coins among 101 accounts. The same account later joined 599 other accounts to <a href=\"https://www.blockchain.com/explorer/addresses/btc/bc1qkxtk5z6f3f9tvat8c4dwtdqgpxwmxtrvjxam5w\" target=\"_blank\" rel=\"noopener nofollow\">send</a> a total of approximately 0.1 BTC (about $3,032 as of the time of this article’s publication) to yet another account, which then spread its holdings of approximately 51 BTC across 37 addresses. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/adc5b3ed-7f31-4fd2-801c-83edcb26099c.jpg\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>An approximately 51 BTC transaction from a wallet that received coins originating from the DOJ. Source: Screenshot via Blockchain.com</em></figcaption></figure><p>While speculation abounds about the exact nature of the transactions, which now span some 800-plus wallet addresses, the sheer number of transactions and associated wallets makes tracking exactly what the U.S. government is doing with each coin an increasingly challenging endeavor.</p><p>This lack of certainty has led some members of the crypto community to fear that BTC is being “nuked” or that the U.S. government’s wake-inducing coin movement will ripple throughout the cryptocurrency economy and cause investors to abandon what some see as the early stages of a bull run. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Bullish CPI and <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&ref_src=twsrc%5Etfw\">#bitcoin</a> nuked<br><br>Not a good sign</p>— Algod (@AlgodTrading) <a href=\"https://twitter.com/AlgodTrading/status/1679177143757029397?ref_src=twsrc%5Etfw\">July 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Other enthusiasts have <a href=\"https://twitter.com/itsLilCam/status/1679177926078611457\" target=\"_blank\" rel=\"noopener nofollow\">dismissed</a> such commentary as unnecessary fear, uncertainty and doubt based on the lack of tidal movement — more than six hours after the transactions were clocked, BTC has seen less than 1% of market movement. </p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/us-government-doj-moves-nearly-10k-bitcoin-related-to-silk-road-seizure&utm_source=cointelegraph_com&utm_medium=appendix&utm_campaign=articles\" data-amp=\"https://mint-cointelegraph-com.cdn.ampproject.org/c/s/mint.cointelegraph.com/?url=https://cointelegraph.com/news/us-government-doj-moves-nearly-10k-bitcoin-related-to-silk-road-seizure&utm_source=cointelegraph_com&utm_medium=appendix&utm_campaign=articles/amp\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T21:02:31.000Z",
    "title": "‘AI helps traders utilize more intuitive strategies,' says exchange",
    "url": "https://cointelegraph.com/news/ai-helps-traders-utilize-more-intuitive-strategies-says-exchange",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/2b1fd89a-966f-4bd3-a75f-78d3760514f3.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitget currently has a martingale AI trading bot and a grid trading AI bot on its platform. </p>\n                    <p><p>On July 11, cryptocurrency exchange Bitget launched an artificial intelligence (AI)-powered feature for its grid trading strategies, leveraging the use of trading algorithms to automate transactions for users. In an interview with Cointelegraph, Bitget developers stated:</p><blockquote>“Compared with manually creating strategies by filling in obscure and complex strategy parameters, AI strategies can help users choose and create strategies more intuitively through a simple number (strategy rate of return) and a simple graph (yield curve), eliminating the need to fill in complex variables.\"</blockquote><p>In its AI grid trading bot, users are only required to fill in the desired strategy and input the investment amount. The small language model iterates thousand of parameters and can create tens of different strategies within the same currency pair. Its intricate, surgical focus differs from large language models, such as ChatGPT, which can possess hundreds of billions of parameters and are intended for generic use.</p><p>Similar to its martingale AI bot unveiled in June, different AI strategies have different parameter settings, such as the number of positions added, the multiplier of the amount added to the position and the take-profit percentage.</p><p>The need for the small language model AI trading bot to synchronize price data in real time among multiple users nevertheless presents a challenge. To address this problem, Bitget developers wrote:</p><blockquote>“In order to cope with the situation that a large number of users use the AI grid strategy at the same time, we have adopted distributed computing and load balancing technology to effectively improve the concurrent processing capability of the system.\"</blockquote><p>In simpler terms, Bitget says its AI trading bot distributes transactions “to multiple nodes for processing,\" thereby mitigating a single point of failure and ensuring high tolerance. When it comes to limitations, the development team said:</p><blockquote>“The current AI strategy is mainly to provide users with reference to strategy parameters, and the strategy selection based on future market judgments is still done by users.\"</blockquote><p>In the next phase, Bitget plans to develop an AI bot capable of learning price prediction, although it is currently under intense research and development. Previously, the exchange <a href=\"https://cointelegraph.com/news/bitget-pledges-10m-for-fetch-ai-ecosystem-amid-chatgpt-boom\">pledged $10 million</a> on April 27 to the Fetch.ai blockchain ecosystem amid the ChatGPT boom. </p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/ai-helps-traders-utilize-more-intuitive-strategies-says-exchange&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/make-500-from-chatgpt-stock-tips-bard-leans-left-100m-ai-memecoin-ai-eye/\">Make 500% from ChatGPT stock tips? Bard leans left, $100M AI memecoin</a></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T20:20:42.000Z",
    "title": "BNB’s soaring futures open interest and regulatory woes weigh on the altcoin’s price",
    "url": "https://cointelegraph.com/news/bnb-s-soaring-futures-open-interest-and-regulatory-woes-weigh-on-the-altcoin-s-price",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/2aa3ff67-9248-4ae5-bffd-749e7bfd08c7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Persistent regulatory actions and concerning derivatives data are likely the main factors behind BNB’s bearish price action. </p>\n                    <p><p>The price of BNB has experienced a 24.5% decline over the past 90 days, despite a 7% gain between July 10 and July 11. BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/binance-coin-price-index\">BNB</a>) has performed worse than the overall altcoin market, indicating that the underlying cause for the bearish momentum persists.</p><p>It is highly likely that the correction in BNB’s price can be <a href=\"https://cointelegraph.com/news/sec-s-binance-suit-contains-heady-mix-of-predictable-charges-novel-revelations\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/sec-s-binance-suit-contains-heady-mix-of-predictable-charges-novel-revelations/amp\">attributed to the lawsuit</a> filed by the U.S. Securities and Exchange Commission against Binance and its CEO, Changpeng “CZ”s Zhao, on June 5, as the decoupling coincides with that event.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/8f0e889f-e551-4654-b495-2dbf48ae52d9.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>BNB/USDT (blue) versus altcoin market capitalization since April 2023. Source: TradingView</em></figcaption></figure><p>To gain a more comprehensive understanding of the situation, analyzing <a href=\"https://cointelegraph.com/trading-for-beginners/crypto-derivatives\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/crypto-derivatives/amp\">derivatives contracts</a> provides valuable insights into the positions of whales and market makers. </p><h2>Is the recent BNB price rally sustainable?</h2><p>This analysis should highlight whether the surge above $245 on July 11 is supported by an improvement in sentiment or a balanced demand for leverage through BNB derivatives.</p><p>Price is undoubtedly the most important metric for understanding traders’ sentiment, but it does not encompass all possibilities. For instance, between August 2022 and September 2022, BNB outperformed the altcoin market by 19%. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/3e40b625-beed-4d1b-b65d-24c68db8a93e.png\"><figcaption style=\"text-align: center;\"><em>BNB/USDT (blue) versus altcoin market capitalization in late 2022. Source: TradingView</em></figcaption></figure><p>Regardless of the rationale behind BNB’s rally in 2022, one might conclude that the recent 90-day negative 24.5% performance represents a reversion to the mean as investors no longer believe the premium is justified.</p><p>While no metric is flawless, one should begin by examining the open interest in BNB futures markets to gain a broad overview of the demand for leverage during the recent underperformance.</p><h2>BNB futures open interest rose, but is it bullish? </h2><p>In futures markets, long and short positions are always balanced, but a higher number of active contracts, or open interest, is generally positive, as it allows institutional investors, who require a certain market size, to participate. Moreover, a significant increase in the number of contracts in play typically indicates increased trader involvement.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/703699c6-c0bb-415f-89c9-89d04302bdb6.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>BNB futures aggregate open interest in USD. Source: CoinGlass</em></figcaption></figure><p>Notice how the BNB futures open interest surged from $355 million on July 5 to the current $476 million, approaching its highest level in 18 months. This data leaves no doubt about the demand increase for leverage using futures contracts.</p><p>The previous peak in open interest, at $490 million, occurred on Nov. 5, 2022. Interestingly, on that very day, the price of BNB reached a six-month high, followed by a significant correction of 28% in the subsequent five days.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/f0c4fcca-a060-4470-80f7-7479f9c9988a.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>BNB/USDT price at Binance in late 2022. Source: TradingView</em></figcaption></figure><p>However, open interest does not necessarily indicate bullish or bearish sentiment among professional investors. The futures annualized premium measures the difference between longer-term futures contracts and the current spot market levels.</p><p>The futures premium, or basis rate, should ideally range between 5 and 10% to compensate traders for \"locking in\" their funds until the contract expiry. Therefore, levels below this range are bearish, while figures above 10% indicate excessive optimism.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/3b74834c-9f7b-4bbf-8d4f-e05aa1a65743.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>BNB 3-month futures annualized premium. Source: Laevitas</em></figcaption></figure><p>The current negative premium suggests that short sellers are paying 10% per year to maintain their positions. While this data aligns with typical bearish markets, it has been the norm for BNB rather than an exception. Furthermore, similar instances of a negative 10% futures premium occurred on March 17 and April 22, although they lasted for less than a week in total.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/296b2dda-807b-4dd7-82f7-0c4220125b50.png\"><figcaption style=\"text-align: center;\"><em>BNB/USDT price at Binance. Source: TradingView</em></figcaption></figure><p>In terms of price, March 18 marked the end of a bull run that peaked at $345, followed by an 11.5% correction to $306 over the next 10 days. Similarly, when the BNB futures premium returned from the negative 10% level on April 26, the price of BNB declined by 12% in the following 16 days.</p><h2>BNB short positions may have been used to bypass vesting and lockup periods</h2><p>Although it is impossible to establish causation and correlation, the data suggests that investors may be shorting BNB futures contracts to clear out spot order books and potentially trigger price pumps. Other possible explanations for a significant BNB futures premium include lockups, where BNB holders are restricted from selling their positions but seek to reduce exposure nevertheless. </p><p>These vesting periods could be a result of formal contracts with current or former employees and partners, or restrictions imposed by smart contracts. The agreements typically are on staked tokens or used as guarantees for launchpads and similar projects. Therefore, attempting to attribute this strategy to a single entity is rarely productive.</p><p>The derivatives data points to an increased appetite for leverage using futures contracts, particularly by shorts, considering the negative premium. This exerts downward pressure on BNB’s price as long as the futures premium remains negative. Although there is no guarantee that the price action will repeat itself, the current derivatives data does not support bullish momentum for BNB.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/bnb-s-soaring-futures-open-interest-and-regulatory-woes-weigh-on-the-altcoin-s-price&utm_source=cointelegraph_com&utm_medium=appendix&utm_campaign=articles\" data-amp=\"https://mint-cointelegraph-com.cdn.ampproject.org/c/s/mint.cointelegraph.com/?url=https://cointelegraph.com/news/bnb-s-soaring-futures-open-interest-and-regulatory-woes-weigh-on-the-altcoin-s-price&utm_source=cointelegraph_com&utm_medium=appendix&utm_campaign=articles/amp\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p>\n\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-12T22:55:56.000Z",
    "title": "Google Play updates terms to allow blockchain content for Android in Play Store",
    "url": "https://cryptoslate.com/google-play-updates-terms-to-allow-blockchain-content-for-android-in-play-store/",
    "description": "<p>In a significant move, Google Play announced on July 12 that it has expanded its Android app store rules to accommodate new blockchain content, although under fairly strict rules. That announcement said that the updated policy would &#8220;open new ways to transact blockchain-based digital content within apps and games.&#8221; The post specifically suggested that apps [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/google-play-updates-terms-to-allow-blockchain-content-for-android-in-play-store/\">Google Play updates terms to allow blockchain content for Android in Play Store</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-12T22:00:22.000Z",
    "title": "IRS investigating American crypto exodus to Puerto Rico",
    "url": "https://cryptoslate.com/irs-investigating-american-crypto-exodus-to-puerto-rico/",
    "description": "<p>The U.S. Internal Revenue Service (IRS) is pursuing tax dodgers who abused Puerto Rico&#8217;s tax structures, Bloomberg reported on July 12. Puerto Rico has offered significant tax incentives to cryptocurrency traders, hedge fund managers, and other American investors since 2012. This policy has allowed some investors to legally avoid paying federal income tax and no [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/irs-investigating-american-crypto-exodus-to-puerto-rico/\">IRS investigating American crypto exodus to Puerto Rico</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-12T21:00:25.000Z",
    "title": "BNB Beacon Chain to introduce two security updates in upcoming hard fork",
    "url": "https://cryptoslate.com/bnb-beacon-chain-to-introduce-two-security-updates-in-upcoming-hard-fork/",
    "description": "<p>BNB&#8217;s Beacon Chain will soon undergo its &#8220;ZhangHeng&#8221; upgrade, according to an announcement from the project&#8217;s blog on July 12. That post indicates that the beacon chain mainnet will undergo a hard fork upgrade at block height 328,088,888 on July 19, 2023, at 6:00 UTC. The project&#8217;s announcement described two major changes in this upgrade. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bnb-beacon-chain-to-introduce-two-security-updates-in-upcoming-hard-fork/\">BNB Beacon Chain to introduce two security updates in upcoming hard fork</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-12T20:10:46.000Z",
    "title": "Elon Musk formally enters the AI market with new company, xAI",
    "url": "https://cryptoslate.com/elon-musk-formally-enters-the-ai-market-with-new-company-xai/",
    "description": "<p>Elon Musk, CEO of Tesla, SpaceX, and Twitter, has announced the launch of his new artificial intelligence (AI) company, xAI, today. Musk, who was once part of the AI research nonprofit OpenAI, is now stepping into the arena with a venture that aims to &#8220;understand the true nature of the universe.&#8221; The fledgling company’s team, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/elon-musk-formally-enters-the-ai-market-with-new-company-xai/\">Elon Musk formally enters the AI market with new company, xAI</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-13T00:12:00.000Z",
    "title": "MicroStrategy Could Sell Off Bitcoin To Repay Debt if $BTC Price Plunges: Bernstein Report",
    "url": "https://www.cryptoglobe.com/latest/2023/07/microstrategy-could-sell-off-bitcoin-to-repay-debt-if-btc-price-plunges-bernstein-report/",
    "description": "Brokerage firm Bernstein has recently shed light on the precarious financial balancing act of MicroStrategy (MSTR), with the tech giant’s strategy of bolstering its coffers through long-term debt potentially prompting the liquidation of its BTC reserves, but only if the cryptocurrency experiences a significant prices drop. Bernstein’s report details that these extreme price corrections could […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-12T21:50:00.000Z",
    "title": "$BTC: ‘Rich Dad Poor Dad’ Author Predicts Bitcoin Surge to $120K as BRICS Prepares to Launch Gold-Backed Currency",
    "url": "https://www.cryptoglobe.com/latest/2023/07/btc-rich-dad-poor-dad-author-predicts-bitcoin-surge-to-120k-as-brics-prepares-to-launch-gold-backed-currency/",
    "description": "Robert Kiyosaki, best known for his influential personal finance book, “Rich Dad Poor Dad,” has predicted that Bitcoin could surge to an astounding $120,000 in the near term at a time in which the BRICS nations are preparing to launch a gold-backed currency. In a tweet shared with Kiyosaki’s over 2 million followers on the […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-13T01:30:06.000Z",
    "title": "US Inflation Hits Two-Year Low, Boosting Stocks and Precious Metals",
    "url": "https://news.bitcoin.com/us-inflation-hits-two-year-low-boosting-stocks-and-precious-metals/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/cold-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"US Inflation Hits Two-Year Low, Boosting Stocks and Precious Metals\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/cold-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/cold-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/cold-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/cold-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/cold-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/cold-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/cold.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On Wednesday, July 12, 2023, the U.S. Bureau of Labor Statistics released the Consumer Price Index report for June, showing a 3% increase in inflation, the lowest level since March 2021. The U.S. inflation rate has fallen for 12 consecutive months, with the index rising 0.2% on a monthly basis. Labor Department’s CPI Data Shows [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-13T00:00:27.000Z",
    "title": "Economist Predicts End of US Dollar Dominance as More Countries De-Dollarize",
    "url": "https://news.bitcoin.com/economist-predicts-end-of-us-dollar-dominance-as-more-countries-de-dollarize/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/sp-dedollarization-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Economist Predicts End of US Dollar as Dominant World Currency as More Countries De-Dollarize\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/sp-dedollarization-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sp-dedollarization-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sp-dedollarization-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sp-dedollarization-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sp-dedollarization-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sp-dedollarization-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sp-dedollarization.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The chief economist at S&#38;P Global has predicted that the U.S. dollar “will no longer be the dominant world currency.” Highlighting the diminishing influence of the USD, he pointed out that an increasing number of countries are de-dollarizing, noting that the Chinese yuan is growing in popularity as a trading currency. Economist Expects US Dollar [&#8230;]"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-12T22:00:06.000Z",
    "title": "Leveraged Yield Protocol Rodeo Finance Initially Loses $1.7 Million in ‘Force-Investment’ Hack",
    "url": "https://news.bitcoin.com/leveraged-yield-protocol-rodeo-finance-initially-loses-1-7-million-in-force-investment-hack/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1119263285-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Leveraged Yield Protocol Rodeo Finance Initially Loses $1.7 Million in &#039;Force-Investment&#039; Hack\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1119263285-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1119263285-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1119263285-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1119263285-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1119263285-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1119263285-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1119263285.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Rodeo Finance, a leveraged yield protocol on Arbitrum, was on July 10 a victim of a &#8220;force-investment&#8221; hack in which almost $1.7 million was reportedly stolen. According to Rodeo Finance, about $810,000 has been recovered so far and there are plans to freeze the stolen funds. Protocol in &#8216;Paused State&#8217; Rodeo Finance, a leveraged yield [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-13T01:22:07.000Z",
    "title": "Elon Musk Unveils xAI to Challenge OpenAI and Google DeepMind in the AI Arena",
    "url": "https://www.cryptopolitan.com/elon-musk-xai-vs-openai-and-google-deepmind/",
    "description": "Elon Musk has announced the launch of his own artificial intelligence company, xAI, as a competitor to OpenAI and Google DeepMind. Musk criticizes OpenAI&#8217;s ChatGPT program for alleged political bias and irresponsibility. With xAI, Musk aims to understand reality and tackle life&#8217;s fundamental questions while benefiting his other companies, including Tesla and Twitter. Former researchers ... <a title=\"Elon Musk Unveils xAI to Challenge OpenAI and Google DeepMind in the AI Arena\" class=\"read-more\" href=\"https://www.cryptopolitan.com/elon-musk-xai-vs-openai-and-google-deepmind/\" aria-label=\"More on Elon Musk Unveils xAI to Challenge OpenAI and Google DeepMind in the AI Arena\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-13T01:09:16.000Z",
    "title": "AI-Enhanced Companion Robots Offer Potential Solution to Loneliness Epidemic, Science Robotics Report",
    "url": "https://www.cryptopolitan.com/ai-enhanced-companion-robots-to-loneliness/",
    "description": "A recent report by researchers from Auckland, Duke, and Cornell Universities highlights the potential of AI-enhanced companion robots in addressing the growing loneliness epidemic. Published in the July 12 issue of Science Robotics, the report emphasizes the need for stakeholders, including governments, policymakers, technologists, and clinicians, to collaborate and develop trust, agency, engagement, and real-world ... <a title=\"AI-Enhanced Companion Robots Offer Potential Solution to Loneliness Epidemic, Science Robotics Report\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-enhanced-companion-robots-to-loneliness/\" aria-label=\"More on AI-Enhanced Companion Robots Offer Potential Solution to Loneliness Epidemic, Science Robotics Report\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T21:51:12.000Z",
    "title": "U.S. government moves $300 million in Bitcoin seized from Silk Road",
    "url": "https://www.cryptopolitan.com/u-s-government-moves-300-million-in-bitcoin-seized-from-silk-road/",
    "description": "Two wallets linked to the U.S. government, associated with the infamous Silk Road seizure, have caught the attention of crypto watchers as they shuffled around over $300 million in Bitcoin across three transactions on Wednesday. Notably, Bitcoin&#8217;s price fell to $30,480 following the transactions. According to on-chain data, the government-controlled wallets conducted transactions involving a ... <a title=\"U.S. government moves $300 million in Bitcoin seized from Silk Road\" class=\"read-more\" href=\"https://www.cryptopolitan.com/u-s-government-moves-300-million-in-bitcoin-seized-from-silk-road/\" aria-label=\"More on U.S. government moves $300 million in Bitcoin seized from Silk Road\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T20:58:45.000Z",
    "title": "Google to let blockchain and NFT apps on Android",
    "url": "https://www.cryptopolitan.com/google-to-let-blockchain-nft-apps-on-android/",
    "description": "Bridging the gap between technology and transparency, Google is set to integrate blockchain and non-fungible tokens (NFTs) into its Android platform. Having announced a policy shift earlier this year to facilitate clearer NFT guidelines, Google has now disclosed a comprehensive set of rules regulating these innovative digital experiences. Google&#8217;s embrace of blockchain technology Underlining the ... <a title=\"Google to let blockchain and NFT apps on Android\" class=\"read-more\" href=\"https://www.cryptopolitan.com/google-to-let-blockchain-nft-apps-on-android/\" aria-label=\"More on Google to let blockchain and NFT apps on Android\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T20:22:51.000Z",
    "title": "U.S. inflation falters further – Here is what the numbers show",
    "url": "https://www.cryptopolitan.com/us-inflation-falters-further-the-numbers/",
    "description": "U.S. inflation, a persistent worry over the past year, has been noticeably tamed, with rates dwindling to 3% in June, presenting a stark contrast to other advanced economies grappling with high inflation figures. The latest reports have triggered a dip in the dollar while also showcasing the Federal Reserve&#8217;s effective management of price pressures. A ... <a title=\"U.S. inflation falters further &#8211; Here is what the numbers show\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-inflation-falters-further-the-numbers/\" aria-label=\"More on U.S. inflation falters further &#8211; Here is what the numbers show\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-12T20:18:04.000Z",
    "title": "Cboe amends Bitcoin ETF filing after surveillance agreement with Coinbase",
    "url": "https://www.cryptopolitan.com/cboe-amends-etf-filing-coinbase-agreement/",
    "description": "Cboe Global Markets, a prominent exchange operator, has made revisions to five spot Bitcoin (BTC) Exchange-Traded Fund (ETF) applications by incorporating a surveillance-sharing agreement (SSA) with Coinbase. The Cboe ETF amendments were submitted to the United States Securities and Exchange Commission (SEC) on July 11. The ETFs in question are proposed by Invesco, VanEck, WisdomTree, ... <a title=\"Cboe amends Bitcoin ETF filing after surveillance agreement with Coinbase\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cboe-amends-etf-filing-coinbase-agreement/\" aria-label=\"More on Cboe amends Bitcoin ETF filing after surveillance agreement with Coinbase\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-12T21:00:27.000Z",
    "title": "Paradigm VC Firm Displays Long-Term Interest in Crypto and AI, InQubeta (QUBE) and Fetch (FET) Surge",
    "url": "https://nulltx.com/paradigm-vc-firm-displays-long-term-interest-in-crypto-and-ai-inqubeta-qube-and-fetch-fet-surge/",
    "description": "Paradigm, a prominent venture capital firm in the crypto industry, is in the news for its strategic decision to expand investment focus beyond crypto and blockchain. The firm&#8217;s recent adjustments to its website indicate a growing interest in emerging technologies, including artificial intelligence (AI). This move comes at a time when AI is significantly influencing [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-12T23:43:18.000Z",
    "title": "Golden Inu presale gains momentum: token burns and game launch fuel demand",
    "url": "https://crypto.news/golden-inu-presale-gains-momentum-token-burns-and-game-launch-fuel-demand/",
    "description": "The ongoing presale of Golden Inu, a meme coin project, has the potential to generate a high return on investment (ROI) for crypto investors"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-12T20:43:05.000Z",
    "title": "Coinbase Wallet expands functionality, releases instant messaging feature",
    "url": "https://crypto.news/coinbase-wallet-expands-functionality-releases-instant-messaging-feature/",
    "description": "Coinbase Wallet, a self-custody cryptocurrency wallet, has revealed a direct messaging feature for users to communicate with each other directly on the platform"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-12T20:32:26.000Z",
    "title": "Crypto advocacy group wants SEC to investigate Prometheum",
    "url": "https://crypto.news/crypto-advocacy-group-wants-sec-to-investigate-prometheum/",
    "description": "In response to Prometheum being granted favorable regulatory status by the SEC, the Blockchain Association has submitted a letter to the SEC's Inspector General, calling for an investigation"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-12T20:17:37.000Z",
    "title": "Early investors of Golden Inu’s GOLDEN are up 10X since June",
    "url": "https://crypto.news/early-investors-of-golden-inus-golden-are-up-10x-since-june/",
    "description": "Investors who purchased Golden Inu's BEP-20 token in June are in profit after GOLDEN rallied 10X in less than six weeks "
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-12T23:00:56.000Z",
    "title": "Litecoin Becomes 10th-Largest Cryptocurrency, But Is There Still Room To Run?",
    "url": "https://www.newsbtc.com/analysis/ltc/litecoin-becomes-10th-largest-cryptocurrency/",
    "description": "Litecoin has seen one of the most impressive runs of any cryptocurrency over the last couple of weeks and this run has propelled the altcoin’s standing in the industry. After rallying more than 30% over a period of three weeks, the digital asset is now the 10th-largest cryptocurrency in the space. LTC&#8217;s Market Cap Crosses $7.1 Billion In the space of a month, the price of Litecoin’s native LTC token shot up from its June lows of $71 and moved as high as $115 before the rally burned out. Following this, the market cap of the digital asset moved up rapidly, beating out some heavy hitters in the space. Related Reading: Bitcoin Sharks And Whales Go On $2.15 Billion Buying Spree, Is It Time To Sell? Currently, the market cap of the altcoin is sitting above $7.1 billion, despite the price falling back below the $100 level. Its market cap now makes it the 10th-largest cryptocurrency in the market, coming out ahead of the likes of Polygon (MATIC), Tron (TRX), and Bitcoin Cash (BCH). Litecoin’s standing now makes it the seventh most valuable cryptocurrency in the market when stablecoins are removed from the top 10. This move has also solidified Litecoin’s position as an important player, despite its price correction. LTC price hits local high of $115 before correction &#124; Source: LTCUSD on TradingView.com Could Litecoin Run Further From Here? The biggest bull case for the price of LTC is the Litecoin halving event that is coming up. Only 20 days away from now, investors are already gearing up for what is expected to be a very significant event. These expectations also naturally extend to the price and this could be the reason that the digital asset’s price continues to rise. Just the anticipation from the last month alone has seen the price cross $115 at its local high. But as the event draws closer and this bullish sentiment continues, the LTC price could quickly reclaim this price and run another 50%. LTC halving event happening in 20 days &#124; Source: Litecoin Halving In one instance, crypto analyst Michael van de Poppe has predicted that LTC could rally as high as $200 off the halving event alone. If this happens, then investors could be looking at gains of over 100% just from the current bounce-off point. However, one concern is that the Litecoin halving could end up being a ‘buy the rumor, sell the news’ event. Examples of this have been the Cardano Alonzo upgrade in 2021 and Ethereum’s Shapella upgrade in 2023. Related Reading: Analysts Puts Bitcoin At $125,000 By 2024, How Is This Possible? In both of these cases, the token prices rallied in the weeks leading up to the event but eventually fell flat and retraced once the event was completed. So if Litecoin ends up in the same trend, then it would be best to sell in the weeks leading up to the event. For now, LTC’s price is still holding steady at $97, despite nursing 8.09% losses on the 7-day chart. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-12T22:00:49.000Z",
    "title": "Chainlink Price Stalls At Key Support Level, Have The Bears Taken Over?",
    "url": "https://www.newsbtc.com/news/chainlink/chainlink-price-stalls-at-key-support-level-have-the-bears-taken-over/",
    "description": "Over the past week, the Chainlink price has been hovering around its local support level, as altcoins have displayed similar indecisiveness in response to broader market sentiment. However, in the last 24 hours, Bitcoin and LINK experienced slight gains on their charts. Related Reading: Celsius Takes Legal Action Against StakeHound For Withholding $150 Million LINK saw a 1.5% increase, and its weekly chart indicated consolidation. The altcoin&#8217;s technical outlook seems to favor the bulls. Demand and accumulation were in the positive zone, indicating increased buying strength. While LINK painted bullish signals, it is important to note that the bullish sentiment is limited to its shorter time frame, and the higher time frame suggests a bearish sentiment. If Bitcoin retraces below $30,500, LINK is expected to fall below its local support level, invalidating bullishness. It remains crucial for LINK to surpass overhead resistance. The market capitalization of LINK has been increasing, indicating the control of buyers in the market. Chainlink Price Analysis: One-Day Chart LINK is currently trading at $6.26, below the rigid resistance of $6.50. The level above acts as the overhead ceiling for the altcoin. Despite breaking out of the bearish trendline (green), LINK has been unable to overcome immediate resistance as it remains largely bearish on the higher time frame. The rejection at $6.50 has resulted in selling pressure, which could resume if LINK fails to move above immediate resistance. A fall from the present price level would cause the coin to drop below $6 and approach $5.80. Technical Analysis Demand for LINK rose as the coin moved from the $6 level. However, sellers are expected to take over if the price action stalls again. The Relative Strength Index has moved away from the 50-mark, indicating an increase in buyers. Additionally, the price is currently above the 20-Simple Moving Average line, suggesting that buyers are driving the price momentum in the market. As demand for LINK increased, investor confidence also grew. The Chaikin Money Flow, which measures capital inflows vs. outflows, is currently above the half-line, indicating that capital inflows are higher than outflows. Meanwhile, the Moving Average Convergence Divergence (MACD) reflects price momentum and reversals. However, the indicator has formed red histograms on the half-line, signaling the onset of bearish action and potential sell signals for the altcoin. Related Reading: Polygon Volume Registers Sharp Increase, What Does It Mean? Therefore, it is crucial for LINK to break past the $6.50 resistance level; otherwise, the bears will have full control over the asset. Featured image from UnSplash, charts from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-12T21:00:14.000Z",
    "title": "Fund Manager Vanguard Increases Stake In Bitcoin Mining Stocks To $600 Million",
    "url": "https://www.newsbtc.com/bitcoin-news/vanguard-increases-stake-in-bitcoin-mining-stocks/",
    "description": "Bitcoin mining is a topic that keeps popping up recently on the news concerning the crypto industry. And Vanguard, one of the world’s largest investment firms, has joined in on the action, as it has increased its stake in Bitcoin mining stocks to over half a billion dollars. Vanguard Buys More Bitcoin Mining Stocks When it comes to investing in the crypto industry, Vanguard seems to be exercising more caution compared to others. While investment companies like BlackRock are filing for Spot Bitcoin ETFs, Vanguard continues to increase its stake in Bitcoin mining.  Related Reading: Conflux (CFX) Climbs By 11% As Bank of China Begins Sim Card Payment With Digital Yuan According to its recent filings with the Securities and Exchange Commission (SEC), Vanguard, one of the world&#8217;s largest investment companies controlling assets worth over $7.2 trillion, has been increasing its investment in bitcoin mining companies. Recently, the investment company firm increased the number of Marathon Digital shares it had by 60% from 10.9 million shares to 17.5 million. At the same time, it has increased the number of Riot Blockchain shares it owns to 17.9 million, an 18% increase from its previous 15.2 million shares. As a result of these investments, Vanguard now holds 10.24% of Riot and 10.31% of Marathon. Based on the current prices of the two companies&#8217; stocks, this comes close to $600 million. Stock Price Surges In Reaction To News RIOT and Marathon Digital are two of the most successful cryptocurrency mining companies in the United States, with both planning to expand their mining operations. As one of the largest investment firms in the world, Vanguard’s move signals its belief in RIOT’s long-term growth potential.  BTC price still holding above $30,000 as institutional interest grows &#124; Source: BTCUSD on TradingView.com RIOT&#8217;s share prices have already responded positively to this news, recording a 27% gain in the past 5 days, and it is now trading at $17.48, its highest price in over a year. Marathon Digital’s stock also followed suit, spiking 10% to now trade at $17.26.  The Future of Bitcoin Mining Bitcoin is one of the few cryptocurrencies still operating a proof-of-work consensus algorithm, and its mining seems to have been seeing increased activity in recent times as miners reignite their activities on the blockchain.  According to a report by published by Coin Metrics on July 5, Bitcoin miners generated a revenue of $2.4 billion during the second quarter of 2023. Out of this amount, $184 million came from transaction fees alone, representing a figure higher than the five preceding quarters combined. Related Reading: FTT Up By 21% Despite FTX Claims Portal Troubles Miners are already preparing for the next Bitcoin halving event, which will slash block rewards from 6.25 BTC to 3.125 BTC. This will drastically reduce the rate at which new BTC is being brought into circulation, possibly triggering the next bull run. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-13T00:00:46.000Z",
    "title": "Kava 14 Accelerates Cosmos Ecosystem Expansion",
    "url": "https://dailyhodl.com/2023/07/12/kava-14-accelerates-cosmos-ecosystem-expansion/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/Kava-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/Kava-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2022/09/Kava-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2022/09/Kava-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2022/09/Kava-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2022/09/Kava-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>July 12, 2023 – Georgetown, Cayman Islands Kava, a layer one blockchain that combines the developer power of Ethereum with the speed and interoperability of Cosmos, has launched the Kava 14 upgrade. This upgrade deploys &#8216;internal bridge&#8217; technology to seamlessly convert native Cosmos assets to and from Ethereum’s ERC20 token standard. Kava 14 is one [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/12/kava-14-accelerates-cosmos-ecosystem-expansion/\">Kava 14 Accelerates Cosmos Ecosystem Expansion</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-13T00:00:16.000Z",
    "title": "Crypto Analyst Flips Bearish on Litecoin, Says LTC Flashing Vibes of Late 2021 Correction",
    "url": "https://dailyhodl.com/2023/07/12/crypto-analyst-flips-bearish-on-litecoin-says-ltc-flashing-vibes-of-late-2021-correction/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/analyst-flips-bearish-ltc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/analyst-flips-bearish-ltc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/analyst-flips-bearish-ltc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/analyst-flips-bearish-ltc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/analyst-flips-bearish-ltc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/analyst-flips-bearish-ltc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/analyst-flips-bearish-ltc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto strategist believes that Litecoin&#8217;s (LTC) pre-halving rally may have already hit its peak. Pseudonymous analyst Kaleo tells his 593,200 Twitter followers that the peer-to-peer payments network may be mirroring its price action during the second half of 2021 when it rallied by over 187% only to start a multi-month bear market. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/12/crypto-analyst-flips-bearish-on-litecoin-says-ltc-flashing-vibes-of-late-2021-correction/\">Crypto Analyst Flips Bearish on Litecoin, Says LTC Flashing Vibes of Late 2021 Correction</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-12T22:01:02.000Z",
    "title": "Celsius Alleges Liquid Staking Platform StakeHound Owes It $150,000,000 in New Lawsuit",
    "url": "https://dailyhodl.com/2023/07/12/celsius-alleges-liquid-staking-platform-stakehound-owes-it-150000000-in-new-lawsuit/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/08/us-agency-files-motion-celsius.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/08/us-agency-files-motion-celsius.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/08/us-agency-files-motion-celsius.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/08/us-agency-files-motion-celsius.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/08/us-agency-files-motion-celsius.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/08/us-agency-files-motion-celsius.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/08/us-agency-files-motion-celsius.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Bankrupt crypto lender Celsius is filing a lawsuit against a liquid staking platform, claiming that the firm owes it $150 million in crypto assets. New court documents reveal that Celsius is suing StakeHound, alleging that it willfully failed to pay them $150 million worth of digital assets. In the lawsuit, Celsius is asking StakeHound to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/12/celsius-alleges-liquid-staking-platform-stakehound-owes-it-150000000-in-new-lawsuit/\">Celsius Alleges Liquid Staking Platform StakeHound Owes It $150,000,000 in New Lawsuit</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]