[
  {
    "source": "Decrypt",
    "date": "2023-07-04T13:01:28.000Z",
    "title": "New Bitcoin Standard BRC-69 Plummets Data Limit for Ordinals",
    "url": "https://decrypt.co/147270/new-bitcoin-standard-brc-69-plummets-data-limit-ordinals",
    "description": "The innovation is “recursive inscriptions,” which extract information from already existing Bitcoin inscriptions to create newer ones. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-04T13:01:00.000Z",
    "title": "Bitcoin ETF race begins: Has institutional trust returned to crypto?",
    "url": "https://cointelegraph.com/news/bitcoin-etf-race-begins-has-institutional-trust-returned-to-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/c5e2dea6-ee26-4343-9e28-54e26dce4a98.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Seven institutional firms have filed for a spot Bitcoin ETF in the U.S., including the world’s largest asset manager BlackRock, driving optimism and higher Bitcoin prices.</p>\n                    <p><p>With the Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) halving event less than a year away, several financial giants have filed applications for a spot <a href=\"https://cointelegraph.com/learn/bitcoin-etfs-a-beginners-guide-to-exchange-traded-funds\">Bitcoin exchange-traded fund (ETF)</a> — a scenario last seen before the 2020 to 2021 bull run. </p><p>Institutional interest in the sector dried up after major crypto giants such as FTX collapsed amid a prolonged crypto winter in 2022. Bitcoin and many other cryptocurrencies traded largely sideways as several crypto exchanges fell under regulatory scrutiny. </p><p>However, on news that major financial institutions such as BlackRock, Fidelity, Valkyrie and others were filing applications to list a spot Bitcoin ETF, the price of BTC recovered to over $30,000, spurring investment into the crypto market again.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/c2e1baf4-4cb6-46af-ac25-4a53c7413d63.jpeg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin one-month price chart. Source: CoinMarketCap</em></figcaption></figure><p>While several institutional giants have filed spot Bitcoin ETF applications with the United States Securities and Exchange Commission (SEC) in the past, all have either withdrawn their applications or faced outright rejections from the regulator.</p><p>The SEC approved the first Bitcoin futures ETF in October 2021 — the ProShares Bitcoin Strategy ETF — which <a href=\"https://cointelegraph.com/news/proshares-bitcoin-etf-to-debut-on-nyse-on-oct-19\">debuted on the New York Stock Exchange</a> on Oct. 19, 2021. </p><p>However, the spot Bitcoin ETF filing by the asset management giant BlackRock has increased the chances of the SEC approving the first spot Bitcoin ETF. That’s according to Bloomberg senior ETF analyst Eric Balchunas, who <a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-grayscale-sec\">gives BlackRock a 50% chance</a> of getting its spot Bitcoin ETF approved. </p><p>The most recent spate of ETF filings began with <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">BlackRock’s filing with the SEC</a> on June 16. <a href=\"https://cointelegraph.com/news/blackrock-spot-bitcoin-etf-new-sec-filings-wisdomtree-invesco\">WisdomTree, Invesco</a> and <a href=\"https://cointelegraph.com/news/valkyrie-submits-btc-spot-etf-application-to-go-with-its-futures-miners-etfs\">Valkyrie</a> also filed in the days and weeks that followed. </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/chibi-finance-1-million-alleged-rug-pull-how-it-happened\">Chibi Finance $1M alleged rug pull: How it happened</a></em></strong></p><p>On June 28, ARK Invest, which previously filed for a spot Bitcoin ETF in June 2021, <a href=\"https://cointelegraph.com/news/bitcoin-etf-race-gets-hotter-as-ark-invest-adds-surveillance-agreement-to-application\">amended its filing</a> to make it similar to that of BlackRock. The next day, asset manager Fidelity Investments also <a href=\"https://cointelegraph.com/news/fidelity-renews-push-for-spot-wise-origin-btc-trust-making-it-7th-applicant-this-year\">filed for a spot Bitcoin ETF</a>. In total, seven institutional giants have now filed for a spot Bitcoin ETF to date.</p><p>Some industry observers believe 2023 to 2024 will be crucial for approving a spot Bitcoin ETF. Robert Quartly-Janeiro, chief strategy officer of the cryptocurrency exchange Bitrue, told Cointelegraph that the timing is right, as “inflation is rampant and the money supply is a mixed picture, interest rates are high, and businesses are seeing decent revenues, which means crypto will need to perform in an economic environment where rates and inflation are key considerations.”</p><h2>Institutional trust in Bitcoin</h2><p>Bitcoin has weathered the aftermath of 2022 remarkably well and recovered more than half of its price decline during the bear market, largely thanks to the <a href=\"https://cointelegraph.com/news/us-institutions-account-for-85-of-bitcoin-buying-in-very-positive-sign-matrixport\">continued interest of institutional investors</a> in the asset. </p><p>Indeed, there <a href=\"https://cointelegraph.com/news/27-trillion-ready-for-bitcoin-btc-coinshares-cso-meltem-demirors/amp\">are significantly more institutional investors</a> in the crypto market now compared with only one year ago. Until 2022, institutions kept a safe distance from the market, with even MicroStrategy stopping its routine BTC purchases.</p><p>Many large funds and companies have become interested in cryptocurrencies and are exploring their potential to invest in them. </p><p>Despite market volatility, global institutions show a steady interest in cryptocurrencies. Bitfinex chief technology officer Paolo Ardoino told Cointelegraph that Bitcoin represents tremendous value in terms of its utility and unique nature as a perfectly scarce asset that cannot ever be debased. He said, “The most traditional financial institutions recognize that,” adding, “It’s hardly surprising that at a time of record inflation in both major industrialized economies, as well as emerging markets, that the value of Bitcoin is being better understood by markets.”</p><p>“The recent new applications for Bitcoin spot market ETFs by some of the world’s most important asset managers demonstrates that there is investor, as well as issuer demand for Bitcoin, and that will only intensify. Apart from demonstrating increased institutional demand for Bitcoin, it will also attract new retail investors and encourage broader participation,” Ardoino said.</p><p>While many institutions distanced themselves from crypto over the past year, much of that was due to the public relations disaster brought on by FTX, with bank failures further exacerbating it. Richard Gardner, CEO of Modulus, told Cointelegraph that institutions foresaw the simmering of the crypto industry, and decided to lay low and sidestep the political and public response in the aftermath of FTX, thinking they’d be able to revisit their decision before crypto surged. </p><p>“We’re at the point where they’re beginning to weigh the risk versus reward of stepping back into the fray. Most institutions will likely be far more cautious, given the FTX disaster. They’re going to largely be moved based on the regulatory environment. As governments cobble together a full regulatory regime, and as bureaucrats decide how they plan to interpret the law, institutions will gauge their response and move forward accordingly,” Gardner said.</p><p>MicroStrategy — the leading investor in Bitcoin and one of the driving forces behind institutional adoption of BTC in 2020 — has <a href=\"https://cointelegraph.com/news/micro-strategy-buys-347m-worth-of-bitcoin-amid-market-thaw\">continued its Bitcoin buying spree</a> in 2023. When the firm faced major losses as the BTC price plunged below $16,500, CEO Michael Saylor maintained it had no intention of selling and would continue to add more BTC to its treasury. MicroStrategy currently hodls 152,333 BTC acquired for roughly $4.52 billion at an average price of $29,668 per Bitcoin.</p><h2>Institutional inflow revives bull run optimism</h2><p>While the 2017 bull run was sparked by retail interest, the 2020 to 2021 bull run was sparked by institutional inflows, with the likes of MicroStrategy and Tesla, and multiple other publicly-listed companies adding Bitcoin to their balance sheet.</p><p>Gracy Chen, managing director at crypto exchange Bitget, told Cointelegraph that institutions would act swiftly once they observe “stable and predictable retail interest.” Chen said, “The cumulative impact of institutions outweighs that of individual investors, and, therefore, they will continue to be a driving force for the growth of cryptocurrency market capitalization.” </p><p>She also stressed that growing interest from institutions could further crypto adoption, helping to spark the next bull run:</p><blockquote>“Analysts expect that in the event of the approval of BlackRock’s ETF application alone, there could be a twofold increase in the price of Bitcoin. Considering BlackRock’s potential institutional investor base and influence, the approval of their spot BTC ETF would have a greater impact on the crypto market growth. With their BTC spot ETF application, they will likely inspire competition among relevant financial companies. This will direct more funds from traditional markets to Web3.”</blockquote><p>Apart from the institutional push, there have been major developments in the retail market, with Hong Kong opening the doors for crypto exchanges to offer services to retail customers. Ben Caselin, vice president at crypto exchange MaskEX, told Cointelegraph that during the previous bull run, “U.S. institutions were the primary drivers of the upsurge, but they were arguably not ready to engage deeply and behaved no different than retail, essentially chasing gains and acting on hype.”</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\">How smart people invest in dumb memecoins: 3-point plan for success</a></em></strong></p><p>“I expect this bull market to be Asia driven once again, perhaps with Hong Kong at the helm for the region, but based on my personal observations on the ground, I also expect a significant push to come from the Middle East, particularly from the United Arab Emirates, Saudia Arabia and other oil-rich jurisdictions,” he added.</p><p>With the next Bitcoin halving scheduled for April 2024, the rising interest of institutional investors is seen as a bullish sign for Bitcoin’s price and the broader crypto market. Bull runs have historically started in the run-up to the Bitcoin halving event, where the amount of BTC reward per block gets reduced by half every four years. The scarcity factor drives the price surge as retail traders and institutional giants rush to add to their Bitcoin portfolios. </p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-04T12:58:38.000Z",
    "title": "Venture capital's ICO gambits left Bitcoin ecosystem underfunded - Adam Back",
    "url": "https://cointelegraph.com/news/blockstream-ceo-adam-back-venture-capital-s-ico-gambits-left-bitcoin-ecosystem-underfunded",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/a2a54e69-0bde-44ec-97e9-ab1df0107333.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Venture capitalists have favoured ICOs in recent years, but Bitcoin-related startups are seeing renewed interest from investors.  </p>\n                    <p><p>Initial coin offerings (ICOs) may have hampered the development of the Bitcoin ecosystem, with market research reflecting a massive slant towards non-Bitcoin investments by venture capitalists over the past five years.</p><p>Blockstream CEO Adam Back highlighted the juxtaposition between the lack of venture investment in Bitcoin in comparison to its dominance of the total cryptocurrency market capitalization in conversation with Cointelegraph’s Joseph Hall in Lugano, Switzerland.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/45be5da2-b5b3-4323-8751-67f59101e79a.jpg\"  /><figcaption style=\"text-align: center;\">Adam Back alongside Cointelegraph's Joseph Hall in Switzerland.</figcaption></figure><p>Back, the inventor of Hashcash upon which Bitcoin’s proof-of-work algorithm was derived, pointed to market research <a href=\"https://tvp.fund/whitepapers/bitcoin-venture-capital-research/\" target=\"_blank\" rel=\"noopener nofollow\">published</a> by Trammell Venture Partners which detailed venture capital flows into the ICO craze in the years following the launch of Ethereum and smart contract functionality.</p><p>Back said that venture capital spending on ICOs has wound down in recent years after an initial surge in attraction to ‘early liquidity:</p><blockquote>“You know, buying discounted tokens, waiting for the company they invested in to do some marketing and then selling the discounted tokens on to retail investors before there's even a product.”</blockquote><p>Back added that ICOs had made investors a lot of money, but the phenomenon did not necessarily result in products that people can use and value getting to market because ‘incentives are misaligned’.</p><p><a href=\"https://cointelegraph.com/learn/what-is-bitcoin-a-beginners-guide-to-the-worlds-first-cryptocurrency\"><strong><em>Related: What is Bitcoin, and how does it work?</em></strong></a></p><p>Trammell Ventures’ report surveyed market data which reflects that 97% of venture capital investments over the past few years flowed into ‘crypto’ and not Bitcoin. Back highlighted ICOs, altcoins, discounted tokens and other projects all attracting investors:</p><blockquote>“That's kind of shocking if you think about it, because the actual kind of real world uses stickiness, exchange volume is the other way around, it's 90% Bitcoin or more. </blockquote><p>Back said that while the Bitcoin space is being underfunded by this category of investors, builders within the ecosystem \"produce more innovation and more product value\" when compared to ‘crypto’ ICOs that have attracted the lions’ share of VC spending.</p><p>The <a href=\"https://cointelegraph.com/news/ftx-collapse-the-crypto-industry-s-lehman-brothers-moment\">failure of FTX</a> and implosion of decentralized finance <a href=\"https://cointelegraph.com/news/breaking-terra-blockchain-officially-halted-following-luna-price-collapse\">projects like Terra/LUNA </a>may have played a role in a shift in VC funding behaviour as well. Back said that non-Bitcoin crypto products had not seen an increase in investments while Bitcoin startups were seeing renewed interest:</p><blockquote>“Bitcoin related startup investment, I think particularly at an early stage, had doubled in the last year. So that's a positive.”</blockquote><p>Meanwhile Twitter’s co-founder and Bitcoin proponent Jack Dorsey <a href=\"https://cointelegraph.com/news/jack-dorsey-relief-fund-donation-bitcoin-nonprofit\">donated</a> $5 million to Bitcoin developer support nonprofit Brink. </p><p>Back’s Blockstream and Lightning Labs <a href=\"https://cointelegraph.com/news/bitmex-research-unveils-who-funds-bitcoin-network-development\">are attributed as significant resource contributors</a> to the ongoing development of the Bitcoin protocol, both employing eight developers each dedicated to the preeminent cryptocurrency’s maintenance.</p><p><a href=\"https://cointelegraph.com/magazine/bitcoin-miami-2023-shitcoins-for-bitcoin/\"><strong><em>Magazine: Bitcoin 2023 in Miami comes to grips with ‘shitcoins on Bitcoin’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-04T12:40:48.000Z",
    "title": "Coinbase officer argues U.S. student loan ruling sets precedent for SEC on crypto regulation",
    "url": "https://cryptoslate.com/coinbase-legal-officer-suggests-student-loan-forgiveness-decision-sets-precedent-for-sec-on-crypto/",
    "description": "<p>Coinbase Chief legal officer Paul Grewal said on July 4 that the U.S. Securities and Exchange Commission&#8217;s (SEC) interpretation of &#8220;investment contract&#8221; violates the law judging by a recent Supreme Court opinion. In a July 4 Twitter thread, Grewal claimed that the SEC&#8217;s interpretation contradicts the Nebraska case&#8217;s Supreme Court&#8217;s Major Questions Doctrine opinion. He [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/coinbase-legal-officer-suggests-student-loan-forgiveness-decision-sets-precedent-for-sec-on-crypto/\">Coinbase officer argues U.S. student loan ruling sets precedent for SEC on crypto regulation</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-04T12:57:47.000Z",
    "title": "Bankrupt Voyager Digital’s Creditors Racks Up $5.1M in Legal Fees",
    "url": "https://cryptobriefing.com/bankrupt-voyager-digitals-creditors-racks-legal-fees/?utm_source=feed&utm_medium=rss",
    "description": "The creditors of the bankrupt crypto firm, Voyager Digital, face a $5.1 million bill. The New York law firm McDermott Will &#38; Emery is seeking compensation for legal services provided..."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T13:01:19.000Z",
    "title": "China’s export restrictions spark global panic in AI development",
    "url": "https://www.cryptopolitan.com/chinas-export-restrictions-on-ai-materials/",
    "description": "China has announced its intention to impose export controls on metals primarily used in the production of semiconductors for artificial intelligence (AI) systems. The Chinese Ministry of Commerce, in collaboration with the General Administration of Customs, released a joint statement on July 3, citing national security concerns as the motive behind these controls. The new ... <a title=\"China&#8217;s export restrictions spark global panic in AI development\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chinas-export-restrictions-on-ai-materials/\" aria-label=\"More on China&#8217;s export restrictions spark global panic in AI development\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T13:00:14.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 How much is LTC worth? The current price of Litecoin stands at $107. Over the past 24 hours, it has experienced a trading volume of $2.64 billion and a market capitalization of $7.82 billion. Litecoin&#8217;s market dominance is at 0.64%. However, there has been a decrease in the LTC price by ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-04T12:58:03.000Z",
    "title": "5 P2E Tokens Reviving Blockchain Gaming Demand in 2023",
    "url": "https://nulltx.com/5-p2e-tokens-reviving-blockchain-gaming-demand-in-2023/",
    "description": "The world of cryptocurrency is evolving and P2E gaming tokens are becoming more popular than ever. These games are a way to earn passive income while having some fun. Play-to-earn tokens are primarily altcoins that let users earn rewards by engaging in online activities or games. Usually, these tokens are associated with cool NFTs and [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-07-04T12:55:10.000Z",
    "title": "As Crypto Giants Like Ethereum (ETH) Experience Steady Growth, InQubeta (QUBE) Could Bring 100X ROI to its Investors",
    "url": "https://nulltx.com/as-crypto-giants-like-ethereum-eth-experience-steady-growth-inqubeta-qube-could-bring-100x-roi-to-its-investors/",
    "description": "The crypto market has witnessed significant growth over the years, with established projects like Ethereum (ETH) leading the way. However, amidst the success of these crypto giants, emerging projects such as InQubeta (QUBE) are catching the attention of investors seeking substantial returns. With its unique value proposition and potential for disruptive innovation in the AI [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-04T13:03:32.000Z",
    "title": "Credit Suisse unveils NFT collection to support women’s football",
    "url": "https://crypto.news/credit-suisse-unveils-nft-collection-to-support-womens-football/",
    "description": "Swiss investment bank Credit Suisse and the Swiss Football Association (SFA) have collaborated on an NFT collection to support women&#8217;s football, featuring 756 digital art portraits of Swiss national team players. In an official press release, the collaboration announced the&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-04T13:00:31.000Z",
    "title": "Solana (SOL) Price Targets 40% Rally Amid Strong Fundamentals",
    "url": "https://www.newsbtc.com/news/solana/solana-sol-price-targets-40-rally-strong-fundamentals/",
    "description": "The Solana (SOL) price is currently at a crucial turning point, which will be of decisive importance for the coming weeks. If the SOL bulls manage to leap above the currently most important resistance, a rally of up to 40% could be on the cards. If the bulls lose the upper hand, another plunge of up to 21% could be imminent. Crucial Moment For The SOL Price An analysis of the 1-day chart using Fibonacci retracements shows that the SOL price is at a pivotal point for the coming weeks. At the time of writing, SOL was trading at $19.19, just below the 38.2% Fibonacci retracement level. So far, SOL bulls have failed to break above this level at $19.72. If successful, the price level above $21, at which SOL was trading before the U.S. Securities and Exchange Commission (SEC) classification of the Solana token was announced, would again be within reach. A bit further up, the 200-day Exponential Moving Average (EMA) awaits the SOL price at $22.05 &#8211; an indicator often described as a &#8220;bull line&#8221; that SOL investors have been unable to break above since April 2022. Related Reading: Cardano, Solana, Polygon Gains Despite Revolut Plans To Delist In this bullish scenario, the 200-day EMA can be considered as the second most important challenge for SOL bulls. An upside break could allow the price to rise to the 61.8% Fibonacci retracement level at $27.00, which also marked the year-to-date high, potentially marking a 40% rally. At this level at the latest, a preliminary pause in the rally is to be expected. In a bearish case, SOL fails to capture the 38.2% Fibonacci retracement level. In this case, a drop towards $15.30 is conceivable, which would represent a price loss of around 21%. Solana Displays Strong Fundamentals The renewed momentum in Solana&#8217;s price can also be attributed to strong fundamentals. Last Friday, June 30, Solana surpassed Ethereum in 24-hour NFT volume for the first time ever. Solana NFTs saw a surge in trading volume to $25.5 million, up over 1,900% day-over-day (compared to +28%, or $24.6 million for Ethereum). Related Reading: Solana Firedancer: 15% Rally Fueled By Ongoing Network Improvements Moreover, Drift Protocol&#8217;s &#8220;Super Stake&#8221; is also currently causing a stir in the Solana ecosystem. Risk-averse traders can earn an additional 10% return by leveraging Solana Staking derivatives. Marinade-SOL (mSOL) from Marinade Finance is the preferred derivative, enabling traders to deposit mSOL tokens as collateral and borrow additional SOL tokens for continuous restaking, multiplying returns up to three times. This concept draws parallels with Ethereum&#8217;s MakerDAO and its stETH Yield Multiple Staking via Aave. While there are inherent risks, demand for Super Stake remains high, pushing Solana&#8217;s maximum utilization. Super Stake serves as a catalyst for the battered DeFi ecosystem, driven by the booming NFT market. Solana&#8217;s resilience, coupled with innovative solutions like Super Stake, positions SOL for a bullish breakout. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T13:02:15.000Z",
    "title": "XRP Price Catalyst: FedNow Testing Completion Brings Promising Outlook for Ripple and XRP",
    "url": "https://www.crypto-news-flash.com/xrp-price-catalyst-fednow-testing-completion-brings-promising-outlook-for-ripple-and-xrp/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-price-catalyst-fednow-testing-completion-brings-promising-outlook-for-ripple-and-xrp",
    "description": "Volante Technologies, the cloud payments leader and Ripple partner, has completed the pilot test on the US Federal Reserve’s instant payments system, FedNow. Industry proponents argue that the FedNow will benefit XRP and Ripple indirectly as Ripple and its partners have worked on the system.  Ripple partners ACI Worldwide, Volante Technologies, and Finastra have been [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T13:00:04.000Z",
    "title": "Hottest Meme Coins of July 2023 Floki, BoneShiba Swap, and Hollywood X PEPE",
    "url": "https://www.crypto-news-flash.com/hottest-meme-coins-of-july-2023-floki-boneshiba-swap-and-hollywood-x-pepe/?utm_source=rss&utm_medium=rss&utm_campaign=hottest-meme-coins-of-july-2023-floki-boneshiba-swap-and-hollywood-x-pepe",
    "description": "Meme coins have become an undeniable trend within the crypto world, sparking curiosity, excitement, and investment from all corners of the globe. Some of the hottest meme coins of July 2023 include Floki, BoneShiba Swap, and Hollywood X PEPE ($HXPE). However, amongst these thriving digital currencies, it&#8217;s Hollywood X PEPE that seems to stand out [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T12:51:41.000Z",
    "title": "Ripple XRP Ledger (XRPL) Makes History with Introduction of First Mortgage-Backed Stablecoin",
    "url": "https://www.crypto-news-flash.com/ripple-xrp-ledger-xrpl-makes-history-with-introduction-of-first-mortgage-backed-stablecoin/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-xrp-ledger-xrpl-makes-history-with-introduction-of-first-mortgage-backed-stablecoin",
    "description": "XRP Ledger has welcomed the first stablecoin backed by mortgages. The innovative stablecoin dubbed HOME is set to redefine the landscape of mortgage financing and offer homeowners better and more accessible options. Ripple&#8217;s XRP Ledger (XRPL) has welcomed an innovative stablecoin backed by mortgages. Developed by the RWA protocol, this groundbreaking innovation will revolutionize the [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-04T12:51:00.000Z",
    "title": "Revolut to Delist Solana, Polygon, and Cardano Due to SEC Lawsuit",
    "url": "https://coinedition.com/revolut-to-delist-solana-polygon-and-cardano-due-to-sec-lawsuit/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/The_claim_that_SEC_lawyers_with_all_their_Ivy_League_Law_Degrees.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/The_claim_that_SEC_lawyers_with_all_their_Ivy_League_Law_Degrees.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/The_claim_that_SEC_lawyers_with_all_their_Ivy_League_Law_Degrees-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/The_claim_that_SEC_lawyers_with_all_their_Ivy_League_Law_Degrees-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/The_claim_that_SEC_lawyers_with_all_their_Ivy_League_Law_Degrees-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/The_claim_that_SEC_lawyers_with_all_their_Ivy_League_Law_Degrees-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The UK-based neo-bank Revolut has notified many of its users through email that they will delist Solana (SOL), Polygon (MATIC), and Cardano (ADA) crypto tokens in the U.S. Bakkt, Revolut’s digital services provider also announced that it would delist these tokens due to the lack of regulatory clarity. The official email also informed customers of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/revolut-to-delist-solana-polygon-and-cardano-due-to-sec-lawsuit/\">Revolut to Delist Solana, Polygon, and Cardano Due to SEC Lawsuit</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]