[
  {
    "source": "CryptoSlate",
    "date": "2023-06-23T11:45:00.000Z",
    "title": "TUSD supply spiked ahead of Bitcoin’s $30K rally",
    "url": "https://cryptoslate.com/tusd-supply-spiked-ahead-of-bitcoins-30k-rally/",
    "description": "<p>On June 21, Bitcoin (BTC) surged past the $30,000 mark for the first time in two months, a significant milestone for the volatile cryptocurrency. This rally contributed to an uptick in derivatives trading, increased spot trading, and increased coins withdrawn from exchanges, as identified in a recentCryptoSlate Alpha insight. In the week leading up to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/tusd-supply-spiked-ahead-of-bitcoins-30k-rally/\">TUSD supply spiked ahead of Bitcoin’s $30K rally</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-23T11:41:30.000Z",
    "title": "Bitcoin options volume skyrockets as June expirations loom",
    "url": "https://cryptoslate.com/insights/bitcoin-options-volume-skyrockets-as-june-expirations-loom/",
    "description": "<p>Quick Take On June 21, the volume of Bitcoin (BTC) options soared to a level not seen in the last three months. Around 67,000 Bitcoin were involved in options contracts, indicating substantial participation in this type of digital asset trading. Market analyst Alessio Urban believes the recent surge of Bitcoin to $30,000 is mainly due [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-options-volume-skyrockets-as-june-expirations-loom/\">Bitcoin options volume skyrockets as June expirations loom</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-23T12:00:00.000Z",
    "title": "Microstrategy’s Bitcoin Bet Starting To Pay Off",
    "url": "https://cryptodaily.co.uk/2023/06/microstrategy-bitcoin-bet-starting-to-pay-off",
    "description": "<p>MicroStrategy has turned a profit on its significant Bitcoin investment as the premier cryptocurrency soars the charts.&nbsp;</p>\nMicroStrategy Turns A Profit\n<p>With Bitcoin finally overcoming the $30,000 price tag hurdle, leading business intelligence firm and largest institutional BTC-holder, MicroStrategy, is finally turning a profit on its reserves. The company had gone all in on its audacious investment strategy, religiously allocating a portion of its capital to buy the dip and stock up its Bitcoin reserves.&nbsp;</p>\n<p>The strategy seems to have paid off, with the cryptocurrency breaking through the $30,000 ceiling and staying consistently above it for the last several hours, at the time of writing. The price surge has helped MicroStrategy&rsquo;s funds and turned profitable.&nbsp;</p>\nTradFi Renews BTC Interest\n<p>The company has invested millions of dollars into its Bitcoin strategy across several installments made in a time when the market was exceptionally volatile and the crypto was barely breaking the $20k threshold.&nbsp;</p>\n<p>However, recently there has been an increasing institutional interest in the crypto owing to the number of spot Bitcoin ETF applications from several major TradFi players like BlackRock Investments, WisdomTree, and Invesco. As a direct result, Bitcoin has seen a significant price increase as investors are hoping to have more investment options, should these BTC ETF applications be approved.&nbsp;&nbsp;</p>\nThe Big Spot BTC ETF Push\n<p>Following a successful first quarter, Bitcoin briefly maintained its positive momentum in the second quarter. In mid-April, the leading cryptocurrency surpassed the $31,000 mark. However, it soon entered a correction phase, experiencing weeks of underwhelming performance amidst legal controversies. Bitcoin's rally reignited after BlackRock submitted its Bitcoin ETF application.&nbsp;</p>\n<p>Just recently, crypto expert, Ki Young Ju pointed out that MicroStrategy's Bitcoin holdings, which amount to 140,000 BTC, were close to reaching the break-even point at $30,045. Today, when Bitcoin's price reached that level, the portfolio completely recovered from all its previous losses. Currently, with Bitcoin priced at $30,057, the company&rsquo;s holdings have continued their profitable run.&nbsp;</p>\nSaylor&rsquo;s Conviction Wins Out\n<p>The company's investment has placed it among the few publicly traded companies to hold a significant amount of Bitcoin on their balance sheets. MicroStrategy's CEO, Michael Saylor, has been a vocal advocate for Bitcoin and has been instrumental in shaping the company's cryptocurrency investment strategy. He has repeatedly emphasized Bitcoin's potential as a long-term store of value and hedge against inflation and most recently claimed that the regulatory crackdown on altcoins, could result in Bitcoin&rsquo;s market dominance to reach 80% in the long term.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice. </p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T12:04:35.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 BREAKING: Twitter to enable #crypto trading in partnership with eToro. Users searching using a $Cashtag symbol currently see live charts for a select few financial assets, like $LTC. Users will soon be able to click through to eToro &#38; have the option to invest in #Litecoin. Is Litecoin silver to Bitcoin&#8217;s ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-23T12:03:29.000Z",
    "title": "FTX files $700m lawsuit against investment firm tied to Hillary Clinton aide",
    "url": "https://crypto.news/ftx-700m-lawsuit-firm-linked-to-former-clinton-aide/",
    "description": "Crypto exchange FTX sues former Clinton aide and investment firm over alleged misuse of $700 million in funds"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-23T11:50:35.000Z",
    "title": "JPMorgan deletes 47 million records, cripples SEC investigations",
    "url": "https://crypto.news/jpmorgan-deletes-47-million-records-cripples-sec-investigations/",
    "description": "Crypto friendly bank, JPMorgan Chase, was fined $4 million by the SEC for accidentally deleting 47 million emails from its retail banking group"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-23T12:00:57.000Z",
    "title": "Stacks (STX) Succumbs To Market Correction, Slides By 10% In The Last Day",
    "url": "https://www.newsbtc.com/stacks/stacks-stx-succumbs-to-market-correction-slides-by-10-in-the-last-day/",
    "description": "The crypto market is currently experiencing a general price recorrection, following a strong bullish phase that saw many assets soar to new highs. Stacks (STX), one of the notable performers in recent days, is not left out of the current ebb and flow of the market, with its value experiencing a significant decline in the last few hours. According to data from CoinMarketCap, STX is down by 10.14% in the last day, representing the biggest loss in the top 100 cryptocurrencies today. However, looking at STX’s wider price movement, the ERC-20 token’s present downturn may not present much worry to its investors.  For context, STX has jumped by 44.55% in the last seven days emerging as the second biggest weekly gainer, falling just behind meme season sensation &#8211; Pepecoin.  At the time of writing, Stacks is trading at $0.776, with a 0.96% gain in the last hour. However, additional data from CoinMarketCap shows the token&#8217;s daily trading volume is down by 26.41%, falling to a value of $235 million.  Related Reading: Bitcoin Price Hitting A Yearly High Today? What Matters Today That said, STX remains the 40th biggest cryptocurrency in the market, boasting a massive market cap value of $1 billion.  Stacks In 2023 So Far Stacks has been one of the major headliners of 2023, with the token recording a total percentage increase of 290% since the start of the year. Like most cryptocurrencies, Stacks began the year with a slow pace, recording little price gains in January, as its value rose from $0.21 on January 1 to $0.269 by January 31. In mid-February, STX eventually picked up pace surging by 241% to hit a market price of $0.988 on March 2. However, this positive ascent was soon followed by a significant downtrend, causing the token&#8217;s value to plummet as low as $0.575 just one week later. Thereafter, Stacks resumed its bullish trajectory to hit its highest market price of 2023 thus far, peaking at $1.176 on March 18. Following such price gains, the STX market showed no significant price movement before sliding into a bearish state that lasted for over two months prior to the token’s recent boost in price in the last week. STX Trading At $0.774 &#124; STXUSD Chart On Tradingview.com  What Next For Stacks?  According to STX&#8217;s 4-hour chart, its Relative Strength Index (RSI) shows the token has just left the overbought zone indicating the current bearish trend may be more than just a price recorrection.  Related Reading: 75% Of Bitcoin Holders At Spot Rates Are Making Money: Data Furthermore, the Moving Average Convergence Divergence (MACD) has just crossed below the signal line, also indicating that STX’s price will likely remain on the downtrend for now. However, the price prediction site, Coincodex, is projecting a quick resurgence for STX, as they expect the token to gain by 20.74% in the next 5 days to hit a market price of $0.937.  Featured Image: Yahoo Finance, chart from Tradingview"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T12:06:51.000Z",
    "title": "Tether Chooses Kava As Gateway for Cosmos USDt",
    "url": "https://www.crypto-news-flash.com/tether-chooses-kava-as-gateway-for-cosmos-usdt/?utm_source=rss&utm_medium=rss&utm_campaign=tether-chooses-kava-as-gateway-for-cosmos-usdt",
    "description": "Georgetown, Cayman Islands, June 23rd, 2023, Chainwire Tether chooses Kava, a layer-1 blockchain designed for scalability and speed, as its gateway to the Cosmos ecosystem. Kava is excited and honored by Tether’s decision to bring the world&#8217;s most liquid, secure, and transparent stablecoin USDt to Cosmos appchains and Kava EVM dApps. https://twitter.com/Tether_to/status/1671445095965499393?s=20 &#8220;Kava&#8217;s support of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T12:03:52.000Z",
    "title": "Ethereum Scaling Solution Arbitrum Unleashes Game-Changing Tool for Developers in Ethereum’s L2 Space, Empowering Orbit Chain Development",
    "url": "https://www.crypto-news-flash.com/ethereum-scaling-solution-arbitrum-unleashes-game-changing-tool-for-developers-in-ethereums-l2-space-empowering-orbit-chain-development/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-scaling-solution-arbitrum-unleashes-game-changing-tool-for-developers-in-ethereums-l2-space-empowering-orbit-chain-development",
    "description": "Arbitrum the Ethereum scaling solution has released the Orbit Framework for developer&#8217;s use. The Orbit Framework contains different tools that enhance the easy design of new applications. According to Offchain Labs, the Layer 2 (L2) “Arbitrum (ARB)” developer, a new Orbit framework has been released to make it easier for developers to build applications. The [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T12:00:48.000Z",
    "title": "ChatGPT price predictions DOT, TRON, and TCRV",
    "url": "https://www.crypto-news-flash.com/chatgpt-price-predictions-dot-tron-and-tcrv/?utm_source=rss&utm_medium=rss&utm_campaign=chatgpt-price-predictions-dot-tron-and-tcrv",
    "description": "Because of the volatility and unpredictability of the cryptocurrency sector, it may be difficult for investors to make wise choices. However, with advanced technologies like ChatGPT, an AI chatbot, investors have gained access to powerful insights into cryptocurrency trajectories. Today, we will explore the price predictions generated by ChatGPT for three popular cryptocurrencies: Polkadot, Tron, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-23T11:54:16.000Z",
    "title": "Mask Foundation Transfers 2.5M Tokens to Exchanges: On-Chain Data",
    "url": "https://coinedition.com/mask-foundation-transfers-2-5m-tokens-to-exchanges-on-chain-data/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/MASK-8.7-pronto.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/MASK-8.7-pronto.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/MASK-8.7-pronto-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/MASK-8.7-pronto-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/MASK-8.7-pronto-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/MASK-8.7-pronto-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/MASK-8.7-pronto-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The on-chain analytics firm, Lookonchain, revealed in a tweet earlier today that the Mask Network Foundation transferred around 3 million MASK, worth more than $11 million, out of the foundation’s wallets over the past few hours. 2.5 million MASK, worth more than $9 million, was transferred to both Binance and OKX earlier today. Meanwhile, the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/mask-foundation-transfers-2-5m-tokens-to-exchanges-on-chain-data/\">Mask Foundation Transfers 2.5M Tokens to Exchanges: On-Chain Data</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-23T11:45:03.000Z",
    "title": "Red-Hot Ethereum-Based Altcoin Primed To Do ‘Really Well’ Going Forward, Says Top Crypto Strategist",
    "url": "https://dailyhodl.com/2023/06/23/red-hot-ethereum-based-altcoin-primed-to-do-really-well-going-forward-says-top-crypto-strategist/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Based-Altcoin-Primed-really.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Based-Altcoin-Primed-really.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Based-Altcoin-Primed-really.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Based-Altcoin-Primed-really.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Based-Altcoin-Primed-really.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Based-Altcoin-Primed-really.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Based-Altcoin-Primed-really.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto trader believes that one strong-performing Ethereum (ETH)-based altcoin is about to have a huge breakout. Pseudonymous crypto analyst Bluntz tells his 223,000 Twitter followers that the price pattern of indexing protocol The Graph (GRT) indicates the potential of a 150% increase from its current value. According to the trader, GRT broke [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/23/red-hot-ethereum-based-altcoin-primed-to-do-really-well-going-forward-says-top-crypto-strategist/\">Red-Hot Ethereum-Based Altcoin Primed To Do ‘Really Well’ Going Forward, Says Top Crypto Strategist</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]