[
  {
    "source": "Decrypt",
    "date": "2023-10-10T20:09:48.000Z",
    "title": "Geopolitical Instability Makes Bitcoin a Good Bet, Says Paul Tudor Jones",
    "url": "https://decrypt.co/200848/geopolitical-instability-makes-bitcoin-a-good-bet-paul-tudor-jones",
    "description": "The billionaire investor continues to praise Bitcoin as a safe haven asset during times of uncertainty. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-10T20:18:35.000Z",
    "title": "Bitcoin price could hit $750K to $1M by 2026 — Arthur Hayes",
    "url": "https://cointelegraph.com/news/bitcoin-price-hit-750-k-to-1-m-2026-arthur-hayes",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/7402a222-14fe-4d22-bf8d-db0fb7dc0937.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BitMEX founder Arthur Hayes expects Bitcoin to be $750,000 by 2026. Here’s how and why.</p>\n                    <p><p>Love him or hate him, when Arthur Hayes speaks, people listen. </p><p>Last week, as a guest on Impact Theory with Tom Bilyeu, Hayes <a href=\"https://youtu.be/-de-ZIA5ouo?si=jg0AwOps0l2yCriH\" target=\"_blank\" rel=\"noopener nofollow\">made the case</a> for why he believes Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price will hit $750,000 to $1 million by 2026.</p><p>Hayes said,</p><blockquote>“I absolutely agree that there is going to be a major financial crisis, probably as bad or worse than the great depression, sometime near the end of the decade, before we get there we’re gonna have, I think, the largest bull market in stocks, real estate, crypto, art, you name it, that we’ve ever seen since WW2.” </blockquote><p>Hayes cites the nearly-predictable response of the United States government rushing in to intervene in every economic crisis with a bail out as a key catalyst behind the structural problems in the US economy. </p><p>He explained that this essentially creates an endless cycle of central bank printing, which leads to inflation and prevents the economy from going through natural market cycles of growth and correction. </p><blockquote>“We all have collectively agreed that the government is there essentially to attempt to remove the business cycle. Like, there should never be bad things that happen to the economy and if there are, we want the government to come in and destroy the free market. So every time we’ve had a financial crisis over the past 80 years. What happens? The government rushes in and they essentially destroy some part of the free market because they want to save the system.”</blockquote><p>Let’s take a quick look at a few of the catalysts that Hayes believes will back Bitcoin’s move into six-figure territory. </p><h2>Mounting debt and out of control inflation. </h2><p>According to Hayes, mounting government debt, a large amount that needs to be rolled over, and diminishing productivity can only be addressed with money printing. While monetary expansion does lead to bull markets, the consequence tends to be high inflation. </p><blockquote>“In the first instance it creates a massive bull market in stocks, crypto, real estate, things that have a fixed supply, maybe they’re productive and have some earnings. But after that, we’re going to find out that, actually, the government can save everything. It can’t just print as much money as they think to try to save themselves by fixing the yield and price of their bonds and we’re going to get a generational collapse.” </blockquote><p>Hayes expects a “massive top” at some point in 2026, followed by a great depression-like situation occurring by the end of the decade.</p><h2>The US Government bankrupted the banking system</h2><p>When asked about future contributors to inflation, Hayes zoned in on the $7.75 trillion in US debt that must be rolled over by 2026 and the yield curve inversion in US bonds. </p><p>Traditionally China, Japan and other nations were the main buyers of US debt but this is not the case anymore, a change which Hayes believes will exacerbate the situation in the states. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Why do I love these markets right now when yields are screaming higher? <br><br>Bank models have no concept of a bear steepener occurring. Take a look at the top right quadrant of historical interest rate regimes.<br><br>It's basically empty. <a href=\"https://t.co/P6MQnCU73N\">pic.twitter.com/P6MQnCU73N</a></p>— Arthur Hayes (@CryptoHayes) <a href=\"https://twitter.com/CryptoHayes/status/1709379092188135725?ref_src=twsrc%5Etfw\">October 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to Hayes, “the US banking system is functionally insolvent because the regulators made the rules in such a way that it was profitable from an accounting perspective, not an economic perspective, to essentially take in deposits and buy low yielding treasuries and they could do it with almost infinite leverage and a few basis points differing in the change of the price and everyone makes a lot of money and gets a big bonus.” </p><blockquote>“The banks collectively bought all these treasuries in 2021 and obviously the price went down a lot since then and that’s why we have the regional banking crisis.” </blockquote><p>The largest concern expressed by Hayes is “at a structural level, the US banking system cannot buy more debt, because it cannot afford to because it is structurally insolvent. The Federal Reserve has committed to doing quantitative tightening, so it's not accumulating more treasuries.”</p><p>Hayes explained that the market is digesting this, and the nuance here is that despite high rates on treasuries, gold prices remain high and certain market participants who previously were treasury buyers are disinterested. </p><p>Currently, banks’ struggle to attract deposits, and the difficulty of matching their deposit rates to the current rates available in the market creates revenue and debt management stress at a level which could become critical to the function of the entire banking system. Like many cryptocurrency advocates, Hayes believes that it’s in times like this that a certain cohort of investors begins to look at different investment options, including Bitcoin. </p><h2>Hayes’ view on why Bitcoin is destined for $750,000</h2><p>Despite what appears to be a generally dismal outlook on the global and U.S. economy, Hayes still expects Bitcoin price to outperform, and he placed a target estimate in the $750,000 to $1 million range by the end of 2026.</p><p>Hayes expects Bitcoin to continue,</p><blockquote>“Chopping around $25,000 to $30,000 this year as we get to some sort of financial disturbance and people recognize that real rates are negative. If the economy is growing at a nominal rate of 10%, but I’m only getting 5% or 6%, even though it's high, people on the margin are going to start buying other stuff, crypto being one of those things.”</blockquote><p>Coming into 2024, Hayes said either a financial crisis will push rates closer to 0% or the government keeps raising rates, but not as fast as governments spend money and people continue looking for better returns elsewhere. </p><p>The eventual approval of a spot Bitcoin ETF in the U.S., Europe and perhaps Hong Kong, plus the halving event could push price to a new all-time high at $70,000 in June or July of 2024. Regaining the all-time high by the end of 2024 is when the “real fun starts and the real bull market starts” and Bitcoin enters the “750,0000 to $1 million on the upside.” </p><p>When asked whether the estimated price level would stick, Hayes agreed that a 70% to 90% drawdown would occur in BTC price, just like it has after each bull market. </p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p>\n\n</p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-10T20:09:43.000Z",
    "title": "ApeSwap Evolves: Announces ApeBond Rebrand and New Features",
    "url": "https://cryptodaily.co.uk/2023/10/apeswap-evolves-announces-apebond-rebrand-and-new-features",
    "description": "ApeSwap Evolves: Announces ApeBond Rebrand and New Features"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-10T20:30:00.000Z",
    "title": "Gary Wang’s Testimony to Prove SBF Innocence in FTX Trial?",
    "url": "https://coinedition.com/gary-wangs-testimony-to-prove-sbf-innocence-in-ftx-trial/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/FTX-10-1-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/FTX-10-1-3.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/FTX-10-1-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/FTX-10-1-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/FTX-10-1-3-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/FTX-10-1-3-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/FTX-10-1-3-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A Monday filing revealed that Sam Bankman-Fried’s lawyers have approached the court to allow them to rely on FTX co-founder Gary Wang&#8217;s testimony in the ongoing trial to disprove claims that Bankman-Fried acted fraudulently. The lawyers want to use the evidence to counter money laundering charges against Bankman-Fried. Gary Wang told government prosecutors that he [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/gary-wangs-testimony-to-prove-sbf-innocence-in-ftx-trial/\">Gary Wang’s Testimony to Prove SBF Innocence in FTX Trial?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]