[
  {
    "source": "Cointelegraph",
    "date": "2023-12-04T20:57:33.000Z",
    "title": " Why is the crypto market up today? ",
    "url": "https://cointelegraph.com/news/why-is-the-crypto-market-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjItMTAvYTYzMzIzMGQtM2Y5YS00NzQ5LThiYWItMDE3YzRiOTQzNWEwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The crypto market is up today as Bitcoin’s rally to a new 2023 high triggers a breakout in altcoins and DeFi tokens.</p>\n                    <p><p >The crypto market is up today as Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) rallied to new 2023 highs and Cardano (<a href=\"https://cointelegraph.com/ada-price-index\">ADA</a>) and numerous altcoins tacked on notable gains. The positive growth was led by Bitcoin, which <a href=\"https://cointelegraph.com/news/bitcoin-price-40000-first-time-since-april-2022-matrixport-eyes-2024\">topped $40,000</a> for the first time in 19 months on Dec. Coinciding with gold hitting an all-time high, <a href=\"https://cointelegraph.com/news/bitcoin-41k-gold-price-new-all-time-high\">Bitcoin price</a> then topped $42,000 on Dec. 4, <a href=\"https://cointelegraph.com/news/bitcoin-price-rally-to-42k-driven-by-spot-volumes-not-btc-futures-liquidations\">setting</a> a 20-month high. </p><figure ><img src=\"https://s3.cointelegraph.com/uploads/2023-12/b477ef5c-7f71-4bb5-93b9-906745d24251.png\"  /><figcaption style=\"text-align: center;\"><em>Crypto performance map. Coin360</em></figcaption></figure><p >Let’s examine three major factors influencing today’s crypto market rally.</p><h2 >Bitcoin continues to leave centralized exchanges</h2><p >The crypto market’s price gains in the past 24 hours follow a period of rising withdrawals from centralized crypto exchanges.</p><p >For instance, over 20,000 Bitcoin have left crypto exchanges since Nov. </p><figure ><img src=\"https://s3.cointelegraph.com/uploads/2023-12/2f7b6fa0-1f99-4eea-92a3-e14f5149f378.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin balances on exchanges. Source: Coinglass</em></figcaption></figure><p >The reduction in Bitcoin balances across crypto exchanges has largely coincided with rising prices. </p><p><a href=\"https://cointelegraph.com/news/why-is-the-crypto-market-up-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-04T21:00:31.000Z",
    "title": "Hedera Hashgraph to power new environmental asset management service",
    "url": "https://cryptoslate.com/hedera-hashgraph-to-power-new-environmental-asset-management-service/",
    "description": "<p>At the 2023 UN Climate Change Conference (COP28), Envision Blockchain showcased new emissions tracking and carbon credit platforms utilizing blockchain and artificial intelligence technology. The company said these platforms contain upgraded features for searching methodologies, comparing project data, and aligning with reporting standards—with the stated goals of increasing transparency and enabling growth in voluntary carbon [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/hedera-hashgraph-to-power-new-environmental-asset-management-service/\">Hedera Hashgraph to power new environmental asset management service</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-04T21:00:02.000Z",
    "title": "Solana TVL Balloons To Over $600 Million – What This Means For SOL Price",
    "url": "https://www.newsbtc.com/news/solana-tvl-balloons-to-over-600-million-what-this-means-for-sol-price/",
    "description": "A transformative wave is sweeping through the decentralized finance (DeFi) arena, as novel blockchain platforms disrupt the status quo. Standing tall among these challengers is Solana, celebrated for its exceptional throughput and scalability. In a recent turn of events, Solana&#8217;s DeFi ecosystem has etched a momentous milestone, thrusting itself into the dynamic DeFi landscape. The surge in Total Value Locked (TVL) to an impressive $655 million signals a watershed moment, underpinned by the escalating interest and unwavering confidence in Solana&#8217;s prowess within the DeFi sector. Related Reading: Ethereum Breaks Through $2,200 Ceiling, Investors Expect $3,000 This Week Solana TVL Skyrockets: A Decisive Leap In The DeFi Landscape This surge not only marks a numerical achievement but also underscores the burgeoning significance of Solana as a formidable player in the evolving narrative of decentralized finance. As of October 1st, DefiLlama&#8217;s statistics showed that Solana&#8217;s Total Value Locked (TVL) was around $326 million. Nevertheless, further examination revealed a significant increase in TVL by the end of October. SOL TVL. Source: DefiLlama The TVL has soared to over $655 million as of the most recent release, demonstrating an amazing doubling from the October data. It&#8217;s not quite at its historical apex, but this increase is the highest TVL in more than a year, indicating a strong and steady growth trend. The most recent numbers indicate a significant growth of almost 200% from Solana&#8217;s January 1st $211 million TVL. Solana&#8217;s TVL had a sharp decline following the collapse of FTX, falling from just over $10 billion in November 2021 to a low of $210 million in January 2023. SOLUSD currently trading at $61.18 on the daily chart: TradingView.com With this increase, Solana is leading the way in the expansion of decentralized finance. SOL, in particular, beat out the competition and took back Avalanche&#8217;s (AVAX) seventh rank with $678.7 million locked up and put to use in its processes. Solana&#8217;s Surge: Key Growth Factors There are a number of important reasons that have contributed to Solana&#8217;s growth and revival. The demand for Solana-based products, such Ordinals&#8217; &#8220;SolScriptions&#8221; and other meme coins, has spurred demand and increased token minting on the Solana network. Solana TVL in DeFi chains. Source: DefiLlama Active involvement in liquid staking protocols such as Jito and Marinade Finance has further enhanced the network&#8217;s appeal by drawing in new users and improving liquidity. In addition, Solana&#8217;s network saw an increase in daily addresses; as of press time, there were 158,000 daily addresses. All of these measures point to increased network traffic. Related Reading: ORDI Shatters Records With New All-Time High In Bullish Surge Not only is Solana&#8217;s notable expansion in the DeFi area a testament to the platform&#8217;s success, but it also serves as a barometer of the dynamic blockchain environment. It signals a change in the direction of more effective, scalable technology, upending the dominance of established platforms. According to statistics from cryptocurrency market price tracker Coingecko, SOL was trading at $61.94 at the time of writing, up 12% over the previous seven days. As the TVL more than doubles in recent times, attention turns to the potential impact on SOL&#8217;s valuation. The dynamic interplay between Solana&#8217;s TVL milestones and its cryptocurrency&#8217;s price sets the stage for an intriguing narrative in the crypto landscape. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Shutterstock"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-04T21:00:17.000Z",
    "title": "Crypto Analyst Lays Out Ethereum Price Target, Says ETH Has a Lot More Room To Run",
    "url": "https://dailyhodl.com/2023/12/04/crypto-analyst-lays-out-ethereum-price-target-says-eth-has-a-lot-more-room-to-run/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/Ethereum-Stakers-Feeling-Max.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/Ethereum-Stakers-Feeling-Max.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/Ethereum-Stakers-Feeling-Max.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/Ethereum-Stakers-Feeling-Max.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/Ethereum-Stakers-Feeling-Max.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/Ethereum-Stakers-Feeling-Max.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/Ethereum-Stakers-Feeling-Max.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto analyst is outlining his next Ethereum (ETH) price target, saying that the top altcoin has more potential to expand, while updating his outlook on Bitcoin (BTC). In a new thread, crypto trader Kevin Svenson tells his 131,200 followers on the social media platform X that even though the leading smart contract [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/04/crypto-analyst-lays-out-ethereum-price-target-says-eth-has-a-lot-more-room-to-run/\">Crypto Analyst Lays Out Ethereum Price Target, Says ETH Has a Lot More Room To Run</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-04T20:55:52.000Z",
    "title": "Institutions Continue Heavy Allocation to Crypto As Bitcoin (BTC) Hits $42,000 Mark: CoinShares",
    "url": "https://dailyhodl.com/2023/12/04/institutions-continue-heavy-allocation-to-crypto-as-bitcoin-btc-hits-42000-mark-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/05/btc-Crazy-Strong-Fundamentals.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/05/btc-Crazy-Strong-Fundamentals.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/05/btc-Crazy-Strong-Fundamentals.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/05/btc-Crazy-Strong-Fundamentals.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/05/btc-Crazy-Strong-Fundamentals.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/05/btc-Crazy-Strong-Fundamentals.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/05/btc-Crazy-Strong-Fundamentals.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets manager CoinShares finds that blue–chip investors continue to allocate to Bitcoin (BTC) and crypto investment products as markets surge. In its latest fund flows report, CoinShares says that institutions poured asset $176 million into crypto markets last week, reaching a 10-week total of $1.76 billion. “Digital asset investment products saw inflows totaling $176 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/04/institutions-continue-heavy-allocation-to-crypto-as-bitcoin-btc-hits-42000-mark-coinshares/\">Institutions Continue Heavy Allocation to Crypto As Bitcoin (BTC) Hits $42,000 Mark: CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]