[
  {
    "source": "Cointelegraph",
    "date": "2023-10-01T06:11:14.000Z",
    "title": "Vitalik Buterin voices concerns over DAOs approving ETH staking pool operators",
    "url": "https://cointelegraph.com/news/vitalik-buterin-dao-staking-pool",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/7deb7d0f-df82-4c0f-b156-a9d5d62f20dd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Ethereum co-founder proposes a solution that could lower the likelihood of any individual liquid staking provider growing to a point where it poses a systemic risk.</p>\n                    <p><p>Vitalik Buterin, co-founder of Ethereum, has expressed worries regarding decentralized autonomous organizations (DAOs) exerting a monopoly over the selection of node operators in liquidity staking pools.</p><p>In a September 30 blog <a href=\"https://vitalik.eth.limo/general/2023/09/30/enshrinement.html\" target=\"_blank\" rel=\"noopener nofollow\">post</a>, Buterin issues a warning that as staking pools adopt the DAO approach for governance over node operators—who are ultimately responsible for the pool's funds—it can expose <a href=\"https://cointelegraph.com/news/vitalik-buterin-privacy-pool-interesting-but-just-the-start\">them to potential risks</a> from malicious actors.</p><blockquote>“With the DAO approach, if a single such staking token dominates, that leads to a single, potentially attackable governance gadget controlling a very large portion of all Ethereum validators.”</blockquote><p>Buterin highlights staking protocol Lido (<a href=\"https://cointelegraph.com/lido-dao-ldo-price-index\">LDO</a>) as an example with a DAO that whitelists node operators. However, he emphasizes that relying on just one layer of protection may prove insufficient.</p><p>“To the credit of protocols like Lido, they have implemented safeguards against this, but one layer of defense may not be enough,” he noted.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/528a9144-20f6-4039-ab60-da04fda0118c.png\"  /><figcaption style=\"text-align: center;\"><em>ETH staked by category chart. Source: Vitalik Buterin</em></figcaption></figure><p>Meanwhile, he explains that Rocket Pool offers the opportunity for anyone to become a node operator by placing an 8 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) deposit, which, at the time of this publication, is equivalent to approximately $13,406.</p><p>However, he notes this comes with its own risks. \"The Rocket Pool approach allows attackers to 51% attack the network, and force users to pay most of the costs,\" he stated.</p><p><strong><em>Related:</em></strong><a href=\"https://cointelegraph.com/news/ethereum-crushed-liquid-staking-tokens\"><strong><em> Ethereum is about to get crushed by liquid staking tokens</em></strong></a></p><p>Buterin highlights that a possible approach to address this issue involves encouraging ecosystem participants to utilize a variety of liquid staking providers. </p><p>He clarifies this would decrease the likelihood of any one provider <a href=\"https://cointelegraph.com/news/vitalik-wallet-sends-400-eth-worth-600k-to-coinbase\">becoming excessively large</a> and posing a systemic risk.</p><blockquote>“In the longer term, however, this is an unstable equilibrium, and there is peril in relying too much on moralistic pressure to solve problems.”</blockquote><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/dao-hyped-voting-decentralization/\">Are DAOs overhyped and unworkable? Lessons from the front lines</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]