[
  {
    "source": "Bitcoin.com",
    "date": "2023-07-26T06:00:55.000Z",
    "title": "Binance, CZ to Seek Dismissal of CFTC Complaint",
    "url": "https://news.bitcoin.com/binance-cz-to-seek-dismissal-of-cftc-complaint/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/cz-binance-1-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Binance, CZ to Seek Dismissal of CFTC Complaint\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/cz-binance-1-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/cz-binance-1-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/cz-binance-1-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/cz-binance-1-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/cz-binance-1-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/cz-binance-1-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/cz-binance-1.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Crypto exchange Binance and its founder and CEO Changpeng Zhao (CZ) plan to seek the dismissal of a lawsuit filed by the U.S. Commodity Futures Trading Commission (CFTC). On July 27, the trading platform is due to submit its response to the CFTC complaint alleging that it broke derivatives laws in the United States. Binance, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T06:07:42.000Z",
    "title": "Deloitte and Chainalysis Form Strategic Alliance to Enhance Digital Asset Compliance Solutions",
    "url": "https://www.cryptopolitan.com/deloitte-and-chainalysis-strategic-alliance/",
    "description": "In a transformative move set to redefine the landscape of digital asset compliance, two industry giants, Deloitte and Chainalysis, have joined forces to announce a strategic alliance. With the soaring adoption of digital assets and the evolving regulatory landscape, businesses face unprecedented challenges in navigating the complex world of risk management and compliance. In response ... <a title=\"Deloitte and Chainalysis Form Strategic Alliance to Enhance Digital Asset Compliance Solutions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/deloitte-and-chainalysis-strategic-alliance/\" aria-label=\"More on Deloitte and Chainalysis Form Strategic Alliance to Enhance Digital Asset Compliance Solutions\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-26T05:48:20.000Z",
    "title": "Bitcoin Supply On Exchanges Hits Lowest Value Since Nov 2018, Now At 1.17M",
    "url": "https://nulltx.com/bitcoin-supply-on-exchanges-hits-lowest-value-since-nov-2018-now-at-1-17m/",
    "description": "The recent trends in the Bitcoin market indicate a shift towards self-custody as the supply of Bitcoin on exchanges continues to decrease. Despite experiencing a drop below the $30k mark last week, the market has not shown severe reactions, suggesting that fear, uncertainty, and doubt (#FUD) are not driving significant sell-offs. This observation highlights the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-26T05:43:40.000Z",
    "title": "Tron Price Prediction: TRX Trades Near Key Juncture, Can It Rally Again?",
    "url": "https://www.newsbtc.com/analysis/trx/tron-price-prediction-trx-support-0-080/",
    "description": "Tron price is consolidating near the $0.080 support against the US Dollar. TRX could outperform Bitcoin if the bulls stay active above $0.080. Tron is holding major support near $0.080 against the US dollar. The price is trading above $0.0805 and the 100 simple moving average (4 hours). There is a crucial bullish trend line forming with support near $0.0810 on the 4-hour chart of the TRX/USD pair (data source from Kraken). The pair could start a decent increase if there is a move above the $0.0835 resistance. Tron Price Holds Key Support In the past few days, Tron’s price saw a steady decline from the $0.094 zone against the US Dollar, similar to Bitcoin and Ethereum. TRX traded below the $0.0850 support to enter a short-term bearish zone. The price even declined below the $0.0835 support, but the bulls were active near the $0.080 level. A low is formed near $0.0804 and the price is now consolidating losses. TRX is now trading above $0.0805 and the 100 simple moving average (4 hours). There is also a crucial bullish trend line forming with support near $0.0810 on the 4-hour chart of the TRX/USD pair. On the upside, an initial resistance is near the $0.0835 zone. It is close to the 23.6% Fib retracement level of the downward move from the $0.0939 swing high to the $0.0804 low. Source: TRXUSD on TradingView.com A close above the $0.0835 resistance might send TRX further higher. The next major resistance is near the $0.0872 level or the 50% Fib retracement level of the downward move from the $0.0939 swing high to the $0.0804 low, above which the bulls are likely to aim a larger increase toward the key $0.0900 zone in the coming days. Any more gains could set the pace for a move toward the $0.094 level. More Downsides in TRX? If TRX price fails to clear the $0.08350 resistance, it could extend its decline. Initial support on the downside is near the $0.0810 zone and the trend line. The first major support is near the $0.080 level or the 100 simple moving average (4 hours), below which the price could accelerate lower. The next major support is $0.0760. Technical Indicators 4 hours MACD – The MACD for TRX/USD is losing momentum in the bearish zone. 4 hours RSI (Relative Strength Index) – The RSI for TRX/USD is currently near the 50 level. Major Support Levels – $0.0810, $0.0800, and $0.0760. Major Resistance Levels – $0.0835, $0.0872, and $0.090."
  }
]