[
  {
    "source": "Cointelegraph",
    "date": "2024-04-08T07:30:31.000Z",
    "title": " Etherscan ads behind massive phishing campaign ",
    "url": "https://cointelegraph.com/news/etherscan-ads-phishing-campaign",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvYWFjMGJmYzMtOWI4NS00ZTZmLTg3YTYtZDQ2NTBjNTkwMGY4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The wallet drainer scam involves luring users into fake websites and prompting them to link their crypto wallets and eventually draining all funds.</p>\n                    <p><p>A number of advertisements on Ethereum blockchain explorer Etherscan have been identified as part of a major phishing campaign that is actively targeting Etherscan users.</p><p>On April 8, X community member McBiblets identified some advertisements on Etherscan as wallet drainers, warning users against being redirected to phishing websites when clicking on such advertisements. </p><p>Further investigations revealed that the phishing advertisements appearing on Etherscan were also displayed on various known phishing websites. </p><p><a href=\"https://cointelegraph.com/news/etherscan-ads-phishing-campaign\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-08T07:15:50.000Z",
    "title": "Towa Corp. Leads the Way in Chip Molding Technology",
    "url": "https://www.cryptopolitan.com/towa-corp-in-chip-molding-technology/",
    "description": "Towa Corporation is a Kyoto, Japan-based company that has taken the lead in the field of chip molding technology. Other companies have followed in their footsteps after the prototype setup from Towa. This technology is particularly required to develop state-of-the-art AI, which is rapidly being adopted across the globe. Reports from TechInsights indicate that Towa [&#8230;]"
  }
]