[
  {
    "source": "CoinDesk",
    "date": "2024-01-11T09:45:06.000Z",
    "title": "Bitcoin ETF Frenzy Brings Windfall Volume to Decentralized Predictions Platform Polymarket",
    "url": "https://www.coindesk.com/markets/2024/01/11/bitcoin-etf-frenzy-brings-windfall-volume-to-decentralized-predictions-platform-polymarket/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Polymarket saw betting contracts worth more than $5.7 million change hands on Wednesday."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-11T10:00:00.000Z",
    "title": " Less than 7% of Web3 VC funding went to female-led startups: Report ",
    "url": "https://cointelegraph.com/news/web3-vc-funding-gender-disparity-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYTk5ZjdmZDMtYmNhMy00NjNlLWE3OGQtZWUyZWJmNGYwNDUxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The figure is several times lower than the overall figure for women in startups in various fields. </p>\n                    <p><p>Startups created or led by women received 6.43% of the $27.85 billion in Web3 venture capital (VC) investments in the past two years.</p><p>According to a Jan. 11 report by Bitget Research, female-led Web3 startups received $1.77 billion of the $27.85 billion in Web3 VC from Q1 2022 to Q3 2023. That means male-led startups received $26.08 billion in funding. Simultaneously, female-led Web3 startups comprised just under 9% of all startup firms in the sector. For the purposes of the study, a \"female-led blockchain startup\" referred to a blockchain startup where at least 50% of its executives were women.</p><p>Irrespective of gender, VC funding for blockchain firms entered a broad decline starting in 2022, with total funding falling from roughly $6.4 billion in Q1 2022 to a low of $2 billion in Q2 2023 before slightly rebounding the following quarter. Despite the recovery, researchers noted:</p><p><a href=\"https://cointelegraph.com/news/web3-vc-funding-gender-disparity-report\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-11T09:53:06.000Z",
    "title": " Priced in or not? BTC miners and traders prepare for Bitcoin ETF trading ",
    "url": "https://cointelegraph.com/news/priced-in-btc-miners-traders-prepare-bitcoin-etf-trading",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMjY1MTcyMjgtNjFmYi00OWM0LWI2YTUtOWIwYTVmMDViNWQwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Exchange transaction volume dominance sees new all-time highs as the debate over whether the Bitcoin ETFs are \"priced in\" continues.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) failed to break out of its established range on so-called “ETF day,” but traders and miners are busy.</p><p>Data from exchanges shows that Jan. 10 saw significant BTC movements both before and after the day’s events.</p><p>BTC price targets for the day on which the United States <a href=\"https://cointelegraph.com/news/sec-spot-bitcoin-etf-approvals\">approved</a> its first spot Bitcoin exchange-traded fund (ETF) <a href=\"https://cointelegraph.com/news/bitcoin-etf-may-fail-btc-price-breakout-48k-analysis\">focused on $48,000</a>.</p><p><a href=\"https://cointelegraph.com/news/priced-in-btc-miners-traders-prepare-bitcoin-etf-trading\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-11T09:57:40.000Z",
    "title": "Spot Bitcoin ETFs set sail with fervor as pre-market trading begins",
    "url": "https://cryptoslate.com/insights/spot-bitcoin-etfs-set-sail-with-fervor-as-pre-market-trading-begins/",
    "description": "<p>Quick Take The recent approval of the spot Bitcoin ETFs marked a significant leap in the world of digital assets, triggering intriguing market dynamics. As of Jan. 10, the green light for the ETFs to commence trading was given, and they are set to start trading at 2:30 pm GMT on Jan. 11. Of particular [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/spot-bitcoin-etfs-set-sail-with-fervor-as-pre-market-trading-begins/\">Spot Bitcoin ETFs set sail with fervor as pre-market trading begins</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-11T09:46:51.000Z",
    "title": "Spot bitcoin etf approved - ethereum (ETH) rockets",
    "url": "https://cryptodaily.co.uk/2024/01/spot-bitcoin-etf-approved-ethereum-eth-rockets",
    "description": "As the SEC announced the approval of all Spot Bitcoin ETFs, $BTC remained flat. On the other hand, ethereum (ETH) set off like a rocket ship, gaining more than 10% on the day."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-11T09:48:50.000Z",
    "title": "Cardano set for gains alongside XRP and Meme Moguls",
    "url": "https://crypto.news/cardano-set-for-gains-alongside-xrp-and-meme-moguls/",
    "description": "Meme Moguls, in the ongoing presale, might rally alongside XRP and Cardano in the weeks ahead"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-11T09:41:29.000Z",
    "title": "European Central Bank allocates over $700m to propel offline digital euro development",
    "url": "https://crypto.news/european-central-bank-allocates-over-700m-to-propel-offline-digital-euro-development/",
    "description": "The European Central Bank (ECB) is allocating over $700 million from its $1.3 billion contract budget for contractors to develop offline payment capabilities for a retail digital euro. In its search for providers offering various services such as risk management,&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-11T09:54:35.000Z",
    "title": "Bulls Charge As Ethereum Barrels Past $2,600 – Is An ETF The Secret Weapon?",
    "url": "https://www.newsbtc.com/news/bulls-charge-as-ethereum-barrels-past-2600-is-an-etf-the-secret-weapon/",
    "description": "Ethereum (ETH) continued its upward trajectory Wednesday, clocking a 10% gain in 24 hours to breach past the vaunted $2,600 mark. Market watchers attribute this surge to a confluence of factors, primarily fueled by anticipation of a forthcoming Ethereum exchange-traded fund (ETF) in the wake of the expected approval for a Bitcoin ETF in the US. In a historic move that cryptocurrency aficionados hope will bring more individual and institutional investors into the market, the US Securities and Exchange Commission has approved the first spot bitcoin exchange traded funds on Thursday. Related Reading: Crypto Chaos Meets BONK Bliss: 15% Rally Bucks The Trend Ethereum ETF Buzz Sparks Strategic Moves &#8220;There&#8217;s a noticeable trend towards frontrunning the ether ETF,&#8221; noted Alex Onufriychuk, CEO of Kaminari, in a Telegram message. This sentiment aligns with the prevailing belief that Ethereum, the second-largest cryptocurrency by market cap, would be the next candidate for an ETF after Bitcoin. Source: Santiment Adding fuel to the fire, a prominent investor, dubbed a &#8220;whale&#8221; in the crypto universe, made a strategic move by transferring 9,705 ETH (nearly $23 million) from Binance to Compound. This was followed by a 12 million Tether (USDT) loan, seemingly used to further accumulate ETH. The whale subsequently executed three profitable ETH transactions, netting roughly $5 million. This decisive action signaled two things: confidence in Ethereum&#8217;s future and the potential for profit-taking, which could introduce short-term volatility. Despite the risk, the whale&#8217;s activity bolstered positive market sentiment. Ethereum currently trading at $2,607.8 on the daily chart: TradingView.com Further validating this optimism, Ethereum&#8217;s network metrics experienced a surge. Both network growth and token velocity saw increases, indicating heightened interest from new addresses and more token movement. These on-chain metrics paint a promising picture for ETH&#8217;s future. ETH Futures Surge Amid ETF Optimism Also adding to the bullish case, Open Interest for ETH futures contracts jumped 15% in recent days, reaching $4.57 billion at the time of writing. This signifies more traders entering the market and anticipating significant price gains following a potential ETF approval. Ethereum vs. Bitcoin Open Interest &#124; Source: Velo Data According to reports, crypto traders expect Ethereum&#8217;s price to rise after a favorable ETF judgment, even though Bitcoin is getting more attention in the media. If this situation plays out, the price of ETH could soon go beyond $2,600. Related Reading: Is Stacks The New Safe Haven? STX Soars 16% In Turbulent Market However, it&#8217;s crucial to remember that the cryptocurrency market remains volatile, and unforeseen factors could still impact prices. The timeline for an Ethereum ETF approval is uncertain, and regulatory hurdles could create delays. Additionally, broader market conditions and news on Ethereum development could also play a role. Investors should carefully consider their risk tolerance and conduct thorough research before making any investment decisions, particularly in the dynamic and unpredictable world of cryptocurrencies. Featured image from Medium"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-11T10:00:03.000Z",
    "title": "Polygon (MATIC) Price Surge on the Horizon; Exploding Interest in Rebel Satoshi ($RBLZ)  Noticed",
    "url": "https://www.crypto-news-flash.com/polygon-matic-price-surge-on-the-horizon-exploding-interest-in-rebel-satoshi-rblz-noticed/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-matic-price-surge-on-the-horizon-exploding-interest-in-rebel-satoshi-rblz-noticed",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-79.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-79.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-79-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-79-150x94.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-79-450x281.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The cryptocurrency market continues to be a hotbed of activity, with notable movements in top altcoins catching the eye of investors and enthusiasts alike. Polygon (MATIC), known for its scalability solutions, has been in the limelight recently due to its significant price increase. At the same time, another rising star, Rebel Satoshi ($RBLZ), is rapidly [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-11T09:49:25.000Z",
    "title": "SEC Calls Bitcoin and Ripple’s (XRP) Commodities in Spot ETF Approval – Is This the Final Call for a New All-Time High and Trillion-Dollar Status?",
    "url": "https://www.crypto-news-flash.com/sec-calls-bitcoin-and-ripples-xrp-commodities-in-spot-etf-approval-is-this-the-final-call-for-a-new-all-time-high-and-trillion-dollar-status/?utm_source=rss&utm_medium=rss&utm_campaign=sec-calls-bitcoin-and-ripples-xrp-commodities-in-spot-etf-approval-is-this-the-final-call-for-a-new-all-time-high-and-trillion-dollar-status",
    "description": "<img width=\"1472\" height=\"828\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/BTC-XRP.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/BTC-XRP.jpg 1472w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/BTC-XRP-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/BTC-XRP-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/BTC-XRP-768x432.jpg 768w\" sizes=\"(max-width: 1472px) 100vw, 1472px\" />The SEC&#8217;s classification of Bitcoin and Ripple&#8217;s XRP as commodities in the approval of spot ETFs may signal a pivotal change in the cryptocurrency market, potentially leading to new all-time highs. This landmark decision by the SEC raises the question of whether Bitcoin and XRP are now poised to reach trillion-dollar valuations, marking a significant [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-11T10:09:55.000Z",
    "title": "Is Ripple Dumping XRP? CTO David Schwartz Responds to Accusations",
    "url": "https://coinedition.com/is-ripple-dumping-xrp-cto-david-schwartz-responds-to-accusations/",
    "description": "<p>Ripple’s CTO, David Schwartz, has debunked the claim that the blockchain company is heavily dumping XRP. According to Schwartz, information posted on X by an acclaimed crypto researcher with the identity Good Morning Crypto is inaccurate. Schwartz debunked the researcher&#8217;s data source, noting that the next XRP Market Report is due in a few weeks [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/is-ripple-dumping-xrp-cto-david-schwartz-responds-to-accusations/\">Is Ripple Dumping XRP? CTO David Schwartz Responds to Accusations</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]