[
  {
    "source": "CoinDesk",
    "date": "2024-04-05T19:19:47.000Z",
    "title": "Genesis Completes Redemption of GBTC Shares, Buys 32K Bitcoins with Proceeds",
    "url": "https://www.coindesk.com/business/2024/04/05/genesis-completes-redemption-of-gbtc-shares-buys-32k-bitcoins-with-proceeds/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The company in February got permission from a New York bankruptcy court to sell approximately 36 million shares of Grayscale's Bitcoin Trust."
  },
  {
    "source": "CoinDesk",
    "date": "2024-04-05T19:18:47.000Z",
    "title": "Bitcoin Mining’s Boon for Small Town America",
    "url": "https://www.coindesk.com/consensus-magazine/2024/04/05/bitcoin-minings-boon-for-small-town-america/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Will Foxley’s doc about a small Texas town’s embrace of a new mining facility paints a more positive story about Bitcoin’s impact on rural communities than typically reported."
  },
  {
    "source": "Decrypt",
    "date": "2024-04-05T19:36:25.000Z",
    "title": "Do Kwon Found Liable for Fraud in SEC Lawsuit",
    "url": "https://decrypt.co/225047/do-kwon-liable-civil-fraud-sec-lawsuit",
    "description": "The federal regulator prevails in asserting that the stablecoin issuer and its founder misled investors."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-05T19:25:00.000Z",
    "title": " DeFi booms as daily active wallets hit 7M, VanEck bullish on Ethereum L2s: Finance Redefined ",
    "url": "https://cointelegraph.com/news/de-fi-booms-daily-active-wallets-7-m-van-eck-bullish-ethereum-l2s-finance-redefined",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvNzllMjdmMWUtZmE4MS00OGYwLTg5NGQtNzBlYTczYTI5YmEyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Market analysts predict layer-2 blockchains are set to capitalize on Ethereum’s primary challenge to process, store and compute data, which might propel it to a $1 trillion market cap by 2030.</p>\n                    <p><p data-ct-non-breakable=\"true\">Welcome to Finance Redefined, your weekly dose of essential <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> insights — a newsletter crafted to bring you the most significant developments from the past week.</p><p>The surge in DeFi in recent months saw decentralized application (DApp) activity increase by 77% in the fourth quarter of 2023, with a total daily active user wallet count of seven million. </p><p>The European Commission is evaluating the DeFi industry and could require protocols to obtain a license in the near future.</p><p><a href=\"https://cointelegraph.com/news/de-fi-booms-daily-active-wallets-7-m-van-eck-bullish-ethereum-l2s-finance-redefined\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-04-05T19:19:32.000Z",
    "title": " Cboe seeks SEC approval to mix mutual funds with ETFs ",
    "url": "https://cointelegraph.com/news/cboe-seeks-sec-approval-mix-mutual-funds-etfs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvNTJmNDQ3NmItZjFjZS00MjhhLTllNmEtYWU4ODZhMzE3ODRiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The exchange has petitioned the Securities and Exchange Commission to approve a broad multi-share class structure.</p>\n                    <p><p>Cboe Global Markets has asked the Securities and Exchange Commission (SEC) to approve a rule change that would allow issuers to combine exchange-traded funds (ETFs) and mutual funds. </p><p>According to a Reuters report on April 4, Cboe <a href=\"https://www.reuters.com/business/finance/cboe-global-markets-seeks-sec-approval-list-etf-share-class-structure-2024-04-04/\" target=\"_blank\" rel=\"noopener nofollow\">submitted</a> a 19b-4 form requesting the green light to add an ETF share class to existing mutual funds, allowing for a multi-share class fund structure. If approved, the rule would allow issuers to combine and offer similar mutual funds and ETFs within a single investment vehicle. </p><p>Todd Sohn, an ETF analyst at Strategas LLC, told Reuters that “both the number of ETFs and ETF assets could soar” if the SEC approves Cboe’s request.</p><p><a href=\"https://cointelegraph.com/news/cboe-seeks-sec-approval-mix-mutual-funds-etfs\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-04-05T19:14:26.000Z",
    "title": "Montenegro Supreme court once again blocks Do Kwon’s extradition",
    "url": "https://cryptoslate.com/montenegro-supreme-court-once-again-blocks-do-kwons-extradition/",
    "description": "<p>The Supreme Court of Montenegro has overturned earlier rulings regarding the extradition of Terraform Labs co-founder Do Kwon and has ordered a new review of the case on April 5. The decision calls for the High Court in Podgorica to re-examine the extradition requests it previously addressed in an expedited manner. The Supreme Court&#8217;s decision [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/montenegro-supreme-court-once-again-blocks-do-kwons-extradition/\">Montenegro Supreme court once again blocks Do Kwon’s extradition</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-04-05T19:20:23.000Z",
    "title": "Bitdeer Utilizes Chip Giant TSMC, Eyeing $60M in Bitcoin Mining Equipment Production",
    "url": "https://news.bitcoin.com/bitdeer-utilizes-chip-giant-tsmc-eyeing-60m-in-bitcoin-mining-equipment-production/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/04/bdeer-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitdeer Utilizes Chip Giant TSMC, Eyeing $60M in Bitcoin Mining Equipment Production\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/04/bdeer-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/bdeer-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/bdeer-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/bdeer-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/bdeer-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/bdeer-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/04/bdeer.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to the publicly-listed mining corporation Bitdeer, the company is employing Taiwan Semiconductor Manufacturing Company (TSMC) for its Sealminer A1 mining rigs for the third quarter. Bitdeer also disclosed that it extracted 294 bitcoins in March, marking a 28.4% enhancement over March 2023&#8217;s earnings. Ahead of Bitcoin’s Next Halving, Bitdeer Taps TSMC for Proprietary Mining [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-05T19:14:45.000Z",
    "title": "BlackRock teams up with Wall Street giants for Bitcoin ETF participation",
    "url": "https://www.cryptopolitan.com/blackrock-team-wall-street-for-bitcoin-etf/",
    "description": "Blackrock, the largest ETF issuer in the developed world, has named four major Wall Street banks its authorized participants for its IBTC ETF, making them eligible for block trades. Citi, Citadel, Goldman Sachs, and UBS coming together at once with the spot bitcoin ETFs being the greatest spotlight of this is not a mere truth; [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-05T19:13:49.000Z",
    "title": "Wall Street banks want to buy Bitcoin directly from miners",
    "url": "https://www.cryptopolitan.com/wall-street-banks-to-buy-bitcoin-from-miners/",
    "description": "The financial world is spinning, folks, and it&#8217;s spinning fast, especially around Bitcoin. Wall Street, the big guy on the block, is now eyeing Bitcoin miners like the last slice of pizza at a party. Why? Because they want a piece of the action, and they want it directly from the source. This isn&#8217;t just [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-04-05T19:22:38.000Z",
    "title": "Myro, Raboo, and MOG Coin Set for Billion-Dollar Market Cap – Your Next Meme Coin Moonshots Await",
    "url": "https://nulltx.com/myro-raboo-and-mog-coin-set-for-billion-dollar-market-cap-your-next-meme-coin-moonshots-await/",
    "description": "The landscape of crypto, particularly the meme coin sector, is on the cusp of big things as we approach the Bitcoin halving. Three contenders stand out as the next meme coin set to produce big returns — Raboo, Myro, and MOG Coin — with each offering a different angle for [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-04-05T19:18:01.000Z",
    "title": "Meme Coin Sensation: Raboo (RABT) Presale Gears up to Eclipse FLOKI & BONK",
    "url": "https://nulltx.com/meme-coin-sensation-raboo-rabt-presale-gears-up-to-eclipse-floki-bonk/",
    "description": "The introduction of meme coins has injected a new layer of excitement into the crypto market, each with its own distinct charm and community backing. Raboo (RABT) is emerging as a standout with its eagerly awaited crypto presale, aiming to outshine notable rivals such as FLOKI and BONK in the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-05T19:30:50.000Z",
    "title": "History Favors Bitcoin Bulls Despite Crypto Hedge Funds Increasing Shorts",
    "url": "https://www.newsbtc.com/bitcoin-news/history-favors-bitcoin-bulls-despite-crypto-hedge-funds-increasing-shorts/",
    "description": "Bitcoin may be dripping lower at spot rates. Still, one analyst is unfazed, expecting the coin to reverse recent losses and snap up firmly before peaking in December 2024. At spot rates, BTC is down roughly 11% from 2024 peaks and struggling to generate sufficient buying pressure, looking at the formation in the daily chart. Will History Support Bitcoin And Rally To Fresh Highs? Taking to X, the analyst highlights historical price patterns using the 2-week Fisher Transform indicator, a tool for picking out potential reversal zones like double tops or bottoms. Though the technical indicator lags, it has accurately picked out peaks in the past.  Related Reading: Dogecoin Deflates: What’s Behind The 20% Price Drop Amidst Memecoin Mania? In 2021, when Bitcoin soared to over $69,000, the Fisher Transfer indicator printed a signal, highlighting potential peaks. In the coming weeks following this signal, prices crashed.  By the end of 2022, Bitcoin had fallen to as low as $16,000, accelerated by the collapse of FTX and the bankruptcy of several other popular crypto hedge funds, including Three Arrow Capital (3AC). The analyst also emphasizes the importance of the indicator in differentiating between a double top, mirroring 2017 and 2021, and a potential single peak later this year.  Presently, the trader said prices are approaching 2017 levels. Then, prices created what the analyst described as a &#8220;more subtle initial rise&#8221; before peaking six months later at over $20,000.  If this leads, and the indicator &#8220;pauses&#8221; where it is, Bitcoin will likely record a &#8220;single top.&#8221; However, only time will tell where this top will be at. Hedge Funds Were Selling At Tops? This prediction comes amid significant bearish bets by leveraged hedge funds. Data from the United States Commodities Futures Trading Commission (CFTC) reveals that these funds held record &#8220;short&#8221; positions in Bitcoin futures contracts by last week.  Observers note this was the largest short position since 2017, at over 16,000 contracts. By shorting, they expected prices to dump, which is precisely what&#8217;s happening at spot rates.  Related Reading: Bitcoin Short-Term Holders Go On 1.2 Million BTC Buying Spree, Is Retail Finally Here? However, even as hedge funds short, another analyst, responding to the trend, said the futures premium remained high. This is a development that some of these crypto hedge funds are taking advantage of. The number of shorts could increase in the days ahead as United States Federal Reserve officials appeared to be hawkish and upbeat economic data started pouring in. Being a data-driven central bank, the Federal Reserve might not slash rates as fast as initially projected. Feature image from DALLE, chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2024-04-05T19:30:00.000Z",
    "title": "The Meme Coin Analysts Call ‘A Second Chance for Those Who Regret Missing Out on Dogwifhat (WIF) and Book of Meme (MEME)",
    "url": "https://coinedition.com/the-meme-coin-analysts-call-a-second-chance-for-those-who-regret-missing-out-on-dogwifhat-wif-and-book-of-meme-meme/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/04/pr-6-14.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/04/pr-6-14.jpg 730w, https://coinedition.com/wp-content/uploads/2024/04/pr-6-14-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/04/pr-6-14-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/04/pr-6-14-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/04/pr-6-14-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/04/pr-6-14-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/04/pr-6-14-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/04/pr-6-14-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/04/pr-6-14-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/04/pr-6-14-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/04/pr-6-14-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/04/pr-6-14-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/04/pr-6-14-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/04/pr-6-14-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/04/pr-6-14-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/04/pr-6-14-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Meme coins have carved out a unique niche. These digital assets, often characterized by playful imagery and community-driven enthusiasm, have captured the attention of both seasoned investors and newcomers to the crypto space. Among the myriad of meme coins, one name has been generating significant buzz: HUMP. Analysts are calling it a second chance for [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/the-meme-coin-analysts-call-a-second-chance-for-those-who-regret-missing-out-on-dogwifhat-wif-and-book-of-meme-meme/\">The Meme Coin Analysts Call ‘A Second Chance for Those Who Regret Missing Out on Dogwifhat (WIF) and Book of Meme (MEME)</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]