[
  {
    "source": "CoinDesk",
    "date": "2023-10-04T13:00:30.000Z",
    "title": "Protocol Village: Solana Beats Ethereum on Decentralization on 'Nakamoto Coefficient'",
    "url": "https://www.coindesk.com/tech/2023/10/02/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the week of Oct. 2-8, with live updates throughout."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-04T13:06:00.000Z",
    "title": "Current Laws Sufficient to Charge Sam Bankman-Fried, Says DOJ",
    "url": "https://decrypt.co/200081/current-laws-sufficient-charge-sam-bankman-fried-says-doj",
    "description": "Sam Bankman-Fried's alleged actions, such as misappropriating customer funds, constitute fraud under existing laws, according to prosecutors. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-04T12:56:41.000Z",
    "title": "Binance CEO CZ rejected SBF's request for $40M for futures exchange: Going Infinite ",
    "url": "https://cointelegraph.com/news/ftx-binance-ceo-cz-rejected-sbf-40m-request-futures-exchange-book",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/65797ce4-6e3a-4ab4-83c3-c0b14814be10.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Michael Lewis's book 'Going Infinite' reveals that CZ and SBF had different goals when the first collaborative business opportunity arose in 2019. </p>\n                    <p><p>Binance CEO Changpeng Zhao reportedly declined to pay $40 million to former FTX CEO Sam Bankman Fried for a futures crypto exchange in March 2019, according to an excerpt from Michael Lewis’ book “Going Infinite.”</p><p>According to the book, SBF proposed a futures exchange with “zero risk” for the exchange in case of bad trades with high leverage. Traditionally, a futures exchange allows traders to leverage funds against a small collateral, and the exchange often asks traders to increase collateral in case the trade starts to go bad. </p><p>However, in crypto, the price swings could be fast and significant which could leave exchanges with bad debts due to lack of collateral. However, FTX wanted to create a futures exchange that would monitor the trader’s activity and, as soon as the trade surmounted the collateral, would liquidate the user’s positions, thus limiting any potential losses to the exchange.</p><p>The book suggests that at the time of Sam’s proposal in 2019, Binance and FTX had different goals. FTX wanted to cater to institutional investors while Binance was all about retail customers. After pondering the proposal for a few weeks. CZ reportedly denied the request for funding by Sam and went on to create an in-house futures platform.</p><p>The author of the book claims that CZ’s decision didn’t go down well with SBF who reportedly called the Binance CEO a “douche” for his decision. After the denial from Binance, FTX went on to create its own FTX futures exchange in 2019 but wasn’t really sure about its success. An excerpt from the book read:</p><blockquote>\"If it works it is worth billions of dollars, but I thought there was a better than fifty per cent chance it wouldn't work. I'd never done marketing. I'd never talked to the media. I'd never had customers. It was just different from anything that I'd ever done.”</blockquote><p>This was not the only incident when SBF and CZ crossed paths over a combined business decision. In 2021, when the FTX liquidity crisis came to light, FTX reached out to Binance again for an acquisition but CZ declined again claiming the platform was beyond redemption.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/sam-bankman-fried-ftx-trial-updates\">Latest update — Former FTX CEO Sam Bankman-Fried trial [Day 1]</a></em></strong></p><p>The latest revelation comes amid the start of trial for the former FTX CEO who is facing multiple charges of fraud and money laundering in connection to the <a href=\"https://cointelegraph.com/news/ftx-collapse-the-crypto-industry-s-lehman-brothers-moment\">collapse of the FTX exchange</a>. The <a href=\"https://cointelegraph.com/news/highlights-ftx-founder-sam-bankman-fried-first-day-trial\">jury trial of SBF</a> began on Oct.3.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\"><strong><em>Can you trust crypto exchanges after the collapse of FTX?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-04T13:02:49.000Z",
    "title": "How To Select The Best Alternative Crypto Exchanges For The UK",
    "url": "https://cryptodaily.co.uk/2023/10/how-to-select-the-best-alternative-crypto-exchanges-for-the-uk",
    "description": "With ByBit beginning to cease operations in the U.K., British users are looking for alternative crypto trading platforms, especially those offering both crypto futures and crypto investments aside from spot trading."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-04T13:07:56.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-04T13:07:07.000Z",
    "title": "US DOJ: lack of crypto rules doesn’t impact charges against ex-FTX CEO",
    "url": "https://crypto.news/us-doj-lack-of-crypto-rules-doesnt-impact-charges-against-ex-ftx-ceo/",
    "description": "The United States Department of Justice (DOJ) says the lack of crypto rules in the U.S. doesn't affect charges against ex-FTX CEO Sam Bankman-Fried (SBF)"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-04T12:54:27.000Z",
    "title": "Jury selection in Sam Bankman-Fried trial extended",
    "url": "https://crypto.news/jury-selection-in-sam-bankman-fried-trial-extended/",
    "description": "The Sam Bankman-Fried (SBF) trial's first day ended with multiple jurors dismissed; selection will resume for another day before the trial starts"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-04T12:50:29.000Z",
    "title": "Crypto-friendly lawmaker takes interim House Speaker position",
    "url": "https://crypto.news/crypto-friendly-lawmaker-takes-interim-house-speaker-position/",
    "description": "The crypto-friendly U.S. Representative Patrick McHenry has become Speaker pro tempore of the House of Representatives "
  },
  {
    "source": "BTCManager",
    "date": "2023-10-04T12:39:58.000Z",
    "title": "Binance helps Royal Thai Police to seize $277M from scammers",
    "url": "https://crypto.news/binance-helps-royal-thai-police-to-seize-277m-from-scammers/",
    "description": "Binance collaborated with law enforcement to stop a crypto scam in Thailand"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-04T13:00:41.000Z",
    "title": "Cardano Bullish Momentum: ADA Targets Range High Post Support Flip",
    "url": "https://www.newsbtc.com/news/cardano-bullish-momentum-ada-targets-range-high-post-support-flip/",
    "description": "Cardano (ADA) saw its market structure undergo a significant bullish transformation following a series of recent gains. This rally, which began in late September, has propelled ADA&#8217;s price up by more than 10% in just one week, measured from its lowest point to the recent peak. Although ADA experienced a retracement in the past few hours, it has managed to retain its overall bullish outlook. The initial signs weren&#8217;t entirely encouraging, as evidence from volume indicators hinted at dwindling buying pressure. Nevertheless, the bulls rallied with determination, successfully defending the critical $0.24 level.  As of the latest data, ADA is priced at $0.254 on CoinGecko, representing a marginal 3.1% decline over the past 24 hours. However, over the course of the last seven days, it has recorded a noteworthy gain of 5%. Related Reading: Is Dogecoin On Life Support? Analyzing Its Recent Price Downturn ADA Technical Indicators Analysts closely monitoring ADA&#8217;s price action have pointed toward a potential move to a range high of $0.28. For traders eyeing long positions, a lower timeframe bullish structure break could provide an entry point, targeting the range&#8217;s high.  The Relative Strength Index (RSI) has also made a promising climb back above the neutral 50 mark, while the On-Balance Volume (OBV) exhibits an encouraging uptick. The big question now looms: will the existing demand be sufficient to fuel a sustained rally? Whether this demand will be sufficient to fuel a sustained rally remains a subject of speculation. ADA market cap currently at $9.02 billion. Chart: TradingView.com Cardano Potential Amidst Shifting Market Trends Meanwhile, Cardano has attracted the attention of a separate analysis as one of the altcoins with the potential to capitalize on short profit windows. This opportunity emerges in the wake of Bitcoin&#8217;s recent surge, which catapulted it above the $28,000 mark. Analysis suggests that ADA could possibly decouple from broader market trends, presenting traders with a unique opportunity to capitalize on market divergences and seek profit. Cardano seven-day price action. Source: Coingecko ADA has exhibited resilience and determination in the face of fluctuating market dynamics. While initial signs pointed to a faltering of buying pressure, ADA has managed to pivot, defending the $0.24 level and setting its sights on the $0.28 mark.  Related Reading: Shiba Inu Investors Beware: 425 Billion Tokens On The Move – Is It A Sell-Out? The RSI and OBV indicators provide further encouragement to the bullish outlook. Moreover, the potential for ADA to break away from the larger market trends presents traders with an intriguing chance to capitalize on short-term profit opportunities. With the crypto market constantly evolving, Cardano&#8217;s resilience and ability to adapt to changing conditions make it an interesting asset to watch in the coming weeks. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from iStock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-04T13:07:54.000Z",
    "title": "Ripple’s Triumph in Singapore: MPI License Unlocks New Avenues for Digital Payments",
    "url": "https://www.crypto-news-flash.com/ripples-triumph-in-singapore-mpi-license-unlocks-new-avenues-for-digital-payments/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-triumph-in-singapore-mpi-license-unlocks-new-avenues-for-digital-payments",
    "description": "<img width=\"1000\" height=\"640\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-2-Ripple-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-2-Ripple-1.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-2-Ripple-1-300x192.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/Wit-Olszweski-2-Ripple-1-768x492.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Ripple has secured a Major Payments Institution (MPI) license from the Monetary Authority of Singapore (MAS), allowing it to provide digital token payment services in the country. Ripple&#8217;s XRP cryptocurrency experienced a notable surge, gaining over 5 percent and reaching $0.53 in price, subsequently entering the top five cryptocurrencies by market capitalization. Blockchain startup Ripple [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-04T13:00:11.000Z",
    "title": "Bitcoin Spark’s Potential to Outperform Major Cryptocurrencies Like Solana And Dogecoin",
    "url": "https://www.crypto-news-flash.com/bitcoin-sparks-potential-to-outperform-major-cryptocurrencies-like-solana-and-dogecoin/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-sparks-potential-to-outperform-major-cryptocurrencies-like-solana-and-dogecoin",
    "description": "<img width=\"512\" height=\"298\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-9.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-9.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-9-300x175.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />With the interest, investments, and momentum in Bitcoin Spark&#8217;s Initial Coin Offering (ICO), some crypto watchers have come out to say it has the potential to outperform major cryptocurrencies like Solana (SOL) and Dogecoin (DOGE). Is Dogecoin dead? While Dogecoin (DOGE) may be trading well below its all-time high, it&#8217;s premature to declare it dead. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-04T12:45:11.000Z",
    "title": "XRP and Cardano Futures Ready to Launch After Ripple Destroys SEC Again",
    "url": "https://www.crypto-news-flash.com/xrp-and-cardano-futures-ready-to-launch-after-ripple-destroys-sec-again/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-and-cardano-futures-ready-to-launch-after-ripple-destroys-sec-again",
    "description": "<img width=\"1280\" height=\"960\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-1024x768.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/ripple-XRP-COINS-768x576.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Binance Futures announces the addition of new XRP and ADA quarterly delivery contracts. The altcoin market, including XRP and ADA, witnesses volatile price action amid market fluctuations. Binance Unveils Future Market Strategy: A Deep Dive into Its Upcoming Offerings At the very core, futures are intricate financial derivative products. They enable traders to make educated [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-04T12:46:42.000Z",
    "title": "Navigating the Crypto Regulation Landscape in India",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/navigating-the-crypto-regulation-landscape-in-india/",
    "description": "<p>The regulatory landscape surrounding cryptocurrencies varies from one country to another. In India, the path toward regulating cryptocurrencies has been filled with twists and turns. Leaving investors and businesses eager for clarity. In this article, we will explore the evolution of crypto regulation in India. The challenges it has faced, and the current status of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/navigating-the-crypto-regulation-landscape-in-india/\">Navigating the Crypto Regulation Landscape in India</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-04T12:55:00.000Z",
    "title": "Terra LUNC Community Vote Against $130,000 Spending Proposal",
    "url": "https://coinedition.com/terra-lunc-community-vote-against-130000-spending-proposal/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Bulls-Reassert-Hold-on-LUNC-Market-Raising-the-Price-to-0.0001638.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bulls Reassert Hold on LUNC Market, Raising the Price to 0.0001638\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Bulls-Reassert-Hold-on-LUNC-Market-Raising-the-Price-to-0.0001638.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Bulls-Reassert-Hold-on-LUNC-Market-Raising-the-Price-to-0.0001638-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Bulls-Reassert-Hold-on-LUNC-Market-Raising-the-Price-to-0.0001638-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Bulls-Reassert-Hold-on-LUNC-Market-Raising-the-Price-to-0.0001638-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Bulls-Reassert-Hold-on-LUNC-Market-Raising-the-Price-to-0.0001638-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Bulls-Reassert-Hold-on-LUNC-Market-Raising-the-Price-to-0.0001638-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent video, Clay, the host of the ClayBro YouTube channel, said a $130,000 spending proposal has seen massive rejection by the Terra Luna Classic community. The proposal adds to a growing list of other proposals decided upon by the community this month. Notably, the $130,000 spend proposal is to develop the Terra LUNC [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/terra-lunc-community-vote-against-130000-spending-proposal/\">Terra LUNC Community Vote Against $130,000 Spending Proposal</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]