[
  {
    "source": "CoinDesk",
    "date": "2023-10-02T22:42:04.000Z",
    "title": "Protocol Village: Babylon Unveils Bitcoin Staking Protocol for Cosmos Ecosystem",
    "url": "https://www.coindesk.com/tech/2023/10/02/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the week of Oct. 2-8, with live updates throughout."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-02T22:56:32.000Z",
    "title": "Crowdfunding Site BackerKit Bans AI-Generated Imagery from Campaigns",
    "url": "https://decrypt.co/199835/crowdfunding-site-backerkit-bans-ai-generated-imagery-from-campaigns",
    "description": "Following Kickstarter's move, BackerKit is the latest crowdfunding site requiring users to disclose the use of AI-generated images in campaigns."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-02T22:57:51.000Z",
    "title": "6 Questions for JW Verret — an attorney who’s tracking the money, but advocating for crypto",
    "url": "https://cointelegraph.com/magazine/6-questions-for-jw-verret-an-attorney-whos-tracking-the-money-but-advocating-for-crypto/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/10/JW-Verret-scaled.jpeg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>J.W. Verret is a Harvard-educated attorney who teaches corporate finance and accounting at George Mason University. His work has increasingly intersected with the crypto sector in recent years, as his legion of Twitter followers — who know him as “BlockProf,” or the Blockchain Professor — are poignantly aware. 1) You’re very busy professionally — teaching at […]</p>\n                    <p><p>J.W. Verret is a Harvard-educated attorney who teaches corporate finance and accounting at George Mason University. His work has increasingly intersected with the crypto sector in recent years, as his legion of Twitter followers  who know him as “BlockProf,” or the Blockchain Professor  are poignantly aware.</p><h2 class=\"wp-block-heading\" id=\"h-1-you-re-very-busy-professionally-teaching-at-george-mason-university-serving-on-committees-with-the-securities-and-exchange-commission-going-to-trials-as-expert-witness-how-did-life-lead-you-to-cryptocurrency\">1) You’re very busy professionally  teaching at George Mason University, serving on committees with the Securities and Exchange Commission, going to trials as expert witness. How did life lead you to cryptocurrency?</h2><p>I spent 15 years as a libertarian regulation/financial person, writing it, think-tanking it in Washington, D.C. For the first 10 years, I lost everything I fought for in the Dodd-Frank era.</p><section class=\"adv-banner adbutler-ad adbutler-ad__desktop\"><div class=\"container\"><!-- 1456x180 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><section class=\"adv-banner adbutler-ad adbutler-ad__mobile\"><div class=\"container\"><!-- 600x500 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><p>The thing with crypto is that it’s been a freedom revolution in finance. It fixes, or aims to fix, problems in finance that government regulation only aims to fix. Regulation entrenches intermediaries where crypto fixes problems by eliminating the need for those intermediaries. And that was very interesting to me. </p><h2 class=\"wp-block-heading\" id=\"h-2-you-served-on-the-sec-s-investor-advisory-committee-you-ve-also-been-very-vocal-in-criticising-chairman-gary-gensler-how-was-that-experience\"><strong>2) You served on the SEC’s Investor Advisory Committee. Youve also been very vocal in criticising Chairman Gary Gensler. How was that experience?</strong></h2><p>It was a good experience. I replaced Hester Pierce when she became an SEC commissioner. I wrote a lot of dissents as a committee member, so I hope I did Hester proud, but I do not think they’ll invite me back in the future under the current chairman. It seems like he’s been trying to just destroy this industry. He could’ve reached out to the industry to try to make things work, but he has no interest in that, and he’s sued some of the best actors in crypto  Coinbase and Kraken  while ignoring the worst.</p><h2 class=\"wp-block-heading\" id=\"h-3-you-re-a-vocal-proponent-of-zcash-explain-your-interest-there\"><strong>3) You’re a vocal proponent of ZCash. Explain your interest there.</strong></h2><p>Zcash is like Bitcoin, but private. It’a a great invention. Whoever the developers were  deserve a Nobel Prize.</p><p>I own a lot of Bitcoin. I think it’s a tremendous innovation. But for day-to-day payments, I think we need some privacy, and it’s hard to get that with Bitcoin. I’m also a fan of Monero. which has some pretty good privacy technology. But they’re both pretty good projects  t’s possible to like both the Rolling Stones and the Beatles.</p><p><strong><em>Also read: <a href=\"https://cointelegraph.com/news/supreme-court-could-stop-the-sec-war-on-crypto\" target=\"_blank\" rel=\"nofollow\" >The Supreme Court could stop the SECs war on crypto</a></em></strong></p><p>There are no other privacy tokens that are in the same ballpark. There are some that are really neat innovations, but they’re not at the level you need to have the same privacy. There are some interesting ones, sure. Other projects I’m very excited about are Samourai Wallet and Sparrow Wallet, which offer a bit of privacy for BItcoin transactions.</p><h2 class=\"wp-block-heading\" id=\"h-4-on-that-note-how-do-you-think-the-future-of-crypto-is-going-to-be-defined-is-it-going-to-be-defined-as-a-way-to-achieve-greater-privacy-in-transaction-will-it-be-defined-by-efficiency-in-the-sense-that-it-s-easier-to-use-than-traditional-finance-instruments-will-it-be-defined-by-crime-or-will-it-be-some-mixture-of-these\"><strong>4) On that note, how do you think the future of crypto is going to be defined? Is it going to be defined as a way to achieve greater privacy in transaction? Will it be defined by efficiency in the sense that its easier to use than traditional finance instruments? Will it be defined by crime? Or will it be some mixture of these?</strong></h2><p>That’s an interesting question. I think it will be some combination of all those things. Crime is often a testing ground for new technology. It certainly was for the internet. In the 1990s, a lot of criminals used the internet. I think the strongest forces in determining what cryptos survive will be some mixture of efficiency and scale, but I think privacy will be a part of it. As governments and big corporations fight back against trustless, disintermediated property transfers, the only way to protect yourself will be using privacy coins and privacy protocols.</p><h2 class=\"wp-block-heading\" id=\"h-5-you-re-also-serving-as-a-professional-witness-in-u-s-v-sterlingov-which-involves-the-u-s-government-charging-roman-sterlingov-with-developing-bitcoin-fog-a-crypto-mixer-tell-me-about-that\"><strong>5) Youre also serving as a professional witness in <em>U.S. v. Sterlingov, </em>which involves the U.S. government charging Roman Sterlingov with developing Bitcoin Fog, a crypto mixer. Tell me about that.</strong></h2><p>I spend a lot of time as a forensic accountant, but I’m also into privacy. Some people think that’s a conflict: How can you be privacy while also following the money? But I dont see that as a conflict at all. Some of the people most into privacy who I know are forensic investigators. I’m a believer in public information. People should learn what it takes to be private. The worst people tend not to be smart anyway  they make mistakes, and they dont use privacy tools optimally.</p><p><em><strong>Also read:<a href=\"https://cointelegraph.com/news/elizabeth-warren-wants-the-police-at-your-door-in-2024\" target=\"_blank\" rel=\"nofollow\" > Elizabeth Warren wants the police at your door in 2024</a></strong></em></p><p>In terms of <em>U.S. v. Sterlingov,</em> Im providing some expert help in forensic accounting and money laundering. It’s been helpful to merge my legal and accounting perspectives to aid the legal team.  I also do some work helping customers of large crypto exchanges when their crypto is frozen, and we ultimately resolve it when we figure out that the customer did nothing wrong  but were falsely flagged by crypto tracing tools. </p><p>False positives in crypto tracing can have a real cost and that is one thing that concerns me about the dominance of some of the tracing firms. TRM and Ciphertrace seem like they try to get things right  and don’t overclaim their tracing capabilities  but that’s not true of every firm in this industry.</p><h2 class=\"wp-block-heading\" id=\"h-6-i-hear-you-have-opinions-about-ufos-can-you-tell-us-what-you-know\"><strong>6) I hear you have opinions about UFOs. Can you tell us what you know?</strong></h2><p>I’m really into podcasts about the history of investigations into UFOs. Some good ones are <em>Strange Arrivals and</em> <em>High Strange</em>. Id also recommend reading J. Allen Hyneks <em>The Hynek UFO Report, </em>which is about the Project Bluebook Report.  He was a physics professor at a little school and the Air Force asked him to look into it one day. I think they thought he’d be a front man  and he was, but then he changed.</p><p>The government knows no more now than it did 50 years ago. They may know more than they’ve shared, but I don’t think they understand it. The Navy pilot revelations are pretty amazing. So I think they do exist. I think they’re probably probes of some kind that are unmanned  nothing armageddon or conspiracy. I just think they want to see what we’re up to.</p><div class=\"subscribe subscribe--inner\"><div class=\"container\"><div class=\"subscribe__inner\"><div class=\"subscribe__content\">    <div class=\"subscribe__title display2\">Subscribe</div>    <div class=\"subscribe__desc text-l\">The most engaging reads in blockchain. Delivered once a        week.</div>        <div class=\"wpcf7 no-js\" id=\"wpcf7-f13672-o1\" lang=\"en-US\" dir=\"ltr\"><div class=\"screen-reader-response\"><p role=\"status\" aria-live=\"polite\" aria-atomic=\"true\"></p> <ul></ul></div><form action=\"/magazine/wp-json/wp/v2/posts?_embed&per_page=100#wpcf7-f13672-o1\" method=\"post\" class=\"wpcf7-form init subscribe__form demo\" aria-label=\"Contact form\" novalidate=\"novalidate\" data-status=\"init\"><div style=\"display: none;\"><input type=\"hidden\" name=\"_wpcf7\" value=\"13672\" /><input type=\"hidden\" name=\"_wpcf7_version\" value=\"5.7.7\" /><input type=\"hidden\" name=\"_wpcf7_locale\" value=\"en_US\" /><input type=\"hidden\" name=\"_wpcf7_unit_tag\" value=\"wpcf7-f13672-o1\" /><input type=\"hidden\" name=\"_wpcf7_container_post\" value=\"0\" /><input type=\"hidden\" name=\"_wpcf7_posted_data_hash\" value=\"\" /></div><fieldset class=\"form-group\"><p><input size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-email wpcf7-validates-as-required wpcf7-validates-as-email\" id=\"footer-subscribe\" aria-required=\"true\" aria-invalid=\"false\" value=\"\" type=\"email\" name=\"your-email\" /><label for=\"footer-subscribe\">Email address</label></p></fieldset><p><button class=\"subscribe__btn btn btn-white\">SUBSCRIBE</button></p><div class=\"wpcf7-response-output\" aria-hidden=\"true\"></div></form></div></div><div class=\"subscribe__img\">    <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2022/10/reading-copy.png\" alt=\"Subscribe to Magazine by Cointelegraph Newsletter.\" /></div></div></div></div></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-02T22:40:59.000Z",
    "title": "CFTC Chair Rostin Behnam disagrees with Gary Gensler on the state of digital asset regulation",
    "url": "https://cryptoslate.com/cftc-chair-rostin-behnam-disagrees-with-gary-gensler-on-the-state-of-crypto-regulation/",
    "description": "<p>Speaking at the Futures Industry Association Expo 2023 on Oct. 2, U.S. Commodity Futures Trading Commission (CFTC) Chair Rostin Behnam reiterated his stance on the urgency of implementing a substantial regulatory framework in the burgeoning cryptocurrency market. Behnam&#8217;s comments are among the firmest to date in a series of calls for greater attention to updating [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/cftc-chair-rostin-behnam-disagrees-with-gary-gensler-on-the-state-of-crypto-regulation/\">CFTC Chair Rostin Behnam disagrees with Gary Gensler on the state of digital asset regulation</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-10-02T22:57:51.000Z",
    "title": "6 Questions for JW Verret — an attorney who’s tracking the money, but advocating for crypto",
    "url": "https://cointelegraph.com/magazine/6-questions-for-jw-verret-an-attorney-whos-tracking-the-money-but-advocating-for-crypto/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/10/JW-Verret-scaled.jpeg\"></p><p>J.W. Verret is a Harvard-educated attorney who teaches corporate finance and accounting at George Mason University. His work has increasingly intersected with the crypto sector in recent years, as his legion of Twitter followers — who know him as “BlockProf,” or the Blockchain Professor — are poignantly aware. 1) You’re very busy professionally — teaching at […]</p>\n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-02T23:00:02.000Z",
    "title": "Brace For Impact As $200 Million In Crypto Is Being Unlocked In October",
    "url": "https://www.newsbtc.com/crypto/200-million-crypto-unlocked/",
    "description": "In a sudden turn of events for what is usually expected to be a bullish month for the crypto industry, a series of token unlocks set to take place this month is now threatening this bullish momentum. With around $200 million in various altcoins expected to flood the open market, the current market rally may end up being short-lived. $200 Million In Crypto Being Unlocked Token tracking website Token Unlocks has revealed that around $200 million in various cryptocurrencies are being unlocked at various intervals through the course of this year. The tokens being unlocked range from SUI to Optimism to Aptos’s APT, among others. Related Reading: LINK Price Primed For Meteoric Rise: Analyst Predicts 130% Rally To $18 A screenshot shared by Wu Blockchain on X (formerly Twitter) showed a list of tokens expecting large crypto unlocks in October, as well as the percentage of supply they represent and their equivalent dollar value. The first on the list is SUI. SUI’s upcoming token unlock is by no means the largest on the list. But it is significant and will be the first to take place this month. Set to happen on October 3, 34.62 million SUI tokens (4.37% of supply) worth $17.11 million will flow into the open market. Following this just a couple of days later on October 7 is the Immutable X (IMX) token unlock. This unlock will see another 1.55% of the total supply (18.08 million tokens) worth $10.91 million unlocked. Aptos follows five days later on October 12 with 4.54 million APT tokens accounting for 1.91% of supply and worth $25.81 million. Crypto token unlocks for October &#124; Source: X ApeCoin’s unlock of 15.6 million tokens will then take place on October 17. This represents 4.23% of supply and is worth $19.50 million; the third-lowest of the bunch. The highest on the list in terms of dollar figures is the Axie Infinity token unlock. This crypto unlock will happen toward the end of the month on October 20, with 15.13 million tokens representing 11.50% of the total AXS supply. The dollar value of these tokens is $71.24 million going by current prices. Related Reading: What Is Behind The 16% PEPE Price Recovery And Will It Continue? Last but not least, is another Optimism OP token unlock. It is slated for October 30 and 24.16 million tokens, similar to previous unlocks, will be brought into circulation. This translates to 3.03% of supply with a dollar value of $35.03 million. In total, 31 crypto projects have scheduled token unlocks for the month of October. Other notable but smaller unlocks include DYDX’s $4.51 million unlock, CYBER’s $6.87 million unlock, FLOW’s $3.44 million unlock, and Space ID’s $3.98 million token unlock. Total market cap recovers to $1.095 trillion &#124; Source: Crypto Total Market Cap on Tradingview.com Follow Best Owie on X (formerly Twitter) for market insights, updates, and the occasional funny tweet… Featured image from Forbes India, chart from TradingView.com"
  }
]