[
  {
    "source": "Bitcoin.com",
    "date": "2023-09-29T04:30:56.000Z",
    "title": "Venezuelan Crypto Watchdog Sunacrip Extends Restructuring Period; Community Asks for Clarity",
    "url": "https://news.bitcoin.com/venezuelan-crypto-watchdog-sunacrip-extends-restructuring-period-community-asks-for-clarity/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1629712153-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Venezuelan Crypto Watchdog Sunacrip Extends Restructuring Period; Community Asks for Clarity\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1629712153-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1629712153-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1629712153-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1629712153-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1629712153-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1629712153-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1629712153.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Venezuelan government has officially announced the extension of the restructuring period for Sunacrip — the national cryptocurrency watchdog — by six months more due to the link of its former head with a corruption scheme. Asonacrip, a national crypto association, is asking Sunacrip to open communication channels with the community affected by its actions. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T04:11:37.000Z",
    "title": "The Surging Tensions of AI Copyright in the Digital Era",
    "url": "https://www.cryptopolitan.com/surging-tensions-ai-copyright-digital-era/",
    "description": "In a recent revelation, the intersection of artificial intelligence (AI) and intellectual property has ignited a heated debate, putting Australian authors&#8217; intellectual property rights in jeopardy. This controversy revolves around the unauthorized use of copyrighted literary works, including those by renowned authors like Peter Carey, Helen Garner, and Tim Winton, in a pirated dataset known ... <a title=\"The Surging Tensions of AI Copyright in the Digital Era\" class=\"read-more\" href=\"https://www.cryptopolitan.com/surging-tensions-ai-copyright-digital-era/\" aria-label=\"More on The Surging Tensions of AI Copyright in the Digital Era\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T04:10:00.000Z",
    "title": "The Ultimate Blockchain Developer Resource List for Beginners & Veterans",
    "url": "https://www.cryptopolitan.com/ultimate-blockchain-developer-resource-list/",
    "description": "Blockchain development is undeniably at the forefront of the tech industry&#8217;s evolution. In an era where digital innovation reigns supreme, the importance of a blockchain developer resource list cannot be overstated. This cutting-edge field has ushered in a new era of secure, transparent, and decentralized systems that have the potential to disrupt numerous industries. As ... <a title=\"The Ultimate Blockchain Developer Resource List for Beginners &#038; Veterans\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ultimate-blockchain-developer-resource-list/\" aria-label=\"More on The Ultimate Blockchain Developer Resource List for Beginners &#038; Veterans\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-29T04:29:55.000Z",
    "title": "Ethereum Price Registers Breakout But Lacks Momentum, $1,620 Is The Key",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-breakout-1620/",
    "description": "Ethereum price is attempting a fresh increase above $1,650 against the US Dollar. ETH could accelerate higher if it clears the $1,670 resistance. Ethereum is attempting a fresh increase above the $1,620 level. The price is trading above $1,620 and the 100-hourly Simple Moving Average. There is a key bullish trend line forming with support near $1,645 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to rise if it clears the $1,670 resistance zone. Ethereum Price Climbs Higher Ethereum’s price formed a base above the $1,580 level. ETH remained stable and climbed above the $1,620 resistance zone to move into a positive zone, like Bitcoin. There was a move above the $1,650 level but upsides were limited. A high was formed near $1,667 and there was a minor downside correction. The price is now trading near the 23.6% Fib retracement level of the upward move from the $1,583 swing low to the $1,667 high. Ethereum is trading above $1,640 and the 100-hourly Simple Moving Average. There is also a key bullish trend line forming with support near $1,645 on the hourly chart of ETH/USD. Source: ETHUSD on TradingView.com On the upside, the price might face resistance near the $1,670 level. The next major resistance is $1,720. A clear move above the $1,720 resistance zone could set the pace for a larger increase. In the stated case, the price could visit the $1,800 resistance. The next key resistance might be $1,820. Any more gains might open the doors for a move toward $1,880. Are Dips Limited in ETH? If Ethereum fails to clear the $1,670 resistance, it could a downside correction. Initial support on the downside is near the $1,645 level and the trend line. The next key support is $1,620 or the, below which the price could test the $1,600 support. A downside break below the $1,600 support might start another bearish wave. In the stated case, there could be a drop toward the $1,540 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,620 Major Resistance Level – $1,670"
  }
]