[
  {
    "source": "CoinDesk",
    "date": "2023-09-26T19:46:09.000Z",
    "title": "U.S. House Lawmakers Push SEC’s Gensler to Approve Spot Bitcoin ETF ‘Immediately’",
    "url": "https://www.coindesk.com/policy/2023/09/26/us-house-lawmakers-push-secs-gensler-to-approve-spot-bitcoin-etf-immediately/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Securities and Exchange Commission (SEC) should listen to the courts and give up its efforts to block exchange traded funds (ETFs) holding bitcoins, a bipartisan group of lawmakers argued in a letter to SEC Chair Gary Gensler."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-26T19:47:23.000Z",
    "title": "Bitwise amends spot Bitcoin ETF application with new, detailed argumentation",
    "url": "https://cointelegraph.com/news/bitwise-amends-spot-bitcoin-etf-application-new-detailed-argumentation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/cd341087-8d37-4093-a62d-0fc4c9cd338a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The amendments tackle arguments made by the SEC against the use of the CME BTC futures market for surveillance sharing. </p>\n                    <p><p>Bitwise Asset Management has filed an amended application for a spot Bitcoin exchange-traded fund (ETF), beefing it up with 40 pages of new text responding to the United States Securities and Exchange Commission’s (SEC) objections to the product. It still might not be enough to satisfy regulatory requirements, though, a company executive warned.</p><p>Bitwise is among the six financial firms whose spot BTC ETF applications are on hold after the SEC <a href=\"https://cointelegraph.com/news/sec-delays-decision-on-wisdomtree-s-spot-bitcoin-etf\">delayed its consideration</a>. That move came after a court <a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\">overturned the agency’s rejection</a> of a Grayscale Investments application to convert its over-the-counter Grayscale Bitcoin Trust into a listed BTC ETF.</p><p>Bitwise chief investment officer Matt Hougan explained in a thread on X (formerly Twitter) that, should the SEC appeal the Grayscale ruling, “we return to the status quo.” In that case, he <a href=\"https://twitter.com/Matt_Hougan/status/1706299462765982110\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a>:</p><blockquote>“We're back to needing to prove that the CME bitcoin futures market leads price discovery over the spot market such that it can serve as a ‘regulated market of significant size’ for the purpose of surveillance.”</blockquote><p>The Chicago-based CME Group operates derivatives exchanges including a BTC futures and options market. </p><p>In its amended application, Bitwise engaged with what the SEC called “the ‘mixed’ or ‘inconclusive’ academic record” on the lead-lag relationship between BTC futures and spot markets. After looking at academic works cited in 11 previous SEC disapproval orders for spot BTC exchange-traded products, Bitwise <a href=\"https://www.nyse.com/publicdocs/nyse/markets/nyse-arca/rule-filings/filings/2023/SR-NYSEArca-2023-44_Am._1.pdf\" target=\"_blank\" rel=\"noopener nofollow\">said</a>, “The data show convincingly that the CME is the leading source of price discovery.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ NEW: Bitwise Spot Bitcoin ETF Update<br><br>NYSE today filed an amended application to list the Bitwise Bitcoin ETF Trust, complete with 40+ pages of new research from Bitwise.<br><br>The research addresses key concerns the SEC has raised around spot bitcoin ETFs.<br><br>Here’s why it matters — <a href=\"https://t.co/RPb7OXRGat\">pic.twitter.com/RPb7OXRGat</a></p>&mdash; Matt Hougan (@Matt_Hougan) <a href=\"https://twitter.com/Matt_Hougan/status/1706299462765982110?ref_src=twsrc%5Etfw\">September 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Furthermore, Hougan summarized that the amended application demonstrated that “every well-designed academic study supports the finding that the CME is ‘significant,’” countering several arguments put forward by the SEC in previous disapproval decisions.</p><p>The conclusions reached in the amended Bitwise application are significant for meeting SEC requirements. The agency has determined that a listing exchange must have a surveillance-sharing agreement with a regulated market, such as the CME BTC futures market, that is \"of significant size.\" That requirement comes into force if an exchange “cannot establish that other means to prevent fraudulent and manipulative acts and practices are sufficient.” The SEC has found that to be the case for previous applicants.</p><p>Hougan warned, “Surveillance sharing agreements with spot exchanges are positive, but may not satisfy the technical regulatory requirements.”</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-etf-optimist-and-worldcoin-skeptic-gracy-chen-hall-of-flame/\">Bitcoin ETF optimist and Worldcoin skeptic Gracy Chen: Hall of Flame</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-26T19:40:41.000Z",
    "title": "CBDCs could support a more stable economy — if banks pull the strings",
    "url": "https://cointelegraph.com/news/cbdcs-support-economy-banks-control",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/4e1350e0-a898-4e89-9a2a-4ac88f586c68.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Central bank digital currencies (CBDCs) could confer economic benefits if governments don't use them to cannibalize the commercial banking industry.</p>\n                    <p><p><a href=\"https://cointelegraph.com/cryptocurrency-regulation-for-beginners/what-are-cbdcs-a-beginners-guide-to-central-bank-digital-currencies\">Central Bank Digital Currencies (CBDCs)</a> have become well-established as a major talking point in the academic mainstream<a href=\"https://cointelegraph.com/news/crypto-adoption-political-deadlock-usa\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-adoption-political-deadlock-usa/amp\"> and geopolitics</a> — not to mention the crypto community and its rowdy public discourse on X. While national leaders and supranational financial institutions such as the World Bank and International Monetary Fund have come to a broad consensus that CBDCs stand to provide great benefits, very little has been said detailing where CBDCs are best designed to provide support, and where their adoption may be, so to speak, out of bounds.</p><p>In order for CBDCs to have a net positive effect on the global economy, it is imperative for global leaders to recognize their advantages and limitations. CBDCs can help central bankers to implement more effective capital controls, stimulus plans, and other forms of monetary policy as they issue debt to banks — that is, at the wholesale level.</p><p>Within these bounds and only within these bounds, CBDCs can help central banks to <a href=\"https://cointelegraph.com/news/cbdcs-only-solution-to-smooth-continuation-of-the-monetary-system-ecb\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cbdcs-only-solution-to-smooth-continuation-of-the-monetary-system-ecb/amp\">smooth market downturns</a>, minimize recessions, and expedite growth — necessary practices in supporting stable national and regional economies. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Stablecoins will soon be one of the largest sources of demand for US treasuries on the planet. <a href=\"https://t.co/qjMyN4QjQ7\">https://t.co/qjMyN4QjQ7</a></p>— Will Clemente (@WClementeIII) <a href=\"https://twitter.com/WClementeIII/status/1706734028215419076?ref_src=twsrc%5Etfw\">September 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Implementing CBDCs at the retail level to serve individuals and corporations directly, on the other hand, is far <a href=\"https://cointelegraph.com/news/swift-blockchain-integration-cbdcs\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/swift-blockchain-integration-cbdcs/amp\">too complex</a> and nuanced an undertaking for central banks to manage.</p><h2>The right product-industry fit</h2><p>In the private sector, identifying a proper product-market fit is always a primary consideration for any startup. In the public sector, conducting a similar process with any nascent technology is equally important. In the case of CBDCs, the objective may be most appropriately described as a “product-industry fit” of sorts.</p><p>Wholesale CBDCs and the blockchains (more broadly, distributed ledgers) where they live can help central bankers to do their jobs more effectively because they confer superior security, transparency, and streamlined issuance, and because central bankers have the experience and know-how to draw on those benefits within the scope of their work.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/the-world-could-be-facing-a-dark-future-thanks-to-cbdcs\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/the-world-could-be-facing-a-dark-future-thanks-to-cbdcs/amp\"><strong><em>The world could be facing a dark future thanks to CBDCs</em></strong></a></p><p>Like any nascent technology, CBDCs should not be conflated with a replacement for any such specialized expertise, nor should they be extended to industries or economic sectors based on their technological capabilities alone. CBDCs only stand to add value when they can be properly accompanied by professionals with adequate expertise to leverage their benefits.</p><h2>Overreach: Bypassing commercial banking</h2><p>In addition to their utility in wholesale applications, CBDCs open the doors for central bankers to cannibalize and consume the entire commercial banking industry by issuing CBDCs directly to individuals, businesses, and other organizations at their own discretion. Though tempting and ostensibly more efficient, implementing such a system is an extremely complex undertaking and the adoption runway is fraught with challenges — as has been the case for Nigeria’s eNaira and China’s digital Yuan..</p><p>Put simply, central bankers should not take action simply because it is feasible to do so. Although retail CBDCs grant central banks the ability to bypass commercial banks and act as direct issuers at the retail and corporate levels, they do not confer the nuanced wisdom and rigorous experience required to do so effectively. Innovation is not a replacement for specialization; rather, innovation tends to refine specialization.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/cbdcs-threaten-our-future-so-it-s-time-to-take-a-stand\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/cbdcs-threaten-our-future-so-it-s-time-to-take-a-stand/amp\"><strong><em>CBDCs threaten our future, so it’s time to take a stand</em></strong></a></p><p>Commercial banks have cultivated deep expertise over the course of centuries developing models and algorithms for credit score evaluation, loan disbursement, account management, restructuring, reserve management, and servicing a broad range of retail clients across jurisdictions and wealth profiles –and that doesn’t even begin to touch corporate finance and corporate debt issuance. It is critical for central bankers to recognize that, just as their line of work is exceptionally nuanced and refined, so too is the landscape of commercial banking — and perhaps even more so.</p><p>Employing CBDCs in an attempt to undercut, circumvent, or cannibalize the entire commercial banking sector is as much a pipe dream for efficiency maximalists as it is a recipe for failure. The practice of issuing currency to corporations and individuals, as well as assessing loan applications, business models, credit score algorithms, and an extensive array of other relevant variables requires fully dedicated institutions that operate independently from the mechanisms and decisions shaping monetary policy.</p><h2>The bright side: Commercial banking will not be left in the dark ages</h2><p>Commercial banks and money transmitters will not be left in antiquity — they too have an emerging suite of on-chain tooling rapidly becoming available. Stablecoins, deposit tokens, and related DLT-based tools enable commercial banks to extend enhanced efficiency, transparency, and security to retail and corporate clients, just as CBDCs benefit central banks in their line of work.</p><p>Banks and money transmitters are well equipped to draw on wholesale CBDCs as collateral to issue stablecoins and deposit tokens for use in commercial applications. Additional on-chain integrations will allow commercial banks to streamline cross-border transfers, open direct trade corridors between nations, and integrate cutting-edge <a href=\"https://cointelegraph.com/news/aml-and-kyc-a-catalyst-for-mainstream-crypto-adoption\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/aml-and-kyc-a-catalyst-for-mainstream-crypto-adoption/amp\">Know Your Customer (KYC)</a> procedures to enhance security and privacy for their customers. </p><p>Commercial banks have deep experience managing deposit accounts based on central bank collateral and monetary policy, and are best positioned to continue managing those responsibilities in the digital era. If all goes well, the global adoption of CBDCs will marshal a new financial paradigm where central banks implement superior monetary policy at the wholesale level while allowing commercial banks to do what they do best at the retail level with stablecoins and deposit tokens.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Bradley Allgood</strong> is the founder and CEO of Fluent Finance, a project focused on pioneering deposit token infrastructure to bring banks and financial institutions on-chain. Before founding Fluent, Bradley designed the Web3 banking platform and its associated legal framework for the first Special Economic Zone (SEZ) in the United States.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p>\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-26T20:06:10.000Z",
    "title": "Crypto workers paid in fiat – a betrayal to the industry?",
    "url": "https://www.cryptopolitan.com/crypto-workers-paid-in-fiat-pantera-capital/",
    "description": "It is no secret that many crypto-industry employees anticipate that crypto will eventually play a far larger role in the entire financial and payment system. However, for the time being, practically all of them are paid in government-issued currency or &#8220;fiat&#8221; in industry parlance. The world of distributed ledgers is controlled by a distributed workforce. ... <a title=\"Crypto workers paid in fiat &#8211; a betrayal to the industry?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-workers-paid-in-fiat-pantera-capital/\" aria-label=\"More on Crypto workers paid in fiat &#8211; a betrayal to the industry?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-26T19:41:03.000Z",
    "title": "Venezuela extends Sunacrip reorganization period",
    "url": "https://www.cryptopolitan.com/venezuela-extends-sunacrip-reorganization/",
    "description": "Venezuela’s government has extended the reorganization period of its crypto oversight body, Sunacrip, by an additional six months. Established in 2018, Sunacrip was one of the pioneering initiatives in Latin America aimed at inspecting all crypto-related commercial activities within the nation. It was instrumental in the creation, emission, transfer, commercialization, and exchange of all crypto ... <a title=\"Venezuela extends Sunacrip reorganization period\" class=\"read-more\" href=\"https://www.cryptopolitan.com/venezuela-extends-sunacrip-reorganization/\" aria-label=\"More on Venezuela extends Sunacrip reorganization period\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-26T20:00:45.000Z",
    "title": "Upcoming Optimism Unlock Threatens To Drag OP Below $1",
    "url": "https://www.newsbtc.com/analysis/optimism/optimism-op-below-1/",
    "description": "The Optimism native token OP is now in the line of fire with millions of tokens set to be released into circulation. This threatens the altcoin’s price which is already on a downward spiral after carrying out its 3rd airdrop. Optimism Set To Unlock 24 Million Tokens In the latest iteration of its token unlock events, the Optimism network is looking at over 24 million tokens being unlocked and brought into circulation. On-chain token tracking website Token Unlocks reports that the 24.16 million token is worth approximately $30.7 million at current prices. Related Reading: Market Analysts Outline When The First Spot Bitcoin ETF Will Be Approved The token unlock event will take place on September 30, which is less than four days from the time of writing. This will see the equivalent of 3.03% of the total OP supply being released into circulation at once. 24.16 million tokens set to be unlocked &#124; Source: Token Unlocks This is coming just one month after the network locked an equivalent amount on August 30. Just like the August unlock, the 24.16 million tokens are allocated to two groups. 12.75 million tokens worth $16.19 million are going to Core Contributors and 11.41 million tokens worth $14.49 million will go to Investors. The Optimism unlock event is the largest of the over $54 million in token unlocks expected to happen over the next seven days. Other notable unlocks include SUI unlocking 4.9% of supply worth $16.92 million and Yield Guild Games (YGG) unlocking 6.7% of supply worth $2.55 million. Gauging The Impact on OP Price A good way to figure out how the OP price might react is to look at historical performance during similar events. In the case of the OP price, there is no need to look too far back as the last token unlock event happened only a month ago. On August 30, Optimism unlocked an identical number of tokens and the price reacted negatively to this new supply. OP initially held tight around the $1.5 mark but once the unlock was completed, the price of the token nosedived, dropping from $1.5 to $1.3 in the span of two days. Related Reading: $200 Million In Crypto Lost As Mixin Network Comes Under Attack This shows that token unlocks, especially with the size of the upcoming Optimism unlock, are inherently bearish for price. If the historical pattern holds, then the OP price could easily succumb to the bears and threaten the $1 mark. At the very least, the impact of this new supply could lead to a 10% decline, which would put the OP price just above $1.1. Even now, OP is already feeling the impact of the incoming bearish sentiment. Over the last week, the price has plummeted more than 10%, bringing it below the $1.3 resistance. OP price threatened with new unlock &#124; Source: OPUSDT on Tradingview.com Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-26T19:48:55.000Z",
    "title": "TRON (TRX) CEO Justin Sun Rises to the Challenge: SAFU Fund Launched After HTX Global Hack",
    "url": "https://www.crypto-news-flash.com/tron-trx-ceo-justin-sun-rises-to-the-challenge-safu-fund-launched-after-htx-global-hack/?utm_source=rss&utm_medium=rss&utm_campaign=tron-trx-ceo-justin-sun-rises-to-the-challenge-safu-fund-launched-after-htx-global-hack",
    "description": "<img width=\"1200\" height=\"628\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/12/TRON-Justin-Sun.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"SAFU Fund\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/12/TRON-Justin-Sun.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/TRON-Justin-Sun-300x157.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/TRON-Justin-Sun-1024x536.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/TRON-Justin-Sun-768x402.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/TRON-Justin-Sun-351x185.jpg 351w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/TRON-Justin-Sun-24x13.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/TRON-Justin-Sun-36x19.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/12/TRON-Justin-Sun-48x25.jpg 48w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />HTX Global faces an $8 million hack, offers rewards, and sets up SAFU funds for future security. Justin Sun responds swiftly, assures user asset security, and engages Binance for investigation. In response to a 5,000 ETH, valued at $8 million Ethereum (ETH) breach on HTX Global (previously known as Huobi), the cryptocurrency exchange has introduced [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-26T20:00:21.000Z",
    "title": "Pantera Capital Says One Ethereum Layer-2 ‘High on the List’ of New Crypto Opportunities",
    "url": "https://dailyhodl.com/2023/09/26/pantera-capital-says-one-ethereum-layer-2-high-on-the-list-of-new-crypto-opportunities/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/pantera-layer-high-list.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/pantera-layer-high-list.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/pantera-layer-high-list.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/pantera-layer-high-list.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/pantera-layer-high-list.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/pantera-layer-high-list.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/pantera-layer-high-list.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets-focused investment firm Pantera Capital thinks one Ethereum (ETH) layer-2 scaling solution should sit &#8220;high on the list&#8221; for fundamentals-focused investors looking for projects that have made recent traction in the crypto sector. Cosmo Jiang, a portfolio manager at Pantera, notes in a new analysis that Arbitrum (ARB) has taken &#8220;meaningful market share&#8221; in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/26/pantera-capital-says-one-ethereum-layer-2-high-on-the-list-of-new-crypto-opportunities/\">Pantera Capital Says One Ethereum Layer-2 ‘High on the List’ of New Crypto Opportunities</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-26T19:55:15.000Z",
    "title": "Bitcoin Censorship? BlackRock and Big Institutions Could Take Over BTC Mining Ecosystem, Warns Bloomberg Analyst",
    "url": "https://dailyhodl.com/2023/09/26/bitcoin-censorship-blackrock-and-big-institutions-could-take-over-btc-mining-ecosystem-warns-bloomberg-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/10/texas-senator-bitcoin-mining.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/10/texas-senator-bitcoin-mining.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/10/texas-senator-bitcoin-mining.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/10/texas-senator-bitcoin-mining.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/10/texas-senator-bitcoin-mining.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/10/texas-senator-bitcoin-mining.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/10/texas-senator-bitcoin-mining.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Bloomberg crypto market analyst Jamie Coutts says that Bitcoin (BTC) may be at risk of being taken over by the powerhouses of the legacy financial system. Addressing his followers on social media platform X, Coutts shares data showing that BlackRock, the world&#8217;s largest asset manager, began getting proxy exposure to Bitcoin in 2020 via shares [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/26/bitcoin-censorship-blackrock-and-big-institutions-could-take-over-btc-mining-ecosystem-warns-bloomberg-analyst/\">Bitcoin Censorship? BlackRock and Big Institutions Could Take Over BTC Mining Ecosystem, Warns Bloomberg Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]