[
  {
    "source": "CoinDesk",
    "date": "2023-06-02T00:28:57.000Z",
    "title": "U.S. Commodities Agency May Change Risk Rules to Consider Crypto",
    "url": "https://www.coindesk.com/policy/2023/06/02/us-commodities-agency-may-change-risk-rules-to-consider-crypto/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Commodity Futures Trading Commission (CFTC) has proposed an overhaul of its rules for risk management, and Commission Christy Goldsmith Romero said the changes should insist firms prepare themselves for crypto volatility and the risks from holding customers’ digital assets."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-02T00:26:25.000Z",
    "title": "Uniswap’s proposal to collect fees from LPs stumbles during first poll",
    "url": "https://cryptoslate.com/uniswaps-proposal-to-collect-fees-from-lps-stumbles-during-first-poll/",
    "description": "<p>A poll of Uniswap&#8217;s governance community on June 1 found divided support for a feature that could eventually draw fees from liquidity providers. Poll finds mixed support On May 10, GFX Labs published a proposal titled &#8220;Making Protocol Fees Operational,&#8221; which suggests collecting fees from liquidity providers for a project treasury. On June 1, a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/uniswaps-proposal-to-collect-fees-from-lps-stumbles-during-first-poll/\">Uniswap&#8217;s proposal to collect fees from LPs stumbles during first poll</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-02T00:19:00.000Z",
    "title": "Ethereum ($ETH) Supply on Exchanges Drops to Record Low",
    "url": "https://www.cryptoglobe.com/latest/2023/06/ethereum-eth-supply-on-exchanges-drops-to-record-low/",
    "description": "Ethereum, the world’s second-largest cryptocurrency by market capitalization, has seen a significant shift in its dynamics. Ethereum’s supply on exchanges is at an all-time low of 9.9%, a trend indicative of the increasing interest and trust in self-custody within the crypto community. That’s according to data from popular cryptocurrency analytics firm Santiment. The shift away […]\n"
  }
]