[
  {
    "source": "CoinDesk",
    "date": "2023-06-12T12:40:39.000Z",
    "title": "Blockchain Staking Provider Chorus One Expands to Peer-to-Peer Network Urbit ",
    "url": "https://www.coindesk.com/tech/2023/06/12/blockchain-staking-provider-chorus-one-expands-to-peer-to-peer-network-urbit/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Chorus One's bet on Urbit's future growth is described by executives as a natural extension of the company's staking services on blockchains including Ethereum, Solana, Cosmos and Polkadot."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-12T13:00:00.000Z",
    "title": "IoTeX releases W3bstream’s Devnet, world’s first infra for DePIN projects",
    "url": "https://cryptodaily.co.uk/2023/06/iotex-releases-w3bstreams-devnet-worlds-first-infra-for-depin-projects",
    "description": "<p>IoTeX has made waves with the official release of W3bstream Devnet, positioning itself as the first-ever provider of comprehensive tools and infrastructure for building transformative Decentralized Physical Infrastructure Networks (DePIN) dApps.</p>\n<p>This groundbreaking launch is set to speed up the DePIN sector&rsquo;s development process, slashing costs by 10x and accelerating go-to-market time for developers from two years to about two months.&nbsp;</p>\n<p>W3bstream, IoTeX's flagship technology, empowers developers to quickly and easily build dynamic dApps for mobility networks, energy systems, sensor networks, AI computing frameworks, and more.&nbsp;</p>\n<p>With the advent of Devnet, developers gain unprecedented access to cutting-edge features, enabling seamless connectivity between billions of smart devices and smart contracts, unlocking a world of limitless innovation and societal impact.</p>\n\n<p>\"At IoTeX, we are trailblazers in offering developers out-of-the-box services to create DePIN dApps that reward users for their actions or incentivize specific behaviors,\" explains Raullen Chai, CEO and Founder of IoTeX.</p>\n<p>\"The release of W3bstream Devnet marks a turning point for the DePIN sector, projected to become the most significant trend in the Web3 industry, akin to the rise of DeFi in recent years,\" he added.</p>\n\n<p>DePIN has emerged as a driving force propelling the next wave of Web3 adoption. By addressing the limitations of centralized smart device connectivity and applications, such as security, reliability, privacy, and data ownership, the DePIN market will grow to a staggering $3 trillion by 2028.&nbsp;</p>\n<p>IoTeX's W3bstream aims to reshape the smart device landscape, ushering in a new era of enhanced user experiences and improved quality of life.</p>\nThe Power of W3bstream Devnet\n<p>Devnet is the first public implementation of W3bstream's chain and device-agnostic architecture and represents a significant milestone in IoTeX's quest to simplify DePIN network development and data-driven dApp creation.&nbsp;</p>\n<p>Devnet provides developers with a chain-agnostic environment, facilitating the seamless crowdsourcing of real-world data from smart devices.&nbsp;</p>\n<p>These verifiable \"proofs of real-world activity\" trigger smart contracts, enabling the direct delivery of digital assets such as cryptocurrencies, stablecoins, Soulbound Tokens (SBTs), and NFTs to users.</p>\n<p>Central to Devnet is the powerful W3bstream Studio, an intuitive control center equipped with an array of developer-centric features.&nbsp;</p>\n<p>With the Studio's streamlined interface, developers can effortlessly orchestrate every aspect of their DePIN projects, from data reception to application logic and seamless blockchain interaction.&nbsp;</p>\n<p>Devnet also offers essential components such as mobile Software Development Kits (SDKs) and Web Assembly (WASM), providing developers unparalleled flexibility and convenience in creating their decentralized applications.</p>\n<p>IoTeX is committed to continuously expanding W3bstream's capabilities, with future Devnet releases set to introduce a range of out-of-the-box DePIN solutions.&nbsp;</p>\n<p>These include trusted token metrics for visualizing and analyzing device data on the blockchain, token proofs to validate off-chain data and facilitate token incentives, trusted location services for proof of humanity and presence, and various geo-based use cases.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\nIoTeX's Devnet Launch Partners\n<p>Numerous pioneering DePIN projects are already poised to harness W3bstream's potential. Drife, a disruptive force in the global ridesharing market, is notable among these, which has already amassed over 30,000 drivers, 100,000 registered users, and completed 250,000 rides.&nbsp;</p>\n<p>By utilizing W3bstream, Drife integrates verifiable mobile geo-location into its tech stack, ensuring secure tracking of routes driven and providing a trusted environment for drivers and riders alike.</p>\n<p>React Network, another prominent partner, consists of thousands of connected batteries deployed across homes, businesses, and multi-family living spaces. This innovative energy network supports the power grid during times of high demand and utilizes W3bstream to effectively manage and visualize the diverse footprint of smart devices contributing to its network. The platform efficiently processes the high volume of real-time data generated by these devices, enabling a more optimized and sustainable energy grid system.</p>\n<p>These partnerships exemplify the real-world applications of W3bstream and highlight the transformative potential of Decentralized Physical Infrastructure Networks. By leveraging the power of blockchain and smart contracts, IoTeX and its partners are revolutionizing industries and empowering users with greater control over their data and participation in the machine economy.</p>\n<p>As the world's first provider of DePIN infrastructure and tools, IoTeX is leading the way in unlocking the full potential of decentralized IoT. With the launch of W3bstream's Devnet, developers now have access to a comprehensive framework that simplifies the development process, reduces costs, and accelerates time-to-market for data-driven dApps. The possibilities for innovation and social impact are boundless as W3bstream connects billions of intelligent devices to smart contracts, creating a more inclusive and decentralized future.</p>\nSparking a new wave of adoption\n<p>With Devnet, IoTeX is spearheading the DePIN revolution and paving the way for the next wave of Web3 adoption. By addressing the limitations of centralized IoT solutions and providing developers with the necessary tools and infrastructure, IoTeX is driving the transition toward a more secure, reliable, and privacy-preserving ecosystem.</p>\n<p>The launch of W3bstream's Devnet marks a significant milestone in developing Decentralized Physical Infrastructure Networks. IoTeX's commitment to democratizing IoT and empowering developers is revolutionizing the machine economy and opening up endless possibilities for innovation.&nbsp;</p>\n<p>With its unique features, chain-agnostic environment, and strong partnerships, W3bstream will shape the future of IoT and drive the widespread adoption of Web3 technologies.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-12T12:45:00.000Z",
    "title": "Minting and Selling NFTs for Fun and Profit",
    "url": "https://cryptodaily.co.uk/2023/06/minting-and-selling-nfts-for-fun-and-profit",
    "description": "<p>The Non-Fungible Token (NFT) market in 2023 shows strong signs of recovery after the uncertainty and volatility of 2022.</p>\nWhat are NFTs?\n<p>Non-fungible tokens (NFTs) are digital assets on a blockchain representing anything from artwork to music to in-game items.</p>\n<p>The NFT market landscape has been transformed by the emergence of new projects, platforms, and technologies and changing trends in the cryptocurrency space.</p>\nHow to Mint NFTs\n<p>To mint an NFT, you must create a digital asset and then \"mint\" it or turn it into an NFT.</p>\nHere are the steps on how to mint an NFT:\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\">Choose a blockchain. Many blockchains support NFTs, such as Ethereum, Solana, and Flow. Each blockchain has its advantages and disadvantages, so you must choose one that is right for you.</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">Create a digital asset. This can be anything from artwork to a song to a video. The digital asset must be unique and cannot be easily copied. For example, you can create unique DUCKIES NFTs in an educational NFT minting &amp; melding game to turn common NFTs into legendary and mythic ones.</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">Choose an NFT marketplace. There are many different NFT marketplaces where you can mint and sell your NFTs. Some popular marketplaces include OpenSea, Rarible, and SuperRare.</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">Connect your wallet. To mint and sell NFTs, you must connect a crypto wallet to the NFT marketplace. Some popular crypto wallets include MetaMask, Coinbase Wallet, and Trust Wallet.</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">Mint your NFT. Once you have connected your wallet to the NFT marketplace, you can mint your NFT. The minting process will vary depending on the marketplace but typically involves paying a gas fee.</li>\n</ul>\nWhere to Sell NFTs\n<p>Once you have minted your NFT, you can sell it on an NFT marketplace. There are many different NFT marketplaces, so you must choose one that is right for you. Some factors to consider include the marketplace's fees, the number of users, and the type of NFTs typically sold.</p>\nHere are some of the most popular NFT marketplaces:\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\">OpenSea: OpenSea is the largest NFT marketplace, with over 2 million users. It supports various NFTs, including artwork, music, and in-game items. You can host entire NFT collections. Here&rsquo;s an example of DUCKIES NFTs hosted for sale at OpenSea.</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">Rarible: Rarible is a popular NFT marketplace that allows users to create and sell their NFTs. It also supports a wide variety of NFTs.</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">SuperRare: SuperRare is a high-end NFT marketplace that focuses on high-quality artwork. It has a smaller user base than OpenSea or Rarible but also has higher prices.</li>\n</ul>\n<p>Tips for Selling NFTs</p>\nHere are some tips for selling NFTs:\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\">Set a fair price. When setting a price for your NFT, it is important to consider the value of similar NFTs sold. You do not want to price your NFT too high, or it will not sell. For example, the Mythic DUCKIES are sold for over $1,000 at OpenSea.</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">Promote your NFT. Once you have listed your NFT for sale, you must promote it to attract buyers. You can do this by sharing it on social media, listing it on other NFT marketplaces, or joining NFT communities.</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\">Be patient. It may take some time to sell your NFT. Do not get discouraged if it does not sell immediately. Just keep promoting it, and eventually, you will find a buyer.</li>\n</ul>\nConclusion\n<p>Minting and selling NFTs can be a great way to showcase your creativity and make money out of it. However, it is important to research and understand the risks involved before you start.</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-12T12:42:11.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: Ethereum Nears $1,700 Breakout, as BTC Braces for Fed Rate Decision",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-ethereum-nears-1700-breakout-as-btc-braces-for-fed-rate-decision/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1051968554-3-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: Ethereum Nears $1,700 Breakout, as BTC Braces for Fed Rate Decision\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1051968554-3-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1051968554-3-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1051968554-3-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1051968554-3-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1051968554-3-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1051968554-3-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1051968554-3.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin started the week trading marginally below the $26,000 level, ahead of a key week of economic events. The headline being the upcoming U.S. Federal Reserve meeting. Ethereum remains below $1,800 ahead of this week&#x2019;s rate decision. Bitcoin Bitcoin (BTC) continued to trade around the $26,000 level on Monday, as markets remain volatile following recent [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-12T13:00:16.000Z",
    "title": "China Releases White Paper on Web3, Tradecurve (TCRV) Sets Sights on Binance (BNB): Bullish Sign For Crypto?",
    "url": "https://nulltx.com/china-releases-white-paper-on-web3-tradecurve-tcrv-sets-sights-on-binance-bnb-bullish-sign-for-crypto/",
    "description": "As China embraces the potential of decentralized technologies, Tradecurve (TCRV), a trading exchange currently in its presale phase, is setting its sights on overtaking Binance (BNB) as the leading crypto platform. Let&#8217;s jump into the details of this exciting development and what it means for the future of cryptocurrency. &#62;&#62;BUY TCRV TOKENS NOW&#60;&#60; China Releases [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-12T13:00:00.000Z",
    "title": "InQubeta, dogecoin, and polygon are cryptocurrencies for investors to consider",
    "url": "https://crypto.news/inqubeta-dogecoin-and-polygon-named-top-cryptocurrencies-for-investors-to-consider/",
    "description": "InQubeta, dogecoin, and polygon are cryptocurrencies that investors should explore, analysts say. QUBE presale ongoing, over $300,000 raised"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-12T12:49:54.000Z",
    "title": "The Block founder Mike Dudas criticizes SEC and EOS",
    "url": "https://crypto.news/the-block-founder-mike-dudas-criticizes-sec-and-eos/",
    "description": "Mike Dudas, the founder of crypto outlet The Block and co-founder of LinksDAO, expressed dissatisfaction with the SEC’s handling of the EOS case in 2019. He thinks the regulator has failed to checkmate the real bad actors and has chosen&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T12:50:51.000Z",
    "title": "Unveiling ApeMax one of the Fastest Growing Cryptocurrencies and Meme Coin Presales. Will ApeMax disrupt the Shiba Inu and Dogecoin dominance?",
    "url": "https://www.crypto-news-flash.com/unveiling-apemax-one-of-the-fastest-growing-cryptocurrencies-and-meme-coin-presales-will-apemax-disrupt-the-shiba-inu-and-dogecoin-dominance/?utm_source=rss&utm_medium=rss&utm_campaign=unveiling-apemax-one-of-the-fastest-growing-cryptocurrencies-and-meme-coin-presales-will-apemax-disrupt-the-shiba-inu-and-dogecoin-dominance",
    "description": "In the world of cryptocurrencies, new and exciting opportunities emerge every day, capturing the attention of onlookers and enthusiasts alike. One such phenomenon is the rise of meme coins, which have taken the crypto market by storm. Among these meme coins, ApeMax has established itself as one of the fastest-growing new cryptocurrencies, alongside popular names [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-12T12:52:00.000Z",
    "title": "SEC’s Actions Cause Crypto Market to Crash over the Weekend",
    "url": "https://coinedition.com/secs-actions-cause-crypto-market-to-crash-over-the-weekend/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Crypto_Resumes_Drop_After_SEC_Crackdown_Led_to_Weekend_Selloff-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Crypto_Resumes_Drop_After_SEC_Crackdown_Led_to_Weekend_Selloff-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Crypto_Resumes_Drop_After_SEC_Crackdown_Led_to_Weekend_Selloff-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Crypto_Resumes_Drop_After_SEC_Crackdown_Led_to_Weekend_Selloff.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The ongoing impact of the regulatory measures initiated by the U.S. Securities and Exchange Commission (SEC) last week is continuing to influence the crypto market situation, reported Bloomberg. The crypto sector is currently witnessing an extensive crackdown by the U.S. SEC, causing shockwaves throughout the industry. The regulatory agency has taken legal action by filing [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/secs-actions-cause-crypto-market-to-crash-over-the-weekend/\">SEC&#8217;s Actions Cause Crypto Market to Crash over the Weekend</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-12T13:04:41.000Z",
    "title": "Stanley Druckenmiller Says US Banking Failures Are Tip of the Iceberg, Warns ‘More Shoes To Drop’",
    "url": "https://dailyhodl.com/2023/06/12/stanley-druckenmiller-says-us-banking-failures-are-tip-of-the-iceberg-warns-more-shoes-to-drop/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/bank-failures-more.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/bank-failures-more.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/bank-failures-more.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/bank-failures-more.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/bank-failures-more.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/bank-failures-more.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/bank-failures-more.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Legendary investor Stanley Druckenmiller just issued a warning on the state of the US economy. In a new interview at the Bloomberg Invest New York conference, Druckenmiller, A.K.A &#8220;The Druck&#8221; says that the economy is still trying to adjust to a more restrictive climate after more than a decade of low interest rates and essentially [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/12/stanley-druckenmiller-says-us-banking-failures-are-tip-of-the-iceberg-warns-more-shoes-to-drop/\">Stanley Druckenmiller Says US Banking Failures Are Tip of the Iceberg, Warns &#8216;More Shoes To Drop&#8217;</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]