[
  {
    "source": "CryptoSlate",
    "date": "2023-06-28T22:53:14.000Z",
    "title": "Bitcoin difficulty experiences 2% dip amid hash rate decrease",
    "url": "https://cryptoslate.com/insights/bitcoin-difficulty-experiences-2-dip-amid-hash-rate-decrease/",
    "description": "<p>Quick Take The Bitcoin network has experienced a 2% drop in its difficulty adjustment, marking the fourth such decrease in 2023. With approximately a quarter of all adjustments this year showing a negative trend, the hash rate acceleration is evident. Currently, the hash rate stands at around 364 trillion (Th/s). Despite the recent decrease, the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-difficulty-experiences-2-dip-amid-hash-rate-decrease/\">Bitcoin difficulty experiences 2% dip amid hash rate decrease</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-28T22:59:00.000Z",
    "title": "Mysterious Dogecoin Wallet Wakes Up After 9.5 Year Slumber, 30,000% Returns",
    "url": "https://www.cryptoglobe.com/latest/2023/06/mysterious-dogecoin-wallet-wakes-up-after-9-5-year-slumber-30000-returns/",
    "description": "A long-dormant Dogecoin ($DOGE) wallet that had been inactive for nearly a decade has recently resurfaced with a treasure trove of the meme-inspired cryptocurrency that is now valued at $1.3 million after seeing returns of 30,000%. According to data from the Dogecoin blockchain the wallet, first created 9.5 years ago, remained untouched since then in […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-28T22:39:35.000Z",
    "title": "Is ChatGPT More Opportunity Than Threat for Tax Leaders?",
    "url": "https://www.cryptopolitan.com/chatgpt-opportunity-than-threat-tax-leaders/",
    "description": "Artificial Intelligence (AI) has emerged as a transformative force in various industries, revolutionizing processes and unlocking new possibilities. Taxation, traditionally viewed as a complex and time-consuming field, is no exception. With the advent of advanced AI models like ChatGPT, tax leaders now have an unprecedented opportunity to streamline operations, enhance compliance, and drive strategic decision-making. ... <a title=\"Is ChatGPT More Opportunity Than Threat for Tax Leaders?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chatgpt-opportunity-than-threat-tax-leaders/\" aria-label=\"More on Is ChatGPT More Opportunity Than Threat for Tax Leaders?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-28T23:00:48.000Z",
    "title": "Sui Foundation Refutes Claims Of Dumping Locked Staking Rewards On Binance",
    "url": "https://www.newsbtc.com/altcoin/sui-foundation-refutes-claims-of-dumping-locked-staking-rewards-on-binance/",
    "description": "The team behind the Sui network and its native SUI token has taken to Twitter to deny allegations of selling locked staking rewards on Binance. Word on the street is that the team moved a huge amount of locked staking rewards and dumped them on Binance to cash in. Sui Foundation Denies Selling Locked Staking Rewards Pump and dump schemes have become very common in the crypto world. According to a report by Chainalysis, 24% of tokens launched in 2022 that were analyzed saw a price decline in the first week indicative of possible pump-and-dump activity.  Related Reading: FTX Puts Sale Of $500 Million Stake In AI Firm Anthropic On Hold According to the foundation, the Sui Foundation has not sold staking rewards or any other tokens from locked and non-circulating staked SUI on Binance or any other exchange. &#8220;All insider token allocations remain subject to and compliant with their lock-ups and other restrictions on transfer,&#8221; said the statement. The Origin Of The Claims A rumor started circulating on Twitter on Thursday that the Sui Foundation was unlocking and dumping locked staking rewards on Binance. According to a Twitter thread by @DefiSquared, a popular crypto trader and commentator, &#8220;locked&#8221; and &#8220;non-circulating&#8221; staked SUI were manipulated by the foundation. The party behind the account claims that the SUI foundation has nearly 3 billion non-circulating and locked SUI staked, which is six times more than the entire circulating supply. DefiSquared also goes on to provide on-chain data showing how millions of SUI rewards were transferred. These tokens were split many times, with most of them ending on Binance. An example was a transfer of 2,500,000 SUI rewards from 0x341f to 0x209f on May 31st. However, The Sui Foundation has since referred to the transaction as a payment subject to a contractual lockup. The specific transaction referenced was a payment subject to a contractual lockup.https://t.co/ViYxQoJMos — Sui Foundation (@SuiFoundation) June 27, 2023 Sui adopts a proof-of-stake consensus mechanism for its blockchain. Its mainnet went officially live on May 3, allowing users to stake their Sui tokens to participate in its proof-of-stake mechanism in exchange for more SUI. Price trending at $0.66 &#124; Source: SUIUSDT on TradingView.com Token Release Schedule The Sui Foundation is yet to publish a token release schedule, more than two months after going live on its mainnet. According to DefiSquared, the supply is actually increasing every day, although the data CoinMarketCap receives shows emissions just once a month. Related Reading: Bitcoin Rally Stalls As Short-Term Holder Exchange Inflows Intensify This comes down to a rough 20% inflation for non-foundation SUI token holders. To address concerns and speculations, the Foundation will publish an official projection of the SUI token vesting and distribution schedule very soon. SUI token is currently down more than 14% in a 7-day timeframe. A subsequent release of 61 million tokens is slated to take place on June 3rd. Featured image from Yahoo Finance, chart from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-28T22:57:51.000Z",
    "title": "Bitcoin Reaches Longest Stretch Ever Without A Bull Run",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-reaches-longest-stretch-ever-without-a-bull-run/",
    "description": "Bitcoin is known for its explosive price movements — both bullish and bearish. However, Relative Strength Index data suggests the top cryptocurrency by market cap has gone the longest stretch ever without a bullish impulse. Just how long has it been since the last time BTCUSD was fully bullish? And how does this data compare to past bear markets? Reliving The Thrill Of Past Bitcoin Bull Markets Bitcoin price is retesting $30,000 per coin and bulls are hoping it holds. If it does, yet another higher high could provide further confirmation to onlookers that an uptrend is forming. By definition, an uptrend is a series of higher highs and higher lows — precisely the pattern in BTCUSD since the November 2022 low. But despite this pattern, the crypto market has yet to see a true bull run. Related Reading: Bitcoin Starts To Bite Back Says Reptilian Technical Signal The last major bull market began in late 2020. Prior to that, Bitcoin had a short-lived, 300% rally in 2019. Two years before that in 2017, Bitcoin spent the entire year in a bullish market. This time around, a true bullish impulse is nowhere in sight, and barely in the rear view mirror at this point. It’s been so long since the last bull run, it has now reached the longest stretch ever according to the Relative Strength Index. It’s been a long time since bulls had a turn &#124; BTCUSD on TradingView.com Why The Stampede Is Waiting For An Overbought RSI The Relative Strength Index (RSI) is a momentum measuring tool, which tells an investor if the asset is overbought or oversold. Unlike other assets, the speculative nature of Bitcoin and cryptocurrencies causes them to remain overbought for longer than normal. When this occurs, FOMO fuels a fast and furious price movement higher. Using overbought RSI signals on the weekly BTCUSD chart as a gauge of impulsive behavior, the crypto market has been without a bull market for 973 days. Related Reading: Bitcoin Price Breaks Above $30,000: Is The Bull Run Back On? When compared to past phases of bearishness and boredom, only the 2014 and 2015 bear market comes close. What was once considered the worst bear market on record lasted 959 days before becoming fully overbought on the weekly timeframe. The bull run that followed made Bitcoin a household name and put crypto on the map. Could such a lengthy period of pain and suffering ultimately lead to another epic price increase? For that to happen, BTCUSD must first reach overbought levels on the one week RSI. But considering how long it has been, time is likely ticking away for bears. We are currently in the longest stretch historically without a bullish #Bitcoin impulse, and yet so many still don&#8217;t think there is any chance of another one coming just yet Impulses appear when the weekly RSI reaches overbought pic.twitter.com/r10PjtfBFM — Tony &#8220;The Bull&#8221; (@tonythebullBTC) June 28, 2023 Tony is the author of the CoinChartist (VIP) newsletter. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  }
]