[
  {
    "source": "Bitcoin.com",
    "date": "2023-06-30T03:00:42.000Z",
    "title": "Binance to Lose Euro Transfers as Paysafe Drops Support",
    "url": "https://news.bitcoin.com/binance-to-lose-euro-transfers-as-paysafe-drops-support/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1130454713-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Binance to Lose Euro Transfers as Paysafe Drops Support\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1130454713-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1130454713-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1130454713-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1130454713-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1130454713-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1130454713-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1130454713.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Paysafe will discontinue support for bank transfers of euros to and from Binance, the payments provider announced. The news comes when the world’s largest cryptocurrency exchange finds itself under pressure from regulators and banking partners in Europe and elsewhere. Paysafe to Stop Euro Deposits and Withdrawals for Binance Crypto exchange Binance, the global leader in [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-30T03:01:28.000Z",
    "title": "Bitcoin Price Key Indicators Suggest A Strengthening Case For Rally To $32K",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-rally-to-32k/",
    "description": "Bitcoin price is still struggling to clear the $31,000 resistance. BTC is showing strength and might soon rally toward the $32,000 resistance. Bitcoin is trading in a range below the $31,000 resistance zone. The price is trading above $30,400 and the 100 hourly Simple moving average. There was a break above a key declining channel with resistance near $30,210 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could gain bullish momentum if it clears the $30,750 resistance zone. Bitcoin Price Aims Higher Bitcoin price corrected lower below the $30,500 support zone. BTC even spiked below the $30,000 level but downsides were limited. A low is formed near $29,834 and the price is again rising. There was a move above the $30,000 and $30,200 resistance levels. The price climbed above the 50% Fib retracement level of the downward move from the $31,008 swing high to the $29,834 low. Besides, there was a break above a key declining channel with resistance near $30,210 on the hourly chart of the BTC/USD pair. Bitcoin price is now trading above $30,400 and the 100 hourly Simple moving average. It is also trading above the $30,550 pivot level. Immediate resistance is near the $30,750 level. It is close to the 76.4% Fib retracement level of the downward move from the $31,008 swing high to the $29,834 low. Source: BTCUSD on TradingView.com The first major resistance is near the $31,000 level, above which the price gain bullish momentum. The next major resistance is near the $31,450 level. An upside break above the $31,450 resistance might send BTC toward $32,000. Any more gains could open the doors for a move toward the $32,500 resistance zone. Another Dip in BTC? If Bitcoin’s price fails to clear the $30,750 resistance, it could start another decline. Immediate support on the downside is near the $30,420 level and the 100 hourly Simple moving average. The next major support is near the $30,000 level, below which there could be a drop toward the $29,550 support. Any more losses might send the price toward the $29,000 zone in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is above the 50 level. Major Support Levels – $30,420, followed by $30,000. Major Resistance Levels – $30,750, $31,000, and $31,450."
  }
]