[
  {
    "source": "Cointelegraph",
    "date": "2023-09-07T20:42:53.000Z",
    "title": "Persistent macro headwinds could delay Bitcoin bull market — ARK Invest",
    "url": "https://cointelegraph.com/news/persistent-macro-headwinds-could-delay-bitcoin-bull-market-ark-invest",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/69a63ad1-cb2a-441f-9d93-34f1e37eb5a8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Several macroeconomic indicators suggest that bearish headwinds could strengthen during the remainder of 2023 and possibly negatively impact the crypto market.</p>\n                    <p><p>2023 has been a whipsaw year for investor sentiment and even though equities markets have defied expectations, a recent <a href=\"https://ark-invest.com/crypto-reports/the-bitcoin-monthly-august23-report/?utm_campaign=The%20Bitcoin%20Monthly\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from ARK Invest highlights reasons why the remainder of 2023 could present several economic challenges. </p><p>ARK manages $13.9 billion in assets, and its CEO, Cathie Wood, is a strong advocate for cryptocurrencies. In partnership with the European asset manager 21Shares, ARK Investment first applied for a Bitcoin exchange-traded fund (ETF) in June 2021. Their most recent request for a spot BTC ETF, which is currently pending review by the U.S. Securities and Exchange Commission (SEC), was initially filed in May 2023.</p><h2>Long-term bullish, short term bearish?</h2><p>Despite ARK’s bullish view on Bitcoin which is supported by their research on how the <a href=\"https://cointelegraph.com/news/cathie-wood-bullish-on-bitcoin-and-ai-convergence\">fusion of Bitcoin and Artificial Intelligence</a> could transform corporate operations by positively impacting productivity and costs, the investment firm doesn't foresee a straightforward path for a Bitcoin bull run given the current macroeconomic conditions.</p><p>In the newsletter, ARK cites several reasons for their less than optimistic scenario for cryptocurrencies, including interest rates, gross domestic product (GDP) estimates, unemployment and inflation. One point is that the U.S. Federal Reserve (Fed) is implementing a restrictive monetary policy for the first time since 2009, as indicated by the \"Natural Rate of Interest.\"</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/503a83f1-ca3b-4692-982c-4257c8d1ccd8.png\"  /><figcaption style=\"text-align: center;\"><em>Federal Reserve “Natural Rate of Interest”. Souce: ARK Investment</em></figcaption></figure><p>The \"Natural Rate of Interest\" is a theoretical rate at which the economy neither expands or contracts. ARK explains that whenever this indicator exceeds the \"Real Federal Funds Policy Rate,\" it puts pressure on lending and borrowing rates.</p><p>ARK anticipates that inflation will continue to slow down, which would drive up the \"Real Federal Funds Policy Rate\" and increase the gap above the \"Natural Rate of Interest.\" Essentially, the report holds a bearish macroeconomic view due to this indicator.</p><p>The analysts also focused on the divergence between real GDP (production) and GDI (income). According to the report, GDP and GDI should closely align, as income earned should equal the value of goods and services produced.</p><p>However, the most recent data shows that Real GDP is approximately 3% higher than Real GDI, indicating that downward revisions in production data should be expected.</p><p>Another focus point was U.S. employment data and the analysts note that the government has consistently revised these figures downward for six consecutive months.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/867b6671-ba48-4c6a-a469-663e8b8cbd9e.png\"  /><figcaption style=\"text-align: center;\"><em>U.S. nonfarm payroll revisions. Souce: ARK Investment</em></figcaption></figure><p>The chart above highlights a labor market that appears weaker than initial reports indicated. The fact that the last time six consecutive months of downward revisions occurred was in 2007 just before the onset of the Great Financial Crisis is also notable.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-short-term-holders-capitulate-data-highlights-generational-buying-opportunity\"><strong><em>Bitcoin short-term holders capitulate as data highlights potential generational buying opportunity</em></strong></a></p><h2>“Stagflation” is usually bearish for risk-on assets</h2><p>Another bearish development to keep an eye on is “stagflation.” The writers highlight the reversal of the year-long trend of price discounts driven by increased consumer spending. Referencing the Johnson Redbook Index, which encompasses over 80% of the \"official\" retail sales data compiled by the U.S. Department of Commerce, it becomes clear that total same-store sales rebounded in August for the first time in 12 months, suggesting that inflation may be exerting upward pressure.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/ab48e525-3af1-4d65-9c1c-ac81a8839c8f.png\"  /><figcaption style=\"text-align: center;\"><em>Johnson Redbook retail sales index. Source: ARK Investment</em></figcaption></figure><p>The metrics suggest that ongoing macroeconomic uncertainty could continue in the coming months. However, it does not provide a clear answer regarding how cryptocurrency investors might react if this trend confirms lower economic growth and higher inflation – a scenario typically considered highly unfavorable for risk-on assets.</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-07T21:00:01.000Z",
    "title": "Coinbase, Circle, Aave, and more partner to launch Tokenized Asset Coalition",
    "url": "https://cryptoslate.com/coinbase-circle-aave-and-more-partner-to-launch-tokenized-asset-coalition/",
    "description": "<p>Several cryptocurrency industry members have joined forces to launch a new advocacy group, according to a press release on Sept. 7. The new group, called the Tokenized Asset Coalition, aims to have real-world assets represented and circulating on blockchain networks. To that end, the coalition will advocate for the adoption of public blockchains, asset tokenization, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/coinbase-circle-aave-and-more-partner-to-launch-tokenized-asset-coalition/\">Coinbase, Circle, Aave, and more partner to launch Tokenized Asset Coalition</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-07T20:51:19.000Z",
    "title": "Crypto whale loses $24.23 million in major Ethereum phishing scam",
    "url": "https://www.cryptopolitan.com/crypto-whale-loses-24-23-million-in-major-ethereum-phishing-scam/",
    "description": "In a devastating incident that has rattled the cryptocurrency community, a prominent crypto investor lost a staggering $24.23 million in a phishing scam on September 6. Identified by the Ethereum address &#8220;0x13e382,&#8221; the investor is considered a &#8220;crypto whale,&#8221; holding significant assets capable of influencing market trends. The loss included 4,851 rETH valued at approximately ... <a title=\"Crypto whale loses $24.23 million in major Ethereum phishing scam\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-whale-loses-24-23-million-in-major-ethereum-phishing-scam/\" aria-label=\"More on Crypto whale loses $24.23 million in major Ethereum phishing scam\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-07T20:58:17.000Z",
    "title": "Binance POR: Ethereum holdings declined while Bitcoin and USDT steadied",
    "url": "https://crypto.news/binance-por-ethereum-holdings-declined-while-bitcoin-and-usdt-steadied/",
    "description": "In Binance's 10th proof-of-Reserves (POR), Ethereum (ETH) holdings decreased, while Bitcoin (BTC) and Tether (USDT) assets remained stable or slightly increased"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-07T20:43:21.000Z",
    "title": "Jay-Z and Jack Dorsey’s firm expands to foster Bitcoin talent in Africa",
    "url": "https://crypto.news/jay-z-and-jack-dorseys-firm-expands-to-foster-bitcoin-talent-in-africa/",
    "description": "The Bitcoin non-profit, Btrust, co-founded by rapper Jay-Z and Block CEO Jack Dorsey, has acquired the Bitcoin talent company, Qala"
  }
]