[
  {
    "source": "Cointelegraph",
    "date": "2023-07-07T20:25:00.000Z",
    "title": "DeFi ‘circuit breaker’ could slash hack losses by 70%: Finance Redefined",
    "url": "https://cointelegraph.com/news/defi-circuit-breaker-could-slash-hack-losses-by-70-finance-redefined",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/e48eaf79-851e-4238-8dff-d0e4d8bb23ff.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The top 100 DeFi tokens had a mixed week. Most tokens traded in the same range as the previous week, with a minor bearish correction.</p>\n                    <p><p>Welcome to Finance Redefined, your weekly dose of essential <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance/amp\">decentralized finance (DeFi)</a> insights — a newsletter crafted to bring you the most significant developments from the past week.</p><p>Amid the growing number of hacks in the DeFi ecosystem, a smart contract developer has made a new Ethereum request for comment (ERC) proposal to introduce a circuit breaker that could cut losses from hacks by 70%.</p><p>In another exploit scare, Some Multichain contracts on Ethereum suffered withdrawals of more than half of their deposits, causing on-chain sleuths to fear an exploit is underway. The Poly Network was exploited again due to a private key compromise, and developers have requested users to withdraw funds after the exploit affected 57 crypto assets.</p><p>BarnBridge DAO members were told to pause “all work” related to the project after a reported probe by the United States Securities and Exchange Commission (SEC). </p><p>Decentralized social media protocol DeSo has issued a $1 million bounty for building a competitor to Reddit using its native blockchain. </p><p>The top 100 DeFi tokens had a mixed week. Most tokens traded in the same range as the previous week, with a minor bearish correction.</p><h2>ETH DeFi “circuit breaker” could cut hack losses by 70% — Developer</h2><p>A decentralized finance “circuit breaker” could have prevented billions of dollars worth of crypto from being stolen from DeFi protocols in 2022, according to the developer of the newly published ERC-7265 proposal.</p><p>A new ERC proposal was published on GitHub on July 3. In it, the lead developer Diyahir Campos proposed a standard for a DeFi “circuit breaker.” It essentially aims to set a standard for a smart contract that can halt suspiciously large token outflows from a DeFi protocol.</p><p><a href=\"https://cointelegraph.com/news/defi-circuit-breaker-could-cut-hack-losses-by-seventy-percent\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/defi-circuit-breaker-could-cut-hack-losses-by-seventy-percent/amp\"><strong>Continue reading</strong></a></p><h2>BarnBridge DAO calls halt to “all work” on DeFi protocol amid SEC probe</h2><p>BarnBridge DAO members have been told to pause “all work” related to the project after a reported probe by the SEC.</p><p>In a July 6 post on the platform’s Discord channel, Douglas Park, a lawyer for the <a href=\"https://cointelegraph.com/learn/what-is-a-dao\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/what-is-a-dao/amp\">decentralized autonomous organization</a>, revealed the news to members. “I am letting you know that the Securities and Exchange Commission is investigating BarnBridge DAO and individuals associated with the DAO,” Park said.</p><p><a href=\"https://cointelegraph.com/news/barnbridge-dao-calls-halt-on-work-amid-sec-investigation\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/barnbridge-dao-calls-halt-on-work-amid-sec-investigation/amp\"><strong>Continue reading</strong></a></p><h2>Multichain MPC bridge sees $100 million+ outflows, sparking fears of exploit</h2><p>Abnormally large outflows from the Multichain MPC bridge platform are sparking fears of a multimillion-dollar exploit.</p><p>On July 6, observers noticed that approximately $102 million worth of crypto had been withdrawn from Multichain’s Fantom bridge on the Ethereum side, as well as $666,000 from Dogechain and $5 million from Moonriver.</p><p><a href=\"https://cointelegraph.com/news/multichain-mpc-bridge-sees-millions-in-outflows-exploit-feared\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/multichain-mpc-bridge-sees-millions-in-outflows-exploit-feared/amp\"><strong>Continue reading</strong></a></p><h2>Poly Network urges users to withdraw after exploit affects 57 crypto assets</h2><p>Further details are coming to light following a July 2 attack on cross-chain bridge platform Poly Network, with a hacker being able to issue billions of tokens out of thin air for profit.</p><p>In a July 2 tweet, Poly Network confirmed it became the latest DeFi exploit victim after attackers managed to manipulate a smart contract function on the cross-chain bridge protocol, adding it will be temporarily suspending services.</p><p><a href=\"https://cointelegraph.com/news/poly-network-users-withdraw-bridge-exploit-affects-57-crypto\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/poly-network-users-withdraw-bridge-exploit-affects-57-crypto/amp\"><strong>Continue reading</strong></a></p><h2>DeFi market overview</h2><p>DeFi’s total market value saw a bullish surge after three bearish weeks. Data from <a href=\"https://pro.cointelegraph.com/users/sign_in?\">Cointelegraph Markets Pro</a> and TradingView shows that DeFi’s top 100 tokens by market capitalization had a mixed week, with most tokens trading in the green. The total value locked in DeFi protocols remained below $50 billion.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/909aba13-f522-4f69-aec1-e51deffefd02.png\"></figure><p>Thanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T20:24:20.000Z",
    "title": "Aptos Foundation Twitter account hacked to promote the fake giveaway",
    "url": "https://www.cryptopolitan.com/aptos-foundation-twitter-hacked-giveaway/",
    "description": "The Twitter account of the Aptos Foundation recently fell victim to a hacking incident, resulting in fraudulent activity and attempts to deceive users. The hackers behind the breach directed unsuspecting individuals to a counterfeit website promising participation in a fake airdrop. Aptos Foundation Suffers Twitter hack The fraudulent post referred to an airdrop supposedly taking ... <a title=\"Aptos Foundation Twitter account hacked to promote the fake giveaway\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-foundation-twitter-hacked-giveaway/\" aria-label=\"More on Aptos Foundation Twitter account hacked to promote the fake giveaway\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T20:23:12.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. Various APE price highlights unfold in this ApeCoin Price Prediction. How much is ApeCoin (APE) worth? ... <a title=\"ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: A Strong Buy Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T20:17:17.000Z",
    "title": "Everything to know about BRICS world currency",
    "url": "https://www.cryptopolitan.com/things-to-know-about-brics-world-currency/",
    "description": "The geopolitical landscape of global finance may soon experience a seismic shift as BRICS, a prominent economic coalition comprising Brazil, Russia, India, China, and South Africa, contemplates a potential common currency. The murmurings in the corridors of economic diplomacy revolve around a seemingly audacious idea, yet the group&#8217;s final decision on the matter remains undecided. ... <a title=\"Everything to know about BRICS world currency\" class=\"read-more\" href=\"https://www.cryptopolitan.com/things-to-know-about-brics-world-currency/\" aria-label=\"More on Everything to know about BRICS world currency\">Read more</a>"
  }
]