[
  {
    "source": "CoinDesk",
    "date": "2023-09-01T10:02:19.000Z",
    "title": "Creditors Accuse Genesis of Ballot-Stuffing Over $175M FTX Deal",
    "url": "https://www.coindesk.com/policy/2023/09/01/creditors-accuse-genesis-of-ballot-stuffing-over-175m-ftx-deal/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Genesis is facing headwinds as it seeks to finalize its wind-up after a January bankruptcy – and is now being accused by Gemini and other creditors of voter “manipulation.”"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-01T10:00:48.000Z",
    "title": "SEC ETF delay pulls market back leading to $130M liquidation havoc",
    "url": "https://cryptoslate.com/sec-etf-delay-pulls-market-back-leading-to-130-million-liquidation-havoc/",
    "description": "<p>The U.S. Securities and Exchange Commission&#8217;s latest delays on the spot Bitcoin (BTC) ETF applications led to a market-wide pullback that resulted in $130 million in liquidations over the last 24 hours. SEC delays spot ETF decision On Aug. 31, the financial regulator issued notices indicating the postponement of decisions on all ETF applications until October. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sec-etf-delay-pulls-market-back-leading-to-130-million-liquidation-havoc/\">SEC ETF delay pulls market back leading to $130M liquidation havoc</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-01T09:59:39.000Z",
    "title": "BlackRock Made To Wait As SEC Delays Decision On Bitcoin ETFs",
    "url": "https://cryptodaily.co.uk/2023/09/blackrock-made-to-wait-as-sec-delays-decision-on-bitcoin-etfs",
    "description": "The likes of Fidelity, BlackRock, VanEck, WisdomTree, Bitwise, Invesco, and Valkyrie have filed several spot Bitcoin ETF applications."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-01T09:54:43.000Z",
    "title": "YouTuber accidentally reveals seed phrases on livestream - loses $60k in crypto",
    "url": "https://cryptodaily.co.uk/2023/09/youtuber-accidentally-reveals-seed-phrases-on-livestream-loses-60k-in-crypto",
    "description": "Hapless Brazilian YouTuber Ivan Bianco accidentally revealed his wallet seed phrases on a livestream. All his crypto was gone in minutes."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-01T09:59:33.000Z",
    "title": "Nexo Launches Crypto Mastercard for EEA Citizens",
    "url": "https://cryptodaily.co.uk/2023/09/nexo-launches-crypto-mastercard-for-eea-citizens",
    "description": "The card supports transactions in Euro, U.S. dollar, and British pound, and stablecoins for over 100 million merchant terminals globally."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-01T10:07:05.000Z",
    "title": "Binance to Phase Out BUSD Support in Collaboration with Paxos",
    "url": "https://cryptodaily.co.uk/2023/08/binance-to-phase-out-busd-support-in-collaboration-with-paxos",
    "description": "Binance exchange has decided to wind down support for its widely recognized stablecoin, BUSD, next year, in collaboration with Paxos."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-01T10:03:29.000Z",
    "title": "Google Cloud and Kakao Healthcare Collaborate on Federated Learning for Healthcare Advancements",
    "url": "https://www.cryptopolitan.com/google-cloud-and-kakao-healthcare-collaborate-on-federated-learning-for-healthcare-advancements/",
    "description": "In a groundbreaking initiative, Google Cloud and Kakao Healthcare are harnessing the power of federated learning to expand the boundaries of artificial intelligence (AI) in the healthcare sector. This collaboration aims to transform the healthcare and life sciences landscape by applying federated learning techniques to address critical challenges while preserving privacy and data security. Empowering ... <a title=\"Google Cloud and Kakao Healthcare Collaborate on Federated Learning for Healthcare Advancements\" class=\"read-more\" href=\"https://www.cryptopolitan.com/google-cloud-and-kakao-healthcare-collaborate-on-federated-learning-for-healthcare-advancements/\" aria-label=\"More on Google Cloud and Kakao Healthcare Collaborate on Federated Learning for Healthcare Advancements\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-01T09:50:17.000Z",
    "title": "Crypto donations pour in to aid Maui wildfire victims led by Oprah and The Rock",
    "url": "https://www.cryptopolitan.com/crypto-donation-to-aid-maui-wildfire-victims/",
    "description": "In an inspiring show of solidarity, the crypto community has come together to support the Maui community as it recovers from the devastating wildfires that broke out on the island in early August 2023. Leading the charge are none other than A-list celebrities Oprah Winfrey and Dwayne &#8216;The Rock&#8217; Johnson, who have championed a relief ... <a title=\"Crypto donations pour in to aid Maui wildfire victims led by Oprah and The Rock\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-donation-to-aid-maui-wildfire-victims/\" aria-label=\"More on Crypto donations pour in to aid Maui wildfire victims led by Oprah and The Rock\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-01T10:00:35.000Z",
    "title": "Hedera Falls To Critical Support Level: Can HBAR Rebound This September?",
    "url": "https://www.newsbtc.com/news/hedera-falls-to-critical-support-level-can-hbar-rebound-this-september/",
    "description": "Hedera (HBAR) recently encountered a significant hurdle as it faced price rejection at a crucial weekly bearish order block. Currently hovering at the $0.0500 level, this juncture has emerged as a formidable obstacle for sellers looking to capitalize on the prevailing bearish sentiment. In a price report, it was revealed that HBAR&#8217;s funding rates have consistently remained in negative territory for the past few days. This bearish skew in the futures market further underscores the challenges HBAR faces in its price recovery.  The current HBAR price, as reported by CoinGecko, stands at $0.050716, with a 5.0% decline over the last 24 hours and nearly 13% drop over the past seven days. Related Reading: The ApeCoin Quandary: Why Additional Losses Could Persist Declining Open Interest Reflects Reduced Hedera Demand Adding to the bearish narrative, open interest rates for HBAR have plummeted from $27 million to $21 million within the last five days (from August 24th to August 31st). This substantial drop indicates a waning demand for HBAR within the futures market, potentially emboldening sellers to seek further gains. The fate of HBAR remains closely intertwined with Bitcoin&#8217;s performance. As Bitcoin drops below the key $26,000 level, it has retraced a significant portion of its loss courtesy of a favorable US court ruling in Grayscale Investments&#8217; Bitcoin ETF case against the Securities and Exchange Commission. HBAR market cap currently at $1.6 billion. Chart: TradingView.com SEC&#8217;s ETF Delay Casts a Shadow on the Crypto Market Bitcoin&#8217;s value, along with that of other cryptocurrencies, took a hit following the SEC&#8217;s announcement of a delay in reviewing seven spot Bitcoin exchange-traded fund (ETF) applications until October. This delay has cast a shadow of uncertainty over the cryptocurrency market, impacting investor sentiment. CoinShares, in its latest Digital Asset Fund Flows Weekly Report, revealed that digital assets collectively experienced outflows of $168 million over the past week, marking a two-week streak of declining investments. This negative sentiment can be attributed to the growing belief that the approval of a spot Bitcoin ETF will take longer than initially anticipated. HBAR seven-day price movement. Source: Coingecko. Related Reading: Can Shiba Inu Climb Before September Starts? Evaluating The $0.00001 Projection However, amidst this turbulent market atmosphere, there is a glimmer of hope, especially after Grayscale&#8217;s win in its lawsuit against the SEC. The court acknowledged the SEC&#8217;s error in rejecting Grayscale&#8217;s bitcoin ETF application. This legal triumph could potentially inject some optimism back into the crypto market in the coming days. The fate of HBAR remains closely linked to Bitcoin&#8217;s performance, and uncertainties stemming from the SEC&#8217;s ETF delay continue to weigh on the broader cryptocurrency market. Grayscale&#8217;s legal victory, however, offers a ray of hope amidst the prevailing bearish sentiment. Meanwhile, traders and investors are advised to tread cautiously and monitor market developments closely. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from IntelligentHQ"
  }
]