[
  {
    "source": "Cointelegraph",
    "date": "2024-03-23T00:30:00.000Z",
    "title": " Ethereum price clings to key support amid SEC probe and traders’ shifting sentiment ",
    "url": "https://cointelegraph.com/news/ethereum-clings-to-3200-amid-sec-probes-and-shifting-trader-sentiment",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNWEwMzFhNjMtNjAyNC00OThiLTlkZWItNTk3NjJmNzNiNTUzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>On-chain activity within Ethereum layer-2 protocols and ETH derivatives data suggests that the altcoin will hold the $3,200 level. </p>\n                    <p><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) price faced a significant setback after encountering robust resistance at the $4,100 mark on March 12. Ether has seen a 9% decline over the past week, underperforming when compared to the broader cryptocurrency market, leading traders to speculate whether the current support level of $3,200 will hold. For context, the total cryptocurrency market capitalization fell by 2.5% during the same timeframe.</p><p>From a bullish viewpoint, the potential approval of a <a href=\"https://cointelegraph.com/news/sec-pushes-deadline-vaneck-spot-ether-etf\">spot Ethereum</a> exchange-traded fund (ETF) remains a key catalyst. The United States Securities and Exchange Commission (SEC) is currently reviewing the matter, with a final decision anticipated by May 23. However, Bloomberg senior ETF analyst James Seyffart does not consider approval as his base scenario.</p><p>The <a href=\"https://cointelegraph.com/news/ethereum-dencun-transaction-fees-l2\">recent upgrades</a> to the Ethereum protocol should not be overlooked. The Dencun hard fork, which took place on March 13, aimed at enhancing the network's scalability and improving layer-2 data processing capabilities, is highly sought after by rollup solutions. As a result, transaction fees for most applications on Arbitrum, Optimism, and Base have significantly decreased.</p><p><a href=\"https://cointelegraph.com/news/ethereum-clings-to-3200-amid-sec-probes-and-shifting-trader-sentiment\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-23T00:37:09.000Z",
    "title": "Solana CEO Anatoly Yakovenko denounces influx of racist and offensive memecoins",
    "url": "https://cryptoslate.com/solana-ceo-anatoly-yakovenko-denounces-influx-of-racist-and-offensive-memecoins/",
    "description": "<p>Members of the Solana community and the crypto ecosystem denounced the recent surge in inflammatory memecoins on March 22. Unknown parties recently took advantage of Solana&#8217;s token creation feature to introduce thousands of memecoins with racist and antisemitic terminology in their names, some tokens also contained anti-China descriptions and other broadly offensive material. Solana founder [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/solana-ceo-anatoly-yakovenko-denounces-influx-of-racist-and-offensive-memecoins/\">Solana CEO Anatoly Yakovenko denounces influx of racist and offensive memecoins</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-23T00:30:27.000Z",
    "title": "Avalanche Doubles Down on Meme Coins: Announces $1 Million Liquidity Mining Incentives Program",
    "url": "https://news.bitcoin.com/avalanche-doubles-down-on-meme-coins-announces-1-million-liquidity-mining-incentives-program/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/19dfd27c-16dc-43a7-85a6-16121ae4e2ef-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Avalanche Doubles Down on Meme Coins: Announces $1 Million Liquidity Mining Incentives Program\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/19dfd27c-16dc-43a7-85a6-16121ae4e2ef-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/19dfd27c-16dc-43a7-85a6-16121ae4e2ef-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/19dfd27c-16dc-43a7-85a6-16121ae4e2ef-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/19dfd27c-16dc-43a7-85a6-16121ae4e2ef-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/19dfd27c-16dc-43a7-85a6-16121ae4e2ef-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/19dfd27c-16dc-43a7-85a6-16121ae4e2ef-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/19dfd27c-16dc-43a7-85a6-16121ae4e2ef.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The Avalanche Foundation announced the launch of Memecoin Rush, a program designed to incentivize meme coin liquidity providers on selected platforms in the AVAX environment. The program will allocate $1 million to participants that provide liquidity for these tokens on Trader Joe and Steakhut, two AVAX decentralized platforms, and expand to include other platforms. Avalanche [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-23T00:30:29.000Z",
    "title": "Bitcoin Long-Term Holders & Price Top: Glassnode Reveals Pattern",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-long-term-holders-price-top-glassnode/",
    "description": "The on-chain analytics firm Glassnode has explained that Bitcoin tends to reach a potential top when the long-term holders show this pattern. Bitcoin Long-Term Holders Have Been Ramping Up Distribution In a new report, Glassnode discussed the influence that the BTC long-term holders have on the cryptocurrency&#8217;s supply dynamics. The &#8220;long-term holders&#8221; (LTHs) here refer to the Bitcoin investors who have been holding onto their coins for more than 155 days. The LTHs comprise one of the two main divisions of the BTC user base based on holding time, with the other cohort known as the &#8220;short-term holders&#8221; (STHs). Related Reading: Bitcoin Cash (BCH) Surges 15% As Coinbase Plans Futures Listing Historically, the LTHs have proven themselves to be the persistent hands of the market. They don&#8217;t quickly sell their coins regardless of what is happening in the broader sector. The STHs, on the other hand, often react to FUD and FOMO events. As such, it&#8217;s not unusual to see the STHs participating in selling. However, the LTHs showing sustained distribution can be something to note, as selling from these HODLers, who usually sit tight, may have implications for the market. There are many different ways of tracking the behavior of the LTHs, but in the context of the current discussion, Glassnode has used the &#8220;LTH Market Inflation Rate&#8221; metric. As the report explains: It shows the annualized rate of Bitcoin accumulation or distribution by LTHs relative to daily miner issuance. This rate helps identify periods of net accumulation, where LTHs are effectively removing Bitcoin from the market, and periods of net distribution, where LTHs add to the market&#8217;s sell-side pressure. Now, here is a chart that shows the trend in the BTC LTH Market Inflation Rate over the past several years: The value of the metric seems to have been on the rise in recent days &#124; Source: Glassnode In the chart, the analytics firm has also attached the data for the asset&#8217;s Inflation Rate, which is basically the amount that the miners are introducing into the circulating supply by solving blocks and receiving rewards for them. When the LTH Market Inflation Rate equals 0%, these HODLers are accumulating amounts exactly equal to what the miners are issuing. This implies that the indicator below the 0% mark suggests the LTHs are pulling coins out of the supply, while it being above is a sign that they are either distributing or just not buying enough to absorb what the miners are producing. The graph shows that historically, the cryptocurrency&#8217;s price has tended to reach a state of equilibrium and potentially even a top when the LTH distribution has peaked. Related Reading: Bitcoin Traders Capitulate: Here’s What Happened Last 2 Times The LTH Market Inflation Rate has been increasing recently, but it&#8217;s yet to reach any significant levels. As for what this could mean for the market, Glassnode says: Currently, the trend in the LTH market inflation rate indicates we are in an early phase of a distribution cycle, with about 30% completed. This suggests significant activity ahead within the current cycle until we achieve a market equilibrium point from the supply and demand perspective and potential price tops. BTC Price Bitcoin has retraced most of its recovery from the past few days, as its price has now declined to $63,800. Looks like the price of the asset has witnessed a drawdown again &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, Glassnode.com, chart from TradingView.com"
  }
]