[
  {
    "source": "Crypto Briefing",
    "date": "2024-02-21T01:00:14.000Z",
    "title": "Franklin Templeton invests in Asian crypto media firm Blockhead",
    "url": "https://cryptobriefing.com/franklin-templeton-invests-blockhead/?utm_source=feed&utm_medium=rss",
    "description": "Franklin Templeton leads funding round for Asian crypto media startup Blockhead to boost its digital asset research platform."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-21T01:00:31.000Z",
    "title": "Ethereum (ETH) Price Reaches $3,000 After Two Years, More Excitement To Come?",
    "url": "https://www.newsbtc.com/ethereum-news/ethereum-eth-price-reaches-3000-after-two-years-more-excitement-to-come/",
    "description": "On Tuesday, Ether (ETH), the second largest cryptocurrency by market capitalization, touched its highest level since April of 2022. Ethereum’s native cryptocurrency momentarily surpassed the $3,000 before quickly facing a price pullback. Related Reading: Ethereum Receives Nod Of Approval From Berstein: ETH Price Will Reach $10,000 Ether Briefly Touches The Sky The whole crypto market has been buzzing with a bullish sentiment in recent weeks after the massive inflows coming into the recently launched Spot Bitcoin ETFs (exchange-traded funds). Since the approval of Bitcoin ETFs by the US Securities and Exchange Commission (SEC), eyes have moved to the possibility of other spot crypto-based ETFs in other cryptocurrencies like ETH and XRP. $ETH vs $3,000 ( •_•) (•_• ) ( ง )ง ୧( ୧ ) /︶ /︶ &#8212; Binance (@binance) February 20, 2024 The speculation surrounding the approval of Ether ETFs in May has been one of several actors fueling the recent price surge. The expectation for the approval and launch of the Bitcoin-based investment products filled the crypto market with positive sentiment on the BTC’s price uptrend. As previously reported, Options traders expect the cryptocurrency’s price to reach $4,000 in the upcoming months. This predicted price range would come closer to the token’s all-time high (ATH) of $4,800, seen during the previous market bull run in November 2021. However, the first test in a journey to $4,000 presents as the $3,000 resistance level. Analysts have evaluated Ether’s movements as its momentum reignited and considered the $3,000 a possible milestone after the digital asset showed a strong resistance in the $2,800 support zone. Today, the second-largest cryptocurrency surpassed this key resistance zone momentarily, an achievement not seen since the end of April 2022. However, Ethereum’s native token could not maintain momentum for long and faced a price pullback to the $2,900 level. JUST IN: Ethereum surpasses $3,000 &#8212; Watcher.Guru (@WatcherGuru) February 20, 2024 Whales Are pulling In Both Directions Recent developments in Ether’s price have had many investors express a positive outlook for the second-largest cryptocurrency. Some analysts even made a bullish prediction on the Altcoin market in general. Whales have also reacted to ETH’s recent uptrend. According to an X post by Spot on Chain, a whale allegedly bought 54,721 ETH at $2,845 24 hours before the post. These transactions accounted for approximately $155.7 million and signaled a positive sentiment toward the asset by the large players in the market. However, a dormant whale who participated in Ethereum’s ICO woke up after 8 years, according to the blockchain analyst platform Lookonchain. After the price of $ETH surpassed $3,000, an #Ethereum ICO participant woke up after 8.6 years of dormancy and deposited 1,732 $ETH($5.15M) to #Kraken. He received 3,465 $ETH($10.3M) at #Ethereum Genesis, the ETH ICO price is ~$0.31.https://t.co/K6xOHILdne pic.twitter.com/o50JKxXxzP &#8212; Lookonchain (@lookonchain) February 20, 2024 The whale seemingly deposited about half of its ETH holdings into Kraken after ETH’s price surpassed $3,000. The transaction saw the transfer of 1,732 ETH worth approximately $5.15 million to the crypto exchange. This transaction has raised a slight concern over the possibility of a massive sell-off that could affect ETH’s uptrend. Crypto investors now stay alert of large holders trying to offload their assets to profit from the market upsurge. ETH Price Performance At the time of writing, ETH is trading at $2,923.50, representing a 1.6% decrease in the last hour. Despite this, the price has increased 11.2% in the last week. More notably, Ether’s daily trading volume has shown a 47.10% increase, at $20.6 billion in the last 24 hours, suggesting a rise in market activity. Similarly, ETH comfortably maintains its spot as the second-largest cryptocurrency by market capitalization, with a 0.82% increase in the last day, totaling $351.29 billion. Related Reading: Ethereum Price Grinds Higher, Will ETH Bulls Be Able to Hit $3K Milestone? ETH is trading at $2,920.46 in the hourly chart. Source: BTCUSDT on TradingView.com Featured image from Unsplash.com, Chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-21T01:00:51.000Z",
    "title": "Top Analyst Predicts Massive Rise in Altcoin Market Cap, Names His Two Favorite Crypto Subsectors",
    "url": "https://dailyhodl.com/2024/02/20/top-analyst-predicts-massive-rise-in-altcoin-market-cap-names-his-two-favorite-crypto-subsectors/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/02/top-rise-cap-two.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/02/top-rise-cap-two.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/02/top-rise-cap-two.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/02/top-rise-cap-two.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/02/top-rise-cap-two.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/02/top-rise-cap-two.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/02/top-rise-cap-two.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A crypto strategist who nailed the end of Bitcoin&#8217;s (BTC) 2021 bull market thinks that a huge upswing for the altcoin market is just getting started. Pseudonymous analyst Pentoshi tells his 755,100 followers on the social media platform X that he&#8217;s keeping a close watch on the TOTAL3 chart, which tracks the market cap of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/20/top-analyst-predicts-massive-rise-in-altcoin-market-cap-names-his-two-favorite-crypto-subsectors/\">Top Analyst Predicts Massive Rise in Altcoin Market Cap, Names His Two Favorite Crypto Subsectors</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]