[
  {
    "source": "Cointelegraph",
    "date": "2023-06-05T10:50:00.000Z",
    "title": "JPMorgan uses blockchain for 24/7 dollar transfers with Indian banks",
    "url": "https://cointelegraph.com/news/jpmorgan-uses-blockchain-for-24-7-dollar-transfers-with-indian-banks",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/fce4014b-6969-45a4-b5f6-60b551c0c7b2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>JPMorgan applies blockchain to interbank dollar transactions in India amid the growing signs of global de-dollarization.</p>\n                    <p><p>Global financial services company JPMorgan continues exploring the benefits of blockchain, deploying the technology to eliminate some restraints of traditional finance.</p><p>JPMorgan has partnered with six major Indian banks to introduce a blockchain-based platform enabling interbank settlement of dollar transactions, Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2023-06-05/jpmorgan-to-use-blockchain-to-settle-usd-fx-trades-in-india-hub\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> on June 5.</p><p>The participating banks include HDFC Bank, ICICI Bank, Axis Bank, Yes Bank, IndusInd Bank and JPMorgan’s own banking unit at Gujarat International Finance Tec-City, or GIFT City.</p><p>The blockchain project aims to expand the capacity of the existing settlement system, JPMorgan’s senior country officer Kaustubh Kulkarni said. According to the exec, the platform will allow the banks to process instant transactions twenty-four hours a day, seven days a week. </p><p>Under the current interbank settlement system, transactions could take up to several hours. Additionally, settlement is not available on Saturdays, Sundays or public holidays. JPMorgan’s blockchain pilot will remove this barrier, Kulkarni claimed, stating:</p><blockquote>“By leveraging blockchain technology to facilitate transactions on a 24x7 basis, processing is instantaneous and enables GIFT City banks to support their own time-zone and operating hours.”</blockquote><p>The initiative also aims to help New Delhi position the GIFT City as an alternative trading center to Singapore and Dubai, the report notes.</p><p>According to Kulkarni, JPMorgan will be running a pilot project for the next few months to analyze banks’ experience. The pilot project will be launched on Monday, using JPMorgan’s blockchain platform Onyx, after approval from the International Financial Services Center Authority.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/jpmorgan-chase-enters-generative-ai-race-with-indexgpt-trademark\"><strong><em>JPMorgan Chase enters generative AI race with IndexGPT trademark</em></strong></a></p><p>As previously reported, JPMorgan <a href=\"https://cointelegraph.com/news/jpmorgan-s-stablecoin-finally-sees-commercial-light-of-day\">launched its blockchain-based platform Onyx</a> in 2020, aiming to improve the quality of wholesale payments transactions. The bank reportedly <a href=\"https://www.pymnts.com/news/banking/2023/jpm-holds-firm-on-plans-to-tokenize-traditional-finance/#:~:text=According%20to%20the%20report%2C%20the,version%20of%20the%20Ethereum%20blockchain.\" target=\"_blank\" rel=\"noopener nofollow\">processed</a> nearly $700 billion in short-term loan transactions via Onyx as of April 2023.</p><p>The news comes amid JPMorgan currency strategists pointing out some signs of currently emerging de-dollarization. \"De-dollarisation is evident in FX reserves where the dollar’s share has declined to a record as share in exports declined, but is still emerging in commodities,\" the strategists <a href=\"https://www.reuters.com/markets/signs-de-dollarisation-emerge-dollar-top-currency-jpmorgan-2023-06-05/\" target=\"_blank\" rel=\"noopener nofollow\">said</a>.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\"><strong><em>Bitcoin is on a collision course with ‘Net Zero’ promises</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-05T10:40:00.000Z",
    "title": "'Crypto Tsar' needed to ensure coordinated approach in the UK: EU lawmakers",
    "url": "https://cointelegraph.com/news/crypto-tsar-needed-to-ensure-coordinated-approach-in-the-uk-eu-lawmakers",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/e5e17a26-fe36-44c1-8a9c-15c97fa30ec5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>APPG Chair Lisa Cameron emphasized the report's significance in securing the UK's leadership in the crypto sector and safeguarding consumers.</p>\n                    <p><p>A lawmaker group in the United Kingdom has published its recommendations to the government for the crypto and digital asset space. The list of recommendations includes the appointment of an official who will ensure a coordinated regulatory approach for the crypto and digital assets space. </p><p>In an effort to help policymakers better understand the crypto space, the Crypto and Digital Assets All Parliamentary Group (APPG) <a href=\"https://cryptouk.io/wp-content/uploads/2023/06/Crypto-and-Digital-Assets-APPG-Inquiry-Full-Report.pdf\" target=\"_blank\" rel=\"noopener nofollow\">published</a> a report containing 53 recommendations for the space. </p><p>In its key conclusions, the report <a href=\"https://cryptouk.io/wp-content/uploads/2023/06/Crypto-and-Digital-Assets-APPG-Inquiry-Summary-Report-1.pdf\" target=\"_blank\" rel=\"noopener nofollow\">highlighted</a> that the rapid growth of the crypto and digital assets suggests that “the sector is here to stay.” Because of this, the report also suggested that there is an urgent need for crypto regulation in the UK to protect consumers and create guardrails that ensure economic growth. </p><p>APPG Chair Lisa Cameron said that given the growth of crypto, the report is vital to ensure the UK's leadership in the sector and make sure that consumers are protected. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Chair of the APPG <a href=\"https://twitter.com/DrLisaCameronMP?ref_src=twsrc%5Etfw\">@DrLisaCameronMP</a> has today published the findings of the APPG inquiry into the Crypto and Digital Asset industry and calls for urgent regulation of the industry in the UK. Download the report here<a href=\"https://t.co/nwHvl8LsVF\">https://t.co/nwHvl8LsVF</a> <a href=\"https://t.co/mA6yHrNILL\">pic.twitter.com/mA6yHrNILL</a></p>&mdash; Crypto &amp; Digital Assets APPG (@cryptoappg) <a href=\"https://twitter.com/cryptoappg/status/1665631501482950657?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to the report, UK regulators will play a vital role in delivering the government's vision to make the UK a global crypto hub. Because of this, the lawmakers also highlighted the need for a coordinated approach across various government departments and agencies that could potentially be impacted by the growth of crypto, digital assets and blockchain technology. </p><p>To solve this challenge, the report suggested the creation of a role that would coordinate across departments. “Government should consider the appointment of a ‘Crypto Tsar’ who can help coordinate across departments to ensure a consistent approach,” the APPG wrote. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/kraken-uk-trade-body-slam-treasury-crypto-as-gambling\"><strong><em>Kraken, UK trade body derides lawmaker description of crypto as ‘gambling’</em></strong></a></p><p>Meanwhile, in the United States, targeted crypto legislation <a href=\"https://cointelegraph.com/news/in-the-us-targeted-crypto-legislation-could-start-the-ball-rolling\">could potentially start the ball rolling</a>. In a Cointelegraph interview, University professor Carol Goforth said that if they are lucky, the U.S. could get targeted legislation on spot market regulation or stablecoin legislation. According to the professor, this could kick off the creation of regulations in the country. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/cryptocurrency-trading-addiction-what-to-look-out-for-and-how-it-is-treated/\"><strong><em>Cryptocurrency trading addiction — What to look out for and how it is treated</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-05T11:01:17.000Z",
    "title": "Voting for Terra Luna Classic v2.1.0 upgrade opens soon",
    "url": "https://cryptoslate.com/voting-for-terra-luna-classic-v2-1-0-upgrade-opens-soon/",
    "description": "<p>The Terra Luna Classic community will vote on the v2.1.0 upgrade proposal on June 7. If the proposal is approved, LuncBurnArmy stated that the upgrade would go live on June 14. Terra Classic upgrade v2.1.0 The v2.1.0 upgrade proposal includes a 5% validator commission to attract more validators, Cosmwasm v1.1.x, and the implementation of protocol [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/voting-for-terra-luna-classic-v2-1-0-upgrade-opens-soon/\">Voting for Terra Luna Classic v2.1.0 upgrade opens soon</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-05T10:54:38.000Z",
    "title": "Is UBI coming for the United Kingdom?",
    "url": "https://cryptoslate.com/insights/is-ubi-coming-for-the-united-kingdom/",
    "description": "<p>Quick Take Reports have emerged that in the United Kingdom, Universal Basic Income (UBI) will be trialed in two places in England, according to the Guardian. UBI of £1,600 a month will be trialed as a pilot program. According to the UK parliament, UBI, or the furlough program introduced in Covid, cost the UK taxpayers [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/is-ubi-coming-for-the-united-kingdom/\">Is UBI coming for the United Kingdom?</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-06-05T10:50:00.000Z",
    "title": "JPMorgan uses blockchain for 24/7 dollar transfers with Indian banks",
    "url": "https://cointelegraph.com/news/jpmorgan-uses-blockchain-for-24-7-dollar-transfers-with-indian-banks",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/fce4014b-6969-45a4-b5f6-60b551c0c7b2.jpg\"></p><p>JPMorgan applies blockchain to interbank dollar transactions in India amid the growing signs of global de-dollarization.</p>\n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-05T11:03:30.000Z",
    "title": "Dollar guaranteed to lose value - Bitcoin is the way out",
    "url": "https://cryptodaily.co.uk/2023/06/dollar-guaranteed-to-lose-value-bitcoin-is-the-way-out",
    "description": "<p>Within the economic monetary system, continuous printing of fiat currency means that the purchasing power of the dollar is always falling. Bitcoin is scarce with a fixed supply. Do the Maths.</p>\nPurchasing power is dwindling fast\n<p>For the average Joe and Jane, finding enough money (currency) to pay the bills always seems to get more and more difficult with each passing year. Both of them probably work, unlike their parents or grandparents who seemed to get along on just one wage.</p>\n<p>The last few years had seemed much worse. Since the Pandemic, when bank accounts were pretty flush with government handouts, things have begun to get more problematic. Now, many families are not able to save, and if they had to find just a few hundred dollars for an unexpected shortfall, they probably wouldn&rsquo;t be able to produce it.</p>\n<p>What has happened is that governments have printed their way out of the Pandemic, and if we are really being factual, they have been printing more and more currency for many decades because that is the only way this debt-based system stays afloat.&nbsp;</p>\n<p>The countries of the world all use a fiat monetary system, and since the US dollar came off of its gold backing in 1971, they have remained pegged to a currency that is being printed with gay abandon at the expense of the purchasing power of all citizens.</p>\n<p>There is only one destination for all fiat currencies and that is zero, just like every fiat currency in the history of the world. The average lifespan of a fiat currency is only 27 years.&nbsp;</p>\n<p>Since the creation of the US Federal Reserve system in 1913, the dollar has fallen in purchasing power. One dollar at the time of the Pandemic in 2020 was worth more than $26 back in 1913.&nbsp;</p>\n<p>With trillions being added since the outbreak of Covid in 2020, that figure has become far worse. Also, with the Federal Reserve probably loosening its monetary policy as the US heads towards recession, and given that the debt ceiling has no ceiling for the next 2 years, at least another $4 trillion will be added to the debt pile, and will further eat away at the purchasing power of all.</p>\nBitcoin is the way out\n<p>Bitcoin will only ever have a supply of 21 million coins. It is hugely decentralised, incredibly secure, and well out of the reach of any government to confiscate or manipulate.</p>\n<p>The average Joe and Jane have a way to get any savings out of failing banks and into Bitcoin. The mainstream narrative on Bitcoin is a cover to prevent people from doing the obvious thing. Education is the only way to help people protect themselves from what is to come.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-05T10:46:39.000Z",
    "title": "Atomic Wallet efforts to track and revert stolen funds",
    "url": "https://www.cryptopolitan.com/atomic-wallet-efforts-to-track-stolen-funds/",
    "description": "A recent hack targeting Atomic Wallet resulted in the theft of $35 million from its users since June 2. However, the company claims that less than 1% of its monthly active users were affected. Following the attack, Atomic Wallet and blockchain investigators have been working diligently to track and return the stolen funds. Exploiting the ... <a title=\"Atomic Wallet efforts to track and revert stolen funds\" class=\"read-more\" href=\"https://www.cryptopolitan.com/atomic-wallet-efforts-to-track-stolen-funds/\" aria-label=\"More on Atomic Wallet efforts to track and revert stolen funds\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-05T10:54:50.000Z",
    "title": "Terra co-founder Do Kwon granted bail following Montenegro ruling",
    "url": "https://crypto.news/terra-co-founder-do-kwon-granted-bail-following-montenegro-ruling/",
    "description": "Terra co-founder Do Kwon could potentially be released on bail again following a Friday court ruling in Montenegro."
  },
  {
    "source": "BTCManager",
    "date": "2023-06-05T10:51:10.000Z",
    "title": "Bitcoin transitions into bull market after bottoming, analysis shows",
    "url": "https://crypto.news/bitcoin-transitions-into-bull-market-after-bottoming-analysis-shows/",
    "description": "Recent developments in the cryptocurrency market indicate a transition from a bear market to a more optimistic bull market, primarily driven by the movement of bitcoin (BTC). CryptoQuant, a prominent crypto analytics platform, highlights several factors that support this shift,&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-05T10:50:50.000Z",
    "title": "Bitcoin Defies Expectations: Price Holds Strong Above $27K, Analysts Anticipate Continued Resilience",
    "url": "https://www.crypto-news-flash.com/bitcoin-defies-expectations-price-holds-strong-above-27k-analysts-anticipate-continued-resilience/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-defies-expectations-price-holds-strong-above-27k-analysts-anticipate-continued-resilience",
    "description": "<p>Post the US announcing the further raise of its debt ceiling, the BTC price has managed to hold strongly above $27,000. The Bitcoin put/call ratio has also been on a decline post the US debt deal, showing a drop in the bearish sentiment. The world&#8217;s largest cryptocurrency Bitcoin (BTC) is showing strong resilience against the [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/bitcoin-defies-expectations-price-holds-strong-above-27k-analysts-anticipate-continued-resilience/\">Bitcoin Defies Expectations: Price Holds Strong Above $27K, Analysts Anticipate Continued Resilience</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-05T10:48:33.000Z",
    "title": "Twitter Co-founder Endorses Pro-Crypto U.S. Presidential Candidate",
    "url": "https://coinedition.com/twitter-co-founder-endorses-pro-crypto-u-s-presidential-candidate/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Robert_F_Kennedy_Jr_argues_he_can_beat_Trump_and_DeSantis_in_2024-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Robert_F_Kennedy_Jr_argues_he_can_beat_Trump_and_DeSantis_in_2024-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Robert_F_Kennedy_Jr_argues_he_can_beat_Trump_and_DeSantis_in_2024-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Robert_F_Kennedy_Jr_argues_he_can_beat_Trump_and_DeSantis_in_2024-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Robert_F_Kennedy_Jr_argues_he_can_beat_Trump_and_DeSantis_in_2024-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Robert_F_Kennedy_Jr_argues_he_can_beat_Trump_and_DeSantis_in_2024-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Robert_F_Kennedy_Jr_argues_he_can_beat_Trump_and_DeSantis_in_2024.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Twitter co-founder Jack Dorsey has endorsed Democratic politician Robert Kennedy Jr. for the 2024 United States presidential elections. The former Twitter CEO is confident that Kennedy Jr. will defeat his Republican opponents, including Florida Governor Ron DeSantis and former U.S. President Donald J. Trump. Dorsey took to Twitter earlier today to share a video of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/twitter-co-founder-endorses-pro-crypto-u-s-presidential-candidate/\">Twitter Co-founder Endorses Pro-Crypto U.S. Presidential Candidate</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]