[
  {
    "source": "Cointelegraph",
    "date": "2023-08-08T05:21:40.000Z",
    "title": "PayPal stablecoin launch sparks wave of fake PYUSD tokens",
    "url": "https://cointelegraph.com/news/paypal-stablecoin-launch-sparks-fake-pyusd-tokens",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/d7c25237-c3bd-430a-a6bc-8db82a040a0e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Nearly 30 fake PYUSD tokens cropped up in the wake of PayPal’s most recent announcement.</p>\n                    <p><p>Less than 16 hours have passed since the launch of <a href=\"https://cointelegraph.com/news/paypal-launches-stablecoin-for-payment\">PayPal’s new stablecoin</a> (PYUSD), and opportunists, degens and potential scammers are already attempting to cash in on the hype with their own copycat tokens.</p><p>According to data from decentralized exchange scanner DexScreener, nearly 30 new token pairs sporting the ticker “PYUSD” have cropped up in the 16 hours since the announcement. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today, we’re unveiling a new stablecoin, PayPal USD (PYUSD). It’s designed for payments and is backed by highly liquid and secure assets. Starting today and rolling out in the next few weeks, you’ll be able to buy, sell, hold and transfer PYUSD. Learn more <a href=\"https://t.co/53RRBhmNHx\">https://t.co/53RRBhmNHx</a> <a href=\"https://t.co/53ur2KmjU7\">pic.twitter.com/53ur2KmjU7</a></p>&mdash; PayPal (@PayPal) <a href=\"https://twitter.com/PayPal/status/1688552795278872576?ref_src=twsrc%5Etfw\">August 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The look-alike tokens have been minted on a variety of different chains including Binance Smart Chain, Ethereum and Coinbases’ newest layer 2 Base. </p><p>It’s important to note that the real PayPal USD token was created in November last year, and can be verified at the following contract <a href=\"https://etherscan.io/address/0x6c3ea9036406852006290770bedfcaba0e23a0e8\" target=\"_blank\" rel=\"noopener nofollow\">address</a>.</p><p>PayPal explicitly <a href=\"https://newsroom.paypal-corp.com/2023-08-07-PayPal-Launches-U-S-Dollar-Stablecoin\" target=\"_blank\" rel=\"noopener nofollow\">stated</a> that PayPal USD could only be sent between verified PayPal and other compatible wallets, making it extremely unlikely that any of the tokens listed with the same ticker on UniSwap or any other decentralized exchange are the real thing.</p><p>The largest imposter PYUSD token, minted on Ethereum, has seen a staggering $2.6 million in trading volume since its inception just minutes after PayPal announced the launch of their stablecoin. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/bd35437f-296c-4953-b0ca-4c179f4f0731.png\"  /><figcaption style=\"text-align: center;\"><em>Price action for one imposter PYUSD token since inception. Source: DexScreener</em></figcaption></figure><p>Despite surging more than 30,000% in the first eight hours, the token has since plummeted more than 66% from its all time high.</p><p>One particular token made a slightly humorous take on PayPal’s stablecoin, opting for the name “PepeYieldUnibotSatoshiDoge.” The imposter token has gained more than 3,000% in the last 4 hours.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/ac8a7d2d-c32b-4ca4-9af0-2463875c5881.png\"  /><figcaption style=\"text-align: center;\"><em>Price action since inception for PepeYieldUnibotSatoshiDoge. Source: DexScreener</em></figcaption></figure><p>It’s worth noting that many of the fake PYUSD tokens listed are likely <a href=\"https://cointelegraph.com/news/what-is-a-honeypot-crypto-scam-and-how-to-spot-it\">what’s known as “honeypots</a>” — meaning that once an investor purchases the token, they are unable to sell, and have effectively given away their crypto. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/paypal-usd-boon-for-ethereum-but-not-decentralization-says-community\"><strong><em>Paypal USD: Boon for Ethereum but not decentralization, says community</em></strong></a></p><p>Unless investors are capable of auditing smart contracts themselves, they often will not find out the token is a honeypot until they try to sell their holdings. </p><p>Degens have been known to race to mint new memecoins to capitalize on trending stories and developments. </p><p>On Aug. 3 anonymous <a href=\"https://cointelegraph.com/news/korean-superconductor-lk99-joins-memecoin-craze\">developers created an “LK-99” token</a>, in a bid to cash in on the superconductor craze. </p><p>A week before on July 27, degens crafted up a roster of <a href=\"https://cointelegraph.com/news/ufo-hearing-alien-crypto-themed-memecoins\">more than 50 UFO-themed memecoins</a> as the United States’ Congress held a hearing where a whistleblower accused the U.S. government of covering up alien visitation to Earth.</p><p><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]