[
  {
    "source": "Decrypt",
    "date": "2023-09-14T11:34:07.000Z",
    "title": "3AC’s Zhu Su, Kyle Davies Slapped With 9-Year Finance Ban by Singapore Monetary Authority",
    "url": "https://decrypt.co/156666/3acs-zhu-su-kyle-davies-slapped-with-9-year-finance-ban-by-singapore-monetary-authority",
    "description": "The company hired a hedge fund manager without notifying authorities and then traded crypto with no risk framework in place."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-14T11:16:51.000Z",
    "title": "Coinbase CEO: DeFi Projects Should Take Regulators to Court to ‘Establish Precedent’",
    "url": "https://decrypt.co/156665/coinbase-ceo-defi-projects-should-take-regulators-to-court-to-establish-precedent",
    "description": "Brian Armstrong argued that the CFTC shouldn't be taking action against DeFi protocols, and that the courts would likely \"uphold rule of law.\""
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-14T11:24:09.000Z",
    "title": "EY invests $1.4 billion in AI tech, launches new platform ",
    "url": "https://cointelegraph.com/news/ernst-young-invests-billions-ai-launches-new-platform",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/5dc7d680-001c-4ea0-a614-cc9e09bd4d8b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Ernst & Young revealed billions of dollars of investments into AI technologies and the launch of a new AI-powered platform for its clients and internal personnel.  </p>\n                    <p><p>Ernst &amp; Young (EY), one of the Big Four global professional services providers, <a href=\"https://www.ey.com/en_gl/news/2023/09/ey-announces-launch-of-artificial-intelligence-platform-ey-ai-following-us-1-4b-investment\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> its development of a new artificial intelligence (AI)-powered platform for its clients. </p><p>In a post on Sept. 13, the London-based firm revealed it has invested $1.4 billion into AI technologies for its new EY.ai platform that aims to help organizations adopt AI. The platform is based on EY's own large language model (LLM) EY ai EYQ.</p><p>It said that a collaboration with Microsoft provided EY with early access to Azure OpenAI capabilities, including GPT-3 and GPT-4. EY also jointly invested with Dell in Dell Generative AI Solutions, which aims to simplify the adoption of generative AI with LLMs.</p><p>The billions in AI investments will also go to embedding the technology into existing EY services such as EY Fabric, which is already used by 60,000 clients with millions of unique users, along with additional acquisition of technology supporting cloud and automation.</p><p>Carmine Di Sibio, the global chairman and CEO of EY, commented on the development saying the moment is “now” for AI.</p><blockquote>“The adoption of AI is more than a technology challenge… It’s about unlocking new economic value responsibly to realize the vast potential of this technological evolution.”</blockquote><p>EY has long been anticipating the boom in AI integration, as in 2018 the company introduced an “extensive” AI, data and analytics learning badge curriculum and credential program. </p><p><strong><em><u>Related:</u></em></strong></p><p>According to their announcement, 100,000 credentials have been awarded to EY people to date and the company has compiled 4,200 technology-focused team members. Di Sibio said:</p><blockquote>“Every business is considering how it will be integrated into operations and its impact on the future.”</blockquote><p>EY has been proactive in integrating emerging technologies into its internal and external operations. Last October, it assisted a <a href=\"https://cointelegraph.com/news/norwegian-gov-t-agency-opens-metaverse-office-in-collaboration-with-ey\">governmental agency in Norway</a> to open an office in the metaverse. </p><p>However, EY is only one of many major global enterprises taking the initiative to integrate or promote AI services. On Sept. 13 Goldman Sachs dismissed the sentiment that the current hype around<a href=\"https://cointelegraph.com/news/goldman-sachs-dismisses-ai-bubble-predicts-upcoming-revolution\"> AI is only a bubble waiting to burst</a>, but rather predicts an upcoming “revolution.” </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tencents-ai-leviathan-83m-scam-busted-chinas-influencer-ban-asia-express/\"><strong><em>Tencent’s AI leviathan, $83M scam busted, China’s influencer ban: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-14T11:20:29.000Z",
    "title": "Web3 ecosystem made 'good strides' in changing climate narrative, exec says",
    "url": "https://cointelegraph.com/news/web3-ecosystem-made-good-strides-changing-climate-narrative-exec-says",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/5b7c497f-74af-4e98-ad06-2c1bc5d1c771.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Celo CEO Marek Olszewski said that blockchains can provide transparency and real-time verification on the state of carbon credits. </p>\n                    <p><p>While moving to proof-of-stake (PoS) contributes to changing the narrative of blockchains being harmful to the environment, there are still many things that the Web3 ecosystem can do to tackle climate change, according to Marek Olszewski, the CEO of Celo, an Ethereum layer-2 scaling solution. </p><p>Cointelegraph editor Zhiyuan Sun spoke with Olszewski about the threat of climate change, the benefit of using blockchain-based systems for carbon offsets and various ways that projects can offset their carbon footprint. </p><p>According to Olszewski, as climate change remains a threat to humanity, companies and projects are steering towards becoming carbon neutral. He said: </p><blockquote>“Climate change is still a systemic threat to our species. I think as a society we kind of owe it to ourselves to do anything that we can. And I suspect that every project and every company in the next ten years will probably move to be carbon neutral.”</blockquote><p>The Celo executive believes that the broader Web3 ecosystem has been making “really good strides” in terms of being able to change the narrative around blockchain’s impact on the environment. Last year, the community <a href=\"https://cointelegraph.com/news/community-celebrates-the-merge-by-dropping-eth-inspired-art-and-music\">celebrated the Ethereum Merge</a>, the blockchain’s shift from the energy-intensive proof-of-work (PoW) consensus to the more environmentally friendly proof-of-state (PoS) mechanism. </p><p>Olszewski believes that the Merge as well as the move from various teams within Web3 to offset or commit to offsetting their carbon footprints helps the space in two ways. Firstly, it attracts people who were previously put off by those who argue that blockchains are not good for the environment. Secondly, the executive highlighted that this leaves room for innovation within the regenerative finance (ReFi) ecosystem. </p><p>“At the very least, I think we've started to shift the narrative, which I think is both really good for the crypto industry because I think it pulls more people in [...] and it's created a safe space to innovate within the ReFi ecosystem,” Olszewski said. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/how-blockchains-can-solve-greenwashing-and-contribute-to-climate-action\"><strong><em>How blockchains can solve greenwashing and contribute to climate action</em></strong></a></p><p>Apart from these, the executive also mentioned some benefits of having an on-chain carbon offset system compared to traditional methods. Olszewski said that traditional carbon credit systems are plagued by a lack of transparency. The executive noted that with blockchain, there can be real-time transparency and verification that the carbon offsets are still valid. He said: </p><blockquote>“Being able to tie satellite data through an oracle on-chain, you can bring that information and see with certainty that the carbon offsets are doing what they claim they would do.”</blockquote><p>When asked about carbon credits and how blockchain-based projects can offset their carbon footprint, the executive gave several examples. According to Olszewski, apart from planting trees, which is the common way to offset carbon emissions, the executive mentioned restoring habitat for species, direct air capture sequestration and the use of biochar as some of the other ways to offset carbon emissions. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/green-consumers-want-supply-chain-transparency-blockchain/\"><strong><em>Green consumers want supply chain transparency via blockchain</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-14T11:35:49.000Z",
    "title": "Bitcoin energy use up but carbon emissions drop, Bloomberg crypto analyst reveals",
    "url": "https://cryptoslate.com/insights/bitcoin-energy-use-up-but-carbon-emissions-drop-bloomberg-crypto-analyst-reveals/",
    "description": "<p>Quick Take Bloomberg crypto market analyst Jamie Coutts stated that carbon emissions have declined despite an increase in Bitcoin energy usage. Over the last few years, the Bitcoin hash rate &#8211; the computational power dedicated to Bitcoin mining &#8211; has quadrupled. Surprisingly, this substantial increase has only resulted in a slight 6.9% rise in carbon [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-energy-use-up-but-carbon-emissions-drop-bloomberg-crypto-analyst-reveals/\">Bitcoin energy use up but carbon emissions drop, Bloomberg crypto analyst reveals</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-14T11:30:14.000Z",
    "title": "NFT-Based Firm Remilia Corporation Sues Independent Contractors Accused of Siphoning $1 Million",
    "url": "https://news.bitcoin.com/nft-based-firm-remilia-corporation-sues-independent-contractors-accused-of-siphoning-1-million/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2100868021-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"NFT-Based Firm Remilia Corporation Sues Independent Contractors Accused of Siphoning $1 Million\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2100868021-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2100868021-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2100868021-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2100868021-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2100868021-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2100868021-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2100868021.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Remilia Corporation, a digital art and non-fungible token (NFT)-related business, has filed a lawsuit against three independent contractors whom it accuses of siphoning $1 million from the company. Founder Krishna Okhandiar denied claims the three had at any point &#8220;sought equity shares in Remilia while negotiating their contracts.&#8221; Trio &#8216;Failed to Perform at an Adequate [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T11:33:11.000Z",
    "title": "HubSpot Unveils Cutting-Edge AI Tools to Empower Small Businesses",
    "url": "https://www.cryptopolitan.com/hubspot-unveils-cutting-edge-ai-tools/",
    "description": "In a significant move to revolutionize the way small businesses engage with their audience, HubSpot has introduced two groundbreaking tools: &#8220;Content Assistant&#8221; and &#8220;ChatSpot.ai.&#8221; These innovative solutions represent HubSpot&#8217;s ongoing commitment to harnessing the power of artificial intelligence (AI) to empower businesses and enhance their efficiency in content creation and customer interactions. HubSpot&#8217;s AI journey ... <a title=\"HubSpot Unveils Cutting-Edge AI Tools to Empower Small Businesses\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hubspot-unveils-cutting-edge-ai-tools/\" aria-label=\"More on HubSpot Unveils Cutting-Edge AI Tools to Empower Small Businesses\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T11:18:58.000Z",
    "title": "Brian Armstrong urges legal path for DeFi amid CFTC actions",
    "url": "https://www.cryptopolitan.com/brian-armstrong-urges-legal-path-for-defi/",
    "description": "Coinbase CEO Brian Armstrong has thrown his support behind decentralized finance (DeFi) and called for a legal precedent in its favor. In a recent social media post, Armstrong urged DeFi protocols to explore legal actions in court to establish their legitimacy in the eyes of the law. He argued that the current approach of regulatory ... <a title=\"Brian Armstrong urges legal path for DeFi amid CFTC actions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/brian-armstrong-urges-legal-path-for-defi/\" aria-label=\"More on Brian Armstrong urges legal path for DeFi amid CFTC actions\">Read more</a>"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-14T11:23:13.000Z",
    "title": "5% APR on Bitcoin? Yes It’s Possible. Find Out How.",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/5-apr-on-bitcoin-yes-its-possible-find-out-how/",
    "description": "<p>DeFi leverages blockchain technology to eliminate intermediaries. Putting the power of finance back in the hands of the people. So now, there are some DeFi protocols where you can earn cryptos. Thanks to this niche, different exchanges are also offering staking with interesting rates.  In this article, you will discover very interesting ways you can [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/5-apr-on-bitcoin-yes-its-possible-find-out-how/\">5% APR on Bitcoin? Yes It’s Possible. Find Out How.</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-14T11:20:20.000Z",
    "title": "North Korea Steals $54M from CoinEx; Lazarus Group Strikes Again",
    "url": "https://coinedition.com/north-korea-steals-54m-from-coinex-lazarus-group-strikes-again/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/CoinEx_Charity_Empowers_Education_Through_Charitable_Donations.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"CoinEx_Charity_Empowers_Education_Through_Charitable_Donations\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/CoinEx_Charity_Empowers_Education_Through_Charitable_Donations.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/CoinEx_Charity_Empowers_Education_Through_Charitable_Donations-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/CoinEx_Charity_Empowers_Education_Through_Charitable_Donations-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/CoinEx_Charity_Empowers_Education_Through_Charitable_Donations-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/CoinEx_Charity_Empowers_Education_Through_Charitable_Donations-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>North Korea is allegedly responsible for attacking the crypto exchange CoinEx and stealing $54 million. ZachXBT, an on-chain detective, shared the news on X (Twitter). The hackers were also responsible for the $41 million Stake hack after they accidentally connected their addresses on OP and Polygon. Lazarus Group is a cybercrime organization run by the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/north-korea-steals-54m-from-coinex-lazarus-group-strikes-again/\">North Korea Steals $54M from CoinEx; Lazarus Group Strikes Again</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]