[
  {
    "source": "Cryptopolitan",
    "date": "2023-10-07T11:42:51.000Z",
    "title": "Choosing the perfect gaming PC: A comprehensive guide",
    "url": "https://www.cryptopolitan.com/choosing-the-perfect-gaming-pc/",
    "description": "Gaming PCs hold a unique allure compared to gaming consoles. The inherent advantages lie in their lightning-fast frame rates, ultra-high resolutions, and lifelike graphics. These formidable machines offer the capacity for continuous internal component upgrades, ensuring gamers stay at the forefront of technology for years to come. For those daunted by the prospect of building ... <a title=\"Choosing the perfect gaming PC: A comprehensive guide\" class=\"read-more\" href=\"https://www.cryptopolitan.com/choosing-the-perfect-gaming-pc/\" aria-label=\"More on Choosing the perfect gaming PC: A comprehensive guide\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-07T11:40:08.000Z",
    "title": "Inside Job Suspected As Huobi Wallet Falls Victim To $263,000 Exploit",
    "url": "https://www.newsbtc.com/huobi-ht/inside-job-suspected-as-huobi-wallet-falls-victim-to-263000-exploit/",
    "description": "According to multiple reports, iToken, formerly known as Huobi Wallet, fell victim to a crypto heist in the last week, leading to the loss of $263,000 worth of users&#8217; assets. The incident draws much attention following recent police investigations into some of Huobi&#8217;s former staff. Related Reading: TRON’s Justin Sun Reassures Crypto Community That Huobi Exchange Is Solvent $263,000 Drained From Huobi Wallet &#8211; Could There Be An Internal Involvement? Providing more insight on this latest exploit, prominent security firm Peckshield reported that this event occurred on October 3, with the drainer stealing a total of $263,000 USDT and 92 TRX minted on the Tron network. Thereafter, the bad actor proceeded to swap these stolen funds for approximately 2.9 million TRX, of which 1.4 million TRX was transferred to the ChangeNOW exchange, and 1.5 million TRX was moved to Binance.  Currently, there are speculations that this heist was orchestrated by the internal staff of Huobi as such development would be unprecedented. In September, the Chinese Police were reported to have arrested a former Huobi team member for implanting a Trojan horse virus that resulted in the exposure of the private keys and mnemonic phrases of some iToken users. Launched in 2018, iToken functions as a professional DeFi wallet, which enables the storage of various digital assets across multiple networks. It was initially known as the Huobi wallet, as earlier stated, but was rebranded iToken in 2022, following a $200 million investment from the Huobi Group. Related Reading: Tron’s Justin Sun Mulls Over Making A Move On FTX’s Crypto Stash, Here’s Why Growing Controversy Around Huobi?  In addition to speculations of insider involvement in this recent heist, Huobi, now rebranded as HTX, has been in the news recently and not for positive reasons. On September 25, the exchange fell victim to a hack that drained 5,000 ETH worth $7.9 million. However, the exchange’s advisor and Tron founder, Justin Sun, soon came out to assure users of total asset recovery and security of the exchange’s operation.  However, this week, crypto expert Dylan LeClair wrote a thread on X accusing the Tron Visioneer of creating a “web of deception.&#8221; This marks the second time in recent weeks Justin Sun has been accused of malicious dealings involving users&#8217; assets on Huobi. According to LeClair, ever since Sun acquired a controlling stake in Huobi in late 2022, the amount of USDT held on the exchange has been gradually replaced by stUSDT, a receipt token for staking USDT. The stUSDT token is controlled by Justin Sun and is supposedly designed to invest in real-world assets such as US government bonds. However, LeClair stated that on-chain analysis and transactions show no such investment.  The crypto analyst also drew attention to &#8220;worrying&#8221; transactions by Justin Sun involving JustLend, a Tron-based DeFi lending platform,  and other stablecoins, including USDT and USDC, before concluding that the Tron Founder is maliciously moving USD liquidity out of the crypto space.  At the time of writing, HTX’s native token, HT, hovers around $2.36 with a 0.74% gain in the last day, according to data from CoinMarketCap. Meanwhile, HT’s daily trading volume is up by 10.64% and is valued at $3.47 million HT trading at $2.34 on the hourly chart &#124; Source: HTUSDT chart on Tradingview.com Featured image from Bloomberg, chart from Tradingview"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-07T11:55:00.000Z",
    "title": "Economy Enters Into Recovery Phase: Will Cryptos Pump Soon?",
    "url": "https://coinedition.com/economy-enters-into-recovery-phase-will-cryptos-pump-soon/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/exchange-traded-fund-ETF.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/exchange-traded-fund-ETF.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/exchange-traded-fund-ETF-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/exchange-traded-fund-ETF-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/exchange-traded-fund-ETF-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/exchange-traded-fund-ETF-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/exchange-traded-fund-ETF-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/exchange-traded-fund-ETF-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/exchange-traded-fund-ETF-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/exchange-traded-fund-ETF-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/exchange-traded-fund-ETF-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/exchange-traded-fund-ETF-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/exchange-traded-fund-ETF-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/exchange-traded-fund-ETF-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/exchange-traded-fund-ETF-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/exchange-traded-fund-ETF-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/exchange-traded-fund-ETF-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Raoul Pal, the co-founder and CEO of Real Vision, predicted that Bitcoin (BTC) and Ethereum (ETH) Spot exchange-traded funds (ETFs) could be approved as early as Q4 this year. In an interview with Coin Bureau Clips, he also mentioned that the global economy is busy slowing down, and may continue to do so for the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/economy-enters-into-recovery-phase-will-cryptos-pump-soon/\">Economy Enters Into Recovery Phase: Will Cryptos Pump Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-07T11:45:45.000Z",
    "title": "Crypto Trader Says Avalanche (AVAX) To Surge by Double Digits, Updates Outlook on Solana (SOL)",
    "url": "https://dailyhodl.com/2023/10/07/assignment-crypto-trader-says-avalanche-avax-to-surge-by-double-digits-updates-outlook-on-solana-sol/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/Crypto-Trader-Says-Avalanche.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/Crypto-Trader-Says-Avalanche.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/Crypto-Trader-Says-Avalanche.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/Crypto-Trader-Says-Avalanche.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/Crypto-Trader-Says-Avalanche.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/Crypto-Trader-Says-Avalanche.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/Crypto-Trader-Says-Avalanche.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist is predicting Avalanche (AVAX) will undergo a massive surge due to one main reason. Pseudonymous crypto analyst Altcoin Sherpa tells his 196,600 followers on the social media platform X that the Ethereum (ETH) rival could increase by more than 12% from its current value. The analyst says that Avalanche is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/07/assignment-crypto-trader-says-avalanche-avax-to-surge-by-double-digits-updates-outlook-on-solana-sol/\">Crypto Trader Says Avalanche (AVAX) To Surge by Double Digits, Updates Outlook on Solana (SOL)</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]