[
  {
    "source": "Cointelegraph",
    "date": "2023-09-11T04:57:35.000Z",
    "title": "Arbitrum's fraud proofs haven't been used in the two years since it launched",
    "url": "https://cointelegraph.com/news/arbitrums-fraud-proofs-havent-been-used-since-it-launched",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/ae4f3320-4e1d-4ffb-a53a-0bbeead11e77.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Offchain Labs co-founder Ed Felten said there were one or two fraud challenges submitted on a version of Arbitrum running on the Ethereum proof-of-work fork after the Merge, which was defeated.</p>\n                    <p><p>Not a single fraud proof has been submitted on Arbitrum since it first launched its mainnet with the built-in security feature in August 2021, according to Ed Felten, co-founder and chief scientist of the Arbitrum-building Offchain Labs.</p><p><a href=\"https://cointelegraph.com/learn/arbitrum-the-next-generation-layer-2-for-ethereum\">Operating as an Ethereum layer-2</a>, Arbitrum’s interactive, multi-round <a href=\"https://medium.com/offchainlabs/interactive-fraud-proofs-arbitrums-secret-sauce-debc3b019418\" target=\"_blank\" rel=\"noopener nofollow\">fraud proofs</a> work by allowing a layer-1 verifier contract to decide whether the challenger’s fraud-proof submission is valid. If so, the fraudulent validator’s stake is slashed. </p><p>Fraud proofs are submitted by challenging validators when it considers another validator to have fraudulently or otherwise incorrectly assembled an incoming batch of transactions into the next block.</p><p>However, Arbitrum’s mainnet is yet to see a fraud-proof attempt let alone a successful challenge, Felten told Cointelegraph at Korean Blockchain Week on Sept. 4:</p><blockquote>“Not on mainnet. We did have one or two on Ethereum proof-of-work (POW). After the Merge, [...] there was a version of Arbitrum running on the Ethereum POW fork and somebody did try to steal all the data and there was a successful challenge which defeated that.”</blockquote><p>Felten said few fraud proof attempts have been made because malicious-intended validators are risk losing their entire stake.</p><p>“If any one person notices it and disputes your claim then you will surely lose your stake, so there’s a stronger disincentive to try,” Felten added.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Both Arbitrum and Optimism operate as optimistic rollups!<br><br>However, Optimism and Arbitrum differ in their approaches to fraud-proof mechanisms.<br><br>Arbitrum: multi-round → longer confirmation times, more secure<br>Optimism: single-round → faster<br><br>4/ <a href=\"https://t.co/mp0Nj86Fxz\">pic.twitter.com/mp0Nj86Fxz</a></p>&mdash; The Smart Ape  (@the_smart_ape) <a href=\"https://twitter.com/the_smart_ape/status/1697580241743479152?ref_src=twsrc%5Etfw\">September 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Felten said there’s currently a <a href=\"https://cointelegraph.com/news/ethereum-staking-services-agree-self-limit-validators\">permission set of validators</a> — roughly 12 — that participate in the fraud proof game.</p><p>He also added that Arbitrum is rolling out a new iteration of the fraud proofs called “BOLD” protocol — (Bounded Liquidity Delay) which he says gives Arbitrum a faster guarantee for challenges.</p><blockquote>“In the current version [...] an adversary who's willing to sacrifice multiple stakes can arrange to cause “N” weeks of delay if they're willing to sacrifice “N” stakes [...] But the BOLD protocol says no matter how many stakes they sacrifice, they'll be defeated in about eight days.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/arbitrum-stylus-game-changer-for-evms-artbitrum-founder\"><strong><em>Arbitrum founder says Stylus is a game changer for EVMs </em></strong></a></p><p>Arbitrum’s BOLD protocol was rolled out by Offchain Labs on Aug. 4.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">After months in dev, we’re announcing BOLD (Bounded Liquidity Delay), a new dispute protocol that enables permissionless validation for Arbitrum chains, potentially removing the need for permissioned validation, dramatically improving decentralization. <a href=\"https://t.co/SHegVRGqXf\">https://t.co/SHegVRGqXf</a></p>&mdash; Offchain Labs (@OffchainLabs) <a href=\"https://twitter.com/OffchainLabs/status/1687137574052143116?ref_src=twsrc%5Etfw\">August 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Felten said Arbitrum’s fraud proof feature <a href=\"https://cointelegraph.com/learn/permissioned-blockchain-vs-permissionless-blockchain-key-differences\">will soon be permissionless,</a> allowing anyone to push towards ensuring the correctness of the chain when challenges are made.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ethereum-is-woefully-undervalued-but-growing-more-powerful-defi-dad-hall-of-flame/\"><strong><em>DeFi Dad, Hall of Flame: Ethereum is ‘woefully undervalued’ but growing more powerful</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-11T04:50:11.000Z",
    "title": "Coinbase responds to reports suggesting it's ceasing services in India",
    "url": "https://cointelegraph.com/news/coinbase-india-responds-to-rumors-ceasing-services",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/6b9829cf-5af5-4e96-8112-8ce16fce205a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A Coinbase spokesperson cleared some of the confusion after a circulating rumor suggested that it would be shuttering all services for Indian customers. </p>\n                    <p><p>Coinbase has provided information that seemingly contrasts a media report suggesting that it would soon halt all operations for its Indian customers.</p><p>According to a Sept. 11 <a href=\"https://techcrunch.com/2023/09/10/coinbase-india/\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from TechCrunch, Coinbase India users were reportedly warned via email that all services would be discontinued by Sept. 25, and were urged to to remove any funds that remained on the exchange.</p><p>However, it is understood that the notice was not aimed at all Indian customers and was instead aimed at those breaching the exchange's standards. </p><p>\"We are reaching out to inform you that we will be discontinuing all Coinbase Retail services linked to your above-mentioned account, as we will be disabling access for the retail accounts that no longer meet our updated standards for these services,\" according to an email on Sept. 8, shared by a Coinbase spokesperson to Cointelegraph.</p><p>\"It is possible that during the course of a recent routine review of our systems, some accounts may have been identified that no longer meet our updated standards. We will therefore be disabling these accounts, and allow customers to update their information at a later date,\" the spokesperson added.</p><blockquote>\"Affected users’ funds remain safe with us, and they continue to be able to withdraw their balances and send to other crypto service providers until 25 September.\"</blockquote><p>Meanwhile, Coinbase has prevented Indian users from signing up to its exchange, instead prompting them to download its wallet application, Coinbase Wallet.</p><p>Despite a strong push from the largest U.S.-based cryptocurrency exchange, which saw its venture capital arm Coinbase Ventures, <a href=\"https://cointelegraph.com/news/coinbase-to-invest-in-indian-crypto-and-web3-amid-tax-regulation-clarity\">invest millions into the local sector</a> — it has struggled to gain favor with the authorities.</p><p>On April 11 last year, Coinbase <a href=\"https://cointelegraph.com/news/coinbase-suspends-crypto-payment-services-days-after-india-launch\">halted payment services through</a> United Payments Interface (UPI) on its platform for Indian users just three days after its launch in the South Asian subcontinent, due to pressure from local regulators.</p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/nft-collapse-and-monster-egos-feature-in-new-murakami-exhibition/\">NFT collapse and monster egos feature in new Murakami exhibition</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-09-11T04:50:11.000Z",
    "title": "Coinbase responds to reports suggesting it's ceasing services in India",
    "url": "https://cointelegraph.com/news/coinbase-india-responds-to-rumors-ceasing-services",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/6b9829cf-5af5-4e96-8112-8ce16fce205a.jpg\"></p><p>A Coinbase spokesperson cleared some of the confusion after a circulating rumor suggested that it would be shuttering all services for Indian customers. </p>\n            "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-11T05:00:48.000Z",
    "title": "Polygon (MATIC) Unveils Game-Changing Upgrades to Become the Fastest Blockchain in the World",
    "url": "https://www.crypto-news-flash.com/polygon-matic-unveils-game-changing-upgrades-to-become-the-fastest-blockchain-in-the-world/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-matic-unveils-game-changing-upgrades-to-become-the-fastest-blockchain-in-the-world",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-06T153434.547.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-06T153434.547.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-06T153434.547-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Polygon (MATIC) Prepares for Asia Crypto Week, Hinting at a Major Announcement. Polygon 2.0, zkEVM, and the Polygon Chain Development Kit (CDK) are set to revolutionize the Web3.0 landscape. Polygon Labs is creating a buzz in the cryptocurrency community as it gears up for a significant appearance at Asia Crypto Week. With promises of major [...]"
  }
]