[
  {
    "source": "Bitcoin.com",
    "date": "2023-09-05T03:30:43.000Z",
    "title": "JPMorgan Analyzes De-Dollarization Risk, Potential for Chinese Yuan to Displace US Dollar as Reserve Currency",
    "url": "https://news.bitcoin.com/jpmorgan-analyzes-de-dollarization-risk-potential-for-chinese-yuan-to-displace-us-dollar-as-reserve-currency/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/jpmorgan-china-us-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"JPMorgan Analyzes De-Dollarization Risk, Potential for Chinese Yuan to Displace US Dollar as Reserve Currency\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/jpmorgan-china-us-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/jpmorgan-china-us-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/jpmorgan-china-us-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/jpmorgan-china-us-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/jpmorgan-china-us-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/jpmorgan-china-us-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/jpmorgan-china-us.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />JPMorgan has provided an analysis of the risks of de-dollarization and the potential for the Chinese yuan to displace the U.S. dollar as the world’s reserve currency. The global investment bank says the renminbi could assume “some of the current functions of the dollar among non-aligned countries and China’s trading partners.” JPMorgan on De-Dollarization and [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-05T03:37:00.000Z",
    "title": "Bitcoin Price Could See Downside Thrust Before The Bulls Take A Stand",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-downside-thrust-25000/",
    "description": "Bitcoin price is struggling to recover above $26,200. BTC is again moving lower and there could be a sharp decline below $25,500 in the near term. Bitcoin failed to recover above the $26,200 and $26,500 levels. The price is trading below $26,000 and the 100 hourly Simple moving average. There is a major bearish trend line forming with resistance near $25,650 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could accelerate lower below the $25,500 and $25,400 levels in the near term. Bitcoin Price Resumes Slide Bitcoin price attempted a recovery wave from the $25,350 zone. However, BTC struggled to recover above the $26,200 pivot level and remained in a bearish zone. The price is again moving lower and trading below the $26,000 level. There are a lot of bearish signs emerging below $26,000 and the 100 hourly Simple moving average. Besides, there is a major bearish trend line forming with resistance near $25,650 on the hourly chart of the BTC/USD pair. Immediate resistance on the upside is near the $25,650 level and the trend line. The first major resistance is near the $26,000 level or the 23.6% Fib retracement level of the downward move from the $28,150 swing high to the $25,332 low. Source: BTCUSD on TradingView.com The next major resistance is now near the $26,200 level. A clear move above the $26,200 level might start a decent recovery wave toward $26,500. The next major resistance is near $27,000, above which there could be a decent increase. In the stated case, the price could test the $27,800 level. More Losses In BTC? If Bitcoin fails to clear the $26,000 resistance, it could continue to move down. Immediate support on the downside is near the $25,350 level. The next major support is near the $25,000 level. A downside break below the $25,000 level might send the price further lower. In the stated case, the price could drop toward $24,500. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $25,350, followed by $25,000. Major Resistance Levels – $25,650, $26,000, and $26,200."
  }
]