[
  {
    "source": "Cointelegraph",
    "date": "2023-07-31T18:51:33.000Z",
    "title": "German government watchdog launched Worldcoin probe in November 2022: Report",
    "url": "https://cointelegraph.com/news/german-government-watchdog-launched-worldcoin-probe",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/35a8b5c3-54ad-4fd2-9724-c89a10ac3241.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Authorities in the United Kingdom and France have also reportedly cited concerns over Worldcoin's data collection methods, which involve collecting iris scans from users.</p>\n                    <p><p>The Bavarian State Office for Data Protection Supervision, or BayLDA, reportedly began an investigation into human identity verification project Worldcoin based on concerns over biometric data.</p><p>According to a July 31 Reuters report, the German data watchdog <a href=\"https://www.reuters.com/technology/german-data-watchdog-probing-worldcoin-crypto-project-official-says-2023-07-31/\" target=\"_blank\" rel=\"noopener nofollow\">launched</a> a probe into Worldcoin’s activities starting in November 2022. Worldcoin, a project started with the intention of distinguishing real people from bots by providing retinal scans for identity verification, had more than 2 million sign-ups prior to the launch of its token in July.</p><p>This retinal scan data reportedly drew the attention of BayLDA. President Michael Will reportedly said the technologies were neither “established nor well analysed” for use in transferring financial information, leading to a potential risk for Worldcoin users.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Authentication vs verification<br><br>Authenticating ownership (e.g. FaceID) uses biometrics as a password, where a 1:1 comparison is performed against a saved ID template.<br><br>Verifying uniqueness compares biometrics against (up to) billions of registered users in a 1:N comparison. <a href=\"https://t.co/u2cfHkKFI9\">pic.twitter.com/u2cfHkKFI9</a></p>&mdash; Worldcoin (@worldcoin) <a href=\"https://twitter.com/worldcoin/status/1685938940820275200?ref_src=twsrc%5Etfw\">July 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/worldcoin-stuck-downside-wld-price-analysis\"><strong><em>Worldcoin stuck after 70% drop from peak — More downside for WLD price?</em></strong></a></p><p> In addition to reported inquiries from the BayLDA, the French National Commission on Informatics and Liberty has reportedly <a href=\"https://cointelegraph.com/news/french-privacy-watchdog-questions-worldcoin-s-data-collection-method-report\">called Worldcoin’s data collection</a> methods “questionable”. The Information Commissioner’s Office in the United Kingdom has <a href=\"https://cointelegraph.com/news/worldcoin-may-face-uk-data-regulators-enquiry-days-after-launch-report\">cited similar concerns</a> over the project. Tools For Humanity, the company behind Worldcoin, has a subsidiary in Germany, but the project has been attracting interest from users in many countries. </p><p>Since launching the token in July, Worldcoin co-founder <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-altman\">Sam Altman</a> reported a new person was “getting verified every 8 seconds” through iris scans around the world. Major players including Ethereum co-founder Vitalik Buterin and Block CEO Jack Dorsey have already <a href=\"https://cointelegraph.com/news/worldcoin-launch-divides-crypto-community\">weighed in on the project</a>, as many crypto users have pointed to potential benefits including repaying those affected by the collapses of Three Arrows Capital and FTX.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ftx-2-0-coming-up-multichain-fud-and-worldcoin-raises-six-figures-hodlers-digest-may-21-27/\"><strong><em>FTX 2.0 coming up, Multichain FUD and Worldcoin raises $115M: Hodler’s Digest, May 21-27</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-31T18:45:35.000Z",
    "title": "Could a new surge in TUSD supply trigger another Bitcoin rally?",
    "url": "https://cryptoslate.com/could-a-new-surge-in-tusd-supply-trigger-another-btc-rally/",
    "description": "<p>The circulating supply of TrueUSD (TUSD), a highly liquid stablecoin, has seen a significant increase of almost $250 million between July 29 and July 30. While this might appear as a minor uptick for a stablecoin with a circulating supply exceeding $3 billion, historical data suggests that notable price rallies have often followed such spikes [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/could-a-new-surge-in-tusd-supply-trigger-another-btc-rally/\">Could a new surge in TUSD supply trigger another Bitcoin rally?</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-31T19:00:00.000Z",
    "title": "Bitcoin Price Analysis:  4% Pullback in July - 1 August 2023",
    "url": "https://cryptodaily.co.uk/2023/07/bitcoin-price-analysis-4-per-cent-pullback-in-july-1-august-2023",
    "description": "<p>BTC/USD 4% Pullback in July:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 1 August 2023</p>\n<p>Bitcoin (BTC/USD) awaited fresh technical guidance early in the Asian session as the pair continued to trade below the 30000 figure after peaking around the 31862.21 area in July.&nbsp;&nbsp; The market depreciated approximately 4% in the month of July and has appreciated nearly 76% year-to-date.&nbsp; Following recent selling pressure around the 29526.99 area, downward pressure increased around the 29469.84 area, right around a previous upside price objective associated with buying pressure around the 28850 and 28981.16 levels. &nbsp;&nbsp;Stops were elected below the 29259.93 area during the depreciation, a downside price objective related to recent selling pressure.&nbsp; Below the market, downside price objectives include the 28213, 28137, 27757, 27430, 27338, 27312, 26348, and 26199 levels.&nbsp; &nbsp;Also, the 28095.44 area represents the 23.6% retracement of the historical depreciating range from 69000 to 15460.&nbsp;&nbsp;</p>\n<p>Following recent upside activity, areas of technical support and potential buying pressure include the 28306, 27466, 26428, and 26272 levels.&nbsp; Traders are monitoring the recent depreciating range from 31862.21 to 28850 with upside retracement levels around the 30000, 30356, 30711, 31151, and 31217 areas.&nbsp; Above the market, upside price objectives include the 30526, 30611, 30762, and 31145 areas.&nbsp; Upside price objectives related to other levels of buying pressure include the 32125 and 33569 areas, and Stops are cited above additional upside price objectives around the 32043, 34531, 34658, and 35912 areas.&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 100-bar MA (hourly) and above the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 29371.01 and the&nbsp;100-bar MA&nbsp;(Hourly) at 29320.87.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is Bullishly above MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bearishly below MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T19:02:33.000Z",
    "title": "Nigeria’s SEC declares Binance’s operations illegal for the second time",
    "url": "https://www.cryptopolitan.com/nigerias-sec-declares-binances-operations-illegal-for-the-second-time/",
    "description": "The Securities and Exchange Commission (SEC) of Nigeria has declared that the activities of the cryptocurrency exchange Binance are illegal within the country. The SEC issued a notice on Friday, specifically referring to the crypto exchange&#8217;s website, stating that Binance&#8217;s operations are neither registered nor regulated by the commission. This declaration reiterates a warning issued ... <a title=\"Nigeria&#8217;s SEC declares Binance&#8217;s operations illegal for the second time\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nigerias-sec-declares-binances-operations-illegal-for-the-second-time/\" aria-label=\"More on Nigeria&#8217;s SEC declares Binance&#8217;s operations illegal for the second time\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-31T18:54:00.000Z",
    "title": "Cryptocurrency and environment: How digital coins affect the planet",
    "url": "https://crypto.news/cryptocurrency-and-environment-how-digital-coins-affect-the-planet/",
    "description": "The growing popularity of cryptocurrencies has led to more people looking into how much energy they use and how they affect the environment. Let&#8217;s delve into the environmental impact of well-known coins, looking at the technology behind them and the&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-31T19:00:55.000Z",
    "title": "Bitcoin Crucial Moment: Will Resistance At $29,500 Trigger A Sell-Off Or Surge?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-crucial-moment-will-resistance-at-29500-trigger-a-sell-off-or-surge/",
    "description": "Bitcoin (BTC) has been trading in a tight range for quite some time now, with bulls and bears engaged in a tug-of-war over key support and resistance levels.  The recent move above $29,500 has provided some hope for the bulls, but so far, they have been unable to gather enough momentum to push prices higher. Bitcoin Struggles To Break Above Key Moving Average According to Material Indicators, a leading market analysis firm, the key to a bullish breakout in the BTC market is for the coin to print candles above the 100-week moving average (MA). However, BTC has yet to test this level, and bulls have struggled to maintain the current range. The 50-day MA has been a crucial support level, with BTC testing it for today&#8217;s eighth consecutive day. While the 50-day MA has managed to hold, resistance at $29,500 has been replenishing, posing a challenge for the bulls.  If they cannot clear this level, Material Indicators expects a run at the lows with $28,300 as the last line of defense. The big question for BTC investors is whether the coin will bounce from the $28,000 zone or extend to $25,000 and beyond. All of these moves are possible, but the mystery lies in what order and timeline they will play out. Related Reading: Breaking: HEX Token Plummets 25% Following SEC Lawsuit Against Founder Richard Heart As the market approaches the monthly close, all eyes are on the potential for volatility in the BTC market. Traders and investors closely monitor the price action and indicators to prepare for potential moves. BTC&#8217;s Store Of Value Narrative Solidified The recent changes in the structure of Bitcoin&#8217;s trading volume have sparked a debate among cryptocurrency investors and traders. According to Crypto Quant, since January 2023, the Spot vs. Derivatives volume ratio has dropped from 35% to 6%, resulting in a new era of low volatility in the cryptocurrency market. This decrease in spot volume means that investors are holding onto their Bitcoins instead of selling them, as Bitcoin is now considered a valuable asset, similar to digital gold.  This is seen in the BTC: Binary Coin Days Destroyed (CDD) chart, which shows that since the start of the year, there have been no active sales among the cohort of long-term holders (LTHs). Moreover, the total Simple Moving Average (SMA)-7d weekly trading volume of Bitcoin across all exchanges has dropped from 2.5 million BTC in March to less than 600 thousand BTC in July, representing a more than 75% reduction over the specified period.  While some may see this trend as a crisis, Crypto Quant believes it is a sign of the cryptocurrency market maturing and becoming more stable and predictable. However, this trend could lead to significant changes in the Bitcoin market. A reduction in spot volume may result in a reduction in liquidity, which could increase the demand and price of Bitcoin. The market currently lacks a new wave of optimism, and the question is, where will it come from? Related Reading: US Presidential Candidate Defends Bitcoin, Calls Out Environmental Critics The answer may lie in the growing institutional interest in Bitcoin and other cryptocurrencies. Several major financial institutions, such as Fidelity, Blackrock, and Morgan Stanley, have recently applied for Bitcoin Spot Exchange-Traded Funds (ETFs).  This institutional interest could bring a new wave of optimism to the cryptocurrency market, increasing demand and increasing prices. Bitcoin is facing challenges in its attempt to regain its 50-day moving average (MA) as a support level instead of being another resistance line. As of the time of writing, Bitcoin is trading at $29,200, representing a slight 0.6% decline over the last 24 hours. Featured image from iStock, chart from TradingView.com "
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-31T18:45:39.000Z",
    "title": "Four Tether Executives Are Now Crypto Billionaires As Stablecoin Issuer Fetches $9,000,000,000 Valuation: Forbes",
    "url": "https://dailyhodl.com/2023/07/31/four-tether-executives-are-now-crypto-billionaires-as-stablecoin-issuer-fetches-9000000000-valuation-forbes/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/02/top-tether-profit-zero.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/02/top-tether-profit-zero.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/02/top-tether-profit-zero.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/02/top-tether-profit-zero.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/02/top-tether-profit-zero.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/02/top-tether-profit-zero.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/02/top-tether-profit-zero.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The four executives behind the biggest stablecoin in the world are reportedly worth over $1 billion each now that the market cap of Tether (USDT) is at an all-time high. Despite a long bear market for digital assets, the British Virgin Islands-based company posted a profit of $1.5 billion in the first quarter of 2023 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/31/four-tether-executives-are-now-crypto-billionaires-as-stablecoin-issuer-fetches-9000000000-valuation-forbes/\">Four Tether Executives Are Now Crypto Billionaires As Stablecoin Issuer Fetches $9,000,000,000 Valuation: Forbes</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-31T18:41:04.000Z",
    "title": "Coinbase Ordered by SEC To Halt Trading on All Crypto Assets Except Bitcoin, Prior to Being Sued: Report",
    "url": "https://dailyhodl.com/2023/07/31/coinbase-ordered-by-sec-to-halt-trading-on-all-crypto-assets-except-bitcoin-prior-to-being-sued-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-job-cuts-bear.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-job-cuts-bear.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-job-cuts-bear.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-job-cuts-bear.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-job-cuts-bear.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-job-cuts-bear.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/coinbase-job-cuts-bear.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Coinbase was reportedly ordered by the U.S. Securities and Exchange Commission (SEC) to stop all non-Bitcoin (BTC) trading before the regulator&#8217;s charges against it. The exchange&#8217;s CEO Brian Armstrong told The Financial Times that Coinbase was warned by the SEC to halt all crypto trading besides Bitcoin with no further explanation. &#8220;[The SEC] came back [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/31/coinbase-ordered-by-sec-to-halt-trading-on-all-crypto-assets-except-bitcoin-prior-to-being-sued-report/\">Coinbase Ordered by SEC To Halt Trading on All Crypto Assets Except Bitcoin, Prior to Being Sued: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]