[
  {
    "source": "Decrypt",
    "date": "2023-09-18T12:55:58.000Z",
    "title": "Hong Kong Influencer Arrested Over JPEX Exchange Promotion",
    "url": "https://decrypt.co/197573/hong-kong-influencer-arrested-over-jpex-exchange-promotion",
    "description": "Joseph Lam’s arrest followed the suspension of trading on crypto exchange JPEX, which regulators allege was operating without a license."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-18T13:06:18.000Z",
    "title": "Malta begins public consultation on revised crypto rules to align with MiCA ",
    "url": "https://cointelegraph.com/news/crypto-rules-revised-mica-malta",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/19af63be-5dc1-4de8-a63c-dbebb95f8bc1.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> Malta has joined France and other EU nations in revising its existing crypto regulatory policies to align with MiCA coming into effect in December 2024.</p>\n                    <p><p>Malta’s Financial Services Authority (MFSA) has begun public consultation over changes in its crypto regulations in order to align with Europe’s <a href=\"https://cointelegraph.com/news/eu-s-new-crypto-law-how-mica-can-make-europe-a-digital-asset-hub\">Markets in crypto-assets (MICA)</a> regulations set to take effect in December 2024. The public consultation period is open until Sept. 29.</p><p>The <a href=\"https://www.mfsa.mt/publication/consultation-document-on-the-changes-to-chapter-3-of-the-virtual-financial-assets-rulebook/\" target=\"_blank\" rel=\"noopener nofollow\">revised </a>rulebook proposes changes to the rules for exchanges, custodians and portfolio managers in order to align with the European Union’s MiCA. Malta first established its crypto framework in 2018 with the Virtual Financial Assets (VFA).</p><p>Some of the notable changes with respect to the VFA Rulebook are:</p><ul><li>MFSA has removed the systems audit requirement for VFA license holders.</li><li>The capital requirements for Class 3 and 4 licence holders were reduced to $133,000 (€125,000) and $159,000 (€150,000) respectively.</li><li>The professional indemnity insurance requirement was removed.</li><li>The outsourcing requirements were updated in line with MiCA.</li><li>The service-specific rules of the MiCA were incorporated in the VFA rulebook where the requirements applicable to VFA exchanges, order execution and client suitability will be amended.</li><li>The requirements relating to client categorization have been removed.</li><li>The requirement for a Risk Management and the Internal Capital Adequacy Assessment Report has been removed.</li></ul><p>With the <a href=\"https://cointelegraph.com/news/eu-mica-crypto-legislation-added-to-official-journal\">passing of the MiCA regulations</a>, all existing regulations in the European Union nations will be replaced by the universal MiCA laws. Malta, being one of the several EU countries, had two options: either to wait for 18 months before the MiCA laws come into effect or amend the existing regulations to align with the universal EU laws, and the regulators in the country chose the second option.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/industry-leaders-and-policymakers-react-to-passage-of-mica-in-eu\"><strong><em>Industry leaders and policymakers react to passage of MiCA in EU</em></strong></a></p><p>The regulators in an interview in October last year stated that early modifications to their existing crypto regulations would help VFA license holders to seamlessly transition to MiCA-based laws and obtain the EU license. Malta's VFA framework was based upon Markets in Financial Instruments Directive (MiFID) principles and MiCA has derived several principles from the same rulebook.</p><p>Apart from Malta, fellow EU nation <a href=\"https://cointelegraph.com/news/france-updates-crypto-licensing-regime-for-mica\">France has also amended its existing regulatory guidelines for crypto to align with MiCA</a> and come into effect in early 2024.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-18T13:01:00.000Z",
    "title": "Bitcoin miners seek alternative energy sources to cut costs",
    "url": "https://cointelegraph.com/news/bitcoin-miners-seek-alternative-energy-sources-to-cut-costs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/caef220f-e457-441d-9d7a-ba5cfcc186ca.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The next generation of crypto mining will focus on alternative energy sources for efficiency. </p>\n                    <p><p>During the 2021 bull market, many large mining companies <a href=\"https://cointelegraph.com/news/public-bitcoin-mining-companies-plagued-with-4b-of-collective-debt\">took on massive loans</a> to buy equipment and the proper infrastructure required to mine cryptocurrency. Yet the collapse of crypto exchange FTX and Celsius left many of these companies filing for bankruptcy. </p><p>The current bear market, coupled with <a href=\"https://cointelegraph.com/news/bitcoin-profitability-nears-record-lows-hashrate-soars\">high Bitcoin network hash rates and low profits</a>, has yet again left the crypto industry wondering if miners will be able to recover from losses. While this remains questionable, it’s become evident that mining companies today are<a href=\"https://cointelegraph.com/news/bitcoin-mining-becoming-more-environmentally-friendly\"> focusing more on alternative energy resources</a> to cut costs, ensure profits and, in some cases, reduce their environmental impact.</p><h2>Alternative energy sources used by miners</h2><p>Steven Lubka, managing director for Bitcoin-focused financial services company Swan Bitcoin, told Cointelegraph that while the <a href=\"https://en.macromicro.me/charts/29435/bitcoin-production-total-cost\" target=\"_blank\" rel=\"noopener nofollow\">average rate</a> to mine a single Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is around $26,000, mining companies focused on renewable energy sources are seeing rates between $5,000 and $15,000 per BTC. </p><p>A spokesperson for Riot Blockchain, a United States-based publicly traded Bitcoin mining company, told Cointelegraph that wind and solar energy generated across Texas has helped Riot ensure some of the lowest costs to mine crypto. “As stated in our Q2 investor deck, it costs Riot $8,389 to mine 1 Bitcoin,” he said. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/2540f7f4-f0f1-4ec5-86c9-d238488ee69b.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Aerial view of Riot Blockchain's Rockdale mining site. Source: Riot Blockchain</em></figcaption></figure><p>Kent Halliburton, president and chief operating officer of Sazmining — a hosted Bitcoin mining provider — told Cointelegraph that the biggest expense for mining has always been electricity:</p><blockquote>“Bitcoin miners are naturally incentivized to find the lowest-cost power. Excess electricity is the lowest priced. With renewables, there is often excess electricity, which makes it a perfect fit for Bitcoin mining.”</blockquote><p>Halliburton added that independently sourced <a href=\"https://batcoinz.com/beest/\" target=\"_blank\" rel=\"noopener nofollow\">data</a> from the Bitcoin Mining Council shows that the Bitcoin network may indeed be one of the most sustainable industries. According to the source, 59% of mining operations are carbon-free and growing at a rate of nearly 4.5% per year. </p><p>“All of our mining operations in Wisconsin and Paraguay are utilizing excess hydroelectricity,” he said.</p><p>The shift to alternative energy sources seems to be a trend for miners thinking about long-term success. Phil Harvey, CEO of crypto mining infrastructure provider Sabre56, told Cointelegraph that the company is currently working with dozens of mining companies to get machines set up across Sabre56’s three facilities located in Wyoming and Ohio. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/eb3b3c01-02e9-4ab3-8099-00ab6d3c0e68.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Saber56's Bonepile site in Gillette, Wyoming. Source: Rachel Wolfson</em></figcaption></figure><p>Harvey explained that Sabre56’s facility in Gillette, Wyoming — known as “Bonepile” — hosts nearly 2,200 mining machines that are powered by a combination of energy sources, including a material contribution from renewable energy. The 5,200-square-foot site draws on Basin Electric’s mixed energy portfolio. According to Basin Electric’s <a href=\"https://www.basinelectric.com/about-us/Generation/index\" target=\"_blank\" rel=\"noopener nofollow\">website</a>, this includes 24% wind, 0.6% recovered energy and 4.3% hydro, which adds up to 28.9% renewables. </p><p>Harvey said, “The machines at our Bonepile site consist of a mixture of MicroBT Whatsminer M50s and Bitmain Antminer S19s. In terms of the site design and methodology, we leverage a forced-air design, meaning air is forced into the facility to cool the machines.” </p><p>According to Harvey, the Bonepile facility is designed to ensure surplus air provision. Harvey explained that this method reduces overheating and strain on the mining equipment while also allowing the miners to naturally exhaust hot air through overpressure. </p><p>“This is different from the standard design widespread in the mining industry, which is often extracting the hot air with an additional mechanism while not having a system in place to aid air into the facility,” he remarked. </p><p>OceanBit, a company developing renewable energy platforms using ocean thermal sources, is taking a different approach. Michael Bennett, co-founder of OceanBit, told Cointelegraph that the company is integrating Bitcoin mining into its ocean thermal energy power plant design. “This will allow us to balance variable loads, deliver power faster to offshore operations, and monetize excess energy to improve plant profitability,” he explained. </p><p>According to Bennett, ocean thermal energy is the largest untapped energy source on the planet. “It’s a base load source of renewable energy, like hydro or geothermal, but uses the temperature difference in ocean water to generate electricity.” </p><p>Bennett believes Bitcoin is the missing piece needed to scale the energy source to global adoption since it solves a number of ocean thermal energy conversion (OTEC) commercial challenges.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/5c9750c9-df4d-4242-acc3-015263ef03cc.png\"  /><figcaption style=\"text-align: center;\"><em>Diagram of OceanBit's thermodynamic cycle. Source: OceanBit</em></figcaption></figure><p>Nathaniel Harmon, co-founder and CEO of OceanBit, elaborated, “The byproduct of OTEC generation process is four degrees Celsius cold water, which makes it ideal for cooling ASICs, while the byproduct of ASICs is low grade heat, which makes it ideal to use in the OTEC process. The combination increases the efficiency while decreasing the cost of both.” </p><p>Bennett shared that OceanBit plans to unveil its R&amp;D power plant in Hawaii in 2024.</p><h2>Some alternative energy sources are controversial</h2><p>Pennsylvanian crypto mining company Stronghold Digital Mining is using coal refuse to power its mining operations. </p><p>This refuse — also known as gob, culm or boney — is the result of the refining process of coal mining. These unrefined bits of coal mixed with shale, slate or other impurities are piled on thousands of acres of abandoned mine lands in Pennsylvania.</p><p>Greg Beard, CEO of Stronghold Digital Mining, told Cointelegraph that his firm is working with the Pennsylvania Department of Environmental Protection and local environmental authorities to clean up piles of waste coal and use them to power Bitcoin mining operations. </p><p>He said, “Acid mine drainage from these piles is one of the largest sources of water pollution in Pennsylvania. The waste piles have also been catching fire for decades by way of spontaneous combustion, releasing toxic pollution into the air. Stronghold converts the coal refuse into power by way of specialized facilities and then either supplies the power to the local grid or uses the power to mine Bitcoin.” </p><p>“Bitcoin mining is required to continue the waste coal cleanup activities, making it a much more efficient operation than miners seeking out power sources,” added Beard. </p><p>While this does provide a method of cleaning up the tons of coal refuse, from an environmental perspective, it also poses something of a Catch 22. </p><p>The special plants that can use refuse coal are still burning hydrocarbons. The Pennsylvania arm of the Energy Justice Network project has even <a href=\"https://www.powermag.com/coal-refuse-dilemma-burning-coal-environmental-benefits/\" target=\"_blank\" rel=\"noopener nofollow\">contended</a> that refuse coal-firing plants pollute more than new coal plants.</p><p>Stronghold itself further came under the scrutiny of environmental groups when it <a href=\"https://cointelegraph.com/news/crypto-mining-stronghold-requests-permission-to-burn-tires-for-crypto-mining-in-pennsylvania\">applied for a permit to burn tire-derived fuel</a> at its Panther Creek plant. </p><p>Clean Air Council activist Russell Zerbo recently said on a podcast that the plant “uses the electricity it produces to generate cryptocurrency; rather than selling that electricity to the energy grid, the plant should be completely repermitted as a solid waste incinerator that would be subject to increased air pollution monitoring requirements.”</p><h2>Challenges for miners may hamper adoption </h2><p>While it’s notable that crypto mining companies are using alternative energy sources, certain challenges could hamper adoption. Halliburton claimed that misinformation regarding alternative energy sources is common:</p><blockquote>“Local populaces may throw-up roadblocks because they don’t realize that Bitcoin miners are providing a net benefit to their local communities through job creation and monetizing wasted or excess electricity. Electricity is also misunderstood; it’s extremely expensive to store, and if electricity is not utilized or stored when it’s generated, it gets wasted — quite literally put into the earth.”</blockquote><p>Moreover, the challenges that come along with using renewable energy are also evident. Harvey mentioned that the altitude of Gillette, Wyoming results in much thinner air quality. As such, the machines at Sabre56’s Bonepile facility can struggle with pulling in enough air required for cooling. </p><p>Then comes the challenge of thermal pollution, as hot air is released into the atmosphere from the mining machines, which Cointelegraph witnessed firsthand at the Bonepile site in Wyoming. Given this, some mining companies are finding unique ways to reuse heat production. For instance, Genesis Digital Assets <a href=\"https://genesisdigitalassets.com/greenhouse-project/\" target=\"_blank\" rel=\"noopener nofollow\">uses</a> hot air produced by mining equipment to grow vegetables in the Nordic regions.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/96f5979d-fa0f-419e-8d1c-8f66c4220e2d.jpg\"  /><figcaption style=\"text-align: center;\"><em>Heat from mining machines is used to grow plants inside a greenhouse. Source: Genesis Digital Assets</em></figcaption></figure><p>All things considered, the future of mining operations will likely rely on renewable sources. Margie Feng, head of marketing at Bitmain — a leading producer of crypto mining equipment — told Cointelegraph that the company has shifted gears and is currently working hard on promoting hydro-cooling technologies, as she believes that demands for this type of equipment will only grow in the future. </p><p>Feng added that Bitmain has found that almost a quarter of all Bitcoin miners use water to power their setups, while wind and nuclear are the second- and third-biggest contributions, respectively. </p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-18T12:51:22.000Z",
    "title": "BTC price hits $27.4K as Bitcoin open interest matches Grayscale peak",
    "url": "https://cointelegraph.com/news/btc-price-27-4-k-bitcoin-open-interest-grayscale-peak",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/31d3f411-47fa-42c9-869e-2c6d26e374a0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC price gains more than 3% as the week begins, but concerns over open interest “ramping up” almost $1 billion in hours offer a sense of Grayscale deja vu.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) hit new month-to-date highs on Sept. 18 as a strong weekly close cemented a bullish start to Wall Street trading. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/472a2e54-ae66-4478-9d95-81aa36ab2503.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-day chart. Source: TradingView</em></figcaption></figure><h2>Trader cautions on surging Bitcoin open interest</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> tracked over 3% BTC price gains on the day, with Bitcoin breaking $27,000 for the first time in September.</p><p>With the Wall Street open around the corner, market participants eyed “momentum” returning among Bitcoin bulls.</p><p>“Bitcoin price breaks the barrier at $26,800 and attacks the highs at $27,200,” Michaël van de Poppe, founder and CEO of trading firm Eight, <a href=\"https://twitter.com/MI_Algos/status/1703728517916069936\" target=\"_blank\" rel=\"noopener nofollow\">summarized</a>. </p><blockquote>“Trend looks like to be upwards from here, as altcoins are also waking up. Still the best period to buy your assets.”</blockquote><p>Van de Poppe uploaded his latest analytics chart to X (formerly Twitter), showing the area of resistance now necessary for a reclaim.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/7764d611-23d3-43d9-9c10-b40cf58a3d9a.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Michaël van de Poppe/X</em></figcaption></figure><p>Monitoring resource Material Indicators meanwhile revealed daily buy signals on its proprietary trading instruments.</p><p>“Bulls seem to have mustered some momentum since the D candle open,” part of accompanying commentary <a href=\"https://twitter.com/MI_Algos/status/1703728517916069936\" target=\"_blank\" rel=\"noopener nofollow\">read</a>.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">UPDATE: <a href=\"https://twitter.com/hashtag/BTC?src=hash&amp;ref_src=twsrc%5Etfw\">#BTC</a> Bulls seem to have mustered some momentum since the D candle open. Both Trend Precognition algos are flashing new ⬆️ signals in the Daily TF.  A close below $26,414 would invalidate. <a href=\"https://t.co/KSAp6e0tjt\">pic.twitter.com/KSAp6e0tjt</a></p>&mdash; Material Indicators (@MI_Algos) <a href=\"https://twitter.com/MI_Algos/status/1703728517916069936?ref_src=twsrc%5Etfw\">September 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Elsewhere, a cautious Daan Crypto Trades flagged ballooning open interest, which returned to levels last seen after the <a href=\"https://cointelegraph.com/news/btc-price-2-week-highs-grayscale-sec-bitcoin-etf-win\">brief BTC price gains</a> that followed asset manager Grayscale’s legal victory against United States regulators.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> Open Interest has been ramping up like crazy these past few hours.<br><br>Up +$850M in hours.<br><br>This can be an issue if spot bid disappears which could cause for a full retrace similar to before. <br><br>This would then be due to underwater positions that entered near the top. If… <a href=\"https://t.co/PmQOvVt7Gw\">pic.twitter.com/PmQOvVt7Gw</a></p>&mdash; Daan Crypto Trades (@DaanCrypto) <a href=\"https://twitter.com/DaanCrypto/status/1703736166418100644?ref_src=twsrc%5Etfw\">September 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Trader and analyst Rekt Capital meanwhile demanded that bulls win back higher levels and hold them into the September monthly close.</p><p>“Soon going to revisit ~$27100 (black),” he <a href=\"https://twitter.com/rektcapital/status/1703718201018708410\" target=\"_blank\" rel=\"noopener nofollow\">forecast</a> on the day alongside a chart. </p><blockquote>“This level acted as support earlier this year and could turn into new resistance this month, unless $BTC reclaims it with a Monthly Close above black.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/9749caa0-79ee-4def-bf9e-2fa9337e7a12.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Rekt Capital/X</em></figcaption></figure><h2>BTC price further ignores DXY strength</h2><p>With the Fed’s decision on interest rates looming on Sept. 20, the macro conversation focused on the build-up to the event.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/fomc-btc-price-local-bottom-5-things-bitcoin-this-week\">FOMC versus BTC price ‘local bottom’ — 5 things to know in Bitcoin this week</a></em></strong></p><p>The U.S. Dollar Index (DXY) showed continued strength on the day despite assumptions that interest rates would not rise later in the week.</p><p>The DXY hovered above 105, having broken through that level for the first time since mid-March.</p><p>Bitcoin, traditionally inversely correlated to the Index, nonetheless showed no signs of weakness.</p><p>“Bitcoin hit $27,000, while the DXY is above 105,” James Straten, research and data analyst at crypto insights firm CryptoSlate, <a href=\"https://twitter.com/jimmyvs24/status/1703717811711864934\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> alongside a comparative chart. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/d7973af1-d87b-4ed6-bc78-a976b190037e.jpeg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD vs. DXY comparative chart. Source: James Straten/X</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><blockquote>“The last time DXY was trading at 105 was March when Bitcoin was trading at less than $20,000. The time before that was Q4 2022, #Bitcoin was trading $17,000.”</blockquote><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-18T12:57:23.000Z",
    "title": "New Google cloud sync feature implicated in $15M crypto heist at Ripple-owned Fortress Trust",
    "url": "https://cryptoslate.com/new-google-cloud-sync-feature-implicated-in-15m-crypto-heist-at-ripple-owned-fortress-trust/",
    "description": "<p>Software development company Retool has blamed the hack of crypto custodian Fortress Trust on a recently introduced Google Account cloud synchronization feature, Hacker News reported on Sept. 18. Retool, which provides cloud services for several customers, including Fortress Trust, disclosed that all the accounts of its 27 cloud customers were compromised. The breach led to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/new-google-cloud-sync-feature-implicated-in-15m-crypto-heist-at-ripple-owned-fortress-trust/\">New Google cloud sync feature implicated in $15M crypto heist at Ripple-owned Fortress Trust</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-18T12:50:00.000Z",
    "title": "Xsolla Launches Mall, An Online Destination For Video Games",
    "url": "https://www.cryptoglobe.com/latest/2023/09/xsolla-launches-mall-an-online-destination-for-video-games/",
    "description": "Sherman Oaks, United States, September 18th, 2023, Chainwire Xsolla, a global video game commerce company, has announced a new online destination called Xsolla Mall. This platform allows video games to host multiple landing pages where players can access exclusive in-game items, game discounts, and premium experiences directly from developers and publishers or via campaigns with content […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-18T12:47:19.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Surges Above $27,000 as Bulls Return Ahead of Upcoming FOMC Meeting",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-surges-above-27000-as-bulls-return-ahead-of-upcoming-fomc-meeting/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1990091477-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin pushed past the $27,000 level on Monday, as markets prepared for the latest Federal Reserve interest rate decision.\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1990091477-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1990091477-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1990091477-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1990091477-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1990091477-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1990091477-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1990091477.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin pushed past the $27,000 level on Monday, as markets prepared for the upcoming Federal Reserve interest rate decision. Bullish sentiment was in full force in today&#x2019;s session, despite the prospect of yet another rate hike. Ethereum was also higher to start the week. Bitcoin Bitcoin surged to a multi-week high on Monday, as traders [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T13:07:38.000Z",
    "title": "WormGPT – A Disturbing Advance in Cybercrime",
    "url": "https://www.cryptopolitan.com/wormgpt-a-disturbing-advance-in-cybercrime/",
    "description": "In a troubling turn of events, cybersecurity experts have sounded the alarm about the emergence of a malicious AI tool known as WormGPT. This AI tool, designed explicitly to assist cybercriminals, poses a significant threat by enabling hackers to develop sophisticated attacks on an unprecedented scale. While AI has made remarkable strides in various fields, ... <a title=\"WormGPT &#8211; A Disturbing Advance in Cybercrime\" class=\"read-more\" href=\"https://www.cryptopolitan.com/wormgpt-a-disturbing-advance-in-cybercrime/\" aria-label=\"More on WormGPT &#8211; A Disturbing Advance in Cybercrime\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T13:06:22.000Z",
    "title": "Dollar soars to 6-month apex before central bank shakeup",
    "url": "https://www.cryptopolitan.com/dollar-soars-before-central-bank-shakeup/",
    "description": "The financial world is in for a rollercoaster ride as the dollar climbs, threatening other major currencies with its newfound dominance. There&#8217;s a storm brewing on the horizon, and as we delve deeper into the world of finance and exchange, we discover a compelling narrative of economic maneuvers, currency fluctuations, and an impending central bank ... <a title=\"Dollar soars to 6-month apex before central bank shakeup\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dollar-soars-before-central-bank-shakeup/\" aria-label=\"More on Dollar soars to 6-month apex before central bank shakeup\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T12:52:11.000Z",
    "title": "How committed are you to your project? CZ leads by example with the Binance Logo tattoo",
    "url": "https://www.cryptopolitan.com/cz-shows-commitment-with-binance-logo-tattoo/",
    "description": "Changpeng Zhao, the founder of Binance, the world&#8217;s leading crypto exchange, is regarded by many as a veteran in the crypto space; his Binance Logo tattoo set laid the groundwork for the fight he is currently engaged in. Abraham Lincoln said it more eloquently: &#8220;Commitment is what transforms a promise into a reality.&#8221; CZ describes ... <a title=\"How committed are you to your project? CZ leads by example with the Binance Logo tattoo\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cz-shows-commitment-with-binance-logo-tattoo/\" aria-label=\"More on How committed are you to your project? CZ leads by example with the Binance Logo tattoo\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T12:44:28.000Z",
    "title": "South Korea unleashes wild new crypto rules",
    "url": "https://www.cryptopolitan.com/south-korea-unleashes-wild-new-crypto-rules/",
    "description": "In a bold move to contain the unchecked spread of over-the-counter (OTC) cryptocurrency trading, South Korea&#8217;s financial watchdogs are initiating drastic measures. Their main gripe? The rampant misuse of OTC crypto trades in potentially criminal endeavors. Taming the Untamed OTC Market South Korea&#8217;s financial regulatory heavyweights, including the likes of deputy chief prosecutor Ki No-Seong ... <a title=\"South Korea unleashes wild new crypto rules\" class=\"read-more\" href=\"https://www.cryptopolitan.com/south-korea-unleashes-wild-new-crypto-rules/\" aria-label=\"More on South Korea unleashes wild new crypto rules\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-18T13:08:19.000Z",
    "title": "Kazakhstan launches CBDC development agency",
    "url": "https://crypto.news/kazakhstan-launches-cbdc-development-agency/",
    "description": "The National Bank of Kazakhstan (NBK) launched a new local agency that will be in charge of the CBDC development in the country. According to an official press release, the new agency will be called the National Payment Corporation. The&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-18T13:00:26.000Z",
    "title": "Chainlink (LINK) Notches 9% In One Day As Market Rebounds, What’s Next?",
    "url": "https://www.newsbtc.com/news/chainlink/chainlink-link-notches-9-in-one-day-as-market-rebounds-whats-next/",
    "description": "Oracle service provider Chainlink native token LINK has surged today as the crypto market records a significant uptick. The cryptocurrency is up by 9.02%, trading at $6.80 with a trading volume of $198 million, representing an over 179% increase in the last 24 hours. One of the factors likely to affect LINK&#8217;s price growth in the coming days is the massive movement of tokens from the network&#8217;s wallet to exchanges. On September 16, four wallets associated with Chainlink transferred 18.75 million LINK tokens across various platforms, amounting to $119 million.  Related Reading: Toncoin Shatters Bearish Predictions With 40% Rally – What’s The Story? These wallets were originally intended for holding tokens that were not yet in circulation. But recently, around 15.7 million LINK tokens (approximately $100 million) left these wallets headed straight to Binance. Furthermore, 3.05 million LINK tokens (roughly $19 million) left the wallets in a multi-signature wallet identified as 0xD50f. Following these significant on-chain activities and potential implications, investors are eager to see how LINK price will react. LINK Breaks Above $6.3 Resistance Level LINK is in an uptrend, forming a bullish engulfing pattern to break above the $6.3 resistance level. Although LINK is still below its 200-day Simple Moving Average (SMA), today&#8217;s green candle has broken above the 50-day SMA, showing increased pressure from buyers.  The buyers at the $6.1 support level have forced the crypto coin to rally after the brief retracement between September 16-17. Also, the Relative Strength Index (RSI) displays a value of 58.00, rising from the neutral zone and approaching the overbought region of 70.  LINK has overcome the $6.3 resistance level today. Therefore, the buyers will likely sustain the rally in the coming days. Furthermore, the Moving Average Convergence/Divergence displays a strong buy signal confirmed by its green Histogram bars.  The cryptocurrency will likely record more price gains in the coming days if the buyers continue to accumulate the tokens. However, the unlock and transfer of 21 million LINK tokens on September 16 could lead to a brief retracement in the long term when the buyers relent. Whales Increase Holdings After Swift Test Since August 31, when Chainlink entered into a partnership with Swift and other companies, LINK has exhibited positive market moves. The interbank communication system Swift and Chainlink, successfully transferred tokenized value across various private and public blockchains in an experiment.  The positive development boosted investors&#8217; confidence in buying more LINK tokens, potentially pushing the token&#8217;s value up. On September 7, Santiment noticed that Chainlink&#8217;s top-tier holders, those with 10,000-100,000 LINK tokens, were actively increasing their holdings. The number of wallets holding 10,000 to 100,000 LINK tokens increased to 3,127, the highest since December 3, 2022. These wallets collected $9.6 million worth of LINK in just three days, 0.154% of the total supply. Additionally, Santiment&#8217;s report showed that 98 new wallets in this category were created. Related Reading: Jordan Peterson Sparks Debate On How Bitcoin Can Solve Major Banking Problem On September 9, a crypto expert, Ali, revealed that these whales bought more than 4 million LINK coins, amounting to $24 million in just 10 days. These accumulations show heightened investor interest in Chainlink and will likely drive demand, thereby increasing the token&#8217;s price in the coming days. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-18T13:02:11.000Z",
    "title": "Innovative Cardano Project ‘Âtrium’ Enters Alpha and Will Onboard Millions of Users, Increasing the Network’s Decentralization – Can ADA Price Continue Its Bullish Trend and Rise to $0.30?",
    "url": "https://www.crypto-news-flash.com/innovative-cardano-project-atrium-enters-alpha-and-will-onboard-millions-of-users-increasing-the-networks-decentralization-can-ada-price-continue-its-bullish-trend-and-rise-to-0-30/?utm_source=rss&utm_medium=rss&utm_campaign=innovative-cardano-project-atrium-enters-alpha-and-will-onboard-millions-of-users-increasing-the-networks-decentralization-can-ada-price-continue-its-bullish-trend-and-rise-to-0-30",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-1-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-1-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-1-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-1-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-1-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-1-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-1-2048x1152.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-1-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Immersion-Imagery-Cardano-1-48x27.jpg 48w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />A new innovative Cardano project has been unveiled to the community and its founder believes it could play a significant role in onboarding millions of users. The project seeks to limit the number of applications the average user needs to execute swaps, buy NFTs, stake, loan, and stay current with the latest projects. A new [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-18T13:00:59.000Z",
    "title": "Token Focus: Why are Analysts Buzzing About Domini.art, Ripple, and Litecoin?",
    "url": "https://www.crypto-news-flash.com/token-focus-why-are-analysts-buzzing-about-domini-art-ripple-and-litecoin/?utm_source=rss&utm_medium=rss&utm_campaign=token-focus-why-are-analysts-buzzing-about-domini-art-ripple-and-litecoin",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-100.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-100.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-100-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-100-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-100-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-100-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Crypto never sleeps. There’s always fresh news influencing this highly volatile market and its leading assets. Analysts study these fluctuations to ascertain the best crypto investment for traders to leverage. Domini.art ($DOMI), Ripple ($XRP), and Litecoin ($LTC) are three cryptocurrencies that analysts are currently buzzing about. These projects have garnered the crypto community’s attention with [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-18T12:46:10.000Z",
    "title": "Bitcoin Mining Industry Faces Challenges Ahead of Upcoming Halving",
    "url": "https://www.crypto-news-flash.com/bitcoin-mining-industry-faces-challenges-ahead-of-upcoming-halving/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-mining-industry-faces-challenges-ahead-of-upcoming-halving",
    "description": "<img width=\"1920\" height=\"1117\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/04/bitcoin-ge47061156_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/04/bitcoin-ge47061156_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/04/bitcoin-ge47061156_1920-300x175.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/04/bitcoin-ge47061156_1920-1024x596.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/04/bitcoin-ge47061156_1920-768x447.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/04/bitcoin-ge47061156_1920-1536x894.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/04/bitcoin-ge47061156_1920-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/04/bitcoin-ge47061156_1920-36x21.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/04/bitcoin-ge47061156_1920-48x28.jpg 48w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />JP Morgan&#8217;s recent report highlights potential challenges for Bitcoin post the April 2024 halving event. The report indicates that miners face income challenges due to decreasing transaction fees.  In a recent report, JP Morgan, the renowned financial giant, has drawn attention to the potential hurdles that Bitcoin (BTC) may face following its halving event in [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-18T12:44:19.000Z",
    "title": "Sui’s Zklogin Is the Bridge Between Web2 and Web3 Companies",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/suis-zklogin-is-the-bridge-between-web2-and-web3-companies/",
    "description": "<p>The Sui blockchain recently announced a new innovation that will make it easier to bridge the gap between Web3 and Web2 companies. The company introduced zkLogin, which would enable users to log into the Sui ecosystem using their web2 credentials, such as those from Google, Facebook, and Twitch. This novel offering has the potential to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/suis-zklogin-is-the-bridge-between-web2-and-web3-companies/\">Sui&#8217;s Zklogin Is the Bridge Between Web2 and Web3 Companies</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-18T12:52:00.000Z",
    "title": "Crypto Analyst Hints at Possible Collapse of Crypto Exchange Binance",
    "url": "https://coinedition.com/crypto-analyst-hints-at-possible-collapse-of-crypto-exchange-binance/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/23_Binance_Coin_Forms_a_Bullish_Pennant_on_the_50_period_MA_a_Bullish.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/23_Binance_Coin_Forms_a_Bullish_Pennant_on_the_50_period_MA_a_Bullish.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/23_Binance_Coin_Forms_a_Bullish_Pennant_on_the_50_period_MA_a_Bullish-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/23_Binance_Coin_Forms_a_Bullish_Pennant_on_the_50_period_MA_a_Bullish-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/23_Binance_Coin_Forms_a_Bullish_Pennant_on_the_50_period_MA_a_Bullish-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/23_Binance_Coin_Forms_a_Bullish_Pennant_on_the_50_period_MA_a_Bullish-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/23_Binance_Coin_Forms_a_Bullish_Pennant_on_the_50_period_MA_a_Bullish-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto Twitter analyst and Fintech Executive Adam Cochran, in a recent post on X, once again hinted at a possible imminent collapse of crypto exchange giant Binance. According to Cochran, the cracks at the company are starting to show, and the effects will be “nasty when this dam (Binance) breaks.” His statement comes in reaction [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-analyst-hints-at-possible-collapse-of-crypto-exchange-binance/\">Crypto Analyst Hints at Possible Collapse of Crypto Exchange Binance</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]