[
  {
    "source": "CoinDesk",
    "date": "2023-10-11T16:31:23.000Z",
    "title": "Bitcoin Mining Industry Is at a ‘Crucible Moment,’ JPMorgan Says",
    "url": "https://www.coindesk.com/business/2023/10/11/bitcoin-mining-industry-is-at-a-crucible-moment-jpmorgan-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The bank initiates research coverage of CleanSpark (top pick), Marathon Digital, Riot Platforms and Cipher Mining."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-11T16:24:09.000Z",
    "title": "Ether Could Hit $8K by End of 2026: Standard Chartered",
    "url": "https://www.coindesk.com/markets/2023/10/11/ether-could-hit-8k-by-end-of-2026-standard-chartered/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Emerging uses for the Ethereum network in gaming and tokenization should help drive a 5X in ether's price over the next three years, said the bank."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-11T16:30:00.000Z",
    "title": "Less than 50% of Hong Kong retail crypto investors aware of relevant regulations: Survey",
    "url": "https://cointelegraph.com/news/less-50-percent-hong-kong-retail-crypto-investors-aware-regulations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/a579a9b8-82ec-4ae8-be6a-acbf8f26ca46.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Hong Kong has allowed retail crypto trading since June. </p>\n                    <p><p>Just 47% of retail crypto investors in Hong Kong are aware of the Virtual Asset Trading Platform Regulatory Regime, a legislation which went into effect this June to protect the interest of retail investors in digital assets in the region.</p><p>That's according to an October 11 <a href=\"https://www.ifec.org.hk/web/en/blog/2023/07/vatp-regime-at-a-glance.page\" target=\"_blank\" rel=\"noopener nofollow\">report</a> by the The Investor and Financial Education Council (IFEC) of Hong Kong. In its survey, the IFEC noted that nearly 25% of Hong Kong adults ages 18 to 29 have invested in crypto within the past year, three times the demographic average and a significant increase over 2019, where just 3% of respondents in the said demographic reported investing in crypto. </p><p>Despite the improvement in adoption, most Hong Kong-ers said that their top investment preferences were stocks (96%), mutual funds and trusts (24%), followed by bonds (18%). Around three-quarters of overall respondents said the primary goal of investing in crypto was for \"short-term profits,\" alongside \"fear of missing out.\" The survey featured 1,000 respondents between the ages of 18 and 69.</p><p>\"Investors should understand the product characteristics and related risks before investing, in order to align their choices with their financial goals and risk tolerance level,\" said IFEC general manager Dora Li in response to the results. Meanwhile, Eric Chui, head of the Department of Applied Social Sciences at PolyU, commented: \"Virtual asset investors should think more deliberately and rationally. They should also build up their financial literacy and collect high-quality market information to avoid the irrational investment behaviour and biases.\"</p><p>Beginning in June, Hong Kong legalized retail crypto trading for licensed exchanges, to <a href=\"https://cointelegraph.com/news/hashkey-hk-avalanche-avax-trading-1-million-portfolio-requirement\">mixed results</a>. During this time, the largest Ponzi scheme in Hong Kong history, the $166 million <a href=\"https://cointelegraph.com/news/hong-kong-police-sfc-crypto-task-force-jpex-scandal\">JPEX crypto exchange scandal</a>, unraveled in the Special Administrative Region of China. </p><p><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/3ac-opnx-asia-express/\">3AC fugitives in disarray as OPNX faces new peril</a></strong></p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-11T16:28:05.000Z",
    "title": "Bitcoin hits 2-week low on US inflation data — When will BTC price bounce?",
    "url": "https://cointelegraph.com/news/bitcoin-2-week-low-us-inflation-btc-price",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/5b5ac552-e6e8-4680-b7c1-8349982fee6c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC price downside follows renewed inflation fears amid a prediction that Bitcoin might only reverse upward in December.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) hit new October lows after the Oct. 11 Wall Street open as one analyst hailed the “final stage” of the cryptocurrency bear market.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/22cf05d4-3718-47f0-b189-9a5e7996f190.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 12-hour chart. Source: TradingView</em></figcaption></figure><h2>Bitcoin traders stress importance of $26,800</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> showed further BTC price weakness emerging, costing bulls $27,000 support.</p><p>At the time of writing, the largest cryptocurrency was headed toward $26,600 as downside gained momentum.</p><p>The move followed United States inflation data in the form of the <a href=\"https://www.bls.gov/ppi/\" target=\"_blank\" rel=\"noopener nofollow\">Producer Price Index (PPI)</a>, the September print for which came in above expectations — 2.2% versus 1.6% year-on-year (YoY). This added to concerns about <a href=\"https://cointelegraph.com/news/bitcoin-price-dives-us-jobs-data-fed-rate-hike\">lingering U.S. inflation pressures</a>, with dollar strength up and risk assets down.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/876a144b-958f-4be0-97ae-b79203d54087.png\"  /><figcaption style=\"text-align: center;\"><em>Producer Price Index (PPI) chart. Source: U.S. Bureau of Labor Statistics</em></figcaption></figure><p>“PPI coming in hotter than expected, meaning that the $DXY will probably have a bounce upwards and Bitcoin some corrections south. Still monitoring the lower boundaries here for potential entries,” Michaël van de Poppe, founder and CEO of MN Trading, <a href=\"https://twitter.com/CryptoMichNL/status/1712084961090580777\" target=\"_blank\" rel=\"noopener nofollow\">commented</a> on X.</p><p>Having <a href=\"https://cointelegraph.com/news/bitcoin-death-cross-btc-price-dip-uptober\">already lost $1,000</a> since a “death cross” completed on the daily chart at the start of the week, Bitcoin thus hit its lowest levels since Sep. 29. In so doing, it canceled out its previous October gains, and with it removed the month’s status as a classic “Uptober.”</p><p>“The final stage of the bear market for Crypto,” Van de Poppe <a href=\"https://twitter.com/CryptoMichNL/status/1712094536728564163\" target=\"_blank\" rel=\"noopener nofollow\">continued</a>. </p><blockquote>“We might be reversing here already in October, going into an uptrend in November (retesting the $26,800 area) or we might be reversing at the end of December for a pre-halving &amp; ETF rally. Good times are ahead for Bitcoin.”</blockquote><p>Following the action, popular trader Skew also highlighted $26,800 as a crucial level within the current range.</p><p>“Will wait for close but looking like a rejection so far also last area for bulls to do something imo ~ $26.8K,” he <a href=\"https://twitter.com/52kskew/status/1712128632586732029\" target=\"_blank\" rel=\"noopener nofollow\">told</a> X subscribers about the 4-hour chart.</p><p>At the same time, fellow trader Daan Crypto Trades noted multi-month highs in open interest, high levels having triggered the bouts of volatility, which characterized the first week of the month.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> At it&#39;s highest Open Interest level since the August dump.<br><br>Usually this is met by some kind of squeeze from this point. <a href=\"https://t.co/IZuhVbt6lt\">pic.twitter.com/IZuhVbt6lt</a></p>&mdash; Daan Crypto Trades (@DaanCrypto) <a href=\"https://twitter.com/DaanCrypto/status/1712113201259614554?ref_src=twsrc%5Etfw\">October 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Binance order book shows thin bids</h2><p>Prior to the PPI release, monitoring resource Material Indicators <a href=\"https://twitter.com/MI_Algos/status/1712081541235405131/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">showed</a> a lack of bid support on the BTC/USD order book on largest global exchange Binance. This was clustered around $26,650.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/war-cpi-28k-btc-price-5-things-bitcoin-week\">War, CPI and $28K BTC price — 5 things to know in Bitcoin this week</a></em></strong></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/b3cba3dc-b438-4b66-b273-74ed31001c6e.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD order book data for Binance. Source: Material Indicators/X</em></figcaption></figure><p>“This morning's YoY Core PPI report shows this metric trending upward since July,” co-funder Keith Alan wrote in part of subsequent commentary.</p><p>Alan <a href=\"https://twitter.com/KAProductions/status/1712098469240815735\" target=\"_blank\" rel=\"noopener nofollow\">added</a> that the interest rates may remain at current levels without relief for risk assets longer than was previously expected. </p><p>“I'm not an economist, but I interpret that as high(er) for longer,” he concluded.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-11T16:19:13.000Z",
    "title": "The Open Network (TON) to Attempt World Record for the Fastest Blockchain",
    "url": "https://www.cryptoglobe.com/latest/2023/10/the-open-network-ton-to-attempt-world-record-for-the-fastest-blockchain/",
    "description": "Zug, Switzerland, October 11th, 2023, Chainwire Today, the Open Network Foundation (TON Foundation) announces their upcoming attempt to officially be named the world’s fastest blockchain, accredited by Guinness World Records. The public network performance test, which is scheduled for October 31, 2023, at 15:00 UTC, will demonstrate the reliability, scalability, and speed of The Open Network […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-11T16:30:24.000Z",
    "title": "Ethereum Inflation Rises as Onchain Activity Declines; $35.31M Added in 17 Days",
    "url": "https://news.bitcoin.com/ethereum-inflation-rises-as-onchain-activity-declines-35-31m-added-in-17-days/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/inf-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Ethereum Inflation Rises as Onchain Activity Declines; $35.31M Added in 17 Days\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/inf-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/inf-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/inf-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/inf-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/inf-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/inf-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/inf.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Ethereum&#x2019;s shift from a deflationary to an inflationary model has witnessed a 0.178% uptick in the last 17 days. During this period, the network added 22,502 ether, valued at $35.31 million, to its total supply. Ethereum&#x2019;s Growing Inflation Fueled by Onchain Downturn Previously, Ethereum maintained a deflationary stance, primarily due to the London hard fork&#x2019;s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-11T16:21:02.000Z",
    "title": "Bipartisan Legislation Aims to Regulate AI-Generated Political Ads",
    "url": "https://www.cryptopolitan.com/bipartisan-legislation-to-regulate-ai/",
    "description": "In the ever-evolving landscape of modern politics, the issue of deceptive AI-generated political ads has captured the attention of lawmakers from both sides of the aisle. A bipartisan group of legislators, led by Senator Amy Klobuchar of Minnesota, has proposed legislation aimed at curbing the proliferation of misleading AI-generated audio and visual content.&#160; This legislation ... <a title=\"Bipartisan Legislation Aims to Regulate AI-Generated Political Ads\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bipartisan-legislation-to-regulate-ai/\" aria-label=\"More on Bipartisan Legislation Aims to Regulate AI-Generated Political Ads\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-11T16:20:42.000Z",
    "title": "The Rising Controversy Surrounding Publicly Available Facial Recognition Tools",
    "url": "https://www.cryptopolitan.com/controversy-facial-recognition-tools/",
    "description": "In an era where technology is evolving at an unprecedented pace, a new tool called PimEyes is making waves. Originally founded in 2017 by two computer programmers in Poland, PimEyes is considered one of the most powerful publicly available facial recognition tools online. This AI-driven tool, often described as a reverse image search on steroids, ... <a title=\"The Rising Controversy Surrounding Publicly Available Facial Recognition Tools\" class=\"read-more\" href=\"https://www.cryptopolitan.com/controversy-facial-recognition-tools/\" aria-label=\"More on The Rising Controversy Surrounding Publicly Available Facial Recognition Tools\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-11T16:12:04.000Z",
    "title": "Revolutionary AI Tool Detects Valvular Heart Disease with 93% Sensitivity",
    "url": "https://www.cryptopolitan.com/ai-tool-detects-valvular-heart-disease/",
    "description": "In a groundbreaking development, researchers at Stevens Institute of Technology have unveiled a novel AI-powered diagnostic tool capable of detecting and classifying valvular heart disease (VHD) with remarkable accuracy.&#160; This innovative technology promises to bridge the gap in early detection and treatment of VHD, a condition often overlooked in standard stethoscope examinations. The results of ... <a title=\"Revolutionary AI Tool Detects Valvular Heart Disease with 93% Sensitivity\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-tool-detects-valvular-heart-disease/\" aria-label=\"More on Revolutionary AI Tool Detects Valvular Heart Disease with 93% Sensitivity\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-11T16:30:58.000Z",
    "title": "Bitcoin Could See A 50% Rise Based On This, Analyst Explains",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-could-see-50-rise-based-analyst-explains/",
    "description": "An analyst has explained that a pattern in Grayscale Bitcoin Trust (GBTC) could suggest a potential 50% rise for BTC may be ahead. Bitcoin &#38; GBTC Have Seen A Decoupling In Recent Months In a new post on X, analyst James V. Straten has discussed the correlation between GBTC and BTC that has been present over the years. The Grayscale Bitcoin Trust is an investment vehicle that holds Bitcoin and allows exposure to these holdings through its shares. The chart below shows the trend in the percentage performance of Bitcoin and GBTC, as well as the correlation coefficient between them, over the past year. Looks like the two assets have diverged recently &#124; Source: @jimmyvs24 on X The &#8220;correlation coefficient&#8221; here refers to a metric that tells us how tied the prices of any two assets are. When this metric has a positive value, the given commodities show positive correlations as they replicate each other&#8217;s moves. The closer the metric is to 1, the stronger this relationship is. On the other hand, negative values imply the assets are responding to each other&#8217;s moves by moving in the opposite direction. The strongest negative correlation occurs at a value of -1. Related Reading: Ethereum Could See A Steep Decline If It Closes Below This Level Naturally, when the correlation coefficient is around zero, there isn&#8217;t any correlation between the commodities, as their prices move independently. From the above graph, it&#8217;s apparent that Bitcoin and GBTC have often had a correlation coefficient close to 1, implying that there has been a robust positive correlation between the two. There have been some temporary periods of deviation, mainly during drawdowns in the cryptocurrency&#8217;s price and other significant events like the SVB collapse. The correlation reverted to the norm soon after these, however. Straten says this correlation is especially striking in a 5-year timeframe, where it becomes 100%. The analyst also notes, however, that the two assets have decoupled since June. As is visible in the chart, GBTC has enjoyed some sharp uptrend recently, while BTC has been mostly flat. GBTC&#8217;s performance currently stands at +81% during the past year, while Bitcoin is up about 43%. &#8220;GBTC will be the first to be approved for the spot ETF before Blackrock and others,&#8221; says Straten, referring to what British HODL, another analyst, said earlier. &#8220;Price action agrees with this. Irrespective of whether it&#8217;s late Q3 or early Q4, it&#8217;s a six-month window from now.&#8221; Related Reading: Is Ethereum Doomed? Whales Have Sold 12M ETH In Past Year Based on this, the analyst believes that either Bitcoin will have to close up the gap created between it and GBTC since June, which would mean a price jump of around 50%, or GBTC would have to come down towards BTC. Straten believes the latter scenario to be unlikely, however. BTC Price Bitcoin has declined over the past few days as its price has dropped to just $27,100. BTC has been going down during the last few days &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-11T16:30:33.000Z",
    "title": "COVID-19 Vaccine Manufacturer Pfizer Goes Crypto with Launch of DAO of Community-Funded Biotech Firm – Can it be any good for Bitcoin and Ripple (XRP)?",
    "url": "https://www.crypto-news-flash.com/covid-19-vaccine-manufacturer-pfizer-goes-crypto-with-launch-of-dao-of-community-funded-biotech-firm-can-it-be-any-good-for-bitcoin-and-ripple-xrp/?utm_source=rss&utm_medium=rss&utm_campaign=covid-19-vaccine-manufacturer-pfizer-goes-crypto-with-launch-of-dao-of-community-funded-biotech-firm-can-it-be-any-good-for-bitcoin-and-ripple-xrp",
    "description": "<img width=\"1280\" height=\"845\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/coronavirus-4945416_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/coronavirus-4945416_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/coronavirus-4945416_1280-300x198.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/coronavirus-4945416_1280-1024x676.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/coronavirus-4945416_1280-768x507.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/coronavirus-4945416_1280-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/coronavirus-4945416_1280-214x140.jpg 214w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />VitaDAO, a community-owned project backed by Pfizer Ventures and Shine Capital among over 10,000 members, announced the launch of its first biotech company dubbed Matrix Biosciences with an initial funding of about $300k. The VitaDAO (VITA) token has gained about 72 percent YTD to trade around $1.69 on Tuesday and enjoys a WETH liquidity of [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-11T16:14:55.000Z",
    "title": "Breaking: Iraq Joins Brics in Global De-Dollarization Drive, Turns to Bitcoin (BTC)",
    "url": "https://www.crypto-news-flash.com/breaking-iraq-joins-brics-in-global-de-dollarization-drive-turns-to-bitcoin-btc/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-iraq-joins-brics-in-global-de-dollarization-drive-turns-to-bitcoin-btc",
    "description": "<img width=\"1920\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/engin-akyurt-b5I551g6lnA-unsplash.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/engin-akyurt-b5I551g6lnA-unsplash.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/engin-akyurt-b5I551g6lnA-unsplash-300x225.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/engin-akyurt-b5I551g6lnA-unsplash-1024x768.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/engin-akyurt-b5I551g6lnA-unsplash-768x576.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/engin-akyurt-b5I551g6lnA-unsplash-1536x1152.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />The Iraqi financial policymakers announced last week that people will not be able to withdraw the United States dollar beginning January 01, 2024, in a bid to support the Iraqi Dinar amid global high inflation that has pushed investors to Bitcoin. The Iraq Central Bank will be joining forces with the BRICS New Development Bank [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-11T16:35:00.000Z",
    "title": "Coinbase Builds Crypto Haul Despite Prevailing Bearish Period",
    "url": "https://coinedition.com/coinbase-builds-crypto-haul-despite-prevailing-bearish-period/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Coinbase-CEO-Hopes-Film-on-Exchange-Changes-Minds-of-Policymakers.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Coinbase-CEO-Hopes-Film-on-Exchange-Changes-Minds-of-Policymakers.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Coinbase-CEO-Hopes-Film-on-Exchange-Changes-Minds-of-Policymakers-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Coinbase-CEO-Hopes-Film-on-Exchange-Changes-Minds-of-Policymakers-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Coinbase-CEO-Hopes-Film-on-Exchange-Changes-Minds-of-Policymakers-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Coinbase-CEO-Hopes-Film-on-Exchange-Changes-Minds-of-Policymakers-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto enthusiasts across the universe are grappling with the protracted bearish period, intensified by the prevailing regulatory uncertainties. Meanwhile, Brian Armstrong, the co-founder and CEO of the leading crypto exchange Coinbase, shared his optimistic view amidst the unfavorable crypto conditions, asserting that the firm would navigate the deep waters of the long crypto winter. Since [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coinbase-builds-crypto-haul-despite-prevailing-bearish-period/\">Coinbase Builds Crypto Haul Despite Prevailing Bearish Period</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-11T16:29:58.000Z",
    "title": "The Open Network (TON) To Attempt World Record for the Fastest Blockchain",
    "url": "https://dailyhodl.com/2023/10/11/the-open-network-ton-to-attempt-world-record-for-the-fastest-blockchain/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/UPSCALED-TON-Foundation-Industry-Announcement-Featured-Image-Template.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/UPSCALED-TON-Foundation-Industry-Announcement-Featured-Image-Template.jpg 1500w, https://dailyhodl.com/wp-content/uploads/2023/10/UPSCALED-TON-Foundation-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/10/UPSCALED-TON-Foundation-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/10/UPSCALED-TON-Foundation-Industry-Announcement-Featured-Image-Template.jpg?resize=768,768 768w, https://dailyhodl.com/wp-content/uploads/2023/10/UPSCALED-TON-Foundation-Industry-Announcement-Featured-Image-Template.jpg?resize=1024,1024 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/UPSCALED-TON-Foundation-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/10/UPSCALED-TON-Foundation-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w, https://dailyhodl.com/wp-content/uploads/2023/10/UPSCALED-TON-Foundation-Industry-Announcement-Featured-Image-Template.jpg?resize=750,750 750w, https://dailyhodl.com/wp-content/uploads/2023/10/UPSCALED-TON-Foundation-Industry-Announcement-Featured-Image-Template.jpg?resize=1140,1140 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>October 11, 2023 – Zug, Switzerland Today, The Open Network Foundation (TON Foundation) announces their upcoming attempt to officially be named the world’s fastest blockchain, accredited by Guinness World Records. The public network performance test, which is scheduled for October 31, 2023, at 15:00 UTC, will demonstrate the reliability, scalability and speed of The Open [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/11/the-open-network-ton-to-attempt-world-record-for-the-fastest-blockchain/\">The Open Network (TON) To Attempt World Record for the Fastest Blockchain</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]