[
  {
    "source": "Decrypt",
    "date": "2024-03-04T19:30:50.000Z",
    "title": "Zero Balance? Coinbase Crashes Again as Bitcoin Surges",
    "url": "https://decrypt.co/220117/coinbase-crash-again-bitcoin-price-surge",
    "description": "Coinbase crashed yet again as a Monday surge in Bitcoin's price brought another surge in traffic."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-04T19:21:02.000Z",
    "title": "Bitcoin Funds Swell With Another $1.84 Billion in Fresh Cash",
    "url": "https://decrypt.co/220098/bitcoin-funds-swell-with-another-1-84-billion-in-fresh-cash",
    "description": "And BlackRock’s iShares Bitcoin Fund is the biggest winner. "
  },
  {
    "source": "Decrypt",
    "date": "2024-03-04T19:11:02.000Z",
    "title": "Bitcoin Ordinals Boom Yields Record $1 Million NodeMonkes Sale",
    "url": "https://decrypt.co/220107/bitcoin-ordinals-record-1-million-nodemonkes-sale",
    "description": "NodeMonkes are on top as the leading NFT project over the last week, capped off by a $1 million Bitcoin Ordinals sale."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-04T19:36:43.000Z",
    "title": "Orange Domains: Bridging Traditional DNS with Bitcoin’s BNS for Enhanced Web3 Connectivity",
    "url": "https://www.cryptopolitan.com/orange-domains-dns-bitcoins-bns-connectivity/",
    "description": "Trust Machines, a leading Bitcoin infrastructure development company, has unveiled its latest venture, Orange Domains, with the ambitious goal of revolutionizing the way the Bitcoin Name System (BNS) operates.&#160; The new entity is set to enhance the functionality of BNS domains, fostering greater integration with the traditional Domain Name System (DNS) and paving the way [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-04T19:33:47.000Z",
    "title": "Marathon mines largest-ever Bitcoin block on record",
    "url": "https://www.cryptopolitan.com/marathon-largest-bitcoin-block-on-record/",
    "description": "The recent mining of the largest-ever Bitcoin block has captured the attention of the cryptocurrency community, signaling a significant milestone in the evolution of blockchain technology. This monumental achievement, achieved through a collaboration between Marathon Digital’s Slipstream and OrdinalsBot, underscores the growing interest in innovative approaches to data inscription and distribution. Marathon records remarkable mining [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-04T19:23:25.000Z",
    "title": "U.S. national debt climbs by at least $1 trillion every 3 months",
    "url": "https://www.cryptopolitan.com/us-national-debt-climbs-by-1t-3-months/",
    "description": "The U.S. is witnessing a rapid increase in its national debt, marking a significant uptick by approximately $1 trillion every 100 days. Recently, this trend has become more pronounced, with the debt ballooning to over $34 trillion as of early January. This acceleration is a departure from previous patterns where the rise to similar amounts [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-04T19:17:26.000Z",
    "title": "Bitcoin ETFs trigger institutional gold rush, predicts MicroStrategy co-founder",
    "url": "https://www.cryptopolitan.com/bitcoin-etfs-trigger-institutional-gold-rush/",
    "description": "The launch of spot Bitcoin exchange-traded funds (ETFs) has sparked a decade-long institutional &#8220;gold rush&#8221; for Bitcoin, according to Michael Saylor, the co-founder and executive chairman of MicroStrategy. Speaking at the Bitcoin Atlantis conference on March 1, Saylor suggested that Bitcoin has entered a &#8220;high growth institutional adoption phase,&#8221; projecting this trend to continue until [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-04T19:11:04.000Z",
    "title": "Memecoin Price Prediction 2024 – 2033: Is MEME A Wise Investment?",
    "url": "https://www.cryptopolitan.com/memecoin-price-prediction-2023-2040-is-meme-a-wise-investment/",
    "description": "Memecoin MEME Overview Today’s Memecoin price is $0.05117 with a 24-hour trading volume of $749,191,497. Memecoin is down 0.81% in the last 24 hours. The current CoinMarketCap ranking is 141, with a live market cap of $531,188,377. It has a circulating supply of 10,634,227,013 MEME coins and a max. supply of 69,000,000,000 MEME coins. Memecoin [&#8230;]"
  }
]