[
  {
    "source": "Decrypt",
    "date": "2024-01-19T18:13:38.000Z",
    "title": "Nintendo Switch 2 Preview: Everything You Need to Know",
    "url": "https://decrypt.co/197793/nintendo-switch-2-rumors-leaks-latest-news",
    "description": "UPDATED: Hundreds of developers admit in a major industry survey that they're working on Nintendo Switch 2 games. Here's everything we know so far."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-19T18:23:33.000Z",
    "title": " Grayscale’s GBTC bleeding drives down AUM by $5B  ",
    "url": "https://cointelegraph.com/news/grayscale-gbtc-bleeding-drives-down-aum",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvM2M1MjA0MWYtMWQyMi00NjgzLTliY2MtNDdmMjY4NzQ0OTBkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Heavy outflows and the decline in Bitcoin’s price are driving down the value of GBTC’s portfolio despite solid demand for other Bitcoin ETFs.</p>\n                    <p><p>Outflows from Grayscale’s Bitcoin Trust (GBTC) intensified in the first days of trading as a spot Bitcoin exchange-traded fund (ETF), contributing to the decline in assets under management by nearly $5 billion.</p><p data-ct-non-breakable=\"true\">According to data from YChart and Grayscale, the ETF's total assets dropped from $28.5 billion on Jan. 10 to $23.7 billion on Jan. 18. </p><p data-ct-non-breakable=\"true\">Bitcoin’s price decline also explains the drop in AUM. As the underlying asset of the ETF, Bitcoin’s market value has a direct impact on the value of the fund. At the time of writing, Bitcoin's (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price is down 4% over the past week, trading at $40,582, per Cointelegraph data.</p><p><a href=\"https://cointelegraph.com/news/grayscale-gbtc-bleeding-drives-down-aum\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-19T18:14:31.000Z",
    "title": "BlackRock’s Bitcoin ETF becomes third fastest to reach $1 billion in assets, hitting milestone in 4 days",
    "url": "https://cryptoslate.com/insights/blackrocks-bitcoin-etf-becomes-third-fastest-to-reach-1-billion-in-assets-hitting-milestone-in-4-days/",
    "description": "<p>Quick Take Bitcoin ETFs, with just five days of trading under their belts, have already made significant strides in the financial arena. Notably, Fidelity&#8217;s FBTC and BlackRock&#8217;s IBIT ETFs have swiftly crossed the billion-dollar threshold, managing $1 billion and $1.2 billion in assets, respectively. Bloomberg&#8217;s Senior ETF Analyst, Eric Balchunas, provides a comparative perspective by [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/blackrocks-bitcoin-etf-becomes-third-fastest-to-reach-1-billion-in-assets-hitting-milestone-in-4-days/\">BlackRock&#8217;s Bitcoin ETF becomes third fastest to reach $1 billion in assets, hitting milestone in 4 days</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-19T18:31:01.000Z",
    "title": "China collaborates with Huawei and other tech giants to pioneer metaverse development",
    "url": "https://www.cryptopolitan.com/china-huawei-metaverse-development/",
    "description": "In a significant move to shape the future of the metaverse industry, China&#8217;s Ministry of Industry and Information Technology (MIIT) has established a dedicated working group. This initiative, announced on January 19, marks a concerted effort by the world&#8217;s second-largest economy to standardize and drive growth in this emerging sector. The task force, comprising government [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-19T18:28:11.000Z",
    "title": "OpenAI announces collaboration with Arizona State University",
    "url": "https://www.cryptopolitan.com/openai-announces-arizona-state-university/",
    "description": "Arizona State University (ASU) and OpenAI, a leading artificial intelligence (AI) developer, have recently unveiled a groundbreaking collaboration that brings ChatGPT Enterprise into the realm of higher education. This partnership, announced on January 18, positions ASU as the first higher education institution to embark on a collaborative journey with OpenAI in implementing advanced AI solutions. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-19T18:16:52.000Z",
    "title": "Flow Coin Price Prediction 2024-2033: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Flow Coin Price Prediction 2024-2034 Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-19T18:31:10.000Z",
    "title": "Analyst: Coinbase poised to win dismissal over SEC lawsuit",
    "url": "https://crypto.news/analyst-coinbase-poised-to-win-dismissal-over-sec-lawsuit/",
    "description": "Litigation analyst Elliott Stein thinks Coinbase will win full dismissal of the SEC’s current lawsuit against the exchange."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-19T18:25:38.000Z",
    "title": "Bitcoin and Ethereum correlation plunges to lowest since 2021",
    "url": "https://crypto.news/bitcoin-and-ethereum-correlation-plunges-to-lowest-since-2021/",
    "description": "Kaiko Research highlighted that the correlation between Bitcoin and Ethereum has dropped below its average of 0.71 for the first time since 2021. "
  },
  {
    "source": "BTCManager",
    "date": "2024-01-19T18:10:00.000Z",
    "title": "Fidelity’s spot Bitcoin ETF reaches $1b inflows",
    "url": "https://crypto.news/fidelitys-spot-bitcoin-etf-reaches-1b-inflows/",
    "description": "Fidelity's Wise Origin Bitcoin Fund (FBTC) became the second spot Bitcoin ETF to surpass $1 billion in inflows, achieving this feat just five days into trading"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-19T18:30:55.000Z",
    "title": "Analyst: Until Bitcoin Retests $61k, The BTC Top Is Not In",
    "url": "https://www.newsbtc.com/bitcoin-news/analyst-until-bitcoin-retests-61k-the-btc-top-is-not-in/",
    "description": "Despite recent dips in price, Bitcoin is still on track for further gains, according to BitQuant. Based on technical analysis, the analyst predicts that the world&#8217;s most valuable coin will likely top out at $61,000, not $50,000, as some analysts have suggested. Bitcoin Has Room For Growth, May Peak At $61,000 Sharing a screen grab on X, the analyst argues that based on Bitcoin&#8217;s history, prices tend to peak once it retests the 2X100 exponential moving average (EMA). So far, prices are lower, trading below $45,000, and the uptrend is valid despite the recent cool-off.  For this reason, BitQuant is confident that the recent drop was a temporary correction. Accordingly, BTC will likely extend gains, breaking above immediate resistance levels at $45,000 and even $50,000 in the short to medium term. Related Reading: Crypto Analyst Sounds Alarm: Bitcoin Price Set To Plunge Even Lower Still, it should be noted that the 2X100 EMA is a technical indicator and may lag. Since the indicator averages past prices, it might not be accurate, showing current events and expectations of prices. To demonstrate, in the last bear market, Bitcoin prices dipped below the 2X100 EMA as the coin tanked to as low as $16,000 by November 2022. This development wasn&#8217;t expected by the community, taking adherents by surprise. So far, looking at the Bitcoin price action in the daily chart, the path of least resistance is northwards. Though the approval of spot Bitcoin ETFs by the United States Securities and Exchange Commission (SEC) was expected to lift prices immediately, BTC unexpectedly crashed.  Bears appear in control, recently forcing prices below a short-term support level. For this reason, the immediate trend aligns with the January 12 bear engulfing bar. Making projections from this formation, BTC may, if bears take charge, drop to $40,000 or lower. BTC Demand Surging Even with this bearish outlook, the encouraging surge of capital to approved spot Bitcoin ETFs is bullish. Investor Fred Krueger notes that in the last five days alone, IBIT, the spot Bitcoin ETF issued by BlackRock, the world&#8217;s largest asset manager, received $1 billion.  Related Reading: Why Did The Bitcoin Price Fall Below $41,000? Looking at the pace of inflows, not only IBIT but other spot Bitcoin ETFs, Krueger believes BTC is undervalued at spot rates. The investor estimates that spot Bitcoin ETF issuers now hold over 650,000 BTC, up from 619,000 BTC as of January 1. This suggests that institutional investors are increasingly bullish on Bitcoin, and prices, though depressed, might recover going forward. Feature image from Canva, chart from TradingView"
  }
]