[
  {
    "source": "Decrypt",
    "date": "2024-02-12T16:14:25.000Z",
    "title": "Bitcoin Breaks $50K for First Time Since Hitting All-Time High in 2021",
    "url": "https://decrypt.co/217033/bitcoin-breaks-50k-first-time-since-2021",
    "description": "BTC has gained more than 15% over the past seven days and is now the highest it's been since December 2021."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-12T16:33:28.000Z",
    "title": "Bitcoin spot ETFs by the numbers: one month later",
    "url": "https://cryptodaily.co.uk/2024/02/bitcoin-spot-etfs-by-the-numbers-one-month-later",
    "description": "2024 kicked off to an exhilarating start, with Bitcoin spot ETF approvals on the horizon and the Cryptocurrency market in a clear uptrend as a result. The debut of these new BTC-backed products, however, resulted in a strong, 20% correction in Bitcoin."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-12T16:19:19.000Z",
    "title": "Is this the time to buy high-potential GameFi cryptos?",
    "url": "https://cryptodaily.co.uk/2024/02/is-this-the-time-to-buy-high-potential-gamefi-cryptos",
    "description": "With bitcoin threatening its yearly high, and the whole of the altcoin space trending upward, is it time to stick a small bet on a couple of gaming cryptos? Beam (BEAM) and Phantasma (SOUL) are two possibilities."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-12T16:18:17.000Z",
    "title": "Marathon Digital Reportedly Mulling Africa Expansion",
    "url": "https://cryptodaily.co.uk/2024/02/marathon-digital-reportedly-mulling-africa-expansion",
    "description": "Bitcoin mining giant Marathon Digital is expanding its business and reportedly exploring Africa as an option."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-12T16:20:19.000Z",
    "title": "Ripple’s (XRP) Resistance Fail: Why Technicals Suggest Holding Might Be Smarter",
    "url": "https://cryptodaily.co.uk/2024/02/ripples-xrp-resistance-fail-why-technicals-suggest-holding-might-be-smarter",
    "description": "Dive into the latest developments in Ripple (XRP), from high-stakes transactions and market reactions to technical analysis and the impact of the ongoing SEC lawsuit. Discover how these factors are shaping Ripple's journey in the dynamic world of cryptocurrency."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-02-12T16:30:59.000Z",
    "title": "BEAM and KAS Rise This Week Snagging Double-Digit Gains; XMR, FXS, and RON Face Sharp Declines",
    "url": "https://news.bitcoin.com/beam-and-kas-rise-this-week-snagging-double-digit-gains-xmr-fxs-and-ron-face-sharp-declines/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/alststdhhjk-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BEAM and KAS Rise This Week Snagging Double-Digit Gains; XMR, FXS, and RON Face Sharp Declines\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/02/alststdhhjk-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/alststdhhjk-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/alststdhhjk-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/alststdhhjk-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/alststdhhjk-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/alststdhhjk-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/02/alststdhhjk.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In the past week, bitcoin has risen over 10% and ethereum has seen a growth of more than 7%. Meanwhile, several cryptocurrency assets have posted significant double-digit increases. Notably, beam (BEAM) experienced a surge of over 49%, and kaspa (KAS) enjoyed a 37% uptick in its value within the same timeframe. 7-Day Crypto Gainers and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-12T16:37:45.000Z",
    "title": "NSW Schools Trial AI Chat App to Enhance Learning",
    "url": "https://www.cryptopolitan.com/nsw-schools-trial-ai-chat-app/",
    "description": "Discover the groundbreaking trial of NSWEduChat, an innovative AI chat app designed to enhance learning in NSW schools.  "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-12T16:26:41.000Z",
    "title": "Drexel’s Robotics and AI Fusion Sets New Benchmark in Structural Integrity Assurance",
    "url": "https://www.cryptopolitan.com/drexels-robotics-and-ai-fusion-sets-new/",
    "description": "Researchers at the Drexel University College of Engineering have unveiled a groundbreaking advancement in structural safety inspections, utilizing autonomous robots integrated with state-of-the-art machine learning technology.&#160; This innovative approach promises to enhance the efficiency and accuracy of structural assessments, potentially revolutionizing the maintenance of buildings and infrastructure. Drexel University: Advancing structural monitoring technology The recent [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-12T16:23:59.000Z",
    "title": "Polygon Labs Innovates with Type 1 Prover for EVM Chains and ZK Scaling Solutions",
    "url": "https://www.cryptopolitan.com/polygon-labs-type-1-prover-evm-zk-scaling/",
    "description": "In an innovative stride towards blockchain scalability and efficiency, Polygon Labs recently unveiled its latest technological breakthrough: the &#8220;type 1 prover.&#8221;&#160; The pioneering technology stands to revolutionize the way Ethereum Virtual Machine (EVM) compatible chains integrate zero-knowledge (ZK) scaling solutions, marking a significant leap towards broader adoption of validium networks for proof verification and settlement [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-12T16:20:13.000Z",
    "title": "Microsoft’s Future Plans for Xbox Consoles and Game Titles Revealed",
    "url": "https://www.cryptopolitan.com/microsofts-future-plans-for-xbox-consoles/",
    "description": "In recent events, speculation surrounding the future of Xbox consoles and the potential multiplatform release of popular titles has reached a fever pitch. While rumors have swirled online, Microsoft has remained tight-lipped, leaving fans and industry insiders eagerly awaiting official confirmation. However, recent developments hint at a significant shift in strategy for the tech giant. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-12T16:17:16.000Z",
    "title": "Aquanow receives most comprehensive crypto license from Dubai’s virtual asset regulator",
    "url": "https://www.cryptopolitan.com/aquanow-receives-most-comprehensive-crypto-license-from-dubais-virtual-asset-regulator/",
    "description": "Dubai&#8217;s virtual asset regulator has awarded its 20th VASP ( Virtual asset service provider license) to Canadian based Aquanow. This is considered the most comprehensive license to date as it includes not only a crypto brokerage license but also crypto lending, borrowing and investment. VARA ( Virtual asset regulatory Authority) for Dubai had stated in [&#8230;]"
  }
]