[
  {
    "source": "CryptoSlate",
    "date": "2023-11-30T10:45:20.000Z",
    "title": "FTX seeks court approval to slash US IRS’s $24B claim to zero",
    "url": "https://cryptoslate.com/ftx-seeks-court-approval-to-slash-us-irss-24b-claim-to-zero/",
    "description": "<p>The bankrupt FTX estate wants to set the United States Internal Revenue Service (IRS) $24 billion claims against it to $0.00, according to a Nov. 29 court filing. Earlier in the year, the federal agency had slapped a tax bill worth around $44 billion on FTX and Alameda groups of companies, prioritizing its claims over [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/ftx-seeks-court-approval-to-slash-us-irss-24b-claim-to-zero/\">FTX seeks court approval to slash US IRS&#8217;s $24B claim to zero</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-30T10:45:46.000Z",
    "title": "Galaxy’s Novogratz predicts Bitcoin reaching $70k with ETF approval",
    "url": "https://crypto.news/galaxys-novogratz-predicts-bitcoin-reaching-70k-with-etf-approval/",
    "description": "Galaxy Digital founder Mike Novogratz believes the market will see a &#8216;pretty successful shift of psychology&#8217; when the government allows spot Bitcoin ETFs. Bitcoin (BTC) is poised to reach its old highs a year from now, should the U.S. Securities&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-30T11:00:27.000Z",
    "title": "Crypto Analyst Who Sold The Bitcoin Top Reveals How To Buy And Sell At The Perfect Time",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-buy-and-sell-perfect-time/",
    "description": "Long-term crypto investor Jelle who caught the Bitcoin top in 2021 recently provided insights as to the best time to buy and sell crypto assets. Jelle provided a background for his knowledge as he stated these insights helped him sell his Bitcoin holdings at the peak of the last bull run.  A Powerful Bull Market Indicator In a post shared on his X (formerly Twitter) platform, Jelle explained one of the “most powerful bull market indicators” that could help traders understand the direction of the market. This was based on how to use moving averages (MAs) for trade entries and exits. To enter trades, Jelle noted that he usually finds the confluence between MAs and horizontal levels.  Related Reading: Dogecoin Holders Cross 5 Million, Catalyst For Price To Reach $0.1? The analyst shared a chart to elaborate his point further. According to him, there is usually a good entry when price retests an area that “makes sense both horizontally, and MA-wise.” This strategy is said to work well in the early stages of the bull market. However, he warned that traders will likely have to rely on MAs alone further into the bull market.  Source: X He went on to give an insight into his Bitcoin trading strategy in particular. He said he uses the 21-week moving average when trading the flagship cryptocurrency. In relation to the lower timeframes and altcoins, Jelle mentioned that a combination of the 25, 50, and 200 Exponential Moving Average (EMA) works well.   Finding Trade Exits For Assets Like Bitcoin  Jelle also gave insights as to how to find trade exits. He noted that selling to MAs works well too and this is preferable when there is a confluence between the MAs and the horizontal levels. He also discovered that this strategy works best in downtrends. However, that was how he exited the Bitcoin market at its peak back in 2021.  Source: X As to the best time to use MAs for exits and entries, Jelle stated that it works best when there is a strong trend present. Meanwhile, the strategy is said to be “much less accurate in a sideways market.” Although he decided not to go into details, he mentioned that mean reversion strategies are more successful during such conditions.  Related Reading: Bitcoin Spot ETF: SEC Delays Fail To Stop BTC As Price Clears $38,000 Generally, Jelle believes MAs are a “great indicator in the trading toolbox.” However, he cautioned traders not to “blindly trade” when the price reaches an MA. Instead, they should also take a look at how the price reacts to the area. He gave an example of how wicks through an MA can tell one how “it is being respected.” Jelle had previously given insights as to how to buy the right dips in a bull market. His insights had also bordered on using Moving Averages to achieve this.   BTC loses footing above $38,000 &#124; Source: BTCUSD on Tradingview.com Featured image from BBVA.ch, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-30T10:43:30.000Z",
    "title": "Algorand (ALGO) Expands Its Footprint in India with Billion-Dollar Companies NASSCOM, TiE Bangalore, and Mann Deshi Foundation",
    "url": "https://www.crypto-news-flash.com/algorand-algo-expands-its-footprint-in-india-with-billion-dollar-companies-nasscom-tie-bangalore-and-mann-deshi-foundation/?utm_source=rss&utm_medium=rss&utm_campaign=algorand-algo-expands-its-footprint-in-india-with-billion-dollar-companies-nasscom-tie-bangalore-and-mann-deshi-foundation",
    "description": "<img width=\"1388\" height=\"684\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/06/Algorand.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Algorand\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/06/Algorand.jpg 1388w, https://www.crypto-news-flash.com/wp-content/uploads/2020/06/Algorand-300x148.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/06/Algorand-1024x505.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/06/Algorand-768x378.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/06/Algorand-24x12.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/06/Algorand-36x18.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/06/Algorand-48x24.jpg 48w\" sizes=\"(max-width: 1388px) 100vw, 1388px\" />Algorand announces strategic partnerships with NASSCOM, TiE Bangalore, and the Mann Deshi Foundation to integrate blockchain into Indian sectors. Algorand enhances Web3 skills in India through educational initiatives and collaborates on a blockchain project for women&#8217;s financial inclusion. Algorand (ALGO), a prominent blockchain protocol, has announced a series of strategic partnerships. These collaborations are with [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-30T10:46:53.000Z",
    "title": "Binance Web3 Wallet Celebrates Milestone: One Million Users",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/binance-web3-wallet-celebrates-milestone-one-million-users/",
    "description": "<p>This achievement not only underscores the platform&#8217;s popularity. But also, highlights the increasing significance of decentralized technologies in the cryptocurrency landscape. Let&#8217;s discover why this happened so fast. We just hit a new milestone: 1 million #Binance Web3 wallets created. Have you tried it yet? pic.twitter.com/K4uHkkEFr2 &#8212; Richard Teng (@_RichardTeng) November 30, 2023 User-Friendly Interface [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/binance-web3-wallet-celebrates-milestone-one-million-users/\">Binance Web3 Wallet Celebrates Milestone: One Million Users</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]