[
  {
    "source": "Decrypt",
    "date": "2023-07-04T18:51:32.000Z",
    "title": "Two Twitter Alternatives Take Flight This Week—What's Spill and Threads?",
    "url": "https://decrypt.co/147310/twitter-alternatives-spill-meta-threads",
    "description": "Elon Musk adding tweet limits is sending users scrambling. It might have come at the right time for these two new Twitter rivals."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-04T18:40:01.000Z",
    "title": "New UK crypto ad laws will go into effect in October",
    "url": "https://cryptoslate.com/uks-new-crypto-ad-laws-will-go-into-effect-in-october/",
    "description": "<p>The United Kingdom&#8217;s Financial Conduct Authority (FCA) said the new financial promotions regime would apply to crypto assets starting October 8. In a July 4 letter, the financial regulator outlined several legal routes for firms to promote crypto assets to U.K. consumers. These legal routes include communication by an authorized person, communication by an unauthorized [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/uks-new-crypto-ad-laws-will-go-into-effect-in-october/\">New UK crypto ad laws will go into effect in October</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T19:08:01.000Z",
    "title": "BlackRock reveals surveillance-sharing agreement with Coinbase in its filing",
    "url": "https://www.cryptopolitan.com/blackrock-reveals-agreement-with-coinbase/",
    "description": "Asset manager BlackRock’s recent filing for a spot Bitcoin exchange-traded fund (ETF) has revealed a “surveillance-sharing agreement” with leading cryptocurrency exchange Coinbase. The filing, submitted to the United States Securities and Exchange Commission (SEC) on June 29 by the Nasdaq stock exchange, sought a rule change to enable the listing of BlackRock’s Bitcoin ETF. In ... <a title=\"BlackRock reveals surveillance-sharing agreement with Coinbase in its filing\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blackrock-reveals-agreement-with-coinbase/\" aria-label=\"More on BlackRock reveals surveillance-sharing agreement with Coinbase in its filing\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T19:07:56.000Z",
    "title": "China’s Jinan now accepts digital yuan for bus fare",
    "url": "https://www.cryptopolitan.com/jinan-now-accepts-digital-yuan-for-bus-fare/",
    "description": "Navigating the busy streets of Jinan, the heart of eastern China&#8217;s Shandong Province, has taken a significant stride into the digital age. The city now welcomes digital yuan, the innovative central bank digital currency (CBDC) of China, as a valid payment method across all its bus routes. This milestone marks an important chapter in the ... <a title=\"China&#8217;s Jinan now accepts digital yuan for bus fare\" class=\"read-more\" href=\"https://www.cryptopolitan.com/jinan-now-accepts-digital-yuan-for-bus-fare/\" aria-label=\"More on China&#8217;s Jinan now accepts digital yuan for bus fare\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T18:58:47.000Z",
    "title": "NASA’s VIPER Rover Navigates Terrifying Lunar Terrain Ahead of Uncrewed 2024 Mission",
    "url": "https://www.cryptopolitan.com/nasas-viper-rover-navigates-2024-mission/",
    "description": "NASA is making significant progress in constructing its first-ever robotic lunar rover, the Volatiles Investigating Polar Exploration Rover (VIPER). The rover is scheduled for launch in late 2024, but the exact conditions it will encounter on the Moon remain uncertain. To prepare for any terrain challenges, engineers have conducted a series of tests to determine ... <a title=\"NASA&#8217;s VIPER Rover Navigates Terrifying Lunar Terrain Ahead of Uncrewed 2024 Mission\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nasas-viper-rover-navigates-2024-mission/\" aria-label=\"More on NASA&#8217;s VIPER Rover Navigates Terrifying Lunar Terrain Ahead of Uncrewed 2024 Mission\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-04T18:56:43.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-04T19:00:08.000Z",
    "title": "Federal Reserve Certifies 57 Organizations For Instant Payments System ‘FedNow’",
    "url": "https://www.newsbtc.com/crypto/federal-reserve-certifies-57-organizations-for-instant-payments-system-fednow/",
    "description": "The United States Federal Reserve has made a significant announcement regarding the certification of 57 organizations, including financial institutions and service providers, for the highly anticipated launch of the FedNow Service.  With major players in the banking industry, such as JPMorgan Chase, Bank of New York Mellon, US Bancorp, and Wells Fargo, among the certified entities named by the Fed, the stage is set for a transformative shift in the financial landscape. Testing And Certification Completion For FedNow The Federal Reserve has disclosed that 57 early adopter organizations have successfully completed formal testing and certification for the upcoming FedNow Service launch planned for late July. Related Reading: XRP, Cardano Among Altcoins To Keep An Eye On: Santiment This diverse group consists of financial institutions and service providers that are ready to send and receive transactions, supporting settlement and processing on behalf of participants. The US Department of the Treasury is also among the early adopters, reflecting the breadth of involvement in this groundbreaking initiative. Readiness and Final Trial Runs The certified organizations are currently undergoing final trial runs to confirm their readiness in handling live transactions over the new instant payments infrastructure.  This critical phase ensures that the participants can seamlessly embrace the capabilities of FedNow, providing enhanced payment experiences to their customers.  As part of this process, comprehensive testing and validation have been conducted to ensure compatibility, reliability, and optimal performance. The FedNow Service is designed to be a platform for innovation, allowing financial institutions to adopt and build upon its capabilities over time. With the goal of offering new instant payment services to their customers, these institutions are expected to leverage FedNow for various use cases such as account-to-account transfers, requests for payment, bill payments, and more.  Crypto total market cap continues to recover &#124; Source: Crypto Total Market Cap on TradingView.com This forward-looking approach fosters a dynamic and evolving financial ecosystem, catering to the changing needs of businesses and individuals alike. In addition to the early adopters, the Federal Reserve continues to collaborate with financial institutions planning to join the FedNow Service later in 2023 and beyond.  This ongoing effort aims to build a robust network that encompasses all 10,000 US financial institutions, ensuring nationwide reach and accessibility.  Related Reading: Solana (SOL) Price Targets 40% Rally Amid Strong Fundamentals By facilitating participation from organizations of all sizes and geographical locations, the Federal Reserve paves the way for a comprehensive and inclusive instant payment ecosystem. This instant payment system is set to revolutionize the US payment infrastructure, enabling individuals and businesses to make faster and more efficient transactions. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T19:03:16.000Z",
    "title": "Terra Classic (LUNC) Price Rises as Binance Destroys 2.65 Billion Tokens in Burn",
    "url": "https://www.crypto-news-flash.com/terra-classic-lunc-price-rises-as-binance-destroys-2-65-billion-tokens-in-burn/?utm_source=rss&utm_medium=rss&utm_campaign=terra-classic-lunc-price-rises-as-binance-destroys-2-65-billion-tokens-in-burn",
    "description": "Leading cryptocurrency exchange, Binance, has successfully burnt over 2 billion Terra Classic (LUNC) tokens this July.  The massive LUNC token burn has influenced market sentiments, as the price of LUNC soared by 3% following the recent burn.  The Binance cryptocurrency exchange has recently burnt a significant amount of Terra Classic ( LUNC). The burn was [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T19:00:28.000Z",
    "title": "Riding the Crypto Wave with Hollywood X PEPE (HXPE) Meme Coins Summer 2023",
    "url": "https://www.crypto-news-flash.com/riding-the-crypto-wave-with-hollywood-x-pepe-hxpe-meme-coins-summer-2023/?utm_source=rss&utm_medium=rss&utm_campaign=riding-the-crypto-wave-with-hollywood-x-pepe-hxpe-meme-coins-summer-2023",
    "description": "As the summer sun blazes, so does the crypto market! One coin that has ignited the market is Hollywood X PEPE ($HXPE). Digital currencies are seeing explosive growth, but nothing compares to the fire of the meme coins in the summer of 2023. Today, we&#8217;ll dive deep into the waters of this trend and help [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T18:59:37.000Z",
    "title": "Polkadot (DOT) at the Forefront of AI Adoption: Latest Initiatives Showcase its Vision",
    "url": "https://www.crypto-news-flash.com/polkadot-dot-at-the-forefront-of-ai-adoption-latest-initiatives-showcase-its-vision/?utm_source=rss&utm_medium=rss&utm_campaign=polkadot-dot-at-the-forefront-of-ai-adoption-latest-initiatives-showcase-its-vision",
    "description": "Origin Trail will play a significant role in establishing a solid foundation for AI on Polkadot and Web 3.0.  There has been a concerning decline in funding and development activity for the Polkadot ecosystem in Q2 2023. Polkadot (DOT) stands out from its counterparts by placing a strong emphasis on artificial intelligence (AI), which has [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-04T18:52:02.000Z",
    "title": "IOTA’s Impressive Progress: ShimmerEVM Testnet Launch and Governance Milestones – When Will Coordicide Bring Full Decentralization to the Tangle?",
    "url": "https://www.crypto-news-flash.com/iotas-impressive-progress-shimmerevm-testnet-launch-and-governance-milestones-when-will-coordicide-bring-full-decentralization-to-the-tangle/?utm_source=rss&utm_medium=rss&utm_campaign=iotas-impressive-progress-shimmerevm-testnet-launch-and-governance-milestones-when-will-coordicide-bring-full-decentralization-to-the-tangle",
    "description": "IOTA&#8217;s ShimmerEVN reportedly processed 15 million transactions with an average block time of 800 milliseconds in the second quarter of 2023. Two independent committees were established to promote the growth of the Shimmer ecosystem. IOTA (MIOTA) has released its second quarter progress report covering wide arrays of updates including the Shimmernet. A quick review of [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-04T18:45:36.000Z",
    "title": "UK on Path Toward Crypto Clarity As Financial Services and Markets Bill Inches Toward Legislation",
    "url": "https://dailyhodl.com/2023/07/04/uk-on-path-toward-crypto-clarity-as-financial-services-and-markets-bill-inches-toward-legislation/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/uk-on-path-clarity.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/uk-on-path-clarity.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/uk-on-path-clarity.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/uk-on-path-clarity.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/uk-on-path-clarity.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/uk-on-path-clarity.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/uk-on-path-clarity.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The United Kingdom (UK) is taking a step to increase regulatory clarity for cryptocurrencies with the final approval of a bill related to digital assets. According to a new press release, the Financial Services and Markets Act (FSMB) 2023 was granted Royal Assent, the final step in the process to become law. The bill enables [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/04/uk-on-path-toward-crypto-clarity-as-financial-services-and-markets-bill-inches-toward-legislation/\">UK on Path Toward Crypto Clarity As Financial Services and Markets Bill Inches Toward Legislation</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-04T18:41:37.000Z",
    "title": "Macro Guru Raoul Pal Gives Crypto Portfolio Update, Says Markets Look Bullish From Here on Out",
    "url": "https://dailyhodl.com/2023/07/04/macro-guru-raoul-pal-gives-crypto-portfolio-update-says-markets-look-bullish-from-here-on-out/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/Altcoin-Bulls-Are-Taking-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/Altcoin-Bulls-Are-Taking-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/Altcoin-Bulls-Are-Taking-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/Altcoin-Bulls-Are-Taking-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/Altcoin-Bulls-Are-Taking-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/Altcoin-Bulls-Are-Taking-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/Altcoin-Bulls-Are-Taking-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Real Vision founder Raoul Pal says that he&#8217;s remaining bullish on digital assets after significantly increasing his position size during the bear market. In a new Bankless interview, the former Goldman Sachs executive gives a portfolio update, saying he&#8217;s still invested heavily into one of Ethereum&#8217;s (ETH) biggest rivals. &#8220;I don&#8217;t change it a lot. I&#8217;m [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/04/macro-guru-raoul-pal-gives-crypto-portfolio-update-says-markets-look-bullish-from-here-on-out/\">Macro Guru Raoul Pal Gives Crypto Portfolio Update, Says Markets Look Bullish From Here on Out</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]