[
  {
    "source": "Cointelegraph",
    "date": "2023-07-20T06:30:00.000Z",
    "title": "Myanmar’s shadow government backs launch of crypto-based bank",
    "url": "https://cointelegraph.com/news/myanmar-shadow-government-backs-crypto-bank-launch",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/4702efd3-7b66-4c4a-979b-1621dd9bb740.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Spring Development Bank is Myanmar’s first financial institution to run entirely on crypto and blockchain.</p>\n                    <p><p>Myanmar’s first entirely crypto-based banking institution has announced a soft launch for July 22 — a move that could see the country’s shadow government given greater access to financial services and funding.</p><p>The Spring Development Bank is named after the Spring Revolution, the opposition movement led by Myanmar’s exiled National Unity Government (NUG) against the ruling State Administration Council (SAC) — a military junta that <a href=\"https://cointelegraph.com/news/myanmar-s-military-government-considers-launching-digital-currency-report\">seized control of the country</a> in February 2021.</p><p>The bank’s target demographic isn’t just the 55 million Burmese living in Myanmar, but also the two-million-strong “Burmese diaspora”, who live and work outside of Myanmar and frequently send money back to the country.</p><p>Constructed on Polygon, the bank’s main goal is to make both domestic and international payments faster and more efficient, as well as offer international access to a broad array of financial products. </p><p>A Spring Development Bank official who asked to remain anonymous for security reasons told Cointelegraph that crypto was the obvious solution to provide financial support to Burmese citizens as well as its exiled government. </p><blockquote>“Spring Development Bank and the blockchain technology it’s powered by is the natural progression in terms of a fundraising strategy for the NUG.”</blockquote><p>The new crypto bank was not launched directly by the NUG, but the official noted it has been launched with its full support and resources. Additionally, the bank is licensed and regulated by the NUG-controlled interim central bank of Myanmar. </p><p>The bank’s CEO, who goes by the name Calvin T for security reasons, told Cointelegraph that the launch of the new institution signaled the first step in returning financial freedom to Myanmar. </p><p>Tin Tun Naing, the governor of Myanmar’s interim central bank and acting minister for finance and industry, described the bank as a fundamentally “revolutionary” institution.</p><blockquote>“We cannot just move funds into a banking system controlled by the military, so we have to provide this alternative financial system that’s based on trust and guaranteed by the government.”</blockquote><p>Naing claimed the military-based financial system is “falling apart” and the Spring Development Bank would help <a href=\"https://cointelegraph.com/news/exiled-myanmar-democratic-leaders-want-to-issue-cbdc-to-fund-the-revolution\">secure financial assets</a> for citizens. </p><p>The fees currently levied on sending money back to the country by traditional means can reportedly reach as high as 30%. </p><p>“Everything’s built on Polygon, for cost reasons but also because we felt that the Polygon ecosystem was likely to survive over the longer term,” the official explained. </p><p>The bank will issue a number of new fiat-pegged stablecoins, including the Myanmar kyat, Thai baht, Singapore dollar and the U.S. dollar. Users can plug these assets into the bank’s “currency swap” feature, built on UniSwap V3, which will allow for the exchange of stablecoins.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ripple-clo-court-ruling-encourage-banks-adopt-xrp\"><strong><em>Ripple CLO says court ruling could encourage banks to adopt XRP</em></strong></a></p><p>In Myanmar, residents who show support for the NUG — which could be something as simple as having the wrong app on their phone — are routinely “made an example of” through public <a href=\"https://theconversation.com/military-violence-in-myanmar-is-worsening-amid-fierce-resistance-and-international-ambivalence-203646\" target=\"_blank\" rel=\"noopener nofollow\">displays</a> of violence and imprisonment, the official said.</p><p>As such, the bank’s user interface has been designed as a “web-only” platform.</p><p>“The bank's interface will look and feel like an application, but we encourage everyone to access it using their incognito window so it doesn't store any browser history,” the official explained.</p><p>On Dec. 31, 2021, the <a href=\"https://cointelegraph.com/news/myanmar-shadow-government-declares-stablecoin-usdt-an-official-currency\">NUG declared the U.S. dollar-pegged stablecoin</a> Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) legal tender in a bid to speed up international trade</p><p>The NUG was formally <a href=\"http://www.senat.fr/leg/tas21-002.html?msdynttrid=R4pr3j4ZEPuHnyjm1swr5ZNfpCYs0gcsSh4PCDXITqs\" target=\"_blank\" rel=\"noopener nofollow\">recognized</a> as the official government of Myanmar by numerous <a href=\"https://www.ohchr.org/en/press-releases/2023/01/myanmar-un-experts-report-highlights-juntas-fraudulent-claim-legitimacy\" target=\"_blank\" rel=\"noopener nofollow\">members</a> of the United Nations and the European <a href=\"https://thediplomat.com/2021/10/eu-parliament-voices-support-for-myanmars-opposition-government/\" target=\"_blank\" rel=\"noopener nofollow\">Parliament</a> in October 2021. The United States, however, has yet to officially recognize the exiled government. </p><p><strong><em>Asia Express: </em></strong><a href=\"https://cointelegraph.com/magazine/china-expands-cbdcs-tentacles-malaysia-is-hks-new-crypto-rival-asia-express/\"><strong><em>China expands CBDC’s tentacles, Malaysia is HK’s new crypto rival</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T06:16:55.000Z",
    "title": "Shake-Up at Sequoia Capital: Departures of Key Partners Mark Transformation",
    "url": "https://www.cryptopolitan.com/sequoia-capital-partners-mark-transformation/",
    "description": "Sequoia Capital, the renowned venture capital firm with a storied history of successful investments, has experienced a series of significant transformations in the past year. This period has been marked by market turbulence, restructuring, and the departure of several key investors. Among those leaving the firm is veteran partner Michael Moritz, who will shift his ... <a title=\"Shake-Up at Sequoia Capital: Departures of Key Partners Mark Transformation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sequoia-capital-partners-mark-transformation/\" aria-label=\"More on Shake-Up at Sequoia Capital: Departures of Key Partners Mark Transformation\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-20T06:18:49.000Z",
    "title": "XRP Maintains Bullish Run With Nearly 80% Rally – Is $1 Within Reach?",
    "url": "https://www.newsbtc.com/breaking-news-ticker/xrp-maintains-bullish-run/",
    "description": "XRP has undergone a remarkable price upsurge, surging to more than $0.80 and witnessing an impressive 77% increase over the past seven days in trading activity. This surge was predominantly triggered by Ripple’s partial victory against the United States Securities and Exchange Commission. In the court ruling, a judge acknowledged that Ripple&#8217;s institutional sales could be considered securities. However, it&#8217;s important to note that not all other sales were classified similarly. This ruling is widely perceived as a significant victory for Ripple Labs and its digital token. Related Reading: XRP Flexes Muscles: Ripple Token Unfazed By Crypto Turmoil With 68% Rally Currently, XRP is edging closer to a crucial resistance level at $0.85, signaling a solid buying pressure prevailing in the market. This optimistic trend bodes well for Ripple&#8217;s medium-term prospects, suggesting favorable times for the digital token. XRP Price Surge And Market Cap Inflow Post-Ripple Vs. SEC Data from crypto market tracker CoinMarketCap shows that XRP is trading at $0.8368, with an impressive 5% increase observed within the last 24 hours. Over the past seven days, the crypto has experienced a substantial surge of a little over 77%.  XRP flashing green in all timeframes. Source: CoinMarketCap This remarkable growth has coincided with an inflow of more than $16 billion to XRP&#8217;s market capitalization. Notably, the market cap has risen from $25 billion on July 12 to its current value of $44 billion, with a significant portion of this increase occurring shortly after the outcome of the Ripple-SEC court case. Related Reading: BNB Chain Unveils Beacon Update – What’s Its Bearing On Price? Despite the remarkable surge, XRP faces a formidable resistance zone at $0.85. This region is characterized by high selling pressure and increased supply, making it challenging for the digital currency to breach this level. Nevertheless, the market sentiment among traders remains bullish, which enhances the probability of XRP breaking through the resistance region. XRP market cap currently at $44 billion. Chart: TradingView.com XRP To Break $1 Threshold? It is essential to exercise caution and consider historical patterns when analyzing price movements. Typically, after significant upward trends, crypto assets tend to undergo a consolidation or correction phase, and XRP is no exception. Therefore, it is likely that the price will enter a short-term correction phase, accompanied by higher volatility and pullback periods, before the next notable upward movement occurs. XRP seven-day price action. Source: CoinMarketCap Considering the bullish momentum fueled by the positive outcome in the SEC lawsuit, XRP has a promising opportunity to surpass the highly anticipated $1 price threshold.  The favorable court ruling and the subsequent surge in price and market capitalization have significantly boosted confidence among investors and traders. If this momentum continues, it could lead to further gains for XRP in the coming days or weeks. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Visit Idaho"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-20T06:20:59.000Z",
    "title": "Crypto Market Watchers Cautious on Prospects of Spot Bitcoin ETFs After BlackRock’s Move",
    "url": "https://www.crypto-news-flash.com/crypto-market-watchers-cautious-on-prospects-of-spot-bitcoin-etfs-after-blackrocks-move/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-market-watchers-cautious-on-prospects-of-spot-bitcoin-etfs-after-blackrocks-move",
    "description": "<img width=\"2560\" height=\"1536\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/bitcoin-3406638-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/bitcoin-3406638-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/bitcoin-3406638-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/bitcoin-3406638-1024x614.jpg 1024w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Market experts collectively speak on BlackRock’s recent Bitcoin Spot ETF application; sentiments have remained mixed.  While the CIO of Bitwise sees a positive outcome for Blackrock, the CEO and Co-founder of Opimas believes that the application is dead on arrival.  Market players in the cryptocurrency industry have spoken up about BlackRock’s recent Bitcoin Spot ETF [...]"
  }
]