[
  {
    "source": "CryptoSlate",
    "date": "2023-07-31T12:00:27.000Z",
    "title": "Binance secures first operational license in Dubai amid regulatory hurdles in Europe.",
    "url": "https://cryptoslate.com/binance-secures-first-operational-license-in-dubai-amid-regulatory-hurdles-in-europe/",
    "description": "<p>Following multiple setbacks with European regulators, Binance has become the first digital asset exchange to receive an Operational Minimum Viable Product (MVP) license from Dubai&#8217;s Virtual Assets Regulatory Authority (VARA). The news comes as the exchange faces regulatory challenges in several European territories, including Germany, the Netherlands, and the U.K. The Operational MVP license, issued [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-secures-first-operational-license-in-dubai-amid-regulatory-hurdles-in-europe/\">Binance secures first operational license in Dubai amid regulatory hurdles in Europe.</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-31T12:06:02.000Z",
    "title": "Pepeburn (PEPEBURN) Is Now Available for Trading on LBank Exchange",
    "url": "https://cryptodaily.co.uk/2023/07/pepeburn-pepeburn-is-now-available-for-trading-on-lbank-exchange",
    "description": "<p>Road Town, BVI, July 31st, 2023, Chainwire</p><p>LBank Exchange, a global digital asset trading platform, listed Pepeburn (PEPEBURN) on July 31, 2023. For all users of LBank Exchange, the PEPEBURN/USDT trading pair is now officially available for trading.</p><p>Pepeburn (PEPEBURN) is the first deflationary Pepe memecoin aiming to rise from $0.00004 to $100 with the help of unique tokenomics. Its native token, PEPEBURN, was listed on LBank Exchange at 12:00 UTC on July 31, 2023, with the goal of expanding its global footprint and supporting the realization of its forward-thinking objectives.</p><p>Introducing Pepeburn</p><p>LBank Exchange is thrilled to announce the listing of Pepeburn (PEPEBURN), the first deflationary Pepe memecoin aiming to rise from $0.00004 to $100 with the help of unique tokenomics. This new opportunity, backed by unique tokenomics, aims to achieve similar phenomenal gains. The circulating supply of PEPEBURN will be kept at less than 1 million tokens, ensuring scarcity and paving the way for incredible potential. With just a $10 million market cap, the value of each token could skyrocket to $10, making it an enticing investment prospect.</p><p>The roadmap of Pepeburn outlines exciting developments that will drive utility and adoption. Plans include the launch of a PEPEBURN Telegram buy bot and Twitter bot, which could enhance accessibility and user engagement. Furthermore, there are ambitious goals to establish an NFT Marketplace and implement DAO &amp; Governance, ensuring community involvement in decision-making.</p><p>The project is set to go through several phases of growth. The initial phase involves the launch of social media channels, listing on PancakeSwap, and gaining traction with 1,000+ holders. The second phase focuses on listing on centralized exchanges (CEX), conducting giveaways, and forming community partnerships to go viral. As the project gains momentum, the third phase will introduce even more utilities, including the NFT Marketplace, a staking platform, and a decentralized exchange (DEX), aiming to reach 100,000+ holders.</p><p>Overall, PepeBurn presents itself as an enticing investment opportunity, offering the potential for substantial returns. However, it's important to remember that investing in cryptocurrencies carries inherent risks, and one should always exercise caution and conduct thorough research before making any financial decisions. The project's success relies heavily on market sentiment and demand, making it crucial for investors to stay informed about the project's progress and developments. If you're eager to join the journey of potential millionaires, consider exploring the possibilities offered by PEPEBURN today.</p><p>About PEPEBURN Token</p><p>Based on BEP-20, PEPEBURN has a total circulation supply of 1 million (i.e. 1,000,000). PEPEBURN has no team tokens, implements a 5% buy tax (4% current marketing and utilities and 1% for buyback) and 5% sell tax for future listings in LBank, with ownership renounced, 99% of tokens sent to the burn wallet, and contract renounced. It was listed on LBank Exchange at 12:00 UTC on July 31, 2023, investors who are interested in PEPEBURN can easily buy and sell it on LBank Exchange now. The listing of PEPEBURN token on LBank Exchange will undoubtedly help it further expand its business and draw more attention in the market.</p><p>Learn More about PEPEBURN Token:</p><p>Official Website |  Twitter | Telegram | Contract</p><p>About LBank</p><p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge growing platform that ensures the integrity of users' funds and aims to contribute to the global adoption of cryptocurrencies.</p><p>Start Trading Now: lbank.com</p><p>Community &amp; Social Media:&nbsp;Telegram l&nbsp;Twitter l&nbsp;&nbsp;Facebook l&nbsp;LinkedIn l&nbsp;Instagram l&nbsp;YouTube</p><p>Press contact:&nbsp;</p><p>press@lbank.info</p><p>Business Contact:</p><p>LBK Blockchain Co. Limited</p><p>LBank Exchange</p><p>marketing@lbank.info</p><p>business@lbank.info</p><p></p><p></p>ContactLBK Blockchain Co. Limitedmarketing@lbank.info"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-31T11:57:52.000Z",
    "title": "Binance Becomes First to Receive Operational MVP License in Dubai",
    "url": "https://cryptodaily.co.uk/2023/07/binance-becomes-first-to-receive-operational-mvp-license-in-dubai",
    "description": "<p>Binance FZE, the exchange&rsquo;s Dubai-based subsidiary, has become the first exchange to receive an Operational Minimum Viable Product License in Dubai. </p>\n<p>Binance, the world&rsquo;s largest crypto exchange, has been awarded an Operational Minimum Viable Product (MVP) license from Dubai&rsquo;s Virtual Asset Regulatory Authority (VARA). Binance FZE is the first cryptocurrency exchange in the world to receive such a license.</p>\n\n<p dir=\"ltr\" lang=\"en\">#Binance FZE, our Dubai based subsidiary, is the world's first exchange to receive the Operational Minimum Viable Product licence in Dubai.Eligible users can now access regulated virtual asset services, such as fiat on and off ramp services via Binance FZE.More here 👇</p>\n&mdash; Binance (@binance) July 31, 2023\n<p>\n\n</p>\nBinance Granted Permission to Offer Broker-Dealer Services in Dubai\n<p>In a blog post, Binance announced the news today, saying that the license allows it to offer services in Dubai approved by VARA, including exchange and broker-dealer services. Binance said the services are currently limited to institutional and qualified retail investors.</p>\n<p>The exchange secured a provisional MVP license in March 2022 and a preparatory MVP license in September 2022. The exchange&rsquo;s progression from a Provisional License to an Operational License allows eligible users in the country &ldquo;to access authorized services, including the ability to safely convert virtual assets to fiat under VARA-designated standards compliant with the intergovernmental Financial Action Task Force.&rdquo;</p>\n<p>Head of Regional Markets at Binance, Richard Teng, said:</p>\n\n<p>&ldquo;We are honored to be the first exchange to be granted an operational Minimum Viable Product License by VARA &mdash; a result of over a year of due diligence, collaboration, and consistent demonstration of responsible intent &ndash; that now allows us to be able to leverage the potential of a progressive regulatory framework, enabling innovation while furthering user protection.&rdquo;</p>\n\n<p>Adding,</p>\n\n<p>&ldquo;Operating within this regulated ecosystem, we are committed to ensuring secure and seamless customer migration, with robust Know-Your-Customer and Customer-Due-Diligence as part of the rigorous onboarding remediation as stipulated by VARA. Our priority is to be able to operate this first fully regulated exchange in, and from Dubai, in a FATF-compliant ecosystem, setting the stage for global scalability with uncompromised user assurance.&rdquo;</p>\n\nBinance Looks to UAE for Future Prospects\n<p>Last month, the exchange said it was considering a move to Dubai as it continues its struggles with the US SEC. Alex Chehade, Binance Dubai&rsquo;s General Manager, said that the exchange believes the UAE is a prime destination for crypto businesses and applauds the region&rsquo;s pro-crypto stance and policies.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-31T12:00:03.000Z",
    "title": "Ahead Of The Pack: Binance Moves Forward With New License in Dubai",
    "url": "https://www.newsbtc.com/binance/binance-moves-forward-with-new-license-in-dubai/",
    "description": "Binance, the world’s largest crypto exchange by trading volume, recently announced that it had secured a license to operate in Dubai after meeting the conditions needed for the grant of an Operational Minimum Viable Product (MVP) license. The firm has emerged as the premier platform to secure the highly coveted accreditation from Dubai’s Virtual Asset Regulatory Authority (VARA). Binance Is Blazing The Trail In The Cryptocurrency Ecosystem Last year, Binance was granted a Provincial License by Dubai’s Virtual Assets Regulatory Authority (VARA), enabling it to establish domestic bank accounts to preserve clients’ funds, offer custody and payment services, and run a crypto exchange.  Related Reading: Here’s How Long The Majority Of New Ethereum Wallets Are Used Before They’re Dumped However, the newly acquired Operational MVP license allows the crypto exchange to legally conduct two more activities which are virtual asset broker-dealer services and virtual asset exchange services. Although these activities are only limited to qualified institutional and retail investors. Obtaining the Operational MVP license is not only an outstanding milestone but evidence of Binance’s dedication to becoming a regulatory-compliant exchange platform. According to the firm, they are working with local regulators to ensure that their operations are designed to meet the country’s unique framework for Virtual Asset Service Providers (VASPs).  BNB price recovers to $243 &#124; Source: BNBUSD on Tradingview.com Improving Service Delivery and Ensuring Security In recent years, the United Arab Emirates has emerged as the bastion of blockchain technology, building an ecosystem that allows innovation and security to thrive alongside the other. The pivot from Provisional to Operational MVP license will provide users in Dubai with improved access to services. Participants can now convert their virtual assets to fiat currency by following the guidelines laid down by VARA. Institutions and individuals who are eligible for these services can utilize the market assurance standards and protections crafted especially for the virtual asset sector. According to Binance, the license signifies the creation of the first fully regulated exchange in Dubai after meeting the compliance requirements of FATF, thereby establishing the framework for unwavering user assurance and global growth.  Related Reading: Court Filing Suggests FTX’s $2 Billion Lawsuit Against Genesis Is Coming To An End The licensing procedure in Dubai is a four-stage process, and with the recent license granted to Binance, it means the platform has now cleared three of these stages. The only outstanding license is the Full Market Product (FMP), however; this is expected to be granted after the latest demonstration of compliance with all the rules of VARA. This recent win comes as Binance prepares to re-enter Japan amidst regulatory challenges with the United States Securities and Exchange Commission this year. Featured image from Financial Times, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-31T12:06:05.000Z",
    "title": "Pepeburn (PEPEBURN) Is Now Available for Trading on LBank Exchange",
    "url": "https://www.crypto-news-flash.com/pepeburn-pepeburn-is-now-available-for-trading-on-lbank-exchange/?utm_source=rss&utm_medium=rss&utm_campaign=pepeburn-pepeburn-is-now-available-for-trading-on-lbank-exchange",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1600-900en_1690798653Ne42f8BrLu.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1600-900en_1690798653Ne42f8BrLu.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1600-900en_1690798653Ne42f8BrLu-300x180.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1600-900en_1690798653Ne42f8BrLu-1024x614.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/1600-900en_1690798653Ne42f8BrLu-768x461.jpeg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Road Town, BVI, July 31st, 2023, Chainwire LBank Exchange, a global digital asset trading platform, listed Pepeburn (PEPEBURN) on July 31, 2023. For all users of LBank Exchange, the PEPEBURN/USDT trading pair is now officially available for trading. Pepeburn (PEPEBURN) is the first deflationary Pepe memecoin aiming to rise from $0.00004 to $100 with the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-31T12:05:11.000Z",
    "title": "Pepecoin (PEPE) Witnesses Fresh Pumps, But Explosive New Meme Coin Takes The Spotlight",
    "url": "https://www.crypto-news-flash.com/pepecoin-pepe-witnesses-fresh-pumps-but-explosive-new-meme-coin-takes-the-spotlight/?utm_source=rss&utm_medium=rss&utm_campaign=pepecoin-pepe-witnesses-fresh-pumps-but-explosive-new-meme-coin-takes-the-spotlight",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T095907.084.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T095907.084.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T095907.084-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T095907.084-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Investors are constantly looking for coins with significant price potential in the crypto market, where prices fluctuate with the seasons. One crypto that has witnessed fresh pumps is Pepecoin (PEPE), an ERC-20 meme token. While the price of PEPE has increased by 1.35%, DigiToads (TOADS), a relatively new meme coin with high utility, has been [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-31T11:52:24.000Z",
    "title": "Elon Musk’s Dogecoin (DOGE) Reward Questioned, VC Spectra (SPCT) Presale Pumps Millions",
    "url": "https://www.crypto-news-flash.com/elon-musks-dogecoin-doge-reward-questioned-vc-spectra-spct-presale-pumps-millions/?utm_source=rss&utm_medium=rss&utm_campaign=elon-musks-dogecoin-doge-reward-questioned-vc-spectra-spct-presale-pumps-millions",
    "description": "<img width=\"512\" height=\"301\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T143158.617.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T143158.617.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-31T143158.617-300x176.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The Dogecoin (DOGE) community has been in chaos as Elon Musk cryptically puts Dogecoin (DOGE) in its bio right after he announced that he would rebrand Twitter into X. Meanwhile, as Dogecoin (DOGE) holders scramble to find the meaning behind Elon Musk’s actions, VC Spectra (SPCT) attracts thousands of investors even while still in Stage [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-31T12:02:27.000Z",
    "title": "Why is Arkham Getting so Much Negative Attention?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/why-is-arkham-getting-so-much-negative-attention/",
    "description": "<p>Crypto projects often come with a lot of buzz and hype when they launch, and that’s normal for a budding industry. But very few projects have earned divisive opinions as much as Arkham Intel Exchange. Earlier this month, Arkham said it was launching the &#8220;world’s first on-chain intelligence exchange&#8221; and its ARKM token via the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/why-is-arkham-getting-so-much-negative-attention/\">Why is Arkham Getting so Much Negative Attention?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-31T11:45:05.000Z",
    "title": "Charles Hoskinson Announces Goal to Onboard 5,000,000 People to Cardano’s Lace Wallet",
    "url": "https://dailyhodl.com/2023/07/31/charles-hoskinson-announces-goal-to-onboard-5000000-people-to-cardanos-lace-wallet/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/cardano-founder-overblown.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/cardano-founder-overblown.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/cardano-founder-overblown.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/cardano-founder-overblown.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/cardano-founder-overblown.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/cardano-founder-overblown.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/cardano-founder-overblown.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Cardano (ADA) creator Charles Hoskinson is announcing a new goal of onboarding five million new users onto the ecosystem’s Lace wallet. In a new video, the chief executive of Input Output Global (IOG) provides an update to his 318,000 YouTube subscribers on Cardano&#8217;s identity-focused project in Ethiopia that aims to archive students’ academic records. Hoskinson [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/31/charles-hoskinson-announces-goal-to-onboard-5000000-people-to-cardanos-lace-wallet/\">Charles Hoskinson Announces Goal to Onboard 5,000,000 People to Cardano’s Lace Wallet</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]