[
  {
    "source": "Cointelegraph",
    "date": "2023-07-07T00:17:15.000Z",
    "title": "FBI searched Kraken co-founder's home in March: Report",
    "url": "https://cointelegraph.com/news/fbi-search-kraken-founder-jesse-powell-home",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/946038bc-b8df-4492-9c55-c34f3607f286.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Electronic devices were seized from former Kraken CEO Jesse Powell’s Los Angeles home in connection to a non-crypto-related investigation into alleged hacking and cyberstalking.</p>\n                    <p><p>The United States Federal Bureau of Investigations (FBI) reportedly searched the home of Kraken co-founder <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2021/jesse-powell\">Jesse Powell</a> in March as part of an investigation into claims he hacked and cyber-stalked a nonprofit arts group.</p><p>It is claimed that Powell interfered with computer accounts by blocking access to emails and other messages from contributors of Verge Center for the Arts — the non-profit Powell founded, <a href=\"https://www.nytimes.com/2023/07/06/technology/jesse-powell-kraken-crypto-fbi.html\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to a July 6 report from The New York Times, citing three people with knowledge on that matter.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The F.B.I. searched the home of the cryptocurrency executive Jesse Powell in March. <a href=\"https://t.co/NRnK99cts7\">https://t.co/NRnK99cts7</a></p>&mdash; NYT Business (@nytimesbusiness) <a href=\"https://twitter.com/nytimesbusiness/status/1677084012534280192?ref_src=twsrc%5Etfw\">July 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The trio informed The NYT that the FBI and the U.S. Attorney’s Office for the Northern District of California has been investigating Powell since “at least” September.</p><p>Electronic devices were reportedly seized from Powell’s home in Brentwood, Los Angeles as part of the search. However, it is understood that prosecutors have not accused Powell of any crimes.</p><p>Powell’s lawyer, Brandon Fox said the investigation mostly focused on allegations made by Verge Center for the Arts — the nonprofit Powell founded, and not anything to do with Powell’s involvement in the “cryptocurrency arena.” This was reportedly also confirmed by a Kraken spokesperson.</p><p>Fox also said that Powell “did nothing wrong.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/eec7e9dd-d2f1-4a79-aace-be57ba5a439f.png\"  /><figcaption style=\"text-align: center;\"><em>An inside view of Verge Center for the Arts, which was founded by Powell. Source: Verge Center for the Arts</em></figcaption></figure><p>Cointelegraph reached out to Jesse Powell for comment but did not receive an immediate response.</p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/former-ftx-exec-ryan-salame-s-home-searched-by-fbi-report\"><strong>Former FTX exec Ryan Salame’s home searched by FBI: Report </strong></a></p><p>Powell reportedly founded the Sacramento-based arts group in 2007. However, his LinkedIn <a href=\"https://www.linkedin.com/in/jessepowell/\" target=\"_blank\" rel=\"noopener nofollow\">states</a> that he’s worked as the founder and board member since April 2010. </p><p>Kraken remains the second largest United States-based <a href=\"https://cointelegraph.com/news/kraken-crypto-exchange-is-next-to-close-doors-to-russian-users\">cryptocurrency exchange</a> behind Coinbase, <a href=\"https://coinmarketcap.com/rankings/exchanges/\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to CoinMarketCap.</p><p><a href=\"https://cointelegraph.com/news/kraken-reaches-30m-settlement-with-sec-over-staking\">Kraken was hit with enforcement action </a>by the U.S. Securities Exchange Commission in February for failing to register the offer and sale of their staking service program. </p><p>The firm reached a settlement with the securities regulator, paying a lofty $30 million fine.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/opinion-republican-crypto-maxis-democrat-anti-crypto-army-mchenry-warren/\"><strong><em>Opinion: GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  }
]