[
  {
    "source": "CoinDesk",
    "date": "2024-02-27T21:24:34.000Z",
    "title": "Uniswap's 38% Advance Leads CoinDesk 20 Gainers Over the Past Week: CoinDesk Indices Chart Pack",
    "url": "https://www.coindesk.com/markets/2024/02/27/uniswaps-38-advance-leads-coindesk-20-gainers-over-the-past-week-coindesk-indices-chart-pack/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Just four cryptos in the index outperformed Bitcoin's 5.2% gain."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-27T21:13:49.000Z",
    "title": "Pepe leads memecoin rally with blistering 118% surge over 48 hours",
    "url": "https://cryptoslate.com/pepe-leads-memecoin-rally-with-blistering-118-surge-over-48-hours/",
    "description": "<p>Popular memecoin Pepe surged 118% over the past two days to hit a 10-month high on Feb. 27. The memecoin was trading at $0.0000026, up 58% over 24 hours, as of press time. The token hit a high of $0.0000029 before giving up some of the gains over the last two hours, based on CryptoSlate [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/pepe-leads-memecoin-rally-with-blistering-118-surge-over-48-hours/\">Pepe leads memecoin rally with blistering 118% surge over 48 hours</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-27T21:27:19.000Z",
    "title": "BlackRock Bitcoin ETF Surpasses $1 Billion in Trading Volume for Second Consecutive Day",
    "url": "https://www.cryptopolitan.com/blackrock-bitcoin-etf-surpasses-1-billion/",
    "description": "BlackRock&#8217;s iShares Bitcoin Trust (IBIT) has once again captured the spotlight in the cryptocurrency market, with its daily trading volume surpassing $1 billion for the second consecutive day. This remarkable feat underscores the growing significance of institutional investment vehicles in the digital asset space. IBIT&#8217;s exceptional trading volume demonstrates the increasing interest from institutional investors [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-27T21:16:08.000Z",
    "title": "How Babylon is transforming Bitcoin into a PoS powerhouse with Binance Labs",
    "url": "https://www.cryptopolitan.com/babylon-bitcoin-pos-powerhouse-binance-labs/",
    "description": "Binance Labs, the investment arm of the cryptocurrency powerhouse Binance, has recently invested in Babylon, a Bitcoin staking protocol, according to a recent announcement on Feb.27. This initiative is a significant stride in cryptocurrency innovation, allowing Bitcoin holders to stake their assets on Proof-of-Stake (PoS) blockchains. Babylon eliminates the need for third-party custody, bridge solutions, [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-27T21:33:46.000Z",
    "title": "Bitfinex hacker turns government witness, explains tactics used in 2016 theft",
    "url": "https://crypto.news/bitfinex-hacker-tactics-court/",
    "description": "In a recent trial in Washington, Ilya Lichtenstein disclosed how he carried out the monumental Bitcoin theft from the crypto exchange Bitfinex in 2016."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-27T21:28:24.000Z",
    "title": "OKX launches localized platform in Turkey, expands global reach",
    "url": "https://crypto.news/okx-launch-platform-turkey/",
    "description": "Crypto exchange OKX has launched a localized platform in Turkey featuring trading pairs denominated in Turkish Lira."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-27T21:24:03.000Z",
    "title": "Uniswap unveils 3 new tools for smarter crypto swaps",
    "url": "https://crypto.news/uniswap-new-tools-crypto-swaps/",
    "description": "Uniswap has introduced three new tools for crypto users to power simpler and more convenient on-chain transactions."
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-27T21:30:18.000Z",
    "title": "Polygon (MATIC) Whale Makes Large Deposit To Binance, Bearish Sign?",
    "url": "https://www.newsbtc.com/polygon/polygon-matic-whale-deposit-binance-bearish/",
    "description": "On-chain data shows a Polygon whale has made a sizeable deposit to the cryptocurrency exchange Binance, a sign that may be bearish for MATIC. Polygon Whale Has Deposited $13.7M Worth Of MATIC To Binance According to data from the cryptocurrency transaction tracker service Whale Alert, a massive MATIC transaction has been spotted on the blockchain during the past day. The transfer in question involved the movement of 13.1 million MATIC, worth almost $13.7 million in US Dollars, when the transaction went through on the network. Given the large scale of the transfer, it&#8217;s likely that a whale entity was responsible for it. Related Reading: 95% Of Bitcoin Now In Profit: Why This Could Be A Signal To Sell Whales can be influential beings on the blockchain due to their sheer scale of holdings. As such, their movements can be worth watching, as they may lead to fluctuations in the market or, at the very least, inform us about the sentiment among these humongous entities. As for what any such transaction may imply for the market, it comes down to the intent behind it. Below are additional details regarding the latest Polygon whale transfer, which may reveal its context. Looks like this transfer cost a fee of more than $5 to go through on the Ethereum blockchain &#124; Source: Whale Alert As is visible above, the sending address involved in this Polygon transaction was an unknown wallet. This means the address was unaffiliated with any known centralized platform like an exchange and, thus, was likely to be an investor&#8217;s wallet. On the other hand, the receiving address was connected to a centralized entity: the cryptocurrency exchange Binance. Moves like this that go from unknown wallets to exchanges are known as exchange inflows. The whale making an inflow to Binance suggests they wanted to use one of the platform&#8217;s services, which can include selling. As such, the transaction may prove to be bearish for Polygon&#8217;s price if the whale ends up selling their stack. MATIC Is Behind Market With Only 1% Surge Today Whereas the rest of the cryptocurrency market has been racing up in the past day, led by Bitcoin&#8217;s strong surge towards $57,000, Polygon has lagged as the asset has only been able to see an uplift of 1% in the last 24 hours. The below chart shows how the coin has performed in the last few days. The price of the asset appears to have seen some uplift in the past day &#124; Source: MATICUSD on TradingView However, Polygon&#8217;s returns of around 7% over the past week aren&#8217;t too far off from Bitcoin&#8217;s 9% profits in the same period. Still, the relatively poor performance in the past day may be why the whale has potentially decided to sell their large stack. Related Reading: Ethereum Leaves Bitcoin Behind, But Is This Rally Sustainable? Regarding market cap, MATIC is currently the 14th largest coin in the sector, with its closest competitor, Polkadot (DOT), speeding away with its gains of more than 6%. The market cap of the asset seems to be around $10 billion at the moment &#124; Source: CoinMarketCap Featured image from Thomas Kelley on Unsplash.com, chart from TradingView.com"
  }
]