[
  {
    "source": "Cointelegraph",
    "date": "2024-01-04T08:33:11.000Z",
    "title": " Gamma protocol investigates potential attack that drained Ether ",
    "url": "https://cointelegraph.com/news/gamma-protocol-investigates-attack-drained-ether",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYzJkMmFiZGEtMjQ2Ny00MTVlLWIyZmUtZmVlNDhjYmVkYjQ2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p> The DeFi protocol Gamma Strategies potentially lost nearly $500,000 in an exploit, according to blockchain investigator PeckShield.</p>\n                    <p><p>Ethereum-based asset management protocol Gamma Strategies announced an investigation into an ongoing security incident that potentially drained at least 211.9 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>).</p><p>On Jan. 4, blockchain investigator PeckShield <a href=\"https://twitter.com/PeckShieldAlert/status/1742753372334399513\" target=\"_blank\" rel=\"noopener nofollow\">detected</a> an exploit worth roughly $469,000 linked to Gamma Strategies. </p><p>Soon after, the decentralized finance (DeFi) protocol confirmed a “possible security incident” while confirming that users were still able to withdraw their funds if they needed to. </p><p><a href=\"https://cointelegraph.com/news/gamma-protocol-investigates-attack-drained-ether\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-04T08:30:47.000Z",
    "title": " Spot Bitcoin ETF vs. self-custody: Is there a conflict? ",
    "url": "https://cointelegraph.com/news/spot-bitcoin-etf-vs-self-custody",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvNWFmMGRkOGItYjVjZS00ODVkLTg2N2UtYjE0N2M0MDkxZTgxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>There is no conflict between spot Bitcoin ETFs and self-custody, and it’s rather a matter of preference, according to execs and analysts from Valkyrie, Jan3 and Bloomberg.</p>\n                    <p><p>As the crypto community holds its collective breath in anticipation of the potential approval of a spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund (ETF) in the United States, Trezor Bitcoin analyst Josef Tětek has argued that such products could <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-millions-unbacked-btc\">take people further from self-custody</a>. However, many industry observers don't see a direct confrontation between the concept of a spot Bitcoin ETF and self-custody.</p><p>A <a href=\"https://cointelegraph.com/learn/bitcoin-etfs-a-beginners-guide-to-exchange-traded-funds\">spot Bitcoin ETF is an investment product</a> that tracks the price of BTC by holding Bitcoin and allows investors to buy and sell BTC through a traditional brokerage account. Unlike a Bitcoin ETF — which offers indirect exposure to BTC — self-custodial solutions enable one to own Bitcoin directly, with <a href=\"https://cointelegraph.com/innovation-circle/understanding-crypto-custody-what-different-solutions-entail-for-investors-and-businesses\">users taking sole responsibility for holding the private key</a> to access the assets.</p><p>Cointelegraph spoke to several executives and analysts in the industry to find out whether they agree with Tětek on this issue and found that not many do. Most said they believe that these various, and different, methods of exposure to Bitcoin do not compete with each other.</p><p><a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-vs-self-custody\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-04T08:37:22.000Z",
    "title": "Vitalik Buterin Blessing Boosts ENS Price: Token Soars On ‘Super Important’ Label",
    "url": "https://www.newsbtc.com/news/vitalik-buterin-blessing-boosts-ens-price-token-soars-on-super-important-label/",
    "description": "ENS, which stands for the Ethereum Name Service, witnessed a phenomenal increase of more than 50% in the value of its governance token on Wednesday. The abrupt increase in price may be ascribed to the influential endorsement provided by Vitalik Buterin, one of the co-founders of the Ethereum blockchain. Investors were energized and the ENS token reached unprecedented heights as a result of Buterin&#8217;s unequivocal declaration concerning the project&#8217;s importance. Related Reading: SEI What? Token Rules Top 100 Listing With 80% Rally As Crypto Market Wobbles Buterin&#8217;s Endorsement: ENS And Ethereum&#8217;s Future With Buterin calling ENS &#8220;super important&#8221;, the project&#8217;s potential influence on the Ethereum community and the decentralized web is clear. The endorsement of Buterin frequently acts as a catalyst for increased interest and investment in the cryptocurrency and blockchain industries, where his words carry considerable weight. All L2s should be working on (trustless, merkle-proof-based) CCIP resolvers, so that we can have ENS subdomains registerable, updateable and readable directly on L2s. ENS is super-important, it needs to be affordable!https://t.co/Ice1lTttFE — vitalik.eth (@VitalikButerin) January 3, 2024 The Ethereum Name Service initiative offers a decentralized domain name system and is renowned for its contribution to the Ethereum ecosystem&#8217;s user experience simplification and improvement. ENS simplifies blockchain interactions by linking human-readable names to complex Ethereum addresses, thereby increasing accessibility and user-friendliness. The current value of the ENS token, according to the most recent update, is around $14.37, representing a significant increase of 40% over the past 24 hours. Notably, the token has maintained a robust 50% increase over the past week, accumulating an impressive market capitalization of around $423.20 million. ENSUSD currently trading at $15.596 on the daily chart: TradingView.com During the same 24-hour period, the trading volume of the ENS token reached an impressive value of over $360 million, showing a heightened level of market activity. According to CoinMarketCap, the current trading price of ENS has risen from a low of $8.50 on Wednesday to its highest level since April. The considerable volume of transactions highlights the ever-changing characteristics of the market, as investors proactively participate in purchasing and selling in reaction to the latest advancements and endorsements within the ENS ecosystem. Source: Coingecko Token Metrics And Buterin&#8217;s Support ENS presently has a circulating quantity of 30 million tokens, resulting in a market capitalization of over $404 million. Buterin emphasized in a statement on X the necessity for all Layer-2 solutions to concentrate on the development of trustless, Merkle-proof CCIP resolvers. The objective of this endeavor is to facilitate the registration, modification, and perusing of ENS subdomains directly on Layer-2 blockchains. Related Reading: Cardano In 2024: Dollar Dream Or Downward Spiral For ADA? Buterin underscored the significance of ENS, pointing out the imperative for cost-effectiveness in its functioning. The designation &#8220;L2s&#8221; refers to blockchains at the most fundamental layer, Layer-2, which significantly improves the scalability of a Layer-1 blockchain by enabling transactions to occur at a quicker pace and at a lower cost. Buterin brought attention to the markets&#8217; need for universal name systems by describing ENS as extremely crucial, highlighting their importance to the blockchain experience. Featured image from Getty Images"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-04T08:21:00.000Z",
    "title": "MANA Enters ‘Depression’ Phase; LDO May See Bullish Breakout Soon",
    "url": "https://coinedition.com/mana-enters-depression-phase-ldo-may-see-bullish-breakout-soon/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-5-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-5-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-5-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Price-analysis-5-3-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a series of posts on X (formerly Twitter), analyst Ali Martinez noted that the metaverse-based token MANA and the governance token of the Lido DAO, LDO, are two assets primed for a rally in the short term.&#160; MANA Might Have Something Else Planned Martinez assessed MANA’s price movement and noted that the altcoin’s price [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/mana-enters-depression-phase-ldo-may-see-bullish-breakout-soon/\">MANA Enters ‘Depression’ Phase; LDO May See Bullish Breakout Soon</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]