[
  {
    "source": "Bitcoin.com",
    "date": "2023-06-06T07:30:23.000Z",
    "title": "Bank of America Predicts Milds Recession After Fed’s Tightening Action",
    "url": "https://news.bitcoin.com/bank-of-america-predicts-milds-recession-after-feds-tightening-action/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1922471273-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bank of America Predicts Milds Recession After Fed&#039;s Tightening Action\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1922471273-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1922471273-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1922471273-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1922471273-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1922471273-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1922471273-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1922471273.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bank of America is predicting a mild recession will happen during the last two quarters of 2023. Brian Moynihan, CEO of Bank of America stated that this recession will be the consequence of the U.S. Federal Reserve tightening actions in order to fight inflation, and how this will increase unemployment to 4%. Bank of America [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-06T07:37:30.000Z",
    "title": "The Adoption of Cryptocurrencies in Arab Nations: Examining Saudi Arabia’s Recent Move",
    "url": "https://nulltx.com/the-adoption-of-cryptocurrencies-in-arab-nations-examining-saudi-arabias-recent-move/",
    "description": "As governments look for alternatives to established financial institutions in an interconnected world, the rise and use of cryptocurrencies have accelerated. According to recent reports, Saudi Arabia, a significant Arab country, is seeking to join the BRICS New Development Bank (NDB). This development raises concerns regarding the use of cryptocurrencies in Arab countries, particularly Saudi [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-06T07:25:42.000Z",
    "title": "Here’s The Possible Impact The Debt Ceiling Vote Will Have On The Cryptocurrency Space",
    "url": "https://nulltx.com/heres-the-possible-impact-the-debt-ceiling-vote-will-have-on-the-cryptocurrency-space/",
    "description": "The debt ceiling vote is a complicated matter with numerous potential effects on the crypto industry. A U.S. debt default, in the opinion of some analysts, would trigger a sell-off of risky assets like cryptocurrencies. This is because a default would indicate that people no longer have faith in the US government&#8217;s capacity to pay [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-06T07:11:35.000Z",
    "title": "Here’s The Impact Of Russia’s Recent Decision To Use Crypto Exchanges To Settle Cross-border Transactions",
    "url": "https://nulltx.com/heres-the-impact-of-russias-recent-decision-to-use-crypto-exchanges-to-settle-cross-border-transactions/",
    "description": "Russia, a former critic of crypto, is now embracing and implementing blockchain technology. The decision by Russia to settle cross-border transactions through cryptocurrency exchanges may benefit the overall cryptocurrency sector. This is because it would boost interest in cryptocurrencies and would encourage more businesses and people to adopt them. Additionally, it might aid in legitimizing [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-06T07:23:06.000Z",
    "title": "Bitcoin drops to 3-month lows amid Binance drama",
    "url": "https://crypto.news/bitcoin-drops-to-3-month-lows-amid-binance-drama/",
    "description": "The US SEC sued Binance and its CEO Changpeng Zhao (CZ) for violating the securities law. Consequently, bitcoin (BTC) dropped by over 3% as the marketwide bearish FUD rose. Bitcoin has been tumbling since early May. With the current bearish&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-06T07:20:30.000Z",
    "title": "Reggie Fowler, Ex-Minnesota Vikings Co-Owner, Gets 6 Years Jail Term For Crypto Scam",
    "url": "https://www.newsbtc.com/news/vikings-co-owner-gets-jail-time/",
    "description": "Reggie Fowler, a former owner of NFL team Minnesota Vikings, has been meted a six-year prison sentence by a New York judge because of his involvement in a crypto fraud scheme. This scheme encompassed more than $700 million in unregulated transactions carried out over a period of 10 months in 2018.  The 63-year-old Vikings co-owner was convicted on charges of bank fraud and money laundering. The United States Attorney&#8217;s Office in New York released a statement on June 5, revealing that Fowler was sentenced to a total of 75 months.  Related Reading: Pepecoin Frenzy Fades: How Meme Token’s Price, Market Cap Were Cut In Half US Attorney Damian Williams explained that Fowler&#8217;s sentence was a result of his engagement in processing hundreds of millions of dollars in unregulated transactions for cryptocurrency exchanges, acting as an illicit banking entity that evaded federal regulations. Former co-owner of Minnesota Vikings sentenced to 75 months in prison for providing shadow banking services to cryptocurrency exchangeshttps://t.co/Nc2PVhEajw — US Attorney SDNY (@SDNYnews) June 5, 2023 Reggie Fowler: Deception And Misleading Tactics Unveiled Fowler&#8217;s sentencing brings an end to a lengthy case that commenced with his arrest in 2019 for his alleged involvement in shadow banking activities. Shadow banking refers to non-bank entities engaging in bank-like operations, often of an illicit nature. The particular shadow banking entity involved in this case was Crypto Capital Corp, which was established with the purpose of facilitating transactions for cryptocurrency startups that operated outside of the traditional banking system either by choice or necessity. BTCUSD makes a sudden drop to the $25K level today. Chart: TradingView.com Initially, Fowler entered a plea of not guilty to all charges in 2020. However, in April 2022, he changed his plea to guilty. In his recent statement, Williams highlighted that a series of falsehoods allowed Fowler to deceive and mislead several banks. The Deceptive Web Of Global Trading Solutions &#38; Crypto Capital According to Williams, Fowler successfully executed his criminal activities by establishing Global Trading Solutions (GTS) in February 2018. GTS collaborated with Crypto Capital and various other cryptocurrency firms based in Israel. Related Reading: Shiba Inu (SHIB) Poised For Significant Breakout: Here’s What To Watch Out For Within this arrangement, Fowler, GTS, and the crypto firms employed deceitful tactics to bypass licensing requirements. They deceived banks by providing false information, allowing them to open accounts used for processing cryptocurrency transactions. Williams said: “At no point were Fowler, GTS, nor any of the crypto companies ever licensed as a money transmitting business in the United States, as required by federal law.” Fowler took advantage of this setup by opening multiple undisclosed accounts, effectively facilitating the crypto transactions without the banks&#8217; knowledge. Additionally, he failed to disclose GTS&#8217;s affiliation with the crypto firms, further obscuring the true nature of the operations. In addition to the prison sentence imposed on Fowler, he has been ordered to forfeit a staggering $740 million. -Featured image from XFL Newsroom"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-06T07:20:17.000Z",
    "title": "BREAKING: SEC Sues Binance CEO Changpeng Zhao and All Affiliated Companies on 13 Accusations; BTC Price Drops to $25,780",
    "url": "https://www.crypto-news-flash.com/breaking-sec-sues-binance-ceo-changpeng-zhao-and-all-affiliated-companies-on-13-accusations-btc-price-drops-to-25780/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-sec-sues-binance-ceo-changpeng-zhao-and-all-affiliated-companies-on-13-accusations-btc-price-drops-to-25780",
    "description": "<p>The SEC claims that Binance allowed Americans to open accounts and trade on its platform without following proper KYC rules. Binance said that it would defend its position &#8220;vigorously&#8221; against the allegations. Bitcoin and the broader crypto market took a sharp dive on Monday. On Monday, June 5, the U.S. Securities and Exchange Commission (SEC) [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/breaking-sec-sues-binance-ceo-changpeng-zhao-and-all-affiliated-companies-on-13-accusations-btc-price-drops-to-25780/\">BREAKING: SEC Sues Binance CEO Changpeng Zhao and All Affiliated Companies on 13 Accusations; BTC Price Drops to $25,780</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-06T07:20:36.000Z",
    "title": "Bitgert Ventures Invests $3.5M in Beldex to Propel Privacy-focused Solution",
    "url": "https://coinedition.com/bitgert-ventures-invests-3-5m-in-beldex-to-propel-privacy-focused-solution/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Bitgert_Ventures_Invests_3_5M_in_Beldex_to_Propel_Privacy_focused-1-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Bitgert_Ventures_Invests_3_5M_in_Beldex_to_Propel_Privacy_focused-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Bitgert_Ventures_Invests_3_5M_in_Beldex_to_Propel_Privacy_focused-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Bitgert_Ventures_Invests_3_5M_in_Beldex_to_Propel_Privacy_focused-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Bitgert_Ventures_Invests_3_5M_in_Beldex_to_Propel_Privacy_focused-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Bitgert_Ventures_Invests_3_5M_in_Beldex_to_Propel_Privacy_focused-1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Bitgert_Ventures_Invests_3_5M_in_Beldex_to_Propel_Privacy_focused-1.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Bitgert Ventures, a prominent venture capital firm, has announced its strategic investment of $3.5 million in Beldex, a blockchain project aiming to revolutionize how privacy and innovation intersect in the digital world. The announcement was made via a Twitter post by Bitgert Ventures and on its official website, expressing its enthusiasm for the partnership, having [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitgert-ventures-invests-3-5m-in-beldex-to-propel-privacy-focused-solution/\">Bitgert Ventures Invests $3.5M in Beldex to Propel Privacy-focused Solution</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]