[
  {
    "source": "CoinDesk",
    "date": "2023-08-31T13:00:00.000Z",
    "title": "Arbitrum Developer Courts Coders Who Already Know WebAssembly-Compatible Languages",
    "url": "https://www.coindesk.com/tech/2023/08/31/arbitrum-developer-courts-coders-who-already-know-webassembly-compatible-languages/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The new feature \"Arbitrum Stylus\" will make it easy to write smart contracts using computer languages compatible with the WebAssembly or WASM standard – seen as far more common than the Ethereum Virtual Machine or EVM standard that many blockchain developers currently use."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-31T12:56:23.000Z",
    "title": "First Mover Americas: Musk's X Obtains Payment Licenses in Several U.S. States ",
    "url": "https://www.coindesk.com/markets/2023/08/31/first-mover-americas-musks-x-obtains-payment-licenses-in-several-us-states/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for August 30, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-31T13:01:10.000Z",
    "title": "PancakeSwap Expands to Coinbase-Incubated Base Network",
    "url": "https://decrypt.co/154426/pancakeswap-expands-coinbase-incubated-base-network",
    "description": "PancakeSwap joins DeFi heavyweights like Uniswap, SushiSwap, and 1inch launching on the buzzy layer-2 network Base."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-31T13:01:02.000Z",
    "title": "Nexo Rolls Out 'Dual Mode' for its Flagship Crypto Card",
    "url": "https://decrypt.co/154428/nexo-rolls-out-dual-mode-flagship-crypto-card",
    "description": "Nexo's new functionality is now available to Europeans, enabling users to instantly toggle between debit and credit modes."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-31T13:01:00.000Z",
    "title": "How AI analysis can change finance and crypto trading",
    "url": "https://cointelegraph.com/news/ai-analysis-finance-crypto-trading",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/83612bba-d4e0-4670-ae66-baaf0a57beb7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>From offering quality trade predictions to identifying real-time threats to gauging market sentiment instantaneously, here’s how AI is reshaping the future of finance. </p>\n                    <p><p>As artificial intelligence (AI) and its various subsets — such as machine learning (ML) — become more complex and developed, their presence within the financial realm has <a href=\"https://impact.economist.com/perspectives/sites/default/files/aiinfinancialservices.pdf\" target=\"_blank\" rel=\"noopener nofollow\">increased</a> drastically. </p><p><a href=\"https://www.nvidia.com/content/dam/en-zz/Solutions/industries/finance/ai-financial-services-report-2022/fsi-survey-report-2022-web-1.pdf\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to a 2022 report by Nvidia, over 75% of companies operating in the financial sector apply machine or deep learning to optimize their internal operations.</p><p>Moreover, the study notes that 91% of financial firms are now driving critical business outcomes with investments in AI, with many of the surveyed companies stating that the burgeoning technology has helped them yield more accurate prediction models. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/be6ae0cb-5d56-4b39-ac65-094662071091.jpg\"  /></figure><p>More than 30% of respondents claimed that using AI and ML has increased their annual revenue by more than 10%, while over 25% of the surveyees stated that AI has helped them reduce their annual working costs by more than 10%. </p><h3>Data processing redefined </h3><p>Despite its relative nascency, AI is poised to bring significant changes to the financial sector, with its potential being similar to that of computer-driven trading models introduced by Wall Street traders in the 1980s. </p><p>Jeroen Van Lange, founder and analyst for YouTube channel <em>The Blockchain Today</em>, told Cointelegraph: </p><blockquote>“AI is being used to develop machine-learning trading models, detect transactional irregularities, and even analyze complex blockchain data with an exceptionally high level of accuracy.”</blockquote><p>“Moreover, ML-based tools are being used to analyze risk from borrowers to assess their creditworthiness using a broad range of data sources like their social media activity and online behavior,” he added.</p><p>Van Lange highlighted that since most cryptocurrency exchanges provide real-time data linked to their order books, ML algorithms can study these comprehensive data sets to predict short-term price movements.</p><p>Similarly, in the case of derivative exchange data, these models can sort out and process information like open interest, funding rates and taker buy/sell ratios much more rapidly than humans, thus allowing traders to make better investment choices. </p><p>“This is something we have not yet seen before, that programs are thinking for themselves and improving their decision-making capabilities on the fly,” Van Lange said.</p><h3>A new standard for data security</h3><p>The introduction of AI and ML has allowed blockchain systems to enhance their security capabilities. </p><p>AI-enabled platforms can provide users with real-time threat feeds while allowing them to gain actionable insights into various scams, rug pulls and threats.</p><p>Earlier this year, Forta’s monitoring systems <a href=\"https://forta.org/blog/detecting-a-197-million-hack-before-exploitation-euler-finance-hack-retrospective/\" target=\"_blank\" rel=\"noopener nofollow\">detected</a> the attack on the Euler protocol minutes before the hack, which saw $197 million stolen. </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/dmrv-blockchain-carbon-trading\">How blockchain tech and dMRV can help carbon trading markets</a></em></strong></p><p>While Forta was able to provide some advanced notice to Euler, the protocol’s team was unable to respond in time. </p><p>Similarly, Forta’s Attack Detector module was also successful in <a href=\"https://twitter.com/FortaNetwork/status/1645522583637426209\" target=\"_blank\" rel=\"noopener nofollow\">flagging</a> the $3.3 million hack of decentralized finance platform SushiSwap back in April, as well as the flash loan <a href=\"https://twitter.com/FortaNetwork/status/1646600779674050561\" target=\"_blank\" rel=\"noopener nofollow\">attack</a> on Yearn.finance, leading to a loss in excess of $11 million around the same time. </p><p>As a result of its threat detection capabilities, Forta has accrued the financial backing of several prominent industry players, including Coinbase Ventures, a16z, Blue Yard and Blockchain Capital, among others.</p><h2>Solving the issue of liquidity fragmentation</h2><p>Even as the crypto market matures and grows, it still faces several issues around illiquidity, especially when compared with traditional finance. </p><p>Ahmed Ismail, CEO and co-founder of FluidAI, an AI-based crypto aggregation platform, told Cointelegraph that digital asset liquidity is currently siloed with a few major players, making the market extremely inefficient. He added:</p><blockquote>“Even the most stable cryptocurrencies, such as BTC and ETH, are fragile. The crypto market needs high-quality liquidity aggregators so that when volatile conditions are witnessed, market participants can access funds quickly and at the best possible price to maintain some sort of equilibrium.”</blockquote><p>When asked how AI can help address these problems, he noted that aggregators — including FluidAI — use the technology to predict digital asset order book prices in real time, thus providing deeper liquidity for relevant trading pairs. “FluidAI uses an AI-bolstered Smart Order Router and Matching Engine to connect to major centralized and decentralized exchanges and enhance liquidity reserves.”</p><p>Moreover, Ismail said that his platform uses customized algorithms like volume-weighted average price, time-weighted average price, arrival price and volume participation to minimize adverse market impacts and prevent information leakages during the execution of large orders.</p><h3>Sentiment analysis </h3><p>In today’s globalized economy, sentiment analysis continues to play a larger role across various industries, including crypto. </p><p>With AI, businesses can now understand customer sentiments in real time, allowing them to curate and personalize their marketing efforts.</p><p>A recent <a href=\"https://www.mdpi.com/2073-431X/12/2/37\" target=\"_blank\" rel=\"noopener nofollow\">study</a> from researchers at University Canada West notes that AI-powered sentiment analysis tools can comprehend the tone of a statement instead of merely recognizing certain words within a piece of annotated text as being positive or negative. </p><p>Companies can also use these tools as part of broader business strategies to help them outperform competitors, attract and retain consumers, perform live research to assess client interest in certain themes and understand market conditions.</p><p>Lastly, these tools are scalable and suitable for companies handling vast amounts of feedback data. By analyzing this feedback information, it is possible to address areas for improvement, respond to issues promptly, and make informed decisions to enhance customer satisfaction.</p><h3>What lies ahead for the future of finance?</h3><p>Despite the nascency of AI and blockchain technology, Ismail believes these innovations have the potential to complement each other and reshape the way we perceive global finance:</p><blockquote>“Distributed ledger technology offers immutable data storage capabilities with enhanced transparency and traceability. AI, on the other hand, can process enormous amounts of blockchain data to provide intelligent insights and accurate prediction models. By combining the two, market participants can make informed decisions to maintain healthy market metrics.”</blockquote><p>Ismail further claimed that every major financial institution should look closely at utilizing technologies such as natural language processing, deep learning, reinforcement learning, generative models and edge computing to stay ahead of their competition.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\">How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</a></em></strong></p><p>A fairly similar point of view is shared by Cerullo, who believes that using AI within today’s existing financial structures can help investors rake in better returns, at least for certain select trades. That said, he did concede that AI is not some magic wand that can automatically enhance productivity. </p><blockquote>“It can, however, serve as a valuable assistant.”</blockquote><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/ai-analysis-finance-crypto-trading&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-31T12:52:12.000Z",
    "title": "Worldcoin claims to verify one Argentinian every 9 seconds; WLD dumps 9%",
    "url": "https://cryptoslate.com/worldcoin-claims-to-verify-one-argentinian-every-9-seconds-wld-dumps-9/",
    "description": "<p>Digital identity project Worldcoin claimed it verified an Argentinian every nine seconds during an undisclosed day this month, according to an Aug. 31 blog post. The project reported that 9,500 Argentinians successfully verified their World ID on its platform, signaling its significant popularity in the South American nation. Furthermore, due to overwhelming demand, its World [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/worldcoin-claims-to-verify-one-argentinian-every-9-seconds-wld-dumps-9/\">Worldcoin claims to verify one Argentinian every 9 seconds; WLD dumps 9%</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-31T12:47:15.000Z",
    "title": "Binance announces end of support for BUSD stablecoin by February 2024",
    "url": "https://www.cryptopolitan.com/binance-announce-end-of-support-for-busd/",
    "description": "Binance, the world-renowned cryptocurrency exchange, has made a significant announcement that has sent ripples throughout the crypto community. In a recent blog post, the exchange declared its intention to cease support for the Binance USD (BUSD) stablecoin. This decision comes on the heels of Paxos&#8217; move to halt the production of new BUSD coins. By ... <a title=\"Binance announces end of support for BUSD stablecoin by February 2024\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-announce-end-of-support-for-busd/\" aria-label=\"More on Binance announces end of support for BUSD stablecoin by February 2024\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-31T12:43:06.000Z",
    "title": "Circle CEO praises Avocado Multisig wallet despite collateral dropping",
    "url": "https://crypto.news/circle-ceo-praises-avocado-multisig-wallet-despite-collateral-dropping/",
    "description": "Defi protocol and wallet provider Instadapp has launched Avocado Multisig, a multi-chain multisig wallet that aims to redefine security standards in the sector."
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-31T13:00:01.000Z",
    "title": "Court Says Yes To Binance Request In Case Against SEC",
    "url": "https://www.newsbtc.com/binance/binance-case-against-sec/",
    "description": "In a new development in the ongoing case between crypto exchange Binance.US and the Security and Exchange Commission (SEC), the Court has approved Binance’s request for a new attorney. Following approval from Judge Amy Jackson, attorney Andrew Rhys Davies can now appear in court for Binance.US. Approval From US Judge According to a previous filing, attorney Andrew Rhys Davies had initially filed to represent Binance pro hac vice in the lawsuit. However, the federal judge had asked Davies to file a notice of appearance.  Related Reading: This Metric Indicates Shibarium Is Growing Rapidly Following Its Public Launch In the latest filing details on August 30, Davies filed a notice of appearance for BAM Management US Holdings and BAM Trading Services &#8211; the company behind Binance.US.  Granting the motion would mean Davies can now represent Binance in court pro hac vice, as the attorney is not licensed to practice in the jurisdiction. The pro hac vice is usually applied when an attorney who has not been admitted to practice in a certain jurisdiction can participate in a particular case in the jurisdiction.  Davies&#8217; addition to Binance&#8217;s legal team comes with years of experience in cross-border cases involving securities, banking, and financial regulation.  “MINUTE ORDER granting 99 Motion for Leave of Andrew Rhys Davies to Appear Pro Hac Vice only upon condition that the lawyer admitted, or at least one member of the lawyer’s firm, undergo CM/ECF training, obtain a CM/ECF username and password, and agree to file papers electronically,” the court approval document read. BNB ranging $224 as market recovers &#124; Source: BNBUSDT on Tradingview.com Details Of The SEC &#8211; Binance.US Lawsuit The ongoing lawsuit between crypto exchange Binance and the SEC has dragged on for a while, with both parties filing different motions. In its latest move, the SEC filed a motion for leave to file documents under seal in the ongoing case.  According to law experts, this could imply that the filing was made to protect details of a criminal investigation into Binance. Additionally, it could have also been filed to protect the safety or identity of a witness or company involved in the case. Related Reading: Large Transactions Put XRP Price Under Pressure: Are Whales Making An Exit? Binance also previously filed a protective order motion against the SEC. Details of the court filing show that the exchange wanted relief from the regulators’ &#8220;fishing expedition&#8221; and requests for communications that have become “overboard.”  However, Federal Judge Amy Jackson has since passed on the protective order motion to Magistrate Judge Faruqui.  The crypto industry is closely watching how the SEC vs. Binance case unfolds as the outcome could set a precedent for how the regulator approaches the entire crypto industry.   Featured image from Unsplash, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-31T13:06:09.000Z",
    "title": "Dogecoin and Cardano Progress On Development Path While Pomerdoge Holders Anticipate 4,000% Presale Growth",
    "url": "https://www.crypto-news-flash.com/dogecoin-and-cardano-progress-on-development-path-while-pomerdoge-holders-anticipate-4000-presale-growth/",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-176.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-176.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-176-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-176-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Cryptocurrencies, like Dogecoin (DOGE) and Cardano (ADA), are always in the news. However, there&#8217;s a new token, called Pomerdoge, which looks like it might grow a lot. Summary Elon Musk&#8217;s tweets can make Dogecoin (DOGE) trading go way up, but the price can also drop quickly after. Cardano&#8217;s (ADA) development activity is increasing, but the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-31T13:00:37.000Z",
    "title": "LBank’s $PINS IEO Ends with 51,556,343 USDT in Investments, PINs Network (PINS) will be listed in the LBank Innovation Zone",
    "url": "https://www.crypto-news-flash.com/lbanks-pins-ieo-ends-with-51556343-usdt-in-investments-pins-network-pins-will-be-listed-in-the-lbank-innovation-zone/",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/1_1693483009xiyJn2wviD.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/1_1693483009xiyJn2wviD.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/1_1693483009xiyJn2wviD-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/1_1693483009xiyJn2wviD-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/1_1693483009xiyJn2wviD-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Road Town, BVI, August 31st, 2023, Chainwire LBank recently concluded its Initial Exchange Offering (IEO) for the PINs Network project. The event secured a total investment of 51,556,343 USDT from 34,587 participants. This development followed a period of increased activity on LBank, largely due to the IEO&#8217;s specific participation rules. Earlier in the year, LBank reported a [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-31T12:55:00.000Z",
    "title": "Analyst Renews Crypto Market Fears with Bitcoin $8000 Prediction",
    "url": "https://coinedition.com/analyst-renews-crypto-market-fears-with-bitcoin-8000-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Total_market_capitalization_of_crypto_reclaiming_the_200_Week_MA.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Total_market_capitalization_of_#crypto_reclaiming_the_200_Week_MA\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Total_market_capitalization_of_crypto_reclaiming_the_200_Week_MA.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Total_market_capitalization_of_crypto_reclaiming_the_200_Week_MA-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Total_market_capitalization_of_crypto_reclaiming_the_200_Week_MA-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Total_market_capitalization_of_crypto_reclaiming_the_200_Week_MA-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Total_market_capitalization_of_crypto_reclaiming_the_200_Week_MA-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Mike McGlone, Bloomberg Intelligence Senior Commodity Strategist, in a recent interview, said Bitcoin could still drop to a low of $8,000 amid the prolonged market slowdown. McGlone noted that despite its recent selloffs, Bitcoin is still the best-performing asset in the history of the world. He continued that the crypto is still in its infancy [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/analyst-renews-crypto-market-fears-with-bitcoin-8000-prediction/\">Analyst Renews Crypto Market Fears with Bitcoin $8000 Prediction</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]