[
  {
    "source": "Cointelegraph",
    "date": "2024-04-09T04:15:33.000Z",
    "title": " Base overtakes Arbitrum for most active addresses so far this month ",
    "url": "https://cointelegraph.com/news/base-overtakes-arbitrum-most-active-addresses-this-month",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvYzg5OTFmMDctYTJmMy00NGM0LTlmZmYtMjUyNjVjYjJkZDM0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Coinbase layer-2 network Base has seen a strong start to April with active addresses outpacing Arbitrum.</p>\n                    <p><p>The Coinbase-supported Base network has now surpassed Arbitrum as the leading Ethereum layer-2 network by active addresses this month. </p><p>Base has seen over 1.48 million new active addresses over the first nine days of April — narrowly beating out Arbitrum One with 1.43 million active addresses, <a href=\"https://www.growthepie.xyz/fundamentals/daily-active-addresses\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to data from growthepie.</p><p>Ethereum scaling solutions zkSync Era and the Optimism mainnet rounded out the top four with 1.21 million and 650,000 active addresses, respectively. </p><p><a href=\"https://cointelegraph.com/news/base-overtakes-arbitrum-most-active-addresses-this-month\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-04-09T04:24:57.000Z",
    "title": "Lumoz Yields $6 Million Funds and Closes Its Series B Round, at a Valuation of $120 Million",
    "url": "https://www.cryptopolitan.com/lumoz-6-million-funds-valuation-120-million/",
    "description": "Carefully balancing the act of elevating the scalability profile of the blockchain chain enterprise is Lumoz (the ex-Opside), with an intriguing Series A pre-funding round which bagged it a mind-blowing $6 million valuation and an environmental value of an ultramodern enterprise. Being one of the projects listed by the Innovation Fund of the European Union, [&#8230;]"
  }
]