[
  {
    "source": "CryptoSlate",
    "date": "2023-09-30T15:00:57.000Z",
    "title": "Bitwise joins growing list of Ethereum ETF managers",
    "url": "https://cryptoslate.com/bitwise-joins-growing-list-of-ethereum-etf-managers/",
    "description": "<p>Bitwise Asset Management announced the launch of two Ethereum-themed exchange-traded funds (ETFs), joining the growing list of asset managers looking to create Ethereum-based futures products after the SEC greenlit them. The two funds will be called the Bitwise Ethereum Strategy ETF (AETH) and the Bitwise Bitcoin and Ether Equal Weight Strategy ETF (BTOP). Bitwise said [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bitwise-joins-growing-list-of-ethereum-etf-managers/\">Bitwise joins growing list of Ethereum ETF managers</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-30T15:06:30.000Z",
    "title": "Arbitrum set to extend its presence in Japan with a new partnership",
    "url": "https://www.cryptopolitan.com/arbitrum-extend-japan-with-a-new-partnership/",
    "description": "The Arbitrum Foundation, which supports the Ethereum layer-2 network Arbitrum, has teamed up with protocol studio Fracton Ventures to launch “Arbitrum Japan.” This strategic initiative aims to strengthen its presence in Japan, focusing on ecosystem development and community education programs. While the exact funding allocation for this initiative remains undisclosed, both the Foundation and Fracton ... <a title=\"Arbitrum set to extend its presence in Japan with a new partnership\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-extend-japan-with-a-new-partnership/\" aria-label=\"More on Arbitrum set to extend its presence in Japan with a new partnership\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-30T14:54:21.000Z",
    "title": "Paradigm criticizes SEC’s approach to its lawsuit against Binance",
    "url": "https://www.cryptopolitan.com/paradigm-secs-approach-lawsuit-binance/",
    "description": "Paradigm, a prominent venture capital firm, has expressed its criticism of the United States Securities and Exchange Commission (SEC) for what it perceives as the SEC’s departure from standard rulemaking procedures in its current legal action against the cryptocurrency exchange Binance. In a statement released on Friday, September 29, Paradigm raised concerns about the SEC’s ... <a title=\"Paradigm criticizes SEC’s approach to its lawsuit against Binance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/paradigm-secs-approach-lawsuit-binance/\" aria-label=\"More on Paradigm criticizes SEC’s approach to its lawsuit against Binance\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-30T14:40:30.000Z",
    "title": "Nigerian Computer Science Graduate Creates AI Chatbot to Enhance University Admissions",
    "url": "https://www.cryptopolitan.com/nigerian-science-graduate-creates-ai-chatbot/",
    "description": "Julius Odede, a 35-year-old Computer Science graduate from Lagos, Nigeria, has showcased his innovative prowess by developing an Artificial Intelligence (AI) chatbot to assist prospective students with course inquiries. Graduating with a First-Class degree in Data Science from the School of Engineering, Mathematics, and Computer Science at the University of Wolverhampton, Julius&#8217;s journey from Civil ... <a title=\"Nigerian Computer Science Graduate Creates AI Chatbot to Enhance University Admissions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nigerian-science-graduate-creates-ai-chatbot/\" aria-label=\"More on Nigerian Computer Science Graduate Creates AI Chatbot to Enhance University Admissions\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-30T15:00:56.000Z",
    "title": "Crypto CEO Very Bullish On XRP Price, Sets Make Or Break Point",
    "url": "https://www.newsbtc.com/analysis/xrp/crypto-ceo-bullish-xrp-price/",
    "description": "Following its victory against the US Securities and Exchange Commission, the XRP price has been displaying bullish sentiments, effectively gaining the attention of long-term investors seeking to buy and hold to gain more profits. In light of this, a crypto CEO has disclosed his insights on XRP’s bullish outlook, acknowledging the prospects of a bull run in the future. Crypto CEO Concedes Possible XRP Bull Run The market sentiment surrounding Ripple Labs&#8217; native token, XRP has taken a bullish trajectory, increasing investors&#8217; confidence and expectations of a possible bull run.  Related Reading: CRV Price Surges 16% – What’s The Next Move For Curve DAO Token? Matthew Dixon, Chief Executive Officer of Evai, a renowned crypto valuation platform, has recognized and highlighted this shift in market sentiment and aired his remarks on the token’s bullish position in an X (formerly Twitter) post on Friday.  A price surge for the XRP price may be inevitable according to Dixon who used market insights from well-known crypto market analysts who were bullish on the crypto as a basis for his belief. “Listening to other market commentators I hear a lot of Bullishness in the air for XRP. They may well be right,” Dixon stated. XRP price still holding at $0.51 support &#124; Source: XRPUSD on Tradingview.com Dixon Exercises Caution Amidst XRP Price Bullish Sentiment  Amid the backdrop of crypto market volatilities and regulatory uncertainties that have plagued the XRP ecosystem, the cryptocurrency’s bullish trend comes as great news for the XRP community and its investors.  There have been many price predictions for the XRP token. Some market analysts have predicted that the XRP price may see an increase as high as $250. Another analyst also forecasted a price surge of 2500% for the XRP token, pushing the cryptocurrency as high as $20 in the future. Related Reading: Maker (MKR) Inks 20% Price Advance, Leads Top 50 Coins Today XRP’s bullish trend started taking effect after its win over the SEC when US District Judge Analisa Torres ruled in favor of XRP, stating that programmatic XRP sales do not qualify as securities.  Market observers are presently watching the XRP price and the developments in its ecosystem closely. The cryptocurrency has had its fair share of gains and losses this year. Therefore, it remains to be seen if XRP can sustain its bullish sentiment.  Dixon has stated that he would remain cautious of XRP’s bullish momentum while waiting for more compelling evidence of a bull run in the future. The crypto CEO explained that he would remain a short-term investor to avoid significant losses. Nevertheless, he stated that he was also open to being a long-term investor of XRP if the prospects of a bullish run remain strong and the overheard resistance is overcome.  “I will remain cautious until that overhead resistance is convincingly breached. If it is I’m happy to go long but until then shorts are favored with close stop losses,” Dixon stated.  (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from: Invezz"
  }
]