[
  {
    "source": "CoinDesk",
    "date": "2023-10-27T15:51:03.000Z",
    "title": "Crypto Miners Lobby U.S. Lawmakers to Counter Environmental 'Misunderstanding'",
    "url": "https://www.coindesk.com/policy/2023/10/27/crypto-miners-lobby-us-lawmakers-to-counter-environmental-misunderstanding/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "When crypto mining is discussed in the U.S. Congress, it's often tied to claims that mining operations are environmental parasites, sapping finite energy resources. But representatives of that sector flooded offices on Capitol Hill this week to argue their businesses can help stabilize the power grid, tie into renewable resources and foster domestic technology."
  },
  {
    "source": "CoinDesk",
    "date": "2023-10-27T15:47:26.000Z",
    "title": "Protocol Village: Neo to Develop EVM-Compatible Sidechain",
    "url": "https://www.coindesk.com/tech/2023/10/26/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the week of Oct. 16-22, with live updates throughout."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-27T15:46:05.000Z",
    "title": "Deputy Treasury Secretary warns crypto companies not to neglect safeguarding against illicit finance",
    "url": "https://cryptoslate.com/deputy-treasury-secretary-warns-crypto-companies-not-to-neglect-safeguarding-against-illicit-finance/",
    "description": "<p>The U.S. government has raised concerns about digital asset companies failing to address the flow of illicit funds in the industry adequately. In an Oct. 27 speech delivered at London’s Royal United Services Institute, Wally Adeyemo, the U.S. Deputy Treasury Secretary, pointed out that some companies in the crypto industry are primarily focused on technological [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/deputy-treasury-secretary-warns-crypto-companies-not-to-neglect-safeguarding-against-illicit-finance/\">Deputy Treasury Secretary warns crypto companies not to neglect safeguarding against illicit finance</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-10-27T16:02:57.000Z",
    "title": "Roobet Celebrates Nippon Baseball Championship with $1,000,000 Free-to-Play Contest",
    "url": "https://cryptodaily.co.uk/2023/10/roobet-celebrates-nippon-baseball-championship-with-1000000-free-to-play-contest",
    "description": "Robert, the pioneering entertainment company and next-generation crypto brand, is thrilled to announce its official launch in the Japanese market."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-27T15:48:35.000Z",
    "title": "Biggest Movers: TON Leads Bears, as Price Nears Fall Below $2",
    "url": "https://news.bitcoin.com/biggest-movers-ton-leads-bears-as-price-nears-fall-below-2/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2374926785-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"TON Leads Bears, as Price Nears Fall Below $2\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2374926785-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2374926785-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2374926785-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2374926785-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2374926785-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2374926785-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/shutterstock_2374926785.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Toncoin was a notable mover on Friday, as the cryptocurrency edged lower for a second straight session. Price fell by as much as 4% earlier in the day, as price approached a breakout below the $2.00 mark. On the other hand, solana continued to trade around the $33.00 mark. Toncoin (TON) Toncoin dropped for a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-27T15:56:43.000Z",
    "title": "Yuga Labs wins trademark infringement lawsuit against Ryder Ripps",
    "url": "https://www.cryptopolitan.com/yuga-labs-trademark-infringement-ryder-ripps/",
    "description": "A U.S. District Judge in California recently issued a judgment in favor of Yuga Labs, the creators of the popular Bored Ape Yacht Club (BAYC), against Ryder Ripps and Jeremy Cahen, awarding Yuga Labs over $1.5 million in damages. This significant legal victory came as a result of the court’s determination that Ripps and Cahen ... <a title=\"Yuga Labs wins trademark infringement lawsuit against Ryder Ripps\" class=\"read-more\" href=\"https://www.cryptopolitan.com/yuga-labs-trademark-infringement-ryder-ripps/\" aria-label=\"More on Yuga Labs wins trademark infringement lawsuit against Ryder Ripps\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-27T15:46:25.000Z",
    "title": "Alan Wake 2 emerges as a thrilling horror sensation",
    "url": "https://www.cryptopolitan.com/alan-wake-2-emerges-as-a-thrilling-horror/",
    "description": "Alan Wake fans can finally rejoice as the long-awaited sequel, &#8220;Alan Wake 2,&#8221; has been released today on Xbox Series X&#124;S, PlayStation 5, and PC. This highly anticipated game has been a subject of discussion among fans for years, and its arrival marks a significant moment in the gaming world. &#8220;Alan Wake 2&#8221; picks up ... <a title=\"Alan Wake 2 emerges as a thrilling horror sensation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alan-wake-2-emerges-as-a-thrilling-horror/\" aria-label=\"More on Alan Wake 2 emerges as a thrilling horror sensation\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-27T16:00:45.000Z",
    "title": "Shiba Inu Team Member Clarifies SHIB Burn As Shibarium Grows",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-shib-burn-shibarium/",
    "description": "A prominent Shiba Inu team member has come forward to shed light on the proper processes involved in burning the SHIB token.  Shiba Inu Burn Process Demystified In a brief X (formerly Twitter) post on Thursday, Lucie, a popular Shiba Inu marketer provided a detailed guideline on how SHIB users and investors should burn their SHIB tokens. Related Reading: Bitcoin Price Rally: Analyst Sets $45,000 Target And It’s Closer Than You Think Lucie stated that before sending the SHIB token into a dead wallet, users should bridge the SHIB token back to the Ethereum network first.  “To ensure the proper process, if you are a part of the Shibarium project and wish to burn Shib, please make sure to bridge your Shib back to the Ethereum network and then send it to the dead wallet,” Lucie stated.  She stressed the importance of this initial step, stating that bridging the SHIB token first on Ethereum before burning it on Shibarium, allows the original SHIB to be locked in the bridge contract while a minted version of the SHIB token is sent to Shibarium to be burnt.  “When you initially bridge your SHIB to Shibarium, the original Shib tokens are locked in the bridge contract, while a version of the token is minted on Shibarium. This means that when you decide to burn your Shib on Shibarium, you are actually burning the minted version, while the original tokens remain locked in the bridge contract,” Lucie explained.  Presently, Shib burn rates have been increasing as the Shibarium layer 2 network keeps growing. According to Shibburn, Shib burn rates are up 193.46% in the last 24 hours and continue to rise. There have also been approximately 56,436,887 SHIB tokens burned at the time of writing.  SHIB bulls hold steady &#124; Source: SHIBUSD on Tradingview.com Shibarium Surges 493% In Transactions Shibarium, an Ethereum Layer 2 blockchain network for Shiba Inu, has recently experienced a staggering increase in transactions.  The Shibarium network recorded a 493% upsurge in transactions sometime on October 26. A prominent SHIB X account, Kuro SHIBArmy JPN also shared a chart of Shibarium’s daily transactions hitting a 62,560 mark on Thursday.  “Shibarium Daily transactions are on the rise! This is just the beginning,” Kuro SHIBArmy JPN stated.  Related Reading: SEC Demands $700 Million Settlement From Ripple, Pro-XRP Lawyer Reveals Next Steps Presently, the total number of transactions on the Shibarium network is approximately 3,665,371 and the active wallet addresses on the layer 2 network are over 1,2656,600. The daily transactions on Shibarium have also hit approximately 13,550.  The Shib community members are currently celebrating the recent milestones achieved by Shibarium which emphasize the strength of the growing network and its widespread adoption.  Featured image from Shutterstock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-27T16:00:09.000Z",
    "title": "The $CATCH Token: Unveiling the Next Crypto Gaming Gem!",
    "url": "https://www.crypto-news-flash.com/the-catch-token-unveiling-the-next-crypto-gaming-gem/?utm_source=rss&utm_medium=rss&utm_campaign=the-catch-token-unveiling-the-next-crypto-gaming-gem",
    "description": "<img width=\"900\" height=\"600\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/photo_2023-10-27_15-49-23.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/photo_2023-10-27_15-49-23.jpg 900w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/photo_2023-10-27_15-49-23-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/photo_2023-10-27_15-49-23-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/photo_2023-10-27_15-49-23-104x69.jpg 104w\" sizes=\"(max-width: 900px) 100vw, 900px\" />As there are more than ten years since the inception of cryptocurrencies, the hunt for the next crypto gem seems more and more of a hurdle. Primarily due to the vast number of emerging tokens, most of which fade into obscurity due to scams or lack of community support. Dozens of cryptos fade away in [...]"
  }
]