[
  {
    "source": "Cryptopolitan",
    "date": "2023-09-06T04:36:18.000Z",
    "title": "Kontribute on ICP: The Modern Writer’s Toolkit for NFT Story Monetization",
    "url": "https://www.cryptopolitan.com/kontribute-on-icp-writers-toolkit-for-nft/",
    "description": "Unleashing creativity and engaging audiences has never been easier, thanks to ICP&#8217;s groundbreaking platform, Kontribute. In today&#8217;s digital age, storytelling transcends mere words on a page; it&#8217;s about immersing readers in vibrant narratives that resonate deeply.&#160; Whether you&#8217;re an aspiring writer or an established author, Kontribute empowers you to breathe life into your stories like ... <a title=\"Kontribute on ICP: The Modern Writer&#8217;s Toolkit for NFT Story Monetization\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kontribute-on-icp-writers-toolkit-for-nft/\" aria-label=\"More on Kontribute on ICP: The Modern Writer&#8217;s Toolkit for NFT Story Monetization\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-06T04:37:34.000Z",
    "title": "SHIB Price Prediction: Here’s What Could Trigger Recovery In Shiba Inu",
    "url": "https://www.newsbtc.com/analysis/shib-price-prediction-shiba-inu-hurdles/",
    "description": "SHIB price (Shiba Inu) is struggling below the $0.000008 resistance against the US Dollar. Shiba Inu could start a recovery wave if it settles above $0.000008. Shiba Inu price extended its decline and tested the $0.0000074 zone against the US Dollar. The price is now trading below $$0.000008 and the 100 simple moving average (4 hours). There is a key bearish trend line forming with resistance near $0.0000077 on the 4-hour chart of the SHIB/USD pair (data source from Kraken). The pair could start a recovery wave if it clears the $0.0000078 and $0.0000080 levels. SHIB Price Faces Uphill Task In the past few days, SHIB price saw a steady decline below the $0.0000088 level. The bears were able to push the price below the key support at $0.0000080. Finally, Shiba Inu found support near the $0.0000074 zone. A low is formed near $0.00000739 and the price is now attempting a recovery wave, like Bitcoin and Ethereum. It is now consolidating near the 23.6% Fib retracement level of the downward move from the $0.00000845 swing high to the $0.00000739 low. However, SHIB price is trading below $$0.000008 and the 100 simple moving average (4 hours). Besides, there is a key bearish trend line forming with resistance near $0.0000077 on the 4-hour chart of the SHIB/USD pair. On the upside, the bears are protecting the $0.0000077 level and the trend line. The next major resistance is near the $0.0000078 level or the 50% Fib retracement level of the downward move from the $0.00000845 swing high to the $0.00000739 low. Source: SHIBUSD on TradingView.com The main resistance is now forming near the $0.0000080 level. A close above the $0.0000080 level might send the price toward the $0.0000088 level. Any more gains might send the price towards the $0.0000092 level. More Losses In Shiba Inu? If Shiba Inu price fails to clear the $0.0000078 resistance, it could start another decline. Initial support on the downside is near the $0.0000075 level. The first major support is near the $0.0000074 level. The next major support is near the $0.0000072 level. If there is a downside break below the $0.0000072 support, there could be an extended decline towards the $0.0000070 zone. Technical Indicators 4 Hours MACD – The MACD for SHIB/USD is losing pace in the bearish zone. 4 Hours RSI (Relative Strength Index) – The RSI for SHIB/USD is currently below the 50 level. Major Support Levels – $0.0000075 and $0.000074. Major Resistance Levels – $0.0000078, $0.0000080 and $0.0000088."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-06T04:14:37.000Z",
    "title": "Ethereum Price Shows Signs of Life But Lacks Momentum Above $1,650",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-lacks-momentum-1650/",
    "description": "Ethereum price is attempting a recovery wave above $1,620 against the US Dollar. ETH must settle above $1,650 to start a decent increase. Ethereum is slowly moving higher from the $1,600 support zone. The price is trading near $1,630 and the 100-hourly Simple Moving Average. There was a break above two bearish trend lines with resistance near $1,620 and $1,630 on the hourly chart of ETH/USD (data feed via Kraken). The pair could start a steady increase if there is a close above the $1,650 resistance. Ethereum Price Holds Key Support Ethereum’s price managed to stay above the $1,600 support zone. ETH price is forming a base and is currently attempting a recovery wave above $1,620, like Bitcoin. There was a break above two bearish trend lines with resistance near $1,620 and $1,630 on the hourly chart of ETH/USD. The pair retested the 23.6% Fib retracement level of the main decline from the $1,750 swing high to the $1,600 low. Ether is now trading near $1,630 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $1,645 level. The next resistance is near the $1,660 level, above which the price could rise toward the $1,675 level. Source: ETHUSD on TradingView.com The 50% Fib retracement level of the main decline from the $1,750 swing high to the $1,600 low is also near $1,675. The next major barrier is near the $1,700 level. A close above the $1,700 level might push Ethereum into a positive zone. The next resistance might be near $1,750. Any more gains might send the price toward the $1,800 resistance. Another Decline in ETH? If Ethereum fails to clear the $1,660 resistance, it could start another decline. Initial support on the downside is near the $1,620 level. The first key support is close to $1,600. A downside break below $1,600 might increase selling pressure. The next major support is near the $1,580 level. If there is a downside break below $1,580, the price could revisit the key $1,540 support level. Any more losses might send the price toward the $1,480 level or even $1,440. Technical Indicators Hourly MACD – The MACD for ETH/USD is slowly gaining momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,600 Major Resistance Level – $1,660"
  }
]