[
  {
    "source": "Bitcoin.com",
    "date": "2023-10-26T22:00:49.000Z",
    "title": "Value Locked in Defi Surpasses $40 Billion, Marking a Significant Recovery",
    "url": "https://news.bitcoin.com/value-locked-in-defi-surpasses-40-billion-marking-a-significant-recovery/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/hopp90000-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/hopp90000-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/hopp90000-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/hopp90000-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/hopp90000-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/hopp90000-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/hopp90000-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/hopp90000.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Amid the recent gains in the crypto economy, the total value locked, or TVL, in decentralized finance, or defi protocols, has risen above the $40 billion threshold. This is after remaining below that level since mid-August. The top 100 defi coins by market capitalization are just below the $50 billion mark. Defi Market Bounces Back [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-26T22:00:18.000Z",
    "title": "Binance And Tether Accused By Lawmakers: DOJ Investigation Requested For Illicit Finance",
    "url": "https://www.newsbtc.com/binance/binance-and-tether-accused-by-lawmakers-doj-investigation-requested-for-illicit-finance/",
    "description": "In a recent development, US lawmakers have urged the US Department of Justice (DOJ) to initiate a criminal investigation into cryptocurrency exchange Binance (BNB) and stablecoin issuer Tether (USDT).  The lawmakers, led by Senator Cynthia Lummis, reference a controversial Wall Street Journal (WSJ) report that alleges Hamas and its affiliate raised significant funds through cryptocurrencies.  Binance And Tether Face Calls For Criminal Charges In a joint letter signed by Senator Lummis and Representative French Hill, the lawmakers express deep concern over reports indicating that “unregulated crypto intermediaries” outside the United States have allegedly facilitated illicit financial activities, including financing terrorism, such as Hamas&#8217;s attacks on Israel. Lummis and Hill urged the DOJ to promptly reach a charging decision regarding Binance, considering the extent of its involvement, and to conclude the ongoing investigation into Tether&#8217;s alleged illicit activities. Related Reading: FTX Ramps Up Restitution Efforts, Subpoenas AI Firm CAIS Over $6.5M Investment The lawmakers refer to the WSJ report of October 10, 2023, which disclosed that Hamas, Palestinian Islamic Jihad, and Hezbollah had received cryptocurrency funding since August 2021. They stress the DOJ&#8217;s need to hold any entities facilitating illicit activities accountable. The letter further reads:  We believe that it’s imperative that the Department of Justice hold bad actors accountable if they are shown to facilitate illicit activity. Binance, notably, is an unregulated crypto asset exchange based in the Seychelles and Cayman Islands. Binance has historically been linked to illicit activity and is purportedly the subject of a current Department of Justice investigation. On the other hand, Tether faced a fine by the Commodity Futures Trading Commission (CFTC) in 2021 for issues related to backing its stablecoin USDT.  The lawmakers urged the DOJ to thoroughly assess whether Binance and Tether have provided material support and resources for terrorism by violating applicable sanctions laws and the Bank Secrecy Act. Lummis and Hill emphasize the importance of swift action to cut off funding sources for terrorists targeting Israel. Tether Counters Allegations In response to Senator Lummis and Rep. Hill’s claims, Tether issued a statement addressing the “misinformation” surrounding the potential misuse of cryptocurrencies.  Tether references independent investigations by Chainalysis and Elliptic, which found significant errors and faulty attribution techniques in reports, including the WSJ&#8217;s article.  Tether emphasizes its commitment to regulatory compliance, due diligence, and global collaboration with law enforcement agencies. They highlight their track record of freezing assets tied to illicit activities and assert no evidence of sanctions law or Bank Secrecy Act violations. Related Reading: Bitcoin Price Surge: Matrixport Forecasts $125,000 Price Target By December 2024 Tether further notes the inherent transparency of blockchain technology and the proactive measures taken by virtual asset service providers to monitor and report potentially illicit activities.  They reaffirm their dedication to transparency, compliance, and collaboration with authorities, inviting constructive dialogue and cooperation. As the call for a DOJ investigation unfolds, the cryptocurrency community awaits further developments and the potential impact on Binance and Tether&#8217;s operations. As of this writing, BNB is trading at $221, representing a decrease of 0.9% within the last 24 hours. However, it is worth noting that the token has experienced significant gains over the past seven and thirty days, amounting to 5.3% and 4.9%, respectively. Featured image from Shutterstock, chart from TradingView.com "
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-26T21:41:00.000Z",
    "title": "MoonPay Teams up With Mastercard To Elevate Web3 Innovations",
    "url": "https://coinedition.com/moonpay-teams-up-with-mastercard-to-elevate-web3-innovations/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Mastercard-Launches-New-Program-Connecting-Digital-Assets-and-Banks.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"MoonPay Teams up With Mastercard To Elevate Web3 Innovations\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Mastercard-Launches-New-Program-Connecting-Digital-Assets-and-Banks.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Mastercard-Launches-New-Program-Connecting-Digital-Assets-and-Banks-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Mastercard-Launches-New-Program-Connecting-Digital-Assets-and-Banks-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Mastercard-Launches-New-Program-Connecting-Digital-Assets-and-Banks-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Mastercard-Launches-New-Program-Connecting-Digital-Assets-and-Banks-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>MoonPay collaborates with Mastercard to incorporate additional Web3 technologies to enhance experiential marketing. MoonPay, a crypto payment service, shared on its website that it is teaming up with Mastercard to drive innovation and strengthen consumer connections. In the announcement, MoonPay claimed that by embedding Mastercard products and solutions, they would be able to drive “trust, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/moonpay-teams-up-with-mastercard-to-elevate-web3-innovations/\">MoonPay Teams up With Mastercard To Elevate Web3 Innovations</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-26T22:01:51.000Z",
    "title": "Binance Crypto Exchange Launches Futures Trading for Ethereum-Based Altcoin That’s Surged Over 50% in a Week",
    "url": "https://dailyhodl.com/2023/10/26/binance-crypto-exchange-launches-futures-trading-for-ethereum-based-altcoin-thats-surged-over-50-in-a-week/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/11/ethereum-jumps-binance.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/11/ethereum-jumps-binance.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/11/ethereum-jumps-binance.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/11/ethereum-jumps-binance.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/11/ethereum-jumps-binance.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/11/ethereum-jumps-binance.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/11/ethereum-jumps-binance.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The world’s largest crypto exchange platform by volume is launching futures trading for one Ethereum (ETH)-based altcoin that&#8217;s jumped over 50% in a week. In a new announcement, crypto exchange Binance says that it will be launching futures contracts with up to 50x leverage for Powerledger (POWR), a decentralized energy market built on top of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/26/binance-crypto-exchange-launches-futures-trading-for-ethereum-based-altcoin-thats-surged-over-50-in-a-week/\">Binance Crypto Exchange Launches Futures Trading for Ethereum-Based Altcoin That’s Surged Over 50% in a Week</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]