[
  {
    "source": "Cointelegraph",
    "date": "2023-06-17T16:13:23.000Z",
    "title": "US court approves SEC-Binance.US agreement ",
    "url": "https://cointelegraph.com/news/us-court-approves-sec-binanceus-agreement",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/10f0ce35-e293-43c3-9ba1-c8461f0b5506.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>As per the approved agreement, only Binance.US employees will have access to client funds until the litigation is resolved.</p>\n                    <p><p>United States Judge Amy Berman Jackson approved on June 17 an agreement between Binance.US, Binance, and the Securities and Exchange Commission (SEC), dismissing a previous temporary restraining order (TRO) that would freeze all Binance.US assets. </p><p>Judge Jackson said on June 14 she <a href=\"https://cointelegraph.com/news/sec-binance-us-negotiate-deal-asset-freeze\">would prefer the parties reach an agreement</a> on their own rather than have her rule. The sides reportedly <a href=\"https://cointelegraph.com/news/sec-and-binance-us-strike-deal-on-asset-access\">reached an agreement</a> on June 16. </p><p>\"We are pleased to inform you that the Court did not grant the SEC’s request for a TRO and freeze of assets on our platform which was clearly unjustified by both the facts and the law,\" Binance.US said on Twitter. </p><p>As per the approved agreement, only Binance.US employees will have access to client funds until the litigation is resolved. U.S.-based customers will retain the ability to withdraw funds throughout this period.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We want to provide an update on the current battle <a href=\"https://t.co/AZwoBOh0gq\">https://t.co/AZwoBOh0gq</a> finds itself in with the SEC. We are pleased to inform you that the Court did not grant the SEC’s request for a TRO and freeze of assets on our platform which was clearly unjustified by both the facts and…</p>&mdash; Binance.US  (@BinanceUS) <a href=\"https://twitter.com/BinanceUS/status/1670077275419869186?ref_src=twsrc%5Etfw\">June 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The deal between the crypto exchange and the U.S. regulator also prevents any access by Binance global officials to private keys of wallets, hardware wallets, or root access to Binance.US’s Amazon Web Services tools. </p><p>\"There has never been any evidence presented by the SEC concerning mis-use of customer assets. In fact, the SEC lawyers conceded in Court earlier this week, when asked by the Judge, that they had no evidence suggesting that any such thing had occurred,\" wrote Binance.US regarding allegations of funds mismanagement.</p><p>In a Twitter comment on the case, former chief of the SEC's Office of Internet Enforcement John Reed Stark <a href=\"https://twitter.com/JohnReedStark/status/1670048264572239872\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> that the agreement includes a \"particularly interesting provision\" about the repatriation of certain assets to the U.S. </p><p>“Defendants shall repatriate to the United States, transfer to BAM Trading, and confirm that BAM Trading maintains possession, custody and control in the United States of all fiat currency and crypto assets that are deposited, held, traded, or accrued by customers [...],\" reads the agreement. </p><p>Additionally, the deal asserts that Binance.US must take immediate action to ensure \"a verified written accounting\" of accounts related to BAM entities valued greater than $1,000. </p><p>The SEC <a href=\"https://cointelegraph.com/news/sec-files-motion-for-restraining-order-against-binance\">filed an emergency motion for a temporary restraining order</a> on Binance.US on June 6, after accusing Binance CEO Changpeng “CZ” Zhao of having access to Binance.US customer funds in a lawsuit. The regulator alleged Zhao moved $12 billion of Binance’s funds through an entity he controlled called Merit Peak.</p><p>Ahead of the hearing on the restraining order, Binance.US and Zhao submitted a joint memorandum denying that funds were ever mishandled. According to them, the SEC has been unable to identify a single instance where Binance.US customer funds have been misused.</p><p><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Magazine: Crypto regulation — Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-17T16:28:14.000Z",
    "title": "BitStarz Casino Review: Still the Top Choice for Players in 2023?",
    "url": "https://www.cryptopolitan.com/bitstarz-casino-review-still-the-top-choice/",
    "description": "BitStarz Casino has made a name for itself as a reputable and innovative platform in the online gambling industry. With its establishment in 2014, BitStarz has proven its longevity and ability to adapt to the market&#8217;s ever-changing demands. In this review, we will explore the features that have contributed to BitStarz&#8217;s success and examine whether ... <a title=\"BitStarz Casino Review: Still the Top Choice for Players in 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitstarz-casino-review-still-the-top-choice/\" aria-label=\"More on BitStarz Casino Review: Still the Top Choice for Players in 2023?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-17T16:10:53.000Z",
    "title": "Shimmer and IOTA Unleash Native Asset Revolution: NFTs, Layer 1 Assets, and Layer 2 Asset Wrapping Set to Transform Blockchain Landscape",
    "url": "https://www.crypto-news-flash.com/shimmer-and-iota-unleash-native-asset-revolution-nfts-layer-1-assets-and-layer-2-asset-wrapping-set-to-transform-blockchain-landscape/?utm_source=rss&utm_medium=rss&utm_campaign=shimmer-and-iota-unleash-native-asset-revolution-nfts-layer-1-assets-and-layer-2-asset-wrapping-set-to-transform-blockchain-landscape",
    "description": "Shimmer and IOTA are championing the evolution of blockchain utilities. With new capabilities focusing on asset wrapping, both protocols are set to empower Web3.0 users. The blockchain industry is witnessing a rapid evolution with new technologies and platforms emerging regularly. Among these, Shimmer and IOTA, have been making waves with their groundbreaking approach to native [...]"
  }
]