[
  {
    "source": "Cointelegraph",
    "date": "2023-09-05T13:59:42.000Z",
    "title": "El Salvador to introduce Bitcoin education in schools by 2024 ",
    "url": "https://cointelegraph.com/news/el-salvador-to-introduce-bitcoin-education-in-schools-by-2024",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/3bb7f0ab-53ff-48b4-9226-dfb52fe15fda.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The non-profit and NGO Mi Primer Bitcoin partnered with the Ministry of Education El Salvador to include Bitcoin into its curriculum.  </p>\n                    <p><p>The Ministry of Education of El Salvador and the non-profit, non-governmental organization Mi Primer Bitcoin/My First Bitcoin (MPB/MFB)  partnered to add Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) education to public school curriculum by 2024. </p><p>John Dennehy, the founder of MPB confirmed to Cointelegraph that this is a project of the Ministry of Education that MPB is assisting, along with Bitcoin Beach. </p><p>Its program <a href=\"https://cointelegraph.com/news/el-salvador-s-my-first-bitcoin-how-to-teach-a-nation-about-crypto\">“My First Bitcoin,”</a> from which students receive a diploma of completion, will be primary source material for the Bitcoin portion, according to Dennehy. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">✨ What an inspiring vision! The future of El Salvador shines bright with plans to introduce Bitcoin education in every public school by 2024. <br><br>Together, we&#39;re making strides towards financial empowerment and knowledge for all.  <a href=\"https://twitter.com/hashtag/BitcoinEducation?src=hash&amp;ref_src=twsrc%5Etfw\">#BitcoinEducation</a> <a href=\"https://twitter.com/hashtag/EmpoweringElSalvador?src=hash&amp;ref_src=twsrc%5Etfw\">#EmpoweringElSalvador</a> <a href=\"https://t.co/oMkRqJFsTN\">https://t.co/oMkRqJFsTN</a></p>&mdash; Mi Primer Bitcoin (@MyfirstBitcoin_) <a href=\"https://twitter.com/MyfirstBitcoin_/status/1698805687013257552?ref_src=twsrc%5Etfw\">September 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>He said training for the pilot program begins on Sep.7 with assistance from Bitcoin Beach. The Bitcoin diploma program will be taught to 150 public school teachers from 75 schools to provide them with a “base knowledge” of Bitcoin. </p><blockquote>“As the first nation to adopt Bitcoin, El Salvador will be an example for the world. Quality education is our best chance to ensure that that example is a positive one.”</blockquote><p>After the initial training, Dennehy said the teachers will return to their own schools and teach from the curriculum created by the Ministry of Education. “If successful,” he said, “the program will be rolled out to every school in the country next year.”</p><blockquote>“When My First Bitcoin began two years ago, one of the dreams was to educate a nation. This is a significant step toward that.”</blockquote><p>In a recent interview with Bitcoin Beach, its community leader Roman Martínez told Cointelegraph that over <a href=\"https://cointelegraph.com/news/el-salvador-kids-taught-how-to-send-bitcoin\">25,000 students in El Salvador have already learned</a> about Bitcoin in the classroom. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/salvadoran-teenager-bitcoin-teacher\"><strong><em>Salvadoran teenager becomes Bitcoin teacher, no longer earning ‘6 dollars a day’</em></strong></a></p><p>Dennehy said that while El Salvador is currently the focus, the mission is to bring Bitcoin education to the world. </p><blockquote>'El Salvador is leading the way with public Bitcoin education and we expect other nations to follow. The world is watching. </blockquote><p>He told Cointelegraph that MPB is already in early talks with two other governments in Latin America that are interested in implementing El Salvadorian-style Bitcoin education for local students. </p><blockquote class=\"twitter-tweet\"><p lang=\"es\" dir=\"ltr\">Atención comunidad:<br><br>Les anunciamos el comienzo de la 1era edición en <a href=\"https://twitter.com/hashtag/Cuba?src=hash&amp;ref_src=twsrc%5Etfw\">#Cuba</a> del curso My First Bitcoin <a href=\"https://twitter.com/MyfirstBitcoin_?ref_src=twsrc%5Etfw\">@MyfirstBitcoin_</a> <br><br>‍Habrá plazas limitadas. Los interesados deben completar el formulario: <a href=\"https://t.co/EGusVs1dou\">https://t.co/EGusVs1dou</a> <br><br>Los elegidos serán contactados posteriormente<br></p>&mdash; Cuba Bitcoin  (@Cuba_BTC) <a href=\"https://twitter.com/Cuba_BTC/status/1698468385506398273?ref_src=twsrc%5Etfw\">September 3, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On Sep.4 Bitcoin Cuba posted on social media that sign-ups are open for the first edition of its own version of Mi Primer Bitcoin/My First Bitcoin (MFB).</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-05T13:58:40.000Z",
    "title": "40% of crypto trading platforms are decentralized: World Federation of Exchanges",
    "url": "https://cointelegraph.com/news/40-of-crypto-trading-platforms-are-decentralized-world-federation-of-exchanges",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/01b80519-0a6e-411b-b3cd-c948b5e41c94.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The World Federation of Exchanges noted in a report that retail demand is higher for crypto products but there's a lack awareness on investor protection. </p>\n                    <p><p>A report from the World Federation of Exchanges (WFE) noted that 40% of the crypto trading platforms are decentralized and make use of distributed ledger technology. On the other hand, the majority, or 60%, of platforms make use of Central Limit Order Books (CLOBs), quite similar to regulated exchange platforms.</p><p>The WFE report noted that there are a total of 500 crypto trading platforms offering various crypo linked products and services. The survey saw participation from several crypto platforms offering key insights into retail and institutional demands.</p><p>The report noted that many crypto platforms opted to rely on an off chain CLOB system for price oracles, quote display and order execution. These entities only use the blockchain for settlement and custody purposes This means traders do not interact directly with the DLT, which eventually helps in saving on transaction cost. In this way, the transaction fees only apply when orders are settled on the blockchain. Crypto-trading platforms with this type of arrangement are called centralized platforms (CEX). </p><p>According to the survey, retail demand for crypto-linked products and services is higher compared to institutional demand, except for custody services. Institutional giants have shown a greater requirement for crypto custody services, and demand is higher. Based on the different types of product demands by the two segments of investors, the report estimates that retail customers are less aware about the importance of investor protection.</p><p><strong>Related: <a href=\"https://cointelegraph.com/news/scam-alert-metamask-warns-users-of-deceptive-march-31-airdrop-rumors\">Scam alert: MetaMask warns users of deceptive March 31 airdrop rumors</a></strong></p><p>Talking about the liquidity and customer demand, the report found that centralized exchanged enjoy a higher trading activity despite decentralized platforms offering lower transaction fees. The report also shed light on the difference in price for same trading pairs on different platforms, leading to arbitrage opportunities. However, the WEF report claimed this type of price fluctuation highlights a potential inefficiency issue in the crypo market.</p><p>The report further found that despite most countries imposing know-your-customer requirements, both centralized and decentralized crypto trading platforms have fallen short in implementing such measures due to lack of uniform crypto regulations.</p><p><strong><em>Magazine: How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-05T13:51:58.000Z",
    "title": "Tether's Ardoino says it's now one of top buyers of US Treasury bills, holds $72.5B",
    "url": "https://cointelegraph.com/news/tether-s-ardoino-says-it-s-now-one-of-top-buyers-of-us-treasury-bills-holds-72-5b",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/70f1c813-7d12-4982-a01d-776b68bcb093.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The amount of exposure places Tether in the top 22 biggest holders of US Treasury bills, ranking above countries like Spain, Mexico, Australia and the United Arab Emirates. </p>\n                    <p><p>Stablecoin issuer Tether has become one of the top buyers of United States Treasury bills in the world, according to a post by Tether CTO Paolo Ardoino. </p><p>In a social media post, Ardoino highlighted that Tether currently has an <a href=\"https://cointelegraph.com/news/tether-excess-reserves-over-3-billion-dollars\">exposure of $72.5 billion in US T-bills</a>. The amount places the stablecoin issuer in the top 22 of US T-bills holders, ranking above many countries like Spain, Mexico, Australia and the United Arab Emirates, he said. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">While <a href=\"https://twitter.com/Tether_to?ref_src=twsrc%5Etfw\">@Tether_to</a> reached 72.5B exposure in US t-bills, being top 22 buyer globally, above United Arab Emirates, Mexico, Australia, Spain, ...<a href=\"https://twitter.com/search?q=%24USDt&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USDt</a> is the most used stablecoin in the world, with a huge focus on emerging markets. For many of these communities USDt is a lifeline… <a href=\"https://t.co/7hC12Nhzdq\">https://t.co/7hC12Nhzdq</a></p>&mdash; Paolo Ardoino  (@paoloardoino) <a href=\"https://twitter.com/paoloardoino/status/1698943028541419795?ref_src=twsrc%5Etfw\">September 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Ardoino believes that this development demonstrates the relevance of USDT (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) in various emerging markets across the globe. According to the Tether executive, USDT is providing communities a “lifeline to protect themselves\" against the rampant inflation in their national currencies. </p><p>The executive's sentiments were a response to another social media post that <a href=\"https://twitter.com/WallStreetSilv/status/1698593300410708011\" target=\"_blank\" rel=\"noopener nofollow\">highlighted</a> the lowering rate of China's ownership of US T-bills. According to the report, China is getting out of US debt and is moving its funds into gold. </p><p>Tether’s ownership of billions worth of US T-bills was also reported by the company earlier this year. On July 31, the company <a href=\"https://cointelegraph.com/news/tether-excess-reserves-over-3-billion-dollars\">released a reserves attestation for USDT</a>. According to the report, Tether holds up to $3.3 billion in excess reserves for its stablecoin. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/cronos-labs-begins-recruitment-for-100-million-accelerator-program\"><strong><em>Cronos Labs begins recruitment phase for $100M accelerator program</em></strong></a></p><p>Meanwhile, the stablecoin issuer is also continuously trying to expand its reach. On Aug. 29, the USDT issuer <a href=\"https://cointelegraph.com/news/tether-adds-bahamas-based-bank-britannia-as-new-partner\">added a private bank in the Bahamas</a> called Britannia Bank &amp; Trust as a partner, to process dollar transfers within its platform. The company joins Tether's roster of banking partners which include Deltec Bank and Capital Union Bank. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/gta-owner-blockchain-game-bitcoin-casino-sunflower-land-review-web3-gamer/\"><strong><em>GTA owner joins Web3, Bitcoin casino, Sunflower Land review: Web3 Gamer</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-05T14:00:28.000Z",
    "title": "Mortgage-treasury spreads hit historical highs revealing Bitcoin opportunity",
    "url": "https://cryptoslate.com/mortgage-treasury-spread-hits-historical-highs/",
    "description": "<p>The financial world has long relied on traditional indicators to gauge market health and predict future trends. Among these, the 30-year fixed mortgage rates and the 30-year Treasury yield are pivotal markers. The spread between these two metrics has recently garnered significant attention, reaching historical highs and prompting discussions about its implications for the broader [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/mortgage-treasury-spread-hits-historical-highs/\">Mortgage-treasury spreads hit historical highs revealing Bitcoin opportunity</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T13:58:23.000Z",
    "title": "Visa expands stablecoin settlement to Solana, partners with Worldpay and Nuvei",
    "url": "https://www.cryptopolitan.com/visa-expands-stablecoin-settlement-solana-partners-worldpay-and-nuvei/",
    "description": "Visa, a global leader in digital payments, has expanded its stablecoin settlement capabilities to include the high-performing Solana blockchain. The move comes in partnership with merchant acquirers Worldpay and Nuvei, aiming to modernize cross-border money movement and offer more payment options to merchants. Pioneering stablecoin settlements across blockchains Visa&#8217;s latest expansion is part of its ... <a title=\"Visa expands stablecoin settlement to Solana, partners with Worldpay and Nuvei\" class=\"read-more\" href=\"https://www.cryptopolitan.com/visa-expands-stablecoin-settlement-solana-partners-worldpay-and-nuvei/\" aria-label=\"More on Visa expands stablecoin settlement to Solana, partners with Worldpay and Nuvei\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-05T14:00:35.000Z",
    "title": "New Shibarium Update Sets The Stage For Shiba Inu To Reach All-Time High",
    "url": "https://www.newsbtc.com/shiba-inu/shibarium-update-shiba-inu/",
    "description": "The burning of SHIB tokens has become an important part of the Shiba Inu community. Each week, tokens are sent to a ‘burn’ address by community members as they try to reduce the supply of the token. This is why the introduction of a burn mechanism for the Shibarium Layer 2 network is a welcome development for the community. Lead Dev Says Shiba Inu Burn Portal Is Coming In a tweet shared on X (formerly Twitter) on Monday, Shiba Inu lead marketer LUCIE shared a much-anticipated announcement with the community. Lucie revealed in a screenshot of an exchange with the developer that a Shiba Inu burn portal for Shibarium was being developed. Related Reading: Shiba Inu Whales Begin Accumulation As Shibarium Grows This comes after a long stretch of calls for the team to introduce an automatic burn for SHIB as the Shibarium blockchain grows. However, contrary to the belief that the burn portal is exactly what is needed, the developer emphasized that “BURNS WILL NOT AND ARE NOT THE END ALL BE ALL.” Instead, the developer says that the focus should shift toward the adoption of the blockchain rather than being on just burns. So to confirm that ADOPTION is the right way🌝$SHIB Burns x Shytoshi answered pic.twitter.com/BizkLZ0V83 — 𝐋𝐔𝐂𝐈𝐄 &#124; Summer of Shibarium (@LucieSHIB) September 4, 2023 The developer’s words echo an earlier post made by the lead marketer on X. According to Lucie, the only way that SHIB would be burned is if the blockchain is being used. Token burns are dependent on fees generated from transactions. So this is why the emphasis should be placed on adoption rather than straight burns. “The more you use Shibarium, the higher the traffic, which drives up gas fees,” Lucie explained in the tweet. WE NEED TO USE #Shibarium It won&#8217;t burn $SHIB if you don&#8217;t use it! Onboarding millions of people to Shibarium will take time and community effort. More information about burns will be revealed in the upcoming documentation. BUT it has been clearly explained in… pic.twitter.com/xjo27NlPP8 — 𝐋𝐔𝐂𝐈𝐄 &#124; Summer of Shibarium (@LucieSHIB) September 4, 2023 Lucie pointed out in a follow-up tweet that the Shiba Inu price had been able to hit its previous all-time high without any burn mechanism in place. “$SHIB will be a governance token with global adoption &#8211; the next ATH could be interesting,” she concluded. Will A Shibarium Burn Portal Lead To New ATH? The emphasis being placed on a burn mechanism by the community comes as a result of an expectation that lower supply leads to higher prices. While this is true for digital assets, there are other factors that contribute to a token reaching a new all-time high price. Related Reading: Shiba Inu Marketing Lead Sends Important Message To SHIB Holders For one, the current crypto market trend has to be considered. With a bear market still raging on, it is safe to say that tokens are not hitting ATHs anytime soon. So even if a Shiba Inu burn portal was introduced today, it would not automatically guarantee a new ATH. However, it could lead to a surge in price, even if briefly. Hence, working toward adoption rather than just burns presents a more long-lasting value addition. SHIB’s price is currently sitting at $0.000007549 after falling 2.40% in the last day and 6.91% in the last week. It is the 16th-largest cryptocurrency with a market cap of $4.44 billion. SHIB bulls push price above $0.0000075 support &#124; Source: SHIBUSD on Tradingview.com Featured image from Unsplash, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-05T14:04:33.000Z",
    "title": "Shimmer and IOTA: Pioneering a Bridgeless Future in Cross-Chain Transactions",
    "url": "https://www.crypto-news-flash.com/shimmer-and-iota-pioneering-a-bridgeless-future-in-cross-chain-transactions/",
    "description": "<img width=\"981\" height=\"552\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/11/IOTA_Shimmer_5.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/11/IOTA_Shimmer_5.png 981w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/IOTA_Shimmer_5-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/IOTA_Shimmer_5-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/IOTA_Shimmer_5-24x14.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/IOTA_Shimmer_5-36x20.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/11/IOTA_Shimmer_5-48x27.png 48w\" sizes=\"(max-width: 981px) 100vw, 981px\" />While crypto bridges form a crucial part of the DeFi ecosystem, security remains a crucial aspect to resolve in its design. IOTA&#8217;s Shimmer envisions a bridgeless future offering a foundational layer for seamless, bridgeless value transfers in a multi-chain environment. In the decentralized finance (DeFi) ecosystem, crypto bridges have played a crucial in transferring assets [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-05T14:00:19.000Z",
    "title": "Sandbox Price Prediction: Sandbox Loses Market Share to Pikamoon",
    "url": "https://www.crypto-news-flash.com/sandbox-price-prediction-sandbox-loses-market-share-to-pikamoon/",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T153322.115.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T153322.115.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T153322.115-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T153322.115-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Pikamoon is on the rise, and investors are decamping from Sandbox to quickly buy up $PIKA tokens while the prices are still low. Experts believe Pikamoon has a massive and sustainable growth prospect due to its innovative utility and unique tokenomics. This is why crypto whales and GameFi investors are focusing on Pikamoon to amass [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-05T14:06:09.000Z",
    "title": "Why is Solana is Adopted Instead of Lightning Network for Payments?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/why-is-solana-is-adopted-instead-of-lightning-network-for-payments/",
    "description": "<p>While Bitcoin remains the poster child of the crypto world, it&#8217;s Solana that&#8217;s been making waves recently. Especially when it comes to centralized enterprise payments for giants like Shopify and Visa. Surprisingly, Solana is emerging as a serious contender over the Lightning Network.  In this article, we&#8217;ll delve into why Solana is being adopted instead [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/why-is-solana-is-adopted-instead-of-lightning-network-for-payments/\">Why is Solana is Adopted Instead of Lightning Network for Payments?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-05T13:55:00.000Z",
    "title": "BLUR Price Dips Amid Bearish Pressure, Indicators Signal Reversal",
    "url": "https://coinedition.com/blur-price-dips-amid-bearish-pressure-indicators-signal-reversal/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/Aave-Dips-Again-After-a-Daily-Peak-of-60.0-a-Decrease-of-3.17.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Aave Dips Again After a Daily Peak of 60.0, a Decrease of 3.17%\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/Aave-Dips-Again-After-a-Daily-Peak-of-60.0-a-Decrease-of-3.17.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/Aave-Dips-Again-After-a-Daily-Peak-of-60.0-a-Decrease-of-3.17-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/Aave-Dips-Again-After-a-Daily-Peak-of-60.0-a-Decrease-of-3.17-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/Aave-Dips-Again-After-a-Daily-Peak-of-60.0-a-Decrease-of-3.17-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/Aave-Dips-Again-After-a-Daily-Peak-of-60.0-a-Decrease-of-3.17-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/Aave-Dips-Again-After-a-Daily-Peak-of-60.0-a-Decrease-of-3.17-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Despite Blur&#8217;s (BLUR) positive start to the day, the resistance level around $0.1915 proved firm. As a result, bears took control of the market, with the BLUR price plummeting to an intraday low of $0.1826 before regaining support. At press time, BLUR was trading at $0.187, down 1.62% from the intraday high. Profit-taking by investors [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/blur-price-dips-amid-bearish-pressure-indicators-signal-reversal/\">BLUR Price Dips Amid Bearish Pressure, Indicators Signal Reversal</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-05T13:50:04.000Z",
    "title": "Polygon (MATIC) Price Prediction 2023-2030: Will MATIC Price Hit $2.5 Soon?",
    "url": "https://coinedition.com/polygon-matic-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Polygon-MATIC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polygon (MATIC) Price Prediction 2022\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Polygon-MATIC.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Polygon-MATIC-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Polygon-MATIC-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Polygon-MATIC-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/PRICE-PREDICTION-Polygon-MATIC-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Polygon is one of the top blockchains in the crypto space. The native token of the Polygon Network is MATIC. Due to its popularity among cryptocurrency users, Polygon (MATIC) has a Weiss crypto rating of B.&#160;A recent study in July 2022, shows that the top 100 Ethereum whales have $82.6 million worth of Polygon (MATIC) [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/polygon-matic-price-prediction/\">Polygon (MATIC) Price Prediction 2023-2030: Will MATIC Price Hit $2.5 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]