[
  {
    "source": "Cointelegraph",
    "date": "2023-10-29T23:06:00.000Z",
    "title": "UK risks regulating NFTs the wrong way, says Mintable CEO",
    "url": "http://cointelegraph.com/news/nft-artwork-regulation-uk-government-mintable-zach-burks",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/47211cd5-53cb-4b0f-97bc-7f48502153f8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>“It’s not just a piece of artwork”: Mintable CEO Zach Burks argues that the United Kingdom government still hasn’t caught up on what NFTs are becoming. </p>\n                    <p><p>The United Kingdom’s government is in danger of regulating nonfungible tokens (NFTs) in a way that doesn’t suit the true nature of the nascent technology, says Mintable CEO and founder Zach Burks.  </p><p>In an interview with Cointelegraph, Burks said he believes a <a href=\"https://cointelegraph.com/news/uk-committee-urges-nft-rules-sport-fan-crypto-token-ban\">recent report from a U.K. parliamentary committee</a> significantly exaggerates the role NFTs play in copyright infringement and fails to recognize that they are more than just volatile digital pictures. </p><p>“NFTs are in a transition phase where they’re moving away from the speculative boom of PFPs, and now it’s going into utilities of brands implementing NFTs across a whole range of different things,” Burks explained. </p><p>In the Oct. 11 report, the Culture, Media and Sport Committee urged the government to take action to protect artists and content creators from copyright infringement associated with NFTs.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">NFT marketplaces need to do more to address the scale of copyright infringement on their platforms.<br><br>We&#39;ve published our report on &quot;NFTs and the Blockchain: risks to sport and culture&quot;.<br><br>Find out more: <a href=\"https://t.co/4pYE6gAngw\">https://t.co/4pYE6gAngw</a><br>Read our report: <a href=\"https://t.co/XIj0LYlcrX\">https://t.co/XIj0LYlcrX</a><a href=\"https://twitter.com/cj_dinenage?ref_src=twsrc%5Etfw\">@cj_dinenage</a> <a href=\"https://t.co/GTbtOJCM8m\">pic.twitter.com/GTbtOJCM8m</a></p>&mdash; Culture, Media and Sport Committee (@CommonsCMS) <a href=\"https://twitter.com/CommonsCMS/status/1712117116281790621?ref_src=twsrc%5Etfw\">October 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Burks acknowledged that copyright protections and intellectual property rights for artists are of paramount importance, pointing to Mintable’s own IP protection algorithm it uses to prevent plagiarism on its platform. </p><p>However, he explained that while these issues should be a top priority for all NFT platforms, they’re not exactly NFT-specific concerns. </p><blockquote>“These are problems inherent to the internet, not to NFTs.” </blockquote><p>“Regulators say, ‘Well now, NFTs are being used for copyright infringement.’ Well yeah, so is WordPress. So is YouTube. So is Spotify,” he said. “And how do you combat that? Well, you have some of the largest, most advanced companies in the world, like Google, working on this.”</p><blockquote>“They’ve got hundreds of billions of dollars, and they can’t solve the problem of combating copyrighted material on YouTube. It’s not like this problem just came up out of thin air because NFTs were created.” </blockquote><p>Burks, who personally corresponds with U.K. government officials on NFTs on a weekly basis, said that while NFT platforms should be doing their utmost to protect artists, it falls on regulators to embrace a more nuanced view of NFTs as a whole. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Was such a great time speaking at the 40th International Symposium  on Economic Crimes at Cambridge University in the UK! <br><br>Learned so much, met some amazing people, and hopefully educated the people who listened to my many panels about NFTs and the blockchain space! <a href=\"https://t.co/txExSVqTIb\">pic.twitter.com/txExSVqTIb</a></p>&mdash; Zach Burks (@ZachSpaded) <a href=\"https://twitter.com/ZachSpaded/status/1702195851102441868?ref_src=twsrc%5Etfw\">September 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“There are so many ways that you can utilize NFTs, whether it’s for your car records, for your property records, whether it’s a bank settlement document, whether it’s a backup layer, whether it’s a full supply chain system or a biofuels company,” he said.</p><blockquote>“It’s not just a piece of artwork or a financial instrument. […] An NFT is effectively a website.”</blockquote><p>“If my website is used to sell books, I’m governed by the laws that are used to sell books. If I sell drugs on my website, then you don’t need new laws. I’m still just selling drugs, right?” he said, laughing.</p><p>In Burks’ view, NFTs are an extremely broad technology capable of a vast array of different functions, and having a committee declare that they be regulated as pieces of digital art could be a significant setback to unveiling the true utility of the technology.</p><p>“The [committee] said the government should implement the EU 17 copyright directive on NFTs, which is bad in the sense that it’s a really broad umbrella,” he said. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/nfts-arent-dead-just-resting\"><strong><em>NFTs aren’t dead — they’re just resting</em></strong></a></p><p>In the report, the committee said the “most pressing issue” raised by NFTs was the risk to artists’ intellectual property rights arising from the ease and speed at which tokens can be minted. It suggested they be regulated under a relatively narrow copyright directive: Article 17 of the European Union Directive on Copyright. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/8c102c49-800b-4d60-86b0-0ba5071fc701.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>The committee’s recommendations to the U.K. government. Source: U.K. Parliament</em></figcaption></figure><p>“When you say all NFTs need to have this one element of regulatory coverage, this is the equivalent of saying, ‘We need this one piece of legislation that covers this piece of technology,’ which might’ve started at the Edison light bulb but now we’re dealing with Teslas,” Burks said.</p><blockquote>“So, we have to be very careful when it comes to these kinds of overarching regulatory frameworks that we apply to NFTs as a system, as opposed to looking at NFT for what they really are.” </blockquote><p>Ultimately, Burks believes the U.K. government could take some notes from regulators in Singapore, where the government judges NFTs by their specific use cases.</p><p>“Regulators in Singapore look at what an NFT actually is, and then they go from there,” he explained. “Say you’ve got an NFT of a Tesla stock. Well then, that’s a security. Oh, this is an NFT of a bag of cocaine that’s facilitating the sale of drugs? Then they regulate the same way they would illicit drugs.”</p><p><strong><em>Web3 Gamer: </em></strong><a href=\"https://cointelegraph.com/magazine/minecraft-bans-bitcoin-play-earn-iphone-15-crypto-gaming-formulae-preview-web3-gamer/\"><strong><em>Minecraft bans Bitcoin P2E, iPhone 15 &amp; crypto gaming, Formula E</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-10-29T22:40:05.000Z",
    "title": "Crypto industry observing unprecedented fraud scenarios",
    "url": "https://crypto.news/crypto-industry-observing-unprecedented-fraud-scenarios/",
    "description": "According to a recent Sumsub report, 2023 has been marked by increasing professionalization in fraud tactics, with 77% of crypto companies reportedly observing new patterns and schemes."
  }
]