[
  {
    "source": "Cointelegraph",
    "date": "2024-01-22T11:47:07.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Coinbase chief legal officer Paul Grewal accused the United States Government Accountability Office (GAO) of performing \"zero analysis\" in its latest crypto report. Do Kwon-founded Terraform Labs has filed for Chapter 11 bankruptcy protection. Meanwhile, Grayscale has seen the assets held by its Grayscale Bitcoin Trust (GBTC) fall by roughly $5 billion over the past weekend. </p><p>Coinbase chief legal officer Paul Grewal came down heavily on the United States Government Accountability Office (GAO) over its recent report on crypto use for evading sanctions.</p><p>As Cointelegraph reported, <a href=\"https://cointelegraph.com/news/estimated-1b-leaves-gbtc-in-3-days-ark-buys-own-bitcoin-etf\">roughly $1.1 billion</a> flowed out of GBTC over a three-day period. Meanwhile, the other recently approved Bitcoin ETFs have seen heavy inflows, especially BlackRock’s, which recently added 8,700 BTC at a value of nearly $358 million.</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-22T11:47:13.000Z",
    "title": "Bitcoin to surge in 6 months as investors pivot from Grayscale to new ETFs, Galaxy Digital’s Novogratz says",
    "url": "https://cryptoslate.com/bitcoin-to-surge-in-6-months-as-investors-pivot-from-grayscale-to-new-etfs-galaxy-digitals-novogratz-says/",
    "description": "<p>Bitcoin&#8217;s price should go &#8220;higher in six months&#8221; because investors divesting their Grayscale&#8217;s Bitcoin Trust (GBTC) holding would switch to other exchange-traded funds (ETFs), according to Galaxy Digital CEO Michael Novogratz. Novogratz made this statement in response to a bearish outlook presented by BTCdata Corporation&#8217;s founding partner, Chris J. Terry, who predicted a short-term downturn [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoin-to-surge-in-6-months-as-investors-pivot-from-grayscale-to-new-etfs-galaxy-digitals-novogratz-says/\">Bitcoin to surge in 6 months as investors pivot from Grayscale to new ETFs, Galaxy Digital&#8217;s Novogratz says</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-22T12:00:19.000Z",
    "title": "Play to Earn Done Right – Neoxa.net The Future of Crypto Gaming",
    "url": "https://news.bitcoin.com/play-to-earn-done-right-neoxa-net-the-future-of-crypto-gaming/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/unnamed-2024-01-19t123216-494-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/unnamed-2024-01-19t123216-494-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/unnamed-2024-01-19t123216-494-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/unnamed-2024-01-19t123216-494-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/unnamed-2024-01-19t123216-494-1536x864.png 1536w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/unnamed-2024-01-19t123216-494-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/unnamed-2024-01-19t123216-494-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/unnamed-2024-01-19t123216-494-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/unnamed-2024-01-19t123216-494-1520x855.png 1520w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/unnamed-2024-01-19t123216-494-1280x720.png 1280w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/unnamed-2024-01-19t123216-494.png 1600w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Since the dawn of the gaming era many gamers have dreamed of making money from their hobby and of course their passion for games. Although it&#8217;s been possible for the lucky few, this has never been a possibility for the masses. A unique and innovative crypto gaming project called Neoxa makes this long craved dream [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T12:07:25.000Z",
    "title": "Avalanche Price Prediction 2024-2033: Time to Buy AVAX?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2024-2033 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here’s a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T12:03:58.000Z",
    "title": "What Does the Case About Tech Giant Kochava Reveals?",
    "url": "https://www.cryptopolitan.com/what-does-the-case-about-tech-giant-kochava-reveals/",
    "description": "Kochava, a known name in mobile­ app data analytics, is in a court tussle with the Fede­ral Trade Commission (FTC) over a case that could alter the global data trade­ and sway Congress&#8217;s views on artificial intellige­nce (AI) and data privacy. Background of Kochava and FTC Case The FTC&#8217;s update­d complaint, lately made public, highlights [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T12:00:00.000Z",
    "title": "Best Shiba Inu (SHIB) Alternative to 100x in 2024",
    "url": "https://www.cryptopolitan.com/best-shiba-inu-shib-alternative-to-100x-in-2024/",
    "description": "The meteoric rise of Shiba Inu (SHIB) in 2021 highlighted the tremendous potential of meme coins. However, SHIB has struggled to maintain its momentum over the past year. As we enter 2024, a new DeFi coin contender aims to capture the community’s attention and usurp SHIB’s dominance—enter Pandoshi (PAMBO). Pandoshi (PAMBO): Unlocking the Potential of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T11:53:20.000Z",
    "title": "Voice Cloning Startup ElevenLabs Raises $80M in Series B Funding, Surpasses $1 Billion Valuation",
    "url": "https://www.cryptopolitan.com/elevenlabs-raises-80m-in-series-b-funding/",
    "description": "ElevenLabs, a pioneering startup in the field of AI-powered voice cloning, has secured an impressive $80 million in a recent Series B funding round. The round, co-led by renowned investors such as Andreessen Horowitz, former GitHub CEO Nat Friedman, and entrepreneur Daniel Gross, has catapulted the company to unicorn status, valuing it at over $1 [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T11:50:43.000Z",
    "title": "Gemini’s cryptic social media activity sparks XRP speculation",
    "url": "https://www.cryptopolitan.com/geminis-cryptic-social-media-activity/",
    "description": "Cryptocurrency exchange Gemini&#8217;s recent social media posts have ignited speculation within the XRP community, hinting at potential developments related to the digital asset XRP.&#160; While the posts remain cryptic, phrases such as &#8220;xrriving shortly&#8221; and &#8220;xcited about xrp&#8221; have triggered significant interest and conjecture among followers and market analysts. Gemini&#8217;s possible involvement in a European [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T11:45:23.000Z",
    "title": "Emerging European Markets Embrace AI Revolution Amid Workforce Challenges",
    "url": "https://www.cryptopolitan.com/emerging-european-markets-embrace-ai/",
    "description": "In a significant stride for technology, emerging European nations are actively embracing the artificial intelligence (AI) revolution, primarily to mitigate the persistent issue of workforce shortages. This adoption of AI technologies is not just a local phenomenon but part of a larger global trend, where AI is reshaping various economies and industries. The potential of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T11:40:20.000Z",
    "title": "2024 Could Be the Year of Generative AI, But Companies Are Still Holding Back",
    "url": "https://www.cryptopolitan.com/2024-could-be-the-year-of-generative-ai/",
    "description": "There­&#8217;s been a lot of talk about Artificial Intellige­nce (AI), most especially a type called Ge­nerative AI (GenAI), by tech experts worldwide.&#160; Here&#8217;s an inte­resting fact about GenAI &#8211; only a meagre 6% of companies have trained ove­r a quarter of their teams to use­ GenAI. However, many expect it to rise significantly starting the [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-22T11:48:07.000Z",
    "title": "Litecoin and Tron bullish, Meme Moguls attracting more investors",
    "url": "https://crypto.news/litecoin-and-tron-bullish-meme-moguls-attracting-more-investors/",
    "description": "Litecoin and Tron remain bullish but Meme Moguls is firm, attracting more investors in ongoing MGLS presale"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-22T11:45:14.000Z",
    "title": "Uranium Finance hacker executes $2.5m BUSD transfer to Ethereum",
    "url": "https://crypto.news/uranium-finance-hacker-executes-2-5m-busd-transfer-to-ethereum/",
    "description": "The Uranium Finance attacker has transferred 2.5 million BUSD from the BNB chain to Ethereum (ETH) using Li.fi. On Jan. 22, On-chain analytics platform PeckShield Alert reported the transfer of 2.5 million BUSD from the BNB Chain to Ethereum, leveraging&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-22T12:00:58.000Z",
    "title": "Terra Classic Community Burns A Staggering 700 Million LUNC And 230,000 USTC – Details",
    "url": "https://www.newsbtc.com/terra-luna/terra-classic-burns-lunc-ustc/",
    "description": "The Terra Classic Community recently had something to cheer about following revelations about the amount of LUNC and USTC token burns that were carried out in the past week. During that period, a significant amount of LUNC and USTC tokens are said to have been burned, something which could positively affect the crypto tokens’ prices.  The Number Of LUNC And USTC Burned In an X (formerly Twitter) post, AlexCryptoBull, a member of the Terra community, brought to the community’s attention how 700 million LUNC and 230,000 were burned last week. Data from LUNCMetrics also confirms this development.  Related Reading: How To Buy, Sell, And Trade Tokens On The Avalanche Network The Terra ecosystem has had to intensify its token burns ever since the Terra LUNA crash in a bid to revive the LUNC and USTC tokens. So far, 94.31 billion LUNC and 1.50 billion USTC tokens have been burned and wiped out from circulation since May 13, 2022, around when the LUNA crash occurred.  As part of this burn initiative, the community at one time had to vote on a proposal that, if passed, would have seen 800 million USTC tokens being burned. The proposal was, however, rejected due to legal concerns.  Meanwhile, the Terra community has also deployed other initiatives to help in the resurgence. Interestingly, the community recently voted against a proposal that seemed promising. This proposal involved the development team exploring the possibility of the Terra blockchain becoming an Ethereum Virtual Machine (EVM) compatible platform.  Terra, being EVM-compatible, offers numerous benefits to the network, including the possibility of LUNC and USTC surging in prices due to new money flowing into the ecosystem. However, some validators seemed to have had concerns about the funding that would have been needed to implement such a project and ultimately voted against the proposal.  Terra Community Faces Another Setback The Terra community was recently dealt another blow following the news that Terraform Labs had filed for bankruptcy. Considering the crypto firm’s ties with the Terra ecosystem, the LUNC and UST tokens experienced notable declines following this development. This could also mark the beginning of torrid times ahead for the community in their efforts to revive both tokens. Related Reading: How To Buy, Sell, And Trade Tokens On The Optimism Network Specifically, there could be potential LUNC and USTC selloffs from the crypto firm as part of the bankruptcy proceeding, something which will no doubt trigger a decline in their price. The Terra community has already had to deal with legal troubles, which Terraform Labs is currently facing, with the court ruling that LUNA and TerraUSD were unregistered securities.  At the time of writing, LUNC and USTC are trading at around $0.0001042 and $0.02536, respectively, both down over 5% in the last 24 hours, according to data from CoinMarketCap.  LUNC price suffers amid network troubles &#124; Source: LUNCUSD on Tradingview.com Featured image from Coinmarketcap, chart from Tradingview.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-22T11:41:06.000Z",
    "title": "Uniswap’s Mobile App: 7 Languages, 18+ Currencies, Including Chinese",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/uniswaps-mobile-app-7-languages-18-currencies-including-chinese/",
    "description": "<p>The app is for more people now. It speaks seven languages and works with 18+ currencies, including Chinese. As cryptocurrencies become popular worldwide, it&#8217;s crucial to make them easy to use for everyone in the Uniswap&#8217;s mobile app. Global Reach, Easy Access: Uniswap Welcomes All Users Uniswap&#8217;s decision to embrace multilingualism aligns with its commitment [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/uniswaps-mobile-app-7-languages-18-currencies-including-chinese/\">Uniswap&#8217;s Mobile App: 7 Languages, 18+ Currencies, Including Chinese</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-22T11:48:00.000Z",
    "title": "SEC’s Case Against Ripple is an attack on Financial Freedom: John E. Deaton",
    "url": "https://coinedition.com/secs-case-against-ripple-is-an-attack-on-financial-freedom-john-e-deaton/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/⚠️_XRP_Attorney_John_E_Deaton_Update_on_Ripple_vs_SEC_⚠️_Government.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Lawyer Blames Congress Over Gross Overreach by Regulators\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/⚠️_XRP_Attorney_John_E_Deaton_Update_on_Ripple_vs_SEC_⚠️_Government.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/⚠️_XRP_Attorney_John_E_Deaton_Update_on_Ripple_vs_SEC_⚠️_Government-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/⚠️_XRP_Attorney_John_E_Deaton_Update_on_Ripple_vs_SEC_⚠️_Government-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/⚠️_XRP_Attorney_John_E_Deaton_Update_on_Ripple_vs_SEC_⚠️_Government-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/⚠️_XRP_Attorney_John_E_Deaton_Update_on_Ripple_vs_SEC_⚠️_Government-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/⚠️_XRP_Attorney_John_E_Deaton_Update_on_Ripple_vs_SEC_⚠️_Government-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>John E. Deaton, a renowned crypto lawyer, has decried the increasing government intrusion into the private lives of American citizens. Deaton’s lengthy post on X (formerly Twitter) explained what he believes is an unconstitutional expansion of authority by federal agencies, enabled by Congress abdicating its responsibilities. According to Deaton, the U.S. Securities and Exchange Commission [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/secs-case-against-ripple-is-an-attack-on-financial-freedom-john-e-deaton/\">SEC’s Case Against Ripple is an attack on Financial Freedom: John E. Deaton</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]