[
  {
    "source": "CoinDesk",
    "date": "2024-01-10T21:55:35.000Z",
    "title": "Bitcoin ETFs Approved: The Industry Reacts",
    "url": "https://www.coindesk.com/consensus-magazine/2024/01/10/bitcoin-etfs-approved-the-industry-reacts/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "In a milestone for crypto adoption, the SEC today approved the trading of Bitcoin exchange-traded funds (ETFs). CoinDesk rounded up reaction from across the crypto industry to the news."
  },
  {
    "source": "CoinDesk",
    "date": "2024-01-10T21:48:48.000Z",
    "title": "ETF Euphoria Shows Bitcoin Needs Wall Street After All",
    "url": "https://www.coindesk.com/consensus-magazine/2024/01/10/etf-euphoria-shows-bitcoin-needs-wall-street-after-all/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Is an ETF at odds with Bitcoin’s goal of breaking away from Wall Street? Absolutely. Is that same ETF also necessary for crypto to grow? Also yes."
  },
  {
    "source": "CoinDesk",
    "date": "2024-01-10T21:46:27.000Z",
    "title": "Bitcoin ETF Listings Will Be Quick but Money Flows Could Take Months: 21Shares Co-Founder",
    "url": "https://www.coindesk.com/business/2024/01/10/bitcoin-etf-listings-will-be-quick-but-money-flows-could-take-months-21shares-co-founder/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Ophelia Snyder says it is impossible to conceptualize the changes in bitcoin trading volumes likely through ETF inflows."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-10T22:02:34.000Z",
    "title": " Spot Ethereum ETFs have a straight shot for approval: Analysts ",
    "url": "https://cointelegraph.com/news/spot-ethereum-etf-next-for-sec-approval-analysts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMjc1OTIxODMtMDY0ZC00OGY5LWJhOWYtNGNmMjUzNjBhMTU3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Industry pundits believe spot Ethereum ETFs have a clear path to approval in 2024, with one predicting trading to begin as early as the second quarter.</p>\n                    <p><p>With 11 spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded funds approved on Jan. 10, spot Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) ETFs should have a clear path to approval in 2024 — one analyst is even tipping a 70% chance of approval by May.</p><p>Bloomberg ETF analyst Eric Balchunas previously told Cointelegraph he couldn’t see a scenario where spot Bitcoin ETFs are approved but spot Ethereum ETFs aren’t.</p><p>Balchunas also noted he had heard “on the back channels” that spot Ether ETFs “will be fine.” </p><p><a href=\"https://cointelegraph.com/news/spot-ethereum-etf-next-for-sec-approval-analysts\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-10T22:00:00.000Z",
    "title": "FBI joins investigation into SEC X account compromise",
    "url": "https://cryptoslate.com/fbi-joins-investigation-into-sec-x-account-compromise/",
    "description": "<p>The Federal Bureau of Investigation (FBI) has joined an investigation into a security breach involving the SEC&#8217;s X account, Reuters said on Jan. 10. An SEC spokesperson told Reuters: &#8220;The [U.S. Security and Exchange Commission] continues to investigate the matter and is coordinating with appropriate law enforcement entities, including the SEC’s Office of the Inspector [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/fbi-joins-investigation-into-sec-x-account-compromise/\">FBI joins investigation into SEC X account compromise</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-10T21:56:59.000Z",
    "title": "SEC Approves the First Spot-Bitcoin ETFs",
    "url": "https://cryptodaily.co.uk/2024/01/sec-approves-the-first-spot-bitcoin-etfs",
    "description": "The SEC officially gave the green light for America’s first regulated spot Bitcoin ETFs. 9 th January\nmarks a false start in this landmark decision as it preceded by misleading tweet from the account of\nSEC causes market turmoil."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-10T21:58:45.000Z",
    "title": "Gary Gensler slams Bitcoin after approving all spot ETFs",
    "url": "https://www.cryptopolitan.com/gensler-bitcoin-after-approving-spot-etfs/",
    "description": "In a surprising twist that might leave some scratching their heads, SEC Chairman Gary Gensler has thrown a curveball by yet again criticizing Bitcoin shortly after the SEC’s approval of several spot Bitcoin exchange-traded products (ETPs). Gensler&#8217;s comments highlight the complex and often contradictory nature of regulatory decisions in the fast-evolving world of cryptocurrencies. The [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-10T21:47:00.000Z",
    "title": "Tron Price Prediction 2024-2033: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2024-2033 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network. TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-10T21:43:27.000Z",
    "title": "JPMorgan CEO criticizes BTC despite backing BlackRock Bitcoin ETF",
    "url": "https://crypto.news/jpmorgan-ceo-criticizes-btc-despite-backing-blackrock-bitcoin-etf/",
    "description": "JPMorgan Chase CEO Jamie Dimon reiterated his longstanding skepticism about BTC despite his company's role in the BlackRock Bitcoin ETF. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-10T22:00:58.000Z",
    "title": "Sell The News: Bitcoin Short-Term Holders Participate In $2 Billion Selloff",
    "url": "https://www.newsbtc.com/bitcoin-news/sell-bitcoin-short-term-holders-2-billion-selloff/",
    "description": "On-chain data shows that Bitcoin short-term holders have deposited $2 billion in BTC to exchanges, the fourth largest amount in the last two years. Bitcoin Short-Term Holder Exchange Inflows Have Spiked Up As analyst James V. Straten explained in a new post on X, the BTC short-term holders have potentially participated in a very sizeable selloff recently. The &#8220;short-term holders&#8221; (STHs) are the Bitcoin investors who bought their coins within the last 155 days. The STHs comprise one of the two main divisions of the BTC market based on holding time; the other segment is called the &#8220;long-term holder&#8221; (LTH) cohort and includes the holders who mature past the 155-day cutoff. Related Reading: Bitcoin Blasts Off As Institutionals Continue Buying On Coinbase Statistically, the probability that a holder would sell or move their coins on the blockchain drops the longer they keep them dormant. As such, the STHs are more likely to participate in selling at any point than the LTHs. This behavior of the STHs is usually especially apparent whenever the cryptocurrency observes a sharp rally or crash, as these fickle-minded investors can&#8217;t help but fall prey to the FOMO or FUD of the situation. One way to track whether the STHs are selling or not is through their exchange inflows. Investors may deposit to these central entities when they want to sell, so the volume going to these platforms can naturally provide some measure of the degree of selling pressure the holders are currently exerting. Now, here is a chart that shows the trend in the Bitcoin STH transfer volume going towards exchanges (in USD) over the past couple of years: Looks like the metric has observed a large spike in recent days &#124; Source: @jimmyvs24 on X As displayed in the above graph, the Bitcoin volume going from the wallets held by the STHs toward the exchanges has registered a spike recently. &#8220;Yesterday, over $2B worth of Bitcoin got sent to exchanges from STHs,&#8221; notes Straten. From the chart, it&#8217;s apparent that during the last couple of years, there have only been three instances where the market saw these weak hands transfer more significant amounts to these platforms. According to the analyst, $1.3 billion of the total $2 billion inflow volume from the STHs involved coins carrying some profits. While the rest, $750 million, moved at a loss. If these inflows were indeed for selling, it would appear that both types of sellers were in the market during the spike: those capitulating at a loss and those harvesting their profits. Straten remarks that the profitability ratio of this inflow volume is a bit suspicious, as the asset mostly moved flat or negative during this period. Related Reading: These Altcoins Are Showing Most Bullish &#38; Bearish Divergences: Santiment This potential selloff from the STHs has come as the Bitcoin spot ETF is not far from being decided by the US SEC. The commission&#8217;s X account was also compromised earlier, and someone posted a fake approval announcement using it, to which the market reacted strongly. Given the timing of the inflows, it would appear that the BTC STHs expect the event to be a sell-the-news type of deal, so once the decision is made, more inflows could follow. BTC Price At the time of writing, Bitcoin is trading at around $45,200, up more than 4% in the past week. The asset's value appears to have gone down over the past day &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-10T21:53:08.000Z",
    "title": "Ripple Labs’ $500M Masterstroke: Buyback Over IPO Sends Shockwaves",
    "url": "https://www.crypto-news-flash.com/ripple-labs-500m-masterstroke-buyback-over-ipo-sends-shockwaves/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-labs-500m-masterstroke-buyback-over-ipo-sends-shockwaves",
    "description": "<img width=\"1800\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-gold-coins-with-background-chart-price-trading.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple-XRP-gold-coins-with-background-chart-price-trading.\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-gold-coins-with-background-chart-price-trading.jpg 1800w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-gold-coins-with-background-chart-price-trading-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-gold-coins-with-background-chart-price-trading-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-gold-coins-with-background-chart-price-trading-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-gold-coins-with-background-chart-price-trading-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-gold-coins-with-background-chart-price-trading-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-gold-coins-with-background-chart-price-trading-450x300.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ripple-XRP-gold-coins-with-background-chart-price-trading-1200x800.jpg 1200w\" sizes=\"(max-width: 1800px) 100vw, 1800px\" />Ripple Labs takes key step with $285 million buyback, highlighting its strategic focus on corporate governance and control. The buyback strategy highlights Ripple&#8217;s resilience, offering an alternative to early stage investors and demonstrating flexibility in financial solutions. Ripple Labs Inc. has taken a key step in its corporate strategy by announcing the repurchase of a [...]"
  }
]