[
  {
    "source": "Decrypt",
    "date": "2023-09-25T20:56:00.000Z",
    "title": "Train Your Own AI-Powered Fighter? Inside AI Arena",
    "url": "https://decrypt.co/videos/interviews/qTBh0ayt/train-your-own-ai-powered-fighter-inside-ai-arena",
    "description": "What is AI Arena? Decrypt's Kate Irwin dives into the upcoming video game in an interview with the game's founders, AI Arena CEO Brandon Da Silva and COO Wei Xie."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-25T20:55:19.000Z",
    "title": "SEC Objects to Coinbase's Role in Celsius Bankruptcy Distribution Plan",
    "url": "https://decrypt.co/198647/sec-objects-coinbases-role-celsius-bankruptcy-distribution-plan",
    "description": "The SEC has said it isn't happy with the role crypto exchange Coinbase would play to make former Celsius clients whole."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-25T21:01:33.000Z",
    "title": "MetaMask ‘glitch’ caused opBNB recommended fees to be too high: Report",
    "url": "https://cointelegraph.com/news/metamask-glitch-caused-opbnb-recommended-fees-too-high-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/97840e4e-bb36-4136-9462-04fe76e714e6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to BNB Chain, MetaMask was averaging recommended fees from multiple networks, causing opBNB recommended fees to be too high.</p>\n                    <p><p>A \"glitch\" in MetaMask that caused it to <a href=\"https://twitter.com/bnbchain/status/1706221932410999085\" target=\"_blank\" rel=\"noopener nofollow\">overestimate</a> opBNB gas fees has now been fixed, according to a social media post from BNB Chain. Many users pay the default recommended fee displayed in their wallets, so a misestimation can cause users to overpay.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Together with our friends at <a href=\"https://twitter.com/MetaMask?ref_src=twsrc%5Etfw\">@MetaMask</a>, we&#39;ve resolved a glitch that made it seem like opBNB&#39;s gas fees were unusually high. <br><br>Now, you can enjoy the true benefits of opBNB: fast, cheap, and secure transactions. Here&#39;s how it happened: [1/7]</p>&mdash; BNB Chain (@BNBCHAIN) <a href=\"https://twitter.com/BNBCHAIN/status/1706221932410999085?ref_src=twsrc%5Etfw\">September 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>opBNB is an <a href=\"https://cointelegraph.com/learn/a-beginners-guide-on-blockchain-layer-2-scaling-solutions\">optimistic rollup layer-2</a> of Ethereum. It <a href=\"https://cointelegraph.com/news/binance-optimism-scaling-platform-op-bnb-hits-mainnet\">was launched on Sept. 13</a> and was developed by the team that created BNB Chain. According to the team, they discovered recently that “Metamask had set a default minimum recommendation price for gas based on the average of all networks.” This was a reasonable policy for other L2 networks, the team said, but it “didn't quite align with opBNB.” The team claimed that opBNB fees “can be much lower than other L1 and L2 networks,” making the estimation inaccurate.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/hashing-it-out-podcast-what-does-the-future-hold-for-bnb-chain\"><strong>Hashing It Out podcast: What does the future hold for BNB Chain?</strong></a></em></p><p>To solve this problem, BNB Chain contacted the MetaMask team, who were “extremely helpful and agreed to update their algorithm.” As a result, the wallet now accurately displays the network’s fees.</p><p>According to the BNB Chain team, users can now check each network's fees by switching to opBNB from within MetaMask and attempting to perform a transaction, which they say will prove that the network often has lower fees than competitors.</p><p>opBNB was developed using the OP Stack, a modular framework that can be used to create interoperable blockchain networks. The OP Stack was developed by the OP Labs team, which is <a href=\"https://cointelegraph.com/news/optimism-successfully-completes-bedrock-hard-fork-reducing-deposit-times-layer-1-fees\">attempting to create a “Superchain”</a> comprised of multiple interconnected blockchain networks. The Superchain faces competition from Polygon's \"Supernets,\" which <a href=\"https://cointelegraph.com/news/polygon-launches-supernet-chains-pledges-100m-to-web3-developers\">attempts to accomplish a similar aim</a>.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-25T20:52:45.000Z",
    "title": "NASA plans to prove its next Moon landing is real using blockchain",
    "url": "https://cointelegraph.com/news/nasa-plans-prove-next-moon-landing-real-blockchain",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/2efacc0d-a43f-4807-a60f-31cf03096a20.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Isle of Man and Florida-based computing startup Lonestar are partnering with NASA to pioneer a blockchain-verified, data storage solution on the Moon.</p>\n                    <p><p>NASA and its partners Lonestar, a computing startup based in Florida, and the Isle of Man, will send a payload to the Moon containing “data cubes” in February of 2024. The data secured in these cubes will be verified back on Earth using blockchain technology.</p><p>If all goes to plan, when NASA launches its second crewed mission, Artemis 3, in 2025, the same blockchain technology will verify once-and-for-all and immutably that humans have landed on the Moon. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Suit Up! <br><br>Today, the <a href=\"https://twitter.com/hashtag/Artemis?src=hash&ref_src=twsrc%5Etfw\">#Artemis</a> II crew and <a href=\"https://twitter.com/NASAGroundSys?ref_src=twsrc%5Etfw\">@NASAGroundSys</a> successfully conducted a launch day demonstration. The demo included test spacesuits, a ride to Launch Complex 39B, and going up the mobile launcher to the crew access arm white room.<a href=\"https://t.co/vHl28fVSYR\">https://t.co/vHl28fVSYR</a> <a href=\"https://t.co/7ed1hGvvy4\">pic.twitter.com/7ed1hGvvy4</a></p>— NASA's Kennedy Space Center (@NASAKennedy) <a href=\"https://twitter.com/NASAKennedy/status/1704623171368820872?ref_src=twsrc%5Etfw\">September 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>NASA’s Artemis mission is set to enter its second leg with the launch of Artemis 2 in November of 2024, while that mission will be crewed, the four astronauts aboard will leave Earth, make an orbit around the Moon, and then return to Earth. It’s not quite the same as touching down on Lunar soil, but Artemis 2 is meant to be the final test run before the U.S. government puts humans on the surface of the Moon again with Artemis 3. </p><p>As one of many scientific missions taking place during the Artemis voyages, Lonestar and the Isle of Man are collaborating to pioneer long-term lunar storage systems which will rely on solar power and require no extra infrastructure to set up. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/universities-use-blockchain-based-storage-to-protect-and-democratize-data\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/universities-use-blockchain-based-storage-to-protect-and-democratize-data/amp\"><strong><em>Universities use blockchain-based storage to protect and democratize data</em></strong></a></p><p>According to a report from the BBC’s Science Focus, the test will involve the <a href=\"https://www.sciencefocus.com/news/data-storage-moon-nasa\" target=\"_blank\" rel=\"noopener nofollow\">creation</a> of digital stamps — a technology referred to as ‘digital franking’ — which will be stored in the data cubes on the Moon. Once installed, the data will be verified via blockchain back on Earth to ensure it’s complete and untampered with. </p><p>As an interesting side effect of blockchain’s immutable nature, any astronauts landing on the Moon in the future could use the data cubes to essentially check-in on the Moon. The astronauts' interaction could be verified via the blockchain and, ostensibly, any conspiracy theories surrounding the next Moon landing could be immediately assuaged.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/_T8cn2J13-4\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Per an interview with Science Focus, the head of innovation at Digital Isle of Man said it was “surprisingly difficult” for NASA to rebuke the notion that it made up the six crewed Moon landings between 1969 and 1972.</p><p>Though the blockchain may not be able to disabuse conspiracy theorists of notions related to the lunar landings of the 20th century, it should serve as an indisputable register for the next humans who touch the Moon’s surface. </p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template>\n\n\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-25T21:00:35.000Z",
    "title": "SEC objects to Coinbase’s proposed role in Celsius bankruptcy plan",
    "url": "https://cryptoslate.com/sec-objects-to-coinbases-proposed-role-in-celsius-bankruptcy-plan/",
    "description": "<p>The U.S. Securities and Exchange Commission (SEC) on Sept. 23 filed an objection to part of a reorganization plan advanced by bankrupt crypto firm Celsius. That filing indicates that Celsius aims to have the crypto exchange Coinbase act as a distribution agent and return funds to former users affected by its collapse. To that end, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sec-objects-to-coinbases-proposed-role-in-celsius-bankruptcy-plan/\">SEC objects to Coinbase&#8217;s proposed role in Celsius bankruptcy plan</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-25T21:02:33.000Z",
    "title": "Tourists can now use their Visa and Mastercard to top-up their wallets on the e-CNY app",
    "url": "https://www.cryptopolitan.com/tourists-can-use-visa-mastercard-for-e-cny/",
    "description": "The e-CNY app now enables tourists to recharge their wallets using Visa and Mastercard by providing a prepayment option. Visitors to the People’s Republic of China can recharge their Digital Yuan Wallets using the master card option currently offered by the e-CNY app. China is among the countries that have adopted the use of the ... <a title=\"Tourists can now use their Visa and Mastercard to top-up their wallets on the e-CNY app\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tourists-can-use-visa-mastercard-for-e-cny/\" aria-label=\"More on Tourists can now use their Visa and Mastercard to top-up their wallets on the e-CNY app\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-25T20:56:43.000Z",
    "title": "Friendzy’s, Solana Friend.tech fork volume nears $1M a week after its launch",
    "url": "https://www.cryptopolitan.com/friendzy-volume-nears-1m-a-week-after-launch/",
    "description": "The Solana Friend.tech fork, Friendzy, has generated almost $ 1 million in volume since its launch less than a week ago. The Friend.tech clone uses the same mode of operation as the leading incumbent by allowing users to tokenize their tweets, which they can buy and sell in the form of ‘keys’, which they use ... <a title=\"Friendzy’s, Solana Friend.tech fork volume nears $1M a week after its launch\" class=\"read-more\" href=\"https://www.cryptopolitan.com/friendzy-volume-nears-1m-a-week-after-launch/\" aria-label=\"More on Friendzy’s, Solana Friend.tech fork volume nears $1M a week after its launch\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-09-25T20:48:09.000Z",
    "title": "Altcoin Whales Shake Up Linear ($LINA) And Decentraland ($MANA) In 2023",
    "url": "https://nulltx.com/altcoin-whales-shake-up-linear-lina-and-decentraland-mana-in-2023/",
    "description": "While some altcoins have seen meteoric rises, others have displayed a rather unassuming price performance. However, two tokens that have recently caught the attention of the crypto community are Linear ($LINA) and Decentraland ($MANA). What makes them noteworthy is the sudden surge in whale transactions (3 months high), which have begun to appear on @santimentfeed&#8217;s [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-25T21:00:42.000Z",
    "title": "Crypto’s Six-Week Bleed Out: XRP And Solana Defy The Outflow Downtrend",
    "url": "https://www.newsbtc.com/news/crypto-six-week-bleed-out-xrp-and-solana-defy/",
    "description": "With contrasting events in the industry, crypto investment products have witnessed a continuous outflow for the sixth week. Some altcoins demonstrate resilience in this trend, defying the broader market sentiment. Dissecting The Crypto Outflow Trend Crypto funds have witnessed a net outflow of $9 million in the past week, taking the total to roughly $464 million over the last ten weeks, according to Coinshares&#8217; latest digital asset fund flow weekly report. Related Reading: Crypto Fund Flows: Millions Exit Bitcoin, But These Three Coins Hold Their Ground Relevant digital asset management players like CoinShares, Grayscale, 21Shares, Bitwise, and ProShares have felt the heat of this ongoing trend. To put things into perspective, the outflows have cooled from the previous week’s $54 million, but they still extend the continuous ten-week streak of net capital movement away from these products. A closer look into the report reveals this trend isn’t uniform across regions. Europe has somewhat resisted this wave, recording inflows of $16 million. James Butterfill, Research Head at CoinShares, pinpoints the regional sentiment divergence to varying reactions to the regulatory environment. According to Butterfill, European investors see the &#8220;recent regulatory disappointment as an opportunity,&#8221; while their US counterparts have pulled out $14 million, possibly due to dismay over recent events. Moreover, trading volumes in crypto funds have reflected the same caution. From exceeding $1 billion in the previous week, the volume plunged to $820 million, substantially less than the yearly average of $1.3 billion. Not All Assets Feel The Pinch Bitcoin, the flag bearer of crypto, hasn&#8217;t been immune to this trend, registering outflows for three consecutive weeks, with a dip of $6 million in the past week alone. Interestingly, Short-Bitcoin products, which gain when Bitcoin prices fall, have seen outflows of $2.8 million. This suggests a larger narrative where investors may unwind their bearish bets on Bitcoin. According to Butterfill, this outflow signifies a reduction of 78% in those assets under management over the past 22 weeks. Ethereum, another heavyweight in the crypto arena, has also felt the pinch, with outflows recorded for six weeks consecutively, resulting in a recent reduction of $2.2 million. In contrast to the major players, XRP and Solana are bright spots in the market. This week, they registered inflows of $660,000 and $310,000, respectively. Interestingly, this isn&#8217;t the first time these two altcoins have shone amidst the gloom. Last week, both assets witnessed significant inflows. Solana led the way with $700,000, followed by Cardano and XRP, which attracted inflows of $400,000 and $100,000, respectively. While Cardano didn&#8217;t cut notable inflows this week, XRP and Solana&#8217;s positive inflows amid broader negativity suggest a selective and value-driven approach by some investors in the altcoin market, according to the report.  Meanwhile, despite their recorded upward capital movements, XRP and Solana still feel the brunt of the global crypto market downturn. Related Reading: FTX’s Billion-Dollar Solana Liquidation: Market Crash Or Just Hype? Particularly, both assets have been in red, with XRP down by 1.5% in the past day with a current price of $0.50 and Solana seeing a slight 0.5% upward move over the same period with a trading price of $19.60 at the time of writing. Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-25T21:05:00.000Z",
    "title": "Santiment Reports LINK’s Abnormal Correlation With Price and Supply ",
    "url": "https://coinedition.com/santiment-reports-links-abnormal-correlation-with-price-and-supply/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/Crypto_Influencer_Claims_Chainlinks_Multisig_May_Destroy_DeFi.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Santiment Reports LINK’s Abnormal Correlation With Price and Supply \" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/Crypto_Influencer_Claims_Chainlinks_Multisig_May_Destroy_DeFi.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/Crypto_Influencer_Claims_Chainlinks_Multisig_May_Destroy_DeFi-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/Crypto_Influencer_Claims_Chainlinks_Multisig_May_Destroy_DeFi-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/Crypto_Influencer_Claims_Chainlinks_Multisig_May_Destroy_DeFi-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/Crypto_Influencer_Claims_Chainlinks_Multisig_May_Destroy_DeFi-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/Crypto_Influencer_Claims_Chainlinks_Multisig_May_Destroy_DeFi-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>“Unlike many other assets, its price often sees an initial lift when $LINK moves to exchanges.” : Santiment. LINK reached its highest price of $7.30 on September 25. Chainlink may reach the $8.5 resistance level despite it touching the upper Bollinger band. Santiment, a market analytics tool tweeted that Chainlink (LINK) “Unlike many other assets, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/santiment-reports-links-abnormal-correlation-with-price-and-supply/\">Santiment Reports LINK’s Abnormal Correlation With Price and Supply </a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]