[
  {
    "source": "CryptoSlate",
    "date": "2023-08-18T14:59:28.000Z",
    "title": "Unknown trader swallows $55 million loss in wake of crypto market crash",
    "url": "https://cryptoslate.com/unknown-trader-swallows-55-million-loss-in-wake-of-crypto-market-crash/",
    "description": "<p>The recent crypto market crash has led to double-digit losses of more than $55 million for an unknown crypto trader on Binance. Coinglass data showed that the trader traded Ethereum (ETH) against the embattled stablecoin Binance USD (BUSD). Per the data, the position was liquidated at $1,434, containing more than 38,000 ether tokens. The position [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/unknown-trader-swallows-55-million-loss-in-wake-of-crypto-market-crash/\">Unknown trader swallows $55 million loss in wake of crypto market crash</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-18T15:00:00.000Z",
    "title": "Bitcoin Price Analysis:  Bears Attack 25128 - 19 August 2023",
    "url": "https://cryptodaily.co.uk/2023/08/bitcoin-price-analysis-bears-attack-25128-19-august-2023",
    "description": "<p>BTC/USD Bears Test 25128 Objective:&nbsp; Sally Ho&rsquo;s Technical Analysis &ndash; 19 August 2023</p>\n<p>Bitcoin (BTC/USD) remained very weak early in the Asian session as the pair remained at risk after depreciating to the 25234.76 area, its weakest print since mid-June.&nbsp; This fresh multi-month low represented a test of a major downside price objective around the 25128.94 area that is associated with selling pressure that increased around the 31862.21 and 30421.29 levels in July.&nbsp;&nbsp; Major Stops were elected below the 27620.46 area during the decline, another downside price objective linked to recent downward pressure around the 30222 and 29665.27 areas.&nbsp; Major Stops were also elected below the 27991.29 area, representing the 23.6% retracement of the broader appreciating range from 15460 to 31862.21.&nbsp;&nbsp; Areas of technical support and potential buying pressure in appreciating ranges from the 15460 and 19568.52 levels include the 23661, 22793, and 21725 levels.&nbsp;</p>\n<p>Following recent selling pressure, areas of technical resistance and potential selling pressure include the 26798, 27139, 27728, 27766, 28316, 28548, 29154, 29330, and 30443 levels.&nbsp; Above the market, upside price objectives include the 30526, 30611, 30762, and 31145 areas.&nbsp; Upside price objectives related to other levels of buying pressure include the 32125 and 33569 areas, and Stops are cited above additional upside price objectives around the 32043, 34531, 34658, and 35912 areas.&nbsp;&nbsp; Traders are&nbsp;observing&nbsp;that the&nbsp;50-bar MA (4-hourly)&nbsp;is&nbsp;bearishly indicating below the 100-bar MA (4-hourly)&nbsp;and&nbsp;below the&nbsp;200-bar MA (4-hourly).&nbsp; Also, the 50-bar MA (hourly) is bearishly indicating below the 100-bar MA (hourly) and below the 200-bar MA (hourly).</p>\n<p>Price activity is nearest the&nbsp;50-bar MA&nbsp;(4-hourly) at 28941.97 and the&nbsp;50-bar MA&nbsp;(Hourly) at 27930.41.</p>\n<p>Technical Support&nbsp;is expected around&nbsp;24440.41/ 23270.10/ 22769.39 with&nbsp;Stops&nbsp;expected below.</p>\n<p>Technical Resistance&nbsp;is expected around&nbsp;31986.16/ 32989.19/ 34658.69 with&nbsp;Stops&nbsp;expected above.&nbsp;&nbsp;</p>\n<p>On&nbsp;4-Hourly&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is Bearishly below MACDAverage.</p>\n<p>On&nbsp;60-minute&nbsp;chart,&nbsp;SlowK&nbsp;is Bearishly below SlowD&nbsp;while&nbsp;MACD&nbsp;is&nbsp;Bullishly above MACDAverage.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\n<p>&nbsp;</p>\n<p>Disclaimer: Sally Ho&rsquo;s Technical Analysis is provided by a third party, and for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-18T14:45:00.000Z",
    "title": "Three Coins To Have In Your Portfolio - Chainlink, Shiba Inu and Everlodge",
    "url": "https://cryptodaily.co.uk/2023/08/three-coins-to-have-in-your-portfolio-chainlink-shiba-inu-and-everlodge",
    "description": "<p>Chainlink (LINK), Shiba Inu (SHIB), and Everlodge (ELDG) &ndash; three coins that could bring unique value to your investment portfolio. When it comes to building a portfolio, the key is diversity. Including a mix of established players and promising newcomers can help mitigate risks and maximize potential gains. Due to these reasons, let's explore all three of them in greater detail. </p>\nSummary\n- Chainlink integrates with Coinbase&rsquo;s Base \n- Shiba Inu one of the top weekly gainers \n- Everlodge expected to rally by 30x\n<p>Join Everlodge Presale</p>\nChainlink (LINK): The Oracle Solution\n<p>Chainlink (LINK) has solidified its position as a cornerstone in the cryptocurrency ecosystem. As a bridge between smart contracts and real-world data, Chainlink's decentralized oracle network ensures blockchain applications access to accurate information.</p>\n<p>In recent Chainlink news, it announced that it merged with Coinbase's Base. As a result, the Chainlink crypto interest rose. In fact, its value jumped by 6.3% over the past month alone. </p>\n<p>Currently, Chainlink is trading hands at $7.28 with a market cap of $3.9B. However, due to its technical indicators showing green, market analysts remain bullish about it. Therefore, they forecast a $9.12 price for Chainlink by the end of 2023. </p>\nShiba Inu (SHIB): Expected To Soar \n<p>Shiba Inu (SHIB) burst onto the scene as a community-driven experiment inspired by the success of meme coins like Dogecoin. While often associated with its meme status, Shiba Inu aims to create a decentralized ecosystem that includes tokens like BONE. </p>\n<p>The Shiba Inu price has increased 13.2% over the previous week, ranking among the top 20 altcoins by total market capitalization. Not only that, Shiba Inu is one of the best-performing currencies overall. The Shiba Inu crypto has a value of $0.00001036 with a market cap of $6.1B. </p>\n<p>Most importantly, the Shiba Inu technical analysis shows bullish signs. To clarify, all its moving averages and technical indicators are showing strong buy signals. As a result, experts in the field predict Shiba Inu surging to $0.00001078 soon..</p>\nEverlodge (ELDG): Brings Something Unique to the Real Estate Market\n<p>Everlodge (ELDG) aims to democratize real estate investment by tokenizing properties and offering fractional ownership through blockchain technology. This approach allows investors to purchase fractions of high-value properties, such as luxury villas, vacation homes, and hotels, for $100. Therefore, Everlodge enables more individuals to participate in real estate investment.</p>\n<p>One of the most innovative aspects of Everlodge is its integration of NFTs into the real estate market. Each property is minted as an NFT, representing ownership, and stored securely on the blockchain. This provides several benefits, including increased transparency, immutability of ownership records, and removing the need for intermediaries.</p>\n<p>At the core of this platform lies the ELDG native token. ELDG holders are rewarded with discounts on property purchases, reduced trading fees, and even free nightly stays in the properties within the Everlodge ecosystem. This rewards program incentivizes participation and fosters a vibrant and engaged community of investors.</p>\n<p>One ELDG token costs only $0.01. But keep in mind that it is in Stage 1 of its presale. In other words, it will rise as it advances. And with Stage 2 coming this month, a 20% surge will also occur. Everlodge stands out from Chainlink and Shiba Inu thanks to its low market cap, which means it will surge faster. Consequently, experts foresee a 30x growth for it on launch day. </p>\nFind out more about the Everlodge (ELDG) Presale\n<p class=\"s12\">Website: https://www.everlodge.io/</p>\n<p class=\"s13\">Telegram: https://t.me/everlodge</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T15:08:49.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T15:01:31.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T14:59:56.000Z",
    "title": "CME Group Introduces Bitcoin and Ether Reference Rates for Asian Market",
    "url": "https://www.cryptopolitan.com/cme-group-introduces-bitcoin-and-ether/",
    "description": "In a significant move to cater to the burgeoning Asian cryptocurrency market, the CME Group, a leading derivatives marketplace, has announced the launch of new reference rates for both bitcoin and ether. This initiative is an extension of the company&#8217;s existing rates, primarily focusing on London and New York investors. The development, in collaboration with ... <a title=\"CME Group Introduces Bitcoin and Ether Reference Rates for Asian Market\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cme-group-introduces-bitcoin-and-ether/\" aria-label=\"More on CME Group Introduces Bitcoin and Ether Reference Rates for Asian Market\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T14:53:46.000Z",
    "title": "Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Flow Coin Price Prediction 2023-2032 Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the ... <a title=\"Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flow-coin-price-prediction/\" aria-label=\"More on Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T14:48:01.000Z",
    "title": "China’s Xi Jinping headed for the BRICS Summit in South Africa",
    "url": "https://www.cryptopolitan.com/chinas-xi-jinping-headed-for-brics-summit/",
    "description": "President Xi Jinping of China is scheduled to attend the upcoming BRICS leaders&#8217; summit in South Africa during his state visit next week. President Cyril Ramaphosa of the Republic of South Africa&#8217;s invitation prompted President Xi Jinping&#8217;s attendance at the 15th Summit in Johannesburg. Additionally, he will undertake a state visit to South Africa from ... <a title=\"China&#8217;s Xi Jinping headed for the BRICS Summit in South Africa\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chinas-xi-jinping-headed-for-brics-summit/\" aria-label=\"More on China&#8217;s Xi Jinping headed for the BRICS Summit in South Africa\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T14:45:17.000Z",
    "title": "Upwork’s Gig Economy Stock Could Be a Hidden AI Gem",
    "url": "https://www.cryptopolitan.com/upworks-stock-could-be-a-hidden-ai-gem/",
    "description": "In the rapidly evolving landscape of work, the gig economy has emerged as a dominant force, driven by the increasing preference for remote work and freelance opportunities. Upwork, a platform connecting companies with freelancers, stands out as a compelling player in this arena. Notably, the platform&#8217;s recent foray into the realm of artificial intelligence (AI) ... <a title=\"Upwork&#8217;s Gig Economy Stock Could Be a Hidden AI Gem\" class=\"read-more\" href=\"https://www.cryptopolitan.com/upworks-stock-could-be-a-hidden-ai-gem/\" aria-label=\"More on Upwork&#8217;s Gig Economy Stock Could Be a Hidden AI Gem\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T14:41:56.000Z",
    "title": "Shibarium Network Resumes Operations: A Deep Dive into the Recent Halt",
    "url": "https://www.cryptopolitan.com/shibarium-network-resumes-operations/",
    "description": "The cryptocurrency world is no stranger to volatility and unexpected events. The recent hiccup in the operations of Shiba Inu&#8217;s Layer-2 Shibarium network is a testament to this. After a brief pause in block production, Shibarium is back, and the market is reacting. Here&#8217;s a comprehensive look at what transpired, the reasons behind it, and ... <a title=\"Shibarium Network Resumes Operations: A Deep Dive into the Recent Halt\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shibarium-network-resumes-operations/\" aria-label=\"More on Shibarium Network Resumes Operations: A Deep Dive into the Recent Halt\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T14:41:25.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T14:40:08.000Z",
    "title": "Drake-backed crypto casino hit with lawsuit ",
    "url": "https://www.cryptopolitan.com/drake-backed-crypto-casino-hit-with-lawsuit/",
    "description": "A cryptocurrency gambling company co-founded by Australian billionaire Ed Craven and endorsed by Canadian music artist Drake has encountered a legal obstacle in its attempt to establish itself in the Australian market. The ambitious plans of Stake to expand nationwide are now facing a challenge from a Sydney-based share trading platform with the same name, ... <a title=\"Drake-backed crypto casino hit with lawsuit \" class=\"read-more\" href=\"https://www.cryptopolitan.com/drake-backed-crypto-casino-hit-with-lawsuit/\" aria-label=\"More on Drake-backed crypto casino hit with lawsuit \">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-18T15:00:21.000Z",
    "title": "EOS & Cosmos (ATOM) Struggle; VC Spectra’s (SPCT) Potential Wins Hearts",
    "url": "https://www.crypto-news-flash.com/eos-vc-spectras-spct-potential-wins-hearts/?utm_source=rss&utm_medium=rss&utm_campaign=eos-vc-spectras-spct-potential-wins-hearts",
    "description": "<img width=\"512\" height=\"301\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-71.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-71.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-71-300x176.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />EOS has witnessed governance challenges in recent weeks, fueling its bearish sentiment. On the other hand, Cosmos (ATOM) recently partnered with Microsoft in an attempt to merge the AI realm with blockchain innovation. Fortunately, VC Spectra (SPCT) offers investors a unique opportunity to maximize their profits. With SPCT expected to soar by 627% once it [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-18T14:40:10.000Z",
    "title": "Why is Bitcoin Crashing? Reasons for the Current Crypto Market Adjustment and Dip in the Price of BTC",
    "url": "https://www.crypto-news-flash.com/why-is-bitcoin-crashing-reasons-for-the-current-crypto-market-adjustment-and-dip-in-the-price-of-btc/?utm_source=rss&utm_medium=rss&utm_campaign=why-is-bitcoin-crashing-reasons-for-the-current-crypto-market-adjustment-and-dip-in-the-price-of-btc",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-72.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-72.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-72-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Explore the dynamics of the recent Bitcoin crash in this comprehensive guide, designed to address the concerns of both longtime crypto maxis and newcomers alike. Let&#8217;s delve into the factors influencing the current market dip and the potential repercussions for Bitcoin (BTC). Top Reasons for the Bitcoin Market Crash Below are some possible reasons highlighted [...]"
  }
]