[
  {
    "source": "NewsBTC",
    "date": "2023-06-05T02:14:44.000Z",
    "title": "Bitcoin Price Topside Bias Vulnerable If It Continues To Struggle Below $28K",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-vulnerable-28k-2/",
    "description": "Bitcoin price is struggling to clear the $27,500 resistance zone. BTC is sliding and there could be a sharp decline toward $25,550 in the coming sessions. Bitcoin is still struggling to stay above the $27,000 support zone. The price is trading below $27,200 and the 100 hourly Simple moving average. There was a break below a key bullish trend line with support near $27,100 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could revisit the $26,550 support and might continue to decline. Bitcoin Price Faces Resistance Bitcoin price started a minor upside correction from the $26,550 support zone. BTC climbed above the $27,000 resistance zone and the 100 hourly Simple moving average. There was a move above the 23.6% Fib retracement level of the key decline from the $28,450 swing high to the $26,571 low. However, the bears were active near the $27,500 resistance zone. There was no convincing move above the $27,350 resistance zone. Bitcoin price stayed below the 50% Fib retracement level of the key decline from the $28,450 swing high to the $26,571 low. It is now trading below $27,200 and the 100 hourly Simple moving average. Immediate resistance on the upside is near the $27,200 level and the 100 hourly Simple moving average. The next major resistance is near the $27,350 level. The main resistance sits near the $27,500 level. Source: BTCUSD on TradingView.com An upside break and close above $27,500 could start a decent increase toward $28,000. Any more gains above the $28,000 resistance zone might send the price toward the $28,500 resistance zone. If there is a close above the $28,500 resistance, there could be a move toward the $30,000 resistance zone in the near term. More Losses in BTC? If Bitcoin’s price fails to clear the $27,350 resistance, it could continue to move down. Immediate support on the downside is near the $26,800 level. The next major support is near the $26,550 zone, below which the price might start a strong decline. In the stated case, the price could drop toward the $25,500 support in the coming sessions. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is below the 50 level. Major Support Levels – $26,800, followed by $26,550. Major Resistance Levels – $27,200, $27,350, and $27,500."
  }
]