[
  {
    "source": "CoinDesk",
    "date": "2024-02-20T12:10:51.000Z",
    "title": "Starknet Token STRK Begins Trading at $5 After Mammoth Airdrop",
    "url": "https://www.coindesk.com/business/2024/02/20/starknet-token-strk-begins-trading-at-5-after-mammoth-airdrop/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Starknet distributed 728 million tokens to around 1.3 million addresses in what is being dubbed as the largest airdrop of the year."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-20T12:38:12.000Z",
    "title": "Live Mario Kart 8 Deluxe Jazz Band Takes Oklahoma City by Storm",
    "url": "https://www.cryptopolitan.com/live-mario-kart-8-deluxe-jazz-band-takes/",
    "description": "Oklahoma City, OK: Mario Kart enthusiasts and jazz fans have found a unique fusion of their passions in Mario Kart 8 Live, a five-piece band based in Oklahoma City. The band, aptly named after the popular Nintendo racing game, has captivated audiences with their live renditions of its iconic music while hosting Mario Kart tournaments. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-20T12:22:19.000Z",
    "title": "Cardano Price Prediction 2024-2033: Is ADA a good investment?",
    "url": "https://www.cryptopolitan.com/cardano-price-prediction/",
    "description": "Cardano Price Predictions 2024-2033 Cardano stands out as a project with remarkable potential beyond its role as a tradable asset. Rooted in scholarly peer-reviewed research, it has cultivated a robust community over time. Here, we delve into the essence of Cardano and offer a projection for the future value of ADA. How Much is ADA [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-20T12:20:13.000Z",
    "title": "Starship Troopers Experiences Renaissance in Popularity Thanks to Helldivers 2",
    "url": "https://www.cryptopolitan.com/starship-troopers-experiences-renaissance/",
    "description": "Recently, various online metrics such as viewership stats, Wikipedia rank, and IMDB rank have shown a significant surge in interest in the 1997 film. According to Television Stats, Starship Troopers has climbed up the ranks, currently sitting at the 25th most popular film online. This marks a remarkable ascent from its previous position at number [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-20T12:16:33.000Z",
    "title": "Hong Kong’s crypto licensing draws local financial giants",
    "url": "https://www.cryptopolitan.com/hong-kong-crypto-licensing-local-giants/",
    "description": "Less than a year since the Hong Kong gave the green light to cryptocurrency exchanges, there&#8217;s been a notable rush among established financial entities and brokerage firms to secure their spot in the crypto market. This move signals a broader acceptance and integration of cryptocurrencies within the region&#8217;s financial ecosystem, setting the stage for a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-20T12:11:55.000Z",
    "title": "Warzone Players Plagued by Rampant Cheating, Raising Concerns Over Anti-Cheat Efficacy",
    "url": "https://www.cryptopolitan.com/warzone-players-plagued-by-rampant-cheating/",
    "description": "In a disheartening turn of events for Call of Duty: Warzone enthusiasts, the battle royale landscape is once again marred by the pervasive presence of hackers. Despite the purported safeguard of the RICOCHET anti-cheat system, the game continues to grapple with an influx of cheaters exploiting various loopholes, leaving the gaming community disillusioned and frustrated. [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-20T12:38:24.000Z",
    "title": "Sam Bankman-Fried insider claims image of former FTX founder in jail is legit",
    "url": "https://crypto.news/sam-bankman-fried-insider-claims-image-of-former-ftx-founder-in-jail-is-legit/",
    "description": "Famed crypto YouTuber and SBF insider Tiffany Fong goes on record saying the infamous image of the famed ex-FTX CEO circulating on the internet is legit. Independent crypto reporter Tiffany Fong shared a photo of the founder of the collapsed&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-20T12:31:16.000Z",
    "title": "Litecoin and Arbitrum struggle, new meme coin raises $200k in days",
    "url": "https://crypto.news/litecoin-and-arbitrum-struggle-new-meme-coin-raises-200k-in-days/",
    "description": "As Litecoin (LTC) and Arbitrum (ARB) struggle, an upcoming meme coin, Kangamoon (KANG), is gaining popularity"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-20T12:30:58.000Z",
    "title": "Crypto Analyst Lays Out XRP Price Roadmap For 1,350% Surge",
    "url": "https://www.newsbtc.com/xrp-news/crypto-analyst-xrp-price-roadmap-1350-surge/",
    "description": "In a new technical analysis shared on X, crypto analyst Egrag outlined a potential trajectory for XRP that could signal a staggering 1,350% increase in price. Egrag’s forecast hinges on the application of the Fibonacci Speed Resistance Fan (FSRF), a tool often used by seasoned traders to predict key levels of support and resistance. The FSRF is a charting technique that derives from the core principles of Fibonacci analysis, which is grounded in the mathematical relationships expressed by the Fibonacci sequence. The FSRF involves drawing three trendlines from a significant low or high point to the corresponding points on the chart, which represent major Fibonacci retracement levels – typically 0.382, 0.5, and 0.618. XRP Price Bound For A 1,350% Surge? These lines are designed to indicate areas where support or resistance is likely to emerge as prices approach them, effectively creating a fan-like spread across the price chart. Egrag has drawn the Fibonacci Speed Resistance Fan from July at $0.96 high following the summary judgment in the XRP lawsuit between Ripple Labs vs. the US Securities and Exchange Commission (SEC). Related Reading: Investment Firm Forced To Sell XRP Worth $2.5 Million: Here’s Why Egrag notes, “Following the July pump, #XRP has encountered resistance at FSRF 0.618, with the next resistance around 0.75 cents.&#8221; The FSRF, which consists of several trendlines, has been instrumental in delineating potential turning points in the price of XRP. According to Egrag&#8217;s analysis, XRP recently showed a bullish sign by closing multiple days above the FSRF 0.5 line. Egrag notes, &#8220;A bullish pattern has emerged, as XRP has achieved multiple daily closes above FSRF 0.5,&#8221; suggesting an underlying strength in the market. Related Reading: XRP Price’s 7,000% Pump: Analyst Foresees Massive Move If This Happens Egrag’s analysis points to successive price targets for XRP, stating, “The roadmap ahead includes targets at 1) FSRF 0.618 (around 0.75 cents) 2) FSRF 0.75 (around $1) 3) Fib Extension 1.618 (around $1.5) 4) FSRF 1 ($1.96).” Should XRP&#8217;s price breach the $2 mark, the analyst anticipates a wave of FOMO (fear of missing out) could propel the asset towards the ambitious $27 target. Such a surge would represent a 1,350% increase from the current levels, a move that is not unprecedented in the volatile world of cryptocurrencies but certainly ambitious. The chart shared by Egrag also underscores the significance of the &#8220;Last Line of Defense,&#8221; a term referring to a critical support zone around $0.29 that, if held, could reinforce the bullish case for XRP. Egrag’s current sentiment echoes the resilient spirit of the XRP community, often referred to as the XRP army, with a rallying call for perseverance: “STAY STEADY! I understand the exhaustion, but remember, GLORY awaits us in VALHALLA.” At press time, XRP traded at $0.56991. As analyzed a few days ago, the price has managed to break out of the downtrend channel in the 1-day chart and has now successfully completed a retest, which supports Egrag&#8217;s bullish thesis. Featured image created with DALL·E, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-20T12:38:59.000Z",
    "title": "Chainlink (LINK) Staking Activity Soars Amidst Rising Accumulation: Could $20 Price Point Signal a Bull Run?",
    "url": "https://www.crypto-news-flash.com/chainlink-link-staking-activity-soars-amidst-rising-accumulation-could-20-price-point-signal-a-bull-run/?utm_source=rss&utm_medium=rss&utm_campaign=chainlink-link-staking-activity-soars-amidst-rising-accumulation-could-20-price-point-signal-a-bull-run",
    "description": "<img width=\"1800\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-logo-with-trading-charts-in-the-background-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Chainlink-logo-with-trading-charts-in-the-background\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-logo-with-trading-charts-in-the-background-1.jpg 1800w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-logo-with-trading-charts-in-the-background-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-logo-with-trading-charts-in-the-background-1-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-logo-with-trading-charts-in-the-background-1-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-logo-with-trading-charts-in-the-background-1-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-logo-with-trading-charts-in-the-background-1-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-logo-with-trading-charts-in-the-background-1-450x300.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Chainlink-logo-with-trading-charts-in-the-background-1-1200x800.jpg 1200w\" sizes=\"(max-width: 1800px) 100vw, 1800px\" />In the past two weeks, the Chainlink exchange net flow has been negative, indicating that LINK holders are taking their tokens off the exchanges and betting on the token&#8217;s long-term future. The total volume staked has shot up in the Chainlink ecosystem, further underlying the confidence that investors have in the oracle network. As Chainlink&#8217;s [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-20T12:11:34.000Z",
    "title": "ETH Outshines BTC: Analyst Bullish on Ethereum as ETH Surpasses $2.9K",
    "url": "https://www.crypto-news-flash.com/eth-outshines-btc-analyst-bullish-on-ethereum-as-eth-surpasses-2-9k/?utm_source=rss&utm_medium=rss&utm_campaign=eth-outshines-btc-analyst-bullish-on-ethereum-as-eth-surpasses-2-9k",
    "description": "<img width=\"1200\" height=\"799\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-10T103713.145.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-10T103713.145.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-10T103713.145-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-10T103713.145-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-10T103713.145-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-10T103713.145-450x300.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Ethereum price just outshone that of Bitcoin with analysts projecting a shift to ETH. Ethereum’s spot ETF anticipation in the US could further drive bullish sentiments. Ethereum (ETH), the second largest cryptocurrency by market capitalization has recently emerged as the star performer in the crypto market, surpassing Bitcoin&#8217;s (BTC) rally over the past week as [...]"
  }
]