[
  {
    "source": "Decrypt",
    "date": "2024-02-18T16:01:02.000Z",
    "title": "China, Crypto and The Year of the Dragon",
    "url": "https://decrypt.co/217920/china-crypto-year-of-the-dragon",
    "description": "Da Bing’s three predictions for how crypto in China will fare during the upcoming year."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-18T16:02:00.000Z",
    "title": " FixedFloat confirms $26M exploit in Bitcoin, Ether ",
    "url": "https://cointelegraph.com/news/fixed-float-confirms-26m-exploit-bitcoin-ether",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNGJjMjhlNDYtZjg4Ny00OTQwLTkwZTMtMDVjNTM5YzMzNTBlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The crypto exchange team confirmed the attack on Feb. 18, a few hours after the first reports emerged on X (formerly Twitter). </p>\n                    <p><p>Decentralized crypto exchange FixedFloat has been exploited for at least $26 million worth of Bitcoin and Ether, according to on-chain data. </p><p>The exchange team <a href=\"https://twitter.com/officer_cia/status/1759192197704933621\" target=\"_blank\" rel=\"noopener nofollow\">confirmed</a> the attack a few hours after it was first reported on X (formerly Twitter). The team initially attributed the massive outflows to “minor technical problems” and switched its services to maintenance mode. </p><p>Since Feb. 17, a number of users have <a href=\"https://twitter.com/officer_cia/status/1759192197704933621\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> frozen transactions and missing funds on the exchange’s X page. On-chain data <a href=\"https://etherscan.io/address/0x85c4ff99bf0ecb24e02921b0d4b5d336523fa085\" target=\"_blank\" rel=\"noopener nofollow\">shows</a> that more than 400 Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) worth around $21 million and over 1,700 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) worth nearly $5 million were drained on Feb. 18. </p><p><a href=\"https://cointelegraph.com/news/fixed-float-confirms-26m-exploit-bitcoin-ether\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-18T16:04:21.000Z",
    "title": "Move Over MATIC: This Cryptocurrency is Set to Dominate in 2024",
    "url": "https://cryptodaily.co.uk/2024/02/move-over-matic-this-cryptocurrency-is-set-to-dominate-in-2024",
    "description": "Embark on a journey through the dynamic shifts in the crypto realm, delving into the narrative of Polygon (MATIC). Uncover the intricacies of its trajectory, once a shining star with a 140X surge, now met with skepticism. Explore the evolving sentiment towards MATIC's prospects, illuminating the path for emerging crypto projects set to redefine the narrative."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-18T15:40:19.000Z",
    "title": "5 Meme Tokens to Dominate 2024 Crypto Bull Run",
    "url": "https://cryptodaily.co.uk/2024/02/5-meme-tokens-to-dominate-2024-crypto-bull-run",
    "description": "Bitcoin's (BTC) surge to $50,000 set the pace for many projects to undergo massive rallies. Meme coins are included, as many emerging projects have investors looking for the next big thing. Those who want to rebuild their portfolios in 2024 seek the best cryptocurrency to secure and increase their holdings."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-18T16:00:00.000Z",
    "title": "Expert hints on Solana’s $140 potential as Cardano and new meme coin rise",
    "url": "https://crypto.news/expert-hints-on-solanas-140-potential-as-cardano-and-new-meme-coin-rise/",
    "description": "The cryptocurrency market continues to be dynamic, with digital assets like Solana, Cardano, and Rebel Satoshi garnering attention from investors worldwide. In this article, we delve into the potential for Solana to reach $140, expert opinions on key triggers, and&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-18T16:07:10.000Z",
    "title": "Cardano Solid Stats: ADA Soars 14% On Rising TVL and Market Cap – Details",
    "url": "https://www.newsbtc.com/news/cardano-solid-stats-ada-soars-14-on-rising-tvl-and-market-cap-details/",
    "description": "Cardano (ADA), the eighth-largest cryptocurrency by market cap, has defied the recent market downturn, experiencing a 14% price jump in the past week. This bullish momentum can be attributed to a combination of factors, including impressive ecosystem growth, strong technical analysis, and increasing investor confidence. Related Reading: Chainlink Bulls Brace For Explosive Growth Following $216 Million Whale Accumulation Cardano TVL Skyrockets, Stablecoins Gain Traction The recent Messari Q4 2023 report paints a vibrant picture of Cardano&#8217;s ecosystem. The network saw a staggering 166% quarter-over-quarter (QoQ) increase in Total Value Locked (TVL), reaching a record-breaking $450 million. This translates to a remarkable 693% year-over-year (YoY) jump, showcasing the rapid expansion of Decentralized Finance (DeFi) activity on Cardano. The growth wasn&#8217;t just limited to overall TVL. Stablecoin adoption witnessed a significant 37% QoQ and 673% YoY surge, highlighting their growing role in the Cardano ecosystem. This increasing stability attracts more users and facilitates various DeFi activities like borrowing, lending, and trading. The report also credits established protocols like MinswapDEX and the newly launched Indigo Protocol with driving this expansion. Indigo, a synthetic derivatives exchange, emerged as the largest protocol by TVL, surpassing even Minswap. This diversity within the ecosystem presents exciting opportunities for future growth. Technicals Point To Continued Gains Beyond fundamentals, technical analysis suggests further upside potential for ADA. After a brief price correction, Cardano formed a bullish pennant pattern, typically indicating a continuation of the uptrend after a consolidation period. This technical formation aligns with the positive sentiment surrounding the project and adds another layer of confidence for investors. Cardano currently trading at $0.6273 on the daily chart: TradingView.com The recent price breakout from the pennant confirms this bullish outlook. With a market valuation of more than $21 billion, Cardano securely ranks among the 10 leading crypto assets. This impressive valuation reflects the widespread recognition of Cardano&#8217;s potential. ADA price action. Source: Coingecko Furthermore, the past 24 hours alone saw a 21% rally in trading volume, amounting to nearly $730 million. This surge in activity indicates continued strong interest from investors amidst the current upward price movements. ADA&#8217;s price fluctuated between $0.58 and $0.62 throughout the week, showcasing a stable ascending pattern and solidifying the gains. Crypto expert Dan Gambardello further fueled the excitement, suggesting that ADA has the potential to reach the coveted $1 milestone, exceeding expectations despite market volatility. Development Engine Roars: Hydra And Mithril Push Innovation Cardano&#8217;s strength isn&#8217;t limited to price and TVL. The network boasts a thriving developer community actively building the future of the ecosystem. The Cardano Hydra team is diligently working on version 0.15.0, focused on enhancing scalability and transaction throughput. Significant progress has been made on smoke testing and website publishing workflows, bringing Hydra closer to reality. Related Reading: UNI Jumps Over 12% – Here’s Why Investors Flock To This Token Moreover, the Mithril team recently released the initial version of the Mithril client NPM package, marking another step towards secure and efficient smart contract development on Cardano. These ongoing advancements solidify Cardano&#8217;s commitment to innovation and position it well for future adoption. Featured image from Adobe Stock, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-18T16:00:56.000Z",
    "title": "Investors Shift Focus to Borroe Finance Amidst Volatility in Monero (XMR), Betting on Stability and Innovation",
    "url": "https://www.crypto-news-flash.com/investors-shift-focus-to-borroe-finance-amidst-volatility-in-monero-xmr-betting-on-stability-and-innovation/?utm_source=rss&utm_medium=rss&utm_campaign=investors-shift-focus-to-borroe-finance-amidst-volatility-in-monero-xmr-betting-on-stability-and-innovation",
    "description": "<img width=\"1200\" height=\"796\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-17T113945.723.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-17T113945.723.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-17T113945.723-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-17T113945.723-768x509.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-17T113945.723-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-17T113945.723-450x299.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Monero (XMR) dipped after leading cryptocurrency exchange Binance announced plans to delist all its subsisting pairs. As a result, investors have shifted their gaze to Borroe Finance ($ROE) as it promises price stability and blockchain innovation. Let’s find out why Borroe Finance ($ROE) is the better option between these two top altcoins. Borroe Finance Exhibits [...]"
  }
]