[
  {
    "source": "Cointelegraph",
    "date": "2023-12-01T20:01:22.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p >Binance reportedly notified its top market makers in September that a settlement with U.S. </p><h3 >Binance reportedly gave top market makers heads-up about DOJ settlement</h3><p >Crypto exchange Binance <a href=\"https://cointelegraph.com/news/binance-traders-sneak-peak-settlement\">reportedly notified its top market makers</a> that it was nearing its $4.3 billion settlement with U.S. </p><p >According to Bloomberg, Binance executives held an exclusive dinner with top traders in Singapore in September, where they notified them about a tentative deal with the U.S. Per Bloomberg, some Binance executives told traders that the exchange could easily afford the <a href=\"https://cointelegraph.com/news/us-officials-announce-binance-settlement\">multi-billion-dollar settlement</a>. </p><p >Binance executives, including new CEO Richard Teng, attended the Token2049 event in Singapore in September. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Our Head of Regional Markets, <a href=\"https://twitter.com/_RichardTeng?ref_src=twsrc%5Etfw\">@_RichardTeng</a>, spoke during today&#39;s <a href=\"https://twitter.com/ethereum_sg?ref_src=twsrc%5Etfw\">@ethereum_sg</a> event.<br><br>As part of a panel discussion, he dove into the topics of crypto in finance and setting the next stage of growth. <a href=\"https://t.co/0JjTB2LgbM\">pic.twitter.com/0JjTB2LgbM</a></p>&mdash; Binance (@binance) <a href=\"https://twitter.com/binance/status/1701324802684780597?ref_src=twsrc%5Etfw\">September 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p >As part of Binance's agreement with the DOJ, former CEO Changpeng Zhao resigned from his post and was barred from ever serving in an executive capacity at the exchange. </p><h3 >Bitcoin ETFs, user experience will drive adoption — eToro CEO</h3><p >While grassroots cryptocurrency adoption went stale after last year’s implosions in the industry, trading platform eToro’s chief executive believes that the appeal of exchange-traded funds (ETFs) for institutions and ease of investing through various platforms for non-professionals could further drive Bitcoin (BTC) adoption.</p><p >EToro CEO Yoni Assia told Cointelegraph at the recent Abu Dhabi Finance Week that institutions typically have rigid systems and prefer not to build new infrastructure for each asset class. </p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-01T20:00:00.000Z",
    "title": " KyberSwap hacker wants control, law firm says Aussie DeFi tax rules ‘non-binding’: Finance Redefined ",
    "url": "https://cointelegraph.com/news/kyberswap-hacker-wants-control-law-firm-says-aussie-defi-tax-rules-non-binding-finance-redefined",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYjZkM2IyM2YtZWY2OS00NjQxLTg2ZGQtMmVjODViMDBiOTU3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Law firm Cadena Legal said that the guidance released by the Australian Taxation Office is “non-binding” and must be treated as “toilet paper.” </p>\n                    <p><p>Welcome to Finance Redefined, your weekly dose of essential <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\">decentralized finance (DeFi)</a> insights — a newsletter crafted to bring you the most significant developments from the past week.</p><p>The hacker who stole over $46 million from the DeFi protocol KyberSwap has released a list of demands, including total control over the Kyber company and all its assets. </p><p>A law firm in Australia described the DeFi tax guidance released by the country’s finance regulator as “toilet paper.” Cadena Legal told Cointelegraph that this guidance would only confuse Australians and might reduce their willingness to comply with the rules. </p><p>The DeFi ecosystem continued the bullish market momentum from last week, with most tokens showing steady gains on the weekly charts.</p><h2>KyberSwap hacker demands complete control over Kyber company</h2><p>The KyberSwap hacker has finally revealed the conditions that needed to be fulfilled for them to return some of the funds taken from their $46 million hack. </p><p>While the hacker’s demands may be absurd, they also said what they would do if they were fulfilled. </p><p><a href=\"https://cointelegraph.com/news/kyberswap-hacker-demands-complete-control-over-kyber-company\" ><strong>Continue reading</strong></a></p><p><a href=\"https://cointelegraph.com/news/kyberswap-hacker-wants-control-law-firm-says-aussie-defi-tax-rules-non-binding-finance-redefined\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-12-01T19:56:05.000Z",
    "title": "Goldfinch community approved deployment on Base L2, GFI up 14%",
    "url": "https://crypto.news/goldfinch-community-approved-deployment-on-base-l2-gfi-up-14/",
    "description": "Governance members agreed that launching Goldfinch’s defi loan service on Coinbase’s decentralized network would be beneficial and help to onboard more users."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-01T20:00:25.000Z",
    "title": "Why The Crypto Market Tides Are Turning In Favor Of Altcoins",
    "url": "https://www.newsbtc.com/news/crypto-market-tides-are-turning-in-favor-of-altcoins/",
    "description": "For the last two years in the crypto market, it has paid off to be in Bitcoin versus altcoins. However, a new BTC dominance chart shows why the tides are about to turn in favor of altcoins. Bitcoin Crypto Market Dominance Remains Above 50% At this very moment, Bitcoin, the top cryptocurrency by market cap, represents more than 50% of the entire crypto market. On one hand, this makes sense given its regulatory acceptance, first-mover advantage, and significant brand power. On the other hand, there are tens of thousands of altcoins out there and yet BTC is still dominant. Related Reading: A Golden Opportunity For Ethereum? 600% Buy Signal Returns But even Bitcoin dominance goes through cyclical boom and bust phases where it loses its dominance to the rest of the crypto market. This is typically called &#8220;altcoin season.&#8221; The last one to occur was back in late 2020 into 2021, and it lasted only several months. Before that, the rally that coined the term altcoin season took place all of 2017. With three to four years in between the 2017 rally, the calendar turning toward 2024 puts us yet another year closer to the next altcoin season. This is evident by price action and technical oscillators following sine waves. Sine waves could point to the next alt season &#124; BTC.D on TradingView.com  Riding The Wave To The Next Altcoin Season According to Investopedia, a sine wave is an S-shaped geometric waveform that oscillates periodically above and below zero. Sine waves can be used in technical analysis to help identify cyclical patterns in technical indicators and oscillators. In the chart above, the sine wave suggests that indicators are ready to begin rolling over, with the wave overlaid matching the 1M Stochastic almost perfectly. Aside from some chop, the sine waves have followed the ebb and flow back and forth between Bitcoin and altcoin dominance for going on a decade. Related Reading: Howling At The Moon: 23,000% Dogecoin Signal Reawakens If the tool accurately demonstrates the path ahead for Bitcoin dominance, the next altcoin season could be on the way soon enough. Bitcoin is approaching $40,000 and is becoming increasingly expensive for retail investors, who aren&#8217;t even paying attention yet to the crypto market. When they do realize how expensive Bitcoin is again, right under their noses, retail investors will search for the &#8220;next Bitcoin&#8221; frantically, sparking the next altcoin season. The last time these phases occurred, Bitcoin was passing $10,000 in 2017, and $20,000 in 2020. Now in 2023, will $40,000 be the trigger for alts to finally outperform? It&#039;s time for the ebb and flow to favor altcoins again pic.twitter.com/y5cONFhJyo &#8212; Tony &#34;The Bull&#34; (@tonythebullBTC) December 1, 2023 Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from Shutterstock, Charts from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-01T19:45:24.000Z",
    "title": "‘No Rhyme or Reason’ – SEC Commissioner Hester Peirce Blasts Her Own Agency’s Handling of US Crypto Industry",
    "url": "https://dailyhodl.com/2023/12/01/no-rhyme-or-reason-sec-commissioner-hester-peirce-blasts-her-own-agencys-handling-of-us-crypto-industry/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/11/no-rhyme-hester-her.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/11/no-rhyme-hester-her.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/11/no-rhyme-hester-her.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/11/no-rhyme-hester-her.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/11/no-rhyme-hester-her.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/11/no-rhyme-hester-her.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/11/no-rhyme-hester-her.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>U.S. Securities and Exchange Commission (SEC) official Hester Peirce is launching another broadside against her agency over its regulation of the crypto sector. While speaking at the Blockchain Association’s Policy Summit this week, Peirce, one of the SEC&#8217;s five appointed commissioners, argues that the regulator is bringing enforcement actions against old cases &#8220;without clear rhyme [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/01/no-rhyme-or-reason-sec-commissioner-hester-peirce-blasts-her-own-agencys-handling-of-us-crypto-industry/\">‘No Rhyme or Reason’ – SEC Commissioner Hester Peirce Blasts Her Own Agency’s Handling of US Crypto Industry</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-01T19:41:49.000Z",
    "title": "U.S. Securities and Exchange Commission (SEC) Seeks Public’s Thoughts on Fidelity’s Potential Spot Ethereum ETF",
    "url": "https://dailyhodl.com/2023/12/01/u-s-securities-and-exchange-commission-sec-seeks-publics-thoughts-on-fidelitys-potential-spot-ethereum-etf/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/sec-influencer-eth-fall.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/sec-influencer-eth-fall.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/sec-influencer-eth-fall.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/sec-influencer-eth-fall.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/sec-influencer-eth-fall.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/sec-influencer-eth-fall.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/sec-influencer-eth-fall.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. Securities and Exchange Commission (SEC) is asking the public what they think about financial services giant Fidelity’s potential spot market Ethereum (ETH) exchange-traded fund (ETF). In a new notice, the regulatory agency is asking the public for their opinion on Fidelity filing a bid to create an Ethereum-based ETF on the Chicago Board [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/01/u-s-securities-and-exchange-commission-sec-seeks-publics-thoughts-on-fidelitys-potential-spot-ethereum-etf/\">U.S. Securities and Exchange Commission (SEC) Seeks Public’s Thoughts on Fidelity’s Potential Spot Ethereum ETF</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]