[
  {
    "source": "Cointelegraph",
    "date": "2023-07-15T10:50:38.000Z",
    "title": "Ark Invest sells more Coinbase shares, eyes Meta platforms, Robinhood",
    "url": "https://cointelegraph.com/news/ark-invest-sells-more-coinbase-shares-eyes-meta-platforms-robinhood",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/6b98e24d-d964-42e6-8a52-49e5ee2bd9fa.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cathie Wood, the Bitcoin advocate, is actively investing in Meta Platforms (META) and Robinhood Markets (HOOD) shares.</p>\n                    <p><p>As the stock price of Coinbase (COIN) reaches a 52-week high, Ark Invest, the investment management firm led by Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC)</a> bull <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/cathie-wood%5D\">Cathie Wood</a>, has recently divested more of its Coinbase shares.</p><p>Following Ark Invest's significant acquisition of Coinbase shares during the bear market, the investment firm has recently sold off a portion of its Coinbase holdings for <a href=\"https://cointelegraph.com/news/coinbase-ark-invest-cathie-wood-sells-135k-coinbase-shares-as-coin-hits-90\">the second time this week</a>. In the meantime, Cathie Wood, the prominent Bitcoin advocate, is actively investing in Meta Platforms (META) and Robinhood Markets (HOOD) shares.</p><p>Trade information observed by Cointelegraph reveals that on July 14, Cathie Wood's Ark Invest funds divested a total of 478,356 Coinbase (COIN) shares valued at $53 million, coinciding with the stock's yearly high of $114.43.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/80ded759-ec02-45ec-9da5-4274df80d997.JPG\"  /><figcaption style=\"text-align: center;\"><em>Screenshot of  ARK Invest trading notification. Source: ARK Trading desk.</em></figcaption></figure><p>In the transactions, Cathie Wood's flagship fund ARK Innovation ETF (ARKK) divested 263,247 COIN shares, ARK Next Generation Internet ETF (ARKW) sold 93,227 COIN shares, and ARK Fintech Innovation ETF (ARKF) offloaded 35,666 COIN shares.</p><p>In June, Cathie Wood initiated the purchase of Meta Platforms shares after the company announced the launch of \"Threads,\" a social media app similar to Twitter. ARK Innovation ETF (ARKK) acquired 69,793 META shares, while ARK Fintech Innovation ETF (ARKF) purchased 111,843 shares of Robinhood. Additionally, ARK Next Generation Internet ETF (ARKW) increased its holdings with 12,559 META shares and 169,116 Robinhood shares.</p><p>As per CoinMarketCap, <a href=\"https://coinmarketcap.com/currencies/coinbase-pre-ipo-tokenized-stock-ftx/\" target=\"_blank\" rel=\"noopener nofollow\">the closin</a>g price of COIN stock on Friday stood at $105.31, experiencing a 1.58% decline as investors secured their profits. During the week, COIN price surged by 33%, reaching a 24-hour high of $114.43, and displaying an impressive year-to-date increase of 213%. In addition to the overall upswing in crypto-related stocks, Coinbase witnessed a notable rise following the summary judgment in the <a href=\"https://cointelegraph.com/learn/the-sec-vs-ripple-lawsuit-everything-you-need-to-know\">US SEC v. Ripple lawsuit.</a></p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/allowing-coinbase-to-go-public-was-not-a-blessing-of-the-business-sec\"><strong><em>Allowing Coinbase to go public was not a ‘blessing’ from regulators — SEC</em></strong></a></p><p>Cathie Wood’s ARK Innovation ETF (ARKK) <a href=\"https://cointelegraph.com/news/coinbase-ark-invest-cathie-wood-sells-135k-coinbase-shares-as-coin-hits-90\">sold 135,152 Coinbase (COIN) shares</a> worth $12 million on July 11 and ARK Fintech Innovation ETF (ARKF) s<a href=\"https://cointelegraph.com/news/cathie-wood-s-ark-sells-coinbase-stock-for-the-first-time-in-2023\">old 160,887 Coinbase (COIN) shares</a> in March.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\"><strong><em>How smart people invest in dumb memecoins: 3-point plan for success</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-07-15T10:47:32.000Z",
    "title": "InQubeta (QUBE) aims to outperform AAVE and Aptos with AI crowdfunding platform",
    "url": "https://crypto.news/inqubeta-qube-aims-to-outperform-aave-and-aptos-with-ai-crowdfunding-platform/",
    "description": "InQubeta (QUBE), a platform combining artificial intelligence (AI) and blockchain, has garnered attention for its goal to improve growth and profitability in the crypto market. As the demand for AI-driven solutions continues to rise, InQubeta aims to outperform established players&#8230;"
  }
]