[
  {
    "source": "Crypto Daily",
    "date": "2023-11-02T08:15:45.000Z",
    "title": "Wave Goodbye to the Bear Market, Prepare for the Bull Run at  “Blockchain Genesis, Thailand Blockchain Week 2023”  on November 11-12 at Samyan Mitrtown",
    "url": "https://cryptodaily.co.uk/2023/11/wave-goodbye-to-the-bear-market-prepare-for-the-bull-run-at-blockchain-genesis-thailand-blockchain-week-2023-on-november-11-12-at-samyan-mitrtown",
    "description": "Wave Goodbye to the Bear Market, Prepare for the Bull Run at  “Blockchain Genesis, Thailand Blockchain Week 2023”  on November 11-12 at Samyan Mitrtown"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-02T08:35:32.000Z",
    "title": "Ripple Transfers 800 Million XRP Back To Escrow: Catalyst For Price Rally?",
    "url": "https://www.newsbtc.com/ripple-2/ripple-800-m-xrp-escrow-catalyst-price-rally/",
    "description": "Recent financial maneuvers by Ripple Labs have caught the eye of crypto sleuths again. Recent data from crypto data analysis platform Whale Alert has shown a significant movement of 800 million XRP tokens back into Ripple&#8217;s established escrow system. This move comes in the aftermath of Ripple&#8217;s customary monthly unlocking of one billion XRP, a practice that started in 2017 as part of the company&#8217;s strategy to maintain XRP price stability. Ripple Returns 800 Million XRP To Escrow The essence of Ripple&#8217;s escrow mechanism is to facilitate a consistent and predictable distribution of XRP to the market. This counteracts any potential price volatility that might arise from a sudden influx of tokens. In its commitment to this cause, Ripple, back in 2017, pledged to gradually release 55 billion XRP in 55 monthly tranches of one billion XRP each. Post-release each month, Ripple typically returns a majority of the tokens, mostly 800 million XRP, back into the escrow, retaining a minor portion, around 200 million XRP, for market circulation. Recent data from Whale Alert confirms that Ripple was no exception this month and has locked 800 million XRP tokens back into the established escrow system. Related Reading: XRP Price Rally Threatened As Ripple Unlocks 1 Billion Tokens Notably, the return of the 800 million XRP tokens occurred in two equal transactions, each involving 400 million XRP. Delving into the data from XRP Scan reveals that the first set, amounting to 400 million XRP, was directed back into escrow from an address known as &#8216;Ripple 10.&#8217; Prior to this, &#8216;Ripple 10&#8217; had received the said tokens from two different addresses: Ripple 22 and Ripple 23. The subsequent batch of 400 million XRP was transacted from &#8216;Ripple 23&#8217; to another address dubbed &#8216;Ripple 11,&#8217; before it was also directed to the company&#8217;s escrow account. The market value of the re-locked 800 million XRP stood at an approximate $480 million during the time of these transactions. Of the original 1 billion XRP that were made available, the remaining 200 million XRP, with a current valuation of about $121 million, was moved from Ripple 22 to Ripple 1. This balance is anticipated to facilitate Ripple&#8217;s operational expenses and other business-related activities. Related Reading: SEC Demands $700 Million Settlement From Ripple, Pro-XRP Lawyer Reveals Next Steps Ripple&#8217;s escrow holdings now total roughly 40.9 billion XRP. For context, their Q3 report disclosed that they had about 41.3 billion XRP in escrow at the end of September. XRP Price Poised For More Upside After XRP broke the 200-day Exponential Moving Average (EMA) line (blue) on October 21, the price has been on a tear. Within 11 days, the XRP price increased by almost 20%. That the XRP price took a breather from its rally yesterday is probably not due to Ripple&#8217;s monthly transfer from escrow, as the XRP tokens do not hit the market immediately and, moreover, investors know how to gauge the issue. A better explanation is that XRP encountered a strong resistance with the 0.386 Fibonacci retracement level at $0.625, where the price was rejected in a first attempt. Notably, the bulls could make another attempt if the price stays above the $0.60 level. If the breakout succeeds, the 0.5 Fibonacci retracement level at $0.683 could be the next short-term price target. However, if the XRP price is rejected again at $0.625, a retest of the 0.236 Fibonacci retracement level at $0.553 could be the next logical move. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-02T08:19:46.000Z",
    "title": "Solana Surges 80% in a Month as Firedancer Testnet Launches – More SOL Gains to Come?",
    "url": "https://www.crypto-news-flash.com/solana-surges-80-in-a-month-as-firedancer-testnet-launches-more-sol-gains-to-come/?utm_source=rss&utm_medium=rss&utm_campaign=solana-surges-80-in-a-month-as-firedancer-testnet-launches-more-sol-gains-to-come",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-02T171842.284.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Solana\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-02T171842.284.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-02T171842.284-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Solana&#8217;s SOL token has witnessed an impressive 80% surge in value over the last month, propelled by the Firedancer testnet launch. Despite this rise, SOL is still 84% below its all-time high from November 2021, reflecting the volatile nature of cryptocurrency markets. The blockchain world is currently abuzz as Solana&#8217;s SOL token showcases a staggering [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-02T08:38:33.000Z",
    "title": "Musk Criticizes NFTs in a Recent Joe Rogan Podcast Appearance",
    "url": "https://coinedition.com/musk-criticizes-nfts-in-a-recent-joe-rogan-podcast-appearance/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/nft8.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Trump Cards Surge Amid The Former President’s Mugshot Release\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/nft8.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/nft8-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/nft8-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/nft8-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/nft8-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/nft8-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/nft8-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/nft8-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/nft8-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/nft8-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/nft8-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/nft8-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/nft8-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/nft8-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/nft8-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/nft8-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent episode of the Joe Rogan podcast, Elon Musk inadvertently highlighted the advantages of Bitcoin Ordinals, which are Non-Fungible Tokens (NFTs) on Bitcoin’s chain, while simultaneously ridiculing mainstream NFTs for their failure to store metadata on-chain. Musk noted that most NFTs only contain a URL link rather than encoding the actual JPEG image [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/musk-criticizes-nfts-in-a-recent-joe-rogan-podcast-appearance/\">Musk Criticizes NFTs in a Recent Joe Rogan Podcast Appearance</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]