[
  {
    "source": "CoinDesk",
    "date": "2023-08-02T12:00:00.000Z",
    "title": "Coinbase Analysts Optimistic Ahead of Q2 Earnings, but Warn About USDC Risks and Lower Trading Volumes",
    "url": "https://www.coindesk.com/business/2023/08/02/coinbase-analysts-optimistic-ahead-of-q2-earnings-but-warn-about-usdc-risks-and-lower-trading-volumes/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The crypto exchange reports earnings for the second quarter of 2023 after the market closes on Thursday."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-02T11:47:25.000Z",
    "title": "Countdown to Litecoin halving today, is ‘digital silver’ ready to break out?",
    "url": "https://cryptoslate.com/countdown-to-litecoin-halving-today-is-digital-silver-ready-to-break-out/",
    "description": "<p>The highly anticipated Litecoin (LTC) halving will occur later today, Aug. 2, marking the third event in the cryptocurrency&#8217;s history. According to litecoinhalving.com, the Litecoin network will reach a block height 2,520,000 around 3:16 pm UTC, reducing the block reward from 12.5 LTC to 6.25 LTC. Miners&#8217; subsidy for solving a block is cut in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/countdown-to-litecoin-halving-today-is-digital-silver-ready-to-break-out/\">Countdown to Litecoin halving today, is &#8216;digital silver&#8217; ready to break out?</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-02T12:00:00.000Z",
    "title": "MicroStrategy Q2 Profits Soar With 467 $BTC Purchase",
    "url": "https://cryptodaily.co.uk/2023/08/microstrategy-q2-profits-soar-with-467-btc-purchase",
    "description": "<p>Software company MicroStrategy is continuing its Bitcoin investments with its latest purchase of 467 BTCs, significantly contributing to its Q2 profits.</p>\nLatest Earnings Report From MicroStrategy\n<p>MicroStrategy, the largest independent publicly-traded business intelligence company, has announced its financial results for the second quarter of the 2023 fiscal year.&nbsp;</p>\n<p>One of the standout highlights of the report is MicroStrategy's Bitcoin holdings. The company has been steadily accumulating the crypto as part of its capital allocation strategy.&nbsp;</p>\n<p>Its co-founder and chairman, Michael Saylo,r has been a very vocal proponent of Bitcoin. He recently revealed that the company had acquired an additional 467 BTC for $14.4 million. The company had previously reported the purchase of 12,333 BTCs in the month of June. As of July 31, 2023, MicroStrategy held a staggering 152,800 bitcoins, acquired at a total cost of $4.53 billion, with an average price of $29,672 per bitcoin.</p>\nFinancial Performance in Q2 2023\n<p>Andrew Kang, the Chief Financial Officer of MicroStrategy, emphasized the importance of their bitcoin holdings in light of favorable factors such as increasing institutional interest, progress on accounting transparency, and ongoing regulatory clarity for bitcoin.</p>\n<p>MicroStrategy's gross profit for the second quarter of 2023 was $93.3 million, representing a gross margin of 77.5%. By reducing operating expenses by 88.2% from that of Q2 2022 and other significant changes in the company&rsquo;s loss and revenue structure, MicroStrategy was able to bring in its digital asset impairment losses to $24.1 million for Q2 2023, compared to the significantly higher amount of $917.8 million in Q2 2022.&nbsp;</p>\nMicroStrategy's Vision and Strategies\n<p>In its latest earnings report, MicroStrategy spoke about its two corporate strategies: first, to acquire and hold bitcoin as a dependable store of value, and second, to grow its enterprise analytics software business to promote its vision of Intelligence Everywhere. The company views Bitcoin as an attractive investment and has been committed to increasing its bitcoin holdings over time.</p>\n<p>President and CEO Phong Le highlighted their new MicroStrategy ONE platform, saying,&nbsp;</p>\n\n<p>&ldquo;Our new MicroStrategy ONE platform is the most important product innovation in the history of our company because it represents a fundamental shift in our industry to harness the power of business intelligence and artificial intelligence together to upgrade the way organizations do business. The growth in our recurring revenue this quarter illustrated the strength of our enterprise cloud platform, despite ongoing macroeconomic headwinds.&rdquo;&nbsp;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-02T12:00:00.000Z",
    "title": "Best Disrupting Crypto Projects to Watch in 2023",
    "url": "https://cryptodaily.co.uk/2023/08/best-disrupting-crypto-projects-to-watch-in-2023",
    "description": "<p class=\"s5\">2023 has brought forth a promising array of young projects that are capturing the attention of enthusiasts and investors alike. These breakthrough initiatives encompass a diverse range of areas, offering innovative solutions to some of the most pressing challenges faced in the virtual space. From an innovative social media gamified approach and decentralized personal identification system to advanced infrastructure solutions for seamless interaction with the blockchain, these projects are paving the way for a more accessible, secure, and interconnected crypto ecosystem.</p>\n<p class=\"s5\">As the world continues to embrace the potential of blockchain technology and cryptocurrencies, these five projects stand out for their ambitious visions and disruptive approaches. With a shared commitment to pushing the boundaries of what's possible, they hold the potential to redefine how we engage with the digital realm and leverage the power of decentralized networks. In this exploration of the most noteworthy young projects in the crypto industry for 2023, we delve into the cutting-edge innovations that are shaping the future of finance, identity management, and decentralized applications.</p>\nCheelee\n<p class=\"s5\">Cheelee, a Web3 GameFi short video platform that rewards users for watching the feed, changes the way people make money on social media.</p>\n<p class=\"s5\">Cheelee uses the Attention Economy concept to give everyone a new way of earning an income and a living wage, regardless of age, occupation, or socioeconomic background, and has the potential to redefine the social media industry while helping solve the problem of job automation by AI.</p>\n\n<p class=\"s5\">\"Cheelee is a game-changing Web3 GameFi short video platform that reshapes the landscape of social media platforms and rebalances the power which was earlier concentrated in the hands of platform owners, bloggers and advertisers. Our platform is not just about watching short videos; it's about empowering users to become more active in their virtual journey,\" CPO Cheelee Yury Kardonov explains.</p>\n\n<p class=\"s5\">To inspire new users to learn its money-making mechanisms, the app gives them a free pair of Starting Digital glasses. Users that upgrade these glasses can increase their initial investment by more than X2. Cheeleers manage to earn up to several thousand dollars monthly with this tool, as seen from their reports on the platform's socials.</p>\n<p class=\"s5\">Cheelee is going to blow up in 2023 with its governance token, $CHEEL, which has been steadily increasing in value and shows great promise because of its limited supply, high utility, and possible access to almost 5 billion social media users around the world. Cheeleeis already available on App Store and Google Play.</p>\nWorldCoin\n<p class=\"s5\">Meet Worldcoin, a unique cryptocurrency project with a mission to verify people's identities online and combat the problem of bots and fake virtual profiles created by AI. Their special system, Proof-of-Personhood, works by scanning your eyes to ensure you are who you claim to be, preventing multiple accounts and stopping fraud.</p>\n\n<p class=\"s5\">\"A very central one is, how can you prove that you are a real human (not a bot) and have not yet claimed your free share of the currency, without revealing personal information about yourself like your name or email. Making this work in a scalable and fraud-proof way is hard,\" explains Alex Blania, co-founder of Worldcoin and Chief Executive Officer (CEO) of the project.&nbsp;</p>\n\n<p class=\"s5\">Founded in 2019 by Sam Altman (CEO of OpenAI), Max Novendstern, and Alex Blania, and supported by venture capital firm Andreessen Horowitz, Worldcoin uses a distribution method similar to universal basic income (UBI) to encourage users to join their network. They offer their cryptocurrency as a reward to users who get their iris scanned using Worldcoin's orb-shaped iris scanner.</p>\n<p class=\"s5\">Worldcoin has been highly successful in raising funds, starting with $25 million in October 2021 and an additional $100 million in just six months, boosting the token's value to an impressive $3 billion. And they didn't stop there, announcing another $115 million in funding in May 2023.</p>\n<p class=\"s5\">As of January 2023, Worldcoin celebrated reaching 1 million sign-ups, with more than 115,000 new users in December 2022 alone. Their user base is diverse, coming from various countries like Argentina, Chile, India, Kenya, Portugal, Spain, and Uganda. By July 2023, they expanded to over 2 million users, and their World App is rocking with over 500,000 monthly active users.</p>\nArkham Intelligence\n<p class=\"s5\">Introducing Arkham Intelligence, a company focused on blockchain intelligence. Their platform is designed to reveal information about the real-world entities and individuals connected to cryptocurrencies, giving valuable insights into the cryptocurrency ecosystem. The goal is to remove anonymity from the blockchain and shed light on the identities behind cryptocurrency transactions.</p>\n\n<p class=\"s5\">\"Our industry has been plagued with bad actors who survive by hiding in the shadows. Crypto intelligence brings them into the light, and that&rsquo;s what our platform and our research have always done,\" Arkham CEO Miguel Morel tweeted.&nbsp;</p>\n\n<p class=\"s5\">In July 2023, Arkham Intelligence launched a bounty marketplace, enabling people to buy and sell on-chain cryptocurrency data. To facilitate these trades, they introduced the ARKM token as the main currency on the Arkham Intelligence exchange. Currently, as of July 2023, the ARKM token is being traded at $0.75 with a market cap of $113 million. For example, two savvy users of the Arkham platform recently earned a substantial reward of nearly $6,000 for successfully uncovering Do Kwon's wallet.</p>\n<p class=\"s5\">The initial request to track the wallets of the former head of Terraform Labs was placed on the on-chain data marketplace, Arkham Intel Exchange. Two online detectives took up the challenge and accomplished the bounty hunt with great success, providing evidence that several addresses indeed belong to the businessman. As a result, they were rewarded with 9519 ARKM tokens, equivalent to approximately $5971.</p>\nFetch.ai\n<p class=\"s5\">Fetch.ai is an open-source machine learning platform, decentralized and based on a distributed ledger. It offers secure access to AI for smart and autonomous services. They've also made Agentverse, a web3 virtual hub, letting users create autonomous agents easily, no matter their technical skills.</p>\n<p class=\"s5\">The platform's smart ledger combines blockchain with direct acrylic graph (DAG) tech. Transactions can be assigned to different routes, forming a fragmented network. New routes can be created if existing ones get overloaded. Fetch.ai uses UPoW (useful proof-of-work/proof-of-beneficial work), a mix of proof-of-work, proof-of-stake, and other mechanisms.</p>\n<p class=\"s5\">FET is the primary value exchange on Fetch.ai. It's essential for network exchanges, staking, and rewarding node operators. FET unlocks various operations on the network and acts as the main payment method. It's also needed to find, create, deploy, and train autonomous economic agents.</p>\n<p class=\"s5\">Fetch.ai's disruptive nature stems from its ability to challenge the status quo in machine learning, blockchain technology, and decentralized applications, offering new solutions and possibilities that can potentially reshape industries and user experiences.</p>\nArbitrum\n<p class=\"s5\">Arbitrum, developed by Offchain Labs in 2018, is a Layer 2 scaling solution for Ethereum. Its purpose is to address the Ethereum network's limitations, like slow transaction speeds and high fees during busy times. By reducing work and data storage on Ethereum's mainnet(Layer 1 or L1), Arbitrum aims to decrease network congestion and transaction costs, enhancing the speed and scalability of Ethereum smart contracts.</p>\n\n<p class=\"s5\">\"Our mission at Arbitrum is to scale Ethereum without compromising on security. Notice that we're focused on the result, not the tool. On the end, not the means,\" wrote Steven Goldfeder, co-founder and CEO of Offchain Labs.</p>\n\n<p class=\"s5\">Arbitrum enables users to perform transactions off the main network, which are later verified and grouped before being added to the main chain. This process helps ease congestion and lower gas fees on Ethereum, benefiting decentralized finance (DeFi) projects like Sushiswapand Aave, which utilize Arbitrum to offer efficient swaps with lower gas fees. The platform supports the Ethereum Virtual Machine (EVM), allowing seamless integration with existing Ethereum tools and infrastructure for DeFi developers.</p>\n<p class=\"s5\">To gain exposure to the Arbitrum network, individuals can consider the governance token, ARB. Holders of ARB tokens can participate in the protocol's decision-making processes, including proposing and voting on upgrades or changes. Additionally, ARB tokens are used to pay for transaction fees on the Arbitrum network. Despite being launched in March 2023, the ARB token has already reached a market capitalization of over one billion dollars.</p>\n<p class=\"s10\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T12:07:21.000Z",
    "title": "Kenyan government suspends Worldcoin operations amid concerns over data privacy and legitimacy",
    "url": "https://www.cryptopolitan.com/kenya-suspends-worldcoin-operations-concerns-over-data-privacy-legitimacy/",
    "description": "In a striking move against a global identity crypto protocol, Kenya&#8217;s Ministry of the Interior has suspended the operations of Worldcoin within the country. Worldcoin, co-founded by OpenAI&#8217;s Sam Altman, has come under scrutiny for its practices in collecting iris data. The suspension will remain effective as various Kenyan agencies assess the project&#8217;s risks to ... <a title=\"Kenyan government suspends Worldcoin operations amid concerns over data privacy and legitimacy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/kenya-suspends-worldcoin-operations-concerns-over-data-privacy-legitimacy/\" aria-label=\"More on Kenyan government suspends Worldcoin operations amid concerns over data privacy and legitimacy\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T11:46:17.000Z",
    "title": "BTC ETFs aside –  6 firms file SEC applications for Ether futures ETFs",
    "url": "https://www.cryptopolitan.com/6-firms-file-sec-applications-for-ether-etfs/",
    "description": "According to reports, there are currently six Ethereum Futures ETFs awaiting approval from the SEC. Several weeks after the bitcoin spot ETF craze, these entities have filed applications with the U.S. Securities and Exchange Commission (SEC) for ether (ETH) futures-based exchange-traded funds (ETFs). How will this pan out? The race for Ether features begins The ... <a title=\"BTC ETFs aside &#8211;  6 firms file SEC applications for Ether futures ETFs\" class=\"read-more\" href=\"https://www.cryptopolitan.com/6-firms-file-sec-applications-for-ether-etfs/\" aria-label=\"More on BTC ETFs aside &#8211;  6 firms file SEC applications for Ether futures ETFs\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-02T11:44:30.000Z",
    "title": "Can AI-Generated Images Encourage People to Embrace Parenthood?",
    "url": "https://www.cryptopolitan.com/ai-generated-images-embrace-parenthood/",
    "description": "A novel app called Remini has captured users&#8217; attention by allowing them to visualize their future selves, including images of themselves in wedding dresses and maternity wear, along with AI-generated images of babies and family portraits. While imagining future families has been a common practice throughout history, modern society&#8217;s shift towards greater career flexibility and ... <a title=\"Can AI-Generated Images Encourage People to Embrace Parenthood?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-generated-images-embrace-parenthood/\" aria-label=\"More on Can AI-Generated Images Encourage People to Embrace Parenthood?\">Read more</a>"
  },
  {
    "source": "Kraken Blog",
    "date": "2023-08-02T12:00:18.000Z",
    "title": "12 Years of Kraken: CEO Dave Ripley on empowering the next billion crypto users",
    "url": "https://blog.kraken.com/news/12-years-of-kraken-ceo-dave-ripley-on-empowering-the-next-billion-crypto-users",
    "description": "Twelve years ago, we began our pioneering mission to become one of the first and most successful digital asset exchanges. We started by trading only four cryptocurrencies, but now support over 220 assets on 67 blockchains – and over 700 markets. We’ve been at the forefront of the crypto revolution since 2011. As one of [&#8230;]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-02T12:02:35.000Z",
    "title": "WBTC Up After Large Transactions Impacted Exchange Supply",
    "url": "https://coinedition.com/wbtc-up-after-large-transactions-impacted-exchange-supply/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/WrappedBitcoin_is_seeing_major_activity_today_after_a_pair_of_2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/WrappedBitcoin_is_seeing_major_activity_today_after_a_pair_of_2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/WrappedBitcoin_is_seeing_major_activity_today_after_a_pair_of_2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/WrappedBitcoin_is_seeing_major_activity_today_after_a_pair_of_2-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/WrappedBitcoin_is_seeing_major_activity_today_after_a_pair_of_2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/WrappedBitcoin_is_seeing_major_activity_today_after_a_pair_of_2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/WrappedBitcoin_is_seeing_major_activity_today_after_a_pair_of_2-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/WrappedBitcoin_is_seeing_major_activity_today_after_a_pair_of_2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/WrappedBitcoin_is_seeing_major_activity_today_after_a_pair_of_2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/WrappedBitcoin_is_seeing_major_activity_today_after_a_pair_of_2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/WrappedBitcoin_is_seeing_major_activity_today_after_a_pair_of_2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/WrappedBitcoin_is_seeing_major_activity_today_after_a_pair_of_2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/WrappedBitcoin_is_seeing_major_activity_today_after_a_pair_of_2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/WrappedBitcoin_is_seeing_major_activity_today_after_a_pair_of_2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/WrappedBitcoin_is_seeing_major_activity_today_after_a_pair_of_2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/WrappedBitcoin_is_seeing_major_activity_today_after_a_pair_of_2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/WrappedBitcoin_is_seeing_major_activity_today_after_a_pair_of_2-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Wrapped Bitcoin (WBTC) is seeing a lot of activity today after two 2,000 WBTC moves resulted in a drop in exchange supply, according to a post shared on Twitter by the on-chain analytics platform Santiment. Subsequently, CoinMarketCap indicated that WBTC was trading hands at $29,595.75 after its price rose by 2.35% over the past day [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/wbtc-up-after-large-transactions-impacted-exchange-supply/\">WBTC Up After Large Transactions Impacted Exchange Supply</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-02T11:54:15.000Z",
    "title": "BALD Deployer Signals the Next Target, SushiSwap; Sushi Price Surges",
    "url": "https://coinedition.com/bald-deployer-signals-the-next-target-sushiswap-sushi-price-surges/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/BALD_deployer_hints_at_Sushi_Swap_as_next_target_after_meme_coin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/BALD_deployer_hints_at_Sushi_Swap_as_next_target_after_meme_coin.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/BALD_deployer_hints_at_Sushi_Swap_as_next_target_after_meme_coin-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/BALD_deployer_hints_at_Sushi_Swap_as_next_target_after_meme_coin-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/BALD_deployer_hints_at_Sushi_Swap_as_next_target_after_meme_coin-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/BALD_deployer_hints_at_Sushi_Swap_as_next_target_after_meme_coin-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/BALD_deployer_hints_at_Sushi_Swap_as_next_target_after_meme_coin-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/BALD_deployer_hints_at_Sushi_Swap_as_next_target_after_meme_coin-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/BALD_deployer_hints_at_Sushi_Swap_as_next_target_after_meme_coin-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/BALD_deployer_hints_at_Sushi_Swap_as_next_target_after_meme_coin-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/BALD_deployer_hints_at_Sushi_Swap_as_next_target_after_meme_coin-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/BALD_deployer_hints_at_Sushi_Swap_as_next_target_after_meme_coin-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/BALD_deployer_hints_at_Sushi_Swap_as_next_target_after_meme_coin-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/BALD_deployer_hints_at_Sushi_Swap_as_next_target_after_meme_coin-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/BALD_deployer_hints_at_Sushi_Swap_as_next_target_after_meme_coin-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/BALD_deployer_hints_at_Sushi_Swap_as_next_target_after_meme_coin-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/BALD_deployer_hints_at_Sushi_Swap_as_next_target_after_meme_coin-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>BaldBaseBald, the pseudonymous entity on Twitter that self-acknowledged as the deployer of the BALD memecoin hack, recently hinted at its next target as SushiSwap. In his latest tweet, BaldBaseBald has simply mentioned the name “sushiswap,” reminding the community that the current plan is “subject to change”. Following the recent rug pull that evoked controversies, BALD’s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bald-deployer-signals-the-next-target-sushiswap-sushi-price-surges/\">BALD Deployer Signals the Next Target, SushiSwap; Sushi Price Surges</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-02T11:49:20.000Z",
    "title": "HODL LAW’s Legal Battle Over Ethereum’s Status Hits Procedural Roadblock",
    "url": "https://coinedition.com/hodl-laws-legal-battle-over-ethereums-status-hits-procedural-roadblock/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/providing_expert_legal_counsel_to_our_business_clients_as_well_as.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/providing_expert_legal_counsel_to_our_business_clients_as_well_as.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/providing_expert_legal_counsel_to_our_business_clients_as_well_as-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/providing_expert_legal_counsel_to_our_business_clients_as_well_as-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/providing_expert_legal_counsel_to_our_business_clients_as_well_as-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/providing_expert_legal_counsel_to_our_business_clients_as_well_as-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/providing_expert_legal_counsel_to_our_business_clients_as_well_as-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/providing_expert_legal_counsel_to_our_business_clients_as_well_as-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/providing_expert_legal_counsel_to_our_business_clients_as_well_as-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/providing_expert_legal_counsel_to_our_business_clients_as_well_as-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/providing_expert_legal_counsel_to_our_business_clients_as_well_as-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/providing_expert_legal_counsel_to_our_business_clients_as_well_as-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/providing_expert_legal_counsel_to_our_business_clients_as_well_as-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/providing_expert_legal_counsel_to_our_business_clients_as_well_as-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/providing_expert_legal_counsel_to_our_business_clients_as_well_as-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/providing_expert_legal_counsel_to_our_business_clients_as_well_as-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/providing_expert_legal_counsel_to_our_business_clients_as_well_as-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>On August 1, HODL LAW tweeted that they will meticulously carry out their duty as expert legal counsel and assist all clients “that have been hurt and taken advantage of in the crypto space.” On July 28, HODL LAW, PLLC sued the U.S. Securities and Exchange Commission (SEC) in a United States District Court, seeking [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/hodl-laws-legal-battle-over-ethereums-status-hits-procedural-roadblock/\">HODL LAW&#8217;s Legal Battle Over Ethereum&#8217;s Status Hits Procedural Roadblock</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-02T11:45:46.000Z",
    "title": "The Perfect Setup? Don’t Count on a Bitcoin Crash Back to $23,000, Says Glassnode Co-Founder – Here’s Why",
    "url": "https://dailyhodl.com/2023/08/02/the-perfect-setup-dont-count-on-a-bitcoin-crash-back-to-23000-says-glassnode-co-founder-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Crash-Back-to.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Crash-Back-to.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Crash-Back-to.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Crash-Back-to.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Crash-Back-to.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Crash-Back-to.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Crash-Back-to.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The co-founder of the crypto analytics firm Glassnode thinks the current macro environment offers a &#8220;perfect setup&#8221; for riskier assets like Bitcoin (BTC) to thrive. The pseudonymous analyst Negentropic tells his 55,800 Twitter followers that the U.S. Dollar Index (DXY) is losing steam, which he sees as a positive for Bitcoin. Negentropic also notes that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/02/the-perfect-setup-dont-count-on-a-bitcoin-crash-back-to-23000-says-glassnode-co-founder-heres-why/\">The Perfect Setup? Don’t Count on a Bitcoin Crash Back to $23,000, Says Glassnode Co-Founder – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]