[
  {
    "source": "Cryptopolitan",
    "date": "2023-12-23T03:02:25.000Z",
    "title": "Ripple’s Bold Move – Exploring AI Integration, XRP Price Holds Steady",
    "url": "https://www.cryptopolitan.com/ripples-bold-move-ai-integration-xrp-price/",
    "description": "In a noteworthy development, Ripple Labs&#8217; Chief Technology Officer (CTO), Joel Katz, has hinted at the AI integration into the blockchain landscape by 2024. Katz envisions a transformative impact on cybersecurity and financial services, particularly in bolstering the security of ledger systems.&#160; The incorporation of AI is expected to bring precision to market analysis, automate [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-23T03:00:36.000Z",
    "title": "Solana Saga Orders Scrapped As $30 Million BONK Token Package Overshadows Device’s Value",
    "url": "https://www.newsbtc.com/news/solana/solana-saga-orders-scrapped-as-30-million-bonk-token-package-overshadows-devices-value/",
    "description": "Solana (SOL) and its associated meme coin, Bonk (BONK), have witnessed remarkable surges in value, with SOL recording gains of over 71% and Bonk experiencing an astonishing 342% increase over the past 30 days.  The positive growth within the Solana ecosystem has resulted in a surge in demand for the flagship mobile device, Solana Saga. However, the Solana Mobile team recently addressed challenges in meeting the “overwhelming demand” and explained order cancellations and inventory management issues. Solana Mobile Faces Inventory Mishap Over the past month, SOL has seen a significant uptrend, inching closer to the $100 mark, a level not reached since April 2022. Additionally, Bonk has experienced an extraordinary surge reaching a trading value of $0.00001896. Given these developments and the social buzz within the blockchain and its mobile device, the Solana Mobile team confirmed that their limited inventory of 20,000 devices worldwide has sold out, with both the US and EU markets experiencing high demand. Related Reading: Social Frenzy: Stacks (STX) Hits 8-Month High, But It Unveiled An Intriguing Twist According to a recent statement on X (formerly Twitter), in the process of fulfilling orders, the Solana Mobile team encountered an “inventory management issue” with their third-party distributor. This issue resulted in an inaccurate representation of the available inventory. Consequently, the team was unable to fulfill orders placed after the inventory was depleted. Additionally, orders suspected of suspicious activity, such as excessive device orders or payment risks, were flagged and subsequently canceled.  According to the announcement, the objective behind these measures is to ensure that as many users as possible can enjoy the Solana Saga mobile device. Customers affected by the order cancellations have been promptly notified, and they will receive refunds within the coming days.  Solana&#8217;s DEX Volume Overtakes Ethereum And Arbitrum The Solana ecosystem, together with its native token SOL, has recently achieved significant milestones. Notably, Solana&#8217;s 24-hour decentralized exchange (DEX) volume has exceeded that of Ethereum (ETH) and Arbitrum (ARB) combined, surpassing the $2 billion mark.  Additionally, Solana has emerged as the third-largest altcoin (only behind BNB) by market capitalization. These achievements reflect the growing popularity and success of Solana within the cryptocurrency market. According to Token Terminal data, SOL&#8217;s market cap (circulating) stands at $41.05 billion, reflecting a remarkable increase of 46.98%, flipping XRP’s market cap by over $7 billion.   Related Reading: Here Are The Hottest Altcoins To Buy As The Bull Market Returns – Santiment The revenue generated has also witnessed substantial growth, with an 80.43% increase to $2.39 million. Furthermore, SOL&#8217;s fully diluted market cap has reached $54.31 billion, showcasing a significant rise of 45.60%. The revenue generated on the Solana platform, when annualized, amounts to an impressive $29.13 million, signifying a substantial increase of 94.75%.  Examining SOL&#8217;s financial ratios, the price-to-fully diluted ratio stands at 796.78x, indicating the market&#8217;s high expectations for future growth. However, this ratio has experienced a recent decrease of 19.3%.  Featured image from Shutterstock, chart from TradingView.com"
  }
]