[
  {
    "source": "Decrypt",
    "date": "2024-02-02T01:01:02.000Z",
    "title": "From NFT Punchline to $8 Million Raise, ‘Pixelmon’ Preps for MON Token Launch",
    "url": "https://decrypt.co/215348/from-nft-punchline-8-million-raise-pixelmon-preps-mon-token-launch",
    "description": "Kevin lives! Under new ownership and with fresh funding, Pixelmon is ready to roll out games and debut its MON-powered IP protocol."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-02T00:48:03.000Z",
    "title": "OPNX, the Crypto Exchange From the Founders of Bankrupt Three Arrows Capital, Is Shutting Down",
    "url": "https://decrypt.co/215346/opnx-the-crypto-exchange-from-bankrupt-three-arrows-capital-is-shutting-down",
    "description": "Pitched as a \"home for those harmed by crypto crises,\" the Open Exchange prepares to meet its own demise."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-02T01:00:00.000Z",
    "title": "Solana’s (SOL) Market Dominance Challenged by Rising Rival Token, Priced Just at $0.01",
    "url": "https://www.cryptopolitan.com/solanas-sol-market-dominance-challenged-by-rising-rival-token-priced-just-at-0-01/",
    "description": "Solana (SOL) has cemented itself as one of the leading layer 1 blockchain platforms, commanding remarkable adoption and surging valuation. However, an emerging rival priced at just $0.01 threatens to disrupt Solana’s market stronghold &#8211; Pandoshi (PAMBO). The Meteoric Emergence of Pandoshi Inspired by Satoshi Nakamoto&#8217;s founding philosophy, Pandoshi has rapidly built formidable momentum. Championing [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-02T01:00:20.000Z",
    "title": "BitMEX Co-Founder Backs Solana Amidst Fears of Another US Bank Collapse",
    "url": "https://www.newsbtc.com/news/solana/bitmex-co-founder-solana-us-bank-collapse/",
    "description": "In a post on X, Arthur Hayes, the co-founder of the derivatives crypto exchange BitMEX, said it might be time for traders to double down on Solana (SOL) and altcoins in general. Hayes&#8217;s comments come at a time of heightened volatility in the broader crypto market, with Bitcoin (BTC) struggling to regain its footing and altcoins, including Ethereum (ETH), posting mixed results. Time To Switch To Solana? The co-founder noted that it could be time to get back on the Solana &#8220;train.&#8221; With this preview, Hayes is convinced that Solana and other altcoins could outperform Bitcoin in the days ahead. The outlook could be anchored on the possibility of altcoins and Bitcoin rising in the coming sessions. Specifically, Hayes warns that a &#8220;few&#8221; major banks in the United States could &#8220;bite the dust.&#8221;  Related Reading: Tron Price Prediction: TRX Looks Set For A Bullish Streak To $0.12 This comment also comes at a critical position in the United States banking landscape. On January 31, market analysts noted that NY Community Bancorp&#8217;s stock price plummeted 45% following a surprise quarterly loss and dividend reduction.  NY Community Bancorp is crucial in the United States regional banking sector. It also acquired assets from Signature Bank when it collapsed in March 2023.  Analysts say the bank&#8217;s decision to expand harmed its balance sheet. The acquisition of Signature Bank increased its regulatory capital requirements, impacting its dividends and provisions, as seen in its latest earnings report. A Bank Crisis Is A Boon For Bitcoin, Altcoins While Hayes&#8217; comments are likely to fuel further speculation about the potential for another banking crisis in the United States, it is not immediately clear whether this might spark a crypto rally.  Related Reading: Celsius Follows FTX As It Begins Repaying Crypto To Creditors, Here’s How Much However, reading from past events, if indeed a major bank in the United States collapses and files for bankruptcy in the next few days, Bitcoin will likely rally. In March 2023, following the collapse of Signature Bank, among others, Bitcoin initiated a crypto rally that saw Ethereum and Solana record gains. Considering the significant shift in Solana investor sentiment over the past few months, it is likely that SOL might snap back to trend. In that case, the altcoin might break above $125, extending 2023 gains.  When writing, SOL is pinned below $100 and under pressure. The local resistance is at $105. A break out might lift the coin towards $125 in a buy trend continuation pattern. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-02T01:00:33.000Z",
    "title": "Sui, Celestia and One More Crypto Asset To Pump Harder Than Older Generations of Altcoins: Jason Pizzino",
    "url": "https://dailyhodl.com/2024/02/01/sui-celestia-and-one-more-crypto-asset-to-pump-harder-than-older-generations-of-altcoins-jason-pizzino/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/sui-pump-harder.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/sui-pump-harder.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/01/sui-pump-harder.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/01/sui-pump-harder.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/01/sui-pump-harder.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/sui-pump-harder.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/01/sui-pump-harder.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular crypto trader is outlining three altcoins he thinks could surge higher in price than &#8220;older generation&#8221; digital assets during the ongoing market cycle. In a new YouTube video, Jason Pizzino tells his 309,000 subscribers that a good guideline for betting on altcoins is to avoid sinking money into projects from previous cycles. &#8220;When [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/01/sui-celestia-and-one-more-crypto-asset-to-pump-harder-than-older-generations-of-altcoins-jason-pizzino/\">Sui, Celestia and One More Crypto Asset To Pump Harder Than Older Generations of Altcoins: Jason Pizzino</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]