[
  {
    "source": "CryptoSlate",
    "date": "2023-07-21T20:00:01.000Z",
    "title": "French central bank believes distributed ledger technology will enhance financial stability",
    "url": "https://cryptoslate.com/french-central-bank-believes-distributed-ledger-technology-will-enhance-financial-stability/",
    "description": "<p>The French central bank believes distributed ledger technology (DLT) will enhance financial stability due to its transparent nature. Banque de France said in a report on July 21 that DLT has the &#8220;potential to enhance the efficiency and effectiveness of the monetary and financial system.&#8221; The watchdog also believes it can make central bank digital [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/french-central-bank-believes-distributed-ledger-technology-will-enhance-financial-stability/\">French central bank believes distributed ledger technology will enhance financial stability</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-21T20:00:00.000Z",
    "title": "Vitalik Reveals Ethereum Upgrade On Account Abstraction",
    "url": "https://cryptodaily.co.uk/2023/07/vitalik-reveals-ethereum-upgrade-on-account-abstraction",
    "description": "<p class=\"md-end-block md-p\">Amid a rebounding In the midst of a rebounding crypto market, Ethereum's co-founder, Vitalik Buterin, has hinted at a forthcoming upgrade to the Ethereum network, which could potentially reduce costs by a factor of 100.</p>\n<p class=\"md-end-block md-p\">During his presentation at the Ethereum Community Conference (EthCC) in Paris, Buterin unveiled plans for introducing account abstraction to Ethereum. He described the proposed upgrade as \"super elegant\" due to its implementation not necessitating modifications to Ethereum's underlying protocol, unlike prior upgrades.</p>\n<p class=\"md-end-block md-p\">Smart Contracts, Smarter Protocols</p>\n<p class=\"md-end-block md-p md-focus\">Account abstraction envisages transitioning externally owned wallets to smart contract-based wallets, enhancing users' control over their private key seed phrase, akin to resetting an email password. This could also translate into lower transaction fees through \"signless transactions.\"</p>\n<p class=\"md-end-block md-p\">Buterin elaborated on the potential benefits:</p>\n\n<p class=\"md-end-block md-p\">\"The idea here is if there are these techniques that allow you to take mold many signatures from any transactions, combine them into one object which is much smaller and which can be much more quickly verified than verifying all of the account abstraction transactions individually and by doing so you can save data [and] computation becomes 100 times cheaper.\"</p>\n\n<p class=\"md-end-block md-p\">The smart contract wallet upgrade would further enable Ethereum users to receive various cryptocurrencies and pay network fees without conversion to Ethereum.</p>\n<p class=\"md-end-block md-p\">However, the announcement comes with an acknowledgment of the challenges that lie ahead. Account abstraction, expected to attract a billion users to Ethereum, is not without its hurdles.</p>\n<p class=\"md-end-block md-p\">In his discussion, Buterin acknowledged that upgrading existing Ethereum externally-owned accounts into smart contracts and ensuring the protocol works similarly in layer-2 solutions would be significant challenges. Additional difficulties include integrating with existing technologies such as biometrics and wallets.</p>\n<p class=\"md-end-block md-p\">Despite these hurdles, Buterin expressed enthusiasm for the project's progress. The introduction of account abstraction could revolutionize the Ethereum experience, allowing users and decentralized applications (DApps) to sponsor transactions more efficiently. It could also enable more economical data use and faster verification times.</p>\n<p class=\"md-end-block md-p\">The news comes at a time when the crypto market, including Bitcoin and Ripple's XRP, is experiencing a resurgence, highlighting the dynamic and ever-evolving nature of this space.</p>\nAccount Abstraction And The Future of Ethereum\n<p class=\"md-end-block md-p\">While the implementation of account abstraction is heralded as a technical breakthrough, the intricate process of this upgrade warrants careful exploration. On a practical level, account abstraction means the transformation of externally owned wallets to those driven by smart contracts. This transition could simplify the recovery of private key seed phrases, lower transaction fees, and even enable Ethereum users to accept multiple types of cryptocurrencies without the necessity for conversions. This means that it could become 100 times cheaper in terms of data savings and computational costs.</p>\n\n<p class=\"md-end-block md-p\"> &ldquo;This is actually especially a big deal on rollups because in a rollup a big or on because a big part of the size of a transaction is the signature on a rollup,\" Buterin said.</p>\n\n<p class=\"md-end-block md-p\">Despite this, however, as Buterin notes quite sharply, navigating this transition won't go forth without its requisite challenges. Key upgrades to the Ethereum ecosystem, such as transitioning existing externally-owned accounts into smart contracts, and ensuring the protocol's compatibility with layer-2 solutions are hurdles that must be surmounted. The integration of this new system with existing technoliogies, like biometrics and present-day wallets, presents further complexities.</p>\n<p class=\"md-end-block md-p\">Yet, the air of optimism surrounding account abstraction is tangible. Buterin's enthusiasm signals that despite the challenges, the potential rewards could be transformative, propelling Ethereum to new heights of user accessibility and network efficiency. As Ethereum prepares for this innovative leap, the industry watches in anticipation, ready for the potential advent of an even more dynamic era in the Ethereum saga.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T20:06:55.000Z",
    "title": "American couple reach plea deal in Bitfinex case",
    "url": "https://www.cryptopolitan.com/american-couple-plea-deal-in-bitfinex-case/",
    "description": "Heather Morgan and Ilya Lichtenstein, the American duo implicated in the colossal laundering of cryptocurrency plundered from the 2016 Bitfinex hack, have entered into a plea deal. The terms of the agreement have not yet been made public, but both parties are scheduled for a plea hearing on August 3 before Senior Judge Colleen Kollar-Kotelly, ... <a title=\"American couple reach plea deal in Bitfinex case\" class=\"read-more\" href=\"https://www.cryptopolitan.com/american-couple-plea-deal-in-bitfinex-case/\" aria-label=\"More on American couple reach plea deal in Bitfinex case\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T20:01:11.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T19:49:06.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and the platform they need to build blockchain solutions. At this time, we can only make educated guesses ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-21T20:03:35.000Z",
    "title": "Bitfinex Hackers Surrender: Couple Agrees to Forfeit 120,000 Bitcoin in Plea Deal",
    "url": "https://www.newsbtc.com/bitcoin-news/bitfinex-hackers-surrender-couple-agrees-to-forfeit-120000-bitcoin-in-plea-deal/",
    "description": "An American couple accused of laundering billions of dollars worth of Bitcoin stolen from the 2016 hacking of virtual currency exchange Bitfinex has entered into a plea agreement, according to court records reported by Reuters.  Heather Morgan, who used the hip-hop alias &#8220;Razzlekhan&#8221; to push her music online, and her husband Ilya Lichtenstein were arrested earlier this year and are set to appear for a plea hearing on August 3 before Senior Judge Colleen Kollar-Kotelly in Washington. Laundered Bitcoin Exceeds $4.5 Billion Ilya Lichtenstein and Heather Morgan, both residents of New York, are facing charges for allegedly conspiring to launder the proceeds of 119,754 Bitcoin (BTC) that were stolen from Bitfinex in 2016.  After the hacker breached the platform&#8217;s systems and initiated over 2,000 unauthorized transactions, the stolen Bitcoin was transferred to a digital wallet controlled by Lichtenstein.  Over five years, approximately 25,000 of those stolen Bitcoin were moved out of Lichtenstein&#8217;s wallet via a complex money-laundering process, which ultimately resulted in some of the stolen funds being deposited into financial accounts controlled by the couple. Related Reading: Riding The Ripple Effect: What’s Next For Stellar Lumens (XLM)? More than 94,000 Bitcoin, the remainder of the stolen funds, were left in the wallet used to receive and store the illegal proceeds from the hack.  However, after executing court-authorized search warrants for online accounts controlled by Lichtenstein and Morgan, special agents accessed files in an online account controlled by Lichtenstein.  These files contained the private keys required to access the digital wallet that directly received the funds stolen from Bitfinex, enabling law enforcement to lawfully seize and recover over 94,000 Bitcoin, valued at over $3.6 billion at the time of seizure. According to the criminal complaint, Lichtenstein and Morgan used various sophisticated laundering techniques, including setting up online accounts using fictitious identities, automating transactions using computer programs, depositing the stolen funds into accounts at virtual currency exchanges and darknet markets, converting Bitcoin to other forms of virtual currency, and using U.S.-based business accounts to legitimize their banking activity. Related Reading: Ethereum Daily Users Plunge Amid Declining Network Revenue While Bitcoin was worth $71 million at the time of the hack, it had appreciated to over $4.5 billion at the time of their arrest earlier this year. Prosecutors are now seeking to have the pair forfeit assets worth around $3 billion, including cash from bank accounts and tokens from crypto wallets. Additionally, prosecutors are seeking to have the couple forfeit gold coins that were &#8220;excavated and recovered by law enforcement&#8221; from an undisclosed location in California.  At present, Bitcoin remains the largest cryptocurrency in the market, based on trading volume and capitalization. It is currently trading at $29,860, which is relatively stable compared to the previous 24 hours, with a slight increase of 0.5%. Featured image from Unsplash, chart from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-21T20:00:48.000Z",
    "title": "South Park’s Kenny Powers Up: Meme Coin Raises Over $400,000 In Market Cap On Presale",
    "url": "https://www.newsbtc.com/altcoin/south-parks-kenny-powers-up-meme-coin-raises-over-400000-in-presale/",
    "description": "South Park&#8217;s Kenny McCormick may be perpetually doomed, but his latest venture in the world of cryptocurrency is anything but. Burn Kenny, the new hilariously irreverent meme coin has raised over $400,000 in market cap on its presale, leaving fans excited for what&#8217;s to come.  Inspired by the beloved South Park character, Burn Kenny is a super deflationary token that&#8217;s designed to do one thing &#8211; get burnt. How Burn Kenny&#8217;s Meme Coin Token Burning Could Benefit Investors Burn Kenny&#8217;s token burning process is designed to gradually decrease the total supply of the token, creating scarcity and potentially increasing the value of the remaining tokens. The process works by gradually burning a portion of the total token supply over a set period until a predetermined percentage of the tokens have been destroyed. In Burn Kenny&#8217;s case, 30% of the total token supply will be burnt over three days, starting 24 hours after the token&#8217;s initial listing. This will be done by sending a portion of the tokens straight to the &#8220;fiery depths of token hell,&#8221; effectively removing them from circulation. The burning process will continue at a rate of 10% every 24 hours until the 30% burn target is reached. Related Reading: Ethereum Daily Users Plunge Amid Declining Network Revenue The value of the remaining tokens could potentially increase as a result of the token-burning process, as there will be fewer tokens in circulation.  This creates a situation of increased demand for the remaining tokens, which could drive up their price. With a total token supply of 6,666,666,666, an arbitrary number Burn Kenny&#8217;s tokenomics are as unique as the character himself.  The presale accounts for 40% of the total token supply, while another 30% will be thrown into the Uniswap liquidity pool, locked for three months. The remaining 30% will be sent straight to the fiery depths of token hell, gradually burnt over three days, starting 24 hours after listing. By the end of Q3 2023, the team behind Burn Kenny aims to have fulfilled all their roadmap goals.  In recent updates, they have announced that they have deployed the contract, paired and locked Liquidity Pool (LP), and updated DexTools with hot pairs ready for trading. These preparations are all essential steps in ensuring a smooth and successful launch for Burn Kenny. Deploying the contract and pairing and locking LP are key technical components of the launch process. The contract deployment involves setting up the smart contract that will govern the token and ensure its functionality.  In addition to these technical preparations, the Burn Kenny team has also been working to build hype and generate excitement for the launch. They have noted that Ethereum is trending and that DexTools is ready for hot pairs, which could help to drive interest and increase demand for the token. Related Reading: New Crypto Bill Demands SEC And CFTC To Draft Rules For Trading Platforms Burn Kenny&#8217;s irreverent approach to cryptocurrency and its use of the South Park character Kenny McCormick as its mascot give it a distinct personality and make it stand out from other meme coins. Of course, like any meme coin, Burn Kenny&#8217;s success will ultimately depend on the strength of its community and the demand for its tokens. However, its unique concept and approach to the meme coin genre could potentially make it a standout project in the crowded world of cryptocurrency. Featured image from Burn Kenny on Twitter, chart from TradingView.com "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T19:55:14.000Z",
    "title": "Bitcoin Fear and Greed Index Turns Neutral: Is $25,000 or $35,000 Next for BTC Price? Report",
    "url": "https://www.crypto-news-flash.com/bitcoin-fear-and-greed-index-turns-neutral-is-25000-or-35000-next-for-btc-price-report/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-fear-and-greed-index-turns-neutral-is-25000-or-35000-next-for-btc-price-report",
    "description": "<img width=\"1280\" height=\"799\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-300x187.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-1024x639.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-768x479.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/bitcoin-g230209c37_1280-163x102.png 163w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />The rising dollar and jitters in the tech space led to some downward pressure in the crypto space on Thursday, July 20. Most altcoins head lower but Chainlink (LINK) proves to be an exception with 20% gains on Thursday amid strong accumulation. The world&#8217;s largest cryptocurrency Bitcoin (BTC) continues to face some selling pressure and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T19:43:00.000Z",
    "title": "Flare Sets its Eyes on the Land of the Rising Sun",
    "url": "https://www.crypto-news-flash.com/flare-sets-its-eyes-on-the-land-of-the-rising-sun/?utm_source=rss&utm_medium=rss&utm_campaign=flare-sets-its-eyes-on-the-land-of-the-rising-sun",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/FLARE.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/FLARE.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/FLARE-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Flare holds a conference with developers in Tokyo The event is on the margins of the WebX Tokyo Conference. The company’s CEO will grace the event Flare, a famous blockchain for data sites, has announced that it will hold a builder event in the Japanese capital of Tokyo. Slated for Wednesday, 26th of July 2023, [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-21T20:00:31.000Z",
    "title": "Central Bank Chief Accused of $300,000,000 Embezzlement, Money Laundering and Tax Evasion Scheme Has Luxury Property Seized: Report",
    "url": "https://dailyhodl.com/2023/07/21/central-bank-chief-accused-of-300000000-embezzlement-money-laundering-and-tax-evasion-scheme-has-luxury-property-seized-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/banker-charges-cash.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/banker-charges-cash.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/banker-charges-cash.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/banker-charges-cash.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/banker-charges-cash.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/banker-charges-cash.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/banker-charges-cash.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A judge in Lebanon has reportedly seized several luxurious properties from a central banker accused of embezzlement, money laundering and tax evasion. The courts will control central bank governor Riad Salameh&#8217;s properties while he faces judicial probes on the source of his wealth, reports the AFP. The news agency cites an anonymous official in the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/21/central-bank-chief-accused-of-300000000-embezzlement-money-laundering-and-tax-evasion-scheme-has-luxury-property-seized-report/\">Central Bank Chief Accused of $300,000,000 Embezzlement, Money Laundering and Tax Evasion Scheme Has Luxury Property Seized: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-21T19:55:32.000Z",
    "title": "Middle Eastern Country of 4,000,000 Officially Bans Crypto Investments, Payments and Mining",
    "url": "https://dailyhodl.com/2023/07/21/middle-eastern-country-of-4000000-officially-bans-crypto-investments-payments-and-mining/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/middle-eastern-country-bans.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/middle-eastern-country-bans.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/middle-eastern-country-bans.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/middle-eastern-country-bans.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/middle-eastern-country-bans.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/middle-eastern-country-bans.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/middle-eastern-country-bans.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The financial regulator of a petroleum-reliant economy in the Middle East just issued a new circular to clamp down on crypto activities in the country. The circular, which was issued by Kuwait’s Capital Markets Authority on Monday, bans the use of crypto assets as a payment method and as a form of investment. The issuance [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/21/middle-eastern-country-of-4000000-officially-bans-crypto-investments-payments-and-mining/\">Middle Eastern Country of 4,000,000 Officially Bans Crypto Investments, Payments and Mining</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-21T19:55:14.000Z",
    "title": "With Bitcoin Stumbling, Crypto Trader Updates ‘Plan’ As He Imagines Multiple Scenarios for BTC",
    "url": "https://dailyhodl.com/2023/07/21/with-bitcoin-stumbling-crypto-trader-updates-plan-as-he-imagines-multiple-scenarios-for-btc/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/06/btc-global.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/06/btc-global.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/06/btc-global.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/06/btc-global.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/06/btc-global.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/06/btc-global.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/06/btc-global.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is imagining several different scenarios for Bitcoin (BTC) after the king crypto fell 4.5% in a week. Crypto trader Michaël van de Poppe tells his 660,800 Twitter followers that BTC is likely looking to go lower before rallying. &#8220;Probably tons of volatility and still very likely that we&#8217;re looking at a case [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/21/with-bitcoin-stumbling-crypto-trader-updates-plan-as-he-imagines-multiple-scenarios-for-btc/\">With Bitcoin Stumbling, Crypto Trader Updates ‘Plan’ As He Imagines Multiple Scenarios for BTC</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]