[
  {
    "source": "Decrypt",
    "date": "2024-03-12T20:24:05.000Z",
    "title": "CoinShares Snaps Up Valkyrie Funds—Along With Its Bitcoin ETF",
    "url": "https://decrypt.co/221434/coinshares-acquires-valkyrie-bitcoin-etf",
    "description": "The move firmly plants the European fund manager in the American market. "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-12T20:10:35.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Major financial institutions have completed a large-scale pilot test on the Canton Network blockchain. Two Binance executives are reportedly being held by authorities in Nigeria who blame the exchange for causing a devaluation in the country’s fiat currency, the Nigerian naira. Meanwhile, a Bloomberg ETF analyst has revised his odds for a spot Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) ETF approval by May, citing radio silence from the SEC toward prospective issuers. </p><p>Traditional finance’s embrace of blockchain technology appears to be warming, as 155 participants from 45 major organizations participated in <a href=\"https://cointelegraph.com/news/global-banks-participate-large-scale-blockchain-pilot-test\">a pilot program</a> on the Canton Network. Some of the participants included Cboe Global Markets, Goldman Sachs and BNY Mellon.</p><p>As Bloomberg reported, institutional investors participated in more than 350 simulated transactions on the Canton blockchain in areas such as tokenized assets, fund registry, digital cash, securities lending and margin management. Canton is an interoperable blockchain launched by Digital Asset Holdings in May 2023. </p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-12T20:29:45.000Z",
    "title": "Bitcoin Hits New Heights: Navigating the ‘Euphoria Zone’ with Glassnode’s Insights",
    "url": "https://www.cryptoglobe.com/latest/2024/03/bitcoin-hits-new-heights-navigating-the-euphoria-zone-with-glassnodes-insights/",
    "description": "In the latest edition of “The Week Onchain Newsletter,” Glassnode’s lead on-chain analyst, known as “Checkmate,” brings to light Bitcoin’s exhilarating journey to new all-time highs, surpassing $72,300 for the first time. This event, as highlighted by Glassnode, isn’t merely about surpassing price levels; it represents a shift into what’s termed the “Euphoria Zone.” This […]\n"
  },
  {
    "source": "NullTX",
    "date": "2024-03-12T20:38:33.000Z",
    "title": "Space ID Token ($ID) Surges Amidst Active Wallet Movements",
    "url": "https://nulltx.com/space-id-token-id-surges-amidst-active-wallet-movements/",
    "description": "The governance token of the Space ID ecosystem, $ID, has experienced a remarkable surge in value, with gains exceeding 110% over the past week and an additional 34% increase today. Recent on-chain reports shed light on the notable activity surrounding Team-linked wallets and Upbit, a prominent cryptocurrency exchange, coinciding with [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-12T20:34:58.000Z",
    "title": "Cryptocurrency Phishing Scams Leave Victims With Millions In Losses, $100 million Already Lost In 2024",
    "url": "https://nulltx.com/cryptocurrency-phishing-scams-leave-victims-with-millions-in-losses-100-million-already-lost-in-2024/",
    "description": "The scourge of cryptocurrency phishing scams continues to wreak havoc, with nearly 57,000 individuals falling victim to these fraudulent schemes in February alone.  🚨 [1/6] ScamSniffer&#39;s February Phishing ReportIn February, about 57,000 victims lost approximately $47 million to crypto phishing scams.Compared to January, the number of victims who lost over [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-12T20:25:21.000Z",
    "title": "Bitcoin Hits New All-Time High, Addresses Enjoy Profits",
    "url": "https://nulltx.com/bitcoin-hits-new-all-time-high-addresses-enjoy-profits/",
    "description": "Bitcoin surged past the $72,000 mark today, achieving a new all-time high (ATH) and bringing joy to investors as 100% of Bitcoin addresses reportedly found themselves in profitable territory. Ahead of this impressive rally, a newly established wallet, 3Khjn, made significant withdrawals from Binance, totaling 598.8 BTC, valued at $41.5 [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-12T20:21:08.000Z",
    "title": "Bitrue Drainer Sells Stolen Assets",
    "url": "https://nulltx.com/bitrue-drainer-sells-stolen-assets/",
    "description": "Reports have surfaced regarding the Bitrue Drainer, who allegedly pilfered $23.5 million worth of assets on April 14, 2023, making another significant sale in the past 24 hours. This time, the individual unloaded 4,207 ETH for 16.34 million DAI at a price of $3,885 per ETH. The stolen assets from [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-12T20:32:56.000Z",
    "title": "Crypto market update: Solana, Milei Moneda, and Terra Classic trends",
    "url": "https://crypto.news/crypto-market-update-solana-milei-moneda-and-terra-classic-trends/",
    "description": "Crypto market update: Solana's growth, Milei Moneda's presale success, and Terra Classic's recovery. #partnercontent"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-12T20:21:09.000Z",
    "title": "Ethereum’s Dencun upgrade vital to network’s future",
    "url": "https://crypto.news/ethereums-dencun-upgrade-future/",
    "description": "Tenderly’s co-founder and SVP, Nebojsa Urosevic, said Ethereum must adapt to skyrocketing transaction volumes without charging users a fortune as global adoption accelerates."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-12T20:09:50.000Z",
    "title": "Capital flows to Borroe Finance after gains in Shiba Inu and Floki",
    "url": "https://crypto.news/capital-flows-to-borroe-finance-after-gains-in-shiba-inu-and-floki/",
    "description": "Meme coins like Shiba Inu and Floki Inu saw significant returns, sparking interest in AI token Borroe Finance. #partnercontent"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-12T20:09:37.000Z",
    "title": "Bitcoin Fog founder convicted in $400m crypto laundering case",
    "url": "https://crypto.news/bitcoin-fog-founder-convicted-crypto-laundering/",
    "description": "The founder of crypto mixing service Bitcoin Fog has been found guilty by a federal court of laundering money linked to illicit drug sales on the dark web."
  }
]