[
  {
    "source": "Cointelegraph",
    "date": "2023-07-06T10:00:00.000Z",
    "title": "Execs remain positive on long-term prospects amid VC funding downturn",
    "url": "https://cointelegraph.com/news/execs-remain-positive-on-long-term-prospects-amid-vc-funding-downturn",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/9635ce9c-fd3d-4328-b88d-7d4e9d2f42e5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Outlier Ventures exec Gvantsa Chkuaseli said there are reasons to stay optimistic, and challenging conditions haven't stamped out interest. </p>\n                    <p><p>As crypto prices continue to remain at lower levels, venture capital funding also recorded one of its lowest quarters since 2021. Despite this, executives working in the space remain positive about the industry’s long-term potential. </p><p>Crypto data platform Rootdata <a href=\"https://www.rootdata.com/dashboard\" target=\"_blank\" rel=\"noopener nofollow\">highlighted</a> that the second quarter of 2023 showed one of the lowest performances in terms of crypto fundraising. Compared to the first quarter of 2022 where $12.62 billion were raised across 559 funding rounds, Q1 2023 just saw around $2.1 billion across 292 rounds. This shows an 83% decrease in VC investments flowing into the space. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/c290cf24-f5e0-410a-b137-e31c0e60f982.png\"  /><figcaption style=\"text-align: center;\"><em>Quarterly crypto fundraising trend data chart. Source: Rootdata</em></figcaption></figure><p>Despite the flow of venture capital funds slowing down, professionals working in the space believe  there’s still a strong ongoing belief that crypto has potential in the long term. </p><p>Gvantsa Chkuaseli, the head of structuring and fundraising at Web3 accelerator Outlier Ventures told Cointelegraph in a statement that despite the downturn in Q4 2022, there’s also been an uptick in activity. According to Chkuaseli, this suggests that investors retain a strong belief in the long-term potential of blockchain. </p><p>“We can see with our own portfolio, such as Mawari’s recent $6.5 million seed round co-led by Blockchange Ventures and Decasonic and Zinc’s $5 million Series A, that there is interest despite the challenging conditions,” Chkuaseli explained. </p><p>Chkuaseli also added that some investors appear undeterred by the recent downturn and continued to back early-stage companies within the sector. “We still believe though there are reasons to be optimistic,” Chkuaseli said. The executive also noted that there’s been huge interest in startups that are focused on artificial intelligence, pointing out that fetch.ai from their portfolio <a href=\"https://fetch.ai/content-hub/article/dwf-labs-invest-in-fetch-ai\" target=\"_blank\" rel=\"noopener nofollow\">received</a> $40 million in funding from DWF Labs earlier this year. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">JUST IN: AI-focused <a href=\"https://twitter.com/hashtag/crypto?src=hash&amp;ref_src=twsrc%5Etfw\">#crypto</a> protocol <a href=\"https://twitter.com/Fetch_ai?ref_src=twsrc%5Etfw\">@Fetch_ai</a> has raised $40 million in new funding from <a href=\"https://twitter.com/DwfLabs?ref_src=twsrc%5Etfw\">@DwfLabs</a>.<a href=\"https://twitter.com/search?q=%24FET&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$FET</a> rose 13.9% to $0.388 following the news.<br><br>: <a href=\"https://t.co/eeHLD0FOGa\">https://t.co/eeHLD0FOGa</a> <a href=\"https://t.co/czlV9oNrZb\">pic.twitter.com/czlV9oNrZb</a></p>&mdash; CoinGecko (@coingecko) <a href=\"https://twitter.com/coingecko/status/1641098117004267522?ref_src=twsrc%5Etfw\">March 29, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Saqr Ereiqat, the co-founder of Dubai-based venture-building firm Crypto Oasis, believes that despite the negatives brought about by the downturn, there are still positive takeaways from the current situation. Ereiqat explained: </p><blockquote>“On the positive side, this shift allows for a more discerning selection process, ensuring that only the most promising projects receive funding. Moreover, the challenging times serve to crystallize the winners, separating the truly innovative ventures from the rest.”</blockquote><p>Even though there are positive outlooks, the executive still expressed empathy toward projects that are struggling because of the lack of funding. “It's disheartening to witness numerous companies facing the risk of extinction due to the scarcity of funding opportunities,” he said. Ereiqat also told Cointelegraph that this situation also emphasizes the importance of strategic decision-making for projects. </p><p>Similar to Chkuaseli, Ereiqat also highlighted how AI-focused projects are still seeing massive amounts of investments. Citing the $1.3 billion funding round for Inflection AI, the executive said that there’s a growing opportunity within the AI startup landscape. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-vc-is-struggling-only-from-a-north-american-perspective-animoca-brands-ceo\"><strong><em>Crypto VC is struggling only from a North American perspective — Animoca Brands CEO</em></strong></a></p><p>Meanwhile, Phillip Lord, the president of the crypto payments platform Oobit, believes that it's necessary for entrepreneurs to focus on building companies with sustainable business models and clear revenue streams. According to Lord, this help VCs be compelled to invest in their projects. He said: </p><blockquote>“We are currently in a higher interest rate cycle, and rates are expected to remain high for the next 3-5 years. As such, businesses should avoid the ‘growth at any cost’ model and instead focus on building strong and sustainable operations that will stand the test of time.\"</blockquote><p>Lord also highlighted that the VC model is experiencing a change because of AI. “Burn rates of companies can drastically come down if AI is fully embraced,” Lord said. The executive also predicted that there will be solo entrepreneurs earning more than $25 million annually “with literally no staff” because of AI. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-is-ai-a-threat-why-ai-advance/\"><strong><em>AI Eye: Is AI a nuke-level threat? Why AI fields all advance at once, dumb pic puns</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-06T09:47:11.000Z",
    "title": "OKX to Launch Signal Trading Platform, Empowering Traders with High-Quality Signals and Seamless Execution",
    "url": "https://cryptodaily.co.uk/2023/07/okx-to-launch-signal-trading-platform-empowering-traders-with-high-quality-signals-and-seamless-execution",
    "description": "<p>Dubai, UAE, July 6th, 2023, Chainwire</p><ul><li>OKX's Signal Trading is a trading bot and marketplace that bridges the gap between signal providers and traders</li><li>Signal Trading will be integrated with TradingView, enabling signal providers and traders to create signals directly on the leading charting platform</li><li>A pre-launch waitlist is available now for signal providers and institutions</li></ul><p>OKX, the world's second-largest crypto exchange by trading volume and a leading Web3 technology company, has announced the upcoming launch of Signal Trading, a marketplace where users can access automated trading strategies based on technical analysis, or 'signals,' which indicate whether to buy or sell crypto.</p><p>The marketplace, set to launch in August-September 2023, will allow users to choose from a range of signal providers, including institutions and pro traders. Interested users and signal providers can sign up to the waitlist to be the first to receive updates and access.</p><p>Signal Trading will be integrated with TradingView, enabling signal providers and traders to create signals directly on the charting platform, as well as specify the desired action, instrument and other parameters associated with that particular trading signal. With Signal Trading, users can access, follow and copy signals without manual execution, saving time and effort.</p><p>Advantages for signal providers include:</p><ul><li>Expansion opportunities by listing signals on OKX's Signal Trading, giving them access to a marketplace of over 50 million traders</li><li>Integrated with TradingView, a leading platform for generating signals</li><li>In many cases, a significant reduction in latency and costs typically associated with listing signals on third-party platforms</li></ul><p>Advantages for signal traders include:</p><ul><li>Avoidance of subscription fees associated with third-party platforms</li><li>In many cases, a significant reduction in latency issues that are prevalent on third-party platforms</li><li>Trust and reliability of using one of the world's leading crypto exchanges</li><li>A wide variety of signal providers to choose from and compare</li></ul><p>OKX Global Chief Commercial Officer Lennix Lai said: \"OKX Signal Trading will further improve users' trading experience on OKX by providing access to a diverse range of high-quality signals from top providers, reducing manual entry errors and unlocking a world of trading opportunities for traders. With advanced algorithms, real-time market data and a diverse range of signal providers available, Signal Trading will be the ultimate solution for those seeking to elevate their trading game and connect with a global community of traders.\"</p><p>About OKX</p><p>OKX is the second-largest global crypto exchange by trading volume and a leading Web3 ecosystem. Trusted by more than 50 million global users, OKX is known for being the fastest and most reliable crypto trading app for traders everywhere.</p><p>As a top partner of English Premier League champions Manchester City FC, McLaren Formula 1, Olympian Scotty James and F1 driver Daniel Ricciardo, OKX aims to supercharge the fan experience with new engagement opportunities. OKX is also the top partner of the Tribeca Festival as part of an initiative to bring more creators into web3.</p><p>Beyond OKX&rsquo;s exchange, the OKX Wallet is the platform's latest offering for people looking to explore the world of NFTs and the metaverse while trading GameFi and DeFi tokens.</p><p>OKX is committed to transparency and security and publishes its Proof of Reserves on a monthly basis.</p><p>To learn more about OKX, download our app or visit: okx.com</p><p>Disclaimer</p><p>This announcement is provided for informational purposes only. It is not intended to provide any investment, tax, or legal advice, nor should it be considered an offer to purchase, sell, hold or offer any services relating to digital assets. Digital assets, including stablecoins, involve a high degree of risk, can fluctuate greatly, and can even become worthless. You should carefully consider whether trading or holding digital assets is suitable for you in light of your financial condition and risk tolerance. OKX does not provide investment or asset recommendations. You are solely responsible for your investment decisions, and OKX is not responsible for any potential losses. Past performance is not indicative of future results. Please consult your legal/tax/investment professional for questions about your specific circumstances.</p>ContactPressMedia@okx.com"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T10:05:49.000Z",
    "title": "ISO 20022 Crypto: List of Compliant Coins in 2023",
    "url": "https://www.cryptopolitan.com/iso-20022-compliant-crypto-list/",
    "description": "The ISO 20022 crypto-list is a collection of compliant digital coins and tokens that satisfy the standards of the International Organization for Standardization (ISO) standards 20022.&#160;There are many cryptocurrencies that will be integrated into this&#160;new financial system, referred to as&#160;ISO 20022-compliant cryptocurrencies&#160;and there is much speculation these cryptocurrencies will soar in price once the standard ... <a title=\"ISO 20022 Crypto: List of Compliant Coins in 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/iso-20022-compliant-crypto-list/\" aria-label=\"More on ISO 20022 Crypto: List of Compliant Coins in 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T09:46:07.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T09:45:42.000Z",
    "title": "European Commission’s metaverse strategy faces controversial setback",
    "url": "https://www.cryptopolitan.com/european-metaverse-strategy-faces-setback/",
    "description": "The European Commission&#8217;s metaverse strategy, which was scheduled to be released next week, has been delayed. The strategy is expected to address policy concerns related to virtual worlds, such as property rights, technological standards, and privacy. While the commission has indicated that the proposal won&#8217;t be legislative, it is seen as a starting point that ... <a title=\"European Commission&#8217;s metaverse strategy faces controversial setback\" class=\"read-more\" href=\"https://www.cryptopolitan.com/european-metaverse-strategy-faces-setback/\" aria-label=\"More on European Commission&#8217;s metaverse strategy faces controversial setback\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-06T09:45:11.000Z",
    "title": "Breaking: Shiba Inu Lead Dev Reveals Shibarium Release Date, SHIB Up 3%",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-lead-dev-reveals-shibarium-release-date/",
    "description": "Breaking Shiba Inu news: The highly anticipated layer-2 solution Shibarium, along with other groundbreaking developments, is set to be unveiled at the upcoming Blockchain Futurist Conference and ETHToronto. Shiba Inu&#8217;s lead developer, Shytoshi Kusama, revealed in a new blog post today that these events will serve as platforms for showcasing Shibarium along with the finalized Worldpaper, introducing SHIB-branded projects, and shedding light on Treat. Sweet August For Shiba Inu Army Scheduled for August 15-16, 2023, ETHToronto and the Blockchain Futurist Conference will provide the perfect backdrop for Shiba Inu&#8217;s grand unveiling. ETHToronto is the official hackathon of the Blockchain Futurist Conference and a huge event for the entire Ethereum ecosystem. Related Reading: Recent 800 Billion Shiba Inu Dump Has Short Traders Worried – Here’s Why As the title sponsor, Shiba Inu solidifies its position as &#8220;a major player in the crypto space&#8221;, as emphasized by Kusama in the blog post. Remarkably, the release date aligns with SHIB&#8217;s approximate 3-year anniversary and being the birthplace of Eth. The SHIB community can expect an immersive experience, featuring presentations, demonstrations, and discussions that will reshape the future of Shiba Inu&#8217;s decentralized finance and governance. The highlight of these events will undoubtedly be the introduction of Shibarium, the highly anticipated cornerstone of Shiba Inu&#8217;s ecosystem. Shibarium aims to push the boundaries of scaling Ethereum, providing innovative solutions for the Shiba Inu community. The long-awaited L2 holds immense potential for revolutionizing the Shiba Inu ecosystem. Remarkably, the event is not only about Shibarium. As part of the events, all SHIB-branded projects will be unveiled, showcasing the project&#8217;s commitment to building a diverse and vibrant ecosystem. These projects, including Shib the Metaverse, Shibacals, Shiba Eternity, and Shiboshis, represent the multifaceted nature of Shiba Inu&#8217;s vision. As Kusama writes, there will also be new partnerships announced with Unification and Bad Idea.Ai. Furthermore, all projects that expressed interest in building with Shibarium Tech will be showcased at the conferences. Related Reading: Shiba Inu Records Surge In Daily New Addresses In Q2: A Sign Of Growing Interest? Shiba Inu&#8217;s lead developer also emphasized the significance of Treat, a pivotal component of the project&#8217;s governance framework. At the Blockchain Futurist Conference, Treat will be publicly detailed for the first time. The SHIB army can expect comprehensive insights into Treat&#8217;s functionality and its role in empowering the decentralized ecosystem. Kusama stated: At this venue [Blockchain Futurist Conference]], the finalized Worldpaper will be showcased, all Shib-branded projects will be unveiled, and Treat will be detailed publicly for the first time. Additionally, discussions and potential releases of the long-awaited L2 Shibarium are highly likely. SHIB Is Up 3% With the news, the countdown to the eagerly awaited Blockchain Futurist Conference, where Shiba Inu will take center stage, has begun, and with it, possibly, a renewed SHIB hype. At press time, SHIB was trading at $0.00000758 and has risen around 3% since the publication of Kusama&#8217;s blog post. This puts the SHIB price on the verge of a possible breakout from the downtrend channel that has been in place since early February. A significant rise above $0.000008 towards the 38.2% Fibonacci retracement level ($0.00000831) and a subsequent breakout above this resistance is needed to avoid a fakeout. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-06T10:08:02.000Z",
    "title": "Ripple’s Xumm Wallet Levels Up with SimpleSwap Integration for Lightning-Fast XRP Swaps",
    "url": "https://www.crypto-news-flash.com/ripples-xumm-wallet-levels-up-with-simpleswap-integration-for-lightning-fast-xrp-swaps/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-xumm-wallet-levels-up-with-simpleswap-integration-for-lightning-fast-xrp-swaps",
    "description": "<img width=\"800\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-48x29.jpg 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" />Xumm wallet integrates SimpleSwap making it easier for users to transition to the XRP Ledger and enhances accessibility for everyone. The recent development will make Xumm more user-friendly and accessible to a wider audience. In the latest development, developers of the Xumm wallet announced the integration of the decentralized crypto exchange SimpleSwap in the form [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-06T10:04:17.000Z",
    "title": "Cirus Invited to Attend the Web3 Investor Day Conference Sponsored by Decasonic",
    "url": "https://www.crypto-news-flash.com/cirus-invited-to-attend-the-web3-investor-day-conference-sponsored-by-decasonic/?utm_source=rss&utm_medium=rss&utm_campaign=cirus-invited-to-attend-the-web3-investor-day-conference-sponsored-by-decasonic",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Michael_Decasonic_1_1688570346FJzr0YV5Ub.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Michael_Decasonic_1_1688570346FJzr0YV5Ub.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Michael_Decasonic_1_1688570346FJzr0YV5Ub-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Michael_Decasonic_1_1688570346FJzr0YV5Ub-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Michael_Decasonic_1_1688570346FJzr0YV5Ub-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Raratonga, Cook Islands, July 6th, 2023, Chainwire Cirus, a prominent company in the Web3 industry, is pleased to be a select invitee and keynote speaker at the Web3 Investor Day Conference, an invite-only event powered by Decasonic. Decasonic is a Web3 venture and digital assets fund supporting the development of blockchain innovation. The event is [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-06T09:49:44.000Z",
    "title": "OKX to Launch Signal Trading Platform, Empowering Traders with High-Quality Signals and Seamless Execution",
    "url": "https://www.crypto-news-flash.com/okx-to-launch-signal-trading-platform-empowering-traders-with-high-quality-signals-and-seamless-execution/?utm_source=rss&utm_medium=rss&utm_campaign=okx-to-launch-signal-trading-platform-empowering-traders-with-high-quality-signals-and-seamless-execution",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/20230703-115735_1200x633_1_1200x720_1688611728ANEleS4OOr.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/20230703-115735_1200x633_1_1200x720_1688611728ANEleS4OOr.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/20230703-115735_1200x633_1_1200x720_1688611728ANEleS4OOr-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/20230703-115735_1200x633_1_1200x720_1688611728ANEleS4OOr-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/20230703-115735_1200x633_1_1200x720_1688611728ANEleS4OOr-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Dubai, UAE, July 6th, 2023, Chainwire OKX&#8217;s Signal Trading is a trading bot and marketplace that bridges the gap between signal providers and traders Signal Trading will be integrated with TradingView, enabling signal providers and traders to create signals directly on the leading charting platform A pre-launch waitlist is available now for signal providers and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-06T09:45:02.000Z",
    "title": "Crypto Trader Expects Explosive Surge for Chainlink – Price Target of $15 Revealed",
    "url": "https://www.crypto-news-flash.com/crypto-trader-expects-explosive-surge-for-chainlink-price-target-of-15-revealed/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-trader-expects-explosive-surge-for-chainlink-price-target-of-15-revealed",
    "description": "<img width=\"1038\" height=\"612\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1.png 1038w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1-300x177.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/chainlink-LINK-1-1024x604.png 1024w\" sizes=\"(max-width: 1038px) 100vw, 1038px\" />Popular cryptocurrency analyst Michaël van de Poppe makes a bullish prediction for Chainlink (LINK) and Litecoin (LTC).  The analyst remains neutral on the leading cryptocurrency Bitcoin, which he expects to at least cross the $31,000 price mark.  The cryptocurrency market has sustained a significant level of volatility over the past weeks. This has resulted in [...]"
  }
]