[
  {
    "source": "Cointelegraph",
    "date": "2024-03-08T01:53:22.000Z",
    "title": " Fed’s Powell allays digital dollar anxiety as nations ramp up CBDC efforts ",
    "url": "https://cointelegraph.com/news/federal-reserve-nowhere-near-launching-cbdc-jerome-powell",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYTk1YzU2ZTctZWVlOS00ZGUzLTllYWUtOGY5Y2JkNjc3ZjFlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Federal Reserve chair Jerome Powell says the U.S. is a “long way” from launching one, and even if it did, it wouldn’t spy on users. </p>\n                    <p><p>The United States is “nowhere near” any form of central bank digital currency (CBDC) and even if it was, the central bank has no interest in one that surveils users, says Federal Reserve chair Jerome Powell.</p><p>“I want to say that we’re nowhere near recommending or let alone adopting a central bank digital currency in any form,” Powell said in a March 7 <a href=\"https://www.banking.senate.gov/hearings/02/29/2024/the-semiannual-monetary-policy-report-to-the-congress\" target=\"_blank\" rel=\"noopener nofollow\">hearing</a> before the Senate Committee on Banking, Housing, and Urban Affairs.</p><p>It comes the same day as Hong Kong’s central bank <a href=\"https://cointelegraph.com/news/hong-kong-project-ensemble-support-tokenization-wcbdc\">launched a new push</a> for a wholesale CBDC and days after geopolitical bloc BRICS <a href=\"https://tass.com/politics/1755521\" target=\"_blank\" rel=\"noopener nofollow\">reportedly</a> started work on a blockchain-based payments system.</p><p><a href=\"https://cointelegraph.com/news/federal-reserve-nowhere-near-launching-cbdc-jerome-powell\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-08T02:00:00.000Z",
    "title": "Dogecoin ($DOGE) Price Could ‘Explode’ Nearly 550% as it’s ‘Got Too Much Firepower’: Analyst",
    "url": "https://www.cryptoglobe.com/latest/2024/03/dogecoin-doge-price-could-explode-nearly-550-as-its-got-too-much-firepower-analyst/",
    "description": "The price of the meme-inspired cryptocurrency Dogecoin ($DOGE) could surge nearly 550% over the current cryptocurrency market cycle in a rally that a popular cryptocurrency analyst dubbed a “relatively safe trade” as it’s “got too much firepower.” The popular pseudonymous cryptocurrency analyst, Altcoin Sherpa, noted in a post on the microblogging platform X (formerly known […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-08T02:00:02.000Z",
    "title": "SEC Chair Gensler Cautions About Crypto Investing — Warns ‘Thousands’ of Crypto Tokens May Be Securities",
    "url": "https://news.bitcoin.com/sec-chair-gensler-cautions-about-crypto-investing-warns-thousands-of-crypto-tokens-may-be-securities/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/gary-gensler-crypto-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SEC Chair Gensler Cautions About Crypto Investing — Warns &#039;Thousands&#039; of Crypto Tokens May Be Securities\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/gary-gensler-crypto-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/gary-gensler-crypto-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/gary-gensler-crypto-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/gary-gensler-crypto-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/gary-gensler-crypto-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/gary-gensler-crypto-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/gary-gensler-crypto.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />U.S. Securities and Exchange Commission (SEC) Chairman Gary Gensler has cautioned about crypto investing. &#x201C;This is a highly speculative asset class. One could just look at the volatility of bitcoin in the last few days,&#x201D; he stressed, warning that thousands of crypto tokens may be securities. Gary Gensler&#x2019;s Crypto Investment Warning The chairman of the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-08T02:00:03.000Z",
    "title": "Pantera Capital Plans $250M Solana (SOL) Buy, Analyst Predicts Record Rally Toward $1000",
    "url": "https://www.newsbtc.com/news/solana/pantera-capital-plans-250m-solana-sol-buy-analyst-predicts-record-rally-toward-1000/",
    "description": "Pantera Capital, a prominent crypto-focused asset manager with assets totaling $5.2 billion, has launched a fundraising campaign to purchase discounted Solana (SOL) tokens from the bankrupt estate of crypto exchange FTX.  According to Bloomberg, the initiative, known as the Pantera Solana Fund, offers investors the opportunity to purchase up to $250 million worth of SOL tokens at a significant discount to the FTX estate. Solana Token Acquisition Plan Pantera Capital&#8217;s marketing materials, shared with prospective investors in February and reviewed by Bloomberg, outline the opportunity to purchase SOL tokens at a price 39% below the 30-day average or at a fixed price of $59.95.  However, Bloomberg notes that investors participating in this opportunity must agree to a vesting period of up to four years. This approach reportedly allows FTX liquidators, led by John J. Ray III, to offload SOL tokens gradually, freeing up funds for creditors without exerting immediate downward pressure on the token&#8217;s price. Related Reading: Super Tuesday Crypto Craze: Biden-Related Memecoin Stuns Markets With 5,000% Surge According to Pantera&#8217;s pitch document, the FTX estate currently holds approximately 41.1 million SOL tokens, valued at $5.4 billion as of the close of Wednesday&#8217;s trading session. This constitutes roughly 10% of the total supply of SOL tokens.  According to its investor pitch, Pantera aimed to close the fund by the end of February. Although the amount raised by the deadline remains undisclosed, sources familiar with the matter confirmed to Bloomberg that Pantera has secured some funds. Investors interested in participating in the Pantera Solana Fund must commit a minimum of $25 million. Pantera Capital plans to charge a management fee of 0.75% and a performance cut of 10%. Apart from its substantial SOL token holdings, FTX and its sister firm, Alameda Research, have invested significantly in startups within Solana&#8217;s broader ecosystem.  According to Bloomberg, FTX&#8217;s venture arm, Solana Ventures, and Lightspeed Venture Partners jointly announced a $100 million blockchain gaming fund in November 2021. Ultimately, the estate&#8217;s intention to sell these tokens presents an opportunity to raise funds to repay creditors, considering the notable surge of SOL&#8217;s price in the past year. SOL has experienced a staggering 650% increase, trading nearly four times its price when FTX faced its crisis in November 2022. Crypto Analyst Forecasts SOL To Shatter Previous ATH SOL, the fifth-largest cryptocurrency by market capitalization, has continued its remarkable upward trajectory and is currently trading at $147. The token&#8217;s price has increased significantly by 14% in the past 24 hours alone, and over the course of 30 days, it has soared by an impressive 56%.  Related Reading: Crypto Analyst Identifies 8 Altcoins To Turn $1,000 Into $1 Million Despite this uptrend, SOL remains 43% below its previous all-time high (ATH) of $259, achieved in November 2021. However, crypto analyst Altcoin Sherpa believes that SOL will break its previous ATH during this market cycle, with the only uncertainty being the size of the break. Altcoin Sherpa suggests that reaching $500 is highly probable, and an even more astonishing milestone like $1000 is not entirely out of the question. The analyst further emphasizes its confidence in SOL&#8217;s potential, stating that it remains one of their more substantial investments. Altcoin Sherpa also highlights the next significant level to watch for SOL, which is $170. Featured image from Shutterstock, chart from TradingView.com "
  }
]