[
  {
    "source": "CoinDesk",
    "date": "2024-01-31T09:13:49.000Z",
    "title": "Sui Becomes a Top 10 DeFi Blockchain in Less Than a Year",
    "url": "https://www.coindesk.com/tech/2024/01/31/sui-becomes-a-top-10-defi-blockchain-in-less-than-a-year/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Developers on Sui are building products that people are using to address real-world challenges, according to Greg Siourounis, Sui's managing director."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-31T09:27:56.000Z",
    "title": " Bitcoin price gets stablecoin boost as supply jumps 3.5% in one month ",
    "url": "https://cointelegraph.com/news/bitcoin-price-stablecoin-boost-supply-jumps-3-5-in-one-month",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvYzgzMDU4YzUtNWZmYS00ODVmLWE4OWMtYTFiOTcyZTAzMzk2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Stablecoin purchasing power is back in what has been a net positive for Bitcoin price performance.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) is benefiting from a surge in stablecoin “buying power” as their supply trends higher.</p><p>Data from on-chain analytics firm <a href=\"https://studio.glassnode.com/metrics?a=BTC&amp;m=indicators.SsrOscillator&amp;s=1695558238&amp;u=1706572800&amp;zoom=\" target=\"_blank\" rel=\"noopener nofollow\">Glassnode</a> shows an ongoing drop in the stablecoin supply ratio (SSR) oscillator.</p><p>Bitcoin headed to two-year highs this month after originally adding upside in October last year — and stablecoin data says that this is no coincidence.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-price-stablecoin-boost-supply-jumps-3-5-in-one-month\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-31T09:25:03.000Z",
    "title": "Block lays off over a thousand employees from Cash App, Foundational, and Square",
    "url": "https://cryptobriefing.com/block-lays-off-thousand-employees-cash-app-foundational-and-square/?utm_source=feed&utm_medium=rss",
    "description": "Financial services firm Block Inc. has laid off over a thousand employees this week, nearly 10% of its staff, as part of a broader restructuring first outlined by co-founder Jack Dorsey last year."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-31T09:30:15.000Z",
    "title": "SEC, DOJ Charge Individuals in $1.9 Billion Hyperfund Cryptocurrency Fraud",
    "url": "https://news.bitcoin.com/sec-doj-charge-individuals-in-1-9-billion-hyperfund-cryptocurrency-fraud/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec_doj_hyperverse-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SEC and DOJ Crack Down on $1.9 Billion Hyperverse Crypto Fraud\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec_doj_hyperverse-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec_doj_hyperverse-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec_doj_hyperverse-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec_doj_hyperverse-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec_doj_hyperverse-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec_doj_hyperverse-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec_doj_hyperverse.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The SEC alongside the DOJ, has levied serious charges against key figures in a $1.9 billion cryptocurrency fraud scheme involving Hyperfund. SEC and DOJ Crack Down on $1.9 Billion Hyperfund Crypto Fraud The U.S. Securities and Exchange Commission (SEC) and the Department of Justice (DOJ) have taken major legal action against individuals involved in a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-31T09:30:08.000Z",
    "title": "US Bitcoin ETFs spell trouble for the financial world",
    "url": "https://www.cryptopolitan.com/bitcoin-etfs-spell-trouble-in-finance/",
    "description": "The launch of US exchange-traded funds (ETFs) tracking Bitcoin has sparked discussions and concerns regarding potential risks to the broader financial system. If widely adopted, these products could pose challenges during times of market stress, potentially exacerbating volatility in both the Bitcoin market and other financial sectors.&#160; One analysis suggests that Bitcoin ETFs might introduce [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-31T09:25:14.000Z",
    "title": "China prepares to introduce crypto AML laws by 2025",
    "url": "https://www.cryptopolitan.com/china-to-introduce-crypto-aml-laws-by-2025/",
    "description": "In a decisive move to strengthen its Anti-Money Laundering (AML) laws, China is set to include cryptocurrency-related transactions in its regulations. This development, marked as the first significant amendment since 2007, was deliberated in a recent State Council executive meeting chaired by Prime Minister Li Qiang on January 22. The initiative highlights China&#8217;s commitment to [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-31T09:26:33.000Z",
    "title": "Analysts: Solana might soar to 2021 highs of $260",
    "url": "https://crypto.news/analysts-solana-might-soar-to-2021-highs-of-260/",
    "description": "Solana and NuggetRush continue to make headlines. The NUGX presale is in progress, raising over $2 million"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-31T09:25:16.000Z",
    "title": "XRP whale transactions spike 198% amid price slump to $0.51",
    "url": "https://crypto.news/xrp-whale-transactions-spike-198-amid-price-slump-to-0-51/",
    "description": "XRP (XRP) whale transactions have seen a remarkable increase recently, spiking by a massive 198% over the past 24 hours, as the cryptocurrency witnessed massive selloffs that have plummeted its price to the $0.51 support level. Data from Santiment validates&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-31T09:23:05.000Z",
    "title": "China to introduce significant changes to crypto AML for the first time in 17 years",
    "url": "https://crypto.news/china-to-introduce-significant-changes-to-crypto-aml-for-the-first-time-in-17-years/",
    "description": "Chinese authorities are significantly preparing to amend their anti-money laundering (AML) regulations. According to regional media reports, Beijing is set to amend its anti-AML rules to include cryptocurrency-related transactions amid calls for greater scrutiny of the nascent crypto industry from&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-31T09:11:38.000Z",
    "title": "Experts: Pushd may outperform Shiba Inu and Avalanche in 2024",
    "url": "https://crypto.news/experts-pushd-may-outperform-shiba-inu-and-avalanche-in-2024/",
    "description": "Pushd, some analysts predict, will likely outperform Shiba Inu (SHIB) and Avalanche (AVAX) in 2024"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-31T09:11:19.000Z",
    "title": "SEC proposes dropping Debt Box lawsuit amid threat of court sanctions",
    "url": "https://crypto.news/sec-proposes-dropping-debt-box-lawsuit-amid-threat-of-court-sanctions/",
    "description": "The United States Securities and Exchange Commission (SEC) has requested the dismissal of its lawsuit against crypto company Debt Box following a federal court&#8217;s demand for justification against potential penalties for alleged dishonesty. This development, dated Jan. 30, marks a&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-31T09:20:40.000Z",
    "title": "3 Signs That A Bitcoin Supply Shock Could Be Just Days Away",
    "url": "https://www.newsbtc.com/all/3-signs-that-a-bitcoin-supply-shock-could-be-just-days-away/",
    "description": "The Bitcoin community is currently abuzz with discussions of an impending supply shock, a market phenomenon where demand outstrips supply, potentially leading to a substantial price increase. Indicators from various sectors within the market are currently converging, suggesting that such an event may be closer than many anticipate. Here&#8217;s an in-depth look at three signs for an impending supply shock: #1 Surging Demand For Bitcoin ETFs Bitcoin ETFs have been creating an exceptionally large demand since their launch. Initially, this demand surge was somewhat moderated due to significant outflows from the Grayscale Bitcoin ETF (GBTC). However, day 13 of the Bitcoin ETFs showed once again that the Grayscale outflows are slowly slowing down (yesterday: $220.7 million, previously $191.7 million), while the last two trading days saw net inflows for all ETF issuers of around $250 million. Dan Ripoll, managing director at Swan, provided a detailed analysis on the sheer magnitude of this. &#8220;The Bitcoin spot ETFs have already snatched up 150,500 BTC in just 13 trading days. They are buying at a rate of 12,000 BTC per day. Now, let&#8217;s KISS (keep it simple stupid). There are only 900 BTC per day being issued. BTC is being bought up at a rate of 13x daily issuance. In 3 months, the issuance will be cut in half, driving the demand/supply imbalance to a staggering 26x daily issuance!&#8221; Related Reading: Bitcoin ETFs Experience Day 12 Reversal, GBTC Selling Slows, Fidelity And Blackrock Garner $400 Million Furthermore, Alessandro Ottaviani, a respected Bitcoin analyst, underscored the potential market shift, stating, “Now that the Bitcoin ETF inflow will always be higher than the Grayscale outflow, the only way to accommodate that demand will be through an increase of price. Once we reach $60k and even more after the new ATH, Institutional FOMO will be officially triggered, and it will be something that the human being has never experienced.” WhalePanda, a renowned crypto analyst, highlighted recent activities, adding credibility to the brewing supply shock: “Yesterday another ~$250 million net inflow into Bitcoin ETFs with Blackrock doing a solid $300 million all by itself. Two days of $250 million inflow, the price didn&#8217;t rally much yesterday, but a couple of days like this, and you&#8217;ll see what kind of supply shock this will have on BTC.” #2 Massive Bitcoin Miner Selling Absorbed Despite a substantial flow of coins from miner wallets to spot exchanges, the market has shown remarkable resilience. According to a report from Cryptoquant: &#8220;Yesterday, the flow of coins in miner wallets going to spot exchanges recorded the highest value since May 16, 2023. In total, more than 4,000 Bitcoins flowed to spot exchanges, around $173 million in selling pressure. However, this selling pressure was calmly absorbed by the market.&#8221; Related Reading: Bitcoin Whales Increase Holdings By 4.5%, Getting Ready For Rally? It&#8217;s critical to note that despite these interactions, the reserves in mining portfolios have remained consistent since the beginning of January, indicating that the market has effectively absorbed the selling pressure without significant price depreciation. #3 Stablecoins Aka “Dry Powder” On The Rise The stablecoin aggregated market cap serves as a precursor to potential market movements. Recently, the stablecoin aggregated market cap has shown a significant rebound, moving from a bottom of $119.5 billion in mid-October 2023 to nearing $130 billion. This rise in stablecoin reserves is often interpreted as &#8220;dry powder,&#8221; ready to be deployed into assets like Bitcoin, potentially further accelerating the supply/demand mechanics. Alex Svanevik, founder of on-chain analysis platform Nansen, remarked on the correlation between stablecoin reserves and BTC price: “When stables on exchanges peaked, BTC price peaked.” At press time, BTC traded at $42,848. Featured image created with DALL·E, chart from TradingView.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-01-31T09:26:25.000Z",
    "title": "Quick Unstaking Guide: Bypassing Bonding Period",
    "url": "https://www.altcoinbuzz.io/defi/quick-unstaking-guide-bypassing-bonding-period/",
    "description": "<p>In Web3, one avenue for generating income involves selling crypto investments when the market prices surge. Another way is through staking, where you can leverage your digital assets to generate passive income without selling. But how to enable quick unstaking? So, it’s no surprise that staking is a frequently discussed concept among crypto investors. However, [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/defi/quick-unstaking-guide-bypassing-bonding-period/\">Quick Unstaking Guide: Bypassing Bonding Period</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]