[
  {
    "source": "CoinDesk",
    "date": "2023-07-07T19:50:46.000Z",
    "title": "BlackRock CEO’s Turnabout on Bitcoin Elicits Cheers, Skepticism of Crypto Cred",
    "url": "https://www.coindesk.com/business/2023/07/07/blackrock-ceo-larry-finks-turnabout-on-bitcoin-elicits-cheers-skepticism-from-crypto-insiders/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "BlackRock CEO Larry Fink's change of heart on bitcoin could make it easier for fellow Wall Street executives to embrace cryptocurrencies, but experts warn that his favored financial instrument – the exchange-traded fund, or ETF – is an investment vehicle that's categorically different from the core idea behind digital assets, and could push the industry in the wrong direction."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-07T20:06:51.000Z",
    "title": "Elon Musk's lawyers respond to motion to kick Tesla team off Dogecoin case: ‘waste of this court’s time’",
    "url": "https://cointelegraph.com/news/elon-musk-lawyers-respond-to-motion-to-kick-tesla-team-off-dogecoin-case-waste-of-this-court-s-time",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/1efa5c32-fc92-46c3-8d7c-763999e0aad4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The strongly worded legal filing comes in response to an attempt to have Tesla’s lawyers sanctioned over supposed conflicts of interest and alleged misconduct. </p>\n                    <p><p>Lawyers representing Elon Musk and Tesla asked a United States district court judge to toss out a motion to have them sanctioned over alleged conflicts of interest in a $258 billion lawsuit alleging Musk participated in an illegal racketeering scheme related to the Dogecoin cryptocurrency.</p><p>In a filing dated July 6, Musk and Tesla’s team <a href=\"https://www.courtlistener.com/docket/63388702/84/johnson-v-musk/\" target=\"_blank\" rel=\"noopener nofollow\">responded</a> to the June 25 motion <a href=\"https://www.courtlistener.com/docket/63388702/83/johnson-v-musk/\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> by Evan Spencer, a lawyer representing the plaintiffs in the case against Musk. </p><p>Spencer referred to the defendants’ lawyers as “yes men” in his filing and asked the judge to declare it a conflict of interest for the team to represent both Musk and Tesla. “Defense counsel is acting in this case as concurrent representatives of both Defendants,” reads the complaint, “while their real loyalty is to Elon Musk alone.”</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/elon-musk-accuses-mark-zuckerberg-of-cheating-twitter-vs-threads\">Elon Musk accuses Mark Zuckerberg of cheating: Twitter vs. Threads</a></em></strong></p><p>The legal team representing Musk and Tesla minced no words in their response, referring to Spencer’s motion as “unsubstantiated” and “frivolous” three times in the table of contents alone. </p><p>According to the defendants’ representatives, there is no conflict of interest under New York law. They claim that the law provides for legal teams to represent the officers of companies they also represent except in situations where the two entities are legal adversaries. Per the July 6 filing:</p><blockquote>“Spencer’s Motion [...] is an egregious abuse of process, yet another fanciful work of fiction by Spencer in a long chain of such pleadings, a waste of this Court’s time, and an insult to undersigned counsel, well-regarded members of the Bar of this Court and recently admitted by the Court pro hac vice.”</blockquote><p>The filing goes on to address allegations made by Spencer that Tesla’s legal team leaked a letter to the New York Post purportedly disparaging Spencer’s frivolity with Rule 11 — essentially, the letter accused Spencer of having a history of filing frivolous motions to delay court procedures. </p><p>Spencer’s filing for a motion to have the defendant team sanctioned claims that this action polluted the jury pool. </p><p>Musk's and Tesla’s lawyers dispute the allegation that they leaked the letter and, in their filing, counter with the contention that it was Spencer who introduced the letter to the jury pool by publicly docketing and introducing it to the jury through the June 25 motion. </p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-07T20:00:51.000Z",
    "title": "Centralized exchanges lost nearly $11B to hackers over the past decade",
    "url": "https://cryptoslate.com/hackers-have-stolen-almost-11b-from-centralized-exchanges-in-11-years/",
    "description": "<p>The crypto industry has lost slightly more than $30 billion to hackers since 2012, with over 30% of that ($10.95 billion) stolen from centralized exchanges, as revealed by research conducted by blockchain security firm SlowMist. The security firm reported that between 2012 and 2023, these exchanges endured 118 hacks, with the two most significant ones [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/hackers-have-stolen-almost-11b-from-centralized-exchanges-in-11-years/\">Centralized exchanges lost nearly $11B to hackers over the past decade</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T20:01:36.000Z",
    "title": "BitMEX CEO claims Bitcoin is set to become the ultimate currency for AI",
    "url": "https://www.cryptopolitan.com/bitmex-ceobtc-to-become-ai-currency/",
    "description": "In a recently published article, Arthur Hayes, the CEO of BitMEX, made a bold claim that Bitcoin would be the preferred currency for Artificial Intelligence (AI). Hayes emphasized that AI would favor BTC as the currency of choice for its economic activities. Titled &#8220;Massa,&#8221; which means &#8220;slaver,&#8221; Hayes&#8217;s article foretold a future where AI would ... <a title=\"BitMEX CEO claims Bitcoin is set to become the ultimate currency for AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitmex-ceobtc-to-become-ai-currency/\" aria-label=\"More on BitMEX CEO claims Bitcoin is set to become the ultimate currency for AI\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T19:50:47.000Z",
    "title": "Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better ... <a title=\"Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fantom-price-prediction/\" aria-label=\"More on Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T19:47:37.000Z",
    "title": "Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?",
    "url": "https://www.cryptopolitan.com/algorand-price-prediction/",
    "description": "Algorand Price Prediction 2023-2032 Algorand is one of the best choices considering investing in cryptocurrency. However, it is insufficient to hold the ALGO cryptocurrency in high esteem. The coin has to perform up to expectations. You must look at Algorand&#8217;s price prediction from 2023 to 2032, its expected minimum price, and what it brings. For ... <a title=\"Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/algorand-price-prediction/\" aria-label=\"More on Algorand Price Prediction 2023-2032: Is ALGO a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T19:45:35.000Z",
    "title": "DappRadar’s report unveils remarkable $210M Bitcoin Ordinals trading volume in Q2",
    "url": "https://www.cryptopolitan.com/210m-bitcoin-ordinals-trading-volume-in-q2/",
    "description": "According to DappRadar&#8217;s most recent quarterly report, the creation of Bitcoin Ordinals inscriptions on the Bitcoin blockchain generated more than $210 million in trade volume, but the NFT market continued to decline. The data shows how fast expanding demand for Bitcoin Ordinals has resulted in a substantial increase in transaction volume through the second quarter ... <a title=\"DappRadar&#8217;s report unveils remarkable $210M Bitcoin Ordinals trading volume in Q2\" class=\"read-more\" href=\"https://www.cryptopolitan.com/210m-bitcoin-ordinals-trading-volume-in-q2/\" aria-label=\"More on DappRadar&#8217;s report unveils remarkable $210M Bitcoin Ordinals trading volume in Q2\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T19:44:04.000Z",
    "title": "Alibaba unveils AI tool for text-to-image conversion",
    "url": "https://www.cryptopolitan.com/alibaba-ai-tool-for-text-to-image-conversion/",
    "description": "Alibaba&#8217;s latest advancement in artificial intelligence demonstrates the firm&#8217;s foray into a new realm of technological potential. Alibaba racing to the front of generative AI The Chinese tech titan recently revealed a pioneering tool known as Tongyi Wanxiang, a generative AI product that converts written prompts into images, manifesting visions in styles from sketches to ... <a title=\"Alibaba unveils AI tool for text-to-image conversion\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alibaba-ai-tool-for-text-to-image-conversion/\" aria-label=\"More on Alibaba unveils AI tool for text-to-image conversion\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-07T20:00:54.000Z",
    "title": "Hackers Have Stolen $30 Billion In Crypto Since 2012, SlowMist Report Finds",
    "url": "https://www.newsbtc.com/crypto/30-billion-in-crypto-since-2012/",
    "description": "Due to the anonymity cryptocurrencies provide, the crypto industry is known to be targeted by hackers and other malicious players. This has left many wondering just how much digital currency has been pilfered from right under the nose of the industry over the years.  Now, the latest report by blockchain security firm SlowMist seems to have the answer. According to the recently released report, hackers and scammers have made off with a staggering $30 billion in cryptocurrency since 2012.  Details Of The Report The SlowMist team analyzed 1,101 hacking incidents to determine how much crypto has been stolen to date and how they were stolen. Their findings show that hackers and scammers employ a variety of methods, with the top ones being contract vulnerability attacks, rug pulls, flash loan attacks, scams, leaking of private keys, and good old phishing attacks to gain access to people&#8217;s crypto accounts and wallets.  Related Reading: Cardano Foundation Collaborates With Epoch Sports And Merchandise For Lacrosse Championship 2023 The most lucrative year for malicious players came in 2021 during the extended crypto hype, with over $9.7 billion stolen in 236 attacks.  In total, the amount stolen in the last decade came up to a little over $30 billion. And given that the overall market cap of all cryptocurrencies is now at $1.14 trillion, the amount reported stolen is over 2.5% of the total market cap. Over $30 billion stolen in 10 years &#124; Source: SlowMist Exchanges And Ethereum Ecosystem Hit The Most Exchanges have always long been a prime target for hackers looking to steal crypto due to their large holdings and the SlowMist report reflects that.  In total, over 118 attacks were carried out on exchanges, resulting in over $10.9 billion being lost. The biggest of these could be traced back to the $534 million lost in the 2018 Japanese exchange Coincheck hack and the 2014 Mt. Gov hack resulting in a loss of over $473 million. Total market cap chart sitting at $1.139 trillion &#124; Source: Crypto Total Market Cap on TradingView.com In terms of attacks on blockchain ecosystems, Ethereum came out on top with 217 attacks and over $3.1 billion being pilfered away. This should come as no surprise, considering Ethereum is home to most Web3 projects. The BSC and EOS ecosystems followed closely with 162 and 119 attacks, respectively. Additionally, over $200 million were lost in NFT attacks, while bridge attacks led to $2 billion in losses.  What’s Next For The Crypto Industry? The staggering numbers in SlowMist&#8217;s report are a reminder that crypto, for all its promise, also has a dark side. However, attacks seem to have been slowing down as many projects have started to improve their security. With more than a trillion dollars at stake, reducing theft should be a collaborative effort across the entire crypto landscape.  Related Reading: Arbitrum DAO Locks $770 Million In ARB Tokens Into Vesting Contract: Implications For ARB According to the latest report by Beosin, a blockchain security firm, losses from Web3 scams and hacks dropped dramatically in H1 2023. Data from SlowMist&#8217;s report also shows that the total amount of money lost to blockchain hackers has been declining since 2021. Featured image from ETF Trends, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-07T20:00:36.000Z",
    "title": "Analyst Predicts Rallies for Bitcoin Cash, Litecoin, Pepe and One Ethereum Rival",
    "url": "https://dailyhodl.com/2023/07/07/analyst-predicts-rallies-for-bitcoin-cash-litecoin-pepe-and-one-ethereum-rival/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/predicts-rallies-for-one.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/predicts-rallies-for-one.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/predicts-rallies-for-one.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/predicts-rallies-for-one.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/predicts-rallies-for-one.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/predicts-rallies-for-one.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/predicts-rallies-for-one.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is predicting rallies for Bitcoin Cash (BCH), Litecoin (LTC), meme asset Pepe (PEPE) and one Ethereum (ETH) competitor. Pseudonymous crypto trader Kaleo tells his 593,100 Twitter followers that he believes that the Bitcoin (BTC)-hard fork BCH will continue the rally it sparked last month that saw it go around the $106 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/07/analyst-predicts-rallies-for-bitcoin-cash-litecoin-pepe-and-one-ethereum-rival/\">Analyst Predicts Rallies for Bitcoin Cash, Litecoin, Pepe and One Ethereum Rival</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-07T19:55:08.000Z",
    "title": "Bitcoin (BTC) Analyst Tells Traders There Is ‘Nothing To Worry About’ Because ‘Everything Is Reset’",
    "url": "https://dailyhodl.com/2023/07/07/bitcoin-btc-analyst-tells-traders-there-is-nothing-to-worry-about-because-everything-is-reset/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/05/trader-optimistic-one.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/05/trader-optimistic-one.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/05/trader-optimistic-one.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/05/trader-optimistic-one.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/05/trader-optimistic-one.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/05/trader-optimistic-one.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/05/trader-optimistic-one.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is telling Bitcoin (BTC) that there is &#8220;nothing to worry&#8221; about, given one condition. Crypto trader Michaël van de Poppe tells his 659,900 Twitter followers that as long as they aren&#8217;t trading on high leverage right now, they should be doing okay. &#8220;Nothing to worry, my friends. Don&#8217;t trade high leverage. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/07/bitcoin-btc-analyst-tells-traders-there-is-nothing-to-worry-about-because-everything-is-reset/\">Bitcoin (BTC) Analyst Tells Traders There Is ‘Nothing To Worry About’ Because ‘Everything Is Reset’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]