[
  {
    "source": "CoinDesk",
    "date": "2023-10-05T21:27:33.000Z",
    "title": "Blackbird, Crypto Restaurant App, Raises $24M in Funding Led by A16z ",
    "url": "https://www.coindesk.com/tech/2023/10/05/blackbird-crypto-restaurant-app-raises-24m-in-funding-led-by-a16z/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The target audience is restaurant users, but the blockchain-based project comes with its own \"Flypaper\" and fungible FLY tokens."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-05T21:19:17.000Z",
    "title": "FTX Insider Gary Wang: Sam Bankman-Fried Allowed Alameda to Withdraw Unlimited Funds",
    "url": "https://decrypt.co/200344/ftx-insider-gary-wang-sam-bankman-fried-allowed-alameda-to-withdraw-unlimited-funds",
    "description": "FTX co-founder Gary Wang testified on Thursday, saying that company insiders committed fraud."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-05T21:33:28.000Z",
    "title": "FTX deposits went to account controlled by Alameda for months, Yedidia testifies",
    "url": "https://cointelegraph.com/news/ftx-deposits-alameda-controlled-account-adam-yedidia-testifies",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/037f6fac-4b1f-4171-88ad-06728c5f0537.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Yedidia was involved in writing a buggy program to automate FTX customer deposits and withdrawals and was concerned by the size of the Alameda Research liability on the FTX books. </p>\n                    <p><p>Adam Yedidia, Sam Bankman-Fried’s college roommate and an early employee of FTX, continued his testimony on Oct. 5, the second day of former FTX CEO Bankman-Fried’s trial in New York. Yedidia was testifying for the prosecution with immunity.</p><p>Under examination by Assistant U.S. Attorney Danielle Sassoon, Yedidia told the court that he started as a trader for Alameda Research and then worked for FTX as a software developer from January 2021 through November 2022, when he resigned. In the Bahamas, Yedidia was one of the “people of the house” — the ten people who shared a large apartment in the luxury Albany Resort. He reported to former FTX engineering director Nishad Singh and “informally” to FTX co-founder Gary Wang and Bankman-Fried.</p><p>Yedidia said that, as he understood it, when Alameda Research traded on FTX, the ultimate beneficiaries of the profits were Bankman-Fried and Wang. </p><p>Yedidia said he was involved in writing the coder to automate customer deposits and withdrawals from FTX. Bankman-Fried was also “very involved” in the project. Yedidia initially thought customer deposits were going to an FTX bank account, but he learned that FTX was having trouble opening a bank account and deposits <a href=\"https://cointelegraph.com/news/here-s-how-sbf-s-fake-electronics-outlet-north-dimension-looks-like\">went to an account in the name of North Dimension Inc.</a>, which was controlled by Alameda Research. </p><p>Yedidia said customers were instructed to send deposit funds to the North Dimension account, and they did not know it was controlled by Alameda, as far as he knew. He said either Singh or FTX head of settlements Ray Salame told him about the arrangement.</p><p>“Sometime in late 2021,” FTX succeeded in opening a bank account and customers had the option to send funds to “FTX Digital Markets,” Yedidia said. He said he was aware that some customer deposits continued to go to the Alameda Research-controlled account after that.</p><p>Deposits were also tracked in an internal FTX database in an account called “Fiat at FTX.com,” which contained information, and not money. The sum of customer deposits should equal the amount of liability in “Fiat at FTX.com,” Yedidia explained. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/ftx-exploiter-moves-36-8-m-ether-sam-bankman-fried-trial\">FTX exploiter moves $36.8M in Ether as Sam Bankman-Fried’s trial starts</a></em></strong></p><p>Yedidia learned in late 2021 that the automation code he had helped develop had a bug. Because of the bug, customer withdrawals lowered the liability recorded in “Fiat at FTX.com,” as was correct, but it did not decrease the liability of Alameda Research to FTX, as it should have. </p><p>“Gary [Wang] or Nishad [Singh]” told Yedidia about the bug, he said, and he spoke to Bankman-Fried about it. The bug exaggerated the Alameda Research liability by $500 million after about six months, and it was not fixed for another six months, or until “around June 2022.” Yedidia later specified that he fixed the bug in mid-June 2022.</p><p>Yedidia said Bankman-Fried instructed him to fix the bug after Bankman-Fried, former Alameda Research CEO Caroline Ellison, Wang and Singh held a meeting on a “full accounting of the two companies” — FTX and Alameda Research.</p><p>At the time Yedidia fixed the bug, the Alameda Research liability reflected in the “Fiat at FTX.com” account was recorded as $16 billion, he said. After the fix, the Alameda Research liability was reduced to $8 billion. That figure was visible to others in the company.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Adam Yedidia, SBF snitch deleted his X account. <a href=\"https://twitter.com/AdamYedidi10070?ref_src=twsrc%5Etfw\">@adamyedidi10070</a><br><br>Homie you have to take this L for the rest of your life to the grave. You lived with the man, went to college with the man and you can&#39;t even wait for his guilt to be established before you turn on him. Smdh </p>&mdash; Martin Shkreli (e/acc) (@wagieeacc) <a href=\"https://twitter.com/wagieeacc/status/1709674011813146662?ref_src=twsrc%5Etfw\">October 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Yedidia expressed concern about the large remaining liability to Bankman-Fried, who <a href=\"https://cointelegraph.com/news/college-roommate-sam-bankman-fried-ftx-8b-hole\">gave him reassurance</a>, saying the company was “bulletproof last year,” and would be “bulletproof” again within six months to three years. Yedidia took “bulletproof” to mean being in sound financial health, he said.</p><p>Yedidia mentioned in his testimony that the “People of the House” used the Signal messaging app to communicate. He used Signal to deliver documentation of the customer deposit and withdrawal automation bug fix to Bankman-Fried. The app was set to automatically delete messages after a certain time, Yedidia said. </p><p>Yedidia said Bankman-Fried explained that preserving messages was “all downside.” “If regulators found something they didn’t like in the messages, that would be bad for the company,” Yedidia said, summarizing Bankman-Fried’s words. “He didn’t use exactly those words, but that was the substance of what he said,” Yedidia explained. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/can-you-trust-crypto-exchanges-after-the-collapse-of-ftx/\">Can you trust crypto exchanges after the collapse of FTX?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-05T21:30:00.000Z",
    "title": "Singapore Confirms Man Arrested in Su Zhu Case, Withholding Identity",
    "url": "https://coinedition.com/singapore-confirms-man-arrested-in-su-zhu-case-withholding-identity/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/10/Singapore-Confirms-Man-Arrested-in-Su-Zhu-Case-Withholding-Identity.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Singapore Confirms Man Arrested in Su Zhu Case, Withholding Identity\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/10/Singapore-Confirms-Man-Arrested-in-Su-Zhu-Case-Withholding-Identity.jpg 730w, https://coinedition.com/wp-content/uploads/2023/10/Singapore-Confirms-Man-Arrested-in-Su-Zhu-Case-Withholding-Identity-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/10/Singapore-Confirms-Man-Arrested-in-Su-Zhu-Case-Withholding-Identity-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/10/Singapore-Confirms-Man-Arrested-in-Su-Zhu-Case-Withholding-Identity-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/10/Singapore-Confirms-Man-Arrested-in-Su-Zhu-Case-Withholding-Identity-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/10/Singapore-Confirms-Man-Arrested-in-Su-Zhu-Case-Withholding-Identity-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/10/Singapore-Confirms-Man-Arrested-in-Su-Zhu-Case-Withholding-Identity-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2023/10/Singapore-Confirms-Man-Arrested-in-Su-Zhu-Case-Withholding-Identity-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/10/Singapore-Confirms-Man-Arrested-in-Su-Zhu-Case-Withholding-Identity-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/10/Singapore-Confirms-Man-Arrested-in-Su-Zhu-Case-Withholding-Identity-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/10/Singapore-Confirms-Man-Arrested-in-Su-Zhu-Case-Withholding-Identity-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/10/Singapore-Confirms-Man-Arrested-in-Su-Zhu-Case-Withholding-Identity-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/10/Singapore-Confirms-Man-Arrested-in-Su-Zhu-Case-Withholding-Identity-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/10/Singapore-Confirms-Man-Arrested-in-Su-Zhu-Case-Withholding-Identity-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/10/Singapore-Confirms-Man-Arrested-in-Su-Zhu-Case-Withholding-Identity-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2023/10/Singapore-Confirms-Man-Arrested-in-Su-Zhu-Case-Withholding-Identity-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent development, law enforcement agencies in Singapore have confirmed the apprehension of a 36-year-old man in response to a query about the arrest of Su Zhu, who is 36 years old and one of the founders of the now-bankrupt crypto hedge fund Three Arrows Capital (3AC). Singapore police force made the confirmation in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/singapore-confirms-man-arrested-in-su-zhu-case-withholding-identity/\">Singapore Confirms Man Arrested in Su Zhu Case, Withholding Identity</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]