[
  {
    "source": "Decrypt",
    "date": "2023-08-28T16:00:21.000Z",
    "title": "SEC Fines LA Company $6 Million Over NFTs Sold as Securities",
    "url": "https://decrypt.co/154000/sec-fines-la-company-6-million-over-nfts-sold-as-securities",
    "description": "The company has also been ordered to destroy all the Founder's Key NFTs as a result of the settlement."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-28T15:56:48.000Z",
    "title": "Balancer Suffers Nearly $1M Exploit as Team Urges Users to Withdraw Funds",
    "url": "https://decrypt.co/154002/balancer-suffers-nearly-1m-exploit-team-urges-users-withdraw-funds",
    "description": "Less than a week after the team first announced the vulnerability, DeFi project Balancer has been exploited for roughly $979,000."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-28T16:00:35.000Z",
    "title": "Amid volatility, Bitcoin options open interest leapt over futures",
    "url": "https://cryptoslate.com/insights/amid-volatility-bitcoin-options-open-interest-leapt-over-futures/",
    "description": "<p>Quick Take A significant shift in the Bitcoin derivatives market has been observed, with Bitcoin Options Open Interest (OOI) surpassing Futures Open Interest (FOI) for the first time in the quarter. This shift, marked by an OOI of 395k BTC and an FOI of 393k BTC, occurred last Thursday, coinciding with a substantial market dip. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/amid-volatility-bitcoin-options-open-interest-leapt-over-futures/\">Amid volatility, Bitcoin options open interest leapt over futures</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-28T16:08:00.000Z",
    "title": "\n                        The Next Big Evolution in MOBA Shooters, Brought to You by PLAYA3ULL GAMES Global Release, 3rd September 2023.\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/the-next-big-evolution-in-moba-shooters-brought-to-you-by-playa3ull-games-global-release-3rd-september-2023",
    "description": "\n                        <p>PLAYA3ULL GAMES, the innovative minds behind the latest gaming advancements, are proud to unveil NEXUS, a third-person Multiplayer Online Battle Arena (MOBA) shooter set to redefine gaming standards. Built on the breathtaking Unreal Engine 5, NEXUS thrusts players into a futuristic arena where strategy, agility, and adaptability are key. But NEXUS is more than just a game; it's a revolution. By empowering players to craft weapons, abilities, and equipment, NEXUS ensures a truly unique gaming experience tailored to each individual's playstyle.</p>\nUnique Selling Points of NEXUS:\n● Blockchain Integration: Making waves in the industry, PLAYA3ULL GAMES harnesses the power of blockchain to store player skins, giving them genuine ownership and flexibility to trade or sell.\n● No Pay-to-Win Elements: PLAYA3ULL is passionate about fair play, ensuring NEXUS remains a skill-driven game without pay-to-win elements.\n● Tournaments &amp; Rewards: Tournaments are coming soon and you get the chance to earn multiple types of currency, including the exclusive 3ULL coin.\n● PLAYA3ULL GAMES, pronounced as \"Playable Games\", is dedicated to blending traditional gaming with the latest technological advancements. Their commitment to player experience and fair gameplay makes them a company to watch in the coming years.\n<p>To get a&nbsp;firsthand experience of the action-packed world of NEXUS: https://youtu.be/7qg9G5svVIs</p>\n<p>For further inquiries or exclusive interviews with the minds behind PLAYA3ULL GAMES, please contact amanda@playa3ull.games</p>\n<p>About PLAYA3ULL GAMES</p>\n<p>PLAYA3ULL GAMES, a forward-thinking gaming company, bridges the gap between thrilling gameplay and cutting-edge technology. Their dedication to innovation and player-first experiences positions them at the forefront of the gaming industry.</p>\n<p>Website: http://www.playa3ull.games</p>\n<p>Twitter: https://twitter.com/PLAYA3ULL_GAMES</p>\n<p>Discord: https://t.co/jx8K2t84Wf</p>\n<p>Disclaimer: This is a sponsored press release and is for informational purposes only. It does not reflect the views of Crypto Daily, nor is it intended to be used as legal, tax, investment, or financial advice</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T15:45:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-28T16:00:31.000Z",
    "title": "Another Bitcoin Metric Is About To Reach A New All-Time High Despite The Bear Market",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-metric-to-ath/",
    "description": "The price of Bitcoin has taken a beating in the past month. The leading cryptocurrency by market cap is down by more than 11% from its price in July and has lost more than $50 billion in market cap since then.  While the price plunge has been painful for investors, Bitcoin miners have also been feeling the sting as mining revenue per computing power has been dwindling for the past few months. On the other hand, Bitcoin’s hashrate has soared to high levels as mining farms continue to come online. Bitcoin Hashrate Reaches All-Time Highs Despite Bear Market Over the last year, Bitcoin&#8217;s hashrate (the total combined computing power of miners) has almost doubled. Data from Blockchain.com shows that the Bitcoin network hash rate surpassed 414 terahashes per second (TH/s) for the first time on August 16.  Related Reading: Exodus Of 30,000 BTC To Cold Wallets Spells Good News For Bitcoin Price This metric has since retraced to 390 TH/s, but it is expected to rise further in the coming weeks as miners bring on more computing power to break even on their mining operations. The higher the hashrate, the more difficult it becomes to mine BTC and earn rewards. This means that miners are now making less BTC per terahash of computing power than ever before.  Data from Hashrate Index shows this figure is now at $0.06016 per terahash/second per day. In comparison, this figure was at $0.08124 on May 8 during the rise of Bitcoin Ordinals and Inscriptions. A further decline from here would see mining revenue fall below the lowest point in November 2022. How Miners Are Adapting To Stay Profitable The Bitcoin mining industry has proven itself resilient, even during the depths of the crypto winter. According to data from investment information platform MacroMicro, the current average cost to mine a BTC stands at $45,877 with the current price of BTC now at $25,936.  BTC price displays volatility during the weekend &#124; Source: BTCUSD on Tradingview.com To remain profitable with the rising hash rate, Bitcoin miners have had to adjust their operations. Publicly traded mining companies like Marathon Digital and Riot Platforms have had to raise about $440 million through stock sales.  Bitcoin miners have also avoided selling their $900 million BTC, as it could trigger a major selloff from investors. While previous on-chain data have shown miners sending a significant amount of coins to exchanges, miners have been expanding their reserves recently.  BTC Mining Outlook The outlook for Bitcoin mining economics in the coming months is uncertain but potentially promising if the hashrate continues to increase. The next Bitcoin halving is expected to take place in April 2024, slashing block reward by 50%.  Related Reading: Cathie Wood’s ARK Invest Joins Ethereum Futures ETF Race After Spot Bitcoin ETF Delay When the halving occurs, things could even get tighter for miners, as they would have to increase mine more blocks to break even. Nevertheless, big BTC mining companies are already on track for this adjustment. Marathon Digital, for example, was able to achieve a 54% boost in its hashrate during the second quarter but reported a net loss of $21.3 million. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-28T16:03:11.000Z",
    "title": "Shiba Inu’s Game-Changer: Shibarium Scaling Triumphs with 65K Wallets and 350K Transactions",
    "url": "https://www.crypto-news-flash.com/shiba-inus-game-changer-shibarium-scaling-triumphs-with-65k-wallets-and-350k-transactions/",
    "description": "<img width=\"1920\" height=\"1277\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Shytoshi Kusama&#8217;s recent blog post celebrates the successful launch of Shibarium, with 65,000 wallets and 350,000 transactions. Weekend transactions fluctuate, 19,677,336.8931 BONE tokens staked, withdrawals vary. In a recent blog entry, Shytoshi Kusama, the creator of Shiba Inu, revealed that the Shibarium platform has been launched successfully and is currently expanding as intended. Kusama mentioned, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-28T16:00:14.000Z",
    "title": "Shiba Inu Burn Guide | How Shiba Inu Token Burns Affect Price and New Trending Meme Coin ApeMax",
    "url": "https://www.crypto-news-flash.com/shiba-inu-burn-guide-how-shiba-inu-token-burns-affect-price-and-new-trending-meme-coin-apemax/",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-149.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-149.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-149-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Welcome to the ultimate guide focusing on the mechanisms behind Shiba Inu burns and how they potentially influence the token. In this swiftly evolving crypto universe, understanding these dynamics is vital. As we discuss Shiba Inu, it&#8217;s impossible to ignore the newly emerging meme coin ApeMax that&#8217;s stealing the limelight. SHIB Burns &#38; Price Dynamics: [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-28T16:01:00.000Z",
    "title": "Cardano Will Surpass Bitcoin and Ethereum: Cardano Founder",
    "url": "https://coinedition.com/cardano-will-surpass-bitcoin-and-ethereum-cardano-founder/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Bullish-Sentiment-Around-Cardano-as-Vasil-Hard-Fork-Creeps-Closer.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bullish Sentiment Around Cardano as Vasil Hard Fork Creeps Closer\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Bullish-Sentiment-Around-Cardano-as-Vasil-Hard-Fork-Creeps-Closer.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Bullish-Sentiment-Around-Cardano-as-Vasil-Hard-Fork-Creeps-Closer-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Bullish-Sentiment-Around-Cardano-as-Vasil-Hard-Fork-Creeps-Closer-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Bullish-Sentiment-Around-Cardano-as-Vasil-Hard-Fork-Creeps-Closer-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Bullish-Sentiment-Around-Cardano-as-Vasil-Hard-Fork-Creeps-Closer-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Charles Hoskinson, Cardano founder, predicts that the blockchain platfoFrm’s cryptocurrency, ADA, will surpass Bitcoin and Ethereum to become the biggest cryptocurrency in the world. Hoskinson predicted the Rare Evo blockchain event and said his product is currently the number one blockchain in development activity. Hoskinson told the listening audience at the blockchain event that Cardano’s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/cardano-will-surpass-bitcoin-and-ethereum-cardano-founder/\">Cardano Will Surpass Bitcoin and Ethereum: Cardano Founder</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]