[
  {
    "source": "Decrypt",
    "date": "2023-12-20T23:17:03.000Z",
    "title": "Every Game on Ethereum Scaler Immutable in the Epic Games Store",
    "url": "https://decrypt.co/208341/all-games-ethereum-scaler-immutable-epic-games-store",
    "description": "UPDATE: Gods Unchained is back in action after being relisted. Here are the Immutable games that you'll find on the Epic Games Store."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-12-20T23:28:00.000Z",
    "title": "Crypto Trader Turns $454 into $2.19 Million Trading Avalanche-Based Memecoin",
    "url": "https://www.cryptoglobe.com/latest/2023/12/crypto-trader-turns-454-into-2-19-million-trading-avalanche-based-memecoin/",
    "description": "A cryptocurrency trader has managed to turn just $454 into a $2.19 million fortune by trading the Avalanche-based meme-inspired cryptocurrency Coq Inu ($COQ), a hen-themed token that has seen its price surge over 170% in a week. According to blockchain analysis service Lookonchain, the trader managed to make his 4827x gains in just two weeks […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-20T23:30:49.000Z",
    "title": "Judge Kaplan Rejects Bankman-Fried’s Request for Sentencing Delay, Affirms March 2024 Date",
    "url": "https://news.bitcoin.com/judge-kaplan-rejects-bankman-frieds-request-for-sentencing-delay-affirms-march-2024-date/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/sbfrs-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Judge Kaplan Rejects Bankman-Fried&#039;s Request for Sentencing Delay, Affirms March 2024 Date\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/sbfrs-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/sbfrs-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/sbfrs-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/sbfrs-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/sbfrs-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/sbfrs-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/sbfrs.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a recent development in the high-profile case of Sam Bankman-Fried, the founder of the now-defunct crypto exchange FTX, a request for postponement of the sentencing hearing was firmly denied by U.S. District Judge Lewis Kaplan. Bankman-Fried&#8217;s legal team had sought a four to six-week adjournment, citing the need for additional preparation time. However, the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-20T23:30:46.000Z",
    "title": "Ledger Commits To Full Restitution For Victims Of $600,000 ConnectKit Attack",
    "url": "https://www.newsbtc.com/news/ledger-commits-to-full-restitution-for-victims-of-600000-connectkit-attack/",
    "description": "Hardware wallet manufacturer Ledger has responded to a recent security breach resulting in the theft of $600,000 worth of user assets.  The company has pledged to enhance its security protocols by eliminating Blind Signing, a process where transactions are displayed in code rather than plain language, by June 2024. Ledger Takes Responsibility For ConnectKit Attack In a statement, Ledger emphasized its focus on addressing the recent security incident and preventing similar occurrences in the future.  The company acknowledged the approximately $600,000 in assets that were impacted by the ConnectKit attack, particularly affecting users blind signing on Ethereum Virtual Machine (EVM) decentralized applications (dApps).  Furthermore, Ledger pledged to make sure affected victims are fully compensated, including non-Ledger customers, with CEO &#38; Chairman Pascal Gauthier personally overseeing the restitution process.  Related Reading: Solana Q4 Triumph: Soaring Activity Leaves Ethereum In The Dust – Report According to the statement, Ledger has already initiated contact with affected users and is actively working with them to resolve their specific cases. In addition, by June 2024, blind signing will no longer be supported on Ledger devices, contributing to a &#8220;new standard of user protection&#8221; and advocating for &#8220;Clear Signing,&#8221; which refers to a process that allows users to verify transactions on their Ledger devices before signing them across dApps. On this matter, Ledger’s CEO Pascal Gauthier stated:  My personal commitment: Ledger will dedicate as much internal and external resources as possible to help the affected individuals recover their assets. Heightened dApp Security Measures According to an incident report released by the hardware wallet manufacturer, the attack exploited the Ledger Connect Kit, injecting malicious code into dApps utilizing the kit.  This malicious code redirected assets to the attacker&#8217;s wallets, tricking EVM dApp users into “unknowingly signing transactions” that drained their wallets.  Ledger addressed the attack by deploying a genuine fix for the Connect Kit within 40 minutes of detection. The compromised code remained accessible for a limited time due to the nature of content delivery networks (CDNs) and caching mechanisms. Ledger acknowledged the risks faced by the entire industry in safeguarding users and emphasized the need to continually raise the bar for security in dApps.  The company plans to strengthen its access controls, conduct audits of internal and external tools, reinforce code signing, and improve infrastructure monitoring and alerting systems.  Related Reading: Dogecoin Price In Trouble: Whale Transfers 85 Million DOGE To Robinhood Additionally, Ledger will educate users on the importance of Clear Signing and the potential risks associated with blind signing transactions without a secure display. Notably, with Clear Signing, users are presented with a clear and readable representation of the transaction details, enabling them to review and validate the transaction before providing their signature.  This added layer of transparency and verification helps users mitigate the risks associated with front-end attacks or malicious code injected into decentralized applications Featured image from Shutterstock, chart from TradingView.com"
  }
]