[
  {
    "source": "Cointelegraph",
    "date": "2023-10-28T01:58:03.000Z",
    "title": "Wall Street Journal corrects article misciting Hamas' crypto terrorism funding data",
    "url": "http://cointelegraph.com/news/wall-street-journal-corrects-article-misciting-hamas-crypto-terrorism-funding-data",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/012f935e-6457-4963-a743-406b2278e281.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Elliptic, the firm which Wall Street Journal sourced the data from, said it was “pleased” to see the news outlet acknowledge its mistakes. </p>\n                    <p><p>The Wall Street Journal (WSJ) has partially corrected an article which mischaracterized the extent to which Hamas and other militant groups have been funding its terrorism activities with cryptocurrencies.</p><p>The Oct. 10 article — titled “Hamas Militants Behind Israel Attack Raised Millions in Crypto” — cited blockchain forensics firm Elliptic to say Palestinian Islamic Jihad (PIJ), a terrorist organization operating on the Gaza Strip, raised as much as $93 million between August 2021 and June 2023.</p><p>In the cited report, Elliptic said Israel’s counter-terrorism unit seized PIJ-linked wallets which received $93 million from over that timeframe. However, Elliptic made it clear that this in <a href=\"https://cointelegraph.com/news/crypto-donations-hamas-misinterpreted-wsj-warren-elliptic\">no way meant that PIJ raised these funds to finance its terrorism activities.</a> </p><p>Research from blockchain forensics firm Chainalysis suggests only $450,000 of these funds were sent to a known terrorism-affiliated wallet.</p><p>In WSJ’s correction, it stated PIJ and Lebanese political party Hezbollah “may have exchanged” up to $12 million — far less than its initial $93 million figure.</p><p>“Palestinian Islamic Jihad and Hezbollah may have exchanged up to $12 million in crypto since 2021, according to crypto-research firm Elliptic. An earlier version of this article incorrectly said PIJ had sent more than $12 million in crypto to Hezbollah since 2021,” WSJ said.</p><p>WSJ said it updated other parts of the article to include “additional context” about Elliptic’s research.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/b202318b-e07d-4fa5-9bbf-fcfdb5a56217.png\"  /><figcaption style=\"text-align: center;\"><em>Corrections made by the WSJ’s Oct. 10 article. Source: WSJ</em></figcaption></figure><p>WSJ’s retraction follows an Oct. 25 statement by Elliptic which called on WSJ to correct its misinterpretation of the data. Elliptic added that cryptocurrency funding by Hamas remains “tiny” relative to other funding sources.</p><p>On Oct. 27, Elliptic was “pleased” to see WSJ acknowledge its mistakes but said it would've liked to see WSJ be more specific about its corrections.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We&#39;re pleased to see the Wall Street Journal issue some corrections to their article based on our feedback. While we would like to have seen them go further, we will continue to engage constructively.</p>&mdash; Elliptic (@elliptic) <a href=\"https://twitter.com/elliptic/status/1717999550663631226?ref_src=twsrc%5Etfw\">October 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/elizabeth-warren-uses-hamas-scapegoat-war-on-crypto\"><strong><em>Elizabeth Warren uses Hamas as her newest scapegoat in war on crypto </em></strong></a></p><p>Coinbase's chief legal officer Paul Grewal also noted that WSJ's opening paragraph is still framed as though cryptocurrency was the primary funding source behind Hamas' Oct. 7 attack on Israel.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">2/ <a href=\"https://twitter.com/WSJ?ref_src=twsrc%5Etfw\">@WSJ</a>&#39;s lede still maintains that the funding supported Hamas attacks hinged on “One answer: cryptocurrency.” There&#39;s no evidence of that, and WSJ knows it. <a href=\"https://t.co/BQK80b1jMd\">pic.twitter.com/BQK80b1jMd</a></p>&mdash; paulgrewal.eth (@iampaulgrewal) <a href=\"https://twitter.com/iampaulgrewal/status/1718029898718347284?ref_src=twsrc%5Etfw\">October 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>\"This is barely a correction,\" he added.</p><p>Nic Carter, partner of Castle Island Ventures and others are now calling on United States Senator Elizabeth Warren to retract a related letter backed by over 100 U.S. lawmakers written <a href=\"https://cointelegraph.com/news/crypto-advocacy-groups-rebuttal-links-terrorism\"> to the White House</a> on Oct. 17.</p><p>The letter cited WSJ’s misinterpreted data from Elliptic in an attempt to argue that cryptocurrency poses a “national security threat” to the U.S. and that Congress and the Biden administration should act swiftly before cryptocurrencies are used to finance another “tragedy.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Liz Warren wyd? <a href=\"https://t.co/e0Ew2TQzRb\">pic.twitter.com/e0Ew2TQzRb</a></p>&mdash; nic  carter (@nic__carter) <a href=\"https://twitter.com/nic__carter/status/1718000416837804426?ref_src=twsrc%5Etfw\">October 27, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/us-enforcement-agencies-turning-up-heat-crypto-related-crime/\"><strong><em>US enforcement agencies are turning up the heat on crypto-related crime</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-28T02:00:00.000Z",
    "title": "Analyst’s $XRP Price Prediction Points to 1,000% Surge to $6 Next Year",
    "url": "https://www.cryptoglobe.com/latest/2023/10/analysts-xrp-price-prediction-points-to-1000-surge-to-6-next-year/",
    "description": "The recent cryptocurrency market recovery that saw the price of the flagship cryptocurrency Bitcoin reach a 16-month high has increased bullish sentiment in the sector, with one analyst now suggesting XRP’s price could explode over 1,000% in the future. In a post shared on the microblogging platform X (formerly known as Twitter), the popular analyst […]\n"
  }
]