[
  {
    "source": "CoinDesk",
    "date": "2023-06-12T10:01:54.000Z",
    "title": "SEC Crypto Crackdown Adds Urgency for U.S. Lawmakers to Produce Regulatory Framework This Year: JPMorgan",
    "url": "https://www.coindesk.com/policy/2023/06/12/sec-crypto-crackdown-adds-urgency-for-us-lawmakers-to-produce-regulatory-framework-this-year-jpmorgan/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Without a more solid legal framework, cryptocurrency activity will probably continue moving outside the U.S. and into decentralized entities, the report said."
  },
  {
    "source": "CoinDesk",
    "date": "2023-06-12T09:52:24.000Z",
    "title": "Curve Finance Founder Deposits $24M CRV into Aave to Safeguard $65M Stablecoin Loan",
    "url": "https://www.coindesk.com/business/2023/06/12/curve-finance-founder-deposits-24m-crv-into-aave-to-safeguard-65m-stablecoin-loan/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Curve Finance founder Michael Egorov has deposited $24 million worth of Curve DAO (CRV) tokens to decentralized lending platform Aave to mitigate against liquidation risk on a $65 million stablecoin loan."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-12T09:54:24.000Z",
    "title": "Andreessen Horowitz To Open Crypto Office in London",
    "url": "https://cryptodaily.co.uk/2023/06/andreessen-horowitz-to-open-crypto-office-in-london",
    "description": "<p>Silicon Valley-based venture capital firm Andreessen Horowitz will open its first international office in London. The firm cites the UK&rsquo;s welcoming crypto climate. </p>\n<p>The crypto investment arm of venture capital firm Andreessen Horowitz, a16z, announced it would be opening its first overseas office in London. The firm celebrated the UK&rsquo;s welcoming embrace of the crypto industry as the motivating factor behind its decision. Under the leadership of Prime Minister Rishi Sunak, the UK has established a warm climate for crypto companies as the industry battles regulatory confusion from the US.</p>\n\n<p dir=\"ltr\" lang=\"en\">Big news to share: @a16z is expanding to the UK 🇬🇧We plan to open our first international office in London later this year, and will host the next Crypto Startup School there in 2024.Why the UK? 👇https://t.co/PQ7GuNEn77</p>\n&mdash; cdixon.eth (@cdixon) June 11, 2023\n<p>\n\n</p>\n<p>Bloomberg reports the new office will open later this year and will be led by Sriram Krishnan, one of the firm&rsquo;s general partners. &nbsp;</p>\n<p>a16z said in a statement:</p>\n\n<p>While there is still work to be done, we believe that the UK is on the right path to becoming a leader in crypto regulation. The UK also has deep pools of talent, world-leading academic institutions, and a strong entrepreneurial culture.</p>\n<p>It is home to more &ldquo;unicorns&rdquo; than Germany, France, and Sweden combined; to some of the world&rsquo;s largest financial markets and pools of capital; and to highly-sophisticated, world-class regulators. All of these make the UK strongly positioned to lead in web3.</p>\n\n<p>Prime Minister Sunak welcomed the firm&rsquo;s decision and underscored the UK&rsquo;s commitment to establishing the country as the &ldquo;world&rsquo;s Web3 centre.&rdquo;</p>\n\n<p>&ldquo;As we cement the UK&rsquo;s place as a science and tech superpower, we must embrace new innovations like Web3, powered by blockchain technology, which will enable start-ups to flourish here and grow the economy.&rdquo;</p>\n\nCrypto Firms Are Being Driven Offshore\n<p>The US SEC recently launched severe regulatory action against two of the largest cryptocurrency exchanges. On June 5, the agency filed suit against Binance and its CEO, Changpeng Zhao, for alleged securities violations. The following day, the agency filed a similar case against Coinbase. It charged the exchange with &ldquo;the unregistered offer and sale of securities in connection with its staking-as-a-service program.&rdquo;</p>\n<p>The US&rsquo;s aggressive approach led the market to spiral, with major altcoins seeing double-digit losses.</p>\nUK&rsquo;s Regulatory Approach\n<p>Recognising the need for regulatory guidance, crypto firms such as Coinbase have long asked the US to provide clarity regarding crypto assets. The US has, however, been reluctant to comply, which only creates further tension in the industry.</p>\n<p>Crypto firms have, therefore, been testing the waters in other countries where guidance has been offered.</p>\n<p>When Prime Minister Sunak was still Chancellor of the Exchequer, he made it clear that he would guide the UK into becoming a safe space for digital assets where innovation and industry development are encouraged. While the UK has been lagging in regulatory guidance compared to the European Union, it has recently published several planned regulations.</p>\n<p>The UK Treasury Committee released a report in May advising the government to regulate retail crypto trading not as financial assets but as gambling instruments. The Committee said that unbacked mainstream crypto assets and their inherent volatility pose a risk to investors and threaten economic stability.</p>\n<p>Last week, the Financial Conduct Authority (FCA) released a set of crypto marketing rules that take effect on October 8.</p>\n<p>Under its stricter marketing guidelines, the agency banned incentive bonuses, free NFTs and airdrops for promotional purposes and introduced a &ldquo;cooling-off&rdquo; period for first-time crypto buyers.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T09:51:17.000Z",
    "title": "Tezos Price Prediction 2023-2032: How High can XTZ Rise?",
    "url": "https://www.cryptopolitan.com/tezos-price-prediction/",
    "description": "Tezos Price Prediction 2023-2032 Tezos coin has been making waves in the crypto world. Given the attention that the Tezos network is commanding in the crypto market, and if you are curious about the XTZ coin, Tezos Price Prediction is right up your alley. Where is XTZ now? Project management has made impactful decisions to ... <a title=\"Tezos Price Prediction 2023-2032: How High can XTZ Rise?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tezos-price-prediction/\" aria-label=\"More on Tezos Price Prediction 2023-2032: How High can XTZ Rise?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-12T09:40:56.000Z",
    "title": "Recent SEC filing marks 67 altcoins as securities ",
    "url": "https://crypto.news/recent-sec-filing-marks-67-altcoins-as-securities/",
    "description": "The number of coins regarded as securities by the US Securities and Exchange Commission (SEC) is now 67, with a total market value of $100 billion.  The US SEC has now labeled 67 coins as securities following the lawsuits against&#8230;"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-12T09:51:34.000Z",
    "title": "Bitcoin and Altcoins Report – June Week 2",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/bitcoin-and-altcoins-report-june-week-2/",
    "description": "<p>The cryptocurrency industry is in turbulent waters as the U.S. SEC strengthens its control, initiating legal proceedings against prominent crypto exchanges Coinbase and Binance. But despite facing regulatory obstacles and liquidity concerns, Bitcoin demonstrates remarkable resilience. What an eventful week! U.S. regulators have intensified their efforts against Bitcoin, targeting major cryptocurrency exchanges and classifying several [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/cryptocurrency-news/bitcoin-and-altcoins-report-june-week-2/\">Bitcoin and Altcoins Report – June Week 2</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-12T10:05:31.000Z",
    "title": "Why PEPE May Need More Demand at $0.00000088 Before a Rally",
    "url": "https://coinedition.com/why-pepe-may-need-more-demand-at-0-00000088-before-a-rally/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Pepe8-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Pepe8-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Pepe8-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Pepe8.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>MN Trading Group CEO and crypto analyst Michaël van de Poppe said PEPE could rally gains while highlighting different target points. Van de Poppe, who shared this opinion on Twitter, noted that respite would follow because the meme had “swept the lows” again. Over the last 30 days, PEPE has found it difficult to sustain [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/why-pepe-may-need-more-demand-at-0-00000088-before-a-rally/\">Why PEPE May Need More Demand at $0.00000088 Before a Rally</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]