[
  {
    "source": "Crypto Daily",
    "date": "2023-10-17T05:14:30.000Z",
    "title": "Uniswap To Begin Charging 0.15% Swap Fees",
    "url": "https://cryptodaily.co.uk/2023/10/uniswap-to-begin-charging-015-swap-fees",
    "description": "The move marks a shift from the platform's previous no-fee structure."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-17T05:30:03.000Z",
    "title": "Bankman-Fried Lawyers Claim He’s Not Getting Enough Adderall",
    "url": "https://news.bitcoin.com/bankman-fried-lawyers-claim-hes-not-getting-enough-adderall/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/sbfpills-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bankman-Fried Lawyers Claim He&#039;s Not Getting Enough Adderall\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/sbfpills-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/sbfpills-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/sbfpills-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/sbfpills-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/sbfpills-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/sbfpills-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/sbfpills.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Attorneys for FTX founder Sam Bankman-Fried say he&#8217;s having trouble focusing during his criminal trial because he&#8217;s not getting his prescribed dose of Adderall each day. In a letter to the judge Sunday, lawyers said Bankman-Fried has gone without his medication most of the day, leaving him unable to concentrate as the defense prepares to [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-17T05:18:08.000Z",
    "title": "XRP Price Prediction – Chances Of Steep Decline If It Closes Below This Level",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-prediction-steep-decline-0-488/",
    "description": "XRP price is attempting a fresh increase from $0.4730 against the US Dollar. The price could climb toward $0.5320 unless there is a downside break below $0.4880. XRP is struggling to gain pace above the $0.5065 resistance against the US dollar. The price is now trading below $0.500 and the 100 simple moving average (4 hours). There was a break above a major bearish trend line with resistance near $0.4915 on the 4-hour chart of the XRP/USD pair (data source from Kraken). The pair might continue to move down if it breaks the $0.4880 support zone. XRP Price Eyes Recovery After a steady decline, XRP found support near the $0.4730 zone. The price started a recovery wave above the $0.480 level, like Bitcoin and Ethereum. There was a move above the $0.4880 resistance. The bulls pushed it above the 23.6% Fib retracement level of the main drop from the $0.5510 swing high to the $0.4730 low. Besides, there was a break above a major bearish trend line with resistance near $0.4915 on the 4-hour chart of the XRP/USD pair. However, the bears remained active above the $0.500 resistance zone. The price is now trading below $0.500 and the 100 simple moving average (4 hours). On the upside, immediate resistance is near the $0.500 level. The first major resistance is near the $0.5065 level and the 100 simple moving average (4 hours) or the 50% Fib retracement level of the main drop from the $0.5510 swing high to the $0.4730 low. Source: XRPUSD on TradingView.com A close above the $0.5065 level could send the price toward the $0.521 resistance. A successful break above the $0.521 resistance level might start a strong increase toward the $0.550 resistance. Any more gains might send XRP toward the $0.585 resistance. More Losses? If XRP fails to clear the $0.5065 resistance zone, it could continue to move down. Initial support on the downside is near the $0.488 zone. The next major support is at $0.4730. If there is a downside break and a close below the $0.4730 level, XRP price might accelerate lower. In the stated case, the price could retest the $0.4320 support zone. Technical Indicators 4-Hours MACD – The MACD for XRP/USD is now losing pace in the bullish zone. 4-Hours RSI (Relative Strength Index) – The RSI for XRP/USD is now above the 50 level. Major Support Levels – $0.488, $0.473, and $0.432. Major Resistance Levels – $0.5065, $0.5210, and $0.550."
  }
]