[
  {
    "source": "CoinDesk",
    "date": "2024-02-28T20:54:17.000Z",
    "title": "Coinbase Made an Arbitration Case to the U.S. Supreme Court – Again",
    "url": "https://www.coindesk.com/policy/2024/02/28/coinbase-made-an-arbitration-case-to-the-us-supreme-court-again/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Crypto exchange Coinbase again led a legal charge on the ins and outs of arbitration in the U.S. Supreme Court on Wednesday. The latest case isn't about digital assets, directly, but it may be important for every modern consumer who buys, registers or contracts for a product or service – and for the businesses trying to stay out of court."
  },
  {
    "source": "CoinDesk",
    "date": "2024-02-28T20:48:59.000Z",
    "title": "BlackRock Bitcoin ETF Breaks Volume Record as Bitcoin Rallies to $64K Before Plunging",
    "url": "https://www.coindesk.com/markets/2024/02/28/blackrock-bitcoin-etf-breaks-volume-record-as-bitcoin-rallies-to-64k-before-plunging/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "U.S. spot bitcoin {{BTC}} exchange-traded funds (ETF) experienced another massive trading session Wednesday with BlackRock's bitcoin ETF (IBIT) breaking its volume record for the third consecutive day."
  },
  {
    "source": "Decrypt",
    "date": "2024-02-28T20:54:35.000Z",
    "title": "Trump's Ethereum Meme Coin Holdings Hit $4 Million—Will He Dump TRUMP?",
    "url": "https://decrypt.co/219489/trump-ethereum-meme-coin-holdings-4-million",
    "description": "The Ethereum wallet tied to ex-president Donald Trump holds almost $4 million in MAGA (TRUMP) tokens. Will he hold?"
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-28T20:41:36.000Z",
    "title": " Nigerian central bank head criticizes Binance, execs reportedly arrested ",
    "url": "https://cointelegraph.com/news/nigerian-central-bank-head-criticizes-binance-execs-reportedly-arrested",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvZmRiZDM0NWEtM2E1ZC00ZDAyLTk1OWYtMjc0MTY5OWM0ZmMzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Crypto exchanges have been suspected of destabilizing the Nigerian naira fiat, but the country’s top central banker said Binance moved billions from unidentified users in 2023.</p>\n                    <p><p>Binance is facing more scrutiny in Nigeria, the governor of the Central Bank of Nigeria (CBN) told reporters on Feb. 27 about “suspicious flows” of funds through Binance Nigeria in 2023. The country’s Securities and Exchange Commission and other government agencies are already eying the crypto currency exchange with suspicion.</p><p>CBN head Olayemi Cardoso said crypto exchanges in Nigeria are under suspicion. “We are concerned that certain practices go on that indicate illicit flows going through a number of these entities, suspicious flows at best,” he <a href=\"https://nairametrics.com/2024/02/27/26-billion-passed-through-binance-nigeria-cardoso/\" target=\"_blank\" rel=\"noopener nofollow\">told</a> the local press on Feb. 27. He said: </p><p>“There’s a lot that is going on now as a result of collaboration between the different agencies, which includes EFCC [Economic and Financial Crimes Commission], the police, and of course, the office of the NSA [National Security Adviser],” he added.</p><p><a href=\"https://cointelegraph.com/news/nigerian-central-bank-head-criticizes-binance-execs-reportedly-arrested\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-28T21:05:52.000Z",
    "title": "Former FTX employees launch new crypto exchange",
    "url": "https://www.cryptopolitan.com/former-ftx-employees-launch-exchange-backpack/",
    "description": "A group of former employees from FTX and Alameda Research has successfully raised $17 million to launch a cryptocurrency exchange called Backpack, according to a Bloomberg report. Based in Dubai, Backpack extends beyond a traditional exchange to offer a crypto wallet and an NFT collection named Mad Lads, achieving a valuation of $120 million in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-28T20:47:08.000Z",
    "title": "Bitcoin development takes center stage as investors flock to ETFs",
    "url": "https://www.cryptopolitan.com/bitcoin-development-takes-center-stage/",
    "description": "Bitcoin, the pioneering cryptocurrency, is experiencing a resurgence in both market value and developmental activity. Amidst a powerful rally, Bitcoin is poised for a sixth consecutive monthly gain, marking its longest streak in three years. With a staggering market capitalization of $1.12 trillion, Bitcoin commands approximately half of the total cryptocurrency market value, solidifying its [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-28T21:00:29.000Z",
    "title": "Analyst Labels Bitcoin Rally Strongest Pre-Bull Cycle Yet",
    "url": "https://www.newsbtc.com/bitcoin-news/analyst-labels-bitcoin-rally-strongest-pre-bull-cycle-yet/",
    "description": "The entire cryptocurrency space is fueled with excitement as the price of Bitcoin rallied today, demonstrating immense resilience, reaching the $59,000 threshold and even further in the past 26 months. Bitcoin Rally Kicks Off The Strongest Pre-Bull Cycle So Far Bitcoin is currently in the limelight as the crypto asset continues to rally, leading to several analysts identifying the surge as the start of the &#8220;biggest bull cycle ever.&#8221; Analyst and trader Crypto Jelle has labeled the recent uptick as the &#8220;strongest start to a new cycle&#8221; as his analysis examines the strength of BTC&#8216;s surge. Related Reading: Bitcoin Fast Approaching $60,000 As BTC F&#38;G Index Hits ‘Extreme Greed’ – Details Jelle claims this resulted from Bitcoin&#8217;s latest &#8220;break out from the 0.618 Fibonacci retracement.&#8221; According to the analyst, &#8220;this marks the first time&#8221; the asset has made this kind of move &#8220;before the Bitcoin Halving event happens.&#8221; He also claims that with the ongoing rally, it seems like the market is &#8220;in for a new regime,&#8221; he believes things will play out &#8220;differently&#8221; in the market from how they usually do. The post read: This is the first time Bitcoin breaks that 0.618 Fibonacci retracements before the halving event even takes place. By far the strongest start to a new cycle, ever. Looks like we are in for a new regime, where things work a little different than how they used to. The analyst claims that a shift in the narrative is ushering in a &#8220;new era of dynamics in the cryptocurrency landscape.&#8221; As a result, &#8220;exciting moments await&#8221; the space in the future. Crypto Jelle declared that nothing can stop Bitcoin at the moment. &#8220;With BTC rising by another 2% in the past few hours, there seems to be no stopping it right now,&#8221; he stated. Additionally, most of yesterday&#8217;s gains occurred outside the Exchange-Traded Funds&#8217; trading hours. However, the analyst is waiting to see if they will &#8220;force boomers to pursue price.&#8221; BTC ETFs See Massive Inflow Research company BitMEX reported that Bitcoin Spot ETFs have seen increased adoption, witnessing a massive surge in daily inflow. Data from the platform shows that ETFs have witnessed a significant inflow of 10,167 BTC valued at $576.8 million. Related Reading: Bitcoin Spot ETFs: Issuers Set New Record As Weekly Inflows Cross $2.2 Billion BitMEX underscored that Blackrock&#8217;s iShares BTC ETF (IBIT) made up $520 million of the total inflow. Consequently, this marks the highest inflow the company has seen since the products were approved.  So far, Blackrock&#8217;s asset holdings have risen to over 141,000 BTC, and its net inflow sits above $6.5 billion. Currently, Bitcoin is trading at $59,254, indicating a rise of over 4% in the past 24 hours.  Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-28T20:55:35.000Z",
    "title": "Sergey Nazarov Says Bitcoin ETFs ‘Just The Beginning’ Before Banks Launch Massive Tokenization Campaign",
    "url": "https://dailyhodl.com/2024/02/28/sergey-nazarov-says-bitcoin-etfs-just-the-beginning-before-banks-launch-massive-tokenization-campaign/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/Chainlink-Bounces-Nearly.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/Chainlink-Bounces-Nearly.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/Chainlink-Bounces-Nearly.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/Chainlink-Bounces-Nearly.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/Chainlink-Bounces-Nearly.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/Chainlink-Bounces-Nearly.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/Chainlink-Bounces-Nearly.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Chainlink (LINK) creator Sergey Nazarov says the recent launch of spot Bitcoin (BTC) exchange-traded funds (ETFs) is a &#8220;watershed moment&#8221; for the industry as it could mark the beginning of a massive influx of capital from global finance. In a new interview on Bloomberg Television, Nazarov says the &#8220;net new buyers&#8221; of the current crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/28/sergey-nazarov-says-bitcoin-etfs-just-the-beginning-before-banks-launch-massive-tokenization-campaign/\">Sergey Nazarov Says Bitcoin ETFs ‘Just The Beginning’ Before Banks Launch Massive Tokenization Campaign</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]