[
  {
    "source": "CoinDesk",
    "date": "2023-09-13T10:20:05.000Z",
    "title": "Ripple Will do 80% of its Hiring This Year Outside the U.S: Bloomberg",
    "url": "https://www.coindesk.com/business/2023/09/13/ripple-will-do-80-of-its-hiring-this-year-outside-the-us-bloomberg/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Brad Garlinghouse said the firm will look into hiring in countries where there is regulatory clarity."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-13T10:30:45.000Z",
    "title": "Crypto Exchange CoinEx Shuts Down Withdrawals Following Suspected Hack of $27M",
    "url": "https://decrypt.co/156173/crypto-exchange-coinex-shuts-down-withdrawals-following-suspected-hack-of-27m",
    "description": "The exchange identified a number of suspicious wallets draining funds from the platform in \"anomalous withdrawals.\""
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-13T10:32:32.000Z",
    "title": "Opera browser debuts stablecoin wallet MiniPay in Africa ",
    "url": "https://cointelegraph.com/news/opera-browser-stablecoin-wallet-africa",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/bf969806-f7ba-4ca1-a484-325155a2e307.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Opera’s new in-browser, non-custodial wallet runs on the Celo blockchain and targets the platform’s user base in Africa for P2P stablecoin transactions.  </p>\n                    <p><p>The web platform Opera revealed its plans to launch a non-custodial stablecoin wallet integrated into its mobile web browser which will be made available to its user base in Africa. </p><p>On Sept. 13, the web services provider introduced the MiniPay wallet integration, built on the Celo blockchain, that allows users in Africa to send or receive stablecoins by using their already existing mobile numbers. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Exciting news live from <a href=\"https://twitter.com/dappcon_berlin?ref_src=twsrc%5Etfw\">@dappcon_berlin</a>&#39;s mainstage! cc: <a href=\"https://twitter.com/RegenRene?ref_src=twsrc%5Etfw\">@RegenRene</a> <a href=\"https://twitter.com/jorgenarnesen?ref_src=twsrc%5Etfw\">@jorgenarnesen</a> <a href=\"https://twitter.com/afishinparis?ref_src=twsrc%5Etfw\">@afishinparis</a> Charles Hamel &amp; Rosette Belesi.<br><br>It&#39;s finally here! We&#39;ve partnered with global web innovator <a href=\"https://twitter.com/opera?ref_src=twsrc%5Etfw\">@Opera</a> to launch <a href=\"https://twitter.com/minipay?ref_src=twsrc%5Etfw\">@MiniPay</a>––a first-of-its-kind stablecoin wallet built on Celo to onboard… <a href=\"https://t.co/sEUp0yCKQe\">pic.twitter.com/sEUp0yCKQe</a></p>&mdash; Celo   (@CeloOrg) <a href=\"https://twitter.com/CeloOrg/status/1701873293869957194?ref_src=twsrc%5Etfw\">September 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Opera began its operations in Africa 17 years prior and now has over 100 million users on the continent. The launch of MiniPay will begin in the coming months and first start in Nigeria. </p><p>Jørgen Arnesen, the executive vice president for mobile at Opera, commented that:</p><blockquote>“Users in Nigeria, Kenya, Ghana, and South Africa have indicated lingering concerns about high fees, unreliable service uptimes, a lack of transparency around transaction progress and a lack of access to mobile data.”</blockquote><p>The new MiniPay wallet will operate with sub-cent fees, and onboard and backup wallets through users’ Google credentials. </p><p>It also has integrated with local payment methods including Airtime and MPesa, along with traditional bank transfers to allow its users to add and withdraw stablecoins from the wallet into the local currency.</p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/google-chrome-launches-built-in-user-tracking-advertisers\"><strong><em>Google Chrome launches built-in user tracking for advertisers</em></strong></a></p><p>Celo also has a strong user base in Africa and says the integration “opens the door” for more Ethereum-compatible dApps to be built for MiniPay. </p><p>Cointelegraph reached out to both companies for further comment on the development. </p><p>In April of this year, Opera announced a new <a href=\"https://cointelegraph.com/news/opera-integrates-generative-ai-in-the-latest-browser-update\">generative artificial intelligence (AI) integration</a> into its then-latest browser update. The in-browser AI feature, called AI Prompt, gives users “contextual prompts” for web pages or highlighted text. </p><p>Last December, it launched a suite of security tools with the aim to protect users against “malicious Web3 actors.” </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-13T10:27:32.000Z",
    "title": "Crypto ahead in fintech investments in France and Germany in 2023: Report",
    "url": "https://cointelegraph.com/news/crypto-leads-2023-fintech-investments-france-germany",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/7377ba57-bcbd-4f96-a8d6-39b888e42399.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Europe experienced a 50% fall in fintech investments in the first half of 2023. </p>\n                    <p><p>In the midst of the global fintech market downturn, the crypto and blockchain sector managed to become a leader in investments in a number of major European markets. </p><p>According to the report “State of European FinTech”, <a href=\"https://cms.finchcapital.com/uploads/State_of_European_Fin_Tech_2023_v_F_a159116d31.pdf?updated_at=2023-09-11T18:05:13.320Z\" target=\"_blank\" rel=\"noopener nofollow\">released</a> by the Amsterdam-based fintech venture fund Finch Capital, Europe, Middle East and Africa (EMEA) region experienced a 50% drop in fintech investments in the first half of 2023. The total amount of funding fell from $27.3 billion in H1 2022 to $11.2 billion in H1 2023. </p><p>However, crypto businesses stand out in the overall picture, gaining a leading position in investments attracted across several large markets. In the United Kingdom, the blockchain and crypto sector grabbed a 28% share of all the deals, struck in fintech in H1 2023. This number is even higher in the Netherlands — 35% of all deals. In Germany and France, the crypto’s share constitutes 27% and 29% respectively. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/crypto-venture-capital-exec-says-lack-innovation-drives-funding-away-from-crypto\"><strong><em>Venture capital exec says ‘lack of innovation’ drives funding away from crypto</em></strong></a></p><p>The main competitor of crypto is the lending sector, which appeared to be the leader in market share in Ireland and overall across the region in terms of deal volume. </p><p>Despite the bearish tendencies in fintech as a whole, the interest of investors in the digital economy appears solid. According to another recent report, 24% of asset management firms <a href=\"https://cointelegraph.com/news/investment-firms-senior-roles-digital-assets\">have adopted a digital assets strategy</a>, with an extra 13% planning to do so in the next two years. </p><p>Moreover, some crypto companies still report significant gains. For example, European digital asset manager CoinShares <a href=\"https://cointelegraph.com/news/european-digital-asset-manager-coinshares-revenue-up-q2\">revealed a total revenue</a> of 20.3 million pounds ($25.9 million) in Q2 2023, a 33% increase compared with the prior year’s quarter.</p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/6-questions-kei-oda-cryptocurrency/\"><strong><em>6 Questions for Kei Oda. From Goldman Sachs to cryptocurrency</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-13T10:20:20.000Z",
    "title": "Adobe, IBM, Nvidia join US President Biden's efforts to prevent AI misuse",
    "url": "https://cointelegraph.com/news/adobe-ibm-nvidia-join-biden-prevent-ai-misuse",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/5ae81a06-114e-4d33-a07f-e0f6f8ced388.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Adobe, IBM, Nvidia and five other companies have joined the initiative, unveiled in July, aimed at preventing the misuse of AI's capabilities for harmful purposes.</p>\n                    <p><p>Adobe, IBM, Nvidia and five other companies have endorsed U.S. President Joe Biden's voluntary <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/artificial-intelligence\">artificial intelligence (AI)</a> commitments, including watermarking AI-generated content. </p><p>This <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2023/09/12/fact-sheet-biden-harris-administration-secures-voluntary-commitments-from-eight-additional-artificial-intelligence-companies-to-manage-the-risks-posed-by-ai/\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a> was made by the White House on Tuesday, Sept 12. The White House Chief of Staff, Jeff Zients, emphasized the urgency of leveraging AI's advantages, mitigating its risks and rapid action, stating, \"We're collaborating with the private sector and utilizing every available resource to achieve this goal.\" Additionally, Palantir, Stability, Salesforce, Scale AI, and Cohere have also joined the commitments.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/1731515e-2b0a-48fd-953d-93596fc641a0.JPG\"  /><figcaption style=\"text-align: center;\"><em>Screenshot of the statement release   Source: The White House.</em></figcaption></figure><p>The initial commitments, unveiled in July,<a href=\"https://cointelegraph.com/news/ai-companies-commit-safe-and-transparent-ai-white-house-reports\"> aimed to prevent the misuse of AI's capabilities</a> for harmful purposes. Google, OpenAI, and Microsoft, a partner of OpenAI, endorsed these commitments during the same month.</p><p>The private commitments endorsed by the Biden administration are viewed as a temporary measure, as discussions within Congress regarding potential AI legislation have been ongoing but with little concrete progress in terms of introduced bills or substantial legal changes. Concurrently, the White House is actively developing an executive order related to AI.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/gary-gensler-confirms-sec-ai-financial-surveillance\"><strong><em>Gary Gensler confirms SEC’s use of AI for financial surveillance</em></strong></a></p><p>In June 2023, a bipartisan group of U.S. lawmakers <a href=\"https://cointelegraph.com/news/us-lawmakers-introduce-national-ai-commission-act\">introduced a bill aiming to establish an AI commission</a> to tackle issues in the swiftly expanding sector. The Biden Administration has stated its commitment to working alongside international allies such as Australia, Canada, France, Germany, India, Israel, Italy, Japan, Nigeria, the Philippines, and the United Kingdom in the formation of a global framework for AI.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-travel-booking-bad-3-weird-uses-chatgpt-crypto-plugins/\"><strong><em>AI Eye: AI travel booking hilariously bad, 3 weird uses for ChatGPT, crypto plugins</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-13T10:42:01.000Z",
    "title": "Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?",
    "url": "https://www.cryptopolitan.com/rollbit-price-prediction/",
    "description": "Rollbit coin price prediction 2023-2032 Rollbit has quickly become one of the most popular crypto casinos and trading platforms. Launched in 2019, Rollbit offers a wide range of gaming, sports betting, futures trading, and NFT options for users. With no KYC requirements and support for numerous cryptocurrencies, Rollbit provides an easy entry into the world ... <a title=\"Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/rollbit-price-prediction/\" aria-label=\"More on Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-13T10:29:29.000Z",
    "title": "Ripple CEO Warns: U.S. Becoming a Risky Place for Crypto Startups",
    "url": "https://www.cryptopolitan.com/ripple-ceo-us-risky-for-crypto-startups/",
    "description": "Ripple CEO Brad Garlinghouse recently expressed his concerns about the regulatory environment for cryptocurrency startups in the United States, asserting that it is currently one of the most challenging places to launch such ventures. Garlinghouse made these remarks during a panel discussion at Token 2049 in Singapore on September 12. In his comments, Garlinghouse recommended ... <a title=\"Ripple CEO Warns: U.S. Becoming a Risky Place for Crypto Startups\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ripple-ceo-us-risky-for-crypto-startups/\" aria-label=\"More on Ripple CEO Warns: U.S. Becoming a Risky Place for Crypto Startups\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-13T10:16:56.000Z",
    "title": "What Does an AI-Powered Coca-Cola Hold for Tomorrow’s Palate? A Year 3000 Vision",
    "url": "https://www.cryptopolitan.com/ai-powered-coca-cola-a-year-3000-vision/",
    "description": "In a bold move towards the future, Coca-Cola has launched a limited edition beverage, Coca‑Cola Y3000 Zero Sugar, harnessing the power of artificial intelligence (AI) and consumer perspectives to craft a unique taste and experience. This futuristic drink invites consumers to envision what the future holds, and it is set to tantalize taste buds in ... <a title=\"What Does an AI-Powered Coca-Cola Hold for Tomorrow&#8217;s Palate? A Year 3000 Vision\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-powered-coca-cola-a-year-3000-vision/\" aria-label=\"More on What Does an AI-Powered Coca-Cola Hold for Tomorrow&#8217;s Palate? A Year 3000 Vision\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-13T10:41:14.000Z",
    "title": "Hackers spam crypto exchanges with fake GALA tokens",
    "url": "https://crypto.news/hackers-spam-crypto-exchanges-with-fake-gala-tokens/",
    "description": "A recent GALA token contract address upgrade opened a loophole for hackers, targeting crypto exchanges with old tokens. Cryptocurrency exchanges are at risk of fake top-ups with old GALA tokens as the project&#8217;s recent upgrade generated a new contract address&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-13T10:30:07.000Z",
    "title": "Solana Potential Rebound: Can Bulls Hit Their $30 Target?",
    "url": "https://www.newsbtc.com/all/solana-potential-rebound-30-target-in-sight-according-to-charts/",
    "description": "The Solana (SOL) community has been closely monitoring the crypto&#8217;s price movements as it endures a relentless downward trend. Notably, this corrective phase has adhered to a distinct pattern, encapsulated within two converging trendlines, forming what technical analysts identify as a descending wedge formation.  Historically, such patterns have acted as precursors to substantial bullish surges upon breaking free from the upper resistance. The question that now lingers in the minds of crypto enthusiasts: Is Solana poised for a bullish turnaround, or should we brace for more market turbulence? Related Reading: Chainlink (LINK) Bullish Run Falters: Time To Brace For A Price Dip? At present, Solana is trading at $17.86, according to CoinGecko data. Over the last 24 hours, it has witnessed a modest decline of 0.5%, contributing to a seven-day slump of 10.4%. The intriguing aspect is that SOL&#8217;s price currently hovers near the upper boundary of the descending wedge pattern, a crucial juncture where traders are grappling with substantial selling pressure.  This position implies that Solana may be poised to either break free from its recent struggles or face further rejection at this trendline resistance. SOL seven-day price action. Source: Coingecko Awaiting SOL’s Bullish Breakout For those harboring bullish sentiments for SOL, a prudent approach may be to await a clear breach of the aforementioned resistance. If such an event occurs, it could trigger a rally pushing Solana toward a potential target of $22.21. Beyond that, the cryptocurrency might set its sights on even loftier goals, with price milestones at $25.43 and $32 becoming realistic objectives. However, it&#8217;s essential to note that in the volatile world of cryptocurrency, the bearish sentiment can swiftly gain traction. In such a scenario, SOL could experience a further decline of approximately 11%, potentially targeting the $16.5 price region. Solana market cap currently at $7.4 billion. Chart: TradingView.com Solana&#8217;s Fundamentals Remain Strong One trader, known as Altcoin Sherpa on the social media platform X, offers a perspective that combines long-term optimism with short-term caution. Altcoin Sherpa views Solana as a fundamentally robust crypto project poised to perform well during the next bull market. $SOL: Big sell off yesterday, I didn&#8217;t catch any of it. Next point of interest is the $17-$15.50 area. Lots of scared investors in regards to a potential FTX holdings liquidation. #Solana https://t.co/7lfzea6XA7 pic.twitter.com/1f8XEJFlES — Altcoin Sherpa (@AltcoinSherpa) September 10, 2023 Although the trader remains long-term bullish on SOL, the path to bull territory may not be a smooth one, Altcoin Sherpa implied: “As a network, SOL is still a good one and will probably be a solid bet for the next bull run. I’ve got a long-term bag that I’ll just hold because I expect great multiples on it later on. But in the short term, it’s likely going to be painful.”  Related Reading: Can Pepe Coin Bounce Back? Insights On Its Future Post-Critical Support Drop Solana&#8217;s price movement remains a focal point of interest in the cryptocurrency community. The descending wedge formation has set the stage for a potentially significant breakout or breakdown, and traders are advised to stay vigilant as the market dynamics unfold. Whether Solana&#8217;s next move is bullish or bearish, the crypto world eagerly awaits to see where this innovative blockchain platform will steer its course. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Morpheus Trading Group"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-09-13T10:21:53.000Z",
    "title": "Top Telegram Bots Coins That Performed Well This Bear Market",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-telegram-bots-coins-that-performed-well-this-bear-market/",
    "description": "<p>Telegram bots have surged in popularity in recent years as crypto traders have begun to view these bots as an endless supply of trading insights and indicators. These bots have become traders&#8217; allies, enabling them to keep up with the shifting market trends. In this article, we&#8217;ll take a look at the best projects. What [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/top-telegram-bots-coins-that-performed-well-this-bear-market/\">Top Telegram Bots Coins That Performed Well This Bear Market</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-13T10:27:14.000Z",
    "title": "‘The US is the Worst Country for a Crypto Launch’: Says Ripple CEO",
    "url": "https://coinedition.com/the-us-is-the-worst-country-for-a-crypto-launch-says-ripple-ceo/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/ripple-6.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/ripple-6.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/ripple-6-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/ripple-6-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/ripple-6-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/ripple-6-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/ripple-6-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent interview, Ripple CEO Brad Garlinghouse asserted that the company would focus on countries other than the United States to schedule more than 80% of its hiring in 2023. The CEO’s disregard for the nation has been attributed to the soaring regulatory pressures of the Securities and Exchange Commission (SEC). Pointing out the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/the-us-is-the-worst-country-for-a-crypto-launch-says-ripple-ceo/\">‘The US is the Worst Country for a Crypto Launch’: Says Ripple CEO</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-13T10:23:01.000Z",
    "title": "CRV’s Price Plummets as Its Daily Volume Experiences a Sharp Drop",
    "url": "https://coinedition.com/crvs-price-plummets-as-its-daily-volume-experiences-a-sharp-drop/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Curve-DAO-Token-CRV-Price-analysis.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Curve-DAO-Token-(CRV)-Price-analysis\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Curve-DAO-Token-CRV-Price-analysis.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Curve-DAO-Token-CRV-Price-analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Curve-DAO-Token-CRV-Price-analysis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Curve-DAO-Token-CRV-Price-analysis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Curve-DAO-Token-CRV-Price-analysis-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The on-chain intelligence platform Kaiko revealed in a post on X (Twitter) yesterday that the collective volume for Curve DAO (CRV) plummeted over the past 2 weeks. According to the post, CRV’s volume dropped from its latest daily high of $300 million to just $7 million on 7 September 2023. Furthermore, the majority of this [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crvs-price-plummets-as-its-daily-volume-experiences-a-sharp-drop/\">CRV’s Price Plummets as Its Daily Volume Experiences a Sharp Drop</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]