[
  {
    "source": "Decrypt",
    "date": "2023-09-05T13:01:02.000Z",
    "title": "Watch-and-Earn Platform Myco Reveals Community Film Funding Program",
    "url": "https://decrypt.co/154941/watch-and-earn-platform-myco-reveals-community-film-funding-program",
    "description": "The Mycolab program will provide 65% of the funding for selected film projects that can raise the first 35% from the community."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-05T13:01:00.000Z",
    "title": "Making real-world blockchain solutions possible — Solana co-founder Raj Gokal",
    "url": "https://cointelegraph.com/news/making-real-world-blockchain-solutions-possible-solana-co-founder-raj-gokal",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/defb7b86-eb65-416d-aa10-9e140beb3982.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Web3 has had its ups and downs over the last few years, but does it have any real-world use cases? </p>\n                    <p><p>Raj Gokal, co-founder of blockchain protocol Solana and chief operations officer of Solana Labs, started his career in venture capital with a focus on high-growth tech business. </p><p>For seven years, Gokal focused on health tech, first with wearable sensors using Bluetooth Low Energy as a wireless protocol, then leading product management at Omada Health. He aimed to address the fractured, challenging United States healthcare system but “encountered challenges with health plans and regulators, leading me to recognize the industry’s persistent issues,” he told Cointelegraph.</p><p>After meeting Solana co-founder Anatoly Yakovenko and seeing his “vision to resolve scalability in crypto,” Gokal immersed himself in the crypto industry. “The journey has been rewarding over these past five years.”</p><p>Recently, Gokal sat down for an interview with Cointelegraph to discuss Web3, scalability, tokenization and more.</p><p><strong>Cointelegraph: There has been a noted absence of substantial real-world use cases in the Web3 domain. This contributes to the perception that there’s no product-market fit for the industry. What are a few real-world use cases Web3 is currently prioritizing?</strong></p><p><strong>Raj Gokal: </strong>A real-world use case that comes to mind is decentralized physical infrastructure networks, or DEPIN. Developers often lead the way, as seen with projects like Helium, which established a decentralized 5G network with 1.5 million hotspots before transitioning to Solana. Similarly, Hivemapper launched its decentralized maps, utilizing a distributed global workforce equipped with dashcams. This is now an alternative to a centralized organization like Google deploying tens of thousands of cars that it owns to map the roads.</p><p>The Hivemapper network remapped 8% of the world’s roadways in just a few months, which is very much a real-world application of Web3 on Solana. These ventures showcase the viability and significance of leveraging low-cost, scalable blockchain technology to create innovative solutions. Developers across the world come together without any central authority and create successful business models with tangible value.</p><p><strong>CT: Your ambition was to resolve scalability challenges within Web3. What architectural considerations are essential when building real-world solutions on layer-1 platforms?</strong></p><p><strong>RG: </strong>The benefits of parallelized transaction processing and validation are foundational, offering various advantages for developers and users. Solana pioneered these features, optimizing for speed with 400-millisecond block times and near-instant confirmations. We hear testimonials from users that a transaction was completed on Solana even before they could switch tabs. This fast, seamless experience builds trust and user satisfaction. Additionally, low transaction costs are crucial. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/63dc4ea3-be39-4f8a-9a43-116222b23be9.png\"  /></figure><p>Compatibility and composability are essential, too, allowing various applications to work together. Decentralization is a linchpin, ensuring longevity and reliability. For instance, on Solana, we have close to 3,000 validators and the highest Nakamoto coefficient of 33 across all blockchains. While achieving these feats within a decentralized, high-performance network is challenging, it has been achieved through rigorous effort and innovation.</p><p>There are several such architectural decisions that make real-world solutions possible on blockchains. It is often not just one feature — it is the convergence of several architectural considerations that make it viable and scalable. </p><p>I also think blockchain networks must be battle-tested across multiple cycles. As ecosystems thrive through difficult market conditions, it provides developers, users and investors confidence that the network is here to stay.</p><p><strong>CT: Let’s move on to Web3’s approach to mobile and payments. Solana has taken steps to introduce Solana Pay. You also recently launched the Saga phone. What are the motivations behind this, and how does it impact the broader mobile and payments landscape?</strong></p><p><strong>RG: </strong>The Solana Saga phone has shown that there is a huge opportunity for handset and operating system makers to create a sandbox where developers can build what they want with token incentives and without any restrictions on nonfungible tokens. Since the launch of the Saga, Apple and Google have eased their stance on digital assets in their application stores.</p><p>We have seen similar initiatives in the past, when Tesla created a new market for electric vehicles. It started with the Roadster, which initially only sold a few thousand cars. But over time, it has made it a more accessible mass-market product. We should see a similar trajectory for Web3-friendly mobile phones over the coming years, and Saga is just the beginning.</p><p>Solana Pay, on the other hand, operates at the crossroads of fostering a more accessible and open payments ecosystem. If you look at the Bitcoin white paper, the initial purpose of Bitcoin and the whole idea of digital money was to facilitate permissionless peer-to-peer online payments. That was the initial vision for cryptocurrencies.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/c60cdd4a-78ea-41e3-9213-fcfbc1011608.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Gokal (left) and fellow Solana co-founder Anatoly Yakovenko. Source: Solana Floor</em></figcaption></figure><p>By providing an alternative platform, Solana aims to influence these giants to adopt more user-centric and app-friendly frameworks. As for Solana Pay itself, it’s designed to enable any developer to integrate QR code-based payment features across various contexts, whether in point-of-sale systems, mobile apps or web-based services. </p><p>This has sparked initiatives like Decaf in over 30 countries, focusing on cross-border remittances. Sling, another Solana-powered platform, competes with Venmo on a global scale. Over the next few years, we can anticipate an upsurge in grassroots and enterprise-driven solutions that leverage crypto for payments.</p><p><strong>CT: Let’s talk about real-world asset tokenization. While this area holds immense potential, it hasn’t fully taken off. What are the barriers preventing the widespread adoption of real-world asset tokenization, and how can these hurdles be overcome?</strong></p><p><strong>RG: </strong>Real-world asset tokenization indeed presents enormous opportunities, especially in sectors like real estate. Initiatives such as Parcl and Homebase are pioneering this space, though it requires time for adoption. For instance, Homebase is focused on individual properties that are tokenized and fractionalized so that you can get rental income that is globally accessible to anyone. </p><p>This space is about providing assets that people actually want and then making sure the narrative is good enough to win mindshare and convince users that real-world asset tokenizations are now something that’s possible. The idea looks sound on paper, but often, it takes time to execute, and we just need founders who are good at carrying the messaging for this space and have strong product skills. Success hinges on creating accessible, user-friendly, trustworthy platforms that offer real value to users, but also in delivering the narrative to the target users.</p><p>Over the next few years, the collective efforts of dedicated teams and the introduction of innovative platforms will likely drive increased adoption and establish a strong presence in the market.</p><p><strong>CT: What strategies can mitigate risks associated with potential outages or technical difficulties within the Web3 ecosystem?</strong></p><p><strong>RG: </strong>Addressing liveness [i.e., the guarantee that a protocol can exchange messages between the network nodes, allowing them to reach a consensus] and reliability issues is essential to ensure seamless operations in real-world applications. The industry has learned from mistakes committed in the past and has actively implemented solutions to minimize outages. This will be critical for institutional adoption, as they will want to see reliable infrastructure before embracing this innovation at scale.</p><p>Networks like Solana have made significant strides in enhancing liveness and minimizing potential issues. Collaborative efforts between multiple validator clients, diverse solutions and continuous refinement of the ecosystem have led to increased stability and dependability. While the Web3 space is still evolving, the focus on these aspects will likely lead to even greater reliability over time.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/2725eda8-b0b0-4742-b15e-0377b0f5549b.png\"  /></figure><p><strong>CT: What would you define as a product-market fit for layer-1 protocols and the broader Web3 ecosystem? What would the user experience look like in your view?</strong></p><p><strong>RG: </strong>I think there are two stages of product-market fit. One is where founders and developers are able to either fund themselves or get funding to launch products that work toward end-user product market fit. And I believe we have achieved that level of product-market fit. Even in the depths of the bear market, you still see quality teams get funded, things are getting pushed forward, and new products are being launched.</p><p>Then, there is the second level, which is end-user product-market fit. And I would say that is a stage where the majority of the value that users are getting is not speculative from buying and holding assets but is from earning by contributing to networks, where the value is being shared back to the user. That’s why sectors like DEPIN, even though there are not 100 DEPIN examples, are happening. Users are using their hardware to earn money in crypto by supporting a network that adds real-world value to users. It’s exciting, and I’ll admit that it’s early.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-05T13:00:25.000Z",
    "title": "Dollar ascends to year high with crypto value test just around the corner",
    "url": "https://cryptoslate.com/insights/dollar-ascends-to-year-high-with-crypto-value-test-just-around-the-corner/",
    "description": "<p>Quick Take The DXY Index, a measure of the value of the U.S. dollar relative to a basket of foreign currencies, has surged to an apex of 104.6, its loftiest level since March. This ascendancy exerts significant pressure on global currencies such as the Chinese Yuan (CNY), Japanese Yen (JPY), Euro (EUR), and British Pound [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/dollar-ascends-to-year-high-with-crypto-value-test-just-around-the-corner/\">Dollar ascends to year high with crypto value test just around the corner</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-05T13:03:02.000Z",
    "title": "Musk Funded Dogecoin, Contemplated Blockchain Social Media Platform",
    "url": "https://cryptodaily.co.uk/2023/09/musk-funded-dogecoin-contemplated-blockchain-social-media-platform",
    "description": "The book, which should go on sale later this month, also talks about a failed attempt by Sam Bankman-Fried to help Musk in his acquisition of Twitter."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T12:56:28.000Z",
    "title": "Goldman Sachs Analysts Predict AI Rally to Continue, Defying Bubble Concerns",
    "url": "https://www.cryptopolitan.com/goldman-sachs-analysts-predict-ai-rally/",
    "description": "In a recent development, Goldman Sachs analysts have provided insights on the potential of artificial intelligence (AI) and its impact on equity markets. Delving into historical precedents, the analysts shed light on the intricate relationship between technological advancements, market outperformance, and the specter of market bubbles. Throughout history, notable technological advancements have consistently triggered the ... <a title=\"Goldman Sachs Analysts Predict AI Rally to Continue, Defying Bubble Concerns\" class=\"read-more\" href=\"https://www.cryptopolitan.com/goldman-sachs-analysts-predict-ai-rally/\" aria-label=\"More on Goldman Sachs Analysts Predict AI Rally to Continue, Defying Bubble Concerns\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T12:53:26.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 How much is LTC worth? Today, the price of Litecoin stands at $62.8, backed by a 24-hour trading volume amounting to $954.35 million. With a market capitalization of $4.72 billion, its market dominance is 0.45%. Over the past 24 hours, the LTC price has seen a 1.41% downtick. Currently, the circulating ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T12:50:43.000Z",
    "title": "The Growing Trend of Using Cryptocurrencies in Online Casinos",
    "url": "https://www.cryptopolitan.com/the-growing-trend-of-using-cryptocurrencies-in-online-casinos/",
    "description": "It&#8217;s no secret that cryptocurrencies have been creating seismic shifts in various industries. Initially dismissed as a fleeting digital fad, they have transcended such labels and now span multiple sectors. One realm where digital currencies are gaining substantial traction is in online casinos. Resource platforms like Onlinecasinos.se have evolved into indispensable portals for those keen ... <a title=\"The Growing Trend of Using Cryptocurrencies in Online Casinos\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-growing-trend-of-using-cryptocurrencies-in-online-casinos/\" aria-label=\"More on The Growing Trend of Using Cryptocurrencies in Online Casinos\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-05T13:07:18.000Z",
    "title": "Pushing for clarity: Can Stand with Crypto sway US lawmakers?",
    "url": "https://crypto.news/pushing-for-clarity-can-stand-with-crypto-sway-us-lawmakers/",
    "description": "Stand with Crypto Alliance, a new advocacy organization by Coinbase, was launched to mobilize the crypto community to help shape the crypto regulation in the US. Yet, with varying opinions within the community, its success remains uncertain."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-05T13:00:45.000Z",
    "title": "Analyst Calls ADA Amazon Of The Crypto World, Forecasts Bright Future Ahead",
    "url": "https://www.newsbtc.com/analysis/ada/this-analyst-calls-ada-amazon-of-the-crypto-world-forecasts-bright-future-ahead/",
    "description": "Amid increased price fluctuations in the crypto market, Crypto Capital Venture founder Dan Gambardello is bullish about Cardano’s (ADA) future. In his latest YouTube video, Gambardello compared Amazon’s stock price trajectory to Cardano’s, highlighting striking similarities between both companies. While he acknowledged ADA’s two-year-long bearish market conditions, the analyst believes that, like Amazon, Cardano has the potential for long-term growth. Since both entities&#8217; technology differs with varying achievements, he compared the underlying principles and price action. Cardano’s (ADA) Current Market Condition Is Similar To Amazon’s Early Years Gambardello highlighted Amazon’s historical price performance between 1999 and 2001. According to him, Amazon stock nosedived from a $5.25 all-time high price to 30 cents between this timeframe.  Related Reading: Worst Behind For BTC Price? Whales Accumulate Bitcoin, But It’s Not BlackRock Similarly, ADA&#8217;s value, which rose above $3 during the bull market in September 2021, has now plummeted to 25 cents. Therefore, the analyst likened buying ADA in 2023 and acquiring Amazon stocks in 2001.  This is particularly true given Cardano’s growth potential in the financial market. Moreover, Gambardello forecasted that Cardano (ADA) could become the world&#8217;s number one financial operating system.  In addition, he mentioned that currently, ADA’s market cap is approximately $8.9 billion. That is even 90% higher than Amazon&#8217;s market cap of $2.2 billion after a similar crash in 2001. The crypto analyst cited a letter from Jeff Bezos to Amazon shareholders during the downturn. In the letter, Bezos stressed that Amazon stood stronger despite the massive stock price drop.  In his comparison, Gambardello drew similarities between ADA&#8217;s current position and Amazon&#8217;s during the downturn. He noted that Cardano Blockchain is more robust and better than before, citing improved smart contracts, scalability, and staking utility.  Cardano Has Potential For Long-term Success Like Amazon Gambardello also likened ADA to the stock market, quoting a prominent crypto investor, Benjamin Graham. He said: “The stock market is a voting machine in the short run and a weighing machine in the long term.” Also, he noted that, like Amazon, Cardano’s fundamentals are strong enough to sustain it even in harsh economic conditions. The crypto analyst emphasized that Cardano is in the initial stages of user adoption, with several developers building on its network. It is similar to Amazon&#8217;s commitment to enhancing customer experience, which fueled its long-term growth.  Again, Gambardello shifted focus to Cardano’s security and decentralization. He explained that Cardano’s robust security and decentralization give it an edge over other blockchain networks like Solana. He further mentioned that several startups have adopted Cardano as of September 2023. For instance, World Mobile utilized Cardano’s infrastructure to connect the unbanked and financially underserved people. According to Gambardello, this real-world use case is a game changer and starting point for Cardano’s success.   Related Reading: Shiba Inu (SHIB) Presents Compelling Reversal Indicators – Could This Be It? In conclusion, the analyst said Cardano has numerous unexplored potentials with striking similarities to Amazon&#8217;s early days. Therefore, he is confident that Cardano has a high potential for long-term success and could offer massive returns to investors bullish enough to see it. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-05T12:49:26.000Z",
    "title": "Whales and Speculators Boost XRP Amid Bullish Sentiment: $0.55 Next?",
    "url": "https://www.crypto-news-flash.com/whales-and-speculators-boost-xrp-amid-bullish-sentiment-0-55-next/",
    "description": "<img width=\"800\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"This decline could be just the initial sign of greater challenges for XRP. Whale Alert, a well-known entity tracking significant cryptocurrency transactions, highlighted a remarkable development.\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-48x29.jpg 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" />Recent data shows that whales and speculators are heavily accumulating ahead of a possible breakout. Driving interest is a possible IPO announcement or SEC settlement in the upcoming victory party on September 29th. Recent data shows that capital inflows in XRP have increased by $8 million increase in Open Interest. This comes ahead of a [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-05T12:55:00.000Z",
    "title": "Meme Coin Social Showdown: PEPE Leads While SHIB & Doge Follow",
    "url": "https://coinedition.com/meme-coin-social-showdown-pepe-leads-while-shib-doge-follow/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Meme-Coin-Market-Crashes-50-from-1B-After-Traders-Take-Profit-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Pepe (PEPE), Shiba Inu (SHIB), Dogecoin (DOGE), Floki (FLOKI), and Dogelon Mars (ELON) are the top meme coins in terms of social activity. According to an X (Twitter) post shared by CryptoDep earlier today, these tokens were the front runners in terms of social mentions, social engagement, and social dominance. The now popular PEPE was [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/meme-coin-social-showdown-pepe-leads-while-shib-doge-follow/\">Meme Coin Social Showdown: PEPE Leads While SHIB &amp; Doge Follow</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]