[
  {
    "source": "Decrypt",
    "date": "2023-11-09T23:29:44.000Z",
    "title": "Roblox CEO Envisions In-Game NFTs as Part of Open Ecosystem 'Dream'",
    "url": "https://decrypt.co/205420/roblox-ceo-envisions-in-game-nfts-part-open-ecosystem-dream",
    "description": "Roblox CEO David Baszucki said that limited edition NFT items could launch in the future as part of an open ecosystem. But will it happen?"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-09T23:21:21.000Z",
    "title": "Bitwise Asset Management distances itself from failed startup of same name",
    "url": "https://cryptoslate.com/bitwise-asset-management-distances-itself-from-failed-startup-of-same-name/",
    "description": "<p>Bitwise Asset Management said that it has no connection with another firm of the same name whose founders are facing charges. The asset management firm wrote on Nov. 9: &#8220;San Francisco-based Bitwise Asset Management, Inc., the largest crypto index fund manager in America, has no relationship with, and has never had a relationship with, the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitwise-asset-management-distances-itself-from-failed-startup-of-same-name/\">Bitwise Asset Management distances itself from failed startup of same name</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-09T23:31:00.000Z",
    "title": "Crypto Token Inspired by Elon Musk’s AI Chatbot Grok Surges Over 1,000%",
    "url": "https://www.cryptoglobe.com/latest/2023/11/crypto-token-inspired-by-elon-musks-ai-chatbot-grok-surges-over-1000/",
    "description": "After the CEO of Tesla and X (formerly Twitter) Elon Musk launched an AI chatbot called Grok, more than 400 cryptocurrencies with the same name have been created, with one specific token seeing its price surge more than 1,000% since launch. According to data from Dextools there hundreds of tokens named after the AI chatbot […]\n"
  }
]