[
  {
    "source": "Cointelegraph",
    "date": "2023-12-17T10:51:40.000Z",
    "title": " Bitcoin fees hit 20-month high as miner revenues match $69K BTC price ",
    "url": "https://cointelegraph.com/news/bitcoin-fees-20-month-high-miner-revenues-match-69k-btc-price",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvYzg4MTljZmQtNTdhNC00YjA3LWFkMDgtNmMyNTc0MDY2M2RjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin miners are the main beneficiaries of current sky-high transaction fees, data shows, but many longtime market participants have little time for complaints.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) on-chain transaction fees are dividing opinion as the cost of sending BTC skyrockets.</p><p><a href=\"https://bitinfocharts.com/comparison/bitcoin-transactionfees.html#3m\" target=\"_blank\" rel=\"noopener nofollow\">Data</a> from statistics resource BitInfoCharts puts the average transaction fee at nearly $40 as of Dec. 17.</p><p>The latest wave of Bitcoin ordinal inscriptions have resulted in a <a href=\"https://cointelegraph.com/news/bitcoin-ordinals-btc-transaction-fees-5-month-peak\">fresh wave of elevated transaction fees</a> for all network users — but some believe that they are here to stay.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-fees-20-month-high-miner-revenues-match-69k-btc-price\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-17T11:00:36.000Z",
    "title": "VeChain (VET) Set To Explode: Analyst Predicts 7,500% Rally To $2.3",
    "url": "https://www.newsbtc.com/news/vechain-vet-set-to-explode-analyst-predicts-7500-rally-to-2-3/",
    "description": "Popular crypto analyst EGRAG just predicted a massive 7,500% rally that will send VET soaring to $2.3. VeChain (VET) is currently trading at $0.02945, but according to this analyst, the crypto is set for a price growth that would send it on a price growth into three sequential price targets.   EGRAG Predicts VET To Hit $2.3 Related Reading: Shiba Inu Just Spiked 12% Overnight – What’s The Next Move? VET&#8217;s price has had its ups and downs this year, reflecting the general market volatility of crypto assets this year. The crypto went on a price spike very early in the year, going on a 101% growth in the first two months from its 2023 open of $0.01579 to reach $0.03186 in February. The crypto would then go on a price decline over the next few months to a 2023 low of $0.01477. However, things started to change in October as the entire crypto industry changed into a bullish sentiment. VET is now up 80% from its October bottom, and according to EGRAG, the growth is set to continue in the coming months. In a recent post on social media platform X, EGRAG wrote &#8220;VET will unlock ur financial chains,&#8221; along with three bullish targets for the coming year. A look through the price chart shared shows sequential targets of $0.11642, $1.05737, and $2.3. These targets represent a respective 295%, 3490%, and 7,500% rise from the current price. As indicated on the price chart shared by EGRAG, VET has primarily traded in a downward range, creating lower highs and lower lows since its all-time high in 2021. The crypto broke out of this range in October and has formed five bullish candles on the three-week timeframe.  VET market cap currently at $2.157 billion. Chart: TradingView.com Using the Fibonacci indicator and the 2023 bottom as a starting point, the analyst drew a mirror of VET&#8217;s ascent from the 2020 bottom to its all-time high in 2021. Based on this, EGRAG noted VET is poised to potentially rally over the next few months into 2024. If history repeats itself, we could potentially see VET break past its current all-time high of $0.28 before the second price target. #VET will unlock ur financial chains. Each target—Target 1, Target 2, and Target 3—will be achieved one by one. pic.twitter.com/wqteQXzG9w — EGRAG CRYPTO (@egragcrypto) December 14, 2023 What’s Next For VeChain (VET)? VET is VeChain&#8217;s native token, a blockchain network looking to streamline supply chain management with distributed ledger technology. Several crypto experts have weighed in with predictions on how high VET&#8217;s price can go in the next bull market. Related Reading: Osmosis Rally Intensifies With 77% Increase – Will OSMO Hit $2 This Month? According to Ali Martinez, VET is set for a 150% price gain in the next six weeks. The analyst noted that VET is currently mirroring the 2018-2020 consolidation phase. If history repeats itself, VET could break through the $0.033 resistance barrier within the next two weeks and ultimately reach $0.077 in January. #VeChain, the forgotten Chinese #Ethereum, appears to mirror the consolidation phase we saw in 2018-2020! If so, $VET could break through the $0.033 resistance barrier within the next two weeks. The upswing could send #VET to $0.077 by late January. That&#8217;s a 150% price increase! pic.twitter.com/5E2g76H7yG — Ali (@ali_charts) December 15, 2023 Featured image from iStock"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-12-17T11:04:15.000Z",
    "title": "Arbitrum Outage: Bitcoin Ordinals-Inspired Inscriptions Surge",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/arbitrum-outage-bitcoin-ordinals-inspired-inscriptions-surge/",
    "description": "<p>Before the incident, 90% of transactions on Arbitrum were inscriptions, highlighting the significant impact of the surge. The surge overwhelmed the network, leading to the sequencer&#8217;s intervention. Effectively causing Arbitrum to come to a standstill for the duration of the outage. Let&#8217;s explore more about this important incident. Bitcoin Ordinals Surge Causes Temporary Network Outage [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/arbitrum-outage-bitcoin-ordinals-inspired-inscriptions-surge/\">Arbitrum Outage: Bitcoin Ordinals-Inspired Inscriptions Surge</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-12-17T10:39:55.000Z",
    "title": "3 Ways Saga Will Enhance the Solana Ecosystem",
    "url": "https://www.altcoinbuzz.io/spotlight/3-ways-saga-will-enhance-the-solana-ecosystem/",
    "description": "<p>Back in June 2022, Solana&#8217;s founder, Anatoly Yakovenko, announced the Solana Saga mobile. A project that has taken almost as long as Cryptopunks to mint out. Solana has experienced a remarkable journey, particularly after the FTX collapse. The cryptocurrency has surged by 9X from its post-collapse lows, demonstrating the resilience and strength of its ecosystem. [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/spotlight/3-ways-saga-will-enhance-the-solana-ecosystem/\">3 Ways Saga Will Enhance the Solana Ecosystem</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-12-17T10:54:00.000Z",
    "title": "Altcoin Market Could Break Out Soon as Stablecoin Supply Rises",
    "url": "https://coinedition.com/altcoin-market-could-break-out-soon-as-stablecoin-supply-rises/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Smart-Money-Investor-Prepares-To-Utilize-Altcoin-Market-Downturn.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Altcoin Opportunities Surge as Market Sees Signs of Revival\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Smart-Money-Investor-Prepares-To-Utilize-Altcoin-Market-Downturn.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/Smart-Money-Investor-Prepares-To-Utilize-Altcoin-Market-Downturn-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Smart-Money-Investor-Prepares-To-Utilize-Altcoin-Market-Downturn-380x214.jpg 380w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The analyst and trader Rekt Capital revealed in an X post yesterday that the altcoin market is continuously retesting historic levels. According to the post, the levels that the altcoin market has retested over the last few weeks have historically “preceded fantastic growth” in the altcoin market. A potential altcoin market breakout may be on [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/altcoin-market-could-break-out-soon-as-stablecoin-supply-rises/\">Altcoin Market Could Break Out Soon as Stablecoin Supply Rises</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]