[
  {
    "source": "Cointelegraph",
    "date": "2023-07-21T13:43:45.000Z",
    "title": "The last Bitcoin: What will happen once all BTC are mined?",
    "url": "https://cointelegraph.com/news/the-last-bitcoin-btc-mine",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/8e81569b-fc40-4768-83f2-89fa27525868.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to some experts, miners will always be essential to the Bitcoin ecosystem, even after mining the last coins. </p>\n                    <p><p>Satoshi Nakamoto <a href=\"https://cointelegraph.com/news/community-celebrates-bitcoin-genesis-day-by-sending-btc-to-the-genesis-block\">mined the genesis block</a> on Jan. 3, 2009, minting the first 50 Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) in history and kicking off what would become a billion-dollar industry centered around mining crypto. However, with a cap on Bitcoin supply, the fate of miners after the last coins are issued is unclear. </p><p>Bitcoin is created through mining, a process involving computer hardware to solve complex mathematical problems and verify transactions on the <a href=\"https://cointelegraph.com/learn/how-does-blockchain-work-a-beginners-guide-to-blockchain-technology\">blockchain network</a>. For their efforts, miners are rewarded with a predetermined amount of BTC for each block of transactions. </p><p><a href=\"https://www.blockchain-council.org/cryptocurrency/how-many-bitcoins-are-left/#:~:text=Summary%E2%80%8B,million%20left%20to%20be%20mined.\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to the Blockchain Council, more than 19 million BTC has been awarded to miners in block rewards, and according to <a href=\"https://cointelegraph.com/news/14-years-since-the-bitcoin-white-paper-why-it-matters\">Nakamoto’s white paper</a>, only 21 million are available. Once this cap is reached, miners will <a href=\"https://cointelegraph.com/news/a-glimpse-into-the-future-what-happens-when-there-are-no-more-bitcoin-to-mine\">no longer receive rewards</a> for verifying transactions. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/a1c4b1c9-112d-4a77-b3cd-6cb834147c77.png\"  /></figure><p>Speaking to Cointelegraph, Nick Hansen, founder and CEO of <a href=\"https://cointelegraph.com/news/luxor-mining-acquires-ordinalhub-amid-bitcoin-based-nfts-hype\">Bitcoin mining firm Luxor Mining</a>, says that despite the loss of block rewards, miners will continue to play an essential role in verifying and recording transactions on the blockchain, but how they are compensated will evolve. </p><p>Currently, successfully validating a new block on the blockchain rewards miners with 6.25 BTC, worth about $188,381 at the time of writing, <a href=\"https://www.coingecko.com/en/coins/bitcoin\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to CoinGecko. Miners also <a href=\"https://cointelegraph.com/news/memecoin-hype-drives-bitcoin-transaction-fees-to-multi-year-highs\">receive transaction fees</a>. </p><p><a href=\"https://twitter.com/glassnode/status/1653371715710246912\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to calculations shared in a May 1 tweet from <a href=\"https://cointelegraph.com/news/us-bitcoin-supply-fell-over-10-in-the-past-year-glassnode\">on-chain analytics firm Glassnode</a>, since 2010, fees and block rewards have netted miners over $50 billion.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Since <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a>&#39;s inception, Miners have earnt a total revenue of $50.2B from the block subsidy and fees, for an all-time estimated input cost of $36.6B.<br><br>This places the all-time-aggregate profit margin for Miners at $13.6B (+37%). <a href=\"https://t.co/TYvBSZbsRo\">pic.twitter.com/TYvBSZbsRo</a></p>&mdash; glassnode (@glassnode) <a href=\"https://twitter.com/glassnode/status/1653371715710246912?ref_src=twsrc%5Etfw\">May 2, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Hansen believes transaction fees will eventually become the primary incentive for miners to continue long after the last BTC is mined. </p><p>“That’s why as transaction fees become an increasingly important part of Bitcoin mining economics, understanding transaction fee dynamics and forecasting them into the future becomes even more critical,” he said, adding: </p><p>“Thus, it’s important to see fees increase over time, something that Bitcoin Ordinals, as of late, has helped with, for example.”</p><p>However, this shift is still likely years away, given that nobody currently mining will be alive when the last BTC block reward is received. </p><h2>It will be a long wait to find out</h2><p>According to Hansen, based on the block discovery rate and <a href=\"https://cointelegraph.com/learn/bitcoin-halving-how-does-the-halving-cycle-work-and-why-does-it-matter#:~:text=Miner%20rewards%20determine%20the%20flow,due%20to%20the%20halving%20event.\">the halving process, </a>which occurs roughly every four years — or every 210,000 blocks of transactions — the last BTC will most likely be mined around 2140.</p><p>A Bitcoin halving is a planned reduction in the rewards that miners receive, with the next one currently predicted to occur around April 2024. This will reduce the reward for each block to 3.125 BTC or roughly $94,190 at the time of writing. </p><p>In theory, by limiting the supply of BTC, each coin’s <a href=\"https://cointelegraph.com/news/what-happens-when-21-million-bitcoin-are-fully-mined-expert-answers\">value should increase</a> as demand increases and supply remains fixed. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/ee01df2f-1996-4492-b0c6-a723b58c3e46.jpg\"  /></figure><p>Hansen says the price of BTC in 2140 will depend on unpredictable factors such as market demand, the regulatory environment, technological advancements and macroeconomic factors.</p><p>“The fact that all Bitcoin is in circulation may create scarcity, but whether this scarcity will translate to price increases is subject to market dynamics,” he said. </p><p>“As we look to a future where all Bitcoin has been mined, it’s important to remember that Bitcoin was designed with this endgame in mind.</p><p>“The tapering off of block rewards and shift toward transaction fees are intrinsic to the protocol, and represent an ingenious solution to ensuring the ongoing security and viability of the network,” Hansen added. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/rising-btc-transaction-fees-are-a-good-thing-bitcoin-educator-shares\"><strong><em>Rising BTC transaction fees are a good thing, Bitcoin educator shares</em></strong></a></p><p>Jaran Mellerud, a research analyst from Hashrate Index, told Cointelegraph that as Bitcoin adoption and usage grows, transaction fees will drastically increase and <a href=\"https://cointelegraph.com/news/buying-bitcoin-is-preferable-to-btc-mining-in-most-circumstances-analysis\">become the primary source of revenue</a> for mining firms. </p><p>Mellerud said that, by the time the last BTC is issued, the block subsidy will have already been so minuscule that it will not significantly impact the coin supply. </p><p>“Due to the huge block space demand relative to the scarce block space supply, transaction fees will have to skyrocket in a future scenario of hyperbitcoinization,” he said, adding: </p><p>“If you don’t believe there will be sufficiently high transaction fees in the future to justify the existence of mining, you don’t really believe in Bitcoin.” </p><h2>What about fiat</h2><p>By the time the last Bitcoin is mined, Mellerud believes its value won’t be measured in United States dollars or other fiat currencies. </p><p>He speculates that by then, fiat money systems will <a href=\"https://cointelegraph.com/news/chatgpt-learns-bitcoin-will-end-central-banking-and-fiat-currency\">have long since collapsed</a>, and Bitcoin could be the successor, becoming the standard unit of account globally.</p><p>“Under such circumstances, the only valid way to measure the purchasing power of Bitcoin is by looking at how much energy a Bitcoin or satoshi can purchase,” Mellerud said. </p><p>“Just as we currently measure the purchasing power of the U.S. dollar in energy terms, barrels of oil,” he added. </p><p>A collapse of fiat money systems has long been predicted, spurred on by the many <a href=\"https://cointelegraph.com/news/bitcoin-top-3-asset-in-us-debt-default-survey\">problems facing the traditional </a>financial system. As recently as March 2023, <a href=\"https://cointelegraph.com/news/blame-traditional-finance-for-the-collapse-of-silicon-valley-bank\">Silicon Valley Bank</a> collapsed due to a liquidity crisis, with <a href=\"https://cointelegraph.com/news/signature-bank-failed-to-understand-risks-associated-with-crypto-fdic-chair\">Signature Bank</a> and <a href=\"https://cointelegraph.com/news/crypto-industry-braces-for-impact-with-silvergate-exit\">Silvergate Bank</a> following. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/debt-crisis-expect-more-pain-ahead\"><strong><em>The first-world debt crisis means you can expect more pain ahead</em></strong></a></p><p>Before the March 2023 banking crisis, a February survey conducted by business intelligence firm Morning Consult and commissioned by crypto exchange <a href=\"https://www.coinbase.com/blog/new-national-survey-of-2-000-american-adults-suggests-20-of-americans-own\" target=\"_blank\" rel=\"noopener nofollow\">Coinbase</a> found most <a href=\"https://cointelegraph.com/news/americans-frustrated-by-financial-system-inequality-20-own-crypto-survey\">respondents were already disillusioned</a> with the global financial system. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/d8c3e339-94d0-4d44-8c93-bead10e21ea6.png\"  /><figcaption style=\"text-align: center;\">A large portion of respondents are disillusioned with the global financial system and want change. Source: Morning Consult</figcaption></figure><h2>Bitcoin might not be the same in 120 years</h2><p>Speaking to Cointelegraph, Pat White, co-founder and CEO of digital asset platform Bitwave, believes miners will remain a critical part of the ecosystem, but not all will survive, with some shutting down in the face of mounting costs. </p><p><a href=\"https://insights.glassnode.com/investigating-the-production-cost-of-bitcoin/\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to a March 24 report from Glassnode, since 2010, miners have already been experiencing long periods of unprofitability, with only 47% of trading days being profitable. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/21f73bef-30b1-4096-9c01-ec6582f62539.png\"  /><figcaption style=\"text-align: center;\">According to data from Glassnode, miners have already been experiencing long periods of unprofitability. Source: Glassnode</figcaption></figure><p>“I think it’s conceivable we’ll see some miners shut down or other manipulation techniques used in an effort to drive up fees,” White said, adding: </p><p>“But I also imagine that will happen well before the last Bitcoin is mined since the last few halvings will get the block rewards down to the satoshi level.”</p><p>However, White also says “a lot can happen in 120 years,” and BTC could fundamentally change over the next century. </p><p>White believes that by 2140, quantum computers will likely have <a href=\"https://cointelegraph.com/news/why-quantum-computing-isn-t-a-threat-to-crypto-yet\">broken the core encryption under Bitcoin</a>, though he says engineers working on it have long known it’s not quantum-secure.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/5f292dcf-c9e0-4621-9770-d292e848c225.jpg\"  /></figure><p>“That shouldn’t necessarily scare people because of this quantum security issue. Between now and 2140, there will have to be a major reworking of Bitcoin from the encryption layer upward,” he said. </p><p>“At that point, the Bitcoin developer community will be able to assess whether or not we’re actually on track to have a functioning transaction fee-based network or if additional Bitcoin mining is necessary to ensure the security of the network,” White added.</p><p>White further speculates that while Satoshi Nakamoto’s white paper states that 21 million BTC is the supply cap and the single most concrete rule, none of us will likely be alive by 2140 to enforce that rule.</p><p>He believes crypto boils down to coding and consensus; if the community thinks the transaction fee incentive is insufficient to keep the network secure, future miners could theoretically extend the BTC hard cap beyond 21 million.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/160k-halving-btc-price-prediction-model-count-down-new-bitcoin-all-time-high\"><strong><em>$160K at next halving? Model counts down to new Bitcoin all-time high</em></strong></a></p><p>What effect this could have on the price isn’t clear, but either way, White thinks that the price of Bitcoin will stabilize at some global inflation-reflecting price point, and the major price movement will occur at some time in the next 120 years if one or <a href=\"https://cointelegraph.com/news/5-countries-leading-the-blockchain-adoption\">more nations seriously pick</a> it up as their reserve currency.</p><p>In that instance, he says it will “likely be independent of Bitcoin mining schedules,” and it would be the most solidifying moment to drive up the price of BTC. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/us-law-exposes-retail-investors-rep-torres\">US law protects institutions and exposes retail investors — Rep. Torres</a></em></strong></p><p>“There are things we can’t even imagine that might impact Bitcoin — wars and energy crises obviously — but what if we’re a true multiplanetary species by then and we have to extend the block production time to support solar system-level communication speeds,” White said. </p><p>“What I always find important is to focus on the hardest problems we’re seeing today and do what we can to solve them. That might mean solving for payments or digital ownership, or banking the unbanked — these are the problems to focus on now,” he added.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-21T13:53:28.000Z",
    "title": "Polygon Ecosystem Grows With Blocto’s $1M Accelerator",
    "url": "https://cryptobriefing.com/polygon-ecosystem-grows-with-blocto/?utm_source=feed&utm_medium=rss",
    "description": "Blocto, a cross-chain wallet and multi-chain Web3 realm, has announced a $1 million accelerator program. The initiative will simplify wallet creation on the Polygon protocols, following the company&#8217;s enhanced efforts..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-21T14:05:37.000Z",
    "title": "Superblock Raises $8M for “Over Protocol,” a New Layer 1 Blockchain Focusing on Lightweight Full Nodes",
    "url": "https://cryptodaily.co.uk/2023/07/superblock-raises-8m-for-over-protocol-a-new-layer-1-blockchain-focusing-on-lightweight-full-nodes",
    "description": "<p>Seoul, South Korea, July 21st, 2023, Chainwire</p><p>Superblock, a contributor to Over Protocol, has raised $8 million from prominent companies and VCs in South Korea across two funding rounds. Investors included SK, Netmarble, DSC, E&amp;Investment, Schmidt, SpringCamp, and NaverZ.</p>Ben (Jae-Yun) Kim, the founder of Superblock, said: \"We are deeply diving into the South Korea market with the best local partners and looking to meet global partners accelerating us all over the world.\"<p>As layer 1 blockchains have become faster and more established over time, the costs of bootstrapping and maintaining nodes have become increasingly expensive. As a consequence, blockchain applications have become challenging to operate without the use of costly equipment.</p><p>Over Protocol is a new layer 1 blockchain based on a protocol named \"Ethanos\" that only considers active accounts valid, enabling full nodes to discard obsolete data and operate with less storage, thus allowing for reduced storage requirements. With Over, anyone will be able to run a node and become a validator on their PCs at home. Ethanos has been published at EuroSys&rsquo;21.</p>\"With the ability for anyone to run a validator, individuals can earn potentially passive income through a process called home staking, enabling them to embrace a new lifestyle with new payment options, enhanced credit, and innovative finance opportunities,\" Ben added.<p>About Superblock </p><p>Superblock builds products, tools, and decentralized applications to flourish the Over Protocol. Over Protocol is a truly decentralized layer 1 blockchain providing lightweight full nodes.</p><p>For more information: Twitter | Discord | Medium</p>ContactMarketerDavid KimSuperblockdavid@superblock.xyz+821043302540"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-21T13:59:00.000Z",
    "title": "Moonbirds Launches 200-Day Reveal For New Mythics NFT Collection",
    "url": "https://cryptodaily.co.uk/2023/07/moonbirds-launches-200-day-reveal-for-new-mythics-nft-collection",
    "description": "<p>Proof Collective is trying to rekindle interest in its Moonbirds NFTs with a brand new 20,000-piece Mythics collection, released almost a year after its initial mention in August 2022.</p>\nProof Collective Drops New Collection\n<p>Moonbirds, the once-celebrated NFT brand, is making a comeback with the launch of its 20,000-piece collection, Mythics, which is also the latest Ethereum profile picture (PFP) collection.&nbsp;</p>\n<p>Proof Collective, the company behind Moonbirds, aims to rekindle interest among NFT collectors after facing a significant decline in sales since its first release in April 2022.&nbsp;</p>\n<p>The Mythics collection is the result of nearly a year of development and will be introduced gradually. Proof revealed that it will unveil 100 new NFTs today, followed by an additional 100 NFTs daily for the next 200 days.&nbsp;</p>\n<p>Half of the 100 new NFTs revealed daily would be randomly selected claimed eggs, while the other half would be 50 Oddities chosen to be burned. The slow rollout is a strategic move to enrich the underlying intellectual property and keep the community engaged.</p>\nMore About The Mythics Collection\n<p>The upcoming Mythics collection is considered a more genuine follow-up to Moonbirds than its predecessor, Oddities. The team at Proof Collective delved deep into the lore of the Moonbirds world to ensure that the new collection offers an engaging and entertaining experience for collectors.</p>\n<p>The new collection has been classified into three categories, depending on their functionality and power - the stone eggs, legendary eggs, and runic eggs. The first two types are rarer as they consist of only 20% of the collection each. All these eggs can spawn a specific number of Mythic forms; for legendary eggs, it is three; for runic eggs, it is two; and a stone egg can only spawn one. The person who is minting the NFT gets to choose which form of Mythic to spawn from each type of egg.</p>\nChange In Licensing Model&nbsp;\n<p>Once minted and in possession of a Mythic NFT, the holder will have complete commercial rights over the artwork and even be able to use the characters&rsquo; IP. This is a major change from the two earlier Moonbirds collections, which followed a Creative Commons CC0 licensing model. As a result, anyone could commercially reproduce and use the NFT artworks from those collections, even without owning the NFT.&nbsp;</p>\nWill Moonbirds Regain Their Popularity?&nbsp;\n<p>The cooling interest in the NFT market has impacted Moonbird sales, with average sale prices plummeting almost tenfold from their initial high.&nbsp;</p>\n<p>Led by co-founder and CEO Kevin Rose and supported by top crypto venture capitalist a16z, the Proof is expanding the Moonbirds brand lore to rekindle interest.&nbsp;</p>\n<p>Rose said,&nbsp;</p>\n\n<p>&ldquo;With Mythics, we&rsquo;re really trying to give our community a new experience that links together the Proof ecosystem and expands the storytelling that started with Moonbirds. I&rsquo;m so proud of how hard our teams have been working on this launch, with the goal of expanding Moonbirds' storytelling both through art and technology.&rdquo;</p>\n\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-21T14:00:46.000Z",
    "title": "Sam Bankman-Fried Accused of Leaking Diary Excerpts to Discredit Key Witness",
    "url": "https://news.bitcoin.com/sam-bankman-fried-accused-of-leaking-diary-excerpts-to-discredit-key-witness/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/sbf-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/sbf-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sbf-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sbf-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sbf-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sbf-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sbf-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/sbf.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A court document penned by U.S. Department of Justice attorney Damian Williams alleges FTX co-founder Sam Bankman-Fried released diary excerpts from former Alameda CEO Caroline Ellison. The U.S. attorney asserts that Bankman-Fried intended to discredit the government&#8217;s key witness by disseminating the diary content. FTX Co-Founder Allegedly Leaked Caroline Ellison’s Diary Excerpts The U.S. Department [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T14:04:03.000Z",
    "title": "NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?",
    "url": "https://www.cryptopolitan.com/near-price-prediction/",
    "description": "NEAR Price Prediction 2023-2032 Near Protocol (NEAR) is a blockchain platform with significant attention and partnerships within the cryptocurrency industry. Initially established by a small team in San Francisco, NEAR Protocol has rapidly expanded its influence and formed collaborations with industry giants. As a result, it has witnessed a consistent upward trajectory since its inception. ... <a title=\"NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-price-prediction/\" aria-label=\"More on NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T14:01:21.000Z",
    "title": "Superblock Raises $8M for “Over Protocol,” a New Layer 1 Blockchain Focusing on Lightweight Full Nodes",
    "url": "https://www.cryptopolitan.com/superblock-raises-8m-for-over-protocol-a-new-layer-1-blockchain-focusing-on-lightweight-full-nodes/",
    "description": "Seoul, South Korea, July 21st, 2023, Chainwire Superblock, a contributor to Over Protocol, has raised $8 million from prominent companies and VCs in South Korea across two funding rounds. Investors included SK, Netmarble, DSC, E&#38;Investment, Schmidt, SpringCamp, and NaverZ. Ben (Jae-Yun) Kim, the founder of Superblock, said: &#8220;We are deeply diving into the South Korea ... <a title=\"Superblock Raises $8M for “Over Protocol,” a New Layer 1 Blockchain Focusing on Lightweight Full Nodes\" class=\"read-more\" href=\"https://www.cryptopolitan.com/superblock-raises-8m-for-over-protocol-a-new-layer-1-blockchain-focusing-on-lightweight-full-nodes/\" aria-label=\"More on Superblock Raises $8M for “Over Protocol,” a New Layer 1 Blockchain Focusing on Lightweight Full Nodes\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T13:42:55.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? Today&#8217;s Aave price is $73.94, with a 24-hour trading volume of $80,756,545. Aave is up 2.67% in the last 24 hours. The current CoinMarketCap ranking is #43, with a live market cap of $1,071,183,569. It has a circulating supply of 14,487,546 AAVE coins and a ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T14:03:19.000Z",
    "title": "Cosmos Long Trade Opportunity if $10.6 Resistance is Broken, ATOM Before Major Price Outbreak",
    "url": "https://www.crypto-news-flash.com/cosmos-long-trade-opportunity-if-10-6-resistance-is-broken-atom-before-major-price-outbreak/?utm_source=rss&utm_medium=rss&utm_campaign=cosmos-long-trade-opportunity-if-10-6-resistance-is-broken-atom-before-major-price-outbreak",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/price-surge-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Cosmos might offer a buying opportunity for traders with varying timeframes, depending on how it responds to crucial resistance levels.  With a 7% upward movement, leveraging three times the initial investment could yield a remarkable 21% gain. Over the recent days, Cosmos (ATOM) supporters managed to protect the $9 support level effectively. Despite the sellers&#8217; [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-21T14:00:28.000Z",
    "title": "Decanting Value: Golden Cask Club’s (GCC) Premium NFTs are Leaving Monero (XMR) and Solana (SOL) on the Shelf",
    "url": "https://www.crypto-news-flash.com/decanting-value-golden-cask-clubs-gcc-premium-nfts-are-leaving-monero-xmr-and-solana-sol-on-the-shelf/?utm_source=rss&utm_medium=rss&utm_campaign=decanting-value-golden-cask-clubs-gcc-premium-nfts-are-leaving-monero-xmr-and-solana-sol-on-the-shelf",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T160844.155.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T160844.155.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T160844.155-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Beginner investors usually associate cryptocurrencies with tokens such as Monero (XMR) and Solana (SOL), which both leverage blockchain technology to facilitate decentralized payments. While this type of token has dominated the market for years, new alternative DeFi investments are arising such as Golden Cask Club (GCC), which focuses on offering investment opportunities in premium beverage [...]"
  }
]