[
  {
    "source": "Crypto Daily",
    "date": "2023-06-23T07:55:00.000Z",
    "title": "Binance.US Files Lawsuit, Alleges SEC Is Misleading The Public",
    "url": "https://cryptodaily.co.uk/2023/06/binance-us-files-lawsuit-alleges-sec-is-misleading-the-public",
    "description": "<p>Binance.US, Binance Holdings Limited, and Binance CEO Changpeng Zhao have accused the Securities and Exchange Commission (SEC) of misleading the public through statements during its ongoing lawsuit.&nbsp;</p>\n<p>The allegation was made during a motion filed by lawyers representing Binance.US at the United States District Court for the District of Columbia on the 21st of June.&nbsp;</p>\nSEC Deliberately Misleading The Public&nbsp;\n<p>According to the arguments filed by lawyers representing Binance.US, the United States Securities and Exchange Commission&rsquo;s assertions made during a press release on the 17th of June were misleading, and appealed to the financial regulator to adhere to the &ldquo;applicable rules of conduct.&rdquo; In its press release, the SEC accused Binance and CEO Changpeng Zhao of commingling customer assets.&nbsp;</p>\n\n<p>&ldquo;Given that Changpeng Zhao and Binance have control of the platforms&rsquo; customers&rsquo; assets and have been able to commingle customer assets or divert customer assets as they please, as we have alleged, these prohibitions are essential to protecting investor assets.&rdquo;</p>\n\n<p>The motion filed alleges that the Securities and Exchange Commission&rsquo;s press release included statements that were unsupported by evidence and lacked substantiation. The lawsuit also stressed that the Securities and Exchange Commission presented no evidence to support its claims that Binance had commingled customer funds or diverted them as per its discretion. Binance representative stated,&nbsp;</p>\n\n<p>&ldquo;The SEC has no evidence that BAM [Binance.US] customer assets have been dissipated, commingled or misused in any way.&rdquo;&nbsp;</p>\n\n<p>It also alleged that the Securities and Exchange Commission&rsquo;s press release was designed to introduce further unwarranted confusion into the crypto markets, having a detrimental impact on BAM customers.&nbsp;</p>\n\n<p>&ldquo;SEC&rsquo;s press release seemed designed to introduce unwarranted confusion into the marketplace, which could have the effect of harming BAM customers rather than protecting them. It also risks tainting the jury pool with misleading descriptions of the evidence concerning the Defendants.&rdquo;</p>\n\nImplications Of The Motion&nbsp;\n<p>The motion filed against the SEC also stated that its press release risked prejudicing the jury pool by misleading descriptions of events related to the defendants in the case. Binance had also accused the Securities and Exchange Commission Chair Gary Gensler of having a conflict of interest, alleging that Gensler had sought an informal advisory role with Binance before he was appointed as the SEC chair. According to Binance&rsquo;s lawyers, Gensler&rsquo;s previous connection with the exchange could influence his actions and decisions as the head of the SEC.&nbsp;</p>\n<p>If the federal judge approves, the motion could have significant consequences for the SEC. For starters, it could limit the regulatory body&rsquo;s ability to make public comments about the Binance lawsuit throughout the duration of the case, in particular, any comments that may impact court proceedings. To support their argument, Binance&rsquo;s legal team also included some excerpts from a hearing held on the 13th of June. During this hearing, the SEC counsel admitted that there was no proof yet that Binance.US assets were being channeled overseas. The motion filed by the defense lawyers is part of its defense strategy in response to a lawsuit filed against Binance by the Securities and Exchange Commission on the 5th of June.&nbsp;</p>\nThe Lawsuit Against Binance&nbsp;\n<p>The lawsuit filed by the Securities and Exchange Commission against Binance, Binance.US, and Binance CEO Changpeng Zhao accuses them of failing to register as an exchange or a broker-dealer clearing agency and offering customers unregistered securities. SEC Chair Gary Gensler also accused Binance of misleading its investors regarding their risk controls. Furthermore, the SEC also moved the court to freeze all assets belonging to Binance.US before reaching a compromise where only employees of the exchange could access client funds for the duration of the lawsuit.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-23T08:00:06.000Z",
    "title": "JPMorgan Managing Director Nikolaos Panigirtzoglou: Hinman Docs Are a ‘Boost to Ethereum’",
    "url": "https://news.bitcoin.com/jpmorgan-managing-director-nikolaos-panigirtzoglou-hinman-docs-are-a-boost-to-ethereum/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1930604210-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"JPMorgan Managing Director Nikolaos Panigirtzoglou: Hinman Docs Are A &quot;Boost To Ethereum.&quot;\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1930604210-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1930604210-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1930604210-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1930604210-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1930604210-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1930604210-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_1930604210.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Nikolaos Panigirtzoglou, a managing director at JPMorgan, believes the release of the Hinman docs in the Ripple vs. SEC case will influence crypto regulation. Panigirtzoglou stated this document release is likely to start a race for other cryptocurrency projects to become more decentralized and look &#8220;more like ethereum&#8221; to avoid being labeled as securities. JPMorgan [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T07:45:50.000Z",
    "title": "Cortical Labs Trains Human Brain Cells on Computer Chips for Advanced AI",
    "url": "https://www.cryptopolitan.com/cortical-labs-human-brain-cells-on-chips/",
    "description": "Cortical Labs, an Australian firm run by CEO Hon Weng Chong, has successfully taught human brain cells on a computer chip to play the classic video game Pong. This achievement marks a significant step towards harnessing the power of biological computers, which Chong believes can surpass traditional artificial intelligence (AI) systems and revolutionize various industries. ... <a title=\"Cortical Labs Trains Human Brain Cells on Computer Chips for Advanced AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cortical-labs-human-brain-cells-on-chips/\" aria-label=\"More on Cortical Labs Trains Human Brain Cells on Computer Chips for Advanced AI\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T08:00:38.000Z",
    "title": "Top Meme Coin Summer Spotlight 2023 With Massive Potential Gains",
    "url": "https://www.crypto-news-flash.com/top-meme-coin-summer-spotlight-2023-with-massive-potential-gains/?utm_source=rss&utm_medium=rss&utm_campaign=top-meme-coin-summer-spotlight-2023-with-massive-potential-gains",
    "description": "As the sun shines brighter, the crypto sphere is also lighting up with the blazing trail of meme coins. This unique top meme coin cryptocurrency is not just a fad but is, in fact, a symbol of a changing financial landscape. Offering a perfect blend of humor, pop culture, and serious investing, meme coins like [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-23T07:55:40.000Z",
    "title": "Binance to Destroy SEC And Gary Gensler With Former DOJ Prosecutor on Board in Billion Dollar Lawsuit",
    "url": "https://www.crypto-news-flash.com/binance-to-destroy-sec-and-gary-gensler-with-former-doj-prosecutor-on-board-in-billion-dollar-lawsuit/?utm_source=rss&utm_medium=rss&utm_campaign=binance-to-destroy-sec-and-gary-gensler-with-former-doj-prosecutor-on-board-in-billion-dollar-lawsuit",
    "description": "Binance Holdings hires former DOJ prosecutor as legal representative in SEC lawsuit, reinforcing its defense against allegations. The SEC charges Binance with mishandling customer funds, providing misleading information, and violating securities regulations, seeking the return of US customers&#8217; cryptocurrency. Strengthening the Legal Defense In a significant move to combat the ongoing legal battle with the [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-23T07:49:04.000Z",
    "title": "REAL Polygon Gaming Gem | 4X Your Passive Income!",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/real-polygon-gaming-gem-4x-your-passive-income/",
    "description": "<p>How about having an empty wallet, but you can still take part in a tournament and win your share of $35,000? Does that sound enticing? Well, you&#8217;re in the right place. I will give you the lowdown on how you can join The Red Village tournament for free. That&#8217;s because IQ Protocol launched their NFT [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/real-polygon-gaming-gem-4x-your-passive-income/\">REAL Polygon Gaming Gem | 4X Your Passive Income!</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]