[
  {
    "source": "CryptoSlate",
    "date": "2023-07-06T11:40:59.000Z",
    "title": "SEC, FTX, and Three Arrows Capital contest BlockFi’s bankruptcy plans",
    "url": "https://cryptoslate.com/sec-ftx-and-three-arrows-capital-contest-blockfis-bankruptcy-plans/",
    "description": "<p>The U.S. Securities and Exchange Commission (SEC), alongside bankrupt crypto firms FTX and hedge fund Three Arrows Capital (3AC), have objected to BlockFi&#8217;s bankruptcy plans, according to July 5 court filings. SEC opposes BlockFi&#8217;s plans In its filing, the SEC argued that the clauses in BlockFi&#8217;s proposed plans were ambiguous and broad, as they did not [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sec-ftx-and-three-arrows-capital-contest-blockfis-bankruptcy-plans/\">SEC, FTX, and Three Arrows Capital contest BlockFi&#8217;s bankruptcy plans</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-06T11:45:56.000Z",
    "title": "On Shibapendence Day, Shiba Inu (SHIB) Lead Developer Publishes Part 1 of Shibarium’s Worldpaper",
    "url": "https://www.cryptoglobe.com/latest/2023/07/on-shibapendence-day-shiba-inu-shib-lead-developer-publishes-part-1-of-shibariums-worldpaper/",
    "description": "The meme-based Shiba Inu (SHIB) project, which operates on the Ethereum blockchain, has been working on solving Ethereum’s limitations, including slow transaction speeds and high costs. This solution is Shibarium, a layer two blockchain, and it’s gearing up for its mainnet launch. Shytoshi Kusama, the pseudonymous lead developer of the Shiba Inu project, shared insights […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-06T12:00:45.000Z",
    "title": "LADYS Options on BIT Exchange paves new retail trading highway for meme coins",
    "url": "https://cryptodaily.co.uk/2023/07/ladys-options-on-bit-exchange-paves-new-retail-trading-highway-for-meme-coins",
    "description": "<p>DUBAI, DUBAI, July 6th, 2023, Chainwire</p><p>The options trading market gets another boost thanks to yet another collaboration between the cryptocurrency derivatives exchange BIT and the duo of Darley Technologies and DWF Labs.</p><p>Just recently, BIT rolled out options tied to Cardano's ADA token in collaboration with strategic partner Darley Technologies and market maker DWF Labs. Today, LADYS Options marks a significant milestone in the industry as the world's first Meme-coin Options brought to the market for both institutional and retail traders.</p><p>Options might be seen as an intimidating instrument for new traders or existing spot traders. This type of derivative gives the trader the right to buy or sell an underlying asset at a certain price on or before a specific date. The core functionalities of options are binary: the right to buy the asset is a call option, and the right to sell it is a put option.</p>\"Our intention is to simplify access to options trading for all traders, providing an interface that is simple to understand and instruments that are in line with what communities are passionate about. Meme-coins are an excellent way to engage people to learn options trading\" said Andrei Grachev, the Managing Partner of DWF Labs.\"We are proud to announce the listing of LADYS options as the world's first meme-coin options, made possible through the support of our esteemed partners, Darley Technologies and DWF Labs.\" Said Justin Buitendan, the Global Head of Institutional Sales of BIT, \"Meme coins have experienced rapid growth, and we are thrilled to provide our clients with an additional avenue to enhance their trading strategies. LADYS options mark the starting point of an exciting journey, and there are more exciting opportunities on the horizon.\"<p>The incredible popularity of the LADYS token, as well as the sudden sprout of related projects, made it the perfect candidate for the first Meme-coin Option to be traded, thanks to the alliance between BIT, DWF Labs, and Darley Technologies.</p><p></p><p>About BIT</p><p>BIT is a full-featured cryptocurrency exchange that is designed for use by professionals, with advanced risk management and fund efficiency supported by Portfolio Margin and Unified Margin.</p><p>BIT was launched in August 2020 as an affiliate to Matrixport, a prominent crypto financial service company. BIT is one of the top crypto options trading platforms which offer innovative USD-margined trading pairs.</p><p></p><p>About Darley Technologies</p><p>Darley Technologies is a pioneering liquidity provider for options trading in the cryptocurrency space, with a mission to provide deep and reliable liquidity at competitive prices. Based in Zug, Switzerland, the heart of Europe&rsquo;s blockchain ecosystem, Darley Technologies brings together teams of highly experienced scientists, developers and traders to design and engineer the most advanced network infrastructures, technology and trading algorithms, enabling it to successfully execute its mission across multiple venues worldwide.</p><p></p><p>About DWF Labs</p><p>DWF Labs is a global digital asset market maker and multi-stage web3 investment firm, providing support from token listing to market making to OTC trading solutions. DWF Labs seeks to invest and support bold founders who want to build the future of Web3.</p><p>DWF Labs is present in Singapore, Switzerland, South Korea, the BVI, and the UAE and trades almost 2,000 pairs with a daily volume that places DWF Labs among the top 5 ranking entities trading on the world&rsquo;s top 40 exchanges.</p><p></p><p class=\"ql-align-center\">Website | Portfolio | Linkedin | Twitter | Telegram | Medium</p><p></p>ContactManaging Partner DWF LabsAndrei Grachevmedia@dwf-labs.com"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-06T11:44:00.000Z",
    "title": "Multichain Tokens Lose Support On Binance",
    "url": "https://cryptodaily.co.uk/2023/07/multichain-tokens-lose-support-on-binance",
    "description": "<p>Binance no longer supports deposits and withdrawals for several cross-chain bridge tokens linked with the Multichain project.&nbsp;</p>\nBinance Suspends Multichain Support\n<p>In a recent development, Binance, one of the world's largest cryptocurrency exchanges, has announced that it is ending support for withdrawal and deposit for several Multichain-bridged tokens. From July 7 onwards, customers on networks like BNB Smart Chain, Fantom, Ethereum, and Avalanche will be unable to deposit or withdraw bridged tokens until further notice.&nbsp;</p>\n<p>It is important to note that the suspension only applies to specific tokens bridged to Multichain and does not affect the trading of other cryptocurrencies on Binance. Users can still trade and engage in transactions with the wide range of tokens available on the exchange.</p>\n<p>Some of the tokens affected by this decision are Polkastarter (POLS), Alchemy Pay (ACH), Beefy.Finance (BIFI), Harvest Finance (FARM), tokens minted through the bridge on Fantom, like Beefy.Finance (BIFI) and Alpaca Finance (ALPACA), and a token minted on Ethereum&rsquo;s bridge, Travala (AVA).</p>\nBinance Assures Funds Safety\n<p>Multichain is a cross-chain interoperability protocol. It enables the seamless transfer of assets between different blockchain networks and currently oversees over $1.3 billion in assets, with $698 million minted on Ethereum, $339 million minted on BNB Smart Chain, and $92 million on Fantom.&nbsp;</p>\n<p>However, Binance is taking no chances when it comes to safeguarding user funds. Although the team has assured customers that funds remain secure, the uncertainty around the matter is worrying users whose funds are stuck in the protocol.&nbsp;</p>\n<p>According to a Binance spokesperson, the temporary suspension of these services on the Binance platform is only a temporary risk management measure. Users can still trade the tokens on Binance and withdraw them using alternative networks. This means that as long as the assets do not involve the Multichain project, they can proceed as normal.&nbsp;</p>\nThe Multichain Complication\n<p>Although the team has not specified the exact reason behind this decision, it is implied that it is in response to the protocol&rsquo;s difficulties that occurred in May. During that period, the project experienced transactional difficulties with processing bridge transfers. Kava, zkSync, Polygon zkEVM, and several other pathways of the cross-chain bridge were not functioning properly.&nbsp;</p>\n<p>Multichain CEO Zhaojun was also unreachable and rumored to be taken into police custody. As a result, Binance suspended deposits for Multichain-bridged tokens on May 25, citing complications within the protocol. The recent suspension is just a follow-up to the previous action against Multichain.&nbsp;</p>\n<p>In conclusion, Binance's decision to suspend transfers of several tokens tied to Multichain is a proactive measure to ensure the security and stability of its users' funds. Users are advised to stay informed through official channels and await further updates from the exchange.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice. </p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T12:03:54.000Z",
    "title": "Danish regulator orders Saxo Bank to liquidate crypto holdings",
    "url": "https://www.cryptopolitan.com/danish-regulator-orders-saxo-bank-to-liquidate-crypto-holdings/",
    "description": "Denmark&#8217;s financial regulator, the Danish Financial Supervisory Authority (FSA), has ordered Saxo Bank, one of Europe&#8217;s largest online brokers, to liquidate its cryptocurrency holdings. The order, which came on Wednesday, comes as part of the FSA&#8217;s broader crackdown on crypto-related activities, citing concerns about financial stability and consumer protection. Violations and regulatory concerns The FSA ... <a title=\"Danish regulator orders Saxo Bank to liquidate crypto holdings\" class=\"read-more\" href=\"https://www.cryptopolitan.com/danish-regulator-orders-saxo-bank-to-liquidate-crypto-holdings/\" aria-label=\"More on Danish regulator orders Saxo Bank to liquidate crypto holdings\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T11:59:27.000Z",
    "title": "Explore 9 Valuable Generative AI Resources to Enhance Your Skills",
    "url": "https://www.cryptopolitan.com/valuable-generative-ai-resources/",
    "description": "Generative artificial intelligence (AI) has witnessed a recent surge, with tools like ChatGPT and Midjourney making it accessible to users of all backgrounds. While these tools have a low barrier to entry, there is still much to learn about maximizing their potential and understanding the underlying technology. To help you become a proficient AI operator ... <a title=\"Explore 9 Valuable Generative AI Resources to Enhance Your Skills\" class=\"read-more\" href=\"https://www.cryptopolitan.com/valuable-generative-ai-resources/\" aria-label=\"More on Explore 9 Valuable Generative AI Resources to Enhance Your Skills\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T11:56:55.000Z",
    "title": "Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?",
    "url": "https://www.cryptopolitan.com/cosmos-price-prediction/",
    "description": "Cosmos Price Prediction 2023-2032 Binance chief executive Changpeng Zhao likened the recent FTX collapse to the start of the 2008 financial crisis. Will its demise cause other crypto firms to fold? The debacle promises to have its repercussions in 2023 That&#8217;s the essential question, for now, is how will this affect our Cosmos Price Prediction? ... <a title=\"Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-price-prediction/\" aria-label=\"More on Cosmos Price Prediction 2023-2032: Will ATOM Recover ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T11:49:24.000Z",
    "title": "Stake Bonus Code: HELLAGOOD for 5% Rakeback",
    "url": "https://www.cryptopolitan.com/stake-bonus-code-hellagood-for-5-rakeback/",
    "description": "Stake.com is a portal that offers games of chance and sports gambling. Here you can get bonuses or take part in the VIP program. This online platform belongs to Medium Rare N.V. Its activity is licensed and complies with the law. The gambling establishment offers slots from leading developers, and bets on sports are provided ... <a title=\"Stake Bonus Code: HELLAGOOD for 5% Rakeback\" class=\"read-more\" href=\"https://www.cryptopolitan.com/stake-bonus-code-hellagood-for-5-rakeback/\" aria-label=\"More on Stake Bonus Code: HELLAGOOD for 5% Rakeback\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-06T11:47:30.000Z",
    "title": "13 Best CS:GO Gambling & Betting Sites in 2023",
    "url": "https://www.cryptopolitan.com/13-best-csgo-gambling-betting-sites-in-2023/",
    "description": "What makes CS:GO stand out from other games? This question can be answered in many different ways! The community, the graphics, the movement, the competitive scene, all must be mentioned! Although, what truly sets CS:GO apart is their fluid skin concept, which allows players to easily trade and sell all their in-game items! By having ... <a title=\"13 Best CS:GO Gambling &#38; Betting Sites in 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/13-best-csgo-gambling-betting-sites-in-2023/\" aria-label=\"More on 13 Best CS:GO Gambling &#38; Betting Sites in 2023\">Read more</a>"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-06T11:47:42.000Z",
    "title": "UAE Crowns as the Prime Destination of Bitcoin Mining",
    "url": "https://coinedition.com/uae-crowns-as-the-prime-destination-of-bitcoin-mining/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Bitcoin_mining_hash_rate_reaches_a_record_as_shift_to_renewables.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin_mining_hash_rate_reaches_a_record_as_shift_to_renewables\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Bitcoin_mining_hash_rate_reaches_a_record_as_shift_to_renewables.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Bitcoin_mining_hash_rate_reaches_a_record_as_shift_to_renewables-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Bitcoin_mining_hash_rate_reaches_a_record_as_shift_to_renewables-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Bitcoin_mining_hash_rate_reaches_a_record_as_shift_to_renewables-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Bitcoin_mining_hash_rate_reaches_a_record_as_shift_to_renewables-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>According to the latest analysis, the United Arab Emirates (UAE) has been emerging as a Bitcoin mining hub, making it a “prime destination” for Bitcoin miners in the Middle East. Jaran Mellerud, a Bitcoin enthusiast and mining expert, attributed the development of the West Asian country as a BTC mining spot to the UAE’s partnership [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/uae-crowns-as-the-prime-destination-of-bitcoin-mining/\">UAE Crowns as the Prime Destination of Bitcoin Mining</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-06T11:45:50.000Z",
    "title": "Analyst Updates Bitcoin and Ethereum Price Targets, Predicts Coming 18 Months Will Be an ‘Absolute Pleasure’",
    "url": "https://dailyhodl.com/2023/07/06/analyst-updates-bitcoin-and-ethereum-price-targets-predicts-coming-18-months-will-be-an-absolute-pleasure/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/18-Months-btc-eth.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/18-Months-btc-eth.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/18-Months-btc-eth.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/18-Months-btc-eth.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/18-Months-btc-eth.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/18-Months-btc-eth.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/18-Months-btc-eth.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The anonymous host of InvestAnswers is laying out bullish price targets for Bitcoin (BTC) and Ethereum (ETH). In a new video, the host tells his 445,000 YouTube subscribers that he wouldn’t be “surprised” if Bitcoin reaches $42,000 by April 2024. His prediction is based on the behavior of the options market. According to InvestAnswers, the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/06/analyst-updates-bitcoin-and-ethereum-price-targets-predicts-coming-18-months-will-be-an-absolute-pleasure/\">Analyst Updates Bitcoin and Ethereum Price Targets, Predicts Coming 18 Months Will Be an ‘Absolute Pleasure’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]