[
  {
    "source": "Cointelegraph",
    "date": "2023-11-13T21:18:53.000Z",
    "title": "APEC finance ministers to share perspectives on crypto at meeting in San Francisco",
    "url": "http://cointelegraph.com/news/apec-finance-ministers-cryptocurrency-meeting-san-francisco",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/53318694-7f56-4bd2-99e6-6909a6c84e86.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>U.S. Treasury Secretary Janet Yellen said she is looking forward to hearing from the finance ministers of some of the world’s most crypto-forward countries. </p>\n                    <p><p>The weeklong Asia-Pacific Economic Cooperation (APEC) summit began on Nov. 11 in San Francisco. The highlight of the event will surely be on the sidelines, when United States President Joe Biden and Chinese leader Xi Ping meet on Nov. 15, but with the focus of the organization being on the regional economy, the finance ministers’ meeting is also of primary importance.</p><p>U.S. Treasury Secretary Janet Yellen <a href=\"https://home.treasury.gov/news/press-releases/jy1904\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in her opening speech at the finance ministers’ meeting on Nov. 13 that they will discuss “priority areas [that] are oriented toward the long-term,” with a heavy emphasis on sustainability. They will also hold one session devoted to supply-side economics and another on digital assets. Yellen mentioned unbacked crypto-assets, stablecoin and central bank digital currency specifically.</p><p>“Sharing insights and engaging with the private sector has enabled us to deepen our collective understanding of the tools that policymakers can use to facilitate the responsible development and use of digital assets,” Yellen said. She added:</p><blockquote>“I look forward to hearing your perspectives on the long-term role that digital assets and blockchain technologies can play in our respective financial systems, as well as how your authorities plan to approach regulatory oversight of their development and use.”</blockquote><p>Yellen met with top Chinese economic official He Lifeng on Nov. 9 and 10. While cryptocurrency trading <a href=\"https://cointelegraph.com/news/chinese-regulators-unite-forces-to-crack-down-on-crypto\">has been effectively banned</a> in China since 2021, the country has taken a world-leading role in the development of central bank digital currency. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/vietnamese-web3-coalition-ninety-eight-launches-25-million-ecosystem-fund\">Vietnamese Web3 coalition Ninety Eight launches $25M ecosystem fund</a></em></strong></p><p>The perspectives Yellen will hear at today’s meeting may be at odds with her own position, as the Biden administration is widely <a href=\"https://cointelegraph.com/news/us-congressmen-chide-presidential-advisers-over-crypto-stances-in-economic-report\">seen as not strongly favorable</a> to crypto, and many <a href=\"https://cointelegraph.com/innovation-circle/europe-and-asia-not-the-us-will-lead-in-blockchain\">consider Asia to be taking</a> the lead in blockchain development. Asian economies have made notable strides <a href=\"https://cointelegraph.com/news/metaverse-dead-united-states-thriving-asia-sandbox-sebastien-borget\">in the metaverse</a>, <a href=\"https://cointelegraph.com/news/hong-kong-s-regulatory-lead-sets-it-up-to-be-major-crypto-hub\">crypto trading</a> and <a href=\"https://cointelegraph.com/news/half-of-asia-s-affluent-investors-have-crypto-in-their-portfolio-report\">adoption</a>.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I was honored to host APEC finance ministers at the California Academy of Sciences. It’s personally meaningful to welcome them to the San Francisco Bay Area, which I consider a second home. <a href=\"https://t.co/pBYiVhrxAd\">pic.twitter.com/pBYiVhrxAd</a></p>&mdash; Secretary Janet Yellen (@SecYellen) <a href=\"https://twitter.com/SecYellen/status/1724133593083941231?ref_src=twsrc%5Etfw\">November 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>APEC is made up of 21 Pacific-region “economies” in Asia, North America and South America. Membership is open to economies rather than countries to allow Hong Kong and Taiwan a place at the table without controversy. Ripple was a major (diamond-level) sponsor of the summit.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/chinas-surprise-nft-move-hong-kongs-15m-bitcoin-fund-asia-express/\">China’s surprise NFT move, Hong Kong’s $15M Bitcoin fund: Asia Express</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-13T21:14:33.000Z",
    "title": "Why is Solana (SOL) price down today?",
    "url": "http://cointelegraph.com/news/why-is-solana-sol-price-down-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/a909ccaf-9947-4a44-a64d-c9bfd8354210.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Despite a 11.3% correction in just two days, SOL maintains a robust position with healthy derivatives markets and on-chain metrics.</p>\n                    <p><p>Solana's native token (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>) experienced a remarkable 58.6% surge in just five days, reaching an $64 high on Nov. 11. However, the subsequent two-day retracement of 11.3% to $54 has prompted investors to question whether this signals a fading bullish momentum or merely a temporary price adjustment.</p><p>To put Solana's performance into context, let's compare it to other leading altcoins. Since its peak on Nov. 11, Avalanche (<a href=\"https://cointelegraph.com/avalanche-price-index\">AVAX</a>) has rallied by 17%, Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) gained 1%, while BNB Token (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) traded down 2%. This comparison underscores the fact that SOL has underperformed in the broader altcoin market. Therefore, the 5.5% daily decline on Nov. 13 is unlikely to be tied to macroeconomic or sector drivers, such as the <a href=\"https://cointelegraph.com/news/blackrock-argues-sec-has-no-grounds-to-treat-crypto-futures-and-spot-etfs-differently\">potential approval of a spot BTC exchange-traded fund</a> (ETF).</p><h2>Solana remains a top contender in terms of performance and on-chain activity</h2><p>Despite the recent decline in SOL's price, a 7-day gain of 35% suggests that investors should not hastily adopt a bearish outlook, as this could merely be a natural correction following Solana's significant outperformance. However, it's essential not to disregard Solana network's fundamentals, which include on-chain metrics and SOL's derivatives markets. Excessive leverage use by traders could potentially lead to forced liquidations, especially in perpetual contracts or inverse swaps, where funding rates play a crucial role.</p><p><a href=\"https://cointelegraph.com/explained/what-are-perpetual-futures-contracts-in-cryptocurrency\">Perpetual contracts</a>, also known as inverse swaps, carry an embedded rate that is typically charged every eight hours. A positive funding rate indicates that longs (buyers) are seeking more leverage, while the opposite situation arises when shorts (sellers) require additional leverage, leading to a negative funding rate.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/ae72a35f-aee0-4865-ad92-85943eb3a18d.png\"  /><figcaption style=\"text-align: center;\"><em>7-day funding rates at top exchanges. Source: CoinGlass</em></figcaption></figure><p>The 7-day funding rate for SOL aligns with that of BTC and ETH, pointing to a slightly higher demand for leverage longs. The 0.4% weekly cost is standard, considering that the cryptocurrency market capitalization has grown by 10.5% over the past two weeks, reaching $1.4 trillion, its highest level since May 2022.</p><p>Analyzing on-chain data from semi-centralized networks with very low transaction fees carries inherent risks, as inflating these metrics is relatively easy, particularly those related to decentralized finance (DeFi). A case in point is the revelation in August 2022 by a former developer from Saber, a previously esteemed decentralized exchange (DEX) on Solana, who <a href=\"https://markets.businessinsider.com/news/currencies/doj-said-to-probe-saber-labs-founders-over-solana-based-defi-stablecoin-projects-1032013390\" target=\"_blank\" rel=\"noopener nofollow\">disclosed</a> that a significant portion of the application's total value locked (TVL) was manipulated through double-counting.</p><p>Data providers have since improved their services to prevent such obvious inflation of metrics. Currently, Solana's TVL stands at $535 million, which, while a substantial figure, is relatively modest compared to its close competitors.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/858ce483-549f-4c83-8568-adda04a4d64d.png\"  /><figcaption style=\"text-align: center;\"><em>Blockchains TVL ranking in USD. Source: DefiLlama</em></figcaption></figure><p>It's noteworthy that Solana's network TVL lags behind Avalanche's $614 million, despite Solana's impressive $22.7 billion market capitalization. Similarly, Polygon's (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>) TVL is $840 million, while MATIC's market value stands at $8.2 billion, underscoring the disparity.</p><p>Moreover, the accumulation of 7-day fees for Solana's network, totaling $660,000, does not seem to justify significant future demand for the SOL token. Even if this number were to increase significantly, it would still fall short of the token supply increase, which has risen by 3.7% in the past 90 days, equivalent to $65 million per week.</p><p>In addition to the regular issuance of SOL, there's the vesting schedule related to the failed FTX-Alameda Research exchange. The bankruptcy estate has been permitted to <a href=\"https://cointelegraph.com/news/ftx-estate-stakes-55m-solana-coins\">sell up to $100 million in digital assets</a> per week, including 55.75 million SOL in September 2023.</p><h2>NFT data shows Solana is a top contender </h2><p>Solana's emergence as a strong player in the non-fungible token (NFT) market was one of its notable selling points, given the high costs associated with issuing and maintaining collections on Ethereum, the leading blockchain. However, this advantage has not been sufficient to attract the highest-value items and whales to Solana's NFT markets.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/china-declares-stealing-digital-collections-like-nfts-liable-for-criminal-theft-sentence\"><strong><em>China declares stealing digital collections like NFTs liable for criminal theft sentence</em></strong></a></p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/55bf994d-6b00-4b36-b8e7-67facd0f85d0.png\"  /><figcaption style=\"text-align: center;\"><em>Blockchains by NFT sales volumes in USD, 7-days. Source: CryptoSlam</em></figcaption></figure><p>Despite the 7-day average transaction fee on the Ethereum network increasing to the current $7.6, its total weekly NFT volume continues to outpace Solana's by more than 7 times. This data underscores that investors and creators consider factors beyond transaction costs. Nevertheless, Solana maintains a significant position in the market, alongside the leaders, Bitcoin and Ethereum networks.</p><p>Even though SOL price corrected by 5.5%on Nov. 13, it does not necessarily reflect a decline in network activity or reduced demand for leverage longs using futures contracts. However, it does indicate that investors have taken notice of SOL's seemingly excessive market capitalization compared to its peers. The extent of this correction remains uncertain.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-11-13T21:12:52.000Z",
    "title": "Anthony Pompliano Analyzes Crypto Trends: Spot Ethereum ETFs, Bitcoin’s Future, and Institutional Interest",
    "url": "https://www.cryptoglobe.com/latest/2023/11/anthony-pompliano-analyzes-crypto-trends-spot-ethereum-etfs-bitcoins-future-and-institutional-interest/",
    "description": "Anthony Pompliano, who runs Pomp Investments, recently appeared on the Fox Business show “The Claman Countdown” (hosted by Liz Claman) to discuss several key topics in the cryptocurrency space. Anthony “Pomp” Pompliano is an entrepreneur and technology investor. He runs his family office, which makes private investments, along with owning majority stakes in a number […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-13T21:30:24.000Z",
    "title": "Under New Leadership, Terraform Labs Acquires Cross-Chain Analytics Firm Pulsar Finance",
    "url": "https://news.bitcoin.com/under-new-leadership-terraform-labs-acquires-cross-chain-analytics-firm-pulsar-finance/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/202020-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Under New Leadership, Terraform Labs Acquires Cross-Chain Analytics Firm Pulsar Finance\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/202020-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/202020-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/202020-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/202020-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/202020-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/202020-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/202020.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />In a recent development, Terraform Labs has completed the acquisition of Pulsar Finance, a firm specializing in cross-chain analytics and portfolio management. The acquisition occurs as Terraform&#8217;s former CEO Do Kwon remains incarcerated in Montenegro and a U.S. Securities and Exchange Commission (SEC) lawsuit alleging multi-billion dollar fraud hangs over his head. Pulsar Finance Joins [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-13T21:38:44.000Z",
    "title": "GROK whales decry supposed FUD from crypto sleuth ZachXBT",
    "url": "https://crypto.news/grok-whales-decry-supposed-fud-from-crypto-sleuth-zachxbt/",
    "description": "The market cap of AI-inspired altcoin $GROK fell sharply on Nov. 13 after well-known blockchain investigator ZachXBT tied its creator to previous possible scams. Supporters of a Grok token, $GROK, banded together in the wake of aspersions surrounding the project&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-13T21:35:37.000Z",
    "title": "Grayscale’s Bitcoin Trust Discount Narrows, Fueling Crypto Market Excitement",
    "url": "https://www.crypto-news-flash.com/grayscales-bitcoin-trust-discount-narrows-fueling-crypto-market-excitement/?utm_source=rss&utm_medium=rss&utm_campaign=grayscales-bitcoin-trust-discount-narrows-fueling-crypto-market-excitement",
    "description": "<img width=\"2560\" height=\"1633\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-3137984-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-3137984-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-3137984-300x191.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-3137984-1024x653.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-3137984-312x198.jpg 312w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Recent data shows that the Grayscale Bitcoin Trust discount has narrowed from a record high of around 50 percent during the collapse of the FTX exchange. Market optimism is at a record high with Bitcoin and Ethereum leading, driven primarily by institutional interest. Market optimism seems to be at a record high as the year [...]"
  }
]