[
  {
    "source": "CoinDesk",
    "date": "2023-10-06T15:26:42.000Z",
    "title": "Sam Bankman-Fried Ordered ‘Special Privileges’ for Alameda, FTX Co-Founder Gary Wang Testifies ",
    "url": "https://www.coindesk.com/policy/2023/10/06/sam-bankman-fried-ordered-special-privileges-for-alameda-ftx-co-founder-gary-wang-testifies/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "“Sam told me to make sure Alameda’s accounts would never get liquidated on FTX,” Wang said."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-06T15:14:47.000Z",
    "title": "Bitcoin price dives 2% on US jobs data as Fed rate hike bets heat up",
    "url": "https://cointelegraph.com/news/bitcoin-price-dives-us-jobs-data-fed-rate-hike",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/c15ef103-4f3e-4767-9986-bde3d147b256.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin briefly heads back down to $27,000 thanks to unexpected non-farm payrolls numbers, with BTC price staging a strong recovery.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) saw a snap retest of $27,000 around the Oct. 6 Wall Street open as wildcard United States employment data rattled markets.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/90e5e359-247b-41ae-bbc3-f061dc2d9f10.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><h2>Analysis: Jobs data \"not what Fed wanted to see\"</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> followed BTC price action as the largest cryptocurrency lost 2.1% in a single hourly candle.</p><p>A subsequent rebound saw bulls recover those losses, with $27,700 — <a href=\"https://cointelegraph.com/news/bitcoin-bulls-pressure-28k-calls-btc-price-dip\">the area of interest</a> from before the data release — now back in focus.</p><p>The volatility came thanks to U.S. non-farm payrolls (NFP) jumping to almost double the number expected for September — 336,000 versus 170,000, respectively.</p><p>Demonstrating the labor market’s ongoing resilience to the Federal Reserve's counterinflation measures in the form of interest rate hikes, the implications of the September result were nonetheless viewed as bad for risk assets — including crypto.</p><p>“Good news is bad news since the FED wants the labor market to lose strength,” popular trader CrypNuevo <a href=\"https://twitter.com/CrypNuevo/status/1710293196960415870\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> in part of a response on X.</p><blockquote>“Given this increase, it surprises me that the unemployment rate stayed the same (3.8%). So I believe that the data will be revised down and it'll be much lower.”</blockquote><p>Like others, CrypNuevo nonetheless eyed the increasing likelihood of another rate hike from the Fed at the November meeting of the Federal Open Market Committee (FOMC).</p><p>“The market understands this data as a new threat for a potential new 25bsp hike in November 1st (25% probabilities given yesterday vs 31.3% probabilities today),” he continued, referencing data from CME Group’s <a href=\"https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html\" target=\"_blank\" rel=\"noopener nofollow\">FedWatch Tool</a>.</p><blockquote>“We have CPI on Thursday next week and that'll hopefully give us a clearer view.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/69871838-23b2-4020-8d65-b17f2eab33c8.png\"  /><figcaption style=\"text-align: center;\"><em>Fed target rate probabilities chart. Source: CME Group</em></figcaption></figure><p>CPI, or the Consumer Price Index, forms one of the key inflation indicators for Fed policy.</p><p>Continuing, financial commentary resource The Kobeissi Letter suggested that pressure was now on both markets and the Fed itself.</p><p>“Furthermore, the Fed pause was previously expected until June 2024, now a pause is expected until July 2024,” it <a href=\"https://twitter.com/KobeissiLetter/status/1710278841451610519\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> on market projections for rate tweaks. </p><blockquote>“Market futures just fell 400+ points after the report. This is NOT what the Fed wanted to see.”</blockquote><h2>Bitcoin open interest drains</h2><p>Looking at Bitcoin’s specific reaction, popular trader Skew showed spot and derivatives traders exiting on the NFP print.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-still-beats-us-dollar-eggflation-federal-reserve\">Bitcoin still beating US dollar versus ‘eggflation’ — Fed data</a></em></strong></p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Spot sold &amp; perps puked after the jump in NFP <br><br>shorts chasing a bit more here<br><br>Likely PvP for rest of the morning <a href=\"https://t.co/7faaQLfur5\">https://t.co/7faaQLfur5</a></p>&mdash; Skew Δ (@52kskew) <a href=\"https://twitter.com/52kskew/status/1710274279223464392?ref_src=twsrc%5Etfw\">October 6, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“Slight probability shift on Nov 1 towards a hike but still unlikely,” a further prognosis for Fed action <a href=\"https://twitter.com/52kskew/status/1710290448680456473\" target=\"_blank\" rel=\"noopener nofollow\">read</a>.</p><blockquote>“Would need to see FED tone &amp; posturing first to weigh the probability.”</blockquote><p>Updating analysis from earlier in the day, meanwhile, fellow trader Daan Crypto Trades highlighted declining Bitcoin open interest (OI).</p><p>Previously, this had hit levels which previously initiated spurts of upside followed by downside volatility.</p><p>“That's another $600M in Open Interest lost since yesterday's high. Getting to the more average and ‘healthy’ levels again,” he summarized.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/ba3d7a73-7df6-42ce-93f7-5d064d2f9624.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD chart with aggregated OI. Source: Daan Crypto Trades/X</em></figcaption></figure><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-06T15:14:37.000Z",
    "title": "UK Watchdog Investigates Snapchat’s AI Chatbot Over Child Privacy Concerns",
    "url": "https://www.cryptopolitan.com/watchdog-investigates-snapchats-ai-chatbot/",
    "description": "The UK&#8217;s Information Commissioner&#8217;s Office (ICO) has raised concerns about Snapchat&#8217;s artificial intelligence (AI) chatbot, &#8220;My AI,&#8221; and its potential impact on the privacy of children and other users. The ICO&#8217;s provisional findings, released on Friday, suggest that Snap, the US company behind Snapchat, may have failed to adequately assess the privacy risks associated with ... <a title=\"UK Watchdog Investigates Snapchat&#8217;s AI Chatbot Over Child Privacy Concerns\" class=\"read-more\" href=\"https://www.cryptopolitan.com/watchdog-investigates-snapchats-ai-chatbot/\" aria-label=\"More on UK Watchdog Investigates Snapchat&#8217;s AI Chatbot Over Child Privacy Concerns\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-06T15:30:16.000Z",
    "title": "These Bitcoin Holders Have Bought Almost $2 Billion In Last 6 Weeks: Data",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-holders-bought-almost-2-billion-weeks/",
    "description": "On-chain data shows that mid to large Bitcoin holders have purchased almost $2 billion in the asset during the past six weeks. Bitcoin Holders With 1 To 10,000 BTC Have Neared All-Time High Holdings According to data from the on-chain analytics firm Santiment, the mid to large-sized BTC addresses have added 71,555 BTC to their holdings recently. The relevant indicator here is the &#8220;BTC Supply Distribution,&#8221; which keeps track of the total amount of Bitcoin that each holder group in the market is holding right now. The investors or addresses are divided into these cohorts based on the total number of tokens that they are currently carrying. The 1-10 coins group, for instance, includes all holders who own at least 1 and at most 10 BTC. Related Reading: This Ethereum Metric Is Retesting The Bear-Bull Junction, Will Break Happen? If the Supply Distribution is applied to this specific cohort, it would tell us about the total amount of the asset that the addresses on the network fulfilling this condition are currently holding as a whole. In the context of the current discussion, the mid and large-sized investors in the market are of interest. Typically, these are the addresses ranging between 1 and 10,000 BTC. Here is a chart that shows the trend in the combined Bitcoin Supply Distribution for all the cohorts falling inside this particular coin range over the past few months: Looks like the value of the metric has surged in recent days &#124; Source: Santiment on X This wallet range covers a variety of groups, with the two most notable being the sharks and whales. The sharks are generally the entities with 100-1,000 BTC, while the whales are those with 1,000-10,000 BTC. Both of these cohorts carry some power in the sector, because of the sheer size of their holdings. The whales, however, carry significantly more influence than the sharks, a natural consequence of their balances being much larger. The rest of the investors inside this range (those with 1-100 BTC) are considered mid-sized holders, who may not be relevant individually, but as a whole, they can have a notable presence in the market. From the graph, it&#8217;s visible that the combined holdings of all these groups have been heading up recently, implying that buying has been taking place. During the past six weeks alone, these investors have purchased a total of 71,155 BTC, which is equivalent to about $1.97 billion at the current exchange rate. With this latest accumulation spree, the total holdings of these Bitcoin investors have hit about 15.2 million BTC, which is the largest amount that they have held since January 2022. Related Reading: XRP, Polygon See Month-High Volumes As Investors Show FOMO Not just that, their current holdings are also just 90,000 BTC shy from their all-time high back in November 2021, where they owned about 15.29 million tokens of the asset. As is visible from the chart, the indicator has observed some particularly sharp growth during the past week or so, suggesting that these holders believe the current prices are worth buying at. BTC Price Bitcoin hasn&#8217;t moved much since its pullback a few days ago as its price is still trading around the $27,700 mark. The value of the metric seems to have been moving sideways in the past few days &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Santiment.net"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-06T15:30:05.000Z",
    "title": "Bitcoin, Litecoin, and Binance Coin Hardware Wallet Maker Ledger Cuts 12% of Staff",
    "url": "https://www.crypto-news-flash.com/bitcoin-litecoin-and-binance-coin-hardware-wallet-maker-ledger-cuts-12-of-staff/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-litecoin-and-binance-coin-hardware-wallet-maker-ledger-cuts-12-of-staff",
    "description": "<img width=\"1920\" height=\"1277\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance.US\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binance-bnb-1-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />CEO of Ledger confirms employee layoff in a recent announcement.  The new development comes not long after Binance and Coinbase collectively cut down on their staff.  Ledger has announced that it will be reducing its existing staff members by 22% going forward. The hardware crypto wallet manufacturer Ledger, is currently home to more than 734 [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-06T15:35:00.000Z",
    "title": "MATIC Price Dips Despite Polygon 2.0 Upgrade Hype",
    "url": "https://coinedition.com/matic-price-dips-despite-polygon-2-0-upgrade-hype/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Analyst_Shares_Want_Needs_to_Happen_for_MATIC_to_Break_Through.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Analyst_Shares_Want_Needs_to_Happen_for_MATIC_to_Break_Through.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Analyst_Shares_Want_Needs_to_Happen_for_MATIC_to_Break_Through-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Analyst_Shares_Want_Needs_to_Happen_for_MATIC_to_Break_Through-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Analyst_Shares_Want_Needs_to_Happen_for_MATIC_to_Break_Through-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Analyst_Shares_Want_Needs_to_Happen_for_MATIC_to_Break_Through-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Analyst_Shares_Want_Needs_to_Happen_for_MATIC_to_Break_Through-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Polygon (MATIC) market has witnessed significant adverse sentiment in the recent 24 hours, with prices plummeting to an intraday low of $0.5458 despite the launch of the Polygon 2.0 upgrade. Consequently, MATIC was trading at $0.5543 at press time, down 1.44% from its intraday high. The adverse attitude might be linked to profit-taking by [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/matic-price-dips-despite-polygon-2-0-upgrade-hype/\">MATIC Price Dips Despite Polygon 2.0 Upgrade Hype</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]