[
  {
    "source": "NewsBTC",
    "date": "2023-06-27T02:55:42.000Z",
    "title": "Bitcoin Price Aims Higher But 100 SMA Is The Key",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-aims-higher-30500/",
    "description": "Bitcoin price is attempting a fresh increase from the $30,000 zone. BTC could gain bullish momentum if it clears $30,500 and the 100 hourly SMA. Bitcoin is holding gains above the $30,000 support zone. The price is trading below $30,500 and the 100 hourly Simple moving average. There is a key bearish trend line forming with resistance near $30,500 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could start a fresh increase if it clears $30,500 and the 100 hourly SMA. Bitcoin Price Holds Key Support Bitcoin price started a downside correction below the $30,500 support. BTC even spiked below the $30,000 support zone but the downsides were limited. A low is formed near $29,914 and the price is now slowly moving higher. It traded above the 23.6% Fib retracement level of the recent downside correction from the $31,435 swing high to the $29,914 low. It is now trading above the $30,250 level. Bitcoin price seems to be facing resistance near $30,500 and the 100 hourly Simple moving average. There is also a key bearish trend line forming with resistance near $30,500 on the hourly chart of the BTC/USD pair, above which the bulls might attempt a fresh increase in the coming sessions. The first major resistance is near the $30,850 level. It is close to the 61.8% Fib retracement level of the recent downside correction from the $31,435 swing high to the $29,914 low, above which the price might revisit the $31,400 resistance zone. Source: BTCUSD on TradingView.com The next major resistance is near the $32,000 level. A close above the $32,000 resistance might send BTC toward $32,500. Any more gains could send the price toward the $33,200 resistance zone. More Losses in BTC? If Bitcoin’s price fails to clear the $30,500 resistance, it could continue to move down. Immediate support on the downside is near the $30,000 level or the $29,914 low. The next major support is near the $29,550 level, below which there could be a drop toward the $29,200 support. Any more losses might send the price toward $28,500 in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is above the 50 level. Major Support Levels – $30,000, followed by $29,550. Major Resistance Levels – $30,500, $30,850, and $31,400."
  }
]