[
  {
    "source": "Cointelegraph",
    "date": "2024-02-23T17:27:37.000Z",
    "title": " 3AC’s creditors must file dividend claims by March, says Teneo ",
    "url": "https://cointelegraph.com/news/3ac-creditors-must-file-dividend-claims-march-says-teneo",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMGU0ODEyNjItMmUwYS00OTc5LTk5NzItYjVhNThhZmQ5ZGZiLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Three Arrows Capital’s liquidators intend to pay interim dividends to creditors on or around March 31, 2024. Claims must be submitted by March 14. </p>\n                    <p><p>Creditors for the bankrupt crypto hedge fund Three Arrows Capital (3AC) have less than a month to submit claims to be considered for an upcoming dividend distribution. </p><p>According to a notice from Teneo, the firm tasked with liquidating 3AC’s assets, creditors who haven't submitted their claims must do so this March 14 by sending a written letter to an address in the British Virgin Islands. </p><p>In addition, creditors who have submitted claims but have not received a confirmation letter or receipt should also contact Teneo:</p><p><a href=\"https://cointelegraph.com/news/3ac-creditors-must-file-dividend-claims-march-says-teneo\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-02-23T17:15:19.000Z",
    "title": "Avalanche suffers downtime of nearly five hours",
    "url": "https://cryptobriefing.com/avalanche-suffers-downtime-nearly-five-hours/",
    "description": "Block production was interrupted when a logic error resulted in the transmission of excessive information between peers."
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-23T17:21:05.000Z",
    "title": "Trump’s Economic Warnings vs. Bidenomics Success: A Paul Krugman Analysis",
    "url": "https://www.cryptoglobe.com/latest/2024/02/trumps-economic-warnings-vs-bidenomics-success-a-paul-krugman-analysis/",
    "description": "In a recent opinion piece for The New York Times, published on February 22, economist Paul Krugman offers an optimistic evaluation of the U.S. economy’s performance in 2023. Paul Krugman is a renowned American economist, author, and public intellectual. He was awarded the prestigious Nobel Memorial Prize in Economics in 2008 for his work on […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-23T17:22:11.000Z",
    "title": "Stellar (XLM) Is Moving Sideways, VeChain (VET) Up Over 59% - Pullix (PLX) Receives Massive Projections Following BitMart Listing Announcement",
    "url": "https://cryptodaily.co.uk/2024/02/stellar-xlm-is-moving-sideways-vechain-vet-up-over-59-pullix-plx-receives-massive-projections-following-bitmart-listing-announcement",
    "description": "VeChain (VET) has undergone serious price movements during the past trading sessions and is now towards a path of reaching far more significant gains. Stellar (XLM)"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-23T17:12:03.000Z",
    "title": "The Metable Project: Leveraging Blockchain, VR, and Metaverse to Transform Online Education",
    "url": "https://cryptodaily.co.uk/2024/02/the-metable-project-leveraging-blockchain-vr-and-metaverse-to-transform-online-education",
    "description": "While the online education industry is speculated to reach the $199 billion mark by 2030, the sector faces a few challenges that could hinder this growth. Amongst these obstacles are a lack of proper incentives for educators, a dearth of social interaction, and rising costs. These sticking points, according to experts, have halted imminent expansion, prompting the need for a sustainable, efficient, and cost-effective solution."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T17:38:24.000Z",
    "title": "Bitcoin miners challenge US government over data disclosure demands",
    "url": "https://www.cryptopolitan.com/bitcoin-miners-challenge-us-government/",
    "description": "Bitcoin miners in the United States have taken a decisive stand against what they perceive as overreach by the US government regarding data disclosure demands. The Texas Blockchain Council (TBC) and Riot Platforms have commenced legal proceedings against the US Energy Information Administration (EIA), citing concerns over privacy invasion and regulatory excess. Unprecedented data requests [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T17:37:50.000Z",
    "title": "BinaryX Launches 404 Token in Its First Initial Game Offering of 2024",
    "url": "https://www.cryptopolitan.com/binaryx-404-toke-first-game-offering-of-2024/",
    "description": "BinaryX, a leading Web3 gaming platform, has officially announced the launch of its first Initial Game Offering (IGO) for the year 2024, introducing the 404 token to the gaming and blockchain community.&#160; The move marks a significant milestone in the platform&#8217;s ongoing efforts to innovate and expand its ecosystem within the rapidly evolving Web3 space. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T17:35:54.000Z",
    "title": "Flare Network Secures $35 Million in Funding to Bolster Layer-1 Blockchain Ecosystem",
    "url": "https://www.cryptopolitan.com/flare-network-35-mil-fund-layer-1-blockchain/",
    "description": "In a significant development for the blockchain industry, Flare, a layer-1 network renowned for its focus on data and smart contract protocols, has completed a private funding round, raising $35 million.&#160; The round saw participation from notable investors including Kenetic and Aves Lair, underscoring the growing interest and confidence in Flare&#8217;s potential to revolutionize the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T17:34:00.000Z",
    "title": "Farcaster Expands Blockchain Integration, Introducing Solana Support as a Leading Feature",
    "url": "https://www.cryptopolitan.com/farcaster-blockchain-integration-solana/",
    "description": "Farcaster, the burgeoning social media platform favored by the cryptocurrency community, has taken a significant leap forward by integrating support for Solana blockchain addresses, marking a pivotal enhancement in its user verification process.&#160; As announced by Farcaster&#8217;s founder Dan Romero, this development signifies a notable expansion in the platform&#8217;s blockchain compatibility, ensuring a more inclusive [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T17:31:32.000Z",
    "title": "Uniswap Foundation Proposes Incentivization Scheme for UNI Token Holders",
    "url": "https://www.cryptopolitan.com/uniswap-foundation-incentivization-uni-token/",
    "description": "In a significant move aimed at revamping the governance dynamics of Uniswap, the leading decentralized exchange platform, the Uniswap Foundation has put forth a proposal that seeks to introduce a series of enhancements designed to foster a more engaged, thoughtful, and actively participating community of UNI token holders.&#160; The proposal, if adopted, promises to reshape [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T17:19:44.000Z",
    "title": "Axie Infinity co-founder’s wallets were compromised in a hacking incident",
    "url": "https://www.cryptopolitan.com/axie-infinity-co-founders-wallets/",
    "description": "In a recent development, Jeffrey Zirlin, co-founder of Sky Mavis, the company behind the popular blockchain-based game Axie Infinity, has confirmed that two of his wallets fell victim to a hacking incident on Friday.&#160; However, Zirlin moved swiftly to assure the public that the security breach did not extend to the Ronin sidechain, which hosts [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-23T17:15:35.000Z",
    "title": "Judge approves FTX’s sale of Anthropic shares",
    "url": "https://www.cryptopolitan.com/judge-approves-ftxs-sale-of-anthropic-shares/",
    "description": "The bankruptcy proceedings of FTX took a significant leap forward this Thursday, following a decisive nod from the court. The green light was given for FTX to proceed with the sale of its stakes in Anthropic, an entity at the forefront of AI innovation. FTX is set to part ways with an 8% holding in [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-23T17:30:00.000Z",
    "title": "Investors chose DeeStream over Bitcoin Cash and Algorand",
    "url": "https://crypto.news/investors-chose-deestream-over-bitcoin-cash-and-algorand/",
    "description": "Trends show that one project, DeeStream (DST), may outperform altcoins like Bitcoin Cash (BCH) and Algorand (ALGO)"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-23T17:23:26.000Z",
    "title": "China’s authorities to crack down on rising blockchain, metaverse crime",
    "url": "https://crypto.news/china-blockchain-metaverse-crime/",
    "description": "China’s Supreme People's Procuratorate promised punishment for criminals utilizing blockchain technology and metaverse projects for nefarious operations. "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-23T17:18:47.000Z",
    "title": "Uniswap Foundation Unveils Major Upgrade Plan, UNI Price Skyrockets 52%",
    "url": "https://www.newsbtc.com/news/uniswap/uniswap-foundation-unveils-major-upgrade-plan-uni-price-skyrockets-52/",
    "description": "Uniswap (UNI), one of the industry&#8217;s largest decentralized cryptocurrency exchanges (DEXs), has set the stage for a major shift in its ecosystem with a proposed upgrade that could have significant implications for UNI token holders.  The upgrade aims to bolster governance participation, enhance resilience, and reward token holders for active engagement within the Uniswap ecosystem. Uniswap Takes Big Leap In Governance Uniswap Foundation (UF) Lead Developer Erin Koen, while expressing his enthusiasm, has suggested that it has been the &#8220;biggest week in Uniswap Protocol Governance&#8221; and revealed a major upgrade proposal for the system. At the heart of the proposed upgrade lies a fee mechanism designed to reward UNI token holders who stake and delegate their tokens. As announced, by actively participating in the governance process, token holders can earn additional rewards in the form of protocol fees.  In addition to the enhanced rewards, the proposed upgrade seeks to fortify Uniswap Governance, making it “more resilient and decentralized.”  According to Koen, by increasing the number of actively involved token holders, the governance structure becomes more robust, ensuring that decisions align with the collective interests of the UNI community.  The proposed upgrade maintains governance control over core parameters such as fee-charged pools and fee magnitude. Token holders will collectively decide on these critical aspects, allowing for flexibility and adaptability in response to market dynamics.  Related Reading: Avalanche C-Chain Experiences Block Production Halt, AVAX Price Responds Beyond the immediate benefits, the proposed upgrade holds the potential for long-term value appreciation of the UNI token. By incentivizing participation and aligning token holders&#8217; interests with the ecosystem&#8217;s success, Uniswap aims to foster organic growth and adoption.  Assuming a successful on-chain vote, the community will have the option to activate fees. Gauntlet, a trusted entity, is reportedly preparing a proposed roll-out process that will be shared on the forum.  Only after completing this separate governance process will fees be collected and distributed according to the adopted contracts. Koen further noted: We’re excited to invigorate governance – incentivizing not only delegation but thoughtful and active delegation – by tying delegation to protocol fees. Specifically, we believe UNI token holders will be incentivized to choose delegates whose votes and engagement with the protocol will lead to the Protocol’s growth and success. If this proposal succeeds we believe we will see an influx of new delegations. UNI Records 23-Month High As these developments unfold, considerable excitement has emerged around the Uniswap protocol. Notably, a cryptocurrency investor named &#8220;Virtual Bacon&#8221; expressed enthusiasm, stating, &#8220;Uniswap finally proposes to share revenue with UNI token stakers. Chart exploding on this &#8216;proposal&#8217; which hasn&#8217;t passed yet.&#8221;  Within 24 hours, the UNI token witnessed a surge of over 52%, signaling the market&#8217;s anticipation of the potential benefits this upgrade could offer token holders. Currently, the UNI token is trading at $11.29. However, with the unveiling of the upgrade proposal, the token quickly surged to the $12.50 level, reaching its highest point in 23 months.  The gains over longer time frames have also experienced a dramatic surge. Over the past fourteen days, the UNI token has seen an impressive increase of 73%. Similarly, the token&#8217;s value has soared by 94% in the last thirty days.  Related Reading: Cardano (ADA) Faces Critical Sell Signal: Crypto Analyst Raises Alarm Overall, should the proposed upgrade be approved and implemented, Uniswap will reinforce its position as a leading DEX and establish a framework that empowers token holders and fosters the continued growth and success of the Uniswap protocol. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-23T17:32:13.000Z",
    "title": "Polygon (MATIC) Chart Pattern Indicates Potential 90% Surge, Analysts Say: Here’s What to Know",
    "url": "https://www.crypto-news-flash.com/polygon-matic-chart-pattern-indicates-potential-90-surge-analysts-say-heres-what-to-know/?utm_source=rss&utm_medium=rss&utm_campaign=polygon-matic-chart-pattern-indicates-potential-90-surge-analysts-say-heres-what-to-know",
    "description": "<img width=\"2133\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logo-on-dark-purple-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polygon-MATIC-logo-on-dark-purple-background\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logo-on-dark-purple-background.jpg 2133w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logo-on-dark-purple-background-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logo-on-dark-purple-background-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logo-on-dark-purple-background-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logo-on-dark-purple-background-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logo-on-dark-purple-background-2048x1152.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logo-on-dark-purple-background-150x84.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logo-on-dark-purple-background-450x253.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Polygon-MATIC-logo-on-dark-purple-background-1200x675.jpg 1200w\" sizes=\"(max-width: 2133px) 100vw, 2133px\" />Prominent crypto analyst Ali Martinez has made a bullish Polygon (MATIC) prediction, foreseeing a 90% surge based on investor behavior. With the altcoin forming lower highs and higher lows, this could lead to a breakout or breakdown. Polygon (MATIC) is poised for a period of volatility based on its technical setup. Prominent crypto analyst Ali [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-23T17:13:52.000Z",
    "title": "Ripple News: XRP Primed for Explosive Surge- Forbes Predicts ‘Face-Ripping Rally’",
    "url": "https://www.crypto-news-flash.com/ripple-news-xrp-primed-for-explosive-surge-forbes-predicts-face-ripping-rally/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-news-xrp-primed-for-explosive-surge-forbes-predicts-face-ripping-rally",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-04T131931.050.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-04T131931.050.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-04T131931.050-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-04T131931.050-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/01/unnamed-2024-01-04T131931.050-450x300.jpg 450w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Forbes contributor Billy Bambrough suggests that the crypto market, especially Bitcoin and XRP, is on the verge of significant bullish rallies. Bitcoin&#8217;s price has doubled in the past year, leading analysts to revise their forecasts upward, with predictions of further growth. Forbes senior contributor Billy Bambrough has emphasized the potential for digital currencies like XRP [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2024-02-23T17:18:00.000Z",
    "title": "ETFs Will Create New Demand For Bitcoin and Exacerbate The Current Bull Run: Yusko",
    "url": "https://coinedition.com/etfs-will-create-new-demand-for-bitcoin-and-exacerbate-the-current-bull-run-yusko/",
    "description": "<img width=\"696\" height=\"392\" src=\"https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-ETF-3-696x392-1-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"ETFs Will Create New Demand For Bitcoin and Exacerbate The Current Bull Run: Yusko\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-ETF-3-696x392-1-1.jpg 696w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-ETF-3-696x392-1-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-ETF-3-696x392-1-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-ETF-3-696x392-1-1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-ETF-3-696x392-1-1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-ETF-3-696x392-1-1-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-ETF-3-696x392-1-1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-ETF-3-696x392-1-1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-ETF-3-696x392-1-1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-ETF-3-696x392-1-1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-ETF-3-696x392-1-1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-ETF-3-696x392-1-1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-ETF-3-696x392-1-1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-ETF-3-696x392-1-1-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/02/Bitcoin-ETF-3-696x392-1-1-355x200.jpg 355w\" sizes=\"(max-width: 696px) 100vw, 696px\" /><p>The managing director of Morgan Creek Capital Management, Mark Yusko, believes investors will convert more money from fiat to Bitcoin in 2024 than the previous 15 years of Bitcoin’s existence. Mark made the statement during an interview with Austin Arnold on the latter’s crypto YouTube channel, Altcoin Daily. In a recently uploaded video, Yusko noted [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/etfs-will-create-new-demand-for-bitcoin-and-exacerbate-the-current-bull-run-yusko/\">ETFs Will Create New Demand For Bitcoin and Exacerbate The Current Bull Run: Yusko</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]