[
  {
    "source": "CryptoSlate",
    "date": "2024-03-26T20:00:50.000Z",
    "title": "Portugal imposes 3 month data collection ban on Worldcoin",
    "url": "https://cryptoslate.com/portugal-imposes-3-month-data-collection-ban-on-worldcoin/",
    "description": "<p>Portugal&#8217;s National Data Protection Commission (CNPD) said on March 26 that it will ban Worldcoin from collecting biometric data for three months. The CNPD said that the limitations apply for 90 days until an investigation is concluded and a final decision is reached. The ban applies to biometric data on the iris, eyes, and face. [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/portugal-imposes-3-month-data-collection-ban-on-worldcoin/\">Portugal imposes 3 month data collection ban on Worldcoin</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-26T20:00:13.000Z",
    "title": "Worldcoin (WLD) 12% Rally Hits A Snag: Portugal Demands Halt To Biometric Data Collection",
    "url": "https://www.newsbtc.com/news/worldcoin-wld-12-rally-hits-a-snag-portugal-demands-halt-to-biometric-data-collection/",
    "description": "In a recent development, Portugal&#8217;s data regulator, the National Commission for the Protection of Data, also known as the CNPD, has issued an order to stop Sam Altman&#8217;s iris scanning project, Worldcoin, from collecting biometric data for 90 days.  Worldcoin’s Compliance Under Fire According to a Reuters report, the CNPD&#8217;s suspension specifically targets the Worldcoin Foundation, a memberless entity based in the Cayman Islands, described on its website as the sole member and director of World Assets Ltd, a company registered in the British Virgin Islands responsible for issuing Worldcoin tokens to sign-up participants. The CNPD cited an alleged &#8220;high risk&#8221; to citizens&#8217; data protection rights as the main reason for its urgent intervention. The regulator expressed concerns about the “unauthorized” collection of data from minors, the lack of information provided to data subjects, and the inability to delete data or withdraw consent.  The halt order also noted that over 300,000 individuals in Portugal had provided their biometric data to Worldcoin, leading to numerous complaints being lodged with the CNPD. Related Reading: XRP Price Prediction: Can Bulls Pump It Again To $0.75 Jannick Preiwisch, the data protection officer at the Worldcoin Foundation, responded to the CNPD&#8217;s order by stating that Worldcoin is “fully compliant” with all laws and regulations about biometric data collection and transfer. Preiwisch emphasized the company&#8217;s zero-tolerance policy for underage sign-ups and its commitment to addressing any reported incidents. Worldcoin has recently transitioned to &#8220;Personal Custody,&#8221; aiming to give users control over their data, including options for deletion and future use. The CNPD&#8217;s order to stop data collection is considered temporary, allowing for additional due diligence and analysis of complaints during the ongoing investigation. Privacy Storm Engulfs Worldcoin The Regulatory scrutiny of Worldcoin extends beyond Portugal. As NewsBTC reported, Spain&#8217;s data protection watchdog issued a three-month ban earlier this month in response to privacy complaints, and Kenya suspended Worldcoin&#8217;s operations in August 2023.  Moreover, the Bavarian State Regulatory Authority, acting as the lead authority in southeastern Germany, is currently investigating Worldcoin under European Union data protection rules due to the presence of a German subsidiary owned by Tools For Humanity, the company behind Worldcoin. As the investigation into Worldcoin&#8217;s data collection practices continues, the project faces significant challenges in addressing regulatory concerns and maintaining public trust in its ambitious vision. According to its website, the project claims to have garnered over 4.5 million sign-ups from individuals in 120 countries. Regulatory Hurdles Fail To Dampen WLD’s Performance Despite the recent regulatory challenges faced by Worldcoin, the decentralized cryptocurrency has managed to maintain its gains of 12% over the past seven days. After reaching an all-time high (ATH) of $11.95 on March 10, the project&#8217;s native token, WLD, experienced a sharp drop to $7.24 but has since recovered. Currently trading at $9.01, WLD has capitalized on the overall market rebound and its seven-day uptrend, surging by almost 9% in the past 24 hours.  The trading volume for WLD in the last 24 hours is $416,136,329, indicating a significant 65.10% increase compared to the previous day, suggesting renewed interest in the token. Related Reading: Crypto Outflows Reach New Record High, Will The Bitcoin Decline Continue? Looking ahead, the $9.5 level is expected to provide the nearest resistance for the WLD token, followed by the $10.14 mark, should the rally continue. On the downside, the $8.36 level is the closest support on the daily chart.  In a potential downtrend, failure to hold this support level could decline toward the $8 mark, with the next significant resistance at $7.93. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-26T20:00:24.000Z",
    "title": "Whales Accumulating Hot Real World Asset-Focused Altcoin From Crypto Exchanges: Lookonchain",
    "url": "https://dailyhodl.com/2024/03/26/whales-accumulating-hot-real-world-asset-focused-altcoin-from-crypto-exchanges-lookonchain/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/03/hot-real-world-asset.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/03/hot-real-world-asset.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/03/hot-real-world-asset.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/03/hot-real-world-asset.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/03/hot-real-world-asset.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/03/hot-real-world-asset.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/03/hot-real-world-asset.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Whales are gobbling up a red-hot crypto project that&#8217;s focused on tokenizing real-world assets (RWAs). The crypto tracker Lookonchain notes that one whale withdrew 6.53 million ONDO, the native token of Ondo Finance, from the crypto exchange Bybit over the past month. That trove is worth more than $6 million. Ondo Finance aims to provide [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/26/whales-accumulating-hot-real-world-asset-focused-altcoin-from-crypto-exchanges-lookonchain/\">Whales Accumulating Hot Real World Asset-Focused Altcoin From Crypto Exchanges: Lookonchain</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-26T19:55:00.000Z",
    "title": "$160,000 Bitcoin Could Be ‘Conservative’ Price Target, According to Trader That Called 2022 Bear Market Bottom",
    "url": "https://dailyhodl.com/2024/03/26/160000-bitcoin-could-be-conservative-price-target-according-to-trader-that-called-2022-bear-market-bottom/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/One-More-Scare-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/One-More-Scare-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/One-More-Scare-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/One-More-Scare-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/One-More-Scare-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/One-More-Scare-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/One-More-Scare-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A trader known for several accurate crypto market calls says that Bitcoin (BTC) could soar beyond $160,000 this bull cycle if its current market structure holds up. Pseudonymous analyst Dave the Wave tells his 143,000 followers on the social media platform X that based on Bitcoin’s price action from 2020, the crypto king could hit [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/26/160000-bitcoin-could-be-conservative-price-target-according-to-trader-that-called-2022-bear-market-bottom/\">$160,000 Bitcoin Could Be ‘Conservative’ Price Target, According to Trader That Called 2022 Bear Market Bottom</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]