[
  {
    "source": "Decrypt",
    "date": "2023-09-28T00:44:03.000Z",
    "title": "Meta Quest 3: Everything You Need to Know",
    "url": "https://decrypt.co/199046/meta-quest-3-everything-you-need-to-know",
    "description": "Mixed reality at a fraction of the price of the Apple Vision Pro. Will it be worth it? Here’s the latest on the Meta Quest 3."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-28T00:54:04.000Z",
    "title": "Do Kwon says SEC's extradition request is impossible",
    "url": "https://cointelegraph.com/news/do-kwon-sec-extradition-request-impossible-deposition-united-states",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/d95eb1e9-12f3-4772-9365-d09f3e74b8cc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Terraform Labs co-founder has pushed back against the SEC’s request to question him in the United States.</p>\n                    <p><p>Lawyers for Terraform Labs co-founder Do Kwon have requested a federal court to reject the United States Securities and Exchange Commission’s (SEC’s) request to question him in the U.S. over the collapse of the Terra Money ecosystem.</p><p>In a Sept. 27 <a href=\"https://www.courtlistener.com/docket/66820843/59/securities-and-exchange-commission-v-terraform-labs-pte-ltd/\" target=\"_blank\" rel=\"noopener nofollow\">filing</a>, Kwon’s legal team said that the SEC’s request to question him in the United States before Oct. 13 was “impossible” due to being detained <a href=\"https://cointelegraph.com/news/do-kwon-sentenced-to-4-months-in-prison-in-montenegro-on-fake-passport-charges\">in Montenegro</a> with “no scheduled release or extradition date.”</p><p>Additionally, Kwon’s team said that providing a written testimony to answer the SEC’s questions would be inconsistent with his right to due process under U.S. law. </p><blockquote>“An order mandating something that is impossible serves no practical purpose and risks undermining judicial authority.” </blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/aebea1c3-3b52-46b5-bb40-6707263f2697.png\"  /><figcaption style=\"text-align: center;\"><em>Lawyers for Do Kwon claim that the SEC’s extradition request is impossible. Source: CourtListener</em></figcaption></figure><p>Notably, Kwon’s lawyers claimed that Kwon did not directly oppose a deposition, however noted that it would need to take place in Montenegro, where the UST <a href=\"https://cointelegraph.com/news/do-kwon-granted-bail-again-montenegro\">stablecoin creator is currently out on bail</a>. </p><p>According to the filing, the cut off date for discovery in the <a href=\"https://cointelegraph.com/news/do-kwon-lawyers-reportedly-dismiss-sec-s-securities-fraud-allegation\">SEC’s case against Kwon and Terraform Labs</a> is Oct. 13.</p><p>Kwon’s legal team added that a Montenegrin court “informally” indicated that it may yet hold a hearing on Oct. 13 or Oct. 26, in which it would ask Kwon the SEC’s questions. However, the SEC noted that it may deem this process to be “inadequate” and pursue another deposition of Kwon after the discovery cut-off date.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-to-question-terraform-labs-daniel-shin-questioning-south-korea\"><strong><em>SEC seeks to question Terraform Labs co-founder Daniel Shin in Korea</em></strong></a></p><p>The <a href=\"https://cointelegraph.com/news/sec-sues-do-kwon-and-terraform-labs-for-fraud\">SEC sued Terraform Labs and Kwon</a> on Feb. 16 for allegedly “orchestrating a multi-billion dollar crypto asset securities fraud.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today we charged Singapore-based Terraform Labs PTE Ltd and Do Hyeong Kwon with orchestrating a multi-billion-dollar crypto asset securities fraud involving an algorithmic stablecoin and other crypto asset securities.</p>&mdash; U.S. Securities and Exchange Commission (@SECGov) <a href=\"https://twitter.com/SECGov/status/1626347690853376008?ref_src=twsrc%5Etfw\">February 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In the lawsuit, the SEC said that Terraform and Kwon “touted and marketed” its Anchor Protocol, which at one point was advertised to pay out 20% interest on USTC deposits. It also alleged Terraform and Kwon misled investors about the stability of Terra’s stablecoin. </p><p>Kwon and Terraform Labs’ chief financial officer Han Chang-Joon were <a href=\"https://cointelegraph.com/news/do-kwon-reportedly-arrested-in-montenegro\">arrested in Montenegro in March 2023</a> after allegedly using false travel documents when trying to leave the country. The two had their original passports confiscated in South Korea in October 2022.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Blockchain detectives — Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-28T01:00:00.000Z",
    "title": "$XRP, Cardano ($ADA), and Binance ($BNB) Coin Could Face Massive Sell-Off, Says Popular Crypto Analyst",
    "url": "https://www.cryptoglobe.com/latest/2023/09/xrp-cardano-ada-and-binance-bnb-coin-could-face-massive-sell-off-says-popular-crypto-analyst/",
    "description": "Prominent cryptocurrency strategist Nicholas Merten, known for his influential voice on his DataDash YouTube channel, has raised concerns over the possible price trajectory for certain altcoins, namely $XRP, Cardano ($ADA) and Binance Coin ($BNB), over liquidity issues. In a video shared on the Google-owned video-sharing platform to his over 500,000 subscribers, the analyst noted that […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T01:01:34.000Z",
    "title": "ChatGPT gets massive upgrade with no limits – Details",
    "url": "https://www.cryptopolitan.com/chatgpt-gets-massive-upgrade-with-no-limits/",
    "description": "Bold moves are nothing new in the tech world, but this recent announcement is not just audacious; it&#8217;s a whole new level of brazen. ChatGPT, the viral sensation, has received a massive upgrade, blowing past its previous capabilities and delivering new potential avenues for users. Microsoft&#8217;s prodigy, OpenAI, announced this week that the digital frontier ... <a title=\"ChatGPT gets massive upgrade with no limits &#8211; Details\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chatgpt-gets-massive-upgrade-with-no-limits/\" aria-label=\"More on ChatGPT gets massive upgrade with no limits &#8211; Details\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-28T00:51:33.000Z",
    "title": "Crypto’s new foe: The dreaded U.S. government shutdown",
    "url": "https://www.cryptopolitan.com/cryptos-new-foe-the-dreaded-us-govt-shutdown/",
    "description": "Cryptocurrency has faced its fair share of adversaries: volatile markets, regulatory challenges, and security threats, to name a few. But now, the digital asset realm faces another hurdle, one that could potentially reshape the landscape: the potential shutdown of the U.S. government due to a congressional budget impasse. While experts assure us that critical matters ... <a title=\"Crypto&#8217;s new foe: The dreaded U.S. government shutdown\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cryptos-new-foe-the-dreaded-us-govt-shutdown/\" aria-label=\"More on Crypto&#8217;s new foe: The dreaded U.S. government shutdown\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-28T01:00:22.000Z",
    "title": "Hashkey Enables AVAX Trading For Hong Kong Users – But There’s A Catch",
    "url": "https://www.newsbtc.com/avalanche/hashkey-enables-avax-trading-for-hong-kong-users-but-theres-a-catch/",
    "description": "Hong Kong-based cryptocurrency exchange Hashkey will now support trading the Avalanche (AVAX) token on its platform. However, traders must meet an interesting requirement before interacting with this cryptocurrency on the exchange. Traders Must Meet $1 Million Portfolio Requirement: SFC On Wednesday, September 27, Hashkey announced the listing of the AVAX token on its platform, with trading expected to commence on Thursday, September 28. However, only professional investors or individuals with an investment portfolio worth at least 8 million Hong Kong dollars (equivalent to $1 million), according to Hong Kong’s Securities &#38; Futures Commission (SFC). 🚨 Attention #Crypto Enthusiasts! $AVAX @avax will be available on HashKey Exchange. Deposit and withdrawal are live, and AVAX/USD trading pairs begins on September 28. Professional investors, this one is for you ! #CryptoAlert Read more: https://t.co/sKNFHDF6oe pic.twitter.com/ZQpzSmAi39 — HashKey Exchange (@HashKeyExchange) September 27, 2023 Bitcoin (BTC), Ether (ETH), and Tether (USDT) are the only cryptocurrencies approved by the SFC for retail trading as of this writing. Meanwhile, other altcoins like AVAX are restricted to professional investors or individuals with a $1 million portfolio. Related Reading: ETH Gate Saga Continues: What Is Lubin’s ‘Piece Of Paper’? Since Hong Kong authorized retail crypto trading in August, the Securities &#38; Futures Commission has placed significant restrictions on the operations of exchanges, including Hashkey. For instance, SFC requires users to deposit at least 10,000 Hong Kong dollars (or $1,500) during the Know Your Customer (KYC) verification process. According to CoinGecko data, Hashkey, the first to receive a retail crypto license in Hong Kong, has a daily trading volume of roughly $4.93 million, which pales compared to its global counterparts. For context, Binance, the world’s largest crypto exchange, boasts a 24-hour trading volume of nearly $4.9 billion. AVAX Price Continues Decline In September Although the listing of AVAX on the Hashkey exchange poses a potential opportunity for increased adoption, it is worth noting that the cryptocurrency&#8217;s price has been struggling in recent months. And September wasn&#8217;t different for AVAX, as the token lost nearly 14% of its value in the past 30 days. This continuous decline underscores Avalanche’s overall performance in 2023, which reflects the uncertain condition of the general market. The cryptocurrency has been on an estimated 58% plunge since notching a high of $21 in April. Related Reading: AVAX Price Bucks Under The Pressure Of Upcoming $102 Million Token Unlock According to data from CoinGecko, the Avalanche token changed hands for $8.91, with a 0.31% dip in the last 24 hours. As of this writing, the cryptocurrency has a daily trading volume of $117,251,082, reflecting an 18.4% rise in the past day. Avalanche ranks as the 24th-largest cryptocurrency, with a market cap of over $3.1 billion. AVAX price continues downward trend on the daily timeframe &#124; Source: AVAXUSDT chart on TradingView Featured image from IQ.wiki, chart from TradingView"
  }
]