[
  {
    "source": "NewsBTC",
    "date": "2024-02-20T00:00:47.000Z",
    "title": "Ethereum Breaks $2,900, But Watch Out For Futures Overheating",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-breaks-2900-watch-futures-overheating/",
    "description": "Ethereum has broken beyond the $2,900 level during the past day, but data shows the futures market may be starting to become overheated. Ethereum Has Now Broken Through The $2,900 Level While Bitcoin has slumped to an overall sideways trajectory recently, Ethereum appears to have decided to pick a path of its own, as the second largest asset in the sector has surged almost 4% over the past 24 hours. During this latest jump, Ethereum has touched the $2,900 mark for the first time since the start of May 2022. The below chart shows how the coin has performed over the last few days. The price of the asset appears to have shot up over the past day &#124; Source: ETHUSD on TradingView Following this rise, Ethereum investors would now be enjoying profits of more than 16% over the past week. In the same period, Bitcoin has only put together returns of about 8%. Related Reading: 16,000 Bitcoin Dormant Since 5+ Years Suddenly Moves, What’s Going On? While ETH&#8217;s decoupling may be an optimistic sign for the asset, a pattern seems to be emerging that could prove to be a worrying sign. ETH Open Interest Has Observed A Sharp Increase Recently As explained by an analyst in a CryptoQuant Quicktake post, the ETH Open Interest has gone through a strong surge recently. The &#8220;Open Interest&#8221; is an indicator that keeps track of the total amount of Bitcoin futures contracts that are currently open on all centralized derivative exchanges. When the value of this metric rises, it means that the investors are opening up fresh positions on the futures market right now. Generally, total leverage in the sector goes up as more positions pop up, so this trend can result in a higher amount of volatility for the cryptocurrency. On the other hand, a decline in the indicator implies ETH futures contract holders are either closing up their positions of their own volition, or are being liquidated by their platform. The asset&#8217;s price may behave more stably following such a decrease. Now, here is a chart that shows the trend in the Ethereum Open Interest over the last few years: The value of the metric seems to have rapidly been going up in recent days &#124; Source: CryptoQuant From the graph, it&#8217;s visible that the Ethereum Open Interest has risen to high levels recently and has attained a peak that&#8217;s higher than any witnessed in almost two years. &#8220;This surge indicates sustained confidence among futures traders in Ethereum&#8217;s current uptrend,&#8221; notes the quant. &#8220;However, given the impulsive nature of the recent ascent, traders should exercise caution and consider the potential for sudden liquidation events, which could trigger notable short to mid-term price declines.&#8221; Related Reading: Bitcoin Short-Term Holders Just Locked In $647 Million In Profits As mentioned before, the asset becomes more likely to show volatility when this indicator rises. The source of this volatility can be mass liquidation events called squeezes, which can trigger a violent cascade effect on the futures market, amplifying the price swing that triggered the event. Since the Ethereum Open Interest is very high right now, a futures squeeze could definitely be a possibility for the cryptocurrency. Featured image from DrawKit Illustrations on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  }
]