[
  {
    "source": "Cointelegraph",
    "date": "2024-01-05T09:56:45.000Z",
    "title": " March banking crisis rerun risks 40% Bitcoin price crash — Arthur Hayes ",
    "url": "https://cointelegraph.com/news/march-banking-crisis-rerun-risks-40-bitcoin-price-crash-arthur-hayes",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOTBlZTBlNjQtZTk1Yi00NTI0LTgzN2ItYWM4ZDQzMTY2NGEyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Bitcoin dipping 20% would be \"healthy,\" but up to 40% is possible depending on liquidity conditions, the former BitMEX CEO now reveals.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) trading OG Arthur Hayes now predicts an up to 40% BTC price crash in March.</p><p>In a <a href=\"https://cryptohayes.substack.com/p/signposts\" target=\"_blank\" rel=\"noopener nofollow\">blog post</a> on Jan. 4, the former CEO of crypto trading giant BitMEX warned readers of a week of “turmoil” due to hit financial markets.</p><p>Bitcoin bulls are feeling broadly confident this year as the United States’ first spot exchange-traded funds (ETFs) are slated to get regulatory approval.</p><p><a href=\"https://cointelegraph.com/news/march-banking-crisis-rerun-risks-40-bitcoin-price-crash-arthur-hayes\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-05T09:51:26.000Z",
    "title": " Ready Player One author, producer to bring IP to metaverse ",
    "url": "https://cointelegraph.com/news/ready-player-one-metaverse-author-producer-intellectual-property-web3",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZmMwYjJiNGMtMzc0OS00ZmYyLWE4OWUtZWE1Njg5N2I3NWQ4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ernest Cline and Dan Farah have co-founded Readyverse to develop a metaverse for Ready Player One and other IPs.</p>\n                    <p><p data-ct-non-breakable=\"true\">Ernest Cline, the author of <em>Ready Player One</em>, and Dan Farah, the producer of Steven Spielberg’s film adaptation of the story, have partnered with artificial intelligence (AI) and metaverse company Futureverse to develop a digital universe for Ready Player One.</p><p>Together with Futureverse’s Shara Senderoff and Aaron McDonald, Cline and Farah will co-found Readyverse Studios, a firm that will launch a metaverse called the “Readyverse,” which they described as a “platform of interconnected digital experiences.” </p><p data-ct-non-breakable=\"true\">Futureverse announced on X (formerly Twitter) that Readyverse Studios has partnered with Warner Bros. Discovery to bring the Ready Player One franchise exclusively to the metaverse and across Web3. In addition, Readyverse will maintain exclusive Web3 rights to all future intellectual property (IP) from Cline.</p><p><a href=\"https://cointelegraph.com/news/ready-player-one-metaverse-author-producer-intellectual-property-web3\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-05T09:59:56.000Z",
    "title": "Celsius to unstake $470M Ethereum amid restructuring efforts, raising market concerns",
    "url": "https://cryptoslate.com/celsius-to-unstake-470m-ethereum-amid-restructuring-efforts-raising-market-concerns/",
    "description": "<p>Bankrupt crypto lender Celsius will unstake 206,300 Ethereum, worth around $470 million, as part of efforts to facilitate the distribution of assets to creditors, according to a Jan. 4 statement on social media platform X (formerly Twitter). Celsius said the planned &#8220;significant&#8221; unstaking event will occur in the next few days and further revealed that [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/celsius-to-unstake-470m-ethereum-amid-restructuring-efforts-raising-market-concerns/\">Celsius to unstake $470M Ethereum amid restructuring efforts, raising market concerns</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-05T10:07:56.000Z",
    "title": "Financial advisers in the U.S. not confident in imminent Bitcoin ETF approval in 2024, survey reveals",
    "url": "https://www.cryptopolitan.com/financial-advisers-not-confident-bitcoin-etf/",
    "description": "A recent survey conducted by ETF issuer Bitwise revealed a prevailing skepticism among U.S.-based financial advisers regarding approving a spot Bitcoin ETF in 2024. The survey, which included a diverse group of financial professionals such as registered investment advisers (RIAs), financial planners, institutional investors, and wirehouse representatives, indicated that only 39% of the participants anticipate [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-05T10:00:15.000Z",
    "title": "Polygon Price Prediction 2024-2033: Is MATIC Going Past $10 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2024-2033 How much is MATIC worth? Today, the price of Polygon (MATIC) stands at $0.863, experiencing a 24-hour trading volume of $133 million. The cryptocurrency has a market capitalization of $5.8 billion and accounts for 0.41% of the market dominance. Over the past 24 hours, MATIC’s price has increased by 0.3%. Currently, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-05T09:42:09.000Z",
    "title": "Celsius initiates asset recall and rebalance to Prepare for Creditor Distributions",
    "url": "https://www.cryptopolitan.com/celsius-initiates-asset-recall-and-rebalance/",
    "description": "In a significant development for the beleaguered cryptocurrency lending platform, Celsius has confirmed the commencement of the process to recall and rebalance its crypto assets, primarily Ether (ETH).&#160; This move is part of the platform&#8217;s ongoing efforts to prepare for the timely distribution of assets to creditors. The announcement comes after Celsius filed for Chapter [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-05T10:00:00.000Z",
    "title": "Analysts track Polygon and Cardano, Everlodge innovates with AI tool",
    "url": "https://crypto.news/analysts-track-polygon-and-cardano-everlodge-innovates-with-ai-tool/",
    "description": "Cardano (ADA) and Polygon (MATIC) have the potential for growth in 2024. Meanwhile, focus is on the Everlodge presale"
  }
]