[
  {
    "source": "Decrypt",
    "date": "2024-02-19T21:01:46.000Z",
    "title": "What Is Pixels? Inside the Ronin Farming Game and Ethereum Token Airdrop",
    "url": "https://decrypt.co/resources/pixels-ronin-farming-game-airdrop-ethereum",
    "description": "Pixels has quickly become one of the hottest games in crypto, thanks in part to the PIXEL token launch. Here’s what you need to know."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-19T21:04:02.000Z",
    "title": " ECB execs respond to banks’ objections to digital euro, suggest priorities ",
    "url": "https://cointelegraph.com/news/ecb-execs-respond-banks-objections-digital-euro-suggest-priorities",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvYjRlN2FiNjYtMDQyZS00NTEyLWI0MTMtMjQwMDI4OWM2NGYyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Banks continue to raise objections that have already been accounted for in digital euro design, the authors say.</p>\n                    <p><p>The European Central Bank (ECB) has been producing plenty of informational material about the digital euro lately, much of it in the form of brochures, FAQs and other accessible formats. As they do so, the bankers’ frustration with overblown fears and the cold reception the innovation has been given is beginning to show.</p><p>ECB executives, including board member Piero Cipollone, published a column in two versions on  Feb. 19 addressing issues of bank intermediation. Specifically, they discuss banks’ perceived confusion about disintermediation potentially resulting from the introduction of a euro central bank digital currency (CBDC):</p><p>The authors briefly <a href=\"https://www.ecb.europa.eu/press/blog/date/2024/html/ecb.blog20240219~ccb1e8320e.en.html\" target=\"_blank\" rel=\"noopener nofollow\">describe</a> on the ECB blog several measures designed into the digital euro to prevent mass transfers of money from commercial bank accounts into digital euro wallets. These design elements encourage the use of the digital euro for payments rather than investment and the authors pointed out that banks could compete to retain deposits by raising their interest rates.</p><p><a href=\"https://cointelegraph.com/news/ecb-execs-respond-banks-objections-digital-euro-suggest-priorities\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-19T21:00:17.000Z",
    "title": "SOL Prediction: Analyst Bullish On Solana, Time To Buy?",
    "url": "https://www.newsbtc.com/news/solana/sol-prediction-analyst-bullish-on-solana-time-to-buy/",
    "description": "Recently, renowned crypto analyst Altcoin Sherpa gave his positive outlook on Solana (SOL) in an X (former Twitter) post. The analyst reviewed the token’s recent behavior and shared his predictions for SOL’s performance. Related Reading: SOL Price Surges To $115 – Why Solana Could Rally Another 10% Wait For The 20% Dip Or Buy Now? In the X post, the pseudonym analyst suggested that the fifth cryptocurrency by market capitalization may see a bright 2024, surpassing the heights reached at the end of last year. The chart displays SOL’s recent behavior, starting in late December 2023 when the cryptocurrency reached its highest price since early 2022. Based on the recent performance shown in the chart, the analyst expects SOL’s price to break above the key resistance levels. However, he predicts a price pullback and market selling during the highs of the price. As the prediction shows, SOL’s price would surpass the $120 price range before facing a pullback. Then, the pattern would repeat itself, and the cryptocurrency’s price would reach the price level established in December. Following this uprise, the token’s price would face a small price correction before breaking above the $126 price range. $SOL: It&#39;s a bizarre chart seeing this grind up slowly. I expect some sort of selling to happen around the highs given the length of time spent in between each peak but the entire market is still up only right now. I think that expecting any huge correction for #Solana is meh… pic.twitter.com/8VnHcJ4bNX &#8212; Altcoin Sherpa (@AltcoinSherpa) February 18, 2024 Despite the small corrections seen in the prediction, the pseudonym analyst doesn’t forecast a huge correction happening soon and considers that expecting one is “meh for now.” Further expressing his view on the possibility of a big price correction, the analyst agreed with a member of the crypto community. The X user highlighted that Solana “just came off a 35% drawdown from 125 to 80” and suggested that “by the time the next big correction comes, [the price] will be much higher than it is now.” To the analyst, it seems more appropriate to buy SOL now and sit on it for the coming months instead of trying to wait for a 20% correction before buying: Bullish on this one bigly going into 2024 and I think most would make more $ just buying here and sitting on this thing for months instead of trying to wait for the 20% correction. Solana (SOL) Sees Green The month of February has been filled with ups and downs for Solana. At the beginning of the month, Solana’s DeFi ecosystem reached an important milestone after the Solana-based decentralized exchanges (DEXs) surpassed Ethereum’s daily trading volume for the second time. However, the blockchain saw its 11th outage in 2 years just a week after its DeFi ecosystem’s achievement, with the chain being down for almost five hours. Despite crypto investors’ concerns about the outage, Solana’s price rapidly recovered from the price drop. SOL recently became the fourth-largest cryptocurrency by market capitalization after surpassing BNB on February 14; since then, Solana has gone back to the fifth spot, with its market capitalization sitting at $49.7 billion, an impressive 19.34% increase in the last month. Solana’s trading volume in the last day has decreased by 9.20%. According to CoinGecko data, it sits at $1.5 billion, suggesting a recent fall in market activity. At writing time, the crypto market is seeing green, and Solana’s cryptocurrency is not the exception. SOL is trading at $112.4, accounting for a 1.0% price surge in the last 24 hours and a notable 7.8% increase in the past week. Related Reading: Solana Surges: Open Interest Hits $1.75 Billion, Price Up 8% Today SOL is trading at $112.90 in the hourly chart. Source: SOLUSDT on TradingView.com Featured Image from Unsplash.com, Chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-02-19T20:42:30.000Z",
    "title": "Ethereum (ETH) Bulls Charge: RSI Signals Potential Rally to $3K Amid Technical Strength",
    "url": "https://www.crypto-news-flash.com/ethereum-eth-bulls-charge-rsi-signals-potential-rally-to-3k-amid-technical-strength/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-eth-bulls-charge-rsi-signals-potential-rally-to-3k-amid-technical-strength",
    "description": "<img width=\"1818\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ethereum-ETH-green-logo-with-digital-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ethereum Dencun\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ethereum-ETH-green-logo-with-digital-background.jpg 1818w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ethereum-ETH-green-logo-with-digital-background-300x198.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ethereum-ETH-green-logo-with-digital-background-1024x676.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ethereum-ETH-green-logo-with-digital-background-768x507.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ethereum-ETH-green-logo-with-digital-background-1536x1014.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ethereum-ETH-green-logo-with-digital-background-150x99.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ethereum-ETH-green-logo-with-digital-background-450x297.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Ethereum-ETH-green-logo-with-digital-background-1200x792.jpg 1200w\" sizes=\"(max-width: 1818px) 100vw, 1818px\" />Ethereum (ETH) is beginning to build bullish momentum, with a potential surge to $3,000 looking imminent in the coming days. On top of showing technical strength, network upgrades and the potential approval of an Ethereum spot ETF will boost prices. Ethereum (ETH) is beginning to show strength, with bulls looking to take charge of the [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-19T21:00:22.000Z",
    "title": "Ethereum 2019 Correction Repeating? Analyst Warns Ethereum May See Larger Pullback",
    "url": "https://dailyhodl.com/2024/02/19/ethereum-2019-correction-repeating-analyst-warns-ethereum-may-see-larger-pullback/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Time-Highs-for-Ethereum.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Time-Highs-for-Ethereum.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Time-Highs-for-Ethereum.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Time-Highs-for-Ethereum.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Time-Highs-for-Ethereum.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Time-Highs-for-Ethereum.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Time-Highs-for-Ethereum.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Closely followed analyst Benjamin Cowen says Ethereum may be in the midst of repeating a historical pattern that could bring ETH down to much lower levels. In a new strategy session, Cowen tells his 790,000 YouTube subscribers that in the last crypto bear market, Ethereum didn&#8217;t bottom out until canceling out a previous breakout from [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/19/ethereum-2019-correction-repeating-analyst-warns-ethereum-may-see-larger-pullback/\">Ethereum 2019 Correction Repeating? Analyst Warns Ethereum May See Larger Pullback</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-02-19T20:55:27.000Z",
    "title": "Gaming Altcoin Built on Ronin (RON) Explodes After Going Live on Crypto Exchange Binance",
    "url": "https://dailyhodl.com/2024/02/19/gaming-altcoin-built-on-ronin-ron-explodes-after-going-live-on-crypto-exchange-binance/",
    "description": "<img width=\"1024\" height=\"512\" src=\"https://dailyhodl.com/wp-content/uploads/2021/11/altcoin-backed-binance.jpeg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/11/altcoin-backed-binance.jpeg 1140w, https://dailyhodl.com/wp-content/uploads/2021/11/altcoin-backed-binance.jpeg?resize=300,150 300w, https://dailyhodl.com/wp-content/uploads/2021/11/altcoin-backed-binance.jpeg?resize=768,384 768w, https://dailyhodl.com/wp-content/uploads/2021/11/altcoin-backed-binance.jpeg?resize=1024,512 1024w, https://dailyhodl.com/wp-content/uploads/2021/11/altcoin-backed-binance.jpeg?resize=360,180 360w, https://dailyhodl.com/wp-content/uploads/2021/11/altcoin-backed-binance.jpeg?resize=750,375 750w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A Web3 gaming altcoin built on the Ronin (RON) blockchain is soaring after securing a listing on top crypto exchange Binance. Pixels (PIXEL), an open-ended game focused on farming and exploration, shot up Monday from a low of $0.4711 to a high of $0.6887, a more than 46% increase. At time of writing, PIXEL has [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/02/19/gaming-altcoin-built-on-ronin-ron-explodes-after-going-live-on-crypto-exchange-binance/\">Gaming Altcoin Built on Ronin (RON) Explodes After Going Live on Crypto Exchange Binance</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]