[
  {
    "source": "Cointelegraph",
    "date": "2023-06-05T08:51:53.000Z",
    "title": "‘$31K was not the end’ — 5 things to know in Bitcoin this week",
    "url": "https://cointelegraph.com/news/31k-was-not-the-end-5-things-to-know-in-bitcoin-this-week",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/0f2588a6-0999-4974-8bc0-d8b7a4418589.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin analysts are gearing up for a break toward the $30,000 mark, but what will BTC price action offer in the coming days?</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) starts the second week of June in familiar territory, but a breakout is coming, investors say.</p><p>After a calm weekly close, BTC/USD is firmly in its established trading range, while under the hood, market participants are preparing for some dramatic shifts.</p><p>It has been a long time coming, and for seasoned traders, the signs are increasingly pointing to volatility making a comeback.</p><p>There is little by way of macroeconomic triggers due this week, making the focus shift elsewhere for cues as to what BTC price action might do in the short term.</p><p>The on-chain analysis provides other interesting insights, reinforcing the idea that for Bitcoin currently, the only “boring” part is the spot price.</p><p>Cointelegraph takes a look at the key factors at play as BTC/USD hovers around $27,000 for another week.</p><h2>Weekly close preserves key trend line</h2><p>BTC/USD may not have inspired with its latest weekly close, but some popular traders are seeing fresh cause for optimism.</p><p>Despite remaining firmly in its narrow trading range, as confirmed by from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.142027444.742658523.1640948929-762064149.1640948929\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a>, the chances of a breakout toward $30,000 are increasing.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/232d2f47-63f5-4b53-b32c-2ebfa1ff361c.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-day candle chart on Bitstamp. Source: TradingView</em></figcaption></figure><p>“Feels like it's a matter of time until Bitcoin finally breaks that 30k level once and for all,” trader Jelle <a href=\"https://twitter.com/CryptoJelleNL/status/1665617353596346368\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> in part of his latest analysis.</p><p>Jelle, like others, noted that the 200-week moving average (MA) — a key support line — remained intact.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/6139c87c-6bd1-431c-bc05-bab18a7c62fb.jpeg\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Jelle/ Twitter</em></figcaption></figure><p>Also intact were various support structures on trader and analyst Rekt Capital’s radar covering daily timeframes. </p><p>“So far, so good,” he summarized about the potential for an exit higher, potentially invalidating a bearish “head and shoulders” structure from the weeks prior.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/BTC?src=hash&amp;ref_src=twsrc%5Etfw\">#BTC</a> successfully retesting not just the top of the red downtrending channel but also the bottom of the red box<br><br>So far, so good<a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> <a href=\"https://twitter.com/hashtag/Crypto?src=hash&amp;ref_src=twsrc%5Etfw\">#Crypto</a> <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcoin</a> <a href=\"https://t.co/a0VCL61Qvm\">https://t.co/a0VCL61Qvm</a> <a href=\"https://t.co/V7SnIMlpJZ\">pic.twitter.com/V7SnIMlpJZ</a></p>&mdash; Rekt Capital (@rektcapital) <a href=\"https://twitter.com/rektcapital/status/1665408264530526208?ref_src=twsrc%5Etfw\">June 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>An additional tweet <a href=\"https://twitter.com/rektcapital/status/1665409625527578626\" target=\"_blank\" rel=\"noopener nofollow\">mentioned</a> a “successful retest” of support in the offing.</p><p>“BTC broke down from a head and shoulders pattern in May. But there's classic whipsaw action around the neckline,” trading account Game of Trades nonetheless <a href=\"https://twitter.com/GameofTrades_/status/1665387940426702850\" target=\"_blank\" rel=\"noopener nofollow\">acknowledged</a>. </p><blockquote>“The pattern remains valid unless the price moves above the right shoulder.”</blockquote><p>An accompanying chart gave a potential downside target of just $24,000 for BTC/USD as a result of the head and shoulders event.</p><p>Others looked for less movement, such as trader Crypto Tony, who eyed $25,300 as a possible destination, subject to $28,350 staying unflipped as resistance.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/search?q=%24BTC&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$BTC</a> / <a href=\"https://twitter.com/search?q=%24USD&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USD</a> - June / July plan <br><br>So right now we are consolidating following the drop from the 14th April high. I am looking for <br><br>- $25,300 target to look for longs<br>- Must remain below $28,350 for the downside target <br>- Combo corrective pattern <br><br>I will update daily as always <a href=\"https://t.co/Q93mr4hjGH\">pic.twitter.com/Q93mr4hjGH</a></p>&mdash; Crypto Tony (@CryptoTony__) <a href=\"https://twitter.com/CryptoTony__/status/1665434242396872704?ref_src=twsrc%5Etfw\">June 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Macro lull comes as traders eye dollar rebound</h2><p>In an unusual week of calm for traders, June 5 through June 9 will see little by way of macroeconomic data come out of the United States.</p><p>With the debt ceiling debacle left behind, the next potential volatility catalysts will come in the form of macro reports for May, such as the Consumer Price Index (CPI) print — these nonetheless not due for another week.</p><p>With that, attention is focusing on oil production cuts from Opec+ members, as prices continue to fall despite existing reductions in output.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/4398b86a-323d-4de0-9ac4-1a2fa2173798.png\"  /><figcaption style=\"text-align: center;\"><em>U.S. dollar index (DXY) 1-day candle chart. Source: TradingView</em></figcaption></figure><p>A more direct potential headwind for Bitcoin and crypto, meanwhile, comes in the form of the U.S. dollar.</p><p>The strength of the greenback has been forming a rebound since the start of May, and since then, the U.S. dollar index (DXY) — traditionally inversely correlated with risk assets — has gained around 3.5%.</p><p>Popular analyst Matthew Hyland noted increasing relative strength index (RSI) scores for DXY on weekly timeframes.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">DXY Weekly opens: <a href=\"https://t.co/nRIGyKm4tl\">pic.twitter.com/nRIGyKm4tl</a></p>&mdash; Matthew Hyland (@MatthewHyland_) <a href=\"https://twitter.com/MatthewHyland_/status/1665467446201860097?ref_src=twsrc%5Etfw\">June 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Fellow trader Skew flagged 104.7%, the current June high, as a key level to close above to form a bullish DXY trend.</p><p>“Strong close &amp; moving higher in early EU trading session,” he <a href=\"https://twitter.com/52kskew/status/1665617551924101120\" target=\"_blank\" rel=\"noopener nofollow\">commented</a> on the day. </p><blockquote>“If USD closes above $104.7, I would consider that as USD strength. So far this looks risk off but we see later on.” </blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/search?q=%24DXY&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$DXY</a> 1D<br>Strong close &amp; moving higher in early EU trading session. <br><br>if USD closes above $104.7, I would consider that as USD strength. <br><br>So far this looks risk off but we see later on. <a href=\"https://t.co/F28baIv2JV\">https://t.co/F28baIv2JV</a> <a href=\"https://t.co/3SLDs5wtos\">pic.twitter.com/3SLDs5wtos</a></p>&mdash; Skew Δ (@52kskew) <a href=\"https://twitter.com/52kskew/status/1665617551924101120?ref_src=twsrc%5Etfw\">June 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Over the weekend, meanwhile, TraderSZ <a href=\"https://twitter.com/trader1sz/status/1665040152329179136\" target=\"_blank\" rel=\"noopener nofollow\">described</a> DXY as “bullish until proven otherwise.”</p><h2>Stocks buoy bullish crypto case</h2><p>The debt ceiling resolution had an immediate cathartic effect on equities, but crypto markets have broadly failed to copy their enthusiasm.</p><p>This may still change, market participants argue, as the S&amp;P 500 hits ten-month highs.</p><p>“The US House has passed a key debt ceiling deal, launching the #SP500 to its highest price since August. Altcoins like $LTC, $LEO, and $FGC have jumped today,” research firm Santiment <a href=\"https://twitter.com/santimentfeed/status/1664391522232729600\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> on June 2.</p><blockquote>“With crypto lagging behind equities, there could be some $BTC catch-up time coming soon.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/3b0313fa-0cbe-495c-8768-12f05bb49a53.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Crypto vs. macro comparison. Source: Santiment/ Twitter</em></figcaption></figure><p>An accompanying chart also tracked a “rebound” for gold, this nonetheless short lived with a retracement setting in to mark the new week.</p><p>At the time, as Cointelegraph <a href=\"https://cointelegraph.com/news/bitcoin-wicks-down-to-26-5k-but-trader-eyes-chance-for-bullish-surprise\">reported</a>, others were also eyeing positive correlation between Bitcoin and a resurgent S&amp;P 500.</p><h2>Bitcoin hodlers comfortably in profit</h2><p>“It's easy to ‘feel’ that the Bitcoin rally is over, but the facts say it's not,” popular technical analyst CryptoCon wrote in findings last month.</p><p>At the time, BTC/USD was almost $1,000 higher than current levels, but enthusiasm was just as lacking.</p><p>CryptoCon was analyzing the state of Bitcoin holder profitability, using the Net Unrealized Profit/Loss (NUPL) metric created in 2019 by entrepreneur and analyst Tuur Demeester and others.</p><p>For the past several months, NUPL has stayed practically stationary around a value of 0.25 — indicating that overall, the BTC supply are modestly “in the black.”</p><p>NUPL measures the difference between unrealized profit and unrealized loss, both of these calculated by gathering unspent transaction outputs (UTXOs) to see how much coins are worth compared to when they last moved on-chain.</p><p>“Any value above zero indicates that the network is in a state of net profit, while values below zero indicate a state of net loss. In general, the further NUPL deviates from zero, the closer the market trends towards tops and bottoms,” analytics firm Glassnode <a href=\"https://academy.glassnode.com/indicators/profit-loss-unrealized/net-unrealized-profit-loss\" target=\"_blank\" rel=\"noopener nofollow\">explains</a> in an introduction.</p><p>While calm in recent months, NUPL has delivered an uptrend retest, which is cause for confidence, CryptoCon now says.</p><p>“31k was not the end, hope you're ready!” he <a href=\"https://twitter.com/CryptoCon_/status/1665378710239735814/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">concluded</a> in an update this weekend.</p><p>An accompanying chart of NUPL showed its behavior versus investor sentiment at various stages over the past ten years.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> has seen a lot of sideways price action recently, but during that time two very important things have happened on the NUPL:<br><br>- Retest of trend<br>- Support made on Hope / Fear sector<br><br>The next step, a leap to the belief/denial range<br><br>31k was not the end, hope you&#39;re ready! <a href=\"https://t.co/yi1GMO1hri\">pic.twitter.com/yi1GMO1hri</a></p>&mdash; CryptoCon (@CryptoCon_) <a href=\"https://twitter.com/CryptoCon_/status/1665378710239735814?ref_src=twsrc%5Etfw\">June 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Largest Bitcoin whales at center of \"dichotomy\"</h2><p>On the topic of investor sentiment, the current view of the market varies heavily between classes of hodler.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-big-move-due-in-july-after-march-30k-push-latest-analysis\">Bitcoin ‘big move’ due in July after March $30K push — Latest analysis</a></em></strong></p><p>As <a href=\"https://twitter.com/glassnode/status/1664951115614507015/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> by Glassnode itself, most remain distinctly risk-off on Bitcoin — since May, selling has dominated despite the lack of capitulatory events.</p><p>The one exception, it appears, is the largest class of Bitcoin “whales.”</p><p>Uploading a chart of accumulation versus distribution adjusted by cohort, Glassnode showed that wallets holding at least 10,000 BTC are adding to their positions, while everyone else is reducing exposure.</p><p>“An interesting dichotomy across the Bitcoin Accumulation Trend Score persists, as the largest of Whales (&gt;10K BTC) continue to aggressively accumulate, whilst all other major cohorts experience heavy distribution,” researchers commented.</p><p>The last accumulation phase from these “mega whales” was in late 2022, with BTC/USD beginning its 2023 rebound weeks later.</p><p>The whales then paused in mid-January, entering a distribution phase of their own before flipping back to accumulation in May.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/23e3aa34-433c-4677-b68c-89ca791a385b.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin Trend Accumulation Score by Cohort chart. Source: Glassnode/ Twitter</em></figcaption></figure><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-home-loan-bitcoin-mortgage-risky/\">Home loans using crypto as collateral: Do the risks outweigh the reward?</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-05T08:58:59.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-06-05T09:04:22.000Z",
    "title": "Sensational: TMS Network’s (TMSN) 2000% Domination Over Shiba Inu (SHIB) and Uniswap (UNI)",
    "url": "https://nulltx.com/sensational-tms-networks-tmsn-2000-domination-over-shiba-inu-shib-and-uniswap-uni/",
    "description": "TMS Network (TMSN) is making a big impact. It&#8217;s gone up 2000%, beating out well-known coins like Shiba Inu (SHIB) and Uniswap (UNI). This is a big deal for its eager community, which has been buzzing about its presale phase 4 performance. Stay tuned as we dig into what&#8217;s behind TMS Network (TMSN) massive rise [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-05T09:02:04.000Z",
    "title": "TMS Network (TMSN) is the Force Awakened, Overpowers Avalanche (AVAX) and The Sandbox (SAND)",
    "url": "https://nulltx.com/tms-network-tmsn-is-the-force-awakened-overpowers-avalanche-avax-and-the-sandbox-sand/",
    "description": "In the ever-evolving world of cryptocurrencies, TMS Network (TMSN) has emerged as a force to be reckoned with. Currently in the fourth phase of its presale, TMS Network (TMSN) has seen an astonishing 2000% increase in its token price, raising over $6 million so far. This remarkable performance has outshone other notable cryptocurrencies such as [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-05T08:58:52.000Z",
    "title": "TMS Network (TMSN) Heats Up Crypto Market with Unprecedented 2000% Presale Jump, Far Outpacing Solana (SOL) and Dogecoin (DOGE)",
    "url": "https://nulltx.com/tms-network-tmsn-heats-up-crypto-market-with-unprecedented-2000-presale-jump-far-outpacing-solana-sol-and-dogecoin-doge/",
    "description": "The cryptocurrency market has been marked by notable gains since the start of the year, with well-established coins taking the lead. However, amidst this trend, lesser-known cryptocurrencies like TMS Network (TMSN) have been experiencing a remarkable surge in the market. In an extraordinary fashion, TMS Network (TMSN) has emerged as a dominant force in the [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-05T09:00:00.000Z",
    "title": "InQubeta demonstrates growth potential compared to litecoin and chainlink",
    "url": "https://crypto.news/inqubeta-demonstrates-growth-potential-compared-to-litecoin-and-chainlink/",
    "description": "Litecoin and Chainlink are well-established, but InQubeta is a new challenger with unique features "
  },
  {
    "source": "BTCManager",
    "date": "2023-06-05T08:59:39.000Z",
    "title": "SEC and CFTC find clarity in new legislation to regulate crypto",
    "url": "https://crypto.news/sec-and-cftc-find-clarity-in-new-legislation-to-regulate-crypto/",
    "description": "House Republicans have introduced a draft proposal to address gaps in cryptocurrency regulations, assigning the CFTC authority over crypto commodities and the SEC for digital securities. To bridge the gaps in the current regulatory framework surrounding cryptocurrencies, House Republicans have&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-05T08:49:41.000Z",
    "title": "Ethereum whales’ holdings hit new ATH as price slips further",
    "url": "https://crypto.news/ethereum-whales-holdings-hit-new-ath-as-price-slips-further/",
    "description": "Ethereum’s (ETH) price has struggled to keep up over the past two months as the global crypto market cap plunged by roughly $150 billion. As the price dropped, the top 10 non-exchange ETH addresses’ holdings touched a new all-time high&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-05T09:00:31.000Z",
    "title": "Dogecoin Price Prediction for June 2023",
    "url": "https://www.crypto-news-flash.com/dogecoin-price-prediction-for-june-2023/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-price-prediction-for-june-2023",
    "description": "<p>We’re in the last month of the second quarter, and the price direction of most crypto assets is still bearish. The majority of investors are losing money, while a small percentage are struggling to stay above water. We can all agree that Dogecoin investors have been through it all this year, and most are barely [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/dogecoin-price-prediction-for-june-2023/\">Dogecoin Price Prediction for June 2023</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-05T08:45:09.000Z",
    "title": "Discovering the Top NFT Marketplaces in 2023: Your Comprehensive Guide",
    "url": "https://www.crypto-news-flash.com/discovering-the-top-nft-marketplaces-in-2023-your-comprehensive-guide/?utm_source=rss&utm_medium=rss&utm_campaign=discovering-the-top-nft-marketplaces-in-2023-your-comprehensive-guide",
    "description": "<p>Non-fungible tokens (NFTs) have taken the digital world by storm, providing a new way to own unique pieces of digital art, music, videos, and many other online collectibles. NFTs leverage blockchain technology, the same innovation that powers cryptocurrencies like Bitcoin, to certify the uniqueness and ownership of digital assets. With the value of the NFT [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/discovering-the-top-nft-marketplaces-in-2023-your-comprehensive-guide/\">Discovering the Top NFT Marketplaces in 2023: Your Comprehensive Guide</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-05T09:03:16.000Z",
    "title": "There Is a Crypto Project Behind Apple’s VRs",
    "url": "https://www.altcoinbuzz.io/product-release/there-is-a-crypto-project-behind-apples-vrs/",
    "description": "<p>We’ve seen a lot of narratives in the crypto market this year. By that, we mean crypto tokens driven by trends in a specific sector. At the start of the year, we had the AI narrative, which is still ongoing. Lately, there’s been the Chinese narrative, which we’ve covered extensively. However, the latest narrative is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/product-release/there-is-a-crypto-project-behind-apples-vrs/\">There Is a Crypto Project Behind Apple’s VRs</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-05T08:54:03.000Z",
    "title": "Many Large Cap Altcoins Are Undervalued: Intelligence Firm",
    "url": "https://coinedition.com/many-large-cap-altcoins-are-undervalued-intelligence-firm/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Several_of_the_largest_altcoins_show_undervaluation_when_combining-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Several_of_the_largest_altcoins_show_undervaluation_when_combining-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Several_of_the_largest_altcoins_show_undervaluation_when_combining-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Several_of_the_largest_altcoins_show_undervaluation_when_combining-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/Several_of_the_largest_altcoins_show_undervaluation_when_combining-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/Several_of_the_largest_altcoins_show_undervaluation_when_combining-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/Several_of_the_largest_altcoins_show_undervaluation_when_combining.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>In a tweet published yesterday, Santiment, the blockchain intelligence firm, noted that many altcoins are currently undervalued and predicted that they may rally in the next few weeks. According to the post, several of the largest altcoins show signs of undervaluation when combining the “short, mid, and long realized market capitalizations.” Some of the undervalued [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/many-large-cap-altcoins-are-undervalued-intelligence-firm/\">Many Large Cap Altcoins Are Undervalued: Intelligence Firm</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]