[
  {
    "source": "Cointelegraph",
    "date": "2023-08-23T02:52:56.000Z",
    "title": "Binance.US taps MoonPay as banking alternative to regain USD ramps",
    "url": "https://cointelegraph.com/news/binance-usd-deposits-withdrawals-moonpay-usdt",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/3297a625-b541-4763-860b-6fdf0c9cae46.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>After having its banking ties slashed, crypto exchange Binance.US has revived its U.S. dollar on-ramp through a new partnership with MoonPay.</p>\n                    <p><p>Two months after becoming a crypto-only platform, Binance.US has announced a new partnership with crypto payments firm MoonPay to allow users to buy the U.S. Dollar-pegged stablecoin Tether (<a href=\"https://cointelegraph.com/tether-price-index\">USDT</a>) to useon its platform. </p><p>In an Aug. 22 statement, the crypto exchange <a href=\"https://blog.binance.us/buy-crypto-usdt/\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that USDT was being adopted as the new “base asset” for all transactions and its partnership with MoonPay allows a path for users to transact in USD.</p><p>The new partnership comes in the wake of Binance.US suffering a breakdown with its banking partners which saw fiat deposits on the exchange halted as of June 9. </p><p>At the time, it cited \"aggressive and intimidating\" <a href=\"https://cointelegraph.com/news/binance-us-suspends-usd-deposits-warns-withdrawal-pause-incoming\">tactics from the Securities and Exchange C</a><a href=\"https://cointelegraph.com/news/binance-us-suspends-usd-deposits-warns-withdrawal-pause-incoming\">ommission</a> — which <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">sued the exchange and its affiliates</a> four days prior — as the reason for the disruption.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today, we&#39;re excited to introduce a new <a href=\"https://twitter.com/search?q=%24USD&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USD</a> on-ramp!<br><br>✔️ Buy <a href=\"https://twitter.com/search?q=%24USDT&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$USDT</a> on <a href=\"https://t.co/AZwoBOgsqS\">https://t.co/AZwoBOgsqS</a> through payment partners like <a href=\"https://twitter.com/moonpay?ref_src=twsrc%5Etfw\">@moonpay</a>, which supports debit &amp; credit card, Apple Pay, and Google Pay.<br><br>✔️ Sell USDT for USD to withdraw via bank transfer.<br><br>Learn more &amp; get started ⤵️</p>&mdash; Binance.US  (@BinanceUS) <a href=\"https://twitter.com/BinanceUS/status/1694040010482135262?ref_src=twsrc%5Etfw\">August 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Binance.US customers looking to fund their accounts can now exchange dollars for USDT which can in turn be used to purchase other cryptocurrencies on the platform, according to the statement.</p><p>While direct bank deposits remain disabled on Binance.US, the partnership offers users an on-ramp that supports purchases through debit and credit cards along with Apple and Google Pay. </p><p>On June 23, the exchange <a href=\"https://cointelegraph.com/news/binance-us-solves-usd-withdrawal-issues-warns-it-wont-last\">experienced a series of issues</a> with USD-denominated withdrawals but managed to temporarily recover the functionality. At the time, it warned that the service would be discontinued in the near future. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/us-doj-concerned-binance-run-prosecutors-fraud-charges\"><strong><em>DoJ concerned about a run on Binance if prosecutors bring fraud charges: Report</em></strong></a></p><p>Prior to Binance.US and its affiliates being hit by a lawsuit from the SEC, the exchange supported the purchase and sale of popular cryptocurrencies through direct USD deposits and withdrawals.</p><p>In March, a number of crypto exchanges and service providers lost their banking partners <a href=\"https://cointelegraph.com/news/banking-crisis-what-does-it-mean-for-crypto\">amid a wider banking crisis that</a> saw a number of crypto-friendly banks such as <a href=\"https://cointelegraph.com/news/silicon-valley-bank-s-downfall-has-many-causes-but-crypto-isn-t-one\">Silicon Valley Investment Bank</a>, <a href=\"https://cointelegraph.com/news/crypto-industry-braces-for-impact-with-silvergate-exit\">Silvergate</a>, and <a href=\"https://cointelegraph.com/news/signature-bank-failed-to-understand-risks-associated-with-crypto-fdic-chair\">Signature Bank collapse</a> all within the span of a few weeks. </p><p><strong><em>Big Questions: </em></strong><a href=\"https://cointelegraph.com/magazine/big-questions-did-the-nsa-create-bitcoin/\"><strong><em>Did the NSA create Bitcoin?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T03:07:52.000Z",
    "title": "Best AI Tools for Graphic Design in 2023",
    "url": "https://www.cryptopolitan.com/best-ai-tools-for-graphic-design-in-2023/",
    "description": "Graphic design is one major area where artificial intelligence is being explored the most. Several AI-powered tools have been developed to improve how designers work, and so far, these tools, which fall under the “generative AI” category, have shown huge potential at handling tasks such as generating ideas, creating mockups, and editing photos. Not just ... <a title=\"Best AI Tools for Graphic Design in 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/best-ai-tools-for-graphic-design-in-2023/\" aria-label=\"More on Best AI Tools for Graphic Design in 2023\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-23T03:00:46.000Z",
    "title": "Rumors Of Robinhood Listing XRP Take Center Stage On Crypto Twitter",
    "url": "https://www.newsbtc.com/analysis/xrp/robinhood-listing-xrp/",
    "description": "The crypto community is currently buzzing with excitement and curiosity following rumors of Robinhood potentially listing XRP. These rumors come as the XRP price falls to pre-judgment levels, sparking hope that it could trigger a reversal. XRP Rumors Has Crypto Twitter In A Frenzy Rumor has it that an anonymous insider has confirmed the potential listing of XRP, the native token of Ripple, on Robinhood, an American financial trading platform, before the end of 2023. The rumor was started on August 22 by a crypto user on X (formerly Twitter) who goes by the username @25hoursawake.  The whispers of Robinhood listing XRP have sent shockwaves in the crypto community and numerous crypto investors and enthusiasts have taken to Twitter to air out their respective views and opinions on the speculation. Related Reading: Diamond In The Rough: Solo Bitcoin Miner Secures $160,000 Block Reward Robinhood is renowned for its meticulous listing process, and according to an X user Crypto Asset Guy, Robinhood has a reputation for not just listing any type of cryptocurrency. The trading platform puts considerable effort and time into its crypto listing procedure to ensure only the highest-qualified cryptocurrencies according to their standards are integrated into its platform.  Alternatively, the crypto and stock trading platform is also known for delisting cryptocurrencies without a second thought, if said cryptocurrency faces any form of regulatory or significant market challenges.  As the crypto space eagerly discusses the ramifications of Robinhood potentially listing XRP, some enthusiasts argue that integrating XRP tokens into the platform would have a positive outlook, exposing the digital asset to a wider audience and increasing investments in Robinhood.  Token price falls to levels before Judge Torres's ruling &#124; Source: XRPUSD on Tradingview.com Other individuals have pointed out Robinhood&#8217;s affinity for restricting trades and transactions during high market volatility. This has led to doubts about the platform&#8217;s ability to provide uninterrupted access to XRP users’ digital assets.  Commenting on the rumors of Robinhood listing XRP, Crypto Assets Guy stated that if the speculations prove to be true, then the crypto community should look forward to a surge in investments and market trends. He emphasized that Robinhood may have insights on XRP, unbeknownst to the public.  “If the rumors are true and Robinhood lists $XRP by the end of the year then prepare for a MASSIVE uptrend. Robinhood is known for being very tedious when selecting which crypto to list. So if they are getting ready to list XRP they must know something,” he said.  Additionally, the outcome would undoubtedly increase the cryptocurrency’s mainstream adoption. Analyzing The Potential Effect Of A Robinhood Listing Ripple has been in an ongoing lawsuit with the United States Securities and Exchange Commission (SEC) for almost three years now. The lawsuit was thought to be finalized after XRP took a win following Judge Analisa Torres’s ruling which stated that programmatic XRP sales are not to be considered a security.  Related Reading: Dogecoin Proof Of Stake Discussion Heats Up As Lead Dev Chimes In However, the SEC has recently issued an interlocutory appeal to reevaluate the case. This move has pushed XRP back to a potentially red zone in terms of regulatory challenges. If the SEC were to emerge victorious, then it could impact the potential listing of XRP on a platform such as Robinhood. Featured image from Coinmarketcap, chart from Tradingview.com"
  }
]