[
  {
    "source": "Cointelegraph",
    "date": "2023-10-28T17:52:32.000Z",
    "title": "Sam Bankman-Fried's perspective on FTX fall",
    "url": "http://cointelegraph.com/news/sam-bankman-fried-perspective-ftx-alameda-collapse",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/ee0540e8-9a9f-4f72-baf5-1cef6f3cf584.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sam Bankman-Fried testified in court this week, denying any wrongdoing between FTX and Alameda Research despite admitting “big mistakes.\" </p>\n                    <p><p>Sam “SBF” Bankman-Fried took the stand this week to testify in his ongoing criminal trial in the Southern District of New York, denying any wrongdoing between FTX and Alameda Research, while acknowledging making \"big mistakes\" during the companies’ fast-paced growth. </p><p>His official testimony started on Oct. 27, after a hearing on the previous day<a href=\"https://cointelegraph.com/news/sam-bankman-fried-testifies-without-jury\"> without the jurors present</a>. During the hearing, Bankman-Fried struggled to answer questions raised by government attorneys, whereas he appeared much better prepared the following day to face the jury.</p><p>A few highlights of Bankman-Fried’s testimony this week include denying directing his inner circle to make millionaire political donations in 2021, as well as claims that FTX's Term of Uses covered transactions between Alameda and the crypto exchange. Moreover, the former CEO stated that he had requested additional hedging strategies for Alameda throughout 2021 and 2022, but they were never implemented.</p><p>The defense is expected to conclude Bankman-Fried’s examination on Oct. 30, followed by the prosecution’s cross-examinations and closing arguments from both sides. Prosecutors also hinted about a possible rebuttal witness next week — someone who is called to prove that the testimony of another witness is false or inaccurate.</p><p>Bankman-Fried could be jailed for 115 years if found guilty of all fraud and conspiracy counts. Cointelegraph’s on-the-ground coverage of his testimony is summarized below.</p><h3>SBF refutes claims over political donations</h3><p>Bankman-Fried denied in court having directing Ryan Salame, former co-CEO of FTX Digital Markets, and Nishad Singh, former director of engineering, to funnel millions of dollars in contributions to political campaigns.</p><p>According to data available on OpenSecret, Singh gave $8 million to federal campaigns in the 2022 election cycle. Salame also<a href=\"https://cointelegraph.com/news/ftx-exec-gives-up-real-estate-car-cash-following-guilty-plea\"> donated $10 million to politicians via loans</a> from Alameda Research. </p><p>Even though Bankman-Fried denied instructing both to make political contributions, he recognized that lobbying in Washington, D.C. played a key role in his efforts to push a regulatory framework for crypto firms in the United States during 2021.</p><blockquote>\"I came to believe that I could impact the world.\"</blockquote><p>According to prosecutors, Bankman-Fried used funds from customers' deposits on FTX to make more than $100 million in political campaign contributions ahead of the 2022 midterm elections.</p><p>Bankman-Fried denied any wrongdoing during his testimony, asserting that FTX had more than $1 billion in revenue in 2021 and that political donations were made from the exchange’s own funds.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Maxine Waters is chairing the investigation into FTX <a href=\"https://t.co/oFMctH4rRh\">https://t.co/oFMctH4rRh</a> <a href=\"https://t.co/Ox6O5w4nOl\">pic.twitter.com/Ox6O5w4nOl</a></p>&mdash; Jordan Schachtel @ dossier.today (@JordanSchachtel) <a href=\"https://twitter.com/JordanSchachtel/status/1593289220755525632?ref_src=twsrc%5Etfw\">November 17, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>The New York Times test</h3><p>Bankman-Fried had a guideline for employees' communication at FTX and Alameda Research: The New York Times test. </p><p>Based on the informal test, employees should not write anything they wouldn't be comfortable seeing on the front page of the newspaper. According to Bankman-Fried, even harmless things could \"look pretty bad out of context,\" so employees should be sure to always provide sufficient context in written messages. </p><p>Bankman-Fried described the test as part of his explanation of why more than 200 channels on Signal had an autodelete policy that permanently deleted messages after a week.</p><p>Prosecutors used evidence of the autodelete feature in the previous days to suggest that any wrongdoing between the companies was being covered up. According to Bankman-Fried, official communications and regulatory paperwork were handled through other channels, such as Slack or email, but Signal was the choice for daily communication within the companies. </p><h3>Alameda’s unique role on FTX </h3><p>Bankman-Fried provided details about Alameda's billionaire line of credit with FTX. According to his testimony, Alameda served as FTX's payment provider for wire transactions while the exchange was unable to have its own account. </p><p>Besides being a payment processor, Alameda was also the primary liquidity provider, market maker and a client of FTX. </p><p>As liquidity provider and market maker, Alameda would have to step in and cover customer losses if FTX’s risk engine failed. During his testimony, Bankman-Fried provided an example of a failure of the risk engine that resulted in Alameda covering millions of dollars in losses in 2021. </p><p>The nature of Alameda's role in the exchange's operations prompted custom features in FTX's code, such as the ability to go negative via a line of credit without activating the risk engine. According to Bankman-Fried, the exemption was necessary to prevent Alameda's potential liquidation, which would negatively impact the crypto markets.</p><p>As a client of FTX, Alameda was also able to borrow funds by depositing collateral in the exchange. The terms of use of FTX allow borrowers to use funds for any purpose, which means Alameda could trade with the borrowed funds.</p><p>Alameda's line of credit with FTX grew along with the crypto industry during the bull market.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/96b03210-7cc2-4548-b604-477257af1cd5.jpg\"  /><figcaption style=\"text-align: center;\"><em>Scenes from outside Bankman-Fried’s trial location in New York. Source: Ana Paula Pereira/Cointelegraph</em></figcaption></figure><h3>Alameda fails to hedge</h3><p>Bankman-Fried discussed hedging strategies with Caroline Ellison, former CEO of Alameda Research, in 2021 and 2022 while seeking to shield the trading platform from a possible market downturn.</p><p>According to his testimony, Bankman-Fried asked Ellison to hedge $2 billion in Bitcoin (BTC) against a possible price decline in 2021. The strategy was never implemented, he told jurors. </p><p>Notes of Ellison<a href=\"https://cointelegraph.com/news/caroline-ellison-alameda-reveals-what-sam-bankman-fried-was-freaking-out-about\"> shared as evidence by prosecutors</a> reveal that Bankman-Fried was \"freaking out\" about hedging in early 2022. The defense used the evidence to illustrate that hedging was one of Bankman-Fried's highest concerns and discussed with Ellison frequently.</p><p>Without appropriate hedging in place, Alameda was significantly harmed by the Terra ecosystem collapse and decline in crypto prices. In September 2022, Bankman-Fried learned the liability between the companies had grown from $2 billion a year before to over $8 billion. </p><p>\"I was very surprised,” he claimed in court, stating that he believed Alameda’s assets outweighed its liabilities by nearly $10 billion. </p><h3>Clawback provision in Terms of Use</h3><p>According to Bankman-Fried, FTX's terms of use include a clawback provision that would socialize losses among customers using margin trade and futures contracts in the event that the exchange's risk engine fails.</p><p>The document presented in court states that:</p><blockquote>\"[...] your account balance may be subject to clawback due to losses suffered by other users.”</blockquote><p>If FTX could not cover losses related to spot margins and futures, damages would be shared among all customers. Defense lawyers used the provision to argue that customers trading on FTX were aware of the risks involved.</p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-10-28T18:00:44.000Z",
    "title": "From Airbnb to Bahamas Elite — Bankman-Fried Testifies About FTX’s Operations and Alameda",
    "url": "https://news.bitcoin.com/from-airbnb-to-bahamas-elite-bankman-fried-testifies-about-ftxs-operations-and-alameda/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/sbfshdj-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/10/sbfshdj-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/sbfshdj-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/sbfshdj-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/sbfshdj-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/sbfshdj-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/sbfshdj-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/10/sbfshdj.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Sam Bankman-Fried took the stand in his fraud trial on Friday, October 27, 2023, and was questioned by his lawyer about the operations of FTX and its relationship with affiliated crypto trading firm Alameda Research. Sam Bankman-Fried&#8217;s Trial Testimony Day 2 On Friday, Sam Bankman-Fried stated that FTX was &#8220;primarily a margin exchange&#8221; that allowed [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-28T18:02:26.000Z",
    "title": "EOS Price Prediction 2023-2032: Is EOS a good investment?",
    "url": "https://www.cryptopolitan.com/eos-price-prediction/",
    "description": "EOS Price Prediction 2023-2032 EOS, a crypto token formed by the company to promote its decentralized app creation, ranks #47, a little lower on the charts, thanks to its slightly lower market cap of $3,365,472,360. Lately, it has resumed its upward projectile with renewed activities and is viewed by some analysts as a &#8220;ticking time ... <a title=\"EOS Price Prediction 2023-2032: Is EOS a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eos-price-prediction/\" aria-label=\"More on EOS Price Prediction 2023-2032: Is EOS a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-28T17:53:42.000Z",
    "title": "The Fusion of AI and Machine Learning in Decentralized Platforms: A Technological Revolution",
    "url": "https://www.cryptopolitan.com/ai-and-machine-learning-in-decentralized-platforms/",
    "description": "In an era of ever-evolving technology, the integration of artificial intelligence (AI) and machine learning (ML) into decentralized platforms marks a groundbreaking convergence of cutting-edge technologies. This fusion holds the potential to revolutionize the way we interact with and harness decentralized systems. Decentralized platforms, including blockchain and decentralized applications (DApps), have garnered attention for their ... <a title=\"The Fusion of AI and Machine Learning in Decentralized Platforms: A Technological Revolution\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-and-machine-learning-in-decentralized-platforms/\" aria-label=\"More on The Fusion of AI and Machine Learning in Decentralized Platforms: A Technological Revolution\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-28T18:00:35.000Z",
    "title": "Shiba Inu Accumulation: You Won’t Believe How Much SHIB Whales Have Bought",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-accumulation-shib-whales/",
    "description": "Shiba Inu is up by 12.15% in a 7-day timeframe as investors continue to accumulate cryptocurrencies in the wider crypto market. However, on-chain data has shown that accumulation has been going on for a while, with SHIB whales now accumulating $300 million in the past three months.  Shiba Inu Whales Have Been Accumulating Large Amounts Of SHIB On-chain data from IntoTheBlock has shown that SHIB whales, meaning large holders, have been accumulating huge amounts of SHIB over the last few months. Large holders in the Shiba Inu ecosystem are divided into 12 whales (those with more than 1% of circulating supply) and 47 investors (those with more than 0.1% of circulating supply). These top SHIB wallet addresses have added an increase of +33.17%, around $300 million worth of SHIB in just the last 90 days. Related Reading: Litecoin Whales Are Back In The Game, Can Price Reach $100? Data from the on-chain tracker Whale Alerts has shown various massive transfers during this time period. When investors accumulate large amounts, it often signals an incoming price rally.  🚨 🚨 4,544,030,677,374 #SHIB (32,142,200 USD) transferred from unknown wallet to unknown wallethttps://t.co/Y7jvL2qtJV — Whale Alert (@whale_alert) October 21, 2023 These massive accumulations by large holders point to their bullish belief in SHIB, despite the crypto having a weak momentum before the ongoing spike in the crypto market.  This accumulation can, for the most part, be traced back to the introduction of Shibarium. The layer-2 solution developed by Shiba Inu, known as Shibarium, has had a good deal of success. At the time this article was written, the Shibarium blockchain had a total of 3,685,073 transactions and 1,257,858 wallet addresses. SHIB Future Outlook SHIB has had a price spike in relation to the ongoing inflow of funds into the crypto market currently being spearheaded by Bitcoin. At the time of writing, SHIB is trading at $0.00000784 after facing rejection at the $0.0000082 mark.  Bulls have defended the $0.0000061 support level and $0.0000077 levels very strongly to form support after the price tested the latter level multiple times. A sustained move above $0.0000082 could send SHIB skyrocketing to its August high of $0.00001137. Related Reading: Bitcoin Price Rally: Analyst Sets $45,000 Target And It’s Closer Than You Think Large SHIB holders now hold 71% of the total circulating supply, and some of them can manipulate the price to their advantage. While whale accumulation is a positive sign, there are other things to consider regarding SHIB&#8217;s price outlook. On the other hand, the Shiba Inu developers and team leaders have pointed at upcoming projects in the ecosystem, one of which is a stablecoin based on Shibarium. If successful, a SHIB-based stablecoin could attract new investors to the Shiba Inu ecosystem, leading to a strong SHIB price spike. SHIB price readies to test $0.000008 &#124; Source: SHIBUSD on Tradingview.com Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-28T18:00:01.000Z",
    "title": "Mina Doubles In Value, Nugget Rush Sells Over 60% of First Presale Phase",
    "url": "https://www.crypto-news-flash.com/mina-doubles-in-value-nugget-rush-sells-over-60-of-first-presale-phase/?utm_source=rss&utm_medium=rss&utm_campaign=mina-doubles-in-value-nugget-rush-sells-over-60-of-first-presale-phase",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-73.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-73.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-73-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-73-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-73-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-73-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Mina soars as it doubles in value. NuggetRush becomes an investor favorite, selling over 60% of tokens in its first presale phase Analysts forecast a 2,500% increase in its value before the end of 2023. The crypto landscape is filled with potential, which it has shown countless times. Recently, there have been a few standout [...]"
  }
]