[
  {
    "source": "Cointelegraph",
    "date": "2024-03-07T13:05:32.000Z",
    "title": " Lava launches as decentralized lending market to optimize liquidity across blockchains ",
    "url": "https://cointelegraph.com/news/lava-decentralized-lending-mitigate-impermanent-loss",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYjIzMGE5ZGEtMzIyMS00OWM2LWE4YWMtY2Y3NDg5MzAxMTAwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Mitigating impermanent loss could help democratize market-making in DeFi, according to Recharge Capital’s John Lo.</p>\n                    <p><p data-ct-non-breakable=\"true\">Lava, a decentralized lending market platform, has announced its launch on March 7.</p><p>Lava’s infrastructure will enable automated market makers' (AMMs) liquidity positions to mitigate impermanent loss and optimize liquidity across multiple blockchain networks, according to a March 7 press release, shared with Cointelegraph.</p><p>Impermanent loss is an issue for all liquidity providers in decentralized exchanges, according to John Lo, Managing Partner of digital assets, at Recharge Capital. He told Cointelegraph.</p><p><a href=\"https://cointelegraph.com/news/lava-decentralized-lending-mitigate-impermanent-loss\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-07T13:00:50.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Rumors circulated that Musk has added to Tesla’s Bitcoin stockpile after Arkham Intelligence added the automaker’s BTC wallet to its dashboard. BlockFi and FTX have agreed to a settlement deal that could see BlockFi get closer to full recovery for its creditors. Bitcoin mining company Hut 8 has announced the permanent closure of its Drumheller, Canada, facility, citing adverse conditions in the mining industry.</p><p>Tesla’s Bitcoin holdings have become a topic of discussion in the crypto community again after cryptocurrency data analytics platform Arkham Intelligence added Tesla’s Bitcoin <a href=\"https://cointelegraph.com/news/tesla-buying-bitcoin-btc-wallet-curiosity\">wallet</a> tracking feature to its dashboard. Tesla’s wallet now <a href=\"https://platform.arkhamintelligence.com/explorer/entity/tesla\" target=\"_blank\" rel=\"noopener nofollow\">holds</a> about 11,509 <a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a> at the time of writing, 1,789 more than the 9,720 BTC it reported during its last earnings report.</p><p>The Elon Musk-led Tesla bought <a href=\"https://cointelegraph.com/news/tesla-s-1-5b-bitcoin-purchase-leaves-treasury-experts-scratching-heads\">$1.5 billion worth of Bitcoin in February 2021</a>, near the peak of the last bull run, and it announced plans to accept Bitcoin payments for its cars. However, the firm’s Bitcoin adoption was short-lived, with the company first selling about 10% of its holdings in March 2021. In the second quarter of 2022, the electric carmaker sold approximately 75% of its Bitcoin reserves.</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-07T12:54:35.000Z",
    "title": " Greek stock exchange eyes Sui blockchain for on-chain fundraising tool  ",
    "url": "https://cointelegraph.com/news/greek-stock-exchange-sui-blockchain-on-chain-fundraising",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYTA5YmMyMjgtZTZkZC00Mzk3LWJlOWYtOTE0N2U2NTM3OGMzLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The Greek stock exchange, ATHEX, is eying the deployment of its new fundraising mechanism on the Sui blockchain ecosystem.</p>\n                    <p><p data-ct-non-breakable=\"true\">The Greek stock exchange announced that it is considering launching its new tool, the electronic book building (EBB), on the Sui blockchain ecosystem. </p><p>In a blog <a href=\"https://blog.sui.io/athex-greek-stock-exchange-evaluates-sui/\" target=\"_blank\" rel=\"noopener nofollow\">post</a> on March 6, Sui revealed that the EBB will be developed in collaboration between the Athens Exchange Group (ATHEX) and Mysten Labs, the original contributor to the Sui ecosystem. </p><p>ATHEX’s EBB would be a new fundraising future, which would allow early-stage and mature companies to list transferable securities. Sui would host ATHEX securities, which would be minted as digital certificates if played out. </p><p><a href=\"https://cointelegraph.com/news/greek-stock-exchange-sui-blockchain-on-chain-fundraising\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-07T12:50:00.000Z",
    "title": " Nigerian central bank hires Gluwa to advance eNaira through credit profiles ",
    "url": "https://cointelegraph.com/news/nigerian-central-bank-hires-gluwa-enaira-credit-profiles",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYzljNGQ0ZjAtMDE0NS00OTBhLWI1MTctNjlmYTg3MzdiYmYyLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The pioneering African CBDC has few users, but creating credit histories for them will promote financial inclusion. </p>\n                    <p><p data-ct-non-breakable=\"true\">The Central Bank of Nigeria (CBN) has complete a memorandum of understanding with Gluwa Nigeria to promote the usage of the eNaira central bank digital currency (CBDC). Gluwa is a blockchain-based financial platform that has been active in Nigeria for several years.</p><p>As an agent partner of the CBN, Gluwa will integrate its Credal technology into the eNaira platform, according to a statement sent to Cointelegraph. It plans to enable the creation of “credit reputations” for unbanked users, thus furthering financial inclusion. The credit profiles it will create will be “accessible across borders” and increase the CBDC’s effectiveness:</p><p>This <a href=\"https://cointelegraph.com/news/enaira-is-crippled-nigeria-in-talks-with-ny-based-company-for-revamp\">is the latest of many attempts</a> by the CBN to boost eNaira usage. The eNaira is the world’s second-oldest CBDC, launched in October 2021. As of mid-2023, less than 1% of Nigerians with bank accounts had eNaira wallets, and less than <a href=\"https://cointelegraph.com/news/imf-sees-room-for-enaira-improvement-in-first-year-assessment\">1.5% of wallet holders were active</a> in a week.</p><p><a href=\"https://cointelegraph.com/news/nigerian-central-bank-hires-gluwa-enaira-credit-profiles\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-07T13:06:01.000Z",
    "title": "MicroStrategy ups debt offering to $700 million to buy more Bitcoin",
    "url": "https://cryptoslate.com/microstrategy-ups-debt-offering-to-700-million-to-buy-more-bitcoin/",
    "description": "<p>MicroStrategy&#8217;s MSTR shares surged by about 3% in pre-market trading following the company&#8217;s announcement to increase its convertible debt offering to $700 million, up from the initially planned $600 million. This uptick in stock performance maintains the ongoing positive trend observed in MSTR shares since the year began. According to data from Yahoo Finance, the [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/microstrategy-ups-debt-offering-to-700-million-to-buy-more-bitcoin/\">MicroStrategy ups debt offering to $700 million to buy more Bitcoin</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2024-03-07T12:45:11.000Z",
    "title": "Short-term holders transfer record $4.3 billion in profits to exchanges",
    "url": "https://cryptoslate.com/insights/short-term-holders-transfer-record-4-3-billion-in-profits-to-exchanges/",
    "description": "<p>Quick Take Short-term holders, investors who have held Bitcoin for less than 155 days, transferred 65,000 Bitcoin in profit to exchanges on Mar. 6. According to data from Glassnode, this marks one of the highest amounts of profit sent in Bitcoin terms in the past five years, only surpassed by April 2019&#8217;s record when 75,000 [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/short-term-holders-transfer-record-4-3-billion-in-profits-to-exchanges/\">Short-term holders transfer record $4.3 billion in profits to exchanges</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-07T13:05:11.000Z",
    "title": "Firewall raises $3.7M to take smart contracts mainstream with programmable finality",
    "url": "https://cryptodaily.co.uk/2024/03/firewall-raises-37m-to-take-smart-contracts-mainstream-with-programmable-finality",
    "description": "Firewall raises $3.7M to take smart contracts mainstream with programmable finality"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-07T12:46:45.000Z",
    "title": "Spain’s Privacy Concerns Puts Brakes on Worldcoin's Crypto-based ID Scheme",
    "url": "https://cryptodaily.co.uk/2024/03/spains-privacy-concerns-puts-brakes-on-worldcoins-crypto-based-id-scheme",
    "description": "The Spanish government's data protection agency (AEPD) ordered Worldcoin to halt its eyeball recognition project over privacy concerns."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T13:06:20.000Z",
    "title": "Firewall raises $3.7M to take smart contracts mainstream with programmable finality",
    "url": "https://www.cryptopolitan.com/firewall-raises-3-7m-to-take-smart-contracts-mainstream-with-programmable-finality/",
    "description": "San Francisco, USA / California, March 7th, 2024, Chainwire Firewall secures funding from North Island Ventures, Breyer Capital, and Hack VC to bulletproof smart contract networks. Firewall, a blockchain infrastructure startup, announced its $3.7M pre-seed round, co-led by North Island Ventures, Breyer Capital, and Hack VC. Firewall transforms the usability of smart contract technology through [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T12:53:58.000Z",
    "title": "Climate Change Faces Dual Impact from AI ",
    "url": "https://www.cryptopolitan.com/climate-change-impact-from-ai/",
    "description": "Explore the complex impact of artificial intelligence on climate change, including its potential to both aid and hinder environmental efforts. "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-07T12:41:23.000Z",
    "title": "Fraudulent Activity Detected in Humanized_AI’s $665,000 Ethereum Sale",
    "url": "https://www.cryptopolitan.com/scam-detected-in-humanized-ai-ethereum-sale/",
    "description": "&#160;in the world of cryptocurrency, Humanized_AI, a project touting the enhancement of AI technology to replicate human-like perceptions, has been flagged as a potentially fraudulent initiative.&#160; The project, which gained attention for its ambitious goals, has raised significant funding amounting to 173 ETH, equivalent to $665,000, during a one-month sales period. However, concerns have arisen [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-07T13:06:50.000Z",
    "title": "New DeFi cryptocurrency attracts TRX & LINK investors",
    "url": "https://crypto.news/new-defi-cryptocurrency-attracts-trx-link-investors/",
    "description": "Discover why Chainlink and Tron are exploring Pullix alternatives to complement their portfolios . #partnercontent"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-07T12:42:11.000Z",
    "title": "PolySwarm (NCT) surges 91% in 24-hour trading",
    "url": "https://crypto.news/polyswarm-nct-surges-91-in-24-hour-trading/",
    "description": "PolySwarm (NCT) has registered an over 90% price increase in the past 24 hours, as major crypto assets experience minor dips across the board. PolySwarn is a blockchain project focused on strengthening cybersecurity in the Web3 space.&#160; The current PolySwarm(NCT)&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-07T13:00:52.000Z",
    "title": "Super Tuesday Crypto Craze: Biden-Related Memecoin Stuns Markets With 5,000% Surge",
    "url": "https://www.newsbtc.com/news/super-tuesday-crypto-craze-biden-related-memecoin-stuns-markets-with-5000-surge/",
    "description": "The memecoin frenzy has struck again, and this time it&#8217;s centered around the likeness of US President Joe Biden. BODEN, a token named after the president, has experienced &#8211; at one point &#8211; a mind-boggling surge in value, skyrocketing by a jaw-dropping 5,000%, according to CoinMarketCap. Related Reading: Don’t Miss Out: XRP Bull Flag Signals Explosive Price Movement BODEN&#8217;s meteoric rise is just one example of the wider trend of meme coins seeking to capitalize on the popularity of prominent figures, be they politicians or celebrities. These tokens aim to attract investors seeking quick profits by leveraging the fame of their namesakes. Memecoin Fever: BODEN Makes Big Noise Trading data from CoinMarketCap reveals that BODEN, a Solana-based meme coin, has seen an astronomical rise of over 2,400% within the last 24 hours, marking a milestone in the crypto world. With a trading price of approximately $0.018, this quirky digital asset has amassed a staggering market volume of $24 million in a mere day. BODEN token price. Source: CoinMarketCap The surge in BODEN&#8217;s value has ushered in a new wave of meme coins, as developers seize the opportunity to capitalize on the hype and allure investors seeking swift gains. Trump Memecoin Also In The Spotlight Meanwhile, the cryptocurrency TRUMP, associated with Donald Trump, recently dropped to $8.08, although it still maintains a considerably higher value compared to its year-end price. Despite not being directly linked to politicians, Trump had previously received over 579,000 TRUMP tokens from the project team. Total crypto market cap at $2.44 trillion on the daily chart: TradingView.com The asset experienced a significant surge in January 2024, reaching a value of $4 million in Trump&#8217;s wallet, compared to trading between $0.01 and $0.08 in November 2023. The price increase is attributed to political victories by both Biden and Trump during the Super Tuesday contests, with Trump winning in 14 out of 15 states as the Republican candidate. BODEN Flexes Muscles However, BODEN has taken center stage this week, surpassing even the beloved Dogecoin (DOGE), the pioneer meme coin on Solana. BODEN&#8217;s performance has even outshined dogwifhat (WIF) and Bonk&#8217;s BONK, solidifying its dominance in the meme coin realm. Related Reading: Can DOGE Avoid A Dive? Sell Pressure Puts Memecoin To The Test Amidst the meme coin frenzy, let&#8217;s not forget the reigning king of the crypto world—Bitcoin (BTC). The leading digital currency experienced a fleeting moment of glory as it soared to a new all-time high of $69,300, a record not seen since 2021. However, the excitement was short-lived as BTC quickly retracted to as low as $60,000, causing a billion-dollar wipeout in the market. Featured image from AFP; Getty Images, chart from TradingView"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-07T13:00:41.000Z",
    "title": "14-Year Old Dormant Bitcoin Wallet Wakes Up To Crash BTC Price",
    "url": "https://www.newsbtc.com/news/bitcoin/14-year-old-dormant-bitcoin/",
    "description": "The Bitcoin foray past its previous all-time high into new territory was short-lived as the crypto dipped in the hours after. On-chain data has shown an interesting scenario that contributed to selling pressure leading to the crash. According to Spot On Chain, a dormant Bitcoin address holding $67.1 million worth of Bitcoin recently came to life after 14 years of inactivity to sell all of its large holdings. Bitcoin Wallet Wakes Up To Crash BTC Price Bitcoin recorded a new all-time high of $69,200 during the week to surpass the previous record set in November 2021. This long-awaited Bitcoin milestone ignited a strong feeling of euphoria among crypto traders as it marked the first step to a six-digit Bitcoin price. However, this euphoria was short-lived as the new all-time high caused a wave of profit-taking among investors, which resulted in Bitcoin falling to $61,200 in the hours that followed. Related Reading: Analyst Predicts Massive Rally For Dogecoin Price With A $1 Target, Here’s How On-chain data from Spot On Chain indicates that this crash was further exacerbated by a long-dormant Bitcoin whale. The whale address, which had remained inactive since 2010, woke up after the new Bitcoin all-time high to sell all of its holdings.  According to Spot On Chain, the whale minted 1,000 BTC back in 2010 when the price was below $0.28. That would mean the Bitcoins were worth $280 at the time they were acquired. By the time they were sold on the crypto exchange Coinbase, the Bitcoins were worth $67,116 per coin, suggesting that the whale might have profited over $60 million.   A dormant whale woke up after 14 years to deposit all 1,000 $BTC ($67.1M) to #Coinbase at $67,116 ~20 hours ago, allegedly contributing to the recent market crash! The whale minted those $BTC in 2010 when the price was below $0.28, suggesting that the whale might just have taken… pic.twitter.com/VBj6VvzAuH — Spot On Chain (@spotonchain) March 6, 2024 The Bitcoin blockchain is home to many active and dormant whale addresses. The reactivation of old, dormant wallets containing massive amounts of BTC like this one tends to attract the interest of investors about who owns them. The reactivation of dormant addresses is impossible to predict, and not all of them indicate profit-taking.  What’s Next For BTC? Bitcoin&#8217;s pullback after setting a new all-time high was anticipated by some expert traders. The crypto has since regained its footing after the dip and is now trading at $66,915.  Related Reading: Crypto Analyst Predicts XRP Price To Break Out Of Bull Pattern, Here Are The Targets Most of the recent spike can be attributed to massive accumulation from traders and institutional inflow into Spot Bitcoin ETFs. Despite outflows from Grayscale&#8217;s ETF, the total net flow into the ETFs was $332 million yesterday. The total net flow since January 11 has now crossed over $8.895 billion. At the same time, Bitcoin whale transactions worth at least $100,000 now stand at $187 billion in the past seven days. BTC price at $67,000 &#124; Source: BTCUSD on Tradingview.com Featured image from ABC News, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-07T13:08:35.000Z",
    "title": "Satoshi Nakamoto Mystery: Ripple CTO Offers Perspective on Identity Debate",
    "url": "https://www.crypto-news-flash.com/satoshi-nakamoto-mystery-ripple-cto-offers-perspective-on-identity-debate/?utm_source=rss&utm_medium=rss&utm_campaign=satoshi-nakamoto-mystery-ripple-cto-offers-perspective-on-identity-debate",
    "description": "<img width=\"1280\" height=\"960\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/10/hacker-g34d7fb142_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/10/hacker-g34d7fb142_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/hacker-g34d7fb142_1280-300x225.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/hacker-g34d7fb142_1280-1024x768.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/hacker-g34d7fb142_1280-768x576.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/hacker-g34d7fb142_1280-24x18.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/hacker-g34d7fb142_1280-36x27.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/10/hacker-g34d7fb142_1280-48x36.png 48w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Ripple&#8217;s CTO doubts Craig Wright is Satoshi Nakamoto due to lack of proof, sparking debate in the crypto community. Some think Satoshi Nakamoto could be a group, not an individual, given Bitcoin&#8217;s complexity. In a recent statement, David Schwartz questioned the credibility of Wright&#8217;s claim, an Australian computer scientist, that he is the mysterious Satoshi [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-07T13:03:33.000Z",
    "title": "Firewall raises $3.7M to take smart contracts mainstream with programmable finality",
    "url": "https://www.crypto-news-flash.com/firewall-raises-3-7m-to-take-smart-contracts-mainstream-with-programmable-finality/?utm_source=rss&utm_medium=rss&utm_campaign=firewall-raises-3-7m-to-take-smart-contracts-mainstream-with-programmable-finality",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/image_4_17097552526QfsVWz1F7.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/image_4_17097552526QfsVWz1F7.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/image_4_17097552526QfsVWz1F7-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/image_4_17097552526QfsVWz1F7-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/image_4_17097552526QfsVWz1F7-150x90.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/image_4_17097552526QfsVWz1F7-450x270.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />San Francisco, USA / California, March 7th, 2024, Chainwire Firewall secures funding from North Island Ventures, Breyer Capital, and Hack VC to bulletproof smart contract networks. Firewall, a blockchain infrastructure startup, announced its $3.7M pre-seed round, co-led by North Island Ventures, Breyer Capital, and Hack VC. Firewall transforms the usability of smart contract technology through [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-07T13:02:36.000Z",
    "title": "VeChain Partners with Oobit for VET Token Integration, Enabling NFC Crypto Payments",
    "url": "https://www.crypto-news-flash.com/vechain-partners-with-oobit-for-vet-token-integration-enabling-nfc-crypto-payments/?utm_source=rss&utm_medium=rss&utm_campaign=vechain-partners-with-oobit-for-vet-token-integration-enabling-nfc-crypto-payments",
    "description": "<img width=\"1400\" height=\"788\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/vechain.webp\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/03/vechain.webp 1400w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/vechain-300x169.webp 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/vechain-1200x675.webp 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/vechain-768x432.webp 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/vechain-150x84.webp 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/03/vechain-450x253.webp 450w\" sizes=\"(max-width: 1400px) 100vw, 1400px\" />VeChain has partnered with Oobit, enabling the integration of VET into the latter&#8217;s Tap &#38; Pay feature, which allows easy payments at merchant stores using the VET token. VET became the sixth token supported by Oobit; Sunny Lu described the partnership as &#8220;a tangible step towards making blockchain technology synonymous with positive societal impact.&#8221; VeChain [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-07T13:01:50.000Z",
    "title": "Bitcoin Price Controversy Ahead of Halving Event",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/bitcoin-price-controversy-ahead-of-halving-event/",
    "description": "<p>Bitcoin has been in the news over the last few weeks, thanks to its recent resurgence. Rania Gule, a market analyst at XS.com, recently shared her analysis of Bitcoin ahead of the Bitcoin halving. Bitcoin Price Debate Intensifies Before Halving Milestone Bitcoin recently hit a new all-time high before falling from that height. However, BTC [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/bitcoin-price-controversy-ahead-of-halving-event/\">Bitcoin Price Controversy Ahead of Halving Event</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-07T13:06:12.000Z",
    "title": "Firewall raises $3.7M to take smart contracts mainstream with programmable finality",
    "url": "https://coinedition.com/firewall-raises-3-7m-to-take-smart-contracts-mainstream-with-programmable-finality/",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://coinedition.com/wp-content/uploads/2024/03/image_4_17097552526QfsVWz1F7.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2024/03/image_4_17097552526QfsVWz1F7.jpg 1200w, https://coinedition.com/wp-content/uploads/2024/03/image_4_17097552526QfsVWz1F7-300x180.jpg 300w, https://coinedition.com/wp-content/uploads/2024/03/image_4_17097552526QfsVWz1F7-1024x614.jpg 1024w, https://coinedition.com/wp-content/uploads/2024/03/image_4_17097552526QfsVWz1F7-380x228.jpg 380w, https://coinedition.com/wp-content/uploads/2024/03/image_4_17097552526QfsVWz1F7-768x461.jpg 768w, https://coinedition.com/wp-content/uploads/2024/03/image_4_17097552526QfsVWz1F7-148x89.jpg 148w, https://coinedition.com/wp-content/uploads/2024/03/image_4_17097552526QfsVWz1F7-742x445.jpg 742w, https://coinedition.com/wp-content/uploads/2024/03/image_4_17097552526QfsVWz1F7-412x247.jpg 412w, https://coinedition.com/wp-content/uploads/2024/03/image_4_17097552526QfsVWz1F7-400x240.jpg 400w, https://coinedition.com/wp-content/uploads/2024/03/image_4_17097552526QfsVWz1F7-275x165.jpg 275w, https://coinedition.com/wp-content/uploads/2024/03/image_4_17097552526QfsVWz1F7-352x211.jpg 352w, https://coinedition.com/wp-content/uploads/2024/03/image_4_17097552526QfsVWz1F7-117x70.jpg 117w, https://coinedition.com/wp-content/uploads/2024/03/image_4_17097552526QfsVWz1F7-125x75.jpg 125w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" /><p>San Francisco, USA / California, March 7th, 2024, Chainwire Firewall secures funding from North Island Ventures, Breyer Capital, and Hack VC to bulletproof smart contract networks. Firewall, a blockchain infrastructure startup, announced its $3.7M pre-seed round, co-led by North Island Ventures, Breyer Capital, and Hack VC. Firewall transforms the usability of smart contract technology through [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/firewall-raises-3-7m-to-take-smart-contracts-mainstream-with-programmable-finality/\">Firewall raises $3.7M to take smart contracts mainstream with programmable finality</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-07T13:00:00.000Z",
    "title": "FET, NEAR, and RNDR Ultra Bullish Trend and BEFE Token to Follow in Q2",
    "url": "https://coinedition.com/fet-near-and-rndr-ultra-bullish-trend-and-befe-token-to-follow-in-q2/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/03/FET_NEAR_and_RNDR_Ultra_Bullish_Trend_and_BEFE_Token_to_Follow.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2024/03/FET_NEAR_and_RNDR_Ultra_Bullish_Trend_and_BEFE_Token_to_Follow.jpg 730w, https://coinedition.com/wp-content/uploads/2024/03/FET_NEAR_and_RNDR_Ultra_Bullish_Trend_and_BEFE_Token_to_Follow-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/03/FET_NEAR_and_RNDR_Ultra_Bullish_Trend_and_BEFE_Token_to_Follow-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/03/FET_NEAR_and_RNDR_Ultra_Bullish_Trend_and_BEFE_Token_to_Follow-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/03/FET_NEAR_and_RNDR_Ultra_Bullish_Trend_and_BEFE_Token_to_Follow-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/03/FET_NEAR_and_RNDR_Ultra_Bullish_Trend_and_BEFE_Token_to_Follow-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/03/FET_NEAR_and_RNDR_Ultra_Bullish_Trend_and_BEFE_Token_to_Follow-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/03/FET_NEAR_and_RNDR_Ultra_Bullish_Trend_and_BEFE_Token_to_Follow-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/03/FET_NEAR_and_RNDR_Ultra_Bullish_Trend_and_BEFE_Token_to_Follow-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/03/FET_NEAR_and_RNDR_Ultra_Bullish_Trend_and_BEFE_Token_to_Follow-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/03/FET_NEAR_and_RNDR_Ultra_Bullish_Trend_and_BEFE_Token_to_Follow-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/03/FET_NEAR_and_RNDR_Ultra_Bullish_Trend_and_BEFE_Token_to_Follow-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/03/FET_NEAR_and_RNDR_Ultra_Bullish_Trend_and_BEFE_Token_to_Follow-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/03/FET_NEAR_and_RNDR_Ultra_Bullish_Trend_and_BEFE_Token_to_Follow-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/03/FET_NEAR_and_RNDR_Ultra_Bullish_Trend_and_BEFE_Token_to_Follow-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/03/FET_NEAR_and_RNDR_Ultra_Bullish_Trend_and_BEFE_Token_to_Follow-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Meme coin King BEFE Token is now set for an astronomic ride as the long-awaited bull market is finally here, with AI tokens FET, NEAR, and RNDR surging to new yearly highs. New data suggests that AI and Big data tokens have exploded by over 250% on average in the last eight weeks alone. Notable [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/fet-near-and-rndr-ultra-bullish-trend-and-befe-token-to-follow-in-q2/\">FET, NEAR, and RNDR Ultra Bullish Trend and BEFE Token to Follow in Q2</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-07T12:56:15.000Z",
    "title": "Web3 Social Infrastructure UXLINK 30-Day User Account Asset Balance Surpasses $105 Million",
    "url": "https://coinedition.com/web3-social-infrastructure-uxlink-30-day-user-account-asset-balance-surpasses-105-million/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2024/03/2-56.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://coinedition.com/wp-content/uploads/2024/03/2-56.jpg 730w, https://coinedition.com/wp-content/uploads/2024/03/2-56-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2024/03/2-56-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2024/03/2-56-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2024/03/2-56-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2024/03/2-56-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2024/03/2-56-313x175.jpg 313w, https://coinedition.com/wp-content/uploads/2024/03/2-56-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2024/03/2-56-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2024/03/2-56-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2024/03/2-56-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2024/03/2-56-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2024/03/2-56-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2024/03/2-56-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2024/03/2-56-129x73.jpg 129w, https://coinedition.com/wp-content/uploads/2024/03/2-56-355x200.jpg 355w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>when UXLINK launched UX Account to access EOA accounts, by March 2, the balance of EOA accounts linked to UX Account has exceeded $105 million! The average balance of each EOA account address is more than $350, and users are widely distributed in dozens of countries in Southeast Asia, the Middle East, Europe, North America [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/web3-social-infrastructure-uxlink-30-day-user-account-asset-balance-surpasses-105-million/\">Web3 Social Infrastructure UXLINK 30-Day User Account Asset Balance Surpasses $105 Million</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-07T12:45:37.000Z",
    "title": "Crypto Trader Says Dogecoin Has ‘Too Much Firepower,’ Could Skyrocket by Over 500% – But There’s a Catch",
    "url": "https://dailyhodl.com/2024/03/07/crypto-trader-says-dogecoin-has-too-much-firepower-could-skyrocket-by-over-500-but-theres-a-catch/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/03/Trader-Says-Dogecoin-Has-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/03/Trader-Says-Dogecoin-Has-.jpg 1366w, https://dailyhodl.com/wp-content/uploads/2024/03/Trader-Says-Dogecoin-Has-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/03/Trader-Says-Dogecoin-Has-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/03/Trader-Says-Dogecoin-Has-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/03/Trader-Says-Dogecoin-Has-.jpg?resize=750,439 750w, https://dailyhodl.com/wp-content/uploads/2024/03/Trader-Says-Dogecoin-Has-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular crypto trader believes dog-themed digital asset Dogecoin (DOGE) could skyrocket more than 6x the current value. The pseudonymous analyst known as Altcoin Sherpa tells his 209,800 followers on the social media platform X that DOGE could hit the $1 level with help from one of the memecoin&#8217;s biggest cheerleaders, billionaire Elon Musk. Musk&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/07/crypto-trader-says-dogecoin-has-too-much-firepower-could-skyrocket-by-over-500-but-theres-a-catch/\">Crypto Trader Says Dogecoin Has ‘Too Much Firepower,’ Could Skyrocket by Over 500% – But There’s a Catch</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]