[
  {
    "source": "Decrypt",
    "date": "2024-02-14T01:35:23.000Z",
    "title": "Nvidia Flips Amazon In Market Cap Riding High On AI",
    "url": "https://decrypt.co/217330/nvidia-flips-amazon-in-market-cap-riding-high-on-ai",
    "description": "The chipmaker is the 4th largest tech company by market cap. For tonight, at least."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-14T01:36:43.000Z",
    "title": " Bitcoin ETF war could see many issuers never ‘break even’ — Analysts ",
    "url": "https://cointelegraph.com/news/bitcoin-etf-fees-mean-many-issuers-wont-break-even",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvOTNjZWE5ODQtNDAyYi00NmJlLTk3MWYtZDBmMjRlNzQ2NTlhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Some Bitcoin ETF issuers will pull their funds as the tussle for market share and low fees heats up, while investors reap the rewards in the meantime, say analysts.</p>\n                    <p><p>The cutthroat battle to become the top United States spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded fund (ETF) issuer could see many of the listed ETFs today eventually shut their down due to lack of profit.</p><p>According to analysts, the ETF fee war may have shut out smaller issuers from joining the race. However, a silver lining is that investors end up as the “biggest winners” due to falling fees.</p><p>“Most of the current ETFs launched will never even break even as costs will only work if they get to billions of assets under management, which they won’t,” Hector McNeil, the co-CEO and founder of white-label ETF provider HANetf, told Cointelegraph.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-etf-fees-mean-many-issuers-wont-break-even\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-14T01:30:19.000Z",
    "title": "Behind Ethereum’s Surge: Here’s How This Whale Is Taking Advantage Of The ETH Rally",
    "url": "https://www.newsbtc.com/news/ethereum/behind-ethereum-surge-heres-how-this-whale/",
    "description": "In recent weeks, Ethereum has witnessed a noticeable uptick in its market price, reaching a one-month high and showcasing a growing demand for the asset. Amid this development, the on-chain analytics platform Lookonchain revealed an Ethereum whale&#8217;s noteworthy strategy, marking a bold stance on Ethereum&#8217;s future trajectory. Strategic Accumulation Amid Rising Prices According to Loookonchain, an unknown whale has been actively increasing their Ethereum holdings, utilizing the Spark platform&#8217;s revolving loan feature. Spark platform is a decentralized finance (DeFi) product that enables users to borrow stablecoins like USDC or DAI against their cryptocurrency holdings. Related Reading: Crypto Drama Unfolds: Ethereum Co-Founder’s 22,000 ETH Transfer Sparks Price Speculation This investor has managed to withdraw 39,900 ETH worth roughly $99.5 million from major exchanges such as Binance, Bybit, OKEx, and Bitfinex, leveraging the flexibility of revolving loans to boost their position in Ethereum. Further insights from Lookonchain reveal that these withdrawals by the whale represent a continuous strategy rather than an isolated event. Since the start of the month, the whale has consistently been pulling out ETH, averaging a withdrawal price of $2,492, and has secured about 56.8 million DAI in loans from the Spark platform so far. A whale is accumulating $ETH and going long $ETH by revolving loans on #Spark! The whale has withdrawn 39.9K $ETH($99.5M) from #Binance, #Bybit, #OKEx and #Bitfinex since Feb 1 at an average price of $2,492, and borrowed 56.8M $DAI from #Spark.https://t.co/9EQSrwHnJD pic.twitter.com/6CydURt2pc — Lookonchain (@lookonchain) February 13, 2024 While bold, this strategy highlights the optimism surrounding Ethereum&#8217;s potential growth, especially in anticipation of the upcoming altcoin bull run and the expanding interest in Ethereum-based investment products like the spot exchange-traded funds (ETFs). Spotlight On Ethereum Spot ETFs While the United States Securities and Exchange Commission (SEC) is yet to disclose any latest update on the already filed applications of the spot Ethereum ETFs, asset manager Franklin Templeton has recently jumped on the spot ETH ETF queue. A recent post by James Seyffart, an experienced analyst at Bloomberg Intelligence, highlights that Franklin Templeton has joined the ranks as the eighth firm in the cryptocurrency sector to apply for product authorization. This follows submissions by other prominent asset managers for Ethereum ETFs, namely Hashdex, BlackRock, Fidelity, Ark and 21Shares, Grayscale, VanEck, Invesco, and Galaxy. Here’s the most recent table of other filers that I have pic.twitter.com/xCRRMwK76r — James Seyffart (@JSeyff) February 12, 2024 These developments come when Ethereum has sustained a positive momentum, closely tracking Bitcoin&#8217;s performance. The asset has witnessed more than 10% surge in the past week, maintaining this upward trend with an additional nearly 1% increase in the past 24 hours. Related Reading: Ethereum Price Rallies 5%, Why ETH Bulls Could Aim For $3K This Month This price performance has elevated Ethereum to a current trading value of $2,614 as of this writing. Featured image from Unsplash, Chart from Tradingview"
  }
]