[
  {
    "source": "CoinDesk",
    "date": "2023-08-04T19:48:52.000Z",
    "title": "Is It 2022 Again? Comedian Adam DeVine Appears in Strange Ad for Crypto Exchange Bitget",
    "url": "https://www.coindesk.com/web3/2023/08/04/is-it-2022-again-comedian-adam-devine-appears-in-strange-ad-for-crypto-exchange-bitget/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The “Workaholics” co-creator and star is the face of Bitget’s new #SetForChange campaign, which released a new “Crypto & Beach Houses” video to kick off the partnership."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-04T20:00:00.000Z",
    "title": "Crypto asset investment in Latvia declines by 50% over past year, per central bank",
    "url": "https://cointelegraph.com/news/crypto-asset-investment-declines-50-percent-latvia-over-past-year-central-bank",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/dcf4fdef-958d-42f5-ab92-04fd0a5c238b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to Latvijas Banka, 4% of the population bought crypto assets in February, down from 8% in 2022, while payments “continue to prevail.”</p>\n                    <p><p>The number of people buying crypto assets in Latvia is declining, Latvijas Banka said in its 2023 “Financial Stability Report.\"</p><p>The central bank <a href=\"https://datnes.latvijasbanka.lv/fsp/FSP_2023_EN.pdf\" target=\"_blank\" rel=\"noopener nofollow\">attributed</a> the falling interest in crypto to negative sentiment linked to fraud and insolvency among major market participants, “unwise” investments that have already been made, crypto’s links to money laundering and “the increasing link of crypto-asset companies to the supervised financial sector participants.” </p><p>Basing its findings on payment card usage, the bank said 4% of the population had bought crypto assets in February 2023, compared with 8% in 2022 overall. Latvia has a population of 1.84 million.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">&quot;The number of the people purchasing crypto-assets as well as making payments with payment cards to invest in crypto-assets in Latvia declines. <br><br>This can be explained by global developments such as the negative sentiment of investors, detected cases of fraud and cases of… <a href=\"https://t.co/uOIbJvIlsi\">pic.twitter.com/uOIbJvIlsi</a></p>&mdash; Joshua Rosenberg (@_jrosenberg) <a href=\"https://twitter.com/_jrosenberg/status/1687415212071096320?ref_src=twsrc%5Etfw\">August 4, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Latvians transferred 51.8 million euros ($57 million) to crypto wallets in 2022, with the pace slowing to 10.7 million euros ($11.8 million) in the first quarter of 2023. Most of those accounts were with companies in European countries “where the ecosystem of new financial technologies (including crypto technologies) is developing buoyantly,” such as Lithuania, Estonia, Malta and Ireland. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/the-state-of-crypto-in-northern-europe-hostile-scandinavia-and-vibrant-baltics\">The state of crypto in Northern Europe: Hostile Scandinavia and vibrant Baltics</a></em></strong></p><p>Latvia was ranked 92nd out of 148 countries by crypto adoption by Chainalysis in its \"2022 Geography of Cryptocurrency Report.\" Its neighbor Lithuania was ranked 102nd. The Latvian central bank noted that the country’s nonbank financial sector “is still considerably less important” than those in other European countries:</p><blockquote>“This is primarily due to the low level of long-term savings of the population: in Latvia they have accumulated over a shorter period of time compared to many other euro area countries.”</blockquote><p>Retail crypto payments “continue to prevail” over crypto asset investment in the country, the report said, although they are characteristically small. Forty-four percent of retail payments made using crypto were worth 60 euros ($66) or less, and 97.5% were for under 1,000 euros ($1,100). The report did not specify the monetary value of those transactions. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/powers-on-biden-blockchain-benefits-adoption/\">Powers On… Biden accepts blockchain technology, recognizes its benefits and pushes for adoption</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-04T19:46:00.000Z",
    "title": "XRP Market Cap Falls by Nearly $10 Billion as Hype Fades After Legal Victory",
    "url": "https://www.cryptoglobe.com/latest/2023/08/xrp-market-cap-falls-by-nearly-10-billion-as-hype-fades-after-legal-victory/",
    "description": "In the latest roller-coaster ride in the cryptocurrency market the native token of the XRP Ledger, $XRP, has seen its market capitalization drop by nearly $10 billion from its peak this year, which was seen shortly after a federal judge ruled the cryptocurrency isn’t necessarily a security. According to available market data, the market capitalization […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-04T20:00:00.000Z",
    "title": "Presidential Candidate Francis Suarez to Accept Donations in BTC",
    "url": "https://cryptodaily.co.uk/2023/08/presidential-candidate-francis-suarez-to-accept-donations-in-btc",
    "description": "<p>Miami Mayor Francis Suarez announced that he is officially accepting Bitcoin for his presidential campaign donations.</p>\nCrypto-Friendly Mayer from Miami&nbsp;\n<p>On Friday, August 4, Miami Mayer and Republican candidate for the 2024 Presidential Election, Francis Suarez, confirmed that his campaign would be accepting donations in Bitcoin. He clarified that his supporters can donate as little as 0.00034 BTC, equivalent to $1, at his website.</p>\n\n<p>\"Officially, my campaign is accepting Bitcoin,\" Suarez announced. \"This is a process of developing technologies that are going to create democratizing opportunities for wealth creation and are not manipulated by a human being's ulterior motives, political goals, etc.\"&nbsp;</p>\n\n<p>Suarez heavily criticized the Biden administration for its approach towards cryptocurrencies which involves regulation through enforcement, without understanding the mechanisms of digital assets or setting clear rules.</p>\n\n<p>\"The biggest mistake that this administration has made is they don't understand crypto so they have gone to a regulated-by-enforcement mechanism as opposed to set the ground rules,\" Suarez explained. \"You have to be able to classify certain digital products, you have to be able to have certain guidelines and rules that are clear with respect to the custody of assets.\"</p>\n\n<p>The candidate also declared that, if elected the President, he would ban the use of central bank digital currencies (CBDC):</p>\n\n<p>\"Nobody wants the federal government knowing where you have your money and how much money you have ... I don't think that there's anything particularly innovative about that.\"</p>\n\n<p>Francis Suarez announced his candidacy for the upcoming presidential race in June 2023. He argued that the country needs a president who understands how cryptocurrency and artificial intelligence (AI) technologies work.&nbsp;&nbsp;</p>\n<p>Miami Mayer has long been a supporter of Bitcoin and digital assets in general. He already launched his own cryptocurrency MiamiCoin (MIA) in 2021, and promised to make Miami a Bitcoin hub.</p>\nPresidential Candidates Against CBDC\n<p>Francis Suarez is not the only presidential hopeful who spoke out against CBDCs.&nbsp;</p>\n<p>The governor of Florida and presidential candidate for the Republican party, Ron DeSantis, criticized the Federal Reserve&rsquo;s new payments system, FedNow, and said that the Biden administration&rsquo;s efforts towards launching a CBDC are &ldquo;about surveillance and control&rdquo;.&nbsp;</p>\n<p>Both Ron DeSantis and another presidential hopeful of the Democratic party, Robert F. Kennedy Jr., implied they would not support the launch and use of a CBDC in the country. Robert F. Kennedy Jr. has recently confirmed the purchase of BTC for his children, even though he had earlier denied investment in the digital currency.</p>\n<p>Meanwhile, Bernie Sanders and Democratic Senators, including Elizabeth Warren, Bob Casey, and Richard Blumenthal, are urging the Biden administration to initiate a crackdown on &ldquo;crypto tax evaders&rdquo;.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T19:54:20.000Z",
    "title": "US and China reopen talks of friendship – The latest",
    "url": "https://www.cryptopolitan.com/us-and-china-reopen-talks-of-friendship/",
    "description": "A promising turn of events has come to light in the complicated relationship between the US and China. Both superpowers are forging new paths of communication to address some of the most contentious issues, marking a significant step towards stabilizing the relationship that has been strained for some time. Here&#8217;s a look at how this ... <a title=\"US and China reopen talks of friendship &#8211; The latest\" class=\"read-more\" href=\"https://www.cryptopolitan.com/us-and-china-reopen-talks-of-friendship/\" aria-label=\"More on US and China reopen talks of friendship &#8211; The latest\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T19:53:44.000Z",
    "title": "SEC freezes Digital Licensing’s assets over fraudulent activities",
    "url": "https://www.cryptopolitan.com/sec-freezes-digital-assets-fraud-activities/",
    "description": "The United States Securities and Exchange Commission (SEC) has taken swift action against Utah-based crypto company Digital Licensing Inc., placing a temporary asset freeze as part of an enforcement effort targeting an allegedly fraudulent crypto scheme amounting to $50 million. On August 3rd, the SEC unveiled a series of measures, including a temporary asset freeze ... <a title=\"SEC freezes Digital Licensing’s assets over fraudulent activities\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-freezes-digital-assets-fraud-activities/\" aria-label=\"More on SEC freezes Digital Licensing’s assets over fraudulent activities\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T19:41:44.000Z",
    "title": "OpenAI rolls out new ChatGPT update for smoother interaction",
    "url": "https://www.cryptopolitan.com/openai-chatgpt-update-smoother-interaction/",
    "description": "OpenAI, the pioneering force in artificial intelligence, is continuing its mission to refine and elevate its renowned AI chatbot, ChatGPT. The latest round of updates, though modest in scale, holds the promise of elevating conversations with the bot to new heights of seamlessness and productivity. In a recent announcement, OpenAI unveiled a set of enhancements ... <a title=\"OpenAI rolls out new ChatGPT update for smoother interaction\" class=\"read-more\" href=\"https://www.cryptopolitan.com/openai-chatgpt-update-smoother-interaction/\" aria-label=\"More on OpenAI rolls out new ChatGPT update for smoother interaction\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-04T20:00:31.000Z",
    "title": "Bitcoin NVT Shows Bearish Crossover, Price Drop Incoming?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-nvt-shows-bearish-crossover-price-drop-incoming/",
    "description": "On-chain data shows the Bitcoin Network Value To Transactions (NVT) ratio has formed a bearish crossover, a sign that a decline may be imminent. Bitcoin NVT Ratio Has Formed A Historical Bearish Crossover The &#8220;NVT ratio&#8221; is an indicator that measures the ratio between the Bitcoin market cap and transaction volume. In simple terms, what this metric tells us is whether the asset&#8217;s price (the market cap) is fairly valued compared to the network&#8217;s ability to transact coins (the transaction volume). When the ratio has a value above 1, it means that the price may be overinflated right now, as the blockchain isn&#8217;t observing the shift of any significant amount of capital. The risk of a correction taking place generally goes up the higher the metric trends above this mark. On the other hand, the indicator being below the threshold can imply that the market cap may be undervalued currently, and thus, a price surge may be due for the asset. In the context of the current discussion, the NVT ratio itself isn&#8217;t of interest, but rather a modified form called the &#8220;NVT golden cross&#8221; is. This metric compares the short-term moving average (MA) of the NVT ratio (10-day) to its long-term MA (30-day). As pointed out by an analyst in a CryptoQuant post, this NVT golden cross may be forming a pattern currently that could lead to a correction in the asset&#8217;s price. The below chart shows the trend in the Bitcoin NVT golden cross and the 30-day exponential moving average (EMA) of the same over the past year: The two metrics seem to have crossed each other in recent days &#124; Source: CryptoQuant As displayed in the above graph, the Bitcoin NVT golden cross has been going down recently and has just crossed under its 30-day EMA. This line appears to have historically been significant for the asset, as the instances marked by the analyst shows. Related Reading: Crypto Storm Brewing: Bitcoin Vortex Indicator Flashes Buy Alert Generally, whenever the indicator has crossed below this EMA line, the cryptocurrency&#8217;s value has taken a hit. From the chart, it&#8217;s visible that this pattern has already held up a few times during this rally so far. Naturally, if this historical precedence is anything to go by, then the current bearish crossover might also lead to Bitcoin registering a drawdown in the near future. It should be noted, though, that the crossover may not be fully confirmed yet, as the NVT golden cross has only slightly gone below the 30-day EMA so far. So it&#8217;s possible that the indicator could turn itself around in the coming days and cancel out the cross. Related Reading: Will Binance’s Zero-Fee Trading Help Bitcoin And Ethereum Prices It now remains to be seen, whether the Bitcoin NVT golden cross and the 30-day EMA would keep going in the same trajectories and solidify the cross, or if the pattern would retrace. BTC Price At the time of writing, Bitcoin is trading around $29,200, down 1% in the last week. BTC has continued to show stagnation recently &#124; Source: BTCUSD on TradingView Featured image from mana5280 on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-04T20:00:36.000Z",
    "title": "The Winning Crypto Triad in Master Traders’ 100x Playbook: Ethereum (ETH), Borroe ($ROE), and Chainlink (LINK)",
    "url": "https://www.crypto-news-flash.com/the-winning-crypto-triad-in-master-traders-100x-playbook-ethereum-eth-borroe-roe-and-chainlink-link/?utm_source=rss&utm_medium=rss&utm_campaign=the-winning-crypto-triad-in-master-traders-100x-playbook-ethereum-eth-borroe-roe-and-chainlink-link",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T105824.282.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T105824.282.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T105824.282-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T105824.282-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T105824.282-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-04T105824.282-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The cryptocurrency market has witnessed unprecedented growth and volatility, attracting both seasoned investors and newcomers seeking life-changing gains. As crypto enthusiasts search for the best crypto to invest in now, master traders have identified a powerful trio with the potential to outshine the rest.  Ethereum (ETH), Borroe ($ROE), and Chainlink (LINK) represent a dynamic combination [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-04T20:00:09.000Z",
    "title": "Customers at US bank say deposits are missing as angry reports spread on social media",
    "url": "https://dailyhodl.com/2023/08/04/customers-at-us-bank-say-deposits-are-missing-as-angry-reports-spread-on-social-media/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Fitch-Warns-US-Debt-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Fitch-Warns-US-Debt-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Fitch-Warns-US-Debt-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Fitch-Warns-US-Debt-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Fitch-Warns-US-Debt-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Fitch-Warns-US-Debt-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Fitch-Warns-US-Debt-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Customers at one of America&#8217;s largest banks are reporting missing deposits on social media. People who bank with Wells Fargo say their direct deposits are not showing up in their accounts. Reports began to spread across the social media platform X on Thursday as frustrated account holders tried to track down their money. ?-heart attack. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/04/customers-at-us-bank-say-deposits-are-missing-as-angry-reports-spread-on-social-media/\">Customers at US bank say deposits are missing as angry reports spread on social media</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-04T19:55:49.000Z",
    "title": "Pro-XRP Lawyer Says Federal Judge in Terra Case Who Rejected Favorable Ripple Ruling ‘Got It Wrong’",
    "url": "https://dailyhodl.com/2023/08/04/pro-xrp-lawyer-says-federal-judge-in-terra-case-who-rejected-favorable-ripple-ruling-got-it-wrong/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/11/ripple-partnership-cases.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/11/ripple-partnership-cases.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/11/ripple-partnership-cases.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/11/ripple-partnership-cases.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/11/ripple-partnership-cases.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/11/ripple-partnership-cases.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/11/ripple-partnership-cases.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Pro-XRP lawyer John Deaton says that a federal judge erred when rejecting a historic decision during his ruling in the Terra (LUNA) case. Deaton tells his 286,400 Twitter followers that the judge should have sided with Judge Analisa Torres&#8217; ruling that Ripple Lab’s automated, open market sales of XRP do not count as securities. A [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/04/pro-xrp-lawyer-says-federal-judge-in-terra-case-who-rejected-favorable-ripple-ruling-got-it-wrong/\">Pro-XRP Lawyer Says Federal Judge in Terra Case Who Rejected Favorable Ripple Ruling ‘Got It Wrong’</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-04T19:55:37.000Z",
    "title": "Ripple Is ‘Re-Engaging’ With the US Market After Partial Victory Over SEC in the XRP Lawsuit: Company President",
    "url": "https://dailyhodl.com/2023/08/04/ripple-is-re-engaging-with-the-us-market-after-partial-victory-over-sec-in-the-xrp-lawsuit-company-president/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/ripple-us-market-after.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/ripple-us-market-after.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/ripple-us-market-after.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/ripple-us-market-after.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/ripple-us-market-after.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/ripple-us-market-after.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/ripple-us-market-after.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Ripple President Monica Long says the recent outcome of the company&#8217;s legal battle with the U.S. Securities and Exchange Commission (SEC) has given the payment firm &#8220;clarity&#8221; on how it can operate its business in the future. The SEC first sued Ripple in late 2020 for allegedly selling XRP as an unregistered security. Last month, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/04/ripple-is-re-engaging-with-the-us-market-after-partial-victory-over-sec-in-the-xrp-lawsuit-company-president/\">Ripple Is ‘Re-Engaging’ With the US Market After Partial Victory Over SEC in the XRP Lawsuit: Company President</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]