[
  {
    "source": "CoinDesk",
    "date": "2023-05-30T13:21:56.000Z",
    "title": "Bitcoin Mining Difficulty’s Record Setting Streak Shows No Signs of Stopping",
    "url": "https://www.coindesk.com/tech/2023/05/30/bitcoin-mining-difficultys-record-setting-streak-shows-no-signs-of-stopping/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The difficulty of mining bitcoin is poised to set a new all-time high this week as miners continue to deploy new mining machines to cash in on recent spike in revenue."
  },
  {
    "source": "Decrypt",
    "date": "2023-05-30T13:30:02.000Z",
    "title": "KilroyPunk NFT Drop Mashes Up Iconic Meme With a CryptoPunk",
    "url": "https://decrypt.co/142778/kilroypunk-nft-drop-mashes-up-iconic-meme-cryptopunk",
    "description": "Holograph unveils a collab between artist Eric Elms and the pseudonymous foobar—a multichain, open edition KilroyPunk NFT that spans eras."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-05-30T13:30:00.000Z",
    "title": "Bitcoin is on a collision course with ‘Net Zero’ promises",
    "url": "https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/05/magazine-Bitcoin-collision-course-with-Net-Zeo-scaled.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Every year countries are pressured to ramp up their climate change commitments at the COP conference — and Bitcoin mining is an easy target.</p>\n                    <p><p><strong>Each year at the annual UN Climate Change Conference (COP), individual countries are pressured to ramp up their emissions reductions promises and showcase evidence they are taking steps to meet them.</strong></p><p>With Bitcoin mining blamed for using as much power as an entire country, and politicians searching for easy targets to strike, the industry appears to be on a collision course with these global commitments to achieve net-zero emissions.</p><p>While it’s not possible to ban Bitcoin completely, lawmakers and regulators can tank the price and make life very difficult in the years ahead for the number one cryptocurrency.</p><p>There are signs its already happening.<br><br>A <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/ip_22_6228\" target=\"_blank\" rel=\"nofollow\" >report from the European Commission</a> at the end of 2022 stated that EU countries must be ready to block crypto mining, and the trading blocks new MiCA rules were at one stage set to include a ban on Bitcoin mining. The recently adopted legislation still leaves this door ajar, however, aiming to reduce the high carbon footprint of crypto-currencies by making service providers disclose their energy consumption.</p><p>Across the pond, the Biden administration has proposed a 30% excise tax on the power consumption of U.S. cryptocurrency mining operations. The tax would be imposed regardless of whether the power is renewable, with the administration arguing Bitcoin minings power consumption of renewable energy will slow down the transition to Net Zero. Thats in contrast to a New York moratorium on Bitcoin mining in 2022 that exempted firms powered by renewable energy.<br></p><section class=\"adv-banner adbutler-ad adbutler-ad__desktop\"><div class=\"container\"><!-- 1456x180 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><section class=\"adv-banner adbutler-ad adbutler-ad__mobile\"><div class=\"container\"><!-- 600x500 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><p>The U.S. government appears to be taking to heart the White House Office of Science and Technology Policys September 2022 report that claimed the environmental impact of producing cryptocurrencies could impede U.S. efforts to combat climate change.<br><br>Former member of the Bitcoin Mining Council and independent researcher Hass McCook doesnt mince his words about threats to ban mining.</p><blockquote class=\"wp-block-quote\"><p>Governments should focus on greening their grids, which miners rely upon, as opposed to trying to ban an unbannable technology.</p></blockquote><p>The Swedish government was behind last years push to outlaw crypto mining in the EU and, last month, took steps to price Bitcoin miners out of the market by abolishing various tax incentives. Starting in July, Sweden will increase the electricity tax by 6,000% from 0.006 Swedish kronas ($0.0006) to an extraordinary 0.36 kronas ($0.035) per kilowatt-hour (kWh).<br><br>Governments around the world are actively looking at Bitcoin minings energy consumption, explains Brad van Voorhees, co-founder and CEO of Sustainable Bitcoin Protocol, which incentivizes the use of renewables for mining.</p><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/05/Skull-of-Satoshi.jpg\" alt=\"Skull\" class=\"wp-image-20132\" width=\"494\" height=\"330\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/05/Skull-of-Satoshi.jpg 963w, https://cointelegraph.com/magazine/wp-content/uploads/2023/05/Skull-of-Satoshi-300x200.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/05/Skull-of-Satoshi-770x514.jpg 770w\" sizes=\"(max-width: 494px) 100vw, 494px\" /><figcaption class=\"wp-element-caption\"><em>Artist Benjamin Von Wong created The Skull of Satoshi sculpture. He says hes not anti-Bitcoin, he just wants to lower emissions. (VanWong)</em></figcaption></figure><p>Sweden has already imposed a 6,000% tax on energy for BTC mining, and the Biden administration has proposed a 30% tax, which would undoubtedly mean miners move offshore, he adds.<br><br>The tax will likely never pass in the U.S., but nonetheless, the sector should focus on clean energy use and data transparency to mitigate this risk.<br><br>Others agree with van Voorhees that Net Zero is an opportunity to set Bitcoin mining on a new and more sustainable path. Morten Rngaard is a member of the Nordic Blockchain Association and CEO of Reality+, a Web3 and blockchain company.<br><br>The collision between Bitcoin and Net-Zero commitments is a call to action. Its an opportunity to harness the power of innovation and renewable energy, steering both towards a greener and more inclusive landscape, he says.</p><h2 id=\"h-good-cop-bad-cop\"><strong>Good cop, bad cop</strong></h2><p>The focus on Bitcoin mining power usage was given additional impetus after Ethereum moved to proof-of-stake last year and saved 99.95% of its energy consumption as a result. While Bitcoiners believe PoS stands for piece of shit, the success of the blockchains energy transformation has made Bitcoin look like it is stuck in a corner using anachronistic tech.</p><p>There are now groups demanding changes to Bitcoins underlying protocol as well.</p><figure class=\"wp-block-image aligncenter size-large is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/05/Change-the-code-1024x1024.jpg\" alt=\"Change the Code\" class=\"wp-image-20139\" width=\"494\" height=\"494\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/05/Change-the-code-1024x1024.jpg 1024w, https://cointelegraph.com/magazine/wp-content/uploads/2023/05/Change-the-code-300x300.jpg 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/05/Change-the-code-100x100.jpg 100w, https://cointelegraph.com/magazine/wp-content/uploads/2023/05/Change-the-code-770x770.jpg 770w, https://cointelegraph.com/magazine/wp-content/uploads/2023/05/Change-the-code.jpg 1080w\" sizes=\"(max-width: 494px) 100vw, 494px\" /><figcaption class=\"wp-element-caption\"><em>The Change the Code lobby group is using the Merge to lobby for changes to Bitcoin. (Change The Code)</em></figcaption></figure><p>Greenpeaces <a href=\"https://cleanupbitcoin.com\" target=\"_blank\" rel=\"nofollow\" >Change the Code</a> Not the Climate (Clean Up Bitcoin) lobby group is pushing to change Bitcoins consensus mechanism from proof-of-work, to proof-of-stake.</p><blockquote class=\"wp-block-quote\"><p>We know a basic software code change would reduce Bitcoins energy use by 99.9%. If only 30 people  the key miners, exchanges, and core developers who build and contribute to Bitcoins code  agreed to reinvent proof-of-work mining or move to a low-energy protocol, Bitcoin would stop polluting the planet. So why isnt Bitcoin changing its code?</p></blockquote><p>This is misinformation, however, given the Bitcoin community needs to agree on a change, rather than a small group of just 30 people. The Bitcoin community split over the much smaller change of increasing the block size in 2017, leading to the Bitcoin Cash and Bitcoin SV forks, so the chances of an agreement to change the fundamental nature of the technology are hard to envisage at this point.</p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/reformed-altcoin-slayer-eric-wall-shitposting-scaling-ethereum/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Reformed altcoin slayer Eric Wall on shitposting and scaling Ethereum</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/all-rise-for-robot-judge-ai-blockchain-transform-courtroom/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>All rise for the robot judge: AI and blockchain could transform the courtroom</p>                        </a>                    </div></div></div><p>The industrys big hope to date has been that progressively moving away from fossil fuels to rely more on sustainable and renewable power, such as wind, solar and hydroelectric power, will placate governments.<br><br>But as the Swedish and U.S. governments have said, that may not be enough. For governments and regulators trying to comply with their international climate change commitments, there will be a bunch of hard decisions to be made. Even a mining industry 100% powered by renewable energy could be a target, as that emissions-free energy could be freed up at the stroke of a pen to help a more politically valuable industry, like manufacturing, meet emissions targets.</p><h2 id=\"h-how-much-power-does-bitcoin-use\"><strong>How much power does Bitcoin use?</strong></h2><figure class=\"wp-block-image alignleft size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/05/pexels-pixabay-221012.jpg\" alt=\"Power stations\" class=\"wp-image-20134\" width=\"466\" height=\"311\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/05/pexels-pixabay-221012.jpg 640w, https://cointelegraph.com/magazine/wp-content/uploads/2023/05/pexels-pixabay-221012-300x200.jpg 300w\" sizes=\"(max-width: 466px) 100vw, 466px\" /><figcaption class=\"wp-element-caption\"><em>Its probably just water vapor. (Pexels)</em></figcaption></figure><p>The <a href=\"https://ccaf.io/cbeci/index\" target=\"_blank\" rel=\"nofollow\" >Cambridge Bitcoin electricity consumption</a> site estimates Bitcoin network power demand and is updated every 24 hours and works with all major actors to cut down on carbon emissions. It conducts experiments to evaluate Bitcoins environmental footprint assuming the worst-case scenario.<br><br>By using the latest annual power consumption estimates of 143.63 TWh and, assuming that all this energy comes exclusively from coal, and is generated in an inefficient coal-fired power plant, the Bitcoin footprint would be 11 million metric tons of carbon dioxide emissions. Thats around 0.35% of the worlds total annual emissions.</p><p>Bitcoiners point out that the network uses less power than the banking system (200 TWh) and a majority of the power used by the industry is renewable. They also claim mining can incentivize renewable electricity generation and make marginal green power projects viable.</p><p>But even taking these factors into account, <a href=\"https://cointelegraph.com/magazine/north-american-crypto-miners-prepare-to-challenge-chinas-dominance/\" target=\"_blank\" rel=\"nofollow\" >mining</a> still uses a ton of power, to which Bitcoiners argue that its energy well-spent <a href=\"https://cointelegraph.com/magazine/intro-bitcoin-change-your-life/\" target=\"_blank\" rel=\"nofollow\" >securing the hardest and best money known to humanity.</a></p><blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\">If you are anti-<a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >#Bitcoin</a> mining you have positioned yourself against one of the world’s best technologies for advancing electrification and carbon free energy. </p><p>There is no technology available and ready today that can push us towards the future better than <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >#Bitcoin</a> mining.</p><p> Dennis Porter (@Dennis_Porter_) <a href=\"https://twitter.com/Dennis_Porter_/status/1656889233867673605?ref_src=twsrc%5Etfw\" target=\"_blank\" rel=\"nofollow\" >May 12, 2023</a></p></blockquote><p>But non-Bitcoiners tend to look at the power use of the alternatives. The site estimates that Ethereum is using around 6.76 GWh per year. In other words, Bitcoin is using 21,000 times more power per year.</p><p>According to the <a href=\"https://carbon-ratings.com/\" target=\"_blank\" rel=\"nofollow\" >Crypto Carbon Ratings Institute</a>, before its transition to proof-of-stake, a single Ethereum transaction used 200.05 kWh of electricity, on par with how much the average U.S. household uses in 6.7 days.<br><br>According to <a href=\"https://consensys.net/blog/press-release/ethereum-blockchain-eliminates-99-99-of-its-carbon-footprint-overnight-after-a-successful-merge-according-to-new-report/\" target=\"_blank\" rel=\"nofollow\" >Digiconomist</a>, that consumption is now as low as 0.03 kWh, and the carbon footprint stands at 0.01 kgCO2, which is equivalent to the energy used when watching two hours of YouTube.<br><br>(Please dont email us to point out that the network uses the same amount of power regardless of the number of transactions  we know, its just illustrative).<br><br>Digiconomists <a href=\"https://digiconomist.net/ethereum-energy-consumption\" target=\"_blank\" rel=\"nofollow\" >Ethereum Energy Consumption Index</a> highlights just how radically different PoW power consumption is to PoS.</p><figure class=\"wp-block-image aligncenter size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/05/ethereum1.png\" alt=\"Ethereum Energy Consumption Index\" class=\"wp-image-20189\" width=\"745\" height=\"444\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/05/ethereum1.png 1004w, https://cointelegraph.com/magazine/wp-content/uploads/2023/05/ethereum1-300x179.png 300w, https://cointelegraph.com/magazine/wp-content/uploads/2023/05/ethereum1-770x459.png 770w\" sizes=\"(max-width: 745px) 100vw, 745px\" /><figcaption class=\"wp-element-caption\"><em>Ethereums energy consumption plummeted after it moved to proof-of-stake in 2022.</em></figcaption></figure><p>U.K.-based<a href=\"https://www.blockdojo.io\" target=\"_blank\" rel=\"nofollow\" > Block Dojo</a> describes itself as the largest Bitcoin blockchain incubator in the world, but in fact, its based on the Bitcoin fork Bitcoin SV. It claims to be responsible for 24% of all blockchain investments in the United Kingdom. Chairman James Marchant says the energy use of Bitcoin is an opportunity for other blockchains like Bitcoin SV. </p><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/05/pexels-leeloo-thefirst-8358047-1.jpg\" alt=\"\" class=\"wp-image-20140\" width=\"409\" height=\"273\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/05/pexels-leeloo-thefirst-8358047-1.jpg 640w, https://cointelegraph.com/magazine/wp-content/uploads/2023/05/pexels-leeloo-thefirst-8358047-1-300x200.jpg 300w\" sizes=\"(max-width: 409px) 100vw, 409px\" /></figure><p>The total energy use versus the number of transactions BTC can process per day is catastrophic. BTC does not implement the protocol as per the Satoshi white paper. We are seeing developers and entrepreneurs turning to a scalable blockchain solution away from BTC, and Net-Zero objectives is one of several key reasons for this, he says.</p><h2 id=\"h-movement-for-change\"><strong>Movement for change</strong></h2><p>The people driving the crypto industry forward are likely to be the younger demographic, Generation Z, which is increasingly sensitive to climate change concerns.</p><p>But the industry is not hiding its head in the sand, with bodies like the <a href=\"https://bitcoinminingcouncil.com\" target=\"_blank\" rel=\"nofollow\" >Bitcoin Mining Council</a> attempting to address such concerns.</p><p>Welcoming Bitcoin miners of all shapes and sizes  it accounts for about half the worlds miners now  the Council is a voluntary forum that shares best practices and educates the public on mining. </p><figure class=\"wp-block-image alignleft size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/05/Bitcoin-mining-council.jpg\" alt=\"BMC\" class=\"wp-image-20131\" width=\"337\" height=\"424\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/05/Bitcoin-mining-council.jpg 560w, https://cointelegraph.com/magazine/wp-content/uploads/2023/05/Bitcoin-mining-council-238x300.jpg 238w\" sizes=\"(max-width: 337px) 100vw, 337px\" /><figcaption class=\"wp-element-caption\"><em>The Bitcoin Mining Council is led by Michael Saylor (BMC)</em></figcaption></figure><p>Its most famous, and first, member is MicroStrategy boss Michael Saylor, who arranged the first meeting of the Council and is a strong adherent for managing miners energy use and employing <a href=\"https://cointelegraph.com/magazine/despite-a-bad-rap-nfts-can-be-a-force-for-good/\" target=\"_blank\" rel=\"nofollow\" >sustainable alternatives</a>.</p><p>Its latest quarterly report (based on self-reports from a survey and then estimated across the remainder of the industry) <a href=\"https://bitcoinminingcouncil.com/bitcoin-mining-council-survey-confirms-year-on-year-improvements-in-sustainable-power-mix-and-technological-efficiency-in-q4-2022/\" target=\"_blank\" rel=\"nofollow\" >suggests </a>miners are currently using a 58.9% sustainable energy mix. </p><p><a href=\"https://cointelegraph.com/magazine/blockchain-projects-making-renewable-energy-reality/\" target=\"_blank\" rel=\"nofollow\" >Renewable energy can potentially mitigate</a> Bitcoins environmental impact. There are many examples of mining facilities now powered by solar, wind or hydroelectric energy or using stranded energy or mining using flared gas that would otherwise be wasted. If the renewable energy lobbys claim that green power is the cheapest form of electricity, then miners will inevitably use more of it, explains McCook. Bitcoin mining is a perfectly competitive industry. This means players will do <em>anything</em> to maximize profit. <em>Anything</em>. This means they chase the cheapest possible electricity available. This is increasingly becoming renewable, he says.</p><p>Darren Franceschini, co-founder of Fideum Group  a Singapore-based crypto funding company  agrees the industry is embracing wind and solar as much for economic reasons as anything else.<br><br>With fossil fuel prices soaring, miners are economically driven to achieve Net-Zero emissions, he says. Carbon pricing mechanisms and green energy subsidies could further promote the adoption of renewable energy sources within the mining sector.</p><h2 id=\"h-will-regulators-believe-bitcoin-can-incentivize-renewables\"><strong>Will regulators believe Bitcoin can incentivize renewables?</strong></h2><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/05/pexels-markus-spiske-2990650.jpg\" alt=\"Planet B\" class=\"wp-image-20135\" width=\"477\" height=\"318\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/05/pexels-markus-spiske-2990650.jpg 640w, https://cointelegraph.com/magazine/wp-content/uploads/2023/05/pexels-markus-spiske-2990650-300x200.jpg 300w\" sizes=\"(max-width: 477px) 100vw, 477px\" /><figcaption class=\"wp-element-caption\"><em>There is a PlanB, however. (Pexels)</em></figcaption></figure><p>Bitcoin advocates like Nic Carter argue that mining can play a role in growing the sustainable energy sector by using excess electricity capacity for energy efficiency or helping to finance renewable projects.</p><p>The need for electricity in the creation of Bitcoin is obviously a concern. At the same time, it is one of the best-use cases for excess electricity capacity vital in the renewables sector, says Toby Lewis, co-founder of Ordinals Bot. With the right incentives, Bitcoin can become a financing mechanism for the renewable grid.</p><p>The question is not whether or not this argument is correct  and its a source of contention even in the crypto community  its whether governments and regulators can be convinced it is.</p><p>It will be a hard sell to convince lawmakers, but Josef Ttek, a Bitcoin analyst at hardware wallet provider Trezor, argues that Bitcoin mining is a net positive for climate change.</p><p>Contrary to some claims, Bitcoin mining is beneficial for the environment and bootstraps renewable energy generation, he says, noting mining pops up wherever theres cheap renewable power.</p><blockquote class=\"wp-block-quote\"><p>For example, just recently, we have learned that the kingdom of Bhutan <a href=\"https://cointelegraph.com/news/bhutan-bitcoin-mining-with-hydropower-since-btc-price-was-5-000\" target=\"_blank\" rel=\"nofollow\" >has been mining</a> Bitcoin with its hydroelectric stations for years.</p></blockquote><p>It will be interesting to see whether the result of a clampdown on mining by bigger countries will see mining nomads shift operations to crypto-friendly countries that provide sustainable power like Bhutan.</p><p>The small hermit kingdom in the Himalayas is watered by glaciers in the mountains. It has huge stores of hydroelectricity, providing 30% of the countrys GDP and literally fuelling the homes of nearly all of its 800,000 residents. According to <a href=\"https://www.forbes.com/sites/iainmartin/2023/04/30/bhutan-bitcoin-mining-crypto/?sh&sh=4af8aa901f1b\" target=\"_blank\" rel=\"nofollow\" >Forbes</a><em>, </em>the country is following the example of El Salvador by becoming one of two countries to run a state-owned mining operation.</p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/sexual-violence-india-blockchain/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Sexual Violence in India: Blockchains Role in Empowering Survivors</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/programmable-money-crypto-tokens/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>Programmable money: How crypto tokens could change our entire experience of value transfer</p>                        </a>                    </div></div></div><p>Nick Jones, CEO of Zumo  a crypto-as-a-service platform  believes that crypto is well-placed to quickly reduce emissions.</p><p>All sectors need to rapidly decarbonize, and crypto has an opportunity to do this more quickly than most. Bitcoins carbon footprint is due almost entirely to electricity consumption, and we have the technology to rapidly decarbonize. Significant progress has been made, but there is still much to do, he says.</p><h2 id=\"h-surging-demand-for-bitcoin\"><strong>Surging demand for Bitcoin</strong></h2><p>The unexpected recent addition of NFTs and tokens to Bitcoin via Ordinals has created a huge wave of additional demand for the blockchain. Last month, the daily record for inscriptions using Bitcoin Ordinals was broken four times as users flooded the network with images, games and other content.</p><p>Daniel Santos, co-founder of Gamepay, argues that Ordinals is the first successful protocol built on Bitcoin and will result in more adoption, which in turn will mean more mining and more power to be generated.</p><p>Governments will step in and regulate mining for sure, especially as Ordinals take hold. There will also be a drive for green energy, even if a lot of Bitcoin mining is done with green energy, he says.</p><blockquote class=\"wp-block-quote\"><p>I suspect governments will require miners to have licenses to mine.</p></blockquote><p>Ordinals could be the proverbial straw that breaks the camels back for Bitcoin and its energy consumption. Moreover, as the crypto winner begins to thaw, the demand for the currency is also expected to surge as the currencys price climbs.</p><p>This is an issue that will run for years to come. Prepare for demonstrations against Bitcoin and more proposals to ban either the protocol or mining.</p><p>While Bitcoin is unbannable, there is a need to address emissions and to be on the front foot in the public debate. Whether change comes from within the industry or via external intervention is a question the crypto community needs to urgently address.</p><div class=\"subscribe subscribe--inner\"><div class=\"container\"><div class=\"subscribe__inner\"><div class=\"subscribe__content\">    <div class=\"subscribe__title display2\">Subscribe</div>    <div class=\"subscribe__desc text-l\">The most engaging reads in blockchain. Delivered once a        week.</div>        <div class=\"wpcf7 no-js\" id=\"wpcf7-f13672-o1\" lang=\"en-US\" dir=\"ltr\"><div class=\"screen-reader-response\"><p role=\"status\" aria-live=\"polite\" aria-atomic=\"true\"></p> <ul></ul></div><form action=\"/magazine/wp-json/wp/v2/posts?_embed&per_page=100#wpcf7-f13672-o1\" method=\"post\" class=\"wpcf7-form init subscribe__form demo\" aria-label=\"Contact form\" novalidate=\"novalidate\" data-status=\"init\"><div style=\"display: none;\"><input type=\"hidden\" name=\"_wpcf7\" value=\"13672\" /><input type=\"hidden\" name=\"_wpcf7_version\" value=\"5.7.4\" /><input type=\"hidden\" name=\"_wpcf7_locale\" value=\"en_US\" /><input type=\"hidden\" name=\"_wpcf7_unit_tag\" value=\"wpcf7-f13672-o1\" /><input type=\"hidden\" name=\"_wpcf7_container_post\" value=\"0\" /><input type=\"hidden\" name=\"_wpcf7_posted_data_hash\" value=\"\" /></div><fieldset class=\"form-group\"><p><input size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-email wpcf7-validates-as-required wpcf7-validates-as-email\" id=\"footer-subscribe\" aria-required=\"true\" aria-invalid=\"false\" value=\"\" type=\"email\" name=\"your-email\" /><label for=\"footer-subscribe\">Email address</label></p></fieldset><p><button class=\"subscribe__btn btn btn-white\">SUBSCRIBE</button></p><div class=\"wpcf7-response-output\" aria-hidden=\"true\"></div></form></div></div><div class=\"subscribe__img\">    <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2022/10/reading-copy.png\" alt=\"Subscribe to Magazine by Cointelegraph Newsletter.\" /></div></div></div></div></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-30T13:31:09.000Z",
    "title": "Nvidia hits $1T market cap as market opens",
    "url": "https://cryptoslate.com/insights/nvidia-hits-1t-market-cap-as-market-opens/",
    "description": "<p>Quick Take Nvidia is up 183% year-to-date and hit a $1 trillion market cap today as the market opened, with a share price of $406. Before the market opened, Nvidia&#8217;s market cap was at $963 billion, already ranking the company&#8217;s stock among the world&#8217;s top ten assets by market cap. Bitcoin is currently in twelfth [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/nvidia-hits-1t-market-cap-as-market-opens/\">Nvidia hits $1T market cap as market opens</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-30T13:22:21.000Z",
    "title": "Tether expands into Bitcoin mining",
    "url": "https://cryptoslate.com/tether-expands-into-bitcoin-mining/",
    "description": "<p>Stablecoin issuer Tether has expanded its operations into Bitcoin (BTC) mining, according to a May 30 press statement shared with CryptoSlate. Tether announced it has invested resources into energy production and has partnered with an unnamed local licensed company to launch a sustainable Bitcoin mining operation in Uruguay. The stablecoin issuer stated: &#8220;Tether is investing [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/tether-expands-into-bitcoin-mining/\">Tether expands into Bitcoin mining</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-05-30T13:30:00.000Z",
    "title": "Bitcoin is on a collision course with ‘Net Zero’ promises",
    "url": "https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/05/magazine-Bitcoin-collision-course-with-Net-Zeo-scaled.jpg\"></p><p>Every year countries are pressured to ramp up their climate change commitments at the COP conference — and Bitcoin mining is an easy target.</p>\n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-05-30T13:30:00.000Z",
    "title": "Unmasking DegenWin Casino: Enter the Realm of Legitimacy and Fortune! ",
    "url": "https://cryptodaily.co.uk/2023/05/unmasking-degenwin-casino-enter-the-realm-of-legitimacy-and-fortune",
    "description": "<p>Introduction</p>\n<p>Online gambling has experienced a surge in popularity in recent years, with numerous casinos offering players an exciting and entertaining experience. One such casino is DegenWin, which has captured the attention of many gambling enthusiasts with its wide array of games and attractive bonuses. However, the question remains: Is DegenWin Casino a legitimate platform or a scam? In this article, we will delve into the various aspects of DegenWin Casino to help you determine its trustworthiness and reliability.</p>\n<p>&nbsp;</p>\n<p>Licensing and Regulation</p>\n<p>One of the primary factors to consider when assessing the legitimacy of an online casino is its licensing and regulation. DegenWin Casino operates under a valid gambling license issued by a reputable regulatory authority. This license ensures that the casino adheres to strict guidelines and regulations, providing players with a safe and fair gaming environment. The transparency in licensing demonstrates DegenWin's commitment to maintaining high standards in the industry.</p>\n<p>&nbsp;</p>\n<p>Security Measures</p>\n<p>Another crucial aspect of a legitimate online casino is its commitment to player security. DegenWin Casino employs state-of-the-art encryption technology to safeguard players' personal and financial information. This ensures that all sensitive data transmitted between the player and the casino remains confidential and protected from unauthorized access. Additionally, the use of secure payment methods further enhances the overall security measures implemented by DegenWin.</p>\n<p>Game Selection and Fairness</p>\n<p>DegenWin Casino boasts an extensive collection of games, ranging from classic table games to modern slot machines, ensuring there is something for every type of player. The games are developed by reputable software providers known for their fairness and quality. Moreover, DegenWin employs random number generator (RNG) technology to ensure that the outcomes of their games are completely random and unbiased. This guarantees a fair gaming experience for all players.</p>\n<p>&nbsp;</p>\n<p>Bonuses and Promotions</p>\n<p>A legitimate casino like DegenWin offers enticing bonuses and promotions to attract and reward its players. These bonuses come with clear terms and conditions, and the casino ensures transparency in their implementation. It is essential to review the bonus policies and wagering requirements to fully understand the benefits and limitations associated with them. DegenWin strives to provide a fair and enjoyable bonus system, enhancing the overall player experience.</p>\n<p>Customer Support</p>\n<p>Reliable customer support is a crucial aspect of any reputable online casino. DegenWin Casino offers a dedicated support team that is available 24/7 to assist players with any inquiries or concerns. The support staff is responsive, knowledgeable, and can be reached via multiple communication channels, including live chat, email, and telephone. Prompt and efficient customer support reflects the casino's commitment to providing a satisfactory experience for its players.</p>\n<p>Conclusion</p>\n<p>Based on our analysis of the various aspects discussed above, it can be concluded that DegenWin Casino is a legitimate and trustworthy platform for online gambling. With its valid gambling license, stringent security measures, diverse game selection, fair gaming practices, attractive bonuses, and reliable customer support, DegenWin aims to provide a safe and enjoyable gaming experience for its players. However, it is always recommended for players to conduct their own research and exercise responsible gambling practices.</p>\n<p>Website:</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n<p>&nbsp;</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-30T13:15:39.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Back Above $28,000, as ‘Death Cross’ Approaches",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-back-above-28000-as-death-cross-approaches/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2262064431-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2262064431-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2262064431-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2262064431-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2262064431-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2262064431-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2262064431-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/shutterstock_2262064431.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin was once again trading above $28,000 on Tuesday, as the 10-day and 25-day moving averages neared a death cross. The two trend lines have moved closer to one another, with an upwards bullish crossover somewhat imminent. Ethereum was also marginally higher today. Bitcoin Bitcoin (BTC) jumped back above $28,000 on Tuesday, with a possible [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-30T13:26:17.000Z",
    "title": "Binance appoints former Singapore exec as head of regional markets",
    "url": "https://crypto.news/binance-appoints-former-singapore-exec-as-head-of-regional-markets/",
    "description": "Binance, the world's largest cryptocurrency exchange, appoints Richard Teng to lead regional markets outside the US, showcasing its rapid expansion and focus on regulatory compliance. "
  },
  {
    "source": "BTCManager",
    "date": "2023-05-30T13:10:50.000Z",
    "title": "KuCoin allegedly burned millions in ETH in 2022",
    "url": "https://crypto.news/kucoin-allegedly-burned-millions-in-eth-in-2022/",
    "description": "KuCoin's accidental burning of millions of dollars' worth of ethereum (ETH) leaves the cryptocurrency community perplexed. The mysterious incident came to light just recently after going un noticed."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-30T13:36:44.000Z",
    "title": "Shiba Inu: HEEL Unleashes Innovative Staking – Can it Drive SHIB Price to $0.0001? Report",
    "url": "https://www.crypto-news-flash.com/shiba-inu-heel-unleashes-innovative-staking-can-it-drive-shib-price-to-0-0001-report/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-heel-unleashes-innovative-staking-can-it-drive-shib-price-to-0-0001-report",
    "description": "<p>The HEEL ecosystem plans to unveil an NFT collection and migrate a liquidity pool to Shibarium from Ethereum.  Shiba Inu currently has a market cap of about $5.2 billion, but nearly $75 billion is needed to push the price to $0.0001. The Shiba Inu (SHIB) ecosystem continues to innovatively develop rails much needed for the [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/shiba-inu-heel-unleashes-innovative-staking-can-it-drive-shib-price-to-0-0001-report/\">Shiba Inu: HEEL Unleashes Innovative Staking &#8211; Can it Drive SHIB Price to $0.0001? Report</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-30T13:30:00.000Z",
    "title": "PEPE Hits 7-Day Low as Bears Rule: Oversold Conditions Signal Recovery",
    "url": "https://coinedition.com/pepe-hits-7-day-low-as-bears-rule-oversold-conditions-signal-recovery/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/PEPE_Hits_7_Day_Low_as_Bears_Dominate_Oversold_Conditions_Signal-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"PEPE\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/PEPE_Hits_7_Day_Low_as_Bears_Dominate_Oversold_Conditions_Signal-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/PEPE_Hits_7_Day_Low_as_Bears_Dominate_Oversold_Conditions_Signal-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/PEPE_Hits_7_Day_Low_as_Bears_Dominate_Oversold_Conditions_Signal-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/PEPE_Hits_7_Day_Low_as_Bears_Dominate_Oversold_Conditions_Signal-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/PEPE_Hits_7_Day_Low_as_Bears_Dominate_Oversold_Conditions_Signal-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/PEPE_Hits_7_Day_Low_as_Bears_Dominate_Oversold_Conditions_Signal.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Bears have taken control of the Pepe (PEPE) market in the last 24 hours, with prices sliding from an intra-day high of $0.000001463 to a 7-day low of $0.000001357. As of press time, the bearish effect was still in action, resulting in a 6.07% drop from its previous closing to $0.000001363. During the bear reign, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/pepe-hits-7-day-low-as-bears-rule-oversold-conditions-signal-recovery/\">PEPE Hits 7-Day Low as Bears Rule: Oversold Conditions Signal Recovery</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-30T13:10:00.000Z",
    "title": "Bloomberg Analyst Says Defeating SEC May Not Guarantee GBTC ETF",
    "url": "https://coinedition.com/bloomberg-analyst-says-defeating-sec-may-not-guarantee-gbtc-etf/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/05/Bloomberg_Analyst_Says_Defeating_SEC_May_Not_Guarantee_GBTC_ETF-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/Bloomberg_Analyst_Says_Defeating_SEC_May_Not_Guarantee_GBTC_ETF-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/Bloomberg_Analyst_Says_Defeating_SEC_May_Not_Guarantee_GBTC_ETF-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/Bloomberg_Analyst_Says_Defeating_SEC_May_Not_Guarantee_GBTC_ETF-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/Bloomberg_Analyst_Says_Defeating_SEC_May_Not_Guarantee_GBTC_ETF-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/Bloomberg_Analyst_Says_Defeating_SEC_May_Not_Guarantee_GBTC_ETF-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/05/Bloomberg_Analyst_Says_Defeating_SEC_May_Not_Guarantee_GBTC_ETF.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>James Seyffart, an ETF Research Analyst for Bloomberg Intelligence, believes that a victory for Grayscale Investments in its ongoing lawsuit against the U.S. Securities and Exchange Commission (SEC) may not necessarily allow the firm to start issuing spot Bitcoin exchange-traded funds (ETF) after converting existing Grayscale Bitcoin Trust (GBTC) shares. Seyffart recently appeared in a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bloomberg-analyst-says-defeating-sec-may-not-guarantee-gbtc-etf/\">Bloomberg Analyst Says Defeating SEC May Not Guarantee GBTC ETF</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]