[
  {
    "source": "CoinDesk",
    "date": "2023-06-23T21:56:40.000Z",
    "title": "Coinbase Loses Market Share in Ether Staking as Regulatory Pressure Mounts",
    "url": "https://www.coindesk.com/markets/2023/06/23/coinbase-loses-market-share-in-ether-staking-as-regulatory-pressure-mounts/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The exchange’s share in ETH staking dropped to 9.7%, the lowest since May 2021, as the SEC sued Coinbase for offering unregistered securities this month."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-23T21:52:37.000Z",
    "title": "ECB official labels crypto as 'deleterious' with 'no societal benefits' in scathing speech",
    "url": "https://cointelegraph.com/news/ecb-official-crypto-deleterious-no-societal-benefits-scathing-speech",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/135144c8-529b-46c4-83d4-d90e8a6646c4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to Fabio Panetta, the volatility of crypto and aspects of blockchain technology made digital assets only suitable for gambling.</p>\n                    <p><p>Fabio Panetta, an executive board member of the European Central Bank (ECB), has suggested a dark future for cryptocurrencies, in which the digital assets may be used for little more than gambling among investors.</p><p>In written remarks for a panel at the Bank for International Settlements Annual Conference on June 23, Panetta <a href=\"https://www.ecb.europa.eu/press/key/date/2023/html/ecb.sp230623_1~80751450e6.en.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a> crypto’s perception among investors as a “robust store of value” began to dissipate in late 2021 and into 2022, when the total market capitalization <a href=\"https://cointelegraph.com/news/bitcoin-nears-23-8k-may-low-as-crypto-market-cap-drops-under-1-trillion\">fell by more</a> than $1 trillion. According to the ECB official, the “highly volatile” nature of crypto assets made them suitable for gambling, and should be treated as such by global lawmakers.</p><p>“Due to their limitations, cryptos have not developed into a form of finance that is innovative and robust, but have instead morphed into one that is deleterious,” said Panetta. “The crypto ecosystem is riddled with market failures and negative externalities, and it is bound to experience further market disruptions unless proper regulatory safeguards are put in place.” </p><p>He added:</p><blockquote>“Policymakers should be wary of supporting an industry that has so far produced no societal benefits and is increasingly trying to integrate into the traditional financial system, both to acquire legitimacy as part of that system and to piggyback on it.”</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Crypto has relied on constantly creating new narratives to attract new investors, but has failed to deliver on its promises. Policymakers should be wary of supporting an industry that has so far produced no benefits for society.<br><br>Read the speech <a href=\"https://t.co/okum8fH3qf\">https://t.co/okum8fH3qf</a><br><br>1/3 <a href=\"https://t.co/40OlefVExB\">pic.twitter.com/40OlefVExB</a></p>&mdash; European Central Bank (@ecb) <a href=\"https://twitter.com/ecb/status/1672225283909332993?ref_src=twsrc%5Etfw\">June 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Panetta claimed the “security, scalability and decentralisation” of crypto transactions was “not achievable”, saying the immutability of blockchains as a negative aspect of the space due to transactions often being unable to be reversed. He cited the collapse of FTX as well as a recent lawsuit brought by the United States Securities and Exchange Commission again Binance as “fundamental shortcomings” of the ecosystem.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/cz-addresses-reasons-behind-binance-s-recent-fud\"><strong><em>CZ addresses reasons behind Binance's recent FUD</em></strong></a></p><p>“Crypto enthusiasts would do well to remember that new technology does not make financial risk disappear,” said the ECB official. “It is like pressing a balloon on one side: it will change in shape until it pops on the other side. And if the balloon is full of hot air, it may rise for a while but will burst in the end.”</p><p>Panetta has previously <a href=\"https://cointelegraph.com/news/ecb-executive-board-member-outlines-plans-for-digital-euro-to-european-parliament\">backed parts of the ECB’s plans</a> for a potential digital euro, currently being researched by the central bank. He has also <a href=\"https://cointelegraph.com/news/ecb-official-proposes-ban-on-tokens-with-an-excessive-ecological-footprint\">proposed banning crypto assets</a> with an “excessive ecological footprint” as part of efforts to address risks to the environment. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/cryptos-critics-can-fud-ever-be-healthy/\"><strong><em>Crypto critics: Can FUD ever be useful?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-23T21:51:00.000Z",
    "title": "Shiba Inu Burn Rate Skyrockets by Nearly 7,000% in One Day",
    "url": "https://www.cryptoglobe.com/latest/2023/06/shiba-inu-burn-rate-skyrockets-by-nearly-7000-in-one-day/",
    "description": "A significant surge has been observed in the burn rate of the popular meme-inspired cryptocurrency Shiba Inu ($SHIB), wirth over 341 million tokens being burned in the past 24-hour period, leading to a staggering 6,936% increase in the burn rate. The Shiba Inu community, often referred to as the SHIBArmy, has beendiligent in supporting burns […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-23T21:50:10.000Z",
    "title": "Legal setbacks and lawsuit shake FTX as founder’s defense strategy is thwarted",
    "url": "https://www.cryptopolitan.com/legal-setbacks-and-lawsuit-shake-ftx-as-founders-defense-strategy-is-thwarted/",
    "description": "Sam Bankman-Fried has been denied his request to obtain documents from Silicon Valley law firm Fenwick &#38; West LLP as part of his defense strategy in his federal fraud case, according to a court order from Friday. Bankman-Fried had sought these documents to support his claim that he relied on legal advice while engaging in ... <a title=\"Legal setbacks and lawsuit shake FTX as founder&#8217;s defense strategy is thwarted\" class=\"read-more\" href=\"https://www.cryptopolitan.com/legal-setbacks-and-lawsuit-shake-ftx-as-founders-defense-strategy-is-thwarted/\" aria-label=\"More on Legal setbacks and lawsuit shake FTX as founder&#8217;s defense strategy is thwarted\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-23T22:00:17.000Z",
    "title": "Crypto Analyst Predicts: Bitcoin (BTC) To Reach $69,000 And Above In 2023",
    "url": "https://www.newsbtc.com/bitcoin-news/crypto-analyst-predicts-bitcoin-to-reach-above-in-2023/",
    "description": "As the world of crypto continues to evolve, traders and analysts are closely monitoring the Bitcoin (BTC) charts for clues about future price movements. Among them, the popular analyst known as Credible Crypto has shared his insights, predicting a new all-time high for Bitcoin by 2023. The prognosis relies on the assumption of a continuing &#8220;parabolic advance&#8221; that could drive the token beyond its previous peak of $69,000. Predicting A Parabolic Advance For Bitcoin The essence of Credible Crypto&#8217;s prediction lies in the nature of Bitcoin&#8217;s &#8220;parabolic advance.&#8221; This concept describes a situation where momentum in the price of an asset increases exponentially until it reaches its peak. Related Reading: Nansen Forecast For Bitcoin Bull Run: Regulatory Clarity And Lower Inflation According to Credible Crypto, such advances have been evident in Bitcoin&#8217;s history, as observed during its ascents from $3,000 to $14,000 and from $10,000 to $60,000.  Bitcoin’s recent performance, characterized by firm support at $25,000 on monthly timeframes, is considered by Credible Crypto as potentially setting the stage for another round of parabolic advance. This new climb, the analyst suggests, should produce monthly moves of more than $10,000, filling the $40,000 gap to the previous all-time high. A &#8216;Logical&#8217; Guess For New Heights While cautioning that these are estimations based on current market conditions, the trader puts forth October 2023 as a &#8220;fairly logical guesstimate&#8221; for when Bitcoin could reach its new all-time high. He clarifies that it&#8217;s not a definitive prediction, but rather an estimation based on the logic of Bitcoin&#8217;s past behavior.  The analyst noted: I am not saying we MUST hit new all-time highs by October, I AM saying I do think we will hit new ATH by the end of this year, and if someone forced me to pick a month in which I think this will occur it would be October. Let’s see how things play out. Meanwhile, over the past 7 days, Bitcoin has made significant moves. The asset has shown a huge recovery from its recent bloodbath amid the United States Security and Exchange Commission (SEC) lawsuit on the two largest crypto exchanges, Binance and Coinbase. Bitcoin has tapped a notable high of above $30,000 bringing the asset to record a nearly 20% gain to its value in the past 7 days. Notably, BTC&#8217;s surge comes amid financial giants such as BlackRock embracing the crypto future. BlackRock, which is the world&#8217;s largest asset manager, last week disclosed its latest plan to launch a Bitcoin exchange-traded fund (ETF) if it gets approved by the US regulator, sparking an incredibly rally in the price of BTC. Related Reading: BlackRock Inches Closer To Launching Bitcoin ETF: Potential Impact On BTC Price At the time of writing, Bitcoin currently trades above $30,000 after trading below that price range throughout last week. In the past 7 days, Bitcoin’s total market capitalization has also seen a boost of 18.1%, amounting to an additional $90 billion. The market capitalization of Bitcoin presently hovers at $585.2 billion, an increase from last Friday&#8217;s $494 billion. Featured image from Unsplash, Chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-23T22:01:19.000Z",
    "title": "Enterprise Blockchain Altcoin VeChain (VET) Leaps 15% After Coinbase Announcement",
    "url": "https://dailyhodl.com/2023/06/23/enterprise-blockchain-altcoin-vechain-vet-leaps-15-after-coinbase-announcement/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/01/massive-vechain-prediction.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/01/massive-vechain-prediction.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/01/massive-vechain-prediction.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/01/massive-vechain-prediction.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/01/massive-vechain-prediction.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/01/massive-vechain-prediction.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/01/massive-vechain-prediction.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An enterprise-solution-focused blockchain has jumped 15% in the last 24 hours on the news of being added to Coinbase&#8217;s roadmap. Yesterday, Coinbase Assets announced the additions of VeChain (VET) and VeThor (VTHO) to its listing roadmap. &#8220;Assets added to the roadmap today: VeChain (VET) and VeThor (VTHO).&#8221; VET is worth $0.0188 at time of writing, up 15% [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/23/enterprise-blockchain-altcoin-vechain-vet-leaps-15-after-coinbase-announcement/\">Enterprise Blockchain Altcoin VeChain (VET) Leaps 15% After Coinbase Announcement</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]