[
  {
    "source": "CoinDesk",
    "date": "2023-08-04T16:17:05.000Z",
    "title": "Miami Mayor Francis Suarez to Accept Presidential Campaign Donations in Bitcoin",
    "url": "https://www.coindesk.com/business/2023/08/04/miami-mayor-francis-suarez-to-accept-presidential-campaign-donations-in-bitcoin-and-other-crypto/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Bitcoin-friendly Miami Mayor Francis Suarez will be accepting donations in bitcoin (BTC) and other crypto for his presidential campaign, he announced on CoinDesk TV on Friday."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-04T16:19:57.000Z",
    "title": "Decrypt’s Guide to Stable Diffusion: The Most Powerful Open-Source Tool for AI Image Generation",
    "url": "https://decrypt.co/resources/decrypts-guide-to-stable-diffusion-the-most-powerful-open-source-tool-for-ai-image-generation",
    "description": "Be it a \"hyperrealistic portrait of Emma Watson as a sorceress\" or an \"intricate digital painting of a pirate in a fantasy setting,\" the only limit is your imagination. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-04T16:14:49.000Z",
    "title": "Core Scientific appoints Adam Sullivan as CEO amid restructuring process",
    "url": "https://cointelegraph.com/news/core-scientific-appoints-new-ceo-amid-restructuring-process",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/13b21cec-dab6-4c3a-bbd5-88800460426e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The company claims to have seen a boost in liquidity in recent months and is expected to exit bankruptcy proceedings by September.</p>\n                    <p><p>Publicly traded Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) miner Core Scientific has appointed Adam Sullivan its CEO. Sullivan, who previously served as the company’s president, took the role on Aug. 4, while co-founder and former CEO Mike Levitt remains chairman of the board.</p><p>Sullivan has over a decade of financial services experience, particularly in digital assets and infrastructure, with a background that includes strategy, corporate finance, and mergers and acquisitions. Before joining Core Scientific, he held roles at XMS Capital Partners, overseeing transactions totaling over $5 billion, including Core Scientific’s merger with Power &amp; Digital Infrastructure Acquisition Corp. in 2021.</p><p>The switch in leadership comes amid Core Scientific’s restructuring process. After <a href=\"https://cointelegraph.com/news/core-scientific-reveals-financial-distress-in-sec-filing-says-its-end-may-be-near\">months of financial distress</a>, the company filed for Chapter 11 bankruptcy protection in December 2022 due to low Bitcoin prices, increased electricity costs, a rise in the global Bitcoin hash rate and the bankruptcy of crypto lender Celsius. </p><p>Chapter 11 bankruptcy allows a business to continue operating until stakeholders agree on a restructuring plan, which may involve downsizing operations to reduce debt or selling assets to repay creditors.</p><p>In the bankruptcy plan recently submitted to U.S. courts, Core Scientific claims to <a href=\"https://cointelegraph.com/news/core-scientific-plans-september-bankruptcy-exit\">have seen a boost in liquidity</a> due to higher Bitcoin prices, increased network hash rate and reduced energy costs. The company is <a href=\"https://cointelegraph.com/news/core-scientific-plans-september-bankruptcy-exit\">expected to exit proceedings</a> by September. So far this year, the company’s stock has increased over 1,178%, indicating positive investor sentiment. However, Core Scientific remains a penny stock, which means volatility is more likely. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/e032c085-d221-4885-9010-c44ecf9a9a75.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Core Scientific’s share price movement in 2023. Source: Google Finance</em></figcaption></figure><p>Core Scientific reportedly operates 211,000 Bitcoin miners across its data centers in the United States, with a potential hash rate of 22.2 exahashes per second. Self-mining operations contributed 1,030 BTC in June and 7,768 BTC in the first half of 2023. </p><p><em><strong>Magazine: </strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong>Deposit risk: What do crypto exchanges really do with your money?</strong></a></em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-04T16:15:36.000Z",
    "title": "Bank of Russia kicks off digital ruble operations with free transactions until 2025",
    "url": "https://cryptoslate.com/bank-of-russia-kicks-off-digital-ruble-operations-with-free-transactions-until-2025/",
    "description": "<p>The Bank of Russia said transactions in the country&#8217;s Digital Ruble currency would be free till 2025, according to an Aug. 3 statement. After 2025 businesses and legal entities transacting with the Central Bank digital currency (CBDC) would be charged a small fee for their usage. Part of the statement reads: &#8220;The tariff for businesses for [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/bank-of-russia-kicks-off-digital-ruble-operations-with-free-transactions-until-2025/\">Bank of Russia kicks off digital ruble operations with free transactions until 2025</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-04T16:30:06.000Z",
    "title": "Coinbase Institutional’s Head of Research Breaks Down Key Market Movements in Crypto and Traditional Finance",
    "url": "https://www.cryptoglobe.com/latest/2023/08/coinbase-institutionals-head-of-research-breaks-down-key-market-movements-in-crypto-and-traditional-finance/",
    "description": "David Duong, CFA, Head of Institutional Research, provided a comprehensive analysis of the traditional and crypto markets in his weekly market commentary for the week ending August 4, 2023. According to Duong, the week was eventful for both markets, albeit for different reasons. In traditional finance, the Bank of Japan’s decision to raise the hard […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T16:26:42.000Z",
    "title": "Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better ... <a title=\"Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fantom-price-prediction/\" aria-label=\"More on Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\">Read more</a>"
  }
]