[
  {
    "source": "CryptoSlate",
    "date": "2023-08-29T08:08:03.000Z",
    "title": "Whale exodus at Bybit sees single biggest Bitcoin outflow signals market shift",
    "url": "https://cryptoslate.com/insights/whale-exodus-at-bybit-single-biggest-bitcoin-outflow-signals-market-shift/",
    "description": "<p>Quick Take Bybit, a notable exchange in the cryptocurrency industry, has recently witnessed a significant Bitcoin outflow. On a single day, $320M worth of Bitcoin, equivalent to 12.5k BTC, was withdrawn. This substantial withdrawal was predominantly initiated by major Bitcoin holders, often called &#8216;whales&#8217; in the industry. This move marks the most significant single-day withdrawal [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/whale-exodus-at-bybit-single-biggest-bitcoin-outflow-signals-market-shift/\">Whale exodus at Bybit sees single biggest Bitcoin outflow signals market shift</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-29T07:45:19.000Z",
    "title": "\n                        BitBoy Crypto Parts Ways With YouTuber Ben Armstrong\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/bitboy-crypto-parts-ways-with-youtuber-ben-armstrong",
    "description": "\n                        <p dir=\"ltr\">BJ Investment Holdings, the parent company of the Hit Network that controls BitBoy Crypto, has announced that it has severed ties with YouTuber and Influencer Ben Armstrong.&nbsp;</p>\n<p dir=\"ltr\">The company made the announcement on X and made several strong allegations attacking the crypto influencer&rsquo;s character.&nbsp;</p>\nA Parting Of Ways&nbsp;\n<p dir=\"ltr\">The announcement about the removal of Ben Armstrong was confirmed on X by BitBoy Crypto. According to the announcement, BJ Investment Holdings took decisive legal action to Remove Ben from the company and, more specifically, the BitBoy Crypto Brand.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;Yesterday, BJ Investment Holdings, the parent company of Hit network, took decisive legal action in removing Ben Armstrong from the company, and specifically the Bitboy Crypto brand.&rdquo;</p>\n\n<p dir=\"ltr\">The reasons were revealed in a longer and more detailed YouTube announcement. According to a company spokesperson, the decision was made after several efforts to assist Ben Armstrong &ldquo;during his relapse into substance abuse.&rdquo; The spokesperson also expressed regret at the end of the business relationship between the company and Armstrong. The firm had earlier claimed that Armstrong had inflicted considerable emotional, physical, and financial damage on people in the space and on Hit employees. While the allegations include serious and personal allegations against Armstrong, the influencer has not spoken out or confirmed them himself.&nbsp;</p>\n<p dir=\"ltr\">However, the BenCoin account on X responded to the news in a post that it claimed was written by Armstrong. However, it is still being determined as of now if Armstrong, indeed, was the one who wrote the message.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;This is Ben. TJ Shedd &amp; Justin Williams have attempted a coup at my company. Just confirming what is going around. It&rsquo;s true. There has been a mutiny at BitBoy Crypto &amp; Hit Network. But it won&rsquo;t work. They have no leverage. Until they can clone me, I have nothing to worry about.&rdquo;</p>\n\nPossible Reasons?&nbsp;\n<p dir=\"ltr\">The announcement by BitBoy Crypto did not elaborate or point to any specific incidents that could have contributed to the end of its business relationship with Armstrong. However, the YouTuber and crypto influencer was involved in a class-action lawsuit after investors claimed that he and other influencers promoted the now-bankrupt FTX exchange without revealing compensation from the exchange. Court filings also suggested that Armstrong issued several threats against lawyers who were representing the plaintiffs. He had also openly mocked a federal judge&rsquo;s authority by failing to appear in court as ordered. The case was stayed on the 16th of June.&nbsp;</p>\n<p dir=\"ltr\">Armstrong also insulted several high-profile figures using his platforms, with over 1 million subscribers on X and YouTube. These figures included Christine Lagarde, the president of the European Central Bank, and Gary Gensler, the United States Securities and Exchange Commission (SEC) Chair. He had also filed a defamation suit against YouTuber Erling Mengshoel Jr, also called &ldquo;Atozy.&rdquo; However, he later dropped the case after Atozy managed to raise around $200,000 for his defense.&nbsp;</p>\nSocial Media Users React&nbsp;\n<p dir=\"ltr\">Many users on YouTube and X reacted in support of Armstrong following the announcement on X. They also expressed some concerns about the future of the BitBoy Crypto brand, given Armstrong was its most popular and recognizable face. One user on X stated,&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;I remember when I first got into crypto... I was still trading on Coinbase, I listened to bitboy tell me what coins to buy, and my charts were so full of indicators I could hardly see the candlesticks. It&rsquo;s crazy how fast things can change in three days.&rdquo;</p>\n\n<p dir=\"ltr\">Many users on the YouTube livestream were unhappy with Armstrong&rsquo;s removal, with many demanding the host&rsquo;s return. However, the mood on Reddit was in stark contrast with that on the YouTube live stream, with many users cheering the news. It is also unclear if any of Armstrong&rsquo;s previous legal problems led to the company parting ways with him. Authorities have been targeting crypto influencers globally for promoting fraudulent projects following the collapse of FTX.</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-29T07:45:35.000Z",
    "title": "Artificial Intelligence and Higher Education: A New Approach to Learning",
    "url": "https://www.cryptopolitan.com/artificial-intelligence-and-education/",
    "description": "In a notable departure from conventional teaching methods, educators are embracing the role of artificial intelligence (AI) in higher education. Integrating AI tools, such as ChatGPT, into classrooms is prompting a shift from emphasizing technical coding skills to fostering a deeper understanding of programming concepts. This change reflects the evolving landscape of education in an ... <a title=\"Artificial Intelligence and Higher Education: A New Approach to Learning\" class=\"read-more\" href=\"https://www.cryptopolitan.com/artificial-intelligence-and-education/\" aria-label=\"More on Artificial Intelligence and Higher Education: A New Approach to Learning\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-29T08:04:34.000Z",
    "title": "Hedera (HBAR) And Pepe (PEPE) In Doldrums While Pomerdoge (POMD) Investors Eye 4,000% Gains",
    "url": "https://www.crypto-news-flash.com/hedera-hbar-and-pepe-pepe-in-doldrums-while-pomerdoge-pomd-investors-eye-4000-gains/",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-102.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-102.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-102-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Read this article to learn why experts are rallying behind a new crypto project, Pomerdoge. Additionally, the presale of this new project has become so successful that it has surpassed crypto projects like Hedera (HBAR) and Pepe (PEPE). Summary Hedera’s (HBAR) total value locked (TVL) has increased by 10%. The network activity of Pepe (PEPE) [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-29T08:03:27.000Z",
    "title": "Ripple Rally Ahead: Key Indicator Signals 20% XRP Price Explosion",
    "url": "https://www.crypto-news-flash.com/ripple-rally-ahead-key-indicator-signals-20-xrp-price-explosion/",
    "description": "<img width=\"1280\" height=\"819\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-300x192.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-1024x655.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Hand-hold-RIPPLE-XRP-coin-768x491.jpg 768w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />XRP has been predicted to stage a 20 percent rally if transaction activities intensify and long-term investors keep holding. However, the asset risks falling to as low as $0.40 when it falls below 0.46 percent according to experts.  XRP has since August 17 failed to make any considerable run as the asset hovers between $0.5 [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-29T07:51:29.000Z",
    "title": "SEC Hinman Under Fire: Did He Lie Under Oath on Investment Contracts?",
    "url": "https://coinedition.com/sec-hinman-under-fire-did-he-lie-under-oath-on-investment-contracts/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/SEC-61.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/SEC-61.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/SEC-61-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/SEC-61-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/SEC-61-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/SEC-61-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/SEC-61-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/SEC-61-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/SEC-61-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/SEC-61-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/SEC-61-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/SEC-61-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/SEC-61-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/SEC-61-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/SEC-61-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/SEC-61-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/SEC-61-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent tweet, a well-known pro-crypto lawyer, John Deaton, criticized the U.S. Securities and Exchange Commission (SEC). He argued that the agency has lost its focus on its mission and appears to disregard the law. According to Deaton, the former Director of Corporation Finance at the SEC, Bill Hinman, testified under oath that the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sec-hinman-under-fire-did-he-lie-under-oath-on-investment-contracts/\">SEC Hinman Under Fire: Did He Lie Under Oath on Investment Contracts?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]