[
  {
    "source": "CryptoGlobe",
    "date": "2023-10-14T02:02:00.000Z",
    "title": "Daunting $XRP Price Predictions Sees Token Crash to $0.10 If It Drops Below Key Support Level, Analyst Suggests",
    "url": "https://www.cryptoglobe.com/latest/2023/10/startling-xrp-price-predictions-sees-token-crash-to-0-10-if-it-drops-below-key-support-level-analyst-suggests/",
    "description": "A popular cryptocurrency analyst has recently made a daunting $XRP price prediction, suggesting that if the price of the native token of the XRP Ledger were to fall below its Fibonacci level at 0.382, around $0.40, a key support level for the last seven months, it could plunge to as low at $0.10. In a […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-14T02:00:28.000Z",
    "title": "BlockFi CEO’s Key Testimony: Insights Into Alameda’s Financial Stability In FTX Trial",
    "url": "https://www.newsbtc.com/ftx/blockfi-ceos-key-testimony-insights-into-alamedas-financial-stability-in-ftx-trial/",
    "description": "The trial against FTX co-founder Sam Bankman-Fried took an intriguing turn as Zac Prince, the CEO of defunct crypto lender BlockFi, provided testimony in a Manhattan federal courtroom.  Prince&#8217;s appearance provided valuable insights into the intricate relationship between BlockFi, FTX, and Alameda Research. BlockFi&#8217;s Bankruptcy Rooted In Alameda And FTX According to a Bloomberg report, Prince revealed that BlockFi had substantial exposure to Alameda and FTX, estimated at around $1 billion, at the time of BlockFi&#8217;s failure in November 2022.  Prince asserted that if the loans to Alameda were still in good standing and the funds on FTX were available, BlockFi would not have filed for bankruptcy. This statement suggests that BlockFi&#8217;s financial troubles were closely tied to the collapse of Alameda and FTX. Related Reading: Have Traders Moved Past Dogecoin? Transactions Plunge 98% Since June Prince&#8217;s testimony diverged significantly from Caroline Ellison, the government&#8217;s star witness, who portrayed Bankman-Fried as the mastermind behind a fraudulent scheme using FTX customer funds for speculative trading at Alameda.  Prince&#8217;s account positioned BlockFi as a victim of Bankman-Fried&#8217;s alleged schemes, claiming that BlockFi made loans to Alameda based on misleading balance sheets.  Defense lawyers sought to emphasize that BlockFi willingly provided the loans to Alameda, with knowledge of the associated risks. Creditors Accuse BlockFi Of Inadequate Due Diligence Prince discussed BlockFi&#8217;s due diligence process regarding Alameda&#8217;s collateral, comprised of tokens affiliated with FTX. The judge requested plainer terms during Prince&#8217;s explanation, prompting an analogy using car loans.  Per the report, the prosecution questioned the adequacy of BlockFi&#8217;s due diligence, as creditors accused the company of failing to recognize warning signs before offering substantial loans to Alameda. Prince&#8217;s testimony highlighted that providing &#8220;unaudited balance sheets&#8221; is an industry norm for borrowers seeking loans. The defense sought to establish that BlockFi knew the risks of lending to Alameda and acted within industry norms. Zac Prince&#8217;s testimony in the trial against Sam Bankman-Fried provided a deeper understanding of the intertwined relationships within the crypto industry. BlockFi&#8217;s exposure to Alameda and FTX and its subsequent bankruptcy offered insights into the potential repercussions of alleged fraudulent activities.  Related Reading: Man Makes A Fortune With $22 In Bitcoin: 3 Altcoins For October 2023 That Can Do This The differing narratives presented by the prosecution and defense underscore the complexities of the case. As the trial unfolds, the court will continue to examine the details surrounding BlockFi&#8217;s lending practices and the extent of Bankman-Fried&#8217;s involvement in the alleged schemes. It is important to note that BlockFi can no longer be utilized for crypto-related activities, as the company declared bankruptcy and suspended withdrawals in November 2022. The bankruptcy filing indicates that BlockFi owes between $1 billion and $10 billion to over 100,000 creditors. Featured image from NBC, chart from TradingView.com"
  }
]