[
  {
    "source": "CoinDesk",
    "date": "2023-08-22T12:49:28.000Z",
    "title": "Mantle Stakes $66M of Ether on Lido as Part of Treasury Management Strategy",
    "url": "https://www.coindesk.com/business/2023/08/22/mantle-stakes-66m-of-ether-on-lido-as-part-of-treasury-management-strategy/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Layer 2 network Mantle has staked 40,000 ether (ETH) on staking protocol Lido after it passed a governance vote on treasury management earlier this month."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-22T13:01:00.000Z",
    "title": "Crypto P2P scams in India show digital asset education is needed ",
    "url": "https://cointelegraph.com/news/crypto-p2p-scams-india",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/4825c651-7b83-4923-abdd-04fe980d37b0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Scammers have made it impossible for Indian crypto traders to conduct P2P trades owing to several police complaints and bank account freezes that follow. </p>\n                    <p><p>Peer-to-peer (P2P) cryptocurrency trading has been a staple of the cryptocurrency community since the industry’s early days. </p><p>P2P trading refers to the direct exchange of cryptocurrencies between two users without the involvement of intermediaries. P2P exchanges link buyers and sellers while also adding an extra degree of security through an escrow service. Some of the key advantages of P2P over centralized exchanges include global accessibility, a variety of payment alternatives and no transaction fees.</p><p>Furthermore, P2P marketplaces have become crucial for crypto traders and enthusiasts in jurisdictions where governments are hostile to formal cryptocurrency exchanges and service providers. </p><p>In India, they became a lifeline for many crypto traders when the country’s central bank issued a banking ban on cryptocurrency businesses in April 2018. </p><p>Although the banking ban was <a href=\"https://cointelegraph.com/news/india-supreme-court-lifts-rbi-ban-on-banks-servicing-crypto-firms\">eventually lifted by the Supreme Court</a> in March 2020, P2P platforms continue to play a crucial role as banks <a href=\"https://cointelegraph.com/news/crypto-exchanges-in-india-still-struggling-to-secure-banking-partners\">remain sceptical about offering services to crypto exchanges</a> due to a lack of regulatory clarity. </p><p>During the bull market in 2021–2022, India saw a significant surge in crypto trading volumes and crypto platforms, prompting the government to take notice of the nascent ecosystem. </p><p><strong><em>Recent: <a href=\"https://cointelegraph.com/news/paypal-new-stablecoin\">PayPal’s new PYUSD stablecoin faces legal headwinds and ‘less functionality’</a></em></strong></p><p>While industry leaders demanded a comprehensive regulatory framework, which has been under development since 2019, the Indian finance minister announced a <a href=\"https://cointelegraph.com/news/30-crypto-tax-becomes-law-in-india-following-finance-bill-approval\">30% tax on crypto profits in 2022</a>.</p><p>The heavy tax, in addition to the continuing lack of regulatory clarity, has been the bane of the budding Indian crypto ecosystem, <a href=\"https://cointelegraph.com/news/crypto-tax-deters-83-indian-investors-from-crypto-trading-waxirx-report\">deterring Indian investors away from the market</a>. </p><p>While mainstream crypto exchanges struggled, P2P platforms saw their volumes skyrocket. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/096ff8c2-8b2e-4620-a163-635e4b345ac4.png\"  /></figure><h2>How P2P scams happen</h2><p>This rise in P2P trading volume also led to significant uptick in P2P scams. These scams often use stolen banking data or lure customers with fake promises of high profits and then use their banking information to scam P2P users.</p><p>Earlier in July, two people were arrested in the Indian city of Ujjain in connection with a Binance P2P scandal. The police recovered several fake bank accounts, ATM cards and documents from the accused, who were allegedly buying fake IDs and personal data for 1,500 Indian rupees ($18) in order to scam users of Binance P2P.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Two Accused In Binance P2P Scam Arrested In Ujjain, India <br><br>Two accused of scamming people on <a href=\"https://twitter.com/hashtag/Binance?src=hash&amp;ref_src=twsrc%5Etfw\">#Binance</a> P2P arrested by police in Ujjain, India. Many fake bank accounts, ATM cards and documents are seized from accused<br><br>The accused used to buy Fake ID Proofs and personal data… <a href=\"https://t.co/Nt5GxhVmio\">pic.twitter.com/Nt5GxhVmio</a></p>&mdash; Ajay Kashyap (@EverythingAjay) <a href=\"https://twitter.com/EverythingAjay/status/1678628449760718848?ref_src=twsrc%5Etfw\">July 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>One way P2P scammers steal user data is with the help of fake crypto-centered channels on Telegram that promise high profits or airdrops. Many gullible users looking to make a quick profit often join these channels and share their personal banking information. In many other cases, the scammer simply buys or steals the user’s personal information.</p><p>The stolen data is then used to create a P2P account on any popular P2P platform — Binance and WazriX are common in India. </p><p>The scammer then initiates a buy order on the P2P platform looking for unsuspecting sellers. Once they match with a seller, they send the money to the seller using the victim’s account. Thus, they complete the P2P transaction on the platfrom where the buyer receives the cryptocurrency and the seller receives the money in their bank account. </p><p>The buyer (scammer) then vanishes with the crypto and the victim whose bank account was used to send the money only realizes it after the money has been deducted from their bank account.</p><p>The victim then lodges a complaint with the police whose first step is to freeze all bank accounts that the victim has interacted with during the scam phase. </p><p>This action from the police triggers an extended account freeze for unsuspected sellers of the P2P platform who only realize they were involved in the scam after they get a call from the police or their bank informs them that their account has been frozen. </p><p>In one instance, a seller, who wished to remain anonymous, received a “bank account frozen” message while trying to pay for a taxi. After contacting the bank, the seller learned that the halt was requested by the police’s cyber division responsible for looking into online crimes.</p><p>When the seller then followed up on the complaint with the police and enquired about the freeze on the account, they were met with threats of legal consequences from the Enforcement Directorate, India’s economic intelligence agency, for a $40 P2P completed transaction on WazirX in October 2022. </p><p>The police complaint was filed by a woman who was scammed out of $30,000 between September 2022 and June 2023. The police started the investigation and froze every bank account that interacted with the plaintiff’s accounts during the mentioned time frame, including the sellers for the October transaction.</p><p>The seller tried to explain to the police officer that they had successfully completed the P2P transaction and thus have no role in the scam. Despite this, the police ignored their claims, erroneously claiming that crypto transactions are illegal and stating that they must pay the complainee $40 or face further legal action.</p><p>With no other options left, the victim eventually paid the $40 amount to the plaintiff’s account after which the police released an order to unfreeze the account. </p><p>The police did not respond to Cointelegraph’s request for comment.</p><p>The bank account restrictions limit unsuspected victim’s access to cash, and the complexities involved in getting the issue fixed are significant. The seller — who often is also unaware of the scam until the last moment — could be subject to a legal investigation or be required to provide evidence. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Problem using P2P in India still continues. <a href=\"https://twitter.com/cz_binance?ref_src=twsrc%5Etfw\">@cz_binance</a> do something. <a href=\"https://twitter.com/TheOfficialSBI?ref_src=twsrc%5Etfw\">@TheOfficialSBI</a> Got my account frozen.  <a href=\"https://t.co/Y6By4l5RGy\">pic.twitter.com/Y6By4l5RGy</a></p>&mdash; Balamurugan Lakshmanan (@balamurugankl) <a href=\"https://twitter.com/balamurugankl/status/1678660013521518592?ref_src=twsrc%5Etfw\">July 11, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>There have been several instances of such P2P scams over the past year where victims noted their fear of authorities, with police often threatening legal actions. The anonymous seller told Cointelegraph that their account was frozen with 50,000 rupees in it, adding that they are very afraid of how to approach authorities and whether they would face legal consequences.</p><h2>Some advise against P2Ps</h2><p>Due to a lack of clear guidelines around crypto-related crimes and a lack of understanding of the technology underpinning cryptocurrencies, police investigations often start with freezing the accounts of anyone involved in the situation.</p><p>Pushpendra Singh, a prominent crypto personality and educator in the Indian crypto ecosystem, told Cointelegraph that scammers take advantage of the police’s ignorance of how crypto works:</p><blockquote>“What these scammers do is they often use platforms, such as international Binance platform, to evade investigation from the Indian authorities, as it becomes quite difficult for the authorities to demand documents from such international platforms. Scammers then take the stolen USDT to Trust Wallet or any other non-KYC’d platform to avoid being tracked. While scammers get away with the money, both buyer and seller in the transaction face financial and legal consequences.”</blockquote><p>Singh said that Indian police need to be actively trained on how these scams work. He noted that the “lack of awareness around the nascent tech also leads to victim harassment where many victims are often told by the police that crypto transactions are illegal in India.”</p><p>P2P scams have become very common and concerning to the point where the majority of crypto experts in India have now asked traders to avoid P2P trading. Sumit Gupta, CEO of CoinDCX — a major crypto exchange in India — said crypto traders should avoid P2P transations. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/banning-ransomware-payments-attractive-dangerous-idea/\">Should we ban ransomware payments? It’s an attractive but dangerous idea</a></em></strong></p><p>He said that many people in India got a notice from various government authorities just because they unknowingly sent money from someone who wasn’t the right person to deal with. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Guys, P2P is extremely risky. I’ve been telling folks to avoid using any kind of P2P platforms, it’s an open invitation to trouble. <br><br>I know so many people in India got notice from various govt authorities just because they unknowingly sent INR or received INR from someone who… <a href=\"https://t.co/3CoyceiPwP\">https://t.co/3CoyceiPwP</a></p>&mdash; Sumit Gupta (CoinDCX) (@smtgpt) <a href=\"https://twitter.com/smtgpt/status/1651885370630369281?ref_src=twsrc%5Etfw\">April 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Other crypto personalities have urged traders to be vigilant and make sure the P2P account one is interacting with has a good history.</p><p>What started out as a crypto revolution has turned into a weak spot for the Indian crypto ecosystem. </p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/crypto-p2p-scams-india&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-22T13:00:49.000Z",
    "title": "Germany proposes to screen Chinese investment in AI and related sectors: Report ",
    "url": "https://cointelegraph.com/news/germany-proposes-to-screen-chinese-ai-investment",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/0d9245b2-c61c-4dee-869b-7bef10ea514c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The German government proposed tighter export controls on China for semiconductors and AI technology similar to measures from U.S. regulators. </p>\n                    <p><p>The deputy chancellor of Germany has reportedly proposed tightening the screening process for foreign direct investment from China, according to <a href=\"https://www.sueddeutsche.de/politik/china-investitionen-wirtschaftssicherheit-robert-habeck-1.6149441?reduced=true\" target=\"_blank\" rel=\"noopener nofollow\">reports</a> from local media outlets. </p><p>Rober Habeck, a member of the Greens coalition and economic minister, said the tightening of restrictions on Chinese foreign investment would be in “critical sectors” which include semiconductors and artificial intelligence (AI). </p><p>It aims to consolidate and simplify a number of existing rules pertaining to sectors in which China is dominant, such as those mentioned above. He also reportedly proposed cracking down on Chinese efforts to bypass existing rules. </p><p>This proposal comes a month after comments from the Foreign Minister of Germany Annalena Baerbock gave a speech warning of China becoming increasingly “repressive internally and more aggressive externally.”</p><blockquote class=\"twitter-tweet\"><p lang=\"de\" dir=\"ltr\">China hat sich in den letzten Jahren so rasant verändert, wie vielleicht kein anderes Land. Wer <a href=\"https://twitter.com/hashtag/China?src=hash&amp;ref_src=twsrc%5Etfw\">#China</a> zuhört, weiß, mit welchem Selbstbewusstsein es die Entwicklung dieses Jahrhunderts prägen wird. Mit der <a href=\"https://twitter.com/hashtag/ChinaStrategie?src=hash&amp;ref_src=twsrc%5Etfw\">#ChinaStrategie</a> geben wir uns für unsere Beziehungen den Kompass. 1/5</p>&mdash; Außenministerin Annalena Baerbock (@ABaerbock) <a href=\"https://twitter.com/ABaerbock/status/1679426262639468544?ref_src=twsrc%5Etfw\">July 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Reportedly, the measures proposed by Habeck don’t focus on outbound investment into Chinese tech industries. This, however, was of primary focus in <a href=\"https://cointelegraph.com/news/us-china-ai-tech-standoff-spread-overseas\">recently finalized rules</a> coming from the United States, which are being considered by many European governments including Germany, France and the United Kingdom. </p><p>Currently, the proposed legislation is awaiting remarks from various government departments prior to becoming official. German officials are also in <a href=\"https://cointelegraph.com/news/german-political-parties-split-on-how-to-regulate-increasing-ai-adoption\">the process of discussing</a> AI regulations. </p><p>Germany is the largest economy in Europe and has China as its largest trading partner, according to official <a href=\"https://www.destatis.de/EN/Themes/Economy/Foreign-Trade/_node.html\" target=\"_blank\" rel=\"noopener nofollow\">statistics</a> from the German government. </p><p>Cointelegraph reached out to the German Ministry of Economic Affairs and Climate Action for further comment on the situation. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/china-proposes-metaverse-social-credit-system\"><strong><em>China proposes to bring its social credit system to the metaverse: Report</em></strong></a></p><p>These moves out of Germany follow an ongoing quid pro quo between China and the U.S. regarding AI development and deployment. </p><p>After multiple instances of the U.S. tightening export controls and investment opportunities, China announced it would be<a href=\"https://cointelegraph.com/news/china-to-tighten-control-on-exports-of-ai-chip-making-materials\"> tightening controls around the exports</a> of crucial chip-making materials. </p><p>The U.S. then responded by revealing plans to <a href=\"https://cointelegraph.com/news/china-to-tighten-control-on-exports-of-ai-chip-making-materials\">restrict China’s access</a> to cloud computing services. Though most recently, it has released a series of <a href=\"https://cointelegraph.com/news/us-senate-wants-companies-to-report-investments-in-chinese-technologies\">new rules regarding investments</a> both from and to China in these two “critical sectors,” among others. </p><p>Meanwhile, in China, lawmakers have officially <a href=\"https://cointelegraph.com/news/china-s-new-ai-regulations-begin-to-take-effect\">released and instated their regulations</a> surrounding the development and deployment of AI in the country. </p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/real-reason-chinas-war-on-crypto-3ac-judges-embarrassing-mistake-asia-express/\"><strong><em>Real reason for China’s war on crypto, 3AC judge’s embarrassing mistake: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-08-22T13:01:00.000Z",
    "title": "Crypto P2P scams in India show digital asset education is needed ",
    "url": "https://cointelegraph.com/news/crypto-p2p-scams-india",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/4825c651-7b83-4923-abdd-04fe980d37b0.jpg\"></p><p>Scammers have made it impossible for Indian crypto traders to conduct P2P trades owing to several police complaints and bank account freezes that follow. </p>\n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-22T12:46:25.000Z",
    "title": "\n                        Terra Freezes Site After \"Phishing\" Hack\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/terra-freezes-site-after-phishing-hack",
    "description": "\n                        <p dir=\"ltr\">A phishing site has seized control of the Terra website, leading the site developers to sound the alarm and eventually freeze the Terra.money website.&nbsp;</p>\nTerra.money Now Phishing Site\n<p dir=\"ltr\">Over the weekend, the Terra.money website fell under the control of hackers who were using the site to launch phishing attacks on whatever users were left on the platform.&nbsp;</p>\n<p dir=\"ltr\">Kiruse, an esteemed web3 developer at Terra, took to Twitter to sound the alarm about this phishing site that's masquerading as the authentic Terra website. The site's sinister objective revolves around duping unsuspecting users into divulging their highly sensitive and confidential information.</p>\n<p dir=\"ltr\">The domain in question, terra(dot)money, is presently under intense scrutiny due to its alleged involvement in this phishing endeavor. The perpetrators manipulated the website to pilfer sensitive user data, employing tactics that led users to unwittingly reveal their seed phrases, putting both cryptographic keys and funds in severe jeopardy.&nbsp;</p>\nAlerts and Precautions\n<p dir=\"ltr\">Terra's response was swift. On August 19, the platform issued a stern warning against engaging with any site under the Terra money domain. This caution was reiterated the very next day, on August 20. Further efforts to bolster safety and security came from Station Wallet on August 21, advising users to steer clear of the Station desktop and mobile apps until their safety can be ensured.</p>\n<p dir=\"ltr\">The team has also issued a strict directive for users: rely solely on the official communication channels&mdash;namely X (Twitter), Discord, and Telegram. This strategic move is aimed at ensuring that users receive authentic and trustworthy information during this period of uncertainty.</p>\nTemporary Shutdown And Road Ahead\n<p dir=\"ltr\">In a bid to fend off these phishing scams, the Layer-1 blockchain Terra took the proactive step of temporarily shutting down its website.&nbsp;</p>\n<p dir=\"ltr\">The team released an official statement on X,&nbsp;</p>\n\n<p dir=\"ltr\">\"The terra(dot)money domains have successfully been frozen to prevent further user phishing scams, but a full resolution is still underway. Our team has been working around the clock to rectify this issue, but we&rsquo;ve encountered delays with some third-party responses.&rdquo;</p>\n\n<p dir=\"ltr\">Terra is still recovering from the devastating crash of the Terra/LUNA ecosystem last year. The company is desperately attempting to rebuild its reputation by replacing CEO Do Kwon, who was arrested and then released on bail. Furthermore, news of undisclosed wallets containing $160 million worth of digital assets belonging to Do Kwon has not helped his case. It remains to be seen if the Terra team is able to deal with the new phishing attack on top of its existing troubles.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice. </p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-22T12:49:28.000Z",
    "title": "Life sentence for former Jiangxi official Yi Xiao over corruption and cryptocurrency mining",
    "url": "https://www.cryptopolitan.com/life-sentence-for-former-jiangxi-official-yi-xiao-over-corruption-and-cryptocurrency-mining/",
    "description": "Recently, Chinese authorities have handed down a life sentence to former party official Yi Xiao for multiple acts of corruption, including involvement in Bitcoin mining. Xiao, a former provincial official of the southeastern province of Jiangxi, was accused of using his position for cryptocurrency mining. From 2008 to 2021, Xiao leveraged his position as vice ... <a title=\"Life sentence for former Jiangxi official Yi Xiao over corruption and cryptocurrency mining\" class=\"read-more\" href=\"https://www.cryptopolitan.com/life-sentence-for-former-jiangxi-official-yi-xiao-over-corruption-and-cryptocurrency-mining/\" aria-label=\"More on Life sentence for former Jiangxi official Yi Xiao over corruption and cryptocurrency mining\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-22T12:51:19.000Z",
    "title": "Indian crypto exchange CoinDCX cuts staff amid bear market",
    "url": "https://crypto.news/indian-crypto-exchange-coindcx-cuts-staff-amid-bear-market/",
    "description": "CoinDCX, a top Indian cryptocurrency exchange, is slashing 12% of its staff as a prolonged bear market and the nation&#8217;s tax policies impact revenue. Founded in 2018 by Neeraj Khandelwal and Sumit Gupta, the Mumbai-based cryptocurrency exchange employs approximately 590&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-22T13:05:49.000Z",
    "title": "Binance Labs Invests in Delphinus Lab: Advancing Web3 Security and Privacy with zkWASM Technology",
    "url": "https://www.crypto-news-flash.com/binance-labs-invests-in-delphinus-lab-advancing-web3-security-and-privacy-with-zkwasm-technology/?utm_source=rss&utm_medium=rss&utm_campaign=binance-labs-invests-in-delphinus-lab-advancing-web3-security-and-privacy-with-zkwasm-technology",
    "description": "<img width=\"1600\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance Labs\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn.png 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-1536x864.png 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-24x14.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-36x20.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Binance-Coin-BNB-token-Burn-48x27.png 48w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />Binance Labs invests in Delphinus Lab, creator of zkWASM, enhancing security and trustless computation.  Delphinus Lab&#8217;s zkWASM Hub advances WASM applications. Binance Labs, the investment and incubation branch of Binance, has made a strategic move by investing in Delphinus Lab. The firm is renowned for creating the initial open-source zkWASM virtual machine, enabling trustless computation [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-22T13:00:04.000Z",
    "title": "Unlocking Passive Returns: The Magic of Lido DAO, Compound, Everlodge",
    "url": "https://www.crypto-news-flash.com/unlocking-passive-returns-the-magic-of-lido-dao-compound-everlodge/?utm_source=rss&utm_medium=rss&utm_campaign=unlocking-passive-returns-the-magic-of-lido-dao-compound-everlodge",
    "description": "<img width=\"512\" height=\"329\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-97.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-97.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-97-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The world of decentralized finance (DeFi) offers innovative avenues for generating passive returns. Among these, Lido DAO (LDO), Everlodge (ELDG), and Compound (COMP) offer exciting opportunities to earn a substantial return on investment. It&#8217;s particularly noteworthy to highlight that Everlodge, one of the potential game-changers in this space, is currently in its presale phase. Join [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-22T13:05:14.000Z",
    "title": "SEI Price Prediction 2023-2030: Will SEI Price Hit $0.2 Soon?",
    "url": "https://coinedition.com/sei-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Sei-(SEI)-Price-Prediction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Sei-SEI-Price-Prediction-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>What is SEI? Built upon a layer-1 blockchain architecture using the Cosmos SDK framework, the SEI network is tailored specifically for high-frequency trading applications. The Twin Turbo Consensus enables the network to process transactions at lower transaction costs and at industry-leading throughput. The company behind the SEI network, SEI Labs announced the launch of their [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sei-price-prediction/\">SEI Price Prediction 2023-2030: Will SEI Price Hit $0.2 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]