[
  {
    "source": "Cointelegraph",
    "date": "2023-10-24T19:00:00.000Z",
    "title": "Humans and AI often prefer sycophantic chatbot answers to the truth — study",
    "url": "https://cointelegraph.com/news/humans-ai-prefer-sycophantic-chatbot-answers-truth-study",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/b8e83a38-a1e4-4b5c-9262-f0f183b1cb2a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The team at Anthropic AI found that five “state-of-the-art” language models exhibit sycophancy, indicating the problem could be ubiquitous.</p>\n                    <p><p>Artificial intelligence (AI) large language models (LLMs) built on one of the most common learning paradigms have a tendency to tell people what they want to hear instead of generating outputs containing the truth. This, <a href=\"https://arxiv.org/abs/2310.13548\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to a study from Anthropic AI. </p><p>In one of the first studies to delve this deeply into the psychology of LLMs, researchers at Anthropic have determined that both humans and AI prefer so-called sycophantic responses over truthful outputs at least some of the time.</p><p>Per the team’s research paper:</p><blockquote>“Specifically, we demonstrate that these AI assistants frequently wrongly admit mistakes when questioned by the user, give predictably biased feedback, and mimic errors made by the user. The consistency of these empirical findings suggests sycophancy may indeed be a property of the way RLHF models are trained.”</blockquote><p>In essence, the paper from Anthropic indicates that even the most robust AI models are somewhat wishy-washy. During the team’s research, time and again, they were able to subtly influence AI outputs by wording prompts with language the seeded sycophancy.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">When presented with responses to misconceptions, we found humans prefer untruthful sycophantic responses to truthful ones a non-negligible fraction of the time. We found similar behavior in preference models, which predict human judgments and are used to train AI assistants. <a href=\"https://t.co/fdFhidmVLh\">pic.twitter.com/fdFhidmVLh</a></p>— Anthropic (@AnthropicAI) <a href=\"https://twitter.com/AnthropicAI/status/1716530002316132593?ref_src=twsrc%5Etfw\">October 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In the above example, taken from a post on X, a leading prompt indicates that the user (incorrectly) believes that the sun is yellow when viewed from space. Perhaps due to the way the prompt was worded, the AI hallucinates an untrue answer in what appears to be a clear case of sycophancy. </p><p>Another example from the paper, shown in the image below, demonstrates that a user disagreeing with an output from the AI can cause immediate sycophancy as the model changes its correct answer to an incorrect one with minimal prompting.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/9910c10f-74bb-44d5-a5cb-8da6081da475.jpg\"><figcaption style=\"text-align: center;\">Examples of sycophantic answers in response to human feedback. Image source: Sharma, et. al., 2023.</figcaption></figure><p>Ultimately, the Anthropic team concluded that the problem may be due to the way LLMs are trained. Because they use datasets full of information of varying accuracy — eg., social media and internet forum posts — alignment often comes through a technique called reinforcement learning from human feedback (RLHF). </p><p>In the RLHF learning paradigm, humans interact with models in order to tune their preferences. This is useful, for example, when dialing in how a machine responds to prompts which could solicit potentially harmful outputs such as personally identifiable information or dangerous misinformation. </p><p>Unfortunately, as Anthropic’s research empirically shows, both humans and AI models built for the purpose of tuning user preferences tend to prefer sycophantic answers over truthful ones, at least a “non-negligible” fraction of the time. </p><p>Currently, there doesn’t appear to be an antidote for this problem. Anthropic suggests that this work should motivate “the development of training methods that go beyond using unaided, non-expert human ratings.” </p><p>This poses an open challenge for the AI community as some of the largest models, including OpenAI’s ChatGPT, have been developed by <a href=\"https://thedeepdive.ca/openai-exploited-low-paid-african-workers-to-train-chatgpts-ai-system/#:~:text=According%20to%20explosive%20revelations%20made%20by%20Time%20magazine%2C,to%20train%20the%20algorithm%20to%20avoid%20toxic%20language.\" target=\"_blank\" rel=\"noopener nofollow\">employing</a>  large groups of non-expert human workers to provide RLHF.</p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-24T18:39:42.000Z",
    "title": "Bitcoin bulls fight to hold $34K as CME BTC open interest surpasses 100K",
    "url": "https://cointelegraph.com/news/bitcoin-bulls-fight-to-hold-34-k-cme-btc-open-interest-surpasses-100-k",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/070312c6-ddab-4b67-a009-5c53a034ae4e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A surge in CME BTC volumes and open interest highlight institutional investors' growing interest in Bitcoin. Will it be enough to keep the price in the current range?</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price currently battles to hold the $34,000 level after a stellar rally and short squeeze saw its price push above $35,000 on Oct. 23.</p><p>In an Oct. 24 market update, Capriole Investments founder Charles Edwards noted that after 7 months of consolidation, Bitcoin’s upward move melted the $32,000 resistance “like butter” and he expects that the upcoming monthly resistance is unlikely to be a hurdle. </p><p>Edwards <a href=\"https://capriole.com/update-7/\" target=\"_blank\" rel=\"noopener nofollow\">said</a>:</p><blockquote>“It would make sense to see either a rapid continuation to mid-range ($43K) or short-term consolidation between support resistance at $32-$35K before continuation.” </blockquote><p>As Cointelegraph mentioned in an earlier <a href=\"https://cointelegraph.com/news/bitcoin-price-near-31-k-pivot-point-can-btc-bulls-keep-the-volume\">price update</a>,</p><blockquote>“Successive daily closes above the $31,700 level would be notable, as daily or weekly higher high candles above this level puts the price above a key pivot point and enters territory not seen since May 2022.”</blockquote><p> Regarding the catalysts for this week’s price move, Edwards agrees that the recent fervor over what looks to be a sooner-than-later SEC approval of a spot Bitcoin ETF is contributing to the rally, but he also cites a handful of other near-term factors. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/4df492a2-17e8-44f9-9672-9adcec0dab82.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin price catalysts. Source: Capriole Investments</em></figcaption></figure><p>LayerTwo Labs founder Paul Sztorc concurred, saying, “I think we’re seeing meaningful inklings of a broader decoupling of Bitcoin from equities, and this divergence of sorts has taken a lot of market participants by surprise”</p><p>Potential concerns related to “foreign conflict and rising macroeconomic uncertainty, expectations among traders had been focused on a forthcoming dip that ultimately didn’t materialize.”But Sztorc explained that during the U.S. regional banking crisis the market underwent “a similar divergence” which resulted in “Bitcoin outperforming then as well.”</p><p>Sztorc believes that the bulk of the recent divergent price action is “a lot of traders and investors are now accumulating ahead of that event.” </p><blockquote>“I also think there are expectations that the Federal Reserve will likely have to start easing monetary policy soon because of the issue of rapidly rising yields. More specifically, traders are probably anticipating this easing by way of the Fed having to revert to some form of yield-curve control, the consequences of which tends to be monetary debasement.” </blockquote><h2>CME Bitcoin open interest surpasses 100,000 BTC</h2><p>Further proof that institutional investors are warming up to Bitcoin and the idea that a spot BTC ETF will be approved comes from the CME where BTC open interest hit a new record above 100,000 BTC. Beyond the bare price speculation, the takeaway here is that if institutional investors are accumulating spot Bitcoin, they then need to hedge this position, hence the surge in volumes and open interest seen at CME and other places. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">CME BTC futures OI has breached 100k BTC for the first time ever.<br><br>While offshore perp OI shrank by 26,735 BTC yesterday, CME&#39;s OI grew by 4,380 BTC. <a href=\"https://t.co/kjKBRYCoSX\">pic.twitter.com/kjKBRYCoSX</a></p>&mdash; Vetle Lunde (@VetleLunde) <a href=\"https://twitter.com/VetleLunde/status/1716722605846061145?ref_src=twsrc%5Etfw\">October 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-10-24T19:07:41.000Z",
    "title": "World Bank Tokenizes $100 Million Bond on Euroclear’s New Blockchain Solution",
    "url": "https://cryptobriefing.com/world-bank-tokenizes-bond-euroclears-blockchain-solution/?utm_source=feed&utm_medium=rss",
    "description": "The World Bank issued a $105M digital bond on Euroclear's new blockchain platform, the first use of its tokenization service for securities."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-24T19:08:30.000Z",
    "title": "FTX cooperators unlikely to see jail time, says ex-prosecutor",
    "url": "https://crypto.news/ftx-cooperators-unlikely-to-see-jail-time-says-ex-prosecutor/",
    "description": "Former Southern District of New York prosecutor Josh Naftali said Caroline Ellison, Gary Wang and Nishad Singh will probably skip time behind bars due to their cooperation with federal attorneys in United States v Sam Bankman-Fried."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-24T19:00:50.000Z",
    "title": "Bitcoin Break Above $35,000 Sends 95,000 Crypto Traders To The Slaughter",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-35000-95000-crypto-traders/",
    "description": "Following reports of BlackRock’s Spot Bitcoin ETF being listed on the Depository Trust &#38; Clearing Corporation (DTCC) with the ticker IBTC, the BTC price had rallied above $35,000 based on investor expectations alone. The quick nature of this surge saw tens of thousands of crypto traders caught in the crossfire as over $400 million was liquidated in one day. More Than 95,000 Crypto Traders Lose Their Positions According to data from Coinglass, the crypto liquidation volumes ramped up quickly following the Bitcoin price surge. The platform reports that almost 95,000 traders were liquidated, with short traders bearing the brunt of these liquidation trends. Related Reading: This Shibarium Milestone Could Rocket Shiba Inu To August Highs Of the $400 million liquidated in the 24-hour period, short traders accounted for 75.83 which came out to $303 million. Long traders were, however, not left out of the onslaught as $96.88 million in liquidation volumes still came from long positions despite the direction of the crypto market rally. BTC liquidations cross $222 million &#124; Source: Coinglass The single largest liquidation order took place on the BTCUSDT pair on the Binance crypto exchange. This trader lost an eye-popping $9.98 million when their position was liquidated. In the same vein, Binance has also seen the highest liquidation volumes of all crypto exchanges with $133.88 million. Bitcoin accounts for the overwhelming majority of liquidation volumes at $222.93 million. Ethereum comes second with $59.93 million in liquidation volumes. Solana clinched the third place with $10.35 million. But interestingly, Trellor (TRB), a low-cap altcoin that just made it into the top 200, snagged 4th place with $9.40 million in liquidations. The altcoin has been one of the most impressive performers through the market action as well, rising from a range of $50 to $96 before retracing. Bitcoin Shows Strength Although Bitcoin has since retraced from its 2023 high of $35,000, the leading cryptocurrency continues to show dominance. Daily trading volumes have already risen above $46 billion, which means that investors are coming back into the cryptocurrency en masse. This suggests a willingness to purchase Bitcoin at higher prices and this will continue to prop up its price. Since buyers currently outnumber sellers in this market, it is more likely that the Bitcoin retracement is only temporary and a restart of the price surge can send BTC above $36,000 next. Related Reading: Solana Remains Institutional Investor Darling As Inflows Continue Also, BlackRock’s ETF listing on the DTCC remains very fresh and is still providing fuel for the rally. This will likely continue for another couple of hours before exhaustion kicks in and leaves ample time for Bitcoin to regain its footing for another surge. If Bitcoin crosses $36,000, then liquidation volumes are expected to rise even more. This could lead to one of the worst liquidation trends in 2023. BTC price still holds steady above $34,000 &#124; Source: BTCUSD on Tradingview.com Featured image from YouHolder, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-24T19:05:09.000Z",
    "title": "BlackRock’s ETF and Grayscale’s Victory: Bitcoin Hits $35,000 – Is $30,000 or $40,000 Next? ",
    "url": "https://www.crypto-news-flash.com/blackrocks-etf-and-grayscales-victory-bitcoin-hits-35000-is-30000-or-40000-next/?utm_source=rss&utm_medium=rss&utm_campaign=blackrocks-etf-and-grayscales-victory-bitcoin-hits-35000-is-30000-or-40000-next",
    "description": "<img width=\"1280\" height=\"890\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-6856507_1280.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-6856507_1280.png 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-6856507_1280-300x209.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/bitcoin-6856507_1280-1024x712.png 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />The crypto market makes a bullish run as altcoins continue the upward trajectory.  According to a crypto analyst, five main factors have triggered this rally.  The past couple of days have seen the crypto market recording significant gains with Bitcoin (BTC) up by 11 percent, Cardano up by 9 percent, and Polygon up by 7 [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-24T18:45:38.000Z",
    "title": "One Ethereum Rival Gained Steam in Q3 2023, According to Binance Research",
    "url": "https://dailyhodl.com/2023/10/24/one-ethereum-rival-gained-steam-in-q3-2023-according-to-binance-research/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/eth-rival-q3.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/eth-rival-q3.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/eth-rival-q3.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/eth-rival-q3.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/eth-rival-q3.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/eth-rival-q3.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/eth-rival-q3.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A new report from Binance Research claims that one Ethereum (ETH) competitor ignored the greater crypto market trend and witnessed a surge in activity in the third quarter of this year. Researchers at the top global crypto exchange by trading volume note that the smart contract platform NEAR Protocol (NEAR) clocked 120% quarter-on-quarter growth in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/24/one-ethereum-rival-gained-steam-in-q3-2023-according-to-binance-research/\">One Ethereum Rival Gained Steam in Q3 2023, According to Binance Research</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-24T18:41:50.000Z",
    "title": "Over $431,000,000 in Liquidations As Bitcoin (BTC) Blasts Through $34,000 Resistance",
    "url": "https://dailyhodl.com/2023/10/24/over-431000000-in-liquidations-as-bitcoin-btc-blasts-through-34000-resistance/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/btc-megaphone-pattern.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/btc-megaphone-pattern.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/btc-megaphone-pattern.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/btc-megaphone-pattern.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/btc-megaphone-pattern.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/btc-megaphone-pattern.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/btc-megaphone-pattern.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The digital assets markets are witnessing massive liquidations as Bitcoin (BTC) leads crypto on a massive rally. According to data from the crypto data aggregator Coinglass, over $480 million has been liquidated from the crypto markets in the last 24 hours. Over the same period, BTC has risen 9.4%, trading at $33,913 at time of writing. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/24/over-431000000-in-liquidations-as-bitcoin-btc-blasts-through-34000-resistance/\">Over $431,000,000 in Liquidations As Bitcoin (BTC) Blasts Through $34,000 Resistance</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]