[
  {
    "source": "CoinDesk",
    "date": "2023-08-28T14:51:14.000Z",
    "title": "Protocol Village: Binance Labs Invests in Delphinus, a Bet on Zero-Knowledge WebAssembly",
    "url": "https://www.coindesk.com/tech/2023/08/28/protocol-village-binance-labs-invests-in-delphinus-a-bet-on-zero-knowledge-webassembly/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades and announcements."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-28T14:43:47.000Z",
    "title": "Maui Strong: Hawaii Artist Teams Up With Decrypt for NFT Fundraiser",
    "url": "https://decrypt.co/153752/maui-strong-hawaii-nft-fundraiser",
    "description": "The crypto community is called to support Maui wildfire victims with an open-mint digital collectible designed by muralist Jasper Wong."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-28T15:04:46.000Z",
    "title": "Binance Imposes New Trading Restrictions on Russian Clients",
    "url": "https://cryptobriefing.com/binance-imposes-new-russia-restrictions/?utm_source=feed&utm_medium=rss",
    "description": "Amid a backdrop of a weakening ruble and increased global scrutiny, Binance refines its P2P trading guidelines for Russian users."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T15:00:59.000Z",
    "title": "The crypto week ahead – rate hikes on the horizon? September 2023 key indicators",
    "url": "https://www.cryptopolitan.com/crypto-week-ahead-sept-2023-key-indicators/",
    "description": "It was a relatively quiet week on Crypto Twitter (X), reflecting the week&#8217;s sluggish market news cycle. Nevertheless, this meant a much-needed recovery period for virtually every prominent crypto. On the other hand, Bitcoin begins the new week battling $26,000 as August becomes its worst month of 2023. How’s the crypto market performing? Following Judge ... <a title=\"The crypto week ahead – rate hikes on the horizon? September 2023 key indicators\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-week-ahead-sept-2023-key-indicators/\" aria-label=\"More on The crypto week ahead – rate hikes on the horizon? September 2023 key indicators\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T14:59:29.000Z",
    "title": "ChatGPT Predicts Shiba Inu (SHIB) Price Could Reach $0.1 by 2029 – Here’s Why",
    "url": "https://www.cryptopolitan.com/chatgpt-predicts-shiba-inu-shib-price/",
    "description": "In the ever-evolving landscape of cryptocurrencies, Shiba Inu (SHIB) has emerged as a notable contender, often making headlines for its potential price movements. The chatbot phenomenon, ChatGPT, has become a go-to source for insights into crypto asset predictions, and its recent projection regarding Shiba Inu&#8217;s price has captured the attention of the crypto community. ChatGPT&#8217;s ... <a title=\"ChatGPT Predicts Shiba Inu (SHIB) Price Could Reach $0.1 by 2029 &#8211; Here&#8217;s Why\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chatgpt-predicts-shiba-inu-shib-price/\" aria-label=\"More on ChatGPT Predicts Shiba Inu (SHIB) Price Could Reach $0.1 by 2029 &#8211; Here&#8217;s Why\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-28T14:47:45.000Z",
    "title": "Are We Ready to Battle AI Criminals Exploiting Generative AI?",
    "url": "https://www.cryptopolitan.com/battle-ai-criminals-exploiting-generative-ai/",
    "description": "In an era where technology evolves at an astonishing pace, the convergence of generative AI and cybercrime has given rise to a new breed of criminals: AI criminals. Leveraging the capabilities of AI-driven tools, these wrongdoers have found innovative ways to exploit vulnerabilities and manipulate both machines and humans. As AI continues to shape our ... <a title=\"Are We Ready to Battle AI Criminals Exploiting Generative AI?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/battle-ai-criminals-exploiting-generative-ai/\" aria-label=\"More on Are We Ready to Battle AI Criminals Exploiting Generative AI?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-28T15:00:47.000Z",
    "title": "CryptoQuant Discusses How Bitcoin Has Changed In Past 1 Year",
    "url": "https://www.newsbtc.com/bitcoin-news/cryptoquant-discusses-bitcoin-changed-past-year/",
    "description": "The on-chain analytics firm CryptoQuant has discussed how the Bitcoin market has changed during the past year. Bitcoin Has Been Going Through Some Changes Recently In a new post on X, CryptoQuant has broken down the changes that the cryptocurrency&#8217;s landscape has observed recently. The first would be that the US-based exchanges have been registering withdrawals, while the global platforms have seen growing holdings. The relevant on-chain indicator here is the &#8220;exchange reserve,&#8221; which keeps track of the total amount of Bitcoin stored inside the wallets of a centralized exchange or a group of exchanges. First, here is a chart that shows the trend in this metric for the foreign platforms: Looks like the value of the metric for these platforms is steadily going up &#124; Source: CryptoQuant on X The above graph shows that the Bitcoin exchange reserves for Binance, Bitfinex, and OKX have increased during the past year. In total, the indicator&#8217;s value for these non-US platforms has increased by 10% in this period. This increase would naturally suggest that these exchanges have seen net deposits in the last year. However, the exchange reserve for the US-based platforms paints a different picture. These platforms have seen a falling value of the indicator &#124; Source: CryptoQuant on X While the foreign exchanges have seen deposits, the platforms based in the US, such as Coinbase, Gemini, and Kraken, have observed declining reserves during the past year. In general, the reserves of these platforms have dropped by at least 30%, which is a very significant value. The opposite trends being followed by the two groups of exchanges could imply a migration of coins between them, with investors increasingly preferring the non-US platforms. Related Reading: The Great Bitcoin Comeback: Will Alpha Coin Retake $28,000 Before August Ends? The second change in the BTC market is that institutional investors have started displaying an accumulation behavior. &#8220;Considering the amount withdrawn and the deposit and withdrawal records of the wallets, institutions are continuously buying Bitcoin,&#8221; explains the analytics firm. CryptoQuant notes that in August alone, Gemini has seen a huge withdrawal of more than 20,000 BTC, which can be a sign that institutional investors are buying. A large amount of BTC has been withdrawn from Gemini &#124; Source: CryptoQuant on X Finally, there is a change in how market participants have been looking at the futures sector recently, as they have increased their exposure to derivative products. Related Reading: Bitcoin Whales Buy Dip, Addresses Now At Pre-Crash Levels The ratio of the trading volume of the asset between spot and derivative platforms has dropped to pretty low values recently, a sign that activity on the derivative exchanges is overwhelmingly more than on the spot ones. The ratio's value has been on the decline this year &#124; Source: CryptoQuant The open interest, a measure of the number of positions open on the derivative market, also showcases this change, as the metric&#8217;s value hit very high just recently. The open interest was at highest values since November just recently &#124; Source: CryptoQuant on X The chart shows that while the open interest was at highs just a while ago, it has since observed a plummet. The reason behind this plunge was the latest Bitcoin crash, which resulted in a cascade of liquidations in the market. BTC Price Bitcoin is trading around the $25,900 level, unchanged from one week ago, showing how stagnant the cryptocurrency has been recently. BTC remains locked in sideways movement &#124; Source: BTCUSD on TradingView Featured image from iStock.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-28T15:00:42.000Z",
    "title": "Pomerdoge (POMD) Leads P2E Gaming As The Sandbox (SAND) and Decentraland (MANA) Struggle To Stabilize Price",
    "url": "https://www.crypto-news-flash.com/pomerdoge-pomd-leads-p2e-gaming-as-the-sandbox-sand-and-decentraland-mana-struggle-to-stabilize-price/",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-148.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-148.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-148-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-148-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As digital gaming gains more traction in the crypto industry, Pomerdoge (POMD) has emerged with an innovative platform that ensures an immersive play-to-earn gaming experience. Meanwhile, The Sandbox (SAND) and Decentraland (MANA) tokens are pushing to overcome the bear market. Let&#8217;s examine the market activity of these two tokens and why Pomerdoge is leading the [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-28T15:02:00.000Z",
    "title": "Top 5 NFT Collections Sales Slump Further Amid Market Crash",
    "url": "https://coinedition.com/top-5-nft-collections-sales-slump-further-amid-market-crash/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Top-5-NFT-Collections-Sales-Slump-Further-Amid-Market-Crash.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Top-5-NFT-Collections-Sales-Slump-Further-Amid-Market-Crash.png 730w, https://coinedition.com/wp-content/uploads/2023/08/Top-5-NFT-Collections-Sales-Slump-Further-Amid-Market-Crash-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/08/Top-5-NFT-Collections-Sales-Slump-Further-Amid-Market-Crash-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/08/Top-5-NFT-Collections-Sales-Slump-Further-Amid-Market-Crash-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/08/Top-5-NFT-Collections-Sales-Slump-Further-Amid-Market-Crash-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/08/Top-5-NFT-Collections-Sales-Slump-Further-Amid-Market-Crash-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/08/Top-5-NFT-Collections-Sales-Slump-Further-Amid-Market-Crash-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/08/Top-5-NFT-Collections-Sales-Slump-Further-Amid-Market-Crash-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/08/Top-5-NFT-Collections-Sales-Slump-Further-Amid-Market-Crash-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/08/Top-5-NFT-Collections-Sales-Slump-Further-Amid-Market-Crash-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/08/Top-5-NFT-Collections-Sales-Slump-Further-Amid-Market-Crash-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/08/Top-5-NFT-Collections-Sales-Slump-Further-Amid-Market-Crash-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/08/Top-5-NFT-Collections-Sales-Slump-Further-Amid-Market-Crash-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/08/Top-5-NFT-Collections-Sales-Slump-Further-Amid-Market-Crash-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/08/Top-5-NFT-Collections-Sales-Slump-Further-Amid-Market-Crash-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/08/Top-5-NFT-Collections-Sales-Slump-Further-Amid-Market-Crash-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The top five NFTs by market capitalization experienced a significant sales drop in the past 24 hours, according to data from CoinMarketCap. The development further compounds the continued crash of the overall NFT market, which was highly energized in the last few years. The NFTs in question include BoredApeYachtClub, MineablePunks, Dreadfulz, MutantApeYachtClub, and DeGods. BoredApeYachtClub [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/top-5-nft-collections-sales-slump-further-amid-market-crash/\">Top 5 NFT Collections Sales Slump Further Amid Market Crash</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]