[
  {
    "source": "CoinDesk",
    "date": "2023-08-23T12:14:55.000Z",
    "title": "First Mover Americas: Bitcoin Hovers Below $26K ",
    "url": "https://www.coindesk.com/markets/2023/08/23/first-mover-americas-bitcoin-hovers-below-26k/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for August 23, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-23T12:01:10.000Z",
    "title": "Odds SEC Approves a Spot Bitcoin ETF Are 'Better Than 50/50', Says Marathon Digital CEO",
    "url": "https://decrypt.co/153450/odds-sec-approves-spot-bitcoin-etf-are-better-than-50-50-says-marathon-digital-ceo",
    "description": "Fred Thiel reckons the SEC’s approval of Ethereum futures ETFs will also increase chances for a spot Bitcoin ETF approval."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-23T11:49:58.000Z",
    "title": "Balancer Lauded for 'Excellent Communication' of Multi-Million-Dollar Vulnerability",
    "url": "https://decrypt.co/153451/balancer-laudedexcellent-communication-multi-million-dollar-vulnerability",
    "description": "Balancer disclosed a critical vulnerability, safely protecting user funds while also keeping the markets cool. "
  },
  {
    "source": "Decrypt",
    "date": "2023-08-23T11:09:47.000Z",
    "title": "It’s Now Harder Than Ever to Mine Bitcoin",
    "url": "https://decrypt.co/153448/its-now-harder-than-ever-mine-bitcoin",
    "description": "Mining appears to be getting more popular, but don’t look to Bitcoin’s price to understand why."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-23T12:30:00.000Z",
    "title": "Here’s what the latest Bitcoin price correction reveals",
    "url": "https://cointelegraph.com/news/latest-bitcoin-price-correction-reveals",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/e52998a8-61d9-48fc-be34-f4b9ea5eec46.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The latest episode of The Market Report analyses the recent Bitcoin price correction to $26,000 and what it reveals about the current market structure.</p>\n                    <p><p>In the latest episode of Cointelegraph’s <em>The Market Report,</em> analyst Marcel Pechman delves into Bitcoin’s recent drop to $26,000. <a href=\"https://cointelegraph.com/news/bitcoin-price-holds-26k-as-derivatives-data-hints-at-end-of-volatility-spike\">Derivatives market analysis</a> shows Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) options and futures metrics lack signs of professional traders going bearish, and while that doesn’t guarantee a quick return to $29,000 support, it reduces the chances of an extended correction.</p><p>Pechman presents a Kaiko data chart on BTC liquidity and volatility, which significantly decreased since the FTX collapse in November 2022. And with no liquidity issues or heightened volatility indicated, did the 11.4% mid-August price drop worsen conditions due to the largest futures liquidations since November 2022?</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/KDvd3du5zh0\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>Bitcoin futures premium settled at a neutral 6% after the recent $26,000 crash, signaling balanced demand between leveraged longs and shorts. This aligns with a neutral -7% to 7% BTC options skew, suggesting reasonable downside protection prices.</p><p>Reviewing another article, Pechman discusses <a href=\"https://cointelegraph.com/news/gold-backed-brics-currency-very-hard-to-deliver-lyn-alden\">macroeconomic analyst Lyn Alden’s take</a><a href=\"https://cointelegraph.com/news/gold-backed-brics-currency-very-hard-to-deliver-lyn-alden\"></a> on a common currency proposal among BRICS nations (Brazil, Russia, India, China and South Africa). Alden doesn’t see it succeeding — a view shared by Pechman. However, Alden notes a weakened United States dollar if BRICS use their own currencies for foreign trade, giving unconventional advice to crypto investors.</p><p>Listen to the full episode of <em>The Market Report</em> on the new <a href=\"https://www.youtube.com/@cointelegraphmarketresearch\" target=\"_blank\" rel=\"noopener nofollow\">Cointelegraph Markets &amp; Research YouTube channel</a>, and don’t forget to click “Like” and “Subscribe” to keep up-to-date with all our latest content.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-23T12:20:00.000Z",
    "title": "Iman Europe and The Agenda chat mental health, music, Web3 and The Homies DAO",
    "url": "https://cointelegraph.com/news/iman-europe-agenda-chat-mental-health-music-web3-homies-dao",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/28c8d3c9-fec0-41f8-9ffa-b603abe24a79.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Musician and The Homies DAO founder Iman Europe sat down with The Agenda podcast to discuss how her Web3-based project promotes wellness among music workers.</p>\n                    <p><p>Talk to any musician who has “made it,” and they’ll say that achieving fame is both a gift and a curse. While success in entertainment can obviously bring many positives, it also carries the pressure to stay relevant, the worry of constantly needing to stay connected to fans, and the loss of freedom and privacy that comes with being a regular Joe — all of which can be utterly exhausting. Add a jam-packed events schedule that robs artists of the time to detox and socialize, and fame begins to look like just as much a burden as it may be a blessing.</p><p>On the flip side, those aspiring to break through and finally go mainstream deal with the pressure of an uphill climb and the potential outcome that after all the struggle, there might not be a light at the end of the tunnel. </p><p>For this reason, <a href=\"https://cointelegraph.com/magazine/crypto-winter-can-take-toll-hodlers-mental-health/\">mental health</a>, wellness and feeling like one is plugged into a community are things all creators need to allocate time to, and The Homies DAO is focused on just that. </p><p>On Episode 17 of <em>The Agenda </em>podcast, hosts Ray Salmond and Jonathan DeYoung speak with singer and The Homies DAO founder Iman Europe about how the collective is using Web3 to bring artists together to focus on wellbeing. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/8c331a93-edd7-479e-a863-1012aa144553.jpg\"  /></figure><h2>A safe space for artists to breathe, relax and socialize </h2><p>During the conversation, Europe detailed how lonely being a musician can feel and how difficult it can be to maintain social connections, given that sometimes it seems like family members are constantly hitting you up for money and perks, and strangers you connect with might have the ulterior motive of getting special benefits thanks to their new-found friend’s fame. </p><blockquote>“I know a lot of artists felt very burnt out last year and felt like they couldn’t find their footing oftentimes because everything was moving so fast in Web3,” she said. “And so I saw the need for wellness in the space, and I also was needing it. I was juggling being an artist and the head of artist relations of Sound.xyz, and it was a lot. They were two full-time jobs, and I wasn’t making enough time for myself and my wellness, and I saw the effects of that.”</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">pro tip: give yourself the first hour of the day. unplugged, doing something that only you benefit from. gym, cleaning, reading, meditating, praying— anything for you. get up an hr earlier if you have to. because taking care of you makes it so much easier to take care of others.</p>&mdash; iman, the icon. (@ImanEurope) <a href=\"https://twitter.com/ImanEurope/status/1584575452672274432?ref_src=twsrc%5Etfw\">October 24, 2022</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>This inspired Europe to found The Homies DAO. “When I got to the end of the year, I knew I wanted to focus this year on wellness more and on being able to give that back to myself and also creating space for artists to do the same.”</p><p>When asked about the type of wellness and community activities Homies DAO members could participate in, Europe mentioned that the <a href=\"https://cointelegraph.com/learn/what-is-a-dao\"></a><a href=\"https://cointelegraph.com/learn/what-is-a-dao\">decentralized autonomous organization (DAO)</a> provides a safe space and community where <a href=\"https://cointelegraph.com/news/music-nfts-are-helping-independent-creators-monetize-and-build-a-fanbase\">creators participating in the music industry</a> can socialize, unwind, meditate, work out and engage in activity that offers a sense of community. </p><blockquote>“We’re hosting our first event at the end of this month, the Homies Hangout, where we’ll have different forms of wellness. So it’ll be physical wellness — we’ll start with exercise, riding the bikes and spinning. This will be hosted at Burn Cycling. So we’ll start off with that, and then we’ll take a break and then come back for a sound bath, which is spiritual wellness. And then we’ll do some affirmations, and we’ll have someone come in and lead a group therapy session where we can all kind of talk together and talk about mental wellness and different resources to bettering that.”</blockquote><p>As for the DAO’s future plans, “We plan to do a few things like monthly meetups like that, but also monthly meetups online where we’re able to just check in with each other and just have a space for that,” said Europe, adding: </p><blockquote>“We later plan to do like educational content and just creating different content to bring more people on-chain. We want to create and mint projects through our DAO with the artists, maybe based around wellness. And our hopes are later to expand to offline retreats for artists, artist residencies.” </blockquote><template data-ct-widget=\"buzzsprout\" data-buzzsprout-podcast-id=\"2096305\"></template><h2>The Homies aims to put the focus on people instead of the pursuit of profit</h2><p>Like a handful of the other crypto and Web3-focused DAOs in the space, The Homies DAO also has a <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible token (NFT)</a> collection, with holders entitled to DAO membership and various other perks. Generally, projects with tokens or NFTs also have to contend with price speculators and NFT investors who don’t contribute anything to the project.</p><p>On the matter, Europe said, “I didn’t want to make this speculative. I wanted to make this more so of a community. They are limited. I think we’ll only have 500 members total right now.” </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/youtube-releases-principles-for-working-with-ai-music-industry\"><strong><em>YouTube releases ‘principles’ for working with music industry on AI tech</em></strong></a></p><p>When asked why she’s not currently concerned with floor prices, increasing the collective’s size, or even partnering with blue-chip projects, Europe replied:</p><blockquote>“We’ll only have 500 because we really want to know each other, and we’re really trying to build a community, not just like a project. I think that’s the difference between a DAO and a project, is you want as many people to be on it as possible. But I think when we think of wellness, it is an intimate thing. And sometimes when you make it more about like clout and, I don’t know, speculation, it loses its truth, and it loses its power to really do what we want to do in this wellness.”</blockquote><p>To hear more from Iman Europe’s conversation with <em>The Agenda </em>— including details on some major future plans for The Homies DAO — listen to the full episode on <a href=\"https://cointelegraph.com/podcasts/the-agenda\">Cointelegraph’s Podcasts page</a>, <a href=\"https://podcasts.apple.com/us/podcast/the-agenda/id1659393166\" target=\"_blank\" rel=\"noopener nofollow\">Apple Podcasts</a> or <a href=\"https://open.spotify.com/show/6azmkkIXj5LQbxTRAbAqXS\" target=\"_blank\" rel=\"noopener nofollow\">Spotify</a>. And don’t forget to check out Cointelegraph’s <a href=\"https://cointelegraph.com/podcasts\">full lineup</a> of other shows! </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tokenizing-music-royalties-nfts-taylor-swift-3lau-nas-the-weeknd/\"><strong><em>Tokenizing music royalties as NFTs could help the next Taylor Swift</em></strong></a></p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-23T10:57:06.000Z",
    "title": "OpenAI gets lukewarm response to customized AI offering",
    "url": "https://cointelegraph.com/news/openai-gets-lukewarm-response-to-customized-ai-offering",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/0836f6ff-4163-4fb8-83cf-cf4b65a19ca0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The company said the fine-tuning facility and the training data used for fine-tuning are scrutinized via a moderation API and the GPT-4 powered moderation system.</p>\n                    <p><p>OpenAI has introduced the option of fine-tuning for GPT-3.5 Turbo, enabling <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/artificial-intelligence\">artificial intelligence (AI)</a> developers to enhance performance on specific tasks using dedicated data. However, developers have expressed criticism as well as excitement for the development.</p><p>OpenAI <a href=\"https://openai.com/blog/gpt-3-5-turbo-fine-tuning-and-api-updates\" target=\"_blank\" rel=\"noopener nofollow\">clarified</a> that through the process of fine-tuning, developers can customize the capabilities of GPT-3.5 Turbo according to their requirements. For example, a developer could fine-tune GPT-3.5 Turbo to create customized code or proficiently summarize legal documents in German, using a data set sourced from the client’s business operations.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">You can now fine-tune GPT-3.5-Turbo!<br><br>Seems like inference is significantly more expensive (8x more) though.<br><br>My guess is that anyone with the ability to deploy their own models won’t be swayed by this. <a href=\"https://t.co/p2LbSq4D2H\">https://t.co/p2LbSq4D2H</a></p>&mdash; Mark Tenenholtz (@marktenenholtz) <a href=\"https://twitter.com/marktenenholtz/status/1694084743321514468?ref_src=twsrc%5Etfw\">August 22, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The recent <a href=\"https://twitter.com/OpenAI/status/1694062483462594959\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a> has sparked a cautious response from developers. A comment attributed to an X user named Joshua Segeren said that while the introduction of fine-tuning to GPT-3.5 Turbo is intriguing, it’s not a comprehensive fix. Based on his observations, improving prompts, employing vector databases for semantic searches or transitioning to GPT-4 often yields better results than custom training. Furthermore, there are factors to consider, such as setup and ongoing maintenance costs.</p><p>The foundational GPT-3.5 Turbo models commence at a rate of $0.0004 per 1,000 tokens (the fundamental units processed by extensive language models). However, the refined versions through fine-tuning carry a higher cost of $0.012 per 1,000 input tokens and $0.016 per 1,000 output tokens. Additionally, an initial training fee linked to data volume applies. </p><p>This feature holds significance for enterprises and developers aiming to construct personalized user interactions. For instance, organizations can fine-tune the model to harmonize with their brand’s voice, ensuring that the chatbot exhibits a consistent personality and tone that complements the brand identity.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/uk-university-partners-with-ai-startup\"><strong><em>Top UK university partners with AI startup to analyze crypto market</em></strong></a><strong><em> </em></strong></p><p>In ensuring responsible use of the fine-tuning facility, the training data used for fine-tuning undergoes scrutiny via their moderation API and the GPT-4 powered moderation system. This is done to maintain the security attributes of the default model throughout the fine-tuning procedure. </p><p>The system strives to detect and eliminate potentially unsafe training data, thereby ensuring that the refined output aligns with OpenAI’s established security norms. It also means that OpenAI has a certain level of control over the data that users input into its models.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/openai-gets-lukewarm-response-to-customized-ai-offering&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-apple-devloping-pocket-ai-deep-fake-music-deal-hypnotize-gpt-4/\"><strong><em>AI Eye: Apple developing pocket AI, deep fake music deal, hypnotizing GPT-4</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-23T12:30:43.000Z",
    "title": "FBI warns crypto firms of North Korea move to cash out $40M in stolen Bitcoin",
    "url": "https://cryptoslate.com/fbi-warns-crypto-firms-of-north-koreas-move-to-cash-out-40m-in-stolen-bitcoin/",
    "description": "<p>The U.S. Federal Bureau of Investigation (FBI) warned crypto companies that North Korea may soon attempt to cash out some of its illegally acquired Bitcoin worth more than $40 million. In an Aug. 22 notice, the law enforcement agency revealed that North Korea-linked TraderTraitor-affiliated actors, including Lazarus Group and APT38, consolidated 1,580 BTC into six [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/fbi-warns-crypto-firms-of-north-koreas-move-to-cash-out-40m-in-stolen-bitcoin/\">FBI warns crypto firms of North Korea move to cash out $40M in stolen Bitcoin</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-23T11:30:20.000Z",
    "title": "Chamber of Digital Commerce assigns lawyer to argue against SEC in court as part of Coinbase case",
    "url": "https://cryptoslate.com/chamber-of-digital-commerce-assigns-counsel-to-appear-in-court-in-sec-vs-coinbase-lawsuit/",
    "description": "<p>The Chamber of Digital Commerce, a leading voice representing the trillion-dollar U.S. digital asset industry, is set to make a critical appearance in the SEC v Coinbase case, demonstrating the mounting tensions between regulatory bodies. As an Aug. 22 court filing indicates, the Chamber&#8217;s involvement signals a critical moment for the industry as law firm [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/chamber-of-digital-commerce-assigns-counsel-to-appear-in-court-in-sec-vs-coinbase-lawsuit/\">Chamber of Digital Commerce assigns lawyer to argue against SEC in court as part of Coinbase case</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-23T12:11:26.000Z",
    "title": "North Korea Selling $40M of BTC: Market Catastrophe or Simple Threat?",
    "url": "https://cryptobriefing.com/north-korea-selling-1580-btc/?utm_source=feed&utm_medium=rss",
    "description": "The FBI has zeroed in on $40 million in BTC related to state-sponsored North Korean hackers, warning off a potential sell-off."
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-23T12:31:23.000Z",
    "title": "Marathon CEO Thiel: Odds of SEC Approving Bitcoin ETF Better Than 50-50",
    "url": "https://www.cryptoglobe.com/latest/2023/08/marathon-ceo-thiel-odds-of-sec-approving-bitcoin-etf-better-than-50-50/",
    "description": "Fred Thiel, Chairman and CEO at Marathon Digital Holdings (NASDAQ: MARA), expressed his optimism in a recent interview with Decrypt regarding the potential approval of a spot Bitcoin exchange-traded fund (ETF) by the U.S. Securities and Exchange Commission (SEC). Here’s a breakdown of what Thiel shared with Decrypt: Thiel’s Optimism About Bitcoin ETF Approval: Thiel […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-23T12:08:20.000Z",
    "title": "$XRP: Crypto Analyst Explains Why XRP ‘Will Be Bigger Than You Think’",
    "url": "https://www.cryptoglobe.com/latest/2023/08/xrp-crypto-analyst-explains-why-xrp-will-be-bigger-than-you-think/",
    "description": "Earlier today, Ben Armstrong, a prominent figure in the cryptocurrency world, shared a video update about the importance of XRP with his over 1.45 million YouTube channel subscribers. Below is a breakdown of what Armstrong said about the XRP Ledger (XRPL) in this video: Nature and Functionality of XRPL The XRP Ledger is a public […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-23T11:23:04.000Z",
    "title": "Ethereum on the Edge: Analyst Foresees Potential Plunge Below $1,000",
    "url": "https://www.cryptoglobe.com/latest/2023/08/ethereum-on-the-edge-analyst-foresees-potential-plunge-below-1000/",
    "description": "Prominent cryptocurrency analyst Nicholas Mertens recently expressed concerns about the future trajectory of Bitcoin (BTC) and Ethereum (ETH), the two leading cryptocurrencies by market capitalization. Sharing his insights with the 511K subscribers of his YouTube channel, Mertens highlighted the absence of bullish momentum for both assets, suggesting that further market dips might be on the […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-23T11:58:00.000Z",
    "title": "\n                        Yuga Labs To End Support For OpenSea’s Seaport Protocol From 2024\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/yuga-labs-to-end-support-for-openseas-seaport-protocol-from-2024",
    "description": "\n                        <p dir=\"ltr\">Yuga Labs, the creators of the hugely popular NFT collection Bored Ape Yacht Club (BAYC), have announced they will be removing support for OpenSea&rsquo;s Seaport Protocol from February 2024.&nbsp;</p>\n<p dir=\"ltr\">OpenSea has made over $100 million in fees from collections such as Bored Ape Yacht Club, BAKC, Mutant Apes, and other prominent NFT collections.&nbsp;</p>\nYuga Labs To Block OpenSea&nbsp;\n<p dir=\"ltr\">Yuga Lab&rsquo;s decision to block OpenSea comes after OpenSea announced its decision to disable mandatory royalties for existing collections. OpenSea announced a slew of changes in a blog post published on the 17th of August. OpenSea had stated in its update,&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;We launched our Operator Filter so creators could restrict secondary sales to web3 marketplaces that enforce creator fees. But we relied on opt-in by the entire ecosystem, which didn&rsquo;t happen. So we&rsquo;re making a few changes to our approach to creator fees. Starting on Thursday, the 31st of August, 2023, we&rsquo;re moving to optional creator fees on OpenSea in an effort to better reflect the principles of choice and ownership that drive this decentralized ecosystem.&rdquo;</p>\n\n<p dir=\"ltr\">Yuga Lab&rsquo;s collections on OpenSea comprise nearly $5 billion worth of all-time traded value. Out of this, the Bored Ape Yacht Club alone has generated around $2 billion. The announcement makes Yuga Labs the latest NFT project to come out in opposition to OpenSea&rsquo;s controversial decision. Yuga Labs CEO Daniel Alegre, stated in a post on X,&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;Yuga Labs will begin the process of sunsetting support for OpenSea&rsquo;s SeaPort for all upgradable contracts and any new collections, with the aim of this being complete in February 2024 in tandem with OpenSea&rsquo;s approach. &ldquo;For as much as NFTs have been about users truly owning their digital assets, they&rsquo;ve also been about empowering creators. Yuga believes in protecting creator royalties so creators are properly compensated for their work.&rdquo;</p>\n\n<p dir=\"ltr\">A spokesperson for Yuga Labs stated that the company would be moving towards disallowing OpenSea&rsquo;s marketplace to trade any of its collections as they phase out royalties.&nbsp;</p>\nMove Panned By NFT Community&nbsp;\n<p dir=\"ltr\">OpenSea&rsquo;s sudden move has, not surprisingly, angered the NFT and digital art communities, with artists expressing their anger and disbelief at the decision. They have also criticized OpenSea&rsquo;s lack of respect and appreciation for the creators from whom it had profited off for years. One of the most prominent investors in OpenSea, Mark Cuban, has also criticized the move, posting on X.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;Not collecting and paying royalties on NFT sales is a HUGE mistake by OpenSea. It diminished trust in the platform and hurts the industry.&rdquo;</p>\n\n<p dir=\"ltr\">The company has also changed its OpenSea Pro fee structure and will be levying a 0.5% fee on listings and offers on the platform starting the 31st of August. At present, the 0.5% listing fee is only applicable in specific instances where the creator royalty is set to below 0.5% or if the collection does not meet specified thresholds.&nbsp;</p>\n<p dir=\"ltr\">The move could drive users to Blur, which recently surpassed OpenSea as the leading NFT marketplace by trading volume. Collections such as Bored Ape Yacht Club and CryptoPunks play a crucial role in contributing to the success of NFT marketplaces such as OpenSea. According to data from Ninjalerts, Yuga Lab&rsquo;s 30-day trading volume is 80% of the size of OpenSea&rsquo;s at $52.8 million. Meanwhile, OpenSea&rsquo;s 30-day volume is around $66.7 million.&nbsp;</p>\n\n<p dir=\"ltr\">&ldquo;Yuga&rsquo;s 30d volume is 80% the size of OpenSea&rsquo;s. This is the leverage that IP has over NFT Marketplaces. The NFT Marketplaces are dead without the most important IP Will this lead to walled garden marketplaces by IP owners? That&rsquo;s much more complicated, so I&rsquo;m not sure. Distributors can also create walled gardens. Is there any upside for OpenSea to work as an &ldquo;Authorized Reseller&rdquo; that maintains royalties for the top IP? Probably? It will be very difficult for these IP creators to make good marketplaces.&rdquo;</p>\n\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n                    "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-23T11:00:00.000Z",
    "title": "\n                        Citibank report touts CBDCs but ignores control concerns\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/citibank-report-touts-cbdcs-but-ignores-control-concerns",
    "description": "\n                        <p dir=\"ltr\">Citibank explores the potential of Central Bank Digital Currencies (CBDCs) to revamp securities settlements based on securities firms survey.&nbsp;</p>\n<p dir=\"ltr\">CBDCs are digital currencies backed by national central banks, and have caught Citibank's attention due to their promise for quicker and more efficient settlements for securities firms.</p>\n<p dir=\"ltr\">With securities transactions being a critical pillar of the global financial system, any improvement in settlement speed can have profound implications. CBDCs can potentially minimise delays, reduce costs, and mitigate the risks associated with traditional settlement methods.&nbsp;</p>\n<p dir=\"ltr\">Citibank recognises the potential of CBDCs to transform not just securities but other facets of banking as well. Its move resonates with a broader trend where financial institutions globally are turning their attention to digital currencies, particularly CBDCs, to streamline operations and enhance customer experiences.</p>\n<p dir=\"ltr\">However, while the prospects of CBDCs are promising, their full-scale implementation in securities settlements demands meticulous planning. Ensuring interoperability with existing systems, regulatory harmony, and the technological infrastructure to support vast transaction volumes are some areas that require thorough attention.</p>\nOpinion\n<p dir=\"ltr\">The Citibank survey highlights some of the perceived advantages of a central bank being able to wield its own central bank digital currency (CBDC). Of course, what wouldn&rsquo;t be a quicker settlement process than what already exists?</p>\n<p dir=\"ltr\">The survey findings point to institutions turning to CBDCs as well as other digital currencies in order to improve their overall capabilities. However, the key with alternative digital currencies will be whether institutions will be allowed a choice.</p>\n<p dir=\"ltr\">Global financial bodies and regulatory agencies are at last acknowledging the innovations brought to finance by cryptocurrencies, but this is always overshadowed by their perceived &lsquo;risks&rsquo; to the financial and banking system.</p>\n<p dir=\"ltr\">It needs to be made very clear. The only chance for the existing system, at least as far as governments and central banks are concerned, is a widespread implementation of CBDCs. Only with this kind of control will central banks be able to impose any kind of financial stricture they desire upon the citizenry.&nbsp;</p>\n<p dir=\"ltr\">The total control this would bestow to a central bank would allow it to &lsquo;switch off&rsquo; from the system any individuals who do not follow the bank&rsquo;s rules.</p>\n<p dir=\"ltr\">Many who might see this would perhaps think that this is a fantastical and dystopian future that can only be read about in science fiction books. Nevertheless, it can be seen that China has a social credit system already in place that allows the government to blacklist and punish individuals who do not toe the line.</p>\n<p dir=\"ltr\">Given the unbelievably disastrous state of all fiat-based economies across the world, total control of finances by governments and their central banks must be put in place to extract the last wealth of the people in order to prolong the fiat monetary system.</p>\n\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n\n                    "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-23T11:30:22.000Z",
    "title": "AI-Powered Solutions Can Help Crypto Traders Overcome ‘Cognitive Biases’ When Investing — Libertify CEO",
    "url": "https://news.bitcoin.com/ai-powered-solutions-can-help-crypto-traders-overcome-cognitive-biases-when-investing-libertify-ceo/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2313578731-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"AI-Powered Solutions Can Help Crypto Traders Overcome &#039;Cognitive Biases&#039; When Investing — Libertify CEO\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2313578731-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2313578731-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2313578731-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2313578731-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2313578731-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2313578731-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2313578731.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to Steve Rosenblum, the founder and CEO of Libertify, Artificial Intelligence (AI) driven investment solutions can assist investors in making &#x201C;timely adjustments to asset allocation.&#x201D; This means investors using such a solution will be able &#x201C;navigate the volatile crypto landscape while maintaining a balance between risk and potential returns.&#x201D; Using AI to Rebalance a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T12:09:24.000Z",
    "title": "Steer AI Development Toward Safe and Beneficial Outcomes, Rep Don Beyer",
    "url": "https://www.cryptopolitan.com/steer-ai-development-toward-safe-beneficial/",
    "description": "In the landscape of artificial intelligence (AI) technology, the question of effective regulation looms large. Rep. Don Beyer (D-VA) is at the forefront of this debate, a leading figure in the New Democratic Coalition&#8217;s A.I. Working Group. As the group strives to craft bipartisan policies that ensure responsible AI usage, Rep. Beyer is advocating for ... <a title=\"Steer AI Development Toward Safe and Beneficial Outcomes, Rep Don Beyer\" class=\"read-more\" href=\"https://www.cryptopolitan.com/steer-ai-development-toward-safe-beneficial/\" aria-label=\"More on Steer AI Development Toward Safe and Beneficial Outcomes, Rep Don Beyer\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T11:35:46.000Z",
    "title": "Australia’s CBDC still ‘some years away’, RBA warns of uncertainty",
    "url": "https://www.cryptopolitan.com/australias-cbdc-some-years-away/",
    "description": "The Reserve Bank of Australia (RBA) has stated that the possibility of introducing a central bank digital currency (CBDC) is still years away. The announcement follows the conclusion of a pilot investigation conducted by RBA in collaboration with the Digital Finance Cooperative Research Centre.&#160; In a report published today, both entities outlined that the study ... <a title=\"Australia&#8217;s CBDC still &#8216;some years away&#8217;, RBA warns of uncertainty\" class=\"read-more\" href=\"https://www.cryptopolitan.com/australias-cbdc-some-years-away/\" aria-label=\"More on Australia&#8217;s CBDC still &#8216;some years away&#8217;, RBA warns of uncertainty\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T11:32:52.000Z",
    "title": "Alfa Romeo Set to Unveil Long-Awaited Supercar After 16-Year Hiatus",
    "url": "https://www.cryptopolitan.com/alfa-romeo-unveils-new-supercar/",
    "description": "Italian automaker Alfa Romeo is gearing up for a momentous unveiling as it prepares to introduce its first supercar in over 16 years. The highly anticipated model is scheduled to debut at the end of this month, and the company is intriguingly encouraging enthusiasts to utilize artificial intelligence to visualize the forthcoming masterpiece. Reviving tradition: ... <a title=\"Alfa Romeo Set to Unveil Long-Awaited Supercar After 16-Year Hiatus\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alfa-romeo-unveils-new-supercar/\" aria-label=\"More on Alfa Romeo Set to Unveil Long-Awaited Supercar After 16-Year Hiatus\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T11:22:43.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 How much is Bitcoin (BTC) worth? Today, the price of Bitcoin stands at $25,955, with a 24-hour trading volume totalling $38.62 billion. It boasts a market capitalization of $507 billion and commands 47% of the cryptocurrency market. Over the past day, Bitcoin’s price experienced a decrease of 0.29%. Currently, there are ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T11:06:39.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T11:02:14.000Z",
    "title": "AI’s Promising Role in Predicting Certain Types of Cancer",
    "url": "https://www.cryptopolitan.com/ais-promising-role-in-predicting-cancer/",
    "description": "The world of healthcare is undergoing a significant transformation, with technology playing a pivotal role in reshaping how diseases are diagnosed and treated. One of the most promising advancements in this domain is the integration of Artificial Intelligence (AI) in predicting certain types of cancer. The rise of AI in healthcare Over the past few ... <a title=\"AI&#8217;s Promising Role in Predicting Certain Types of Cancer\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ais-promising-role-in-predicting-cancer/\" aria-label=\"More on AI&#8217;s Promising Role in Predicting Certain Types of Cancer\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-23T10:42:03.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-23T11:28:43.000Z",
    "title": "Binance and BNB top social trends amid manipulation allegations",
    "url": "https://crypto.news/binance-and-bnb-top-social-trends-amid-manipulation-allegations/",
    "description": "Binance and its native token BNB (BNB) social mentions increase as allegations of market manipulation gain momentum. Market intelligence platform Santiment disclosed that Binance ranks first among the fastest-rising trending topics in the crypto scene, with BNB securing the third&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-23T11:24:27.000Z",
    "title": "SUI price rises despite negative market trends",
    "url": "https://crypto.news/sui-price-rises-despite-negative-market-trends/",
    "description": "Sui token’s (SUI) price has struggled over the past month, falling to a one-month low of around $0.46 on Aug. 18 as almost the whole crypto market turned red.  However, as the asset’s social activity grew, SUI’s price turned green,&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-23T12:30:39.000Z",
    "title": "Bitcoin Mining Difficulty Hits New All-Time High As BTC Price Moves Sideways",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-mining-difficulty-hits-new-all-time-high-as-btc-price-moves-sideways/",
    "description": "Bitcoin price has been trading sideways in the past weeks, significantly declining from the $29,000 support. This bearish pattern spread panic among traders but has not deterred miners. Instead, Bitcoin mining participants appear to have increased. This is evident in the increased mining difficulty, which soared to a new record high. According to available data, Bitcoin mining difficulty surged 6.17% in the last week, alongside a spike in network activity on August 22. Bitcoin Mining Difficulty Spikes Up Amid Nosediving Prices While BTC price tanked by over 10% in a 7-day period, miners’ confidence remains at its peak. According to data from btc.com, this uptick marks the sixth-largest increase in Bitcoin mining difficulty in 2023. For context, Bitcoin mining difficulty measures the difficulty and time it takes to solve a complex cryptographic puzzle.  Related Reading: AVAX Network Activity Down – Will The Planned Token Unlock Bring Back The Energy? The Bitcoin network adjusts mining difficulty periodically depending on the number of miners onboard. The next difficulty adjustment date is about two weeks aways, with the estimated rate at 16.05%. Furthermore, the hash rate increases as more miners compete for limited Bitcoin block rewards, increasing mining difficulty.  Therefore, the uptick in mining difficulty suggests Bitcoin&#8217;s bearish price trajectory has not affected miners&#8217; profitability.  Increase In Hash Rates Reflects High Investor Confidence In Bitcoin  Hash rate and mining difficulty correlate; therefore, as the Bitcoin mining difficulty increases, the hash rate follows a similar trend. Although calculating the hash rate is tricky and challenging, the ongoing figure is about to break the existing record high of 538.05 EH/s.  In an August 22 report: CryptoQuant analyst MAC_D attributed the increased hash rate to high confidence in BTC and ETH network reliability and security among investors. MAC-D wrote: Recently the prices of BTC and ETH have fallen by 10%. However, the network security and reliability have increased. He also identified two plausible reasons behind the uptick in the hash rate. Firstly, the analyst explained that Bitcoin’s hash rate increased during the recent price decline. He said the observation depicts that miners became more active amid the downtrend. Secondly, MAC_D mentioned that staked ETH has increased despite the decline in Ether price. Nonetheless, the analyst believes the fall in price suggests BTC and ETH have become undervalued. And according to him, this presents an opportunity for bullish investors to accumulate more assets in anticipation of the next bull run. This assumption must have prompted miners to increase their mining capacity, increasing the hash rate and difficulty. And data from the on-chain analytics platform Glassnode supports these claims.  Related Reading: Bitcoin Market Analysis: Key Price Levels And Metrics To Watch According to Glassnode data, there has been a slight increase in the number of BTC in the portfolios of mining firms. As of August 22, miners&#8217; BTC holdings hovered over 1.83 million Bitcoin. This figure represents a 0.08% increase from the value at the beginning of August. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-23T11:20:28.000Z",
    "title": "The $20 Billion Delay: Appeal Court Pushes Back Decision On Grayscale Spot Bitcoin ETF",
    "url": "https://www.newsbtc.com/bitcoin-news/grayscale-spot-bitcoin-etf/",
    "description": "The D.C. Circuit Court of Appeals was expected to give a ruling on Grayscale’s Spot Bitcoin ETF lawsuit against the United States Securities and Exchange Commission (SEC) on August 22 following its failure to do so on August 18. However, the crypto community would have to wait longer as the court has once again failed to make a decision. Court Delays Spot Bitcoin ETF Decision For The Third Time According to a tweet by Grayscale’s Chief Legal Officer Craig Salm, the appeal court failed to make a decision regarding his company’s lawsuit against the SEC. However, he pointed out that there were no rulings for that day in what might be a move to quench any notion that the court was intentionally stalling the case. Related Reading: Rumors Of Robinhood Listing XRP Take Center Stage On Crypto Twitter This marks the third delay of the much-anticipated verdict, as the court had previously been expected to give a decision on August 15 and then August 18. So it remains uncertain when a decision could come next as legal experts had earlier projected the court to give its verdict this month.  Grayscale’s lawsuit against the SEC dates back to last year when the company reportedly tried to persuade the Commission to convert its $20 billion Grayscale Bitcoin Trust (GBTC) to a Spot Bitcoin ETF, which the SEC rejected.  Following the rejection, Grayscale sued the regulator, arguing that it had acted indiscriminately by not giving its request the same treatment it does to similar investment funds.  Grayscale believes that Spot Bitcoin ETFs should be approved like Bitcoin futures ETFs. In its final oral argument in March, the crypto firm argued that the SEC’s disapproval order against it was contradictory. It emphasized the regulator’s inconsistency in denying a Spot Bitcoin ETF while approving a Bitcoin futures ETF. The company further argued that both investment vehicles pose the same risk of fraud and manipulation. It also stated that the pricing of both futures and spot bitcoin markets are “99.9% correlated,” which means they are subject to the same risk.  As such, since the SEC found the CME’s surveillance sharing agreement sufficient enough to protect against the risks in the futures market, it should be able to deem it sufficient to approve Spot Bitcoin ETFs. BTC struggles to hold bears at bay &#124; Source: BTCUSD on Tradingview.com Why Grayscale’s Case Could Be A Game Changer Grayscale is one of several financial firms that have applied to the SEC to offer a Spot Bitcoin ETF. Interestingly, the company filed this application while it awaits a decision from the court regarding its lawsuit against the SEC.  Related Reading: Is Binance Really Selling Bitcoin To Prop The Price Of BNB? However, considering that the SEC has remained reluctant to approve these applications, a verdict in favor of Grayscale could potentially force the hands of the Commission to finally approve a Spot Bitcoin ETF.  Such a verdict will undoubtedly be a boost for the crypto industry as it would pave the way for institutional investors to have direct access to crypto assets, something which could further spur the mass adoption of cryptocurrencies. Featured image from Coin Culture, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-23T12:30:42.000Z",
    "title": "IOTA Collaborates with Taiwan’s Government to Learn about Decentralized Identity (DID) from European Counterparts for Enhancing State Technology",
    "url": "https://www.crypto-news-flash.com/iota-collaborates-with-taiwans-government-to-learn-about-decentralized-identity-did-from-european-counterparts-for-enhancing-state-technology/?utm_source=rss&utm_medium=rss&utm_campaign=iota-collaborates-with-taiwans-government-to-learn-about-decentralized-identity-did-from-european-counterparts-for-enhancing-state-technology",
    "description": "<img width=\"5500\" height=\"3667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"IOTA\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1.jpg 5500w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-2048x1365.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-48x32.jpg 48w\" sizes=\"(max-width: 5500px) 100vw, 5500px\" />The Taiwan community holds a strong fondness for IOTA, as the government is looking to work along with IOTA in implementing decentralized ID solutions. IOTA is also working with European Union on its EDIC digital identity solution. Government institutions worldwide have been working on adopting decentralized identity solutions in order to provide greater security and [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-23T12:18:39.000Z",
    "title": "Putin Predicts US Dollar Decline, Could Bitcoin Rise in Response?",
    "url": "https://www.crypto-news-flash.com/putin-predicts-us-dollar-decline-could-bitcoin-rise-in-response/?utm_source=rss&utm_medium=rss&utm_campaign=putin-predicts-us-dollar-decline-could-bitcoin-rise-in-response",
    "description": "<img width=\"1280\" height=\"850\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-4406851_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Brazil\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-4406851_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-4406851_1280-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-4406851_1280-1024x680.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-4406851_1280-768x510.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/bitcoin-4406851_1280-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />President Vladimir Putin of Russia has predicted a further decline for the US Dollar.  There are permutations that Bitcoin can also replace the Dollar in the near term. The United States Dollar has been under threat lately with many nations trying to reduce their dependence on the currency.  For as long as one can remember, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-23T11:45:18.000Z",
    "title": "Stellar Lumens: Reserve Bank of Australia’s CBDC Pilot Shows Potential for Improved Payments and Tokenization",
    "url": "https://www.crypto-news-flash.com/stellar-lumens-reserve-bank-of-australias-cbdc-pilot-shows-potential-for-improved-payments-and-tokenization/?utm_source=rss&utm_medium=rss&utm_campaign=stellar-lumens-reserve-bank-of-australias-cbdc-pilot-shows-potential-for-improved-payments-and-tokenization",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-2048x1152.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-48x27.jpg 48w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />The Reserve Bank of Australia has identified four key areas that a CBDC could bolster after the completion of its pilot phase. Stellar Lumens could play a key role in its launch as it offers improved payment services and infrastructure for tokenization. The Reserve Bank of Australia has released a 44-page report detailing several use [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-23T11:25:34.000Z",
    "title": "Ripple’s SEC Appeal: Lawyers Warn of Misstep in Regulatory Showdown – XRP News",
    "url": "https://www.crypto-news-flash.com/ripples-sec-appeal-lawyers-warn-of-misstep-in-regulatory-showdown-xrp-news/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-sec-appeal-lawyers-warn-of-misstep-in-regulatory-showdown-xrp-news",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T092410.947.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ripple\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T092410.947.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T092410.947-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T092410.947-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Greg Beuke argued that the SEC failed to understand that it did not provide enough evidence to prove that XRP is a security. While the SEC wants its motion for an appeal approved, Ripple wants both the appeal and case to continue in parallel. The SEC vs Ripple case could take a different turn if [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-23T11:21:45.000Z",
    "title": "Dogecoin Prediction High, Overtake Cardano: Could Solana Be Next? Elonator Comes Out Swinging With Its Presale",
    "url": "https://www.crypto-news-flash.com/dogecoin-prediction-high-overtake-cardano-could-solana-be-next-elonator-comes-out-swinging-with-its-presale/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoin-prediction-high-overtake-cardano-could-solana-be-next-elonator-comes-out-swinging-with-its-presale",
    "description": "<img width=\"1600\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/fdfddf.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/fdfddf.png 1600w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/fdfddf-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/fdfddf-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/fdfddf-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/fdfddf-1536x864.png 1536w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" />Dogecoin (DOGE) has been at the forefront of meme coins. With it recently crossing Cardano (ADA), Dogecoin proved to be an immense force to be reckoned with. Now that it has crossed Cardano, many wonder if Solana (SOL) has what it takes to reach the top. With Solana&#8217;s market cap trailing Cardano&#8217;s by half a [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-23T10:40:12.000Z",
    "title": "Galaxis Leverages Chainlink CCIP to Pioneer Cross-Chain Token-Gated Communities Amid Regulatory Hurdles",
    "url": "https://www.crypto-news-flash.com/galaxis-leverages-chainlink-ccip-to-pioneer-cross-chain-token-gated-communities-amid-regulatory-hurdles/?utm_source=rss&utm_medium=rss&utm_campaign=galaxis-leverages-chainlink-ccip-to-pioneer-cross-chain-token-gated-communities-amid-regulatory-hurdles",
    "description": "<img width=\"1200\" height=\"630\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Chainlink X SWIFT\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK.jpeg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-300x158.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-1024x538.jpeg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-768x403.jpeg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-351x185.jpeg 351w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-24x13.jpeg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-36x19.jpeg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/07/Chainlink-LINK-48x25.jpeg 48w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Galaxis has partnered with Chainlink CCIP to leverage its numerous benefits and features.  Galaxis has already used Chainlink&#8217;s Verifiable Random Function (VRF) to generate lucky draws, random distribution, etc. Web3 platform Galaxis has announced to be leveraging the messaging functionality of Chainlink&#8217;s Cross-Chain Interoperability Protocol (CCIP) to create a cross-chain digital membership card. Chainlink BUILD [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-23T11:21:18.000Z",
    "title": "NFT-Fi, the Connection Between NFTs and DeFi",
    "url": "https://www.altcoinbuzz.io/defi/nft-fi-the-connection-between-nfts-and-defi/",
    "description": "<p>NFTs and DeFi are starting to work together. More and more Dapps in the DeFi space have started to use NFTs in their products. For example, RWA tokenizes real-world assets. These tokens are NFTs. But we see more use cases for NFTs in the DeFi space. So, that&#8217;s why we are taking a closer look [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/defi/nft-fi-the-connection-between-nfts-and-defi/\">NFT-Fi, the Connection Between NFTs and DeFi</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-23T10:55:13.000Z",
    "title": "What is the Relation Between BRICS and Ripple (XRPL)?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/what-is-the-relation-between-brics-and-ripple-xrpl/",
    "description": "<p>While the BRICS acronym is a familiar term denoting a group of five major emerging economies. Brazil, Russia, India, China, and South Africa. Its connection with the blockchain sphere, particularly XRPL, has piqued the curiosity of many. To understand this unique partnership, we must delve into the documents, discussions, and aspirations that have brought BRICS [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/what-is-the-relation-between-brics-and-ripple-xrpl/\">What is the Relation Between BRICS and Ripple (XRPL)?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-23T12:24:00.000Z",
    "title": "FriendTech Top 25 Accounts Rake in High Earnings in 12 Days: Report",
    "url": "https://coinedition.com/friendtech-top-25-accounts-rake-in-high-earnings-in-12-days-report/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/05/CertiK-Alert-Reports-Bitpaid-Faces-81-Drop-And-30K-Loss-Due-to-Exploit.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"CertiK Alert Reports Bitpaid Faces 81% Drop And $30K Loss Due to Exploit\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/05/CertiK-Alert-Reports-Bitpaid-Faces-81-Drop-And-30K-Loss-Due-to-Exploit.jpg 730w, https://coinedition.com/wp-content/uploads/2023/05/CertiK-Alert-Reports-Bitpaid-Faces-81-Drop-And-30K-Loss-Due-to-Exploit-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/05/CertiK-Alert-Reports-Bitpaid-Faces-81-Drop-And-30K-Loss-Due-to-Exploit-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/05/CertiK-Alert-Reports-Bitpaid-Faces-81-Drop-And-30K-Loss-Due-to-Exploit-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/05/CertiK-Alert-Reports-Bitpaid-Faces-81-Drop-And-30K-Loss-Due-to-Exploit-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/05/CertiK-Alert-Reports-Bitpaid-Faces-81-Drop-And-30K-Loss-Due-to-Exploit-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Days after its beta launch, top users on the Social Fi platform FriendTech are already raking in high earnings through royalties, according to a CoinGecko analysis. The report shows the earnings of the top 25 earners on the platform from August 10 to August 22, 2023. Per the report, the top account has earned over [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/friendtech-top-25-accounts-rake-in-high-earnings-in-12-days-report/\">FriendTech Top 25 Accounts Rake in High Earnings in 12 Days: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-23T12:15:09.000Z",
    "title": "APENFT (NFT) Price Prediction 2023-2030: Will NFT Price Hit $0.00000065 Soon?",
    "url": "https://coinedition.com/apenft-nft-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/APENFT-NFT-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"APENFT-(NFT)-Price-Prediction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/APENFT-NFT-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/APENFT-NFT-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/APENFT-NFT-Price-Prediction-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/APENFT-NFT-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/APENFT-NFT-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/APENFT-NFT-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bullish APENFT (NFT) price prediction ranges from $0.0000003100 to $0.0000006600 Analysis suggests that the NFT price might reach above $0.00000065. The NFT bearish market price prediction for 2023 is $0.0000002900. There are other digital currencies besides Bitcoin (BTC) and Ethereum (ETH) that people who want to diversify their portfolios and learn more about cryptocurrencies should [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/apenft-nft-price-prediction/\">APENFT (NFT) Price Prediction 2023-2030: Will NFT Price Hit $0.00000065 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-23T11:55:00.000Z",
    "title": "Base Exceeds Ethereum Daily Transactions, Thanks to FriendTech",
    "url": "https://coinedition.com/base-exceeds-ethereum-daily-transactions-thanks-to-friendtech/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/04/Analyst-Shares-Before-Buying-Ethereum.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Analyst Shares Before Buying Ethereum\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/04/Analyst-Shares-Before-Buying-Ethereum.jpg 730w, https://coinedition.com/wp-content/uploads/2023/04/Analyst-Shares-Before-Buying-Ethereum-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/04/Analyst-Shares-Before-Buying-Ethereum-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/04/Analyst-Shares-Before-Buying-Ethereum-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/04/Analyst-Shares-Before-Buying-Ethereum-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/04/Analyst-Shares-Before-Buying-Ethereum-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Brian Armstrong, CEO at Coinbase, shared on X how Base hit 16 transactions per second. Armstrong believed that most of the credit went to FriendTech, the latest DeFi social app. Base’s transactions exceeding Ethereum were fueled mainly by the hype around the latest social app, FriendTech. Base is a new Ethereum L2 by Coinbase, the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/base-exceeds-ethereum-daily-transactions-thanks-to-friendtech/\">Base Exceeds Ethereum Daily Transactions, Thanks to FriendTech</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-23T11:36:00.000Z",
    "title": "Aptos’ New Token Standard: A Catalyst for APT Recovery?",
    "url": "https://coinedition.com/aptos-new-token-standard-a-catalyst-for-apt-recovery/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/aptos-7.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/aptos-7.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/aptos-7-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/aptos-7-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/aptos-7-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/aptos-7-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/aptos-7-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/aptos-7-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/aptos-7-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/aptos-7-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/aptos-7-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/aptos-7-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/aptos-7-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/aptos-7-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/aptos-7-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/aptos-7-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/aptos-7-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The Aptos blockchain recently introduced its Digital Asset (DA) standard for tokens and NFTs on its network. This new standard aims to provide enhanced flexibility, scalability, and interoperability compared to existing token models. In a series of tweets, the Aptos team explained how the DA standard improves upon limitations in previous token frameworks like Ethereum&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/aptos-new-token-standard-a-catalyst-for-apt-recovery/\">Aptos&#8217; New Token Standard: A Catalyst for APT Recovery?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-23T11:15:00.000Z",
    "title": "Hoskinson Elaborates the Role of Mithril in Bootstrapping Blockchains",
    "url": "https://coinedition.com/hoskinson-elaborates-the-role-of-mithril-in-bootstrapping-blockchains/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Charles-Hoskinson-Responds-to-Fabio.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Charles Hoskinson Responds to Fabio\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Charles-Hoskinson-Responds-to-Fabio.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Charles-Hoskinson-Responds-to-Fabio-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Charles-Hoskinson-Responds-to-Fabio-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Charles-Hoskinson-Responds-to-Fabio-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Charles-Hoskinson-Responds-to-Fabio-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Charles-Hoskinson-Responds-to-Fabio-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a recent interview, Charles Hoskinson, the founder of Cardano, discussed a significant milestone within the Cardano ecosystem known as the Mithril upgrade. Hoskinson explained that Mithril represents an important advancement in a class of technologies that compresses significant historical data into a compact representation. According to him, this compressed representation proves valuable for tasks [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/hoskinson-elaborates-the-role-of-mithril-in-bootstrapping-blockchains/\">Hoskinson Elaborates the Role of Mithril in Bootstrapping Blockchains</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-23T10:42:00.000Z",
    "title": "DOGE Will Explode to $1 – $5 After Possible X Integration: Analyst",
    "url": "https://coinedition.com/doge-will-explode-to-1-5-after-possible-x-integration-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/doge02.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/doge02.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/doge02-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/doge02-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/doge02-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/doge02-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/doge02-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/doge02-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/doge02-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/doge02-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/doge02-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/doge02-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/doge02-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/doge02-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/doge02-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/doge02-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/doge02-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>There is a non-zero chance that Elon Musk integrates DOGE natively into X, according to Altcoin Daily, a crypto analysis platform operated by the Arnold brothers. In an X post, the Altcoin Daily account forecasted that if the Dogecoin integration happens, the DOGE price will explode. DOGE traded at $0.0628 at the time of writing, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/doge-will-explode-to-1-5-after-possible-x-integration-analyst/\">DOGE Will Explode to $1 &#8211; $5 After Possible X Integration: Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-23T11:45:56.000Z",
    "title": "Bitcoin Still on Track for Huge Bull Market Despite Losing Critical Support, According to Top Crypto Analyst",
    "url": "https://dailyhodl.com/2023/08/23/bitcoin-still-on-track-for-huge-bull-market-despite-losing-critical-support-according-to-top-crypto-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Still-on-Track.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Still-on-Track.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Still-on-Track.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Still-on-Track.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Still-on-Track.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Still-on-Track.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/Bitcoin-Still-on-Track.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular crypto analyst says that Bitcoin (BTC) remains on track for a massive bull cycle despite last week’s sudden price decline. Pseudonymous analyst Dave the Wave tells his 139,700 followers on the social media platform X that short-term indicators are not the most reliable predictors for BTC price given the current crypto market conditions. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/23/bitcoin-still-on-track-for-huge-bull-market-despite-losing-critical-support-according-to-top-crypto-analyst/\">Bitcoin Still on Track for Huge Bull Market Despite Losing Critical Support, According to Top Crypto Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]