[
  {
    "source": "Decrypt",
    "date": "2023-12-28T18:11:10.000Z",
    "title": "Blast Deposits Top $1.1 Billion Ahead of Ethereum L2 Launch and Airdrop",
    "url": "https://decrypt.co/211107/blast-deposits-top-1-1-billion-ahead-ethereum-l2-launch-airdrop",
    "description": "The Paradigm-backed Ethereum scaler’s rollout has been controversial, but that isn’t stopping users from buying in."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-28T18:10:00.000Z",
    "title": " Canadian Bitcoin miner Hive Digital completes $22M financing deal ",
    "url": "https://cointelegraph.com/news/canadian-bitcoin-miner-hive-digital-completes-22-million-financing-deal",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvMTQ3OTUwYWYtM2ViOC00ZDMyLTg3OTUtMDAxNThiODRiZTM5LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The company’s stock has recovered from the crypto winter with a gain of 244% year-to-date.</p>\n                    <p><p data-ct-non-breakable=\"true\">Hive Digital, a Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) miner based in Vancouver, Canada, has closed a $22-million private financing round.</p><p>According to the Dec. 28 <a href=\"https://www.globenewswire.com/news-release/2023/12/28/2801735/0/en/HIVE-Digital-Announces-Closing-of-28-75-Million-Bought-Deal-Private-Placement-Financing-to-HODL-Our-Bitcoin-Production-and-Expand-Green-Mining-Footprint.html\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>, the financing was concluded through the sale of 5.75 million special warrants for 5.00 Canadian dollars ($3.87) each, for total proceeds of 28.75 million CAD ($22 million). Each special warrant unit consists of one common stock of the company and half of the common share purchase warrant. Holders can exercise their warrant rights and purchase one Hive share at 6.0 CAD ($4.54) for every two warrants they own before Dec. 28, 2026. Hive Digital stock currently trades at $7.15 CAD ($5.41).</p><p>“The Company anticipates the net proceeds of the Offering will be used to support the growth of its Bitcoin mining footprint, as well as for working capital and general corporate purposes,” the company wrote. “HIVE also anticipates being able to HODL [Hold On for Dear Life] all its Bitcoin until the upcoming Halving.”</p><p><a href=\"https://cointelegraph.com/news/canadian-bitcoin-miner-hive-digital-completes-22-million-financing-deal\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-28T18:30:59.000Z",
    "title": "L2 Protocol Blast Soars Past $1 Billion in Locked Crypto Value",
    "url": "https://news.bitcoin.com/l2-protocol-blast-soars-past-1-billion-in-locked-crypto-value/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/blsddd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"L2 Protocol Blast Soars Past $1 Billion in Locked Crypto Value\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/blsddd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/blsddd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/blsddd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/blsddd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/blsddd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/blsddd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/blsddd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Statistics reveal that the Ethereum layer two (L2) platform Blast now secures over $1 billion within its protocol. The total value locked (TVL) in Blast has expanded more than twelvefold since its launch in late November. Blast&#x2019;s TVL Hits $1 Billion Initially, on Nov. 22, 2023, Blast&#x2019;s value locked was recorded at $89.59 million, but [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T18:30:37.000Z",
    "title": "Indonesia orders crypto exchanges to undergo registration",
    "url": "https://www.cryptopolitan.com/indonesia-crypto-exchanges-to-registration/",
    "description": "Indonesia has entered the global stage of cryptocurrency regulation with the launch of the Commodity Future Exchange (CFX), a pioneering move as the world’s first national exchange dedicated exclusively to crypto assets. This strategic development is a direct response to the escalating demand for cryptocurrencies within the nation, where official data from 2023 indicates that [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T18:23:29.000Z",
    "title": "Blast deposits hit $1.1 billion amid its February launch anticipation",
    "url": "https://www.cryptopolitan.com/blast-1-billion-amid-launch-anticipation/",
    "description": "Blast, the eagerly anticipated Layer 2 blockchain developed by the minds behind the non-fungible token (NFT) platform Blur, has recently achieved a significant milestone, surpassing $1.1 billion in deposits. This accomplishment comes even before the platform’s scheduled launch in February. Speculators seem undeterred by the controversial one-way bridge to Blast, as evidenced by the $1 [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T18:17:22.000Z",
    "title": "Ark Invest sells its remaining $200 million GBTC holdings",
    "url": "https://www.cryptopolitan.com/ark-invest-sells-200-million-gbtc-holdings/",
    "description": "ARK Invest, spearheaded by the influential Cathie Wood, has recently undertaken significant adjustments in its investment portfolio, signaling strategic moves within the rapidly evolving cryptocurrency landscape. On December 28, the institutional asset management firm decided to liquidate its entire remaining holdings in the Grayscale Bitcoin Trust (GBTC), amounting to a substantial $200 million. This move [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-28T18:16:50.000Z",
    "title": "Are we underestimating or overestimating the BRICS?",
    "url": "https://www.cryptopolitan.com/we-underestimating-or-overestimating-brics/",
    "description": "The BRICS bloc has long been a subject of debate in global economic circles. With recent expansions and heightened ambitions to challenge the U.S. dollar&#8217;s hegemony, one must ponder: are we underestimating their potential or overestimating their capabilities? The Dollar&#8217;s Dominance and BRICS&#8217; Challenge The U.S. dollar, a titan in the global financial arena, serves [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-28T18:15:09.000Z",
    "title": "Vitalik Buterin’s new proposal would cut Ethereum’s security",
    "url": "https://crypto.news/vitalik-buterins-new-proposal-would-cut-ethereums-security/",
    "description": "In a new proposal, Vitalik Buterin suggests decreasing the number of PoS validators from nearly 1 million to just 8,192 to reduce complexity."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-28T18:30:40.000Z",
    "title": "XRP Price Surge: ‘Dumb Money’ Will Miss Out, Analyst Cautions",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-price-surge-dumb-money/",
    "description": "Popular crypto analyst JD, known for predicting XRP&#8217;s bottom at the $0.28 price level, has warned of a batch of &#8216;dumb money&#8217; traders missing on the next XRP price surge. According to JD, this set of traders may overlook the opportunity to get on before the next price surge, drawing parallels to past XRP price action.  Analyst JD Draws Parallels To Past XRP Trends Despite the volatile nature of the crypto market, most cryptocurrencies are known to repeat or mirror past phenomena in their price action. As a result, it is very common for crypto analysts to look at the past and assess current trends when trying to predict the future movement of cryptocurrencies. Related Reading: Dogecoin Whale Moves 71 Million DOGE To Robinhood, What Does This Mean For Price? The expert compared the present price pattern to 2017, which was the year that XRP finally broke its boring price action that lasted from 2013 to 2017. A look through this cycle shows XRP underperforming when compared to other cryptocurrencies. As a result, the &#8216;dumb money&#8217; traders complained and bolted, causing them to miss the astounding gain that came after.  However, XRP would then go on a 600x price gain after breaking out of the 4-year consolidation trendline. As a result, the crypto reached as high as $3.84 in January 2018, its current all-time high. XRP has had its ups and downs this year stemming from different updates within the Ripple ecosystem. The crypto went on a price surge in the middle of the year, reaching a yearly high of $0.82 in July. XRP has traded below this price point since then, despite most cryptocurrencies registering new yearly highs in the last quarter of the year.  JD noted that XRP&#8217;s price action is currently mimicking the point at which it broke out of the consolidation in 2017, warning of &#8216;dumb money&#8217; traders who might miss out on the next potential price surge. #XRP &#8211; I remember 2017 when &#8220;Dumb money&#8221; capitulated after 4years of &#8220;boring emotional&#8221; action while other coins 🚀📈 &#8220;Dumb money&#8221; complained &#38; capitulated missing the 600x gain LOL! Present pattern looks exactly like 2017. Need more dumb money to complain before 🚀📈 LOL! $XRP… pic.twitter.com/tbyckfYA8V — JD 🇵🇭 (@jaydee_757) December 26, 2023 Token price sitting at $0.64  Source: XRPUSD On Tradingview.com XRP Price Target XRP has grown massively since its 2017 days and now has a market cap of over $34 billion. When asked about a potential price target, JD noted that the repeat of a 600x in the case of a breakout would be unrealistic at this point. An 8-10x surge is more likely according to the current technicals. With XRP currently trading at $0.639, a 10x price surge would make a price target just over $6. Related Reading: Crypto Trading Firm Expects Bitcoin To Crash To $36,000, Here’s Why In another chart shared by the analyst, he noted that XRP&#8217;s price is currently forming a cup and handle formation in the 2-day timeframe. If this formation holds, a bullish breakout would see XRP reaching a $0.95 price target. #XRP &#8211; As long as handle does not break down 50% of the size of cup, then C&#38;H is in play! This may be what we need for Symmetric triangle to breakout on Log Scale! Loaded up at 0.28, 0.33, 0.45, 0.52, and 0.59 during FEAR! Be ready both ways! Retweet/like for updates!… pic.twitter.com/T67EhrHKO2 — JD 🇵🇭 (@jaydee_757) December 28, 2023 Featured image from The Bitcoin News, chart from Tradingview.com"
  }
]