[
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T15:30:00.000Z",
    "title": "Is the SEC a bad cop? CoinRoutes CEO Dave Weisberger breaks down crypto regulation in the US",
    "url": "https://cointelegraph.com/news/is-sec-bad-cop-coinroutes-ceo-dave-weisberger-breaks-down-crypto-regulations-saga-in-us",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/32572b0f-c852-41e9-a8cf-aeaabd6a7e85.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Weisberger believes the structure of the Securities and Exchange Commission needs to change but that politicians are reluctant to do so because of their power within the current state of affairs. </p>\n                    <p><p>On Episode 27 of <em>Hashing It Out,</em> CoinRoutes CEO Dave Weisberger joins host Elisha Owusu Akyaw (also known as GhCryptoGuy) to discuss the current state of cryptocurrency regulation in the United States. Weisberger explains how the U.S. Securities and Exchange Commission (SEC) and Commodity Futures Trading Commission (CFTC) approach regulations and what they mean for the fast-evolving cryptocurrency space.</p><p>Weisberger addresses the state of regulation at the start of the podcast. According to him, the problem in the United States stems from a lack of clear regulations and rules, leading to regulators arbitrarily applying different rules. Weisberger adds that the issue stems from the existence of two different regulators — the SEC and CFTC — which have different roles in the financial system that may intersect depending on which crypto assets are being referred to and the use cases under scrutiny. </p><p>Recently, the SEC took the initiative to lead the attempt to regulate cryptocurrencies, resulting in multiple court cases against several projects in 2023. Weisberger explains that for most industry players, there isn’t a strong resistance to regulations; rather, the argument is that the SEC’s rules were established in the 1940s and updated in the 1970s and should not be used to regulate a new asset class and technology-oriented products. He further describes the situation from the perspective of builders in the space: </p><blockquote>“We have a situation where the industry says if you call me a security, it is a death sentence. Not because regulation is bad but because the rules themselves will strangle the innovation.” </blockquote><template data-ct-widget=\"buzzsprout\" data-buzzsprout-podcast-id=\"2096415\"></template><p><em>Hashing It Out</em> host Owusu Akyaw asks if regulating cryptocurrencies is challenging in the United States, to which the CoinRoutes CEO responds that the answer should be no, but that it’s a complex situation. He uses the analogy that remodeling a house is more difficult than building a house from scratch. According to Weisberger, regulators need to rethink their approach toward crypto regulations.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/magazine/recursive-inscriptions-bitcoin-supercomputer-defi-aws-possible/\">Recursive inscriptions: Bitcoin ‘supercomputer’ and BTC DeFi coming soon</a></em></strong></p><p>On whether or not cryptocurrency is an issue voters care about in the U.S., Weisberger argues that the freedom to invest and engage in economic activity and the U.S. potentially losing competitiveness in a fast-growing industry are issues that make cryptocurrency an important voting issue.</p><p>Listen to the latest episode of <em>Hashing It Out</em> with CoinRoutes‘ Weisberger on <a href=\"https://open.spotify.com/show/3ibvcrJ87PAso4DBIiE5qn?si=5071800991044f7a\" target=\"_blank\" rel=\"noopener nofollow\">Spotify</a>, <a href=\"https://podcasts.apple.com/us/podcast/hashing-it-out/id1658998696?app=podcast\" target=\"_blank\" rel=\"noopener nofollow\">Apple Podcasts</a>, <a href=\"https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8yMDk2NDE1LnJzcw\" target=\"_blank\" rel=\"noopener nofollow\">Google Podcasts</a> or <a href=\"https://tunein.com/podcasts/Business--Economics-Podcasts/Hashing-It-Out-p3083469/\" target=\"_blank\" rel=\"noopener nofollow\">TuneIn</a>. You can also explore Cointelegraph’s complete catalog of informative podcasts on the <a href=\"https://cointelegraph.com/podcasts\">Cointelegraph Podcasts page</a>.</p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-24T15:33:12.000Z",
    "title": "Betting on $PEPE Over $DOGE: A Trader’s Insight into Meme Coin Markets",
    "url": "https://www.cryptoglobe.com/latest/2023/08/betting-on-pepe-over-doge-a-traders-insight-into-meme-coin-markets/",
    "description": "A highly popular pseudonymous crypto trader known as “Altcoin Sherpa” has recently expressed bearish sentiment on Dogecoin ($DOGE) and shown a preference for a rival meme coin named Pepe ($PEPE), which has exploded over 1800% in just four months. In a video update (titled “ALTCOIN REVIEW: Dogecoin, Chainlink, Arbitrum, Rune, Lido, Curve”) released yesterday, he […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T15:14:14.000Z",
    "title": "Controversial AI App Lets Users Text With Jesus and Sparks Conversation",
    "url": "https://www.cryptopolitan.com/ai-app-jesus-and-sparks-conversation/",
    "description": "The realm of artificial intelligence has birthed a plethora of innovative creations, ranging from the practical to the peculiar. Among the latest offerings is the Text With Jesus app, developed by Catloaf Software, which has gained rapid notoriety for its unique concept. As AI technology advances, this app aims to provide devout Christians with a ... <a title=\"Controversial AI App Lets Users Text With Jesus and Sparks Conversation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-app-jesus-and-sparks-conversation/\" aria-label=\"More on Controversial AI App Lets Users Text With Jesus and Sparks Conversation\">Read more</a>"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-24T15:25:00.000Z",
    "title": "Binance Stopping Debit Card Services in Latin America, Middle East",
    "url": "https://coinedition.com/binance-stopping-debit-card-services-in-latin-america-middle-east/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/09/Introducing_the_New_Binance_Options_Trading_Platform_Extend_Your.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Introducing_the_New_Binance_Options_Trading_Platform_Extend_Your\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/09/Introducing_the_New_Binance_Options_Trading_Platform_Extend_Your.jpg 730w, https://coinedition.com/wp-content/uploads/2022/09/Introducing_the_New_Binance_Options_Trading_Platform_Extend_Your-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/09/Introducing_the_New_Binance_Options_Trading_Platform_Extend_Your-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/09/Introducing_the_New_Binance_Options_Trading_Platform_Extend_Your-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/09/Introducing_the_New_Binance_Options_Trading_Platform_Extend_Your-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Binance, the largest cryptocurrency exchange in the world, announced today the withdrawal of its crypto debit card services from Latin America and the Middle East region. The announcement, which came via a post on its customer support page, says the card services will no longer be available to users in these regions. Notably, customers have [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/binance-stopping-debit-card-services-in-latin-america-middle-east/\">Binance Stopping Debit Card Services in Latin America, Middle East</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]