[
  {
    "source": "Cryptopolitan",
    "date": "2023-08-10T06:49:13.000Z",
    "title": "Nvidia Unveils New AI Chip with Potential to Reduce Costs of Running Large Language Models",
    "url": "https://www.cryptopolitan.com/nvidia-unveils-new-ai-chip/",
    "description": "In a move aimed at maintaining its supremacy in the AI hardware sector, Nvidia has introduced a groundbreaking AI chip, the GH200, designed to optimize artificial intelligence models. As rivals such as AMD, Google, and Amazon continue to make strides in this space, Nvidia&#8217;s latest offering seeks to consolidate its over 80% market share in ... <a title=\"Nvidia Unveils New AI Chip with Potential to Reduce Costs of Running Large Language Models\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nvidia-unveils-new-ai-chip/\" aria-label=\"More on Nvidia Unveils New AI Chip with Potential to Reduce Costs of Running Large Language Models\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-10T06:55:23.000Z",
    "title": "Coinbase’s Base mainnet launches to public",
    "url": "https://crypto.news/coinbases-base-mainnet-launches-to-public/",
    "description": "Coinbase has publicly launched its Base mainnet, introducing a platform with over 100 dapps and several service providers. Coinbase launched its Base mainnet to the public on Aug. 9. Its ecosystem contains over 100 decentralized applications (dapps) and service providers.&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-10T06:45:33.000Z",
    "title": "Ethereum Price Prints Bullish Technical Pattern, Why Close Above $1,880 Is Critical",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-bullish-1880/",
    "description": "Ethereum price is aiming for a fresh increase above the $1,880 zone against the US Dollar. ETH could rally unless there is a close below the $1,830 support. Ethereum is facing major resistance near $1,875 and $1,880. The price is trading above $1,830 and the 100-hourly Simple Moving Average. There is a bullish flag pattern forming with resistance near $1,860 on the hourly chart of ETH/USD (data feed via Kraken). The pair could gain bullish momentum if it clears the $1,860 and $1,880 resistance levels. Ethereum Price Holds Support Ethereum’s price started a decent increase from the $1,800 zone. ETH climbed above the $1,850 and $1,860 levels. However, the bears are still active near $1,880, similar to Bitcoin. A high was formed near $1,876 and the price saw a downside correction. There was a move below the $1,860 level. The price declined below the 23.6% Fib retracement level of the upward move from the $1,800 swing low to the $1,876 high. Ether is now trading above $1,830 and the 100-hourly Simple Moving Average. There is also a bullish flag pattern forming with resistance near $1,860 on the hourly chart of ETH/USD. Source: ETHUSD on TradingView.com On the upside, immediate resistance is near the $1,860 level and the trend line. The first major resistance is near the $1,875 level. The next key resistance is near the $1,880 level, above which the price might rise toward the $1,920 zone. Any more gains might send the price toward the $2,000 hurdle. A close above the $2,000 level could set the pace for a larger increase. Fresh Decline in ETH? If Ethereum fails to clear the $1,880 resistance, it could start another decline. Initial support on the downside is near the $1,845 level and the 100-hourly Simple Moving Average. The first major support is near the $1,835 zone or the 50% Fib retracement level of the upward move from the $1,800 swing low to the $1,876 high, below which the price might test the $1,820 support zone. The next major support is near the $1,800 support level. Any more losses might start a strong decline to $1,720. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,830 Major Resistance Level – $1,880"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-10T07:04:58.000Z",
    "title": "Bitcoin To Explode by Over 130% Before the End of 2023, Predicts Widely Followed Trader – But There’s a Catch",
    "url": "https://dailyhodl.com/2023/08/10/bitcoin-to-explode-by-over-130-before-the-end-of-2023-predicts-widely-followed-trader-but-theres-a-catch/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/btc-by-Over-130.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/btc-by-Over-130.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/btc-by-Over-130.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/btc-by-Over-130.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/btc-by-Over-130.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/btc-by-Over-130.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/btc-by-Over-130.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst and trader is predicting a triple-digit rally for Bitcoin (BTC) over the coming months. Pseudonymous analyst CredibleCrypto tells his 343,800 Twitter followers that he expects Bitcoin to surge to a price of over $70,000 this year, an increase of approximately 135% from the current level. “$70,000+ this year, in case [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/10/bitcoin-to-explode-by-over-130-before-the-end-of-2023-predicts-widely-followed-trader-but-theres-a-catch/\">Bitcoin To Explode by Over 130% Before the End of 2023, Predicts Widely Followed Trader – But There’s a Catch</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]