[
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T04:50:01.000Z",
    "title": "EMAX class action against Kim K and Mayweather is back on, says judge",
    "url": "https://cointelegraph.com/news/emax-class-action-against-kim-k-and-mayweather-is-back-on-says-judge",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/68139b25-faf1-4fd1-bc07-45a8a3a4d294.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>While a federal judge dismissed the lawsuit last year, U.S. District Judge Michael Fitzgerald has given the plaintiffs a new chance at pursuing action against the celebrities. </p>\n                    <p><p>Celebrity defendants Kim Kardashian and Floyd Mayweather are back on the hook for a class action lawsuit that alleges their improper promotion of the now-defunct crypto token EthereumMax (EMAX).</p><p>While the class action suit was brought against the pair in January 2022 for allegedly promoting a “pump and dump” scheme, it was<a href=\"https://cointelegraph.com/news/class-action-against-kim-k-mayweather-over-emax-dismissed-for-now\"> dismissed</a> by a federal judge in California in December 2022. </p><p>However, in a new<a href=\"https://fingfx.thomsonreuters.com/gfx/legaldocs/klvygwgrqvg/frankel-emax--MTDopinion.pdf\" target=\"_blank\" rel=\"noopener nofollow\"> ruling</a> on June 6, U.S. District Judge Michael Fitzgerald refused to throw out the plaintiff’s “unfair competition” claims against reality TV star Kardashian and boxing champion Mayweather for their role in promoting the EMAX token in 2021.</p><p>The judge has now seen it fit to amend the 162-page<a href=\"https://fingfx.thomsonreuters.com/gfx/legaldocs/gdpzqoqexvw/frankel-emax--2ndamendedcomplaint.pdf\" target=\"_blank\" rel=\"noopener nofollow\"> complaint</a> alleging that Kardashian, Mayweather, and NBA star Paul Pierce “were profiting off endorsements at their fans’ expense by touting an investment opportunity that had no legitimate business plan.”</p><p>“The court is essentially dealing with an entirely new complaint, with new defendants and several new claims,” said Fitzgerald. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/7f857a02-ec17-460d-a12c-f67f7a871aa5.jpg\"  /><figcaption style=\"text-align: center;\">Excerpt from Ruling in Case CV 22-00163-MWF. Source: thomsonreuters</figcaption></figure><p>Judge Fitzgerald said that hyping a crypto token without disclosing that you’ve been paid to do so is an “unscrupulous and thereby unfair practice.” </p><p>He added that the celebrity defendants provided no arguments to tip the balance in their favor.</p><blockquote>“Defendants do not offer a single benefit of allowing celebrities to endorse unvetted products without disclosing that they are being paid to do so,”</blockquote><p>However, he cautioned that the class-action lawyers from Scott+Scott would have to explain how the celebrity’s promotion of the token affected its prices.</p><p>Sean Masson of Scott+Scott said that misleading celebrity endorsements were the very essence of the Emax business model, according to <a href=\"https://www.reuters.com/legal/litigation/kim-kardashian-floyd-mayweather-cant-evade-emax-crypto-investors-claims-judge-2023-06-07/\" target=\"_blank\" rel=\"noopener nofollow\">Reuters</a>.</p><p>Kardashian plugged the EMAX token in a June 2021 post on Instagram, while Mayweather wore the EMAX logo on his boxing trunks in a match against YouTube star Logan Paul in the same month.</p><p>According to its whitepaper, EthereumMax claims to be a “culture token” that “bridges the gap between the emergence of community tokens and the well-known foundational coins of crypto,” though it has nothing to do with Ethereum.</p><p><strong><em>Related:</em></strong><a href=\"https://cointelegraph.com/news/celebs-who-got-burned-endorsing-crypto-and-those-that-got-away-with-it\"><strong><em> </em></strong><strong><em>Celebs who got burned endorsing crypto and those that got away with it</em></strong></a></p><p>In October 2022, the Securities and Exchange Commission charged Kardashian for unlawfully touting a crypto security. She<a href=\"https://cointelegraph.com/news/kim-kardashian-pays-sec-1-26-million-to-settle-ethereummax-charge\"> agreed to pay</a> $1.26 million in penalties for her involvement in the EMAX promotion.</p><p>The class action sought damages for investors that bought the token following the celebrity shills though actual amounts were not specified. </p><p><strong><em>Magazine:<a href=\"https://cointelegraph.com/magazine/moral-responsibility-how-blockchain-can-improve-ai-trustworthiness/\"> ‘Moral responsibility’: Can blockchain really improve trust in AI?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T05:05:11.000Z",
    "title": "Binance.US Announces Removal of Trading Pairs and Pauses OTC Trading Services",
    "url": "https://www.cryptopolitan.com/binance-us-removal-trading-pairs-pauses-otc/",
    "description": "Binance.US, the United States-based cryptocurrency exchange, has recently announced a series of updates aimed at improving the trading experience for its users. These changes include the removal of select trading pairs from the Advanced Trading section, streamlining of the Buy, Sell &#38; Convert offering, and a temporary pause of the OTC Trading Portal. By implementing ... <a title=\"Binance.US Announces Removal of Trading Pairs and Pauses OTC Trading Services\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-us-removal-trading-pairs-pauses-otc/\" aria-label=\"More on Binance.US Announces Removal of Trading Pairs and Pauses OTC Trading Services\">Read more</a>"
  }
]