[
  {
    "source": "Decrypt",
    "date": "2023-08-04T12:58:59.000Z",
    "title": "SHIB Surges 10% Over the Week Amid Push for Identity Service, Binance Integration",
    "url": "https://decrypt.co/151284/shib-surges-10-week-amid-push-identity-service-binance-integration",
    "description": "Binance added SHIB as a collateral asset, while its developers are working hard to shed the meme coin status. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-04T13:01:00.000Z",
    "title": "Ensuring integrity of blockchain transactions: Trust through audits  ",
    "url": "https://cointelegraph.com/news/ensuring-integrity-of-blockchain-transactions-trust-through-audits",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/85503173-68c5-4b13-a1cf-33af549f3173.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Reliable auditing procedures are important for ensuring the integrity of blockchain networks. </p>\n                    <p><p>Blockchain auditing is the process of examining and verifying the data and transactions stored within a blockchain network. It focuses on assessing the integrity and accuracy of the information recorded on the blockchain to ensure it aligns with the intended rules, protocols and regulations.</p><p>Through the audit process, smart contract code is painstakingly examined to identify vulnerabilities of all levels, ranging from minor loopholes to critical weaknesses that could potentially expose millions to risk. </p><p>Auditors review and reveal centralization issues, ensure the project code functions as the developer intended, and optimize the code's efficiency. They address key areas such as mathematical operations, logical issues, control flow, access control and compiler errors. By doing this, the probability of a smart contract vulnerability is substantially reduced, providing an essential safeguard in the world of Web3.</p><p>Sheldon Xia, founder and CEO of crypto exchange Bitmart, told Cointelegraph, \"Auditing significantly reduces risks associated with smart contract vulnerabilities.”</p><p>However, auditing is not a panacea. Many projects often do not have their entire code audited due to time and budget constraints, leaving sections of the code unchecked and potentially susceptible to issues. </p><p>Furthermore, audits must be continuous, as code is frequently updated or forked, making single audits insufficient for long-term security.</p><p>In addition, there's the challenge of ensuring that the deployed code is the one that was actually audited and not something different. This emphasizes the need for both transparency and traceability in the deployment process, underlining the necessity of a more holistic approach to security that goes beyond mere code auditing.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/17f85570-1acd-4c6d-b558-4e2d0aa9a92c.jpg\"  /></figure><p>Auditing blockchain systems is crucial for several reasons.</p><p>Firstly, auditing ensures the verification of transactions recorded on the blockchain. This involves scrutinizing the transaction history, validating inputs and outputs, and confirming that the transactions comply with predefined rules and smart contracts. By doing so, auditing helps prevent fraudulent or erroneous transactions and maintains the integrity of the blockchain network.</p><p>Secondly, blockchain auditing plays a vital role in security and fraud detection. Auditors thoroughly review the transactions, and access controls and cryptographic mechanisms to identify unauthorized or suspicious activities within the blockchain network. This aspect is particularly critical in financial systems, supply chains and sensitive data management with high potential risks.</p><p>Auditing enhances accountability by holding participants responsible for their actions within the blockchain network. It helps identify discrepancies or inconsistencies, ensuring all stakeholders are accountable for their activities.</p><p>Furthermore, auditing instills trust and confidence among stakeholders in blockchain-based systems. By optimizing the blockchain network based on audit findings, organizations can ensure it can handle increasing transaction volumes and meet desired performance objectives.</p><h2>The importance of reliable auditing processes</h2><p>While auditors play an essential role in the security of blockchain networks, founders must select reputable organizations. One drawback associated with shady auditing firms is a conflict of interest. These entities may have undisclosed conflicts that compromise their independence and objectivity. </p><p>They could be financially tied to the projects they audit or maintain undisclosed partnerships or investments that introduce bias into their evaluations. Such conflicts undermine the integrity of the audit process and raise doubts about the impartiality of their findings.</p><p><a href=\"https://cointelegraph.com/magazine/6-questions-for-simon-davis-of-mighty-bear-games/\"><strong><em>Magazine: 6 Questions for Simon Davis of Mighty Bear Games</em></strong></a></p><p>Transparency is crucial in auditing to ensure accountability and build trust. However, shady auditing firms often lack transparency in their operations. They provide limited or vague information about their methodologies, processes and auditors' qualifications. </p><p>In March 2023, <a href=\"https://cointelegraph.com/news/us-lawmakers-reiterate-concerns-about-sham-crypto-firm-audits-to-pcaob\">Cointelegraph reported</a> that banks associated with the defunct crypto exchange FTX may have relied on the misleading and faulty financial information provided by proof-of-reserve examinations by auditors associated with the Public Company Accounting Oversight Board.</p><p>In another report by Cointelegraph in December 2022, the <a href=\"https://cointelegraph.com/news/be-very-wary-of-crypto-proof-of-reserve-audits-sec-official\">SEC’s acting chief accountant Paul Munter</a> stressed that investors shouldn't place too much confidence in a company's proof-of-reserve audits. Munter said these proof-of-reserve reports lack sufficient information for stakeholders to determine whether the company has enough assets to meet its liabilities. This lack of transparency makes it challenging to evaluate the reliability and credibility of their findings, raising concerns about the validity of their audits.</p><p>Although a third party should conduct audits, the lack of true independence among many auditors means <a href=\"https://cointelegraph.com/magazine/defi-security-audits-bug-bounties-broken-heres-how-fix/\">that the results are sometimes unreliable.</a> In other words, they may have an incentive to avoid disappointing customers.</p><p>Inadequate due diligence is another drawback associated with shady auditing firms. Effective audits require thorough analysis, including a comprehensive review of project documentation, source code, financial records and security measures. </p><p>Some firms may perform inadequate due diligence or rely on incomplete or inaccurate information from their audit projects. Consequently, their reports can be misleading or inaccurate, failing to identify significant risks or vulnerabilities.</p><p>An incomplete or misleading audit can have severe consequences for the reputation and trustworthiness of a blockchain project. If investors, users or regulators discover an audit report is unreliable or conducted by an untrustworthy firm, it erodes confidence in the project. </p><p>This diminished trust can result in decreased adoption, loss of investments and potential legal repercussions.</p><h2>Best practices for effective auditing in blockchain systems</h2><p>In exploring best practices for conducting audits in blockchain environments, auditors must deeply understand how blockchain systems work. This includes knowledge of the underlying architecture, consensus mechanisms and transaction validation processes. </p><p>Such expertise enables auditors to identify potential vulnerabilities and evaluate the overall security and integrity of the system. Comprehensive documentation is essential to the auditing process, ensuring that all relevant information about the blockchain system is thoroughly recorded.</p><p>Technical specifications, smart contracts, cryptographic algorithms and other critical components must be documented to gain insights into the system's functionality and identify potential risks and vulnerabilities.</p><p>Moreover, auditors should thoroughly review the codebase of the blockchain system and conduct a detailed analysis of smart contracts. This process entails assessing the code for vulnerabilities, logic flaws and potential attack vectors exploited by malicious actors. </p><p>Specialized tools and techniques may be employed to ensure the accuracy and security of the system during the code review and smart contract analysis.</p><h2>End-to-end security is key</h2><p>The reality is that auditing alone is not enough. A more holistic, comprehensive approach is required. While auditing addresses code-based risks, Know Your Customer procedures tackle the human risk factor, thereby providing a more comprehensive security overview. However, striking the right balance between the anonymity offered by Web3 and the trust fostered through KYC can be a delicate process. </p><p>Of course, KYC is not foolproof either, with cases of bad actors misrepresenting themselves and passing KYC checks, creating a false sense of trust around a project. This means that rigorous screening processes conducted by seasoned professionals are needed. KYC verification is only as meaningful as the process behind it is comprehensive.</p><p>Alpen Sheth, partner at Borderless Capital, a crypto venture capital firm, told Cointelegraph, “It's important to remember that auditing should be an ongoing process to keep up with code changes and the evolution of the ecosystem. We acknowledge that security is an integral part of sustainable growth and development in the blockchain space.\"</p><p><a href=\"https://cointelegraph.com/magazine/chinese-police-web3-blockchain-centralization-continues-asia-express/?doing_wp_cron=1691052881.1558809280395507812500\"><strong><em>Chinese police vs. Web3, blockchain centralization continues: Asia Express</em></strong></a></p><p>In this complex landscape, investors should also exercise due diligence. Alongside reading and understanding audit reports, they should also look for projects audited by reputable firms, track project code updates and their corresponding audits, know the team behind the project and their track record, and consider the proportion of audited code within the project.</p><p>As the Web3 ecosystem continues to grow, a multifaceted approach combining comprehensive auditing, robust KYC processes, and investor due diligence is necessary to ensure optimal security. This, alongside a concerted effort to address the challenges of centralization risks, can provide a more secure foundation for the continued growth and success of Web3 projects.</p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-04T12:52:24.000Z",
    "title": "Cryptocurrencies Navigate July’s Economic Waves; A Soft Landing Scenario?",
    "url": "https://cryptobriefing.com/cryptocurrency-in-july-navigating-economic-hopes/?utm_source=feed&utm_medium=rss",
    "description": "Grayscale's July 2023 report highlights the impacts of a potential US economic soft landing, Federal Reserve decisions, legal rulings and more."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-04T13:00:46.000Z",
    "title": "Polygon Backs $1.5M Institutional DEX D8X Deal, Betting on Rise From CeFi To DeFi",
    "url": "https://cryptodaily.co.uk/2023/08/polygon-backs-15m-institutional-dex-d8x-deal-betting-on-rise-from-cefi-to-defi",
    "description": "<p>Zug, Switzerland, August 4th, 2023, Chainwire</p>D8X's pre-seed round features Polygon Ventures, Axelar Network, Swissborg Ventures and others&nbsp;<p>&nbsp;D8X, an institutional-grade decentralized exchange (DEX) for derivatives on Polygon zkEVM, announced a $1.5 million pre-seed round with support from Polygon Ventures and other notable investors. The capital will help D8X launch a decentralized derivatives trading platform in the second half of 2023 that provides a white-labeling solution to trading partners seeking access to powerful derivatives products.&nbsp;</p><p>The pre-seed round for D8X includes additional participation from Axelar Network, Swissborg Ventures, Cogitent Ventures, Veris Ventures, G1 Ventures, Pragma Ventures, CryptoDiscover and others.</p>&ldquo;DeFi is reshaping the future of finance. Projects like D8X are building the infrastructure that will help legacy finance to leap into web3,&rdquo; said Polygon Co-Founder Sandeep Nailwal.<p>Bridging CeFi to DeFi</p><p>D8X's founders bet on centralized players wanting to offer decentralized crypto derivatives to their clients without having to hire experts to develop in-house market-making and trading engines. D8X provides a white-label solution to partners who act as brokers and earn fees by running their own front ends powered by the D8X trade engine and shared liquidity.</p><p>Financial Engineering On Chain</p><p>D8X&rsquo;s sophisticated on-chain solutions curb costs and offer products that are competitive with centralized exchanges, such as cost-efficient hedging, a prerequisite for building a highly functional derivative trading space. Contract trading allows other DeFi protocols to efficiently hedge on-chain. Their perpetuals can be calibrated for a wide range of assets and support&mdash;as a first in DeFi&mdash;linear, inverse and quanto perpetuals. At launch, a liquidity pool in Lido's staked ETH (stETH) will enable liquidity providers to earn the Lido yield while simultaneously participating in the DEX&rsquo;s earnings.&nbsp;</p><p>D8X is the first business-to-business (B2B) DEX built on Polygon&rsquo;s zkEVM, harnessing the power of zero-knowledge proofs to cut transaction fees, increase security and scale operations across the Polygon and Ethereum networks.&nbsp;</p>&ldquo;D8X is part of a driving force of innovation and community in Polygon&rsquo;s 2.0 zero-knowledge space,&rdquo; said Polygon Director of Growth Hamzah Khan.<p>D8X is a fully decentralized DEX following regulatory guidance from Switzerland&rsquo;s financial market regulator FINMA.&nbsp;</p>&ldquo;We thank all our investors for believing in D8X's vision to bring truly decentralized derivatives as white-labeling solutions to institutions. With best-in-class financial engineering and risk management, D8X is changing the way decentralized derivatives are traded,&rdquo; said D8X co-founder Caspar Sauter.<p>The production codebase of D8X was audited by PeckShield and an earlier version was audited by Hacken.&nbsp;</p><p>About D8X</p><p>D8X is a Polygon Ventures-supported institutional-grade perpetual futures DEX with a financial engineering approach that elevates the way perpetual futures can be traded on-chain. Think of a powerful and decentralized trading platform on Polygon zkEVM that offers white-labeling to institutions. D8X&rsquo;s pricing mechanism adapts to changing market conditions protecting liquidity providers and profitable traders in volatile periods, resulting in superior DeFi trading conditions.</p><p>D8X | Twitter | GitHub | Docs</p>ContactPR DirectorPatrick BrendelScrib3patrick@scrib3.co"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-04T12:42:00.000Z",
    "title": "SEC Chair Pivots From Crypto Manhunt To AI",
    "url": "https://cryptodaily.co.uk/2023/08/sec-chair-pivots-from-crypto-manhunt-to-ai",
    "description": "<p>Gary Gensler, the U.S. Securities and Exchange Commission (SEC) chairperson, has expressed serious concern for AI technology, calling it a serious threat to financial markets.&nbsp;</p>\nGensler Pivoting Regulatory Eye To AI\n<p>Under the leadership of its chairperson, the SEC has shifted its focus from cryptocurrency to artificial intelligence (AI), recognizing it as a technology that \"warrants the hype.\" Gensler, who previously dealt with crypto industry scams and fraud, now views AI as the most transformative technology of this generation and warns of the risks it may pose if not properly regulated.</p>\n<p>Gensler emphasizes that mass automation driven by AI can have far-reaching implications for the trillions of dollars in assets traded on SEC-regulated markets.&nbsp;</p>\n<p>While AI's predictive capabilities can benefit firms in better serving their clients, there's a concern that it might also be used to obscure responsibility when things go wrong, potentially leading to significant market risks.</p>\nA Long-Standing Interest In AI Technology\n<p>Gary Gensler has a well-established history with AI, dating back to 1997 when he first delved into it after witnessing Russian chess grandmaster Garry Kasparov's defeat against IBM's supercomputer, Deep Blue. His involvement with AI deepened during his tenure as an MIT professor, leading to his co-authoring a 2020 paper, &ldquo;Deep Learning and Financial Stability,&rdquo; that examined the risks posed by deep learning to the financial system.&nbsp;</p>\n<p>He claimed that existing financial laws do not have the capacity to address the dangers of algorithmic deep learning. He believes that developers can create AI functions without any limits, and these functions might work against fair market ethics.</p>\nCalls for Better Regulation\n<p>Gensler asserts that existing regulatory frameworks are ill-equipped to manage the risks associated with AI. He highlights the potential challenges of coordinating AI models among major trading houses, which could lead to increased market volatility and instability. To address the conflict, Gensler has proposed one of the first regulatory frameworks for AI, urging trading houses and money managers to assess whether their use of AI or predictive data could create conflicts of interest.</p>\nNo Loosening of Crypto Enforcement\n<p>Despite pivoting the SEC's attention to AI, Gensler's focus on crypto enforcement remains strong. Numerous lawsuits involving major cryptocurrency firms, such as Ripple, Binance, and Coinbase, are currently pending.&nbsp;</p>\n<p>He has also faced severe criticism from leading market experts like Tim Draper and lawmakers like Ritchie Torres for his stance against crypto, calling it detrimental to the industry and the economy.&nbsp;</p>\n<p>As the landscape of both AI and crypto continues to evolve, market participants will be closely watching the SEC's actions and decisions.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T13:02:32.000Z",
    "title": "Machine Learning Revolutionizes Neurodegenerative Disease Research",
    "url": "https://www.cryptopolitan.com/machine-learning-neurodegenerative-disease/",
    "description": "Neurodegenerative diseases are devastating age-related conditions that lead to progressive nervous system deterioration, resulting in severe disability and, ultimately, death. Alzheimer&#8217;s disease, Parkinson&#8217;s disease, multiple sclerosis, amyotrophic lateral sclerosis, and Huntington&#8217;s disease are among the most common neurodegenerative disorders. As life expectancy increases worldwide, the prevalence of these diseases is expected to rise, underscoring the ... <a title=\"Machine Learning Revolutionizes Neurodegenerative Disease Research\" class=\"read-more\" href=\"https://www.cryptopolitan.com/machine-learning-neurodegenerative-disease/\" aria-label=\"More on Machine Learning Revolutionizes Neurodegenerative Disease Research\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T13:00:40.000Z",
    "title": "Polygon Backs $1.5M Institutional DEX D8X Deal, Betting on Rise From CeFi To DeFi",
    "url": "https://www.cryptopolitan.com/polygon-backs-1-5m-institutional-dex-d8x-deal-betting-on-rise-from-cefi-to-defi/",
    "description": "Zug, Switzerland, August 4th, 2023, Chainwire D8X&#8217;s pre-seed round features Polygon Ventures, Axelar Network, Swissborg Ventures and others   D8X, an institutional-grade decentralized exchange (DEX) for derivatives on Polygon zkEVM, announced a $1.5 million pre-seed round with support from Polygon Ventures and other notable investors. The capital will help D8X launch a decentralized derivatives trading platform ... <a title=\"Polygon Backs $1.5M Institutional DEX D8X Deal, Betting on Rise From CeFi To DeFi\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-backs-1-5m-institutional-dex-d8x-deal-betting-on-rise-from-cefi-to-defi/\" aria-label=\"More on Polygon Backs $1.5M Institutional DEX D8X Deal, Betting on Rise From CeFi To DeFi\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-04T12:52:31.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-04T13:00:20.000Z",
    "title": "Will Binance’s Zero-Fee Trading Help Bitcoin And Ethereum Prices",
    "url": "https://www.newsbtc.com/binance/binance-zero-fee-bitcoin-ethereum/",
    "description": "Binance, the world&#8217;s largest crypto exchange, recently added the BTC/FDUSD and ETH/FDUSD trading pairs to its zero-fee trading program. Binance recently listed FDUSD, a 1:1 USD stablecoin on the BNB smart chain issued by Hong Kong-based licensed trust company, First Digital. With the new zero-fee trading program, users can buy and sell supported cryptocurrencies using FDUSD without paying transaction fees.  Binance Introduces Zero-Fee Trading Program The zero-fee trading program is part of Binance&#8217;s efforts to increase trading volumes between stablecoin pairs. The company currently has a zero-fee bitcoin trading &#38; BUSD zero maker fee promotion for supported stablecoins. With its latest move, Binance is adding FDUSD to the fray of supported stablecoins on both spot &#38; margin trading pairs. Related Reading: MicroStrategy’s Michael Saylor Says Spot ETF Approvals Have No Bearing On Bitcoin Strategy #Binance adds #BTC / $FDUSD and $ETH / $FDUSD trading pairs and updates the zero-fee Bitcoin Trading Program. Find out more ⤵️https://t.co/g6Elnd77d9 — Binance (@binance) August 3, 2023 Taker fees are paid when the trade order is executed, while maker fees are paid when users make limit orders. According to the announcement on its blog, starting August 8, users will be able to enjoy zero maker and taker fees on the BTC/FDUSD spot and margin trading pairs.  Users will also enjoy zero maker fees on all FDUSD spot and margin trading pairs, but takers will continue to pay standard fees based on the existing trading structure.  The Potential Impact On Prices Binance’s announcement to waive trading fees could significantly impact the prices of Bitcoin and Ethereum. As the world’s largest crypto exchange, Binance wields a lot of influence over the crypto market. In the past, Binance’s fee reductions and zero-fee promotions have preceded price pumps and increases in trading volume for the included cryptocurrencies, even if they are only temporary. Bitcoin, on its own, seems to have found a footing just below $30,000, but the influx of new money and traders could support a higher price push for Bitcoin. The same goes for Ethereum, which is currently ranging around $1,800. BTC price could benefit from zero fees on Binance &#124; Source: BTCUSD on Tradingview.com With no trading fees, investors can also move money in and out of stablecoins freely to take advantage of arbitrage opportunities across exchanges or trade pairs.  Related Reading: Here’s Where The Price Of LUNC Will Land This August, According To This Algorithm In March, Binance’s decided to implement zero maker and taker fees on the BTC-TUSD. As a result, the TUSD stablecoin surged 10x in trading volume, surpassing $1 billion in less than 24 hours. During this time period, the BTC-TUSD pair on Binance alone exceeded $700 million in trading volume.  It is unclear when the zero-fee trading promotion will end on the BTC/FDUSD and ETH/FDUSD trading pairs, but it is expected to increase the volume of FDUSD being traded on the exchange. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-04T13:00:29.000Z",
    "title": "Coinbase Pauses Crypto Staking. Are Investors Better Off Investing in AltSignals’ Presale?",
    "url": "https://www.crypto-news-flash.com/coinbase-pauses-crypto-staking-are-investors-better-off-investing-in-altsignals-presale/?utm_source=rss&utm_medium=rss&utm_campaign=coinbase-pauses-crypto-staking-are-investors-better-off-investing-in-altsignals-presale",
    "description": "<img width=\"1017\" height=\"514\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Altsignals.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Altsignals.jpg 1017w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Altsignals-300x152.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Altsignals-768x388.jpg 768w\" sizes=\"(max-width: 1017px) 100vw, 1017px\" />While regulatory setbacks are bound to happen in crypto, many forget that every cloud has a silver lining. With the SEC aiming for Coinbase’s crypto staking programs, now might be the time to consider a fresh, innovative alternative: AltSignals.  As an established trading signal leader, AltSignals is launching its next groundbreaking initiative, driven by the [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-04T12:58:00.000Z",
    "title": "INJ, LINK, DOGE — 3 Altcoins to Watch This August: Analyst",
    "url": "https://coinedition.com/inj-link-doge-3-altcoins-to-watch-this-august-analyst/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/TOP-3.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/TOP-3.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/TOP-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/TOP-3-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/TOP-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/TOP-3-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/TOP-3-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/TOP-3-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/TOP-3-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/TOP-3-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/TOP-3-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/TOP-3-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/TOP-3-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/TOP-3-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/TOP-3-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/TOP-3-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/TOP-3-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Michael van de Poppe, the renowned cryptocurrency trader and analyst, revealed in his latest technical analysis that he will be watching Injective (INJ), Chainlink (LINK), and Dogecoin (DOGE) for trade opportunities this month. According to the analyst, these three altcoins have the potential to generate substantial gains for investors and traders this August. The first [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/inj-link-doge-3-altcoins-to-watch-this-august-analyst/\">INJ, LINK, DOGE — 3 Altcoins to Watch This August: Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]