[
  {
    "source": "Cointelegraph",
    "date": "2023-09-14T05:59:54.000Z",
    "title": "Sui Network launches Google, Twitch and Facebook logins for DApps",
    "url": "https://cointelegraph.com/news/sui-network-launch-google-facebook-logins-for-dapps",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/23e35e6e-10c1-4017-bcca-2377a2434e1e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Sui joins the growing ranks of Web3 firms looking to onboard users who are all too often “irretrievably lost\" at the doorstep of Web3.</p>\n                    <p><p>Layer-one blockchain Sui Network has taken a step towards simplifying Web3 onboarding, allowing users to sign up for Sui-powered apps without having to manage an external crypto wallet or seed phrase. </p><p>In a Sept. 13 press <a href=\"https://www.businesswire.com/news/home/20230913187519/en/Sui-Adds-Login-with-Google-and-Twitch-Removes-Major-Barrier-to-Web3-Adoption\" target=\"_blank\" rel=\"noopener nofollow\">release</a> the Sui Foundation shared that users would be able to login into decentralized applications (DApps) by using Google, Facebook, and Twitch login details via a new zkLogin (Zero Knowledge login) feature. </p><p>Instead of dealing with pesky Web3 wallets, users can log in the same way they’re used to on other areas of the internet. </p><p>“By enabling users to access dApps with the social logins they have grown comfortable using, zkLogin removes a major hurdle for bringing the benefits of blockchain-based applications to billions of mainstream users,” said Sui Foundation managing director, Greg Siourounis.</p><p>Onboarding has <a href=\"https://cointelegraph.com/innovation-circle/web3-mass-adoption-how-web3-can-onboard-the-next-billion-users\">long been a pain point</a> for the blockchain industry, with users both new and experienced, complaining of a wide range usability issues — including the need to sign for transactions, maintain seed phrases and provide long strings of incomprehensible information to use certain DApps. </p><p>In a statement Adeniyi Abiodun, the co-founder and CPO of Mysten Labs, made note of this concern. </p><blockquote>“Too many individuals – whose everyday lives would benefit from blockchain technologies – are irretrievably lost at our doorstep, frustrated at installing web3 wallets and managing seed phrases.”</blockquote><p>The Sui Foundation explained that the zkLogin feature allows users to benefit from the privacy and ownership preserving features of blockchain-based applications without having to sacrifice on security. </p><p>Zero knowledge proof technology works by allowing one party to prove the truth of a certain assertion without revealing any information beyond the simple fact that the assertion is in fact true.</p><h3>Other firms try their hand at Web3 onboarding</h3><p>However, the Sui Foundation hasn’ been alone in breaking down the barriers to wider Web3 adoption. </p><p>On Aug. 28 cryptocurrency exchange DYOR <a href=\"https://cointelegraph.com/news/swipe-right-a-tinder-like-approach-to-venturing-into-defi-and-web3\">announced that it was developing</a> a social media-like application for users to interact with the decentralized finance (DeFi) market in a bid to lower the usability barrier of what’s often regarded as a complex facet of crypto markets. </p><p>Similarly, a new Web3 gaming company called <a href=\"https://cointelegraph.com/news/embracing-adoption-moxyio-unites-web3-gamings-evolution-beyond-tokenization\">Moxy has been attempting to onboard</a> gamers into the Web3 world, by leveraging a slightly different approach to blockchain gaming. Instead of utilizing play-to-earn economics, Moxy has created a competition-based esports platform where players can bet against each other and earn cryptocurrency. </p><p>Another major shift in onboarding has been <a href=\"https://cointelegraph.com/news/should-telegram-trading-bots-be-trusted\">the rise of Telegram trading bots</a> such as Unibot and <a href=\"https://cointelegraph.com/news/banana-gun-failed-contract-passed-audits-but-chat-gpt-found-the-bug-in-seconds\">BananaGun</a>, allowing traders to snipe new tokens and hunt airdrops from within the Telegram application. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-14T05:44:24.000Z",
    "title": "Californian lawmaker proposes legislation to protect actors from AI clones",
    "url": "https://cointelegraph.com/news/lawmaker-introduce-legislation-protect-actors-from-ai-copycats-amid-hollywood-strike",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/99bb0504-4478-4087-89e8-e4b1c2a2616a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Californian Assembly Member Ash Kalra labeled the bill as a “common sense requirement” to help protect the work of actors, artists and entertainers.</p>\n                    <p><p>A Californian lawmaker has introduced a bill to protect actors, artists, and entertainers from artificial intelligence, by mandating employment contracts to include informed consent when it comes to digital replicates. </p><p>Ash Kalra, an Assembly Member of the State of California — the lawmaker behind the bill — <a href=\"https://a25.asmdc.org/press-releases/20230913-assemblymember-kalra-sag-aftra-introduce-first-its-kind-legislation\" target=\"_blank\" rel=\"noopener nofollow\">argued</a> that generative AI presents a “real threat” to workers in the entertainment industry and its use should be banned unless a bargaining agreement between the parties is made.</p><p>The legislation, Assembly Bill 459, will eventually be assigned to a committee whose members will research, discuss, and make changes to the bill proposed by Kalra, which will then be put before the chamber for a vote.</p><p>Kalra explained in a Sept. 13 statement that “common sense requirements” like those in bill AB 459 need to be implemented to protect these workers:</p><blockquote>“Mandating informed consent and representation will help ensure workers are not unknowingly at risk of losing the right to their digital self, and with it, their careers and livelihoods.”</blockquote><p>The bill was also supported by Screen Actors Guild and American Federation of Television and Radio Artists (SAG-AFTRA) — a United States-based labor union representing over 100,000 media professionals around the world.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Kalra&#39;s office said AB 459 will be in print later today. Here&#39;s the draft language of the legislation. <a href=\"https://t.co/J2rIEUBvuh\">pic.twitter.com/J2rIEUBvuh</a></p>&mdash; Queenie Wong (@QWongSJ) <a href=\"https://twitter.com/QWongSJ/status/1701992271007433001?ref_src=twsrc%5Etfw\">September 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Duncan Crabtree-Ireland, the guild’s national executive director and chief negotiator stressed that protecting an actor’s digital image through consent-based laws is now a necessity.</p><p>“We believe that our members must maintain full control over the use of their digital selves through informed consent, and this is key if they are to be able to build and sustain a career,” he explained.</p><p>Crabtree-Ireland said AI copycats can lead to “abusive” and “exploitative” practices and that legislation will play a key role in curtailing such conduct:</p><blockquote>\"We see protection against the unjust transfers of these rights to be an imperative against potential abusive or exploitative practices. We are deeply concerned by the proliferation of AI-created audio and video content without full consent, and this legislation is an important step to ending these dangerous practices.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-rise-in-deepfake-customer-checks-verification\"><strong><em>AI deepfakes are getting better at spoofing KYC verification — Binance exec</em></strong></a></p><p>The Screen Actors Guild has been behind a nearly four-month-long ongoing strike action in Hollywood over base compensation, better working conditions and other contentious issues.</p><p>One of the issues raised revolves around AI and its use, with the workers demanding stricter protections against artificial intelligence and larger royalties for their work, known in the industry as residuals. </p><p>In a recent <a href=\"https://variety.com/2023/film/features/sean-penn-slams-will-smith-slap-ai-oscars-1235720417/\" target=\"_blank\" rel=\"noopener nofollow\">interview </a>with Variety, U.S. actor Sean Penn took a shot at many studios' desire to utilize actors' likenesses and voices for future AI use.</p><blockquote>“So you want my scans and voice data and all that. OK, here’s what I think is fair: I want your daughter’s, because I want to create a virtual replica of her and invite my friends over to do whatever we want in a virtual party right now.</blockquote><p>\"Would you please look at the camera and tell me you think that’s cool?” he asked. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-ai-content-cannibalization-problem-threads-a-loss-leader-for-ai-data/\"><strong><em>AI Eye: AI’s trained on AI content go MAD, is Threads a loss leader for AI data?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-14T05:54:05.000Z",
    "title": "Chainalysis Releases Crypto Index, Asia Leads in DeFi and Grassroots Growth",
    "url": "https://cryptodaily.co.uk/2023/09/chainalysis-releases-crypto-index-asia-leads-in-defi-and-grassroots-growth",
    "description": "The results show Asian and African countries in the lead, particularly in terms of retail crypto services and average amount value received from decentralized finance."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-14T06:00:18.000Z",
    "title": "Franklin Templeton Seeks to Offer Spot Bitcoin ETF in US",
    "url": "https://news.bitcoin.com/franklin-templeton-seeks-to-offer-spot-bitcoin-etf-in-us/",
    "description": "<img width=\"768\" height=\"433\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1853887246-768x433.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Franklin Templeton Seeks to Offer Spot Bitcoin ETF in US\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1853887246-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1853887246-1024x578.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1853887246-768x433.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1853887246-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1853887246-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1853887246-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_1853887246.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Asset manager Franklin Templeton has joined the race to issue America’s first exchange-traded fund (ETF) that invests directly in bitcoin. The company applied with the U.S. Securities and Exchange Commission (SEC), following in the footsteps of other major investment firms like Fidelity and Blackrock. Franklin Templeton Files for Spot Bitcoin ETF With U.S. SEC California-based [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T06:08:55.000Z",
    "title": "Vietnam’s FPT Secures 67 Million Chip Orders, Eyes AI Expansion and Education",
    "url": "https://www.cryptopolitan.com/vietnams-fpt-secures-67-million-chip-orders/",
    "description": "&#160;FPT, the prominent tech conglomerate in Vietnam, has made waves with its latest achievements. Valued at an impressive $5.2 billion on the Ho Chi Minh City stock exchange, FPT has secured orders for a staggering 67 million chips scheduled for delivery through 2025. These developments coincide with the company&#8217;s strategic endeavors to expand its influence ... <a title=\"Vietnam&#8217;s FPT Secures 67 Million Chip Orders, Eyes AI Expansion and Education\" class=\"read-more\" href=\"https://www.cryptopolitan.com/vietnams-fpt-secures-67-million-chip-orders/\" aria-label=\"More on Vietnam&#8217;s FPT Secures 67 Million Chip Orders, Eyes AI Expansion and Education\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T06:06:31.000Z",
    "title": "MIT Engineers Unveil Innovative Remote Patient Assessment Technique for Motor Disorders",
    "url": "https://www.cryptopolitan.com/mit-engineers-remote-patient-assessment/",
    "description": "In a remarkable advancement for healthcare, a team of engineers at the Massachusetts Institute of Technology (MIT) has introduced a pioneering approach for remotely appraising patients&#8217; motor function. This inventive strategy melds computer vision and machine-learning techniques, effectively evaluating individuals with motor disorders, particularly cerebral palsy. This innovative solution streamlines the evaluation process and promises ... <a title=\"MIT Engineers Unveil Innovative Remote Patient Assessment Technique for Motor Disorders\" class=\"read-more\" href=\"https://www.cryptopolitan.com/mit-engineers-remote-patient-assessment/\" aria-label=\"More on MIT Engineers Unveil Innovative Remote Patient Assessment Technique for Motor Disorders\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-14T05:49:00.000Z",
    "title": "Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?",
    "url": "https://www.cryptopolitan.com/tron-price-prediction/",
    "description": "Tron Price Prediction 2023-2032 TRX, or rather Tronix, is the native&#160;crypto asset of the TRON Network.TRON is a Blockchain-based decentralized network targeting an unchained, worldwide digital content entertainment structure using distributed ledger technology and enabling straightforward and cheap data sharing. How is Tron Price Prediction making out in this turbulent crypto weather as major crypto ... <a title=\"Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tron-price-prediction/\" aria-label=\"More on Tron Price Prediction 2023-2032: Is it a Good Time to buy TRX?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-14T06:00:46.000Z",
    "title": "Whales Accumulate Vast Amounts of Shiba Inu, THORChain, and Everlodge Cryptocurrencies for Significant Growth",
    "url": "https://www.crypto-news-flash.com/whales-accumulate-vast-amounts-of-shiba-inu-thorchain-and-everlodge-cryptocurrencies-for-significant-growth/?utm_source=rss&utm_medium=rss&utm_campaign=whales-accumulate-vast-amounts-of-shiba-inu-thorchain-and-everlodge-cryptocurrencies-for-significant-growth",
    "description": "<img width=\"512\" height=\"242\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T080721.614.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T080721.614.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-14T080721.614-300x142.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The Shiba Inu (SHIB) cryptocurrency has seen an exponential level of growth, as whales accumulated a total of 5 trillion tokens during the previous week alone. This massive influx in trading volume and appeal can propel its value forward.  In addition, whales also gained interest in THORChain (RUNE) tokens, as the protocol’s recent achievements have [...]"
  }
]