[
  {
    "source": "Cointelegraph",
    "date": "2023-06-27T04:06:01.000Z",
    "title": "$27 trillion AUM is perched over Bitcoin and crypto: CoinShares CSO",
    "url": "https://cointelegraph.com/news/27-trillion-ready-for-bitcoin-btc-coinshares-cso-meltem-demirors",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/6756c749-a433-43b2-b20a-36df08daffbb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The top eight financial institutions with an interest in Bitcoin and crypto have a whopping $27 trillion in combined assets under management.</p>\n                    <p><p>There is at least $27 trillion of assets managed by major U.S. financial institutions that are also “actively” seeking to provide clients with exposure to Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and crypto. </p><p>On June 26, CoinShares chief strategy officer <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/meltem-demirors\">Meltem Demirors</a> highlighted at least eight major financial institutions that have signaled moves in the digital assets space, including BlackRock’s spot Bitcoin ETF filing and <a href=\"https://cointelegraph.com/news/fidelity-to-beef-up-crypto-unit-by-another-25-with-100-new-hires\">Fidelity’s crypto</a> wealth management solutions.</p><p>Others include JP Morgan, Morgan Stanley, Goldman Sachs, BNY Mellon, Invesco and Bank of America.</p><p>“Many of the largest financial institutions in the US are actively working to provide access to Bitcoin and more,” she noted, adding that there is a whopping $27 trillion in assets under management between them.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ last week&#39;s <a href=\"https://twitter.com/BlackRock?ref_src=twsrc%5Etfw\">@BlackRock</a> spot Bitcoin ETF filing was big news! <br><br>but, it&#39;s not the only story. many of the largest financial institutions in the US are actively working to provide access to Bitcoin and more.<br><br>a quick glance - $27 trillion of client assets here! <a href=\"https://t.co/azmHZmUL2a\">pic.twitter.com/azmHZmUL2a</a></p>&mdash; Meltem Demirors (@Melt_Dem) <a href=\"https://twitter.com/Melt_Dem/status/1673362112653975554?ref_src=twsrc%5Etfw\">June 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Earlier this month, BlackRock’s June 16 spot Bitcoin exchange-traded fund <a href=\"https://cointelegraph.com/news/blackrock-apply-spot-bitcoin-etf-sec-nasdaq\">application</a> led to a wave of filings for similar products, boosting a narrative that suggests “institutions are coming” for Bitcoin. </p><p>BTC price reached a 2023-high of $31,185 on June 24 amid surging confidence, according to CoinGecko. </p><p>Demirors however noted that while \"the institutions are coming,” it’s still more of a trickle than a wave. \"We're seeing the bridges being built in real-time,\" she added.</p><p>It should be noted that the $27 trillion figure is an estimation of the total assets under management across the eight institutions and only a tiny portion of this would likely be allocated to crypto investments. </p><p>Nevertheless, Reflexivity Research co-founder, Will Clemente, still <a href=\"https://twitter.com/WClementeIII/status/1673322314795032581\" target=\"_blank\" rel=\"noopener nofollow\">echoed</a> Demiror’s sentiment, pointing out that Bitcoin’s market capitalization is less than $600 billion. </p><blockquote>“Between HSBC, Blackrock, Fidelity, and Schwab we are talking about $25 trillion in assets under management that will soon be enabled to buy Bitcoin.”</blockquote><p>Institutional investors are already showing more interest in Bitcoin-related funds. The ProShares Bitcoin Strategy ETF (BITO) saw its largest weekly inflow for a year pushing AUM over $1 billion, as <a href=\"https://cointelegraph.com/news/proshares-bitcoin-etf-bito-weekly-inflows-largest-in-year\">reported</a> by Cointelegraph. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blackrock-bitcoin-etf-trust-good-or-bad-for-btc\"><strong><em>BlackRock’s Bitcoin ETF ‘is the best thing to happen’ to BTC, or is it?</em></strong></a></p><p>Earlier this week, Federal Reserve Board of Governors member Michelle Bowman <a href=\"https://cointelegraph.com/news/uncertainty-over-digital-assets-traps-institutions-in-supervisory-void-fed-governor\">criticized</a> the absence of a crypto regulatory framework claiming that the uncertainty over the asset class traps institutions in a “supervisory void.”</p><p><em><strong>Magazine: </strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</strong></a></em></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-27T04:08:05.000Z",
    "title": "Tron Price Prediction: TRX Could Surge And Revisit $0.085",
    "url": "https://www.newsbtc.com/analysis/trx/tron-price-prediction-trx-revisit-0-085/",
    "description": "Tron price is up over 5% and gaining pace above $0.0725 against the US Dollar. TRX is outperforming Bitcoin and could rise further toward $0.0850. Tron is slowly moving higher above $0.0720 pivot level against the US dollar. The price is trading above $0.072 and the 100 simple moving average (4 hours). There was a break above a key bearish trend line with resistance near $0.0735 on the 4-hour chart of the TRX/USD pair (data source from Kraken). The pair is likely to continue higher if it clears the $0.0750 resistance level. Tron Price Jumps 5% In the past few days, Tron’s price saw a decent increase above the $0.0675 level against the US Dollar, similar to Bitcoin and Ethereum. TRX climbed above the $0.070 resistance and the 100 simple moving average (4 hours). There was a clear move above the 23.6% Fib retracement level of the key decline from the $0.0849 swing high to the $0.0646 low. Besides, there was a break above a key bearish trend line with resistance near $0.0735 on the 4-hour chart of the TRX/USD pair. TRON price is now trading above $0.072 and the 100 simple moving average (4 hours). On the upside, an initial resistance is near the $0.0750 zone. It is close to the 50% Fib retracement level of the key decline from the $0.0849 swing high to the $0.0646 low. Source: TRXUSD on TradingView.com A close above the $0.0750 resistance might send TRX further higher. The next major resistance is near the $0.0800 level, above which the bulls are likely to aim a larger increase toward the key $0.0850 zone in the coming days. Any more gains could set the pace for a move toward the $0.088 level. Are Dips Supported in TRX? If TRX price fails to clear the $0.0750 resistance, it could correct lower. Initial support on the downside is near the $0.0730 zone and the trend line. The next major support is near the $0.0715 level or the 100 simple moving average (4 hours). The main support is $0.0690, below which there is a risk of a move toward the $0.0650 support. Technical Indicators 4 hours MACD – The MACD for TRX/USD is gaining momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for TRX/USD is currently above the 50 level. Major Support Levels – $0.0732, $0.0715, and $0.0690. Major Resistance Levels – $0.0750, $0.080, and $0.085."
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-27T04:00:26.000Z",
    "title": "Tezos Releases Nairobi, XTZ Bulls Unmoved As Bears Dominate",
    "url": "https://www.newsbtc.com/news/tezos/tezos-releases-nairobi-xtz-bulls-unmoved-as-bears-dominate/",
    "description": "Tezos, the self-amending proof-of-stake blockchain, and an Ethereum competitor, recently implemented its latest upgrade via Nairobi. In a release, the 14th network improvement went live at block #3,760,129, tagging along platform enhancement and the simultaneous unveiling of the Tezos Ecosystem DAO.  Even so, while the upgrade is bullish for network users, there was no significant impact on XTZ prices. As of writing, XTZ, the native currency of the Tezos network, has been lower in the past 24 hours and is yet to reverse June 2023 losses. The Nairobi Upgrade The Nairobi upgrade was the network&#8217;s 14th update and a collaborative effort by numerous teams and has introduced several mainnet enhancements that could improve user experience. Teams include Nomadic Labs, Marigold, TriliTech, Oxhead Alpha, Tarides, DaiLambda, and Functori.  Key improvements tagged by the Nairobi upgrade include enhanced transaction throughput meaning transactions can now be processed faster, and transaction fees will be lower. With this release, the Tezos protocol is faster, as its throughput has increased eight times. This improvement applies to various operations such as transactions, smart contract calls, Smart Rollup maintenance operations, and management operations.  Related Reading: Cardano (ADA) Soars 10% In The Last Week, More Rallies Ahead? Moreover, the blockchain now also supports Smart Rollup functions. With new functions and internal Layer-2 messages, Tezos can synchronize rollup kernels seamlessly with future Tezos protocol upgrades. Specifically, the blockchain has also improved its terminology for better communication and understanding. For faster consensus, the upgrade enhances the speed of pre-attestation propagation. Tezos Ecosystem DAO The Tezos community welcomes the Tezos ecosystem DAO to streamline on-chain funds deployment and treasury management for vital initiatives within the Tezos ecosystem.  With its launch, the decentralized automated organization (DAO) allows community members to submit funding requests for Tezos-related initiatives. These requests undergo curation, voting, and distributing XTZ. The DAO will be transparent, ensuring all activities are publicly visible to enhance trust and accountability within the community. Related Reading: Kaspa (KAS) Takes Altcoin Market By Storm With 60% Growth Initially, the DAO is governed by a three-out-of-five multi-sig setup, with participating organizations like Trilitech, Tezos Foundation, and Tezos India Foundation holding the keys. Despite all these changes, XTZ prices remain under pressure and trail the performance of Bitcoin and Ethereum. As of writing on June 26, XTZ is changing hands at $0.80, up 13% from June 2023 lows. However, even with optimistic traders, XTZ bulls have failed to push prices above $0.95, marking June 2023 highs.  Overall, the cryptocurrency market appears to be bottoming up but is yet to close above crucial liquidation levels marking complete reversals from 2022 pits. XTZ remains bearish, down 45% from February highs, as prices are $0.10 away from December 2022 lows. Feature Image From Canva, Chart From TradingView"
  }
]