[
  {
    "source": "CryptoSlate",
    "date": "2023-05-26T00:30:43.000Z",
    "title": "Unbanked shuts down crypto services, says US regulations prevented fundraising",
    "url": "https://cryptoslate.com/unbanked-shuts-down-crypto-services-says-us-regulations-blocked-funding/",
    "description": "<p>Unbanked, a cryptocurrency card and trading platform, said May 25 that it would be winding down its services due to harsh U.S. regulations. Regulations affected funding Unbanked cited regulations as the primary reason for its shutdown. The firm asserted that regulators in the U.S. are &#8220;actively trying to stop companies (banks and fintechs) from supporting [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/unbanked-shuts-down-crypto-services-says-us-regulations-blocked-funding/\">Unbanked shuts down crypto services, says US regulations prevented fundraising</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-05-26T00:15:00.000Z",
    "title": "Stablecoins’ Market Capitalization Contracts for 14th Month in a Row",
    "url": "https://www.cryptoglobe.com/latest/2023/05/stablecoins-market-capitalization-contracts-for-14th-month-in-a-row/",
    "description": "This month the total market capitalization of the stablecoin sector within the cryptocurrency space has reached its lowest level since September 2021, marking its fourteenth consecutive month of decline, as it fell 0.45% to $130 billion as of May 23. According to CCData’s latest Stablecoins &amp; CBDCs report, stablecoin trading volumes fell this month by […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-26T00:24:24.000Z",
    "title": "How Does the DAO Accounting Framework Ensure Comprehensibility and Accessibility?",
    "url": "https://www.cryptopolitan.com/dao-accounting-framework-comprehensibility/",
    "description": "In the digital age where blockchain technology is reshaping our world, Decentralized Autonomous Organizations (DAOs) have emerged as a novel form of organizational structure. These entities are characterized by decentralized control and governance, facilitated by smart contracts on a blockchain network. Over the past two years, the size of combined DAO treasuries has expanded exponentially, ... <a title=\"How Does the DAO Accounting Framework Ensure Comprehensibility and Accessibility?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/dao-accounting-framework-comprehensibility/\" aria-label=\"More on How Does the DAO Accounting Framework Ensure Comprehensibility and Accessibility?\">Read more</a>"
  }
]