[
  {
    "source": "CoinDesk",
    "date": "2023-11-17T16:44:15.000Z",
    "title": "New Form 1099-DA: What it Means for Digital Asset Brokers and Their Customers",
    "url": "https://www.coindesk.com/consensus-magazine/2023/11/17/new-form-1099-da-what-it-means-for-digital-asset-brokers-and-their-customers/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Unpacking the IRS’ controversial new crypto tax regulation proposals."
  },
  {
    "source": "Decrypt",
    "date": "2023-11-17T16:58:00.000Z",
    "title": "Someone Just Paid $400K for This Ethereum NFT of Vitalik as a Jester",
    "url": "https://decrypt.co/206475/someone-just-paid-400k-ethereum-nft-vitalik-jester",
    "description": "The painting of Vitalik Buterin, \"EthBoy\" by Trevor Jones and Alotta Money, broke records in 2020. The Ethereum NFT just sold for a lot more."
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-11-17T16:52:28.000Z",
    "title": "SEC Delays Decision on HashDex Ethereum Spot ETF Application",
    "url": "https://cryptobriefing.com/sec-delays-hashdex-ethereum-spot-etf-application/?utm_source=feed&utm_medium=rss",
    "description": "SEC slows Ethereum ETF race, delaying ruling on Hashdex's spot fund beyond initial 45-day deadline as regulatory concerns persist."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-17T16:47:14.000Z",
    "title": "Russian Ruble surpasses USD in astonishing performance",
    "url": "https://www.cryptopolitan.com/ruble-surpasses-usd-astonishing-performance/",
    "description": "The Russian ruble is making headlines for its remarkable performance in November, outshining the US dollar despite facing economic sanctions from the White House. Over the past two weeks, the Russian ruble has surged by an impressive 12% against the US dollar, defying expectations and market dynamics. While the US dollar has demonstrated strength against ... <a title=\"Russian Ruble surpasses USD in astonishing performance\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ruble-surpasses-usd-astonishing-performance/\" aria-label=\"More on Russian Ruble surpasses USD in astonishing performance\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-17T16:42:03.000Z",
    "title": "Polygon gas fees spike amid Ordinals-inspired craze",
    "url": "https://www.cryptopolitan.com/polygon-gas-amid-ordinals-inspired-craze/",
    "description": "The surge in gas fees on Ethereum’s Layer-2 solution, Polygon, proved to be a significant event, experiencing an extraordinary increase of over 1,000% and reaching a peak of $0.10. This surge was primarily attributed to heightened transaction activity related to the minting of tokens known as POLS, inspired by the Ordinals protocol. Polygon founder Sandeep ... <a title=\"Polygon gas fees spike amid Ordinals-inspired craze\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-gas-amid-ordinals-inspired-craze/\" aria-label=\"More on Polygon gas fees spike amid Ordinals-inspired craze\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-17T17:06:23.000Z",
    "title": "RealOpen launches platform for buying real estate using crypto",
    "url": "https://crypto.news/realopen-launches-platform-for-buying-real-estate-using-crypto/",
    "description": "RealOpen is live, offering a new solution for buying real estate with crypto"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-17T16:58:33.000Z",
    "title": "Yearn.Finance’s YFI token skyrockets on upcoming v3 launch news",
    "url": "https://crypto.news/yearn-finances-yfi-token-skyrockets-on-upcoming-v3-launch-news/",
    "description": "Yearn.Finance skyrockets over 100% as the team announces that v3 is coming soon."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-17T16:49:11.000Z",
    "title": "Bitcoin inscriptions wallet UniSat unveils cutting-edge developer services",
    "url": "https://crypto.news/bitcoin-inscriptions-wallet-unisat-unveils-cutting-edge-developer-services/",
    "description": "UniSat Wallet introduces comprehensive developer services for creating trading bots, Ordinals, brc-20 explorers, and apps with integrated blockchain features."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-17T16:41:30.000Z",
    "title": "Crypto investors diversifying with Ethereum and Everlodge, Cardano may retest $0.30",
    "url": "https://crypto.news/crypto-investors-diversifying-with-ethereum-and-everlodge-cardano-may-retest-0-30/",
    "description": "Cardano could fall as Ethereum projected to rally above $2,300. Meanwhile, Everlodge aims to reshape the real estate industry"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-17T17:00:23.000Z",
    "title": "Cardano Breakout Of Epic Proportions: Analyst Predicts 1600% Rally To $6.5",
    "url": "https://www.newsbtc.com/news/cardano/cardano-breakout-1600-6-5/",
    "description": "Crypto analyst Ali Martinez has noted Cardano (ADA) is open to an unprecedented rally. Price activity suggests that Cardano is moving into a state of consolidation, which coincides with a moderate decline in the general cryptocurrency market.  Nevertheless, the analyst is of the opinion that Cardano&#8217;s current consolidation is similar to one it had prior to a 2980% increase. If previous events are any indicator, we could see Cardano mirror this move and spike past its all-time high.  Recent Cardano Price Action Cardano is still up by 48.47% in a 30-day timeframe, but it has lost 7.21% of its market value in the past 24 hours and is currently trading at $0.372. According to chart analysis by Ali Martinez, the current consolidation looks similar to the 2018-2020 consolidation phase without considering the COVID-19 crash.  Related Reading: Over 100 Million MATIC Incinerated In POLS Mint, But The Gold Rush Is Far From Over Following the conclusion of this phase, Cardano witnessed price surges in the first quarter of 2021, one of which was a price surge of nearly 100% in seven days in early February 2021. This marked the beginning of a prolonged bullish run that drove Cardano&#8217;s price up by more than 2980% and brought it to its current all-time high of $3.10 in September 2021.  #Cardano&#8216;s current consolidation trend eerily mirrors the 2018-2020 phase without the COVID-19 crash! If so, $ADA could break through the $0.45 resistance around the first week of December. The upswing could send #ADA to $0.75 by late December. Looking to trade this setup? Head… pic.twitter.com/u3KzOsZj2F — Ali (@ali_charts) November 16, 2023 If analyst Ali Martinez is right, Cardano is on the cusp of a massive breakout that could send the price of ADA skyrocketing in the same manner. A look through his price chart shared on social media estimates the price of Cardano surging past the $6.5 level, a surge of more than 1,600%. The journey to this price level is certainly not going to be a smooth one. ADA is going to face major resistance at the $0.45 level, which it has to break through to start with. This won’t be easy, as the coin has already tried and failed to break through this barrier in April. It did go over to reach $0.4533 on April 16, but it fell 15% to 0.383 by April 22nd. Related Reading: Dogecoin Is Literally Going To The Moon: 100% DOGE Price Blast Expected According to the analyst, if a strong price spike were to occur now, ADA could break past $0.45 by the first week of December. If Cardano breaks $0.45, the next stop would be $0.75 by late December, a 66% increase from current levels.  According to Coinmarketcap&#8217;s Fear &#38; Greed Index, the crypto market is now at a greed level of 71. For Cardano to mimic the 2021 bull run, the overall crypto market sentiment would need to maintain this very strong bullish and greed level. Interest in altcoins would have to pick up, and Cardano’s progress on key milestones like smart contracts and DeFi would need to drive hype. ADA trending at $3.7 &#124; Source: ADAUSD on Tradingview.com Featured image from Forbes, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-17T16:44:42.000Z",
    "title": "Keeping an Eye on Ripple IPO Date: When Will the Company Hit the Market?",
    "url": "https://www.crypto-news-flash.com/keeping-an-eye-on-ripple-ipo-date-when-will-the-company-hit-the-market/?utm_source=rss&utm_medium=rss&utm_campaign=keeping-an-eye-on-ripple-ipo-date-when-will-the-company-hit-the-market",
    "description": "<img width=\"1038\" height=\"584\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE.png 1038w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-300x169.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-1024x576.png 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-768x432.png 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-24x14.png 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-36x20.png 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/03/ripple-in-UAE-48x27.png 48w\" sizes=\"(max-width: 1038px) 100vw, 1038px\" />Market experts predict that Ripple will go public once its legal dispute with the U.S. Securities and Exchange Commission (SEC) is over. Pre-IPO shares are already available and trading for around $60, a clear sign of their demand in the market. The crypto market is eagerly awaiting news of a Ripple IPO after months of [...]"
  }
]