[
  {
    "source": "Cointelegraph",
    "date": "2023-09-04T14:45:29.000Z",
    "title": "Bitcoin futures data hints at $22K as the next logical step",
    "url": "https://cointelegraph.com/news/bitcoin-futures-22k-btc-price-logical-step",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/49d144c9-cf88-400a-a999-64da5067206d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC derivatives flipped bearish after Bitcoin failed to establish bullish momentum despite the heightened spot ETF prospects.</p>\n                    <p><p>A Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) price correction down to $22,000 is becoming increasingly likely as BTC derivatives have begun to exhibit bearish tendencies.</p><p>The price chart of Bitcoin leaves little doubt that investor sentiment worsened after the <a href=\"https://cointelegraph.com/magazine/sec-delays-btc-etf-decision-grayscale-triumphs-sec-and-bitboy-gets-the-boot-hodlers-digest-aug-27-sept-2/\">much-hyped victory by Grayscale Asset Manager</a> against the U.S. Securities and Exchange Commission (SEC) on Aug. 29 and <a href=\"https://cointelegraph.com/magazine/sec-delays-btc-etf-decision-grayscale-triumphs-sec-and-bitboy-gets-the-boot-hodlers-digest-aug-27-sept-2/\">the postponement</a> of multiple spot BTC exchange-traded fund (ETF) requests by the SEC.  </p><p>The central question remains whether the prospects of an ETF can outweigh the growing risks.</p><h2>Spot Bitcoin ETF hype is fading</h2><p>By Aug. 18, the entire 19% rally that occurred following BlackRock ETF initial filing had fully retracted as Bitcoin moved back to $26,000. </p><p>Next, there was a failed attempt to reclaim the $28,000 support as investors raised the odds of an ETF approval following the positive news on Grayscale Bitcoin Trust (GBTC) request.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/934f2e4e-e4ae-4856-8fd6-20ed9300b467.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin/USD price index, 1-day. Source: TradingView</em></figcaption></figure><p>Cryptocurrency investors' morale deteriorated as the S&amp;P 500 index closed at 4,515 on Sept. 1, merely 6.3% below its all-time high from January 2022. Even gold, which hasn't been able to break above the $2,000 level since mid-May, is 6.5% away from its all-time high. Consequently, the general feeling for Bitcoin's investors just 7 months ahead of its halving in 2024 is certainly less positive than expected.</p><p>Some analysts will pin Bitcoin's lackluster performance on the ongoing r<a href=\"https://cointelegraph.com/news/sec-lawsuits-coinbase-binance-ceos-net-worths\">egulatory actions against the two leading exchanges</a>, Binance and Coinbase. Moreover, multiple sources claim that the U.S. Department of Justice (DOJ) is likely to <a href=\"https://cointelegraph.com/news/sealing-docs-binance-case-suggests-criminal-probe-says-former-sec-official\">indict Binance in a criminal probe</a>. The claims are based on allegations of money laundering and potential violations of sanctions involving Russian entities.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/weekly-close-btc-price-double-top-5-things-bitcoin-this-week\">Weekly close risks BTC price ‘double top’ — 5 things to know in Bitcoin this week</a></em></p><p>Moreover, multiple sources claim that the U.S. Department of Justice (DOJ) is likely to <a href=\"https://cointelegraph.com/news/sealing-docs-binance-case-suggests-criminal-probe-says-former-sec-official\">indict Binance in a criminal probe</a>. The claims are based on allegations of money laundering and potential violations of sanctions involving Russian entities.</p><p>North Code Capital CIO and Bitcoin supporter Pentoshi expressed the current conditions in a social network post:</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I think we still will eventually get some bearish Binance news vs DoJ. That should be seen as opportunity! <br><br>But overall. We also likely get ETF’s this year or early next year and <a href=\"https://twitter.com/search?q=%24btc&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$btc</a> heading to 401k’s <br><br>Said it before but this is a year for accumulation. Don’t lose sight of the…</p>&mdash; Pentoshi  euroPeng  (@Pentosh1) <a href=\"https://twitter.com/Pentosh1/status/1697652202444046447?ref_src=twsrc%5Etfw\">September 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>According to Pentoshi, the potential gains from a spot ETF approval outweigh the price impact from the eventual regulatory actions against the exchanges. There's no way to ascertain whether such an assumption is valid, but such an analysis fails to consider that U.S. inflation, as measured by CPI, has come down to 3.2% in July 2023 from 9.1% in June 2022.</p><p>Moreover, the U.S. Federal Reserve's (Fed) total assets have been reduced to $8.12 trillion, down from the recent $8.73 peak in March 2023. This signals that the monetary authority has been draining liquidity from the markets, which is detrimental to Bitcoin's inflation protection thesis.</p><p>Looking at a longer time frame, Bitcoin's price has been holding the $25,000 level since mid-March, but taking a closer look at derivatives data shows that bulls' conviction is getting tested.</p><h2>Bitcoin derivatives show decreasing demand from bulls</h2><p>Bitcoin monthly futures typically trade at a slight premium to spot markets, indicating that sellers are asking for more money to delay settlement. As a result, BTC futures contracts in healthy markets should trade at a 5 to 10% annualized premium — a situation known as contango, which is not unique to crypto markets.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/2ee5addd-4c98-4c88-a5dc-b2cfd7e515aa.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin one-month futures annualized premium. Source: Laevitas.ch</em></figcaption></figure><p>Bitcoin's current 3.5% futures premium (basis rate) is at its lowest point since mid-June, prior to BlackRock's filing for a spot ETF. This indicator reflects a decreased demand for leverage buyers utilizing derivative contracts.</p><p>Traders should also analyze options markets to understand whether the recent correction has caused investors to become less optimistic. The 25% delta skew is a telling sign when arbitrage desks and market makers overcharge for upside or downside protection.</p><p>In short, if traders anticipate a Bitcoin price drop, the skew metric will rise above 7%, and phases of excitement tend to have a negative 7% skew.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/6c60ad40-54df-401a-afaa-ff137979d15a.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin 30-day options 25% delta skew. Source: Laevitas.ch</em></figcaption></figure><p>As displayed above, the options' 25% delta skew has recently entered bearish territory, with protective put (sell) options trading at a 9% premium on Sep. 4 compared to similar call (buy) options.</p><h2>BTC futures hint at $22,000 next</h2><p>Bitcoin derivatives data suggests that the bearish momentum is gaining strength, especially since the approval of a spot ETF could potentially be deferred until 2024, given the SEC's concerns about the lack of measures to prevent a significant portion of <a href=\"https://cointelegraph.com/news/why-is-the-crypto-market-down-this-week\">trading occurring on unregulated offshore exchanges</a> based on stablecoins.</p><p>Meanwhile, the uncertainty in the regulatory landscape does favor the bears as there's no way to dismiss the fear, uncertainty, and doubt (FUD) surrounding potential actions from the DOJ or the ongoing lawsuits against the exchanges by the SEC. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-etf-sec-deadline\">Bitcoin ETF applications; Who is filing and when the SEC may decide</a></em></strong></p><p>Ultimately, a retracement down to $22,000 — the level last seen when Bitcoin’s futures premium was 3.5% — is the most likely scenario, considering the recent inability to sustain a positive price momentum despite the heightened chances of a spot Bitcoin ETF approval.</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-04T15:04:07.000Z",
    "title": "Bitcoin RSI Hits 5-Year Low, Gala’s NFT Mystery Boxes Launch, and Pomerdoge Presale Booms",
    "url": "https://cryptodaily.co.uk/2023/09/bitcoin-rsi-hits-5-year-low-galas-nft-mystery-boxes-launch-and-pomerdoge-presale-booms",
    "description": "In this article, we'll take a look at the latest developments in the cryptocurrency world, including Bitcoin (BTC) hitting its five-year low RSI and Gala's NFT mystery boxes launch."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-04T15:04:46.000Z",
    "title": "Gala Games CEO Files $130 Million Theft Lawsuit Against Co-Founder, Alleges Deception",
    "url": "https://www.crypto-news-flash.com/gala-games-ceo-files-130-million-theft-lawsuit-against-co-founder-alleges-deception/",
    "description": "<img width=\"1920\" height=\"1280\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/coins-912718_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"GALA\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/coins-912718_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/coins-912718_1920-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/coins-912718_1920-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/coins-912718_1920-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Schiermeyer accuses Thurston of diverting 8.6 billion GALA tokens and selling them without company knowledge Gala Games&#8217; response includes the introduction of Gala v2 Tokens and Thurston&#8217;s Involvement in Legal Disputes. A legal conflict is unfolding within the Gala Games ecosystem as the project&#8217;s co-founders, Eric Schiermeyer and Wright Thurston, have taken each other to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-04T15:00:23.000Z",
    "title": "Shibarium, Shiba Inu, Dogecoin, ShibaSwap, and Pepe Coin, New Meme Coin ApeMax Shines: Here’s Why You Should Keep an Eye on It",
    "url": "https://www.crypto-news-flash.com/shibarium-shiba-inu-dogecoin-shibaswap-and-pepe-coin-new-meme-coin-apemax-shines-heres-why-you-should-keep-an-eye-on-it/",
    "description": "<img width=\"512\" height=\"287\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-40.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-40.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-40-300x168.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto ecosystem is buzzing with established players like Shibarium, the much-anticipated Layer 2 solution for Shiba Inu, ShibaSwap&#8217;s decentralized exchange features, and meme coin pioneers Dogecoin and Pepe Coin. Yet, emerging conspicuously among these heavyweights is a promising newcomer: ApeMax. Discover ApeMax: The Fresh Sensation in the Crypto Arena While crypto aficionados are eagerly [...]"
  }
]