[
  {
    "source": "CoinDesk",
    "date": "2023-11-15T13:16:05.000Z",
    "title": "Germany's Commerzbank Wins Crypto Custody License",
    "url": "https://www.coindesk.com/policy/2023/11/15/germanys-commerzbank-wins-crypto-custody-license/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "It's the first German full-service bank to be granted the custody license, according to a statement."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-15T13:21:00.000Z",
    "title": "3 reasons why Bitcoin price failed to break $37K",
    "url": "http://cointelegraph.com/news/bitcoin-price-37k-resistance-failed-to-break",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/5e49beb2-e60d-4d54-ab52-e8ee7e8585b5.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin’s latest price pullback to $35,000 was driven by softer U.S. inflation, China’s economic challenges and regulatory uncertainties.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) recently surged above $37,000 between Nov. 10 and 12, only to falter and undergo a correction toward $35,000 on Nov. 13. </p><p>This abrupt movement triggered the liquidation of $121 million worth of long futures contracts, and while Bitcoin’s price stabilized around $35,800 on Nov. 14, investors are left pondering the underlying <a href=\"https://cointelegraph.com/news/btc-price-1-week-lows-bitcoin-whales-sell-35k\">factors behind this downturn</a><a href=\"https://cointelegraph.com/news/btc-price-1-week-lows-bitcoin-whales-sell-35k\"></a>.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/255d9a9a-4596-45a7-abe7-0a93769b9ad7.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin 12-hour price index, USD. Source: TradingView</em></figcaption></figure><h2>U.S. inflation, gov’t shutdown impact on BTC price</h2><p>Part of the catalyst behind this movement was the unexpected softening of United States inflation data on Nov. 14. The U.S. Consumer Price Index (CPI) <a href=\"https://cointelegraph.com/news/why-is-bitcoin-price-down-today\">showed a 3.2% increase in October</a> compared to 2022, leading to a decline in yields on U.S. short-term Treasurys. </p><p>This triggered buying activity in traditional assets, potentially reducing the demand for alternative hedge instruments like Bitcoin. If the <a href=\"https://cointelegraph.com/news/how-do-the-fed-s-interest-rates-impact-the-crypto-market\">Federal Reserve’s strategy</a> to curb inflation successfully without causing a recession pans out, Bitcoin may lose some of its appeal as a hedge.</p><p>Even Moody’s rating agency lowering its outlook on the U.S. credit to negative from stable on Nov. 11 did not sway favorably toward Bitcoin and other alternative hedges. Instead, investors sought refuge in short-term 5.25% fixed-income instruments, explaining why gold struggled to surpass $2,000 despite escalating debt levels and global economic challenges.</p><p>In China, October’s retail sales data indicated a 7.6% increase — the fastest since May. However, this apparent recovery conceals underlying issues, notably a 9.3% decline in property sector investments in the first 10 months of the year. China’s economic stimulus measures, including policy support and liquidity injections, have yielded only modest benefits.</p><p>Given that China is the world’s second-largest economy, its economic situation might contribute to investors’ cautious stance on riskier assets like Bitcoin, particularly when viewed within the broader global economic context. Additionally, recent political developments surrounding <a href=\"https://cointelegraph.com/news/industry-leaders-policymakers-government-shutdown\">U.S. government shutdown threats</a> could also influence Bitcoin’s performance.</p><p>The U.S. House of Representatives passed a bill on Nov. 14 to keep the government operational through the holiday season, temporarily averting a fiscal crisis. However, this measure sets the stage for potential spending disputes in the coming year, including a provision to cut federal spending by 1% across the board in 2024 if no agreement is reached.</p><h2>Spot Bitcoin ETF expectations, regulatory scrutiny </h2><p>The cryptocurrency market experienced a negative reaction to a <a href=\"https://cointelegraph.com/news/delaware-authorities-refer-fake-blackrock-xrp-trust-filing-to-state-s-justice-department\">fraudulent BlackRock XRP trust filing</a><a href=\"https://cointelegraph.com/news/delaware-authorities-refer-fake-blackrock-xrp-trust-filing-to-state-s-justice-department\"></a> on Nov. 13. Although it initially sparked hopes for an XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) spot exchange-traded fund (ETF) in the U.S., the $9 trillion asset manager swiftly dismissed the claim.</p><p>While this event is not directly linked to Bitcoin, it has <a href=\"https://cointelegraph.com/news/xrp-hoax-filing-spike-bad-look-wont-sway-sec-etf-decisions\">drawn regulatory scrutiny to the crypto sector</a> at a sensitive time when numerous spot Bitcoin ETF applications await review by the U.S. Securities and Exchange Commission (SEC). Consequently, irrespective of the parties involved, the outcome represents a net positive for the cryptocurrency market.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/tether-usdt-growth-spot-bitcoin-etf\"><strong><em>Tether credits USDT growth surge to ETF excitement, emerging markets</em></strong></a></p><p>On Nov. 13, Bloomberg ETF analyst James Seyffart <a href=\"https://twitter.com/JSeyff/status/1724054789099573709?t=V-_gDCTQEVROSiJaqQywbg&amp;s=19\" target=\"_blank\" rel=\"noopener nofollow\">emphasized</a> that approval for a spot Bitcoin ETF should not be expected before January. This statement came amid heightened market anticipation surrounding upcoming SEC decisions <a href=\"https://cointelegraph.com/news/first-deadline-window-looms-for-sec-to-approve-bitcoin-etfs-law-decoded-nov-6-13\">scheduled for Nov. 17</a> and Nov. 21.</p><h2>Heightened fear of global economic recession</h2><p>In essence, the drop in Bitcoin’s price after flirting with the $37,000 level cannot be attributed to a single event. Investors may have reassessed their positions, considering Bitcoin’s substantial $725 billion market capitalization. For comparison, Berkshire Hathaway, a major conglomerate, boasts a $760 billion valuation while posting profits of $76.7 billion in the past year.</p><p>Bitcoin’s stringent monetary policy ensures scarcity and predictability, but major global corporations can repurchase their own stocks using earnings, effectively reducing the available supply. Furthermore, during economic downturns, these trillion-dollar companies can leverage their strong balance sheets during economic downturns to acquire competitors or expand their market dominance.</p><p>Ultimately, Bitcoin’s challenge in maintaining momentum above $37,000 is influenced by factors such as data supporting the Federal Reserve’s strategy for a soft economic landing and concerns over global economic growth. These elements continue to create an unfavorable landscape for Bitcoin’s value, especially if the SEC delays decisions on spot BTC ETFs, aligning with market expectations.</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-15T13:20:00.000Z",
    "title": "Web3 advocate and author Alex Tapscott on the future of blockchain mass adoption",
    "url": "http://cointelegraph.com/news/web3-advocate-and-author-alex-tapscott-on-the-future-of-blockchain-mass-adoption",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/9298de25-c9ff-459b-908c-e04b3b67513b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Alex Tapscott says Web3 offers “a set of tools” that can be used to “build new business models, to create new kinds of organizations [and] to transform existing industries.”</p>\n                    <p><p>Web3, blockchain, crypto and mass adoption were major buzzwords in 2021 and 2022, but the public interest in the terms fell to the wayside over the last year as media headlines narrowed their focus to the now defunct FTX exchange and the trial of its founder, <a href=\"https://cointelegraph.com/news/ftx-foundation-employee-fights-for-bonus\">Sam Bankman-Fried</a>. </p><p>Fast-forward to the present, where media headlines are focused on pending spot <a href=\"https://cointelegraph.com/news/xrp-hoax-filing-spike-bad-look-wont-sway-sec-etf-decisions\">Bitcoin exchange-traded fund applications</a>, more than 100% year-to-date price gains for Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and a revival in the NFT markets. </p><p>Perhaps, Web3 is back. </p><p>On Episode 14 of <em>The Agenda </em>podcast, hosts Ray Salmond and Jonathan DeYoung spoke with Alex Tapscott about his deep views on Web3 and how the tech and ideas backing it will “transform the existing industries.” </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/58c9e09b-c797-4d87-a14f-6a4d7d363046.jpg\"  /></figure><h2>The blockchain revolution is still happening</h2><p>Revolutions catalyze transformation, but these changes tend to happen gradually, rather than all at once. Tapscott detailed the impact he sees Web3 having on various industries with <em>The Agenda</em> and in his new book, <em>Web3, charting the internet's next economic and cultural frontier,</em> where he breaks down and explains all things Web3, from NFTs and DAOs to the metaverse.</p><p>While NFTs, DAOs and the metaverse are often presented as full-on replacements for the current structures in use, Tapscott explained that the ideas and the tools offered Web3 can more effecitvey be integrated to existing industries. </p><blockquote>“But what's more interesting is that not that the existing companies will change to be like the new thing, but rather that new things will come along that will, if they’re useful and fun, drive adoption. People will use them because they prefer them and think that if they’re in Web3, that part of that will be that individuals have more sovereignty and control over their data and their assets.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/meet-the-13-year-old-student-selling-sneakers-for-bitcoin-the-agenda-podcast\"><strong><em>Meet the 13-year-old student selling sneakers for Bitcoin: The Agenda podcast</em></strong></a></p><p>Regarding the <a href=\"https://cointelegraph.com/news/ripple-exec-reiterates-need-tech-neutral-crypto-regulations\">regulatory challenges</a> that continue to create hurdles for the Web3 industry and whether or not blockchain “fixes everything,” Tapscott said referred to a conversation he had with Andreessen Horowitz General Partner Chris Dixon. Drawing from his conversation with Dixon, Tapscott said:</p><blockquote>“Going back to what Dixon said is that the technology improves and gets more useful and then becomes something that everybody wants to use because we’ve ironed out the kinks. And I think that we’re still, frankly, in the ironing out the kinks phase. So that’s point number one. But point number two is like just because we iron out the kinks and make this stuff better and more useful doesn’t mean it solves every problem.”</blockquote><p>Tapscott explained that many people are “looking for salvation in technology” and that they are likely to be disappointed. </p><blockquote>“I think a lot of people make Bitcoin into a religion. And I can tell you like any religion that came before it, it’s maybe a well, I don't want to get political or anything like that, but like comment on people’s faith. But I just think like it's just not the right way to think about technology as like something that can solve all your problems.”</blockquote><template data-ct-widget=\"buzzsprout\" data-buzzsprout-podcast-id=\"2096305\"></template><h2>Web3 provides tools, not a template for replacement</h2><p>Getting back to the discussion of peoples’ belief that Web3 can “fix everything,” Tapscott suggested that Web3, DAOs, crypto and blockchains should be viewed as tools rather than paradigm shift catalysts that will replace current industries. </p><blockquote>“I think that it's a toolkit, or it's a set of tools that we can use to build new business models, to create new kinds of organizations, to transform existing industries. And all that stuff is really cool. And maybe in the process, we can put more power in the hands of people, give them a chance to earn a share of the services and applications that they use, and make it easier for anyone to connect to the global economy, even if they live in a part of the world that's normally overlooked.”</blockquote><p>To hear more from Tapscott’s conversation with <em>The Agenda </em>— including his take on how Web3 will eventually become a daily part of everyone’s life — listen to the full episode on <a href=\"https://cointelegraph.com/podcasts/the-agenda\">Cointelegraph’s Podcasts page</a>, <a href=\"https://podcasts.apple.com/us/podcast/the-agenda/id1659393166\" target=\"_blank\" rel=\"noopener nofollow\">Apple Podcasts</a> or <a href=\"https://open.spotify.com/show/6azmkkIXj5LQbxTRAbAqXS\" target=\"_blank\" rel=\"noopener nofollow\">Spotify</a>. And don’t forget to check out Cointelegraph’s <a href=\"https://cointelegraph.com/podcasts\">full lineup</a> of other shows! </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/i-spent-a-week-working-in-vr-it-was-mostly-terrible-however/\"><strong><em>I spent a week working in VR. It was mostly terrible, however…</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-15T13:25:41.000Z",
    "title": "Market shift in favor of Bitcoin as key technical indicators suggest a bullish phase",
    "url": "https://cryptoslate.com/insights/market-shift-in-favor-of-bitcoin-as-key-technical-indicators-suggest-a-bullish-phase/",
    "description": "<p>Quick Take Bitcoin has recently reasserted its position above the $36,000 benchmark, triggering a wave of short liquidations. In the past four hours alone, Bitcoin shorts worth $13 million have been liquidated, contributing to the total crypto market liquidations of $30 million. This development indicates the shifting market dynamics as traders adapt to the evolving [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/market-shift-in-favor-of-bitcoin-as-key-technical-indicators-suggest-a-bullish-phase/\">Market shift in favor of Bitcoin as key technical indicators suggest a bullish phase</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-11-15T13:25:23.000Z",
    "title": "A New, AI-driven Crypto Exchange Offers Payment Flexibility, Exclusive Benefits and Significant Earning Potential",
    "url": "https://cryptodaily.co.uk/2023/11/a-new-ai-driven-crypto-exchange-offers-payment-flexibility-exclusive-benefits-and-significant-earning-potential",
    "description": "habit aims to integrate cutting-edge technology and real-world applications in a new crypto platform and app, which are currently in development. The simple, guided interface will make app usage a daily habit."
  },
  {
    "source": "BTCManager",
    "date": "2023-11-15T13:29:22.000Z",
    "title": "Marathon shifts to international ventures ahead of Bitcoin halving",
    "url": "https://crypto.news/marathon-shifts-to-international-ventures-ahead-of-bitcoin-halving/",
    "description": "Marathon, the world&#8217;s largest Bitcoin mining firm boasting a hash rate of 19.2 EH/s, is now focusing on international joint ventures for future growth. On Nov. 14, Bitcoin (BTC) mining expert Jaran Mellerud shared Marathon&#8217;s operations report, highlighting the company&#8217;s&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-15T13:21:34.000Z",
    "title": "OKX partners with Komainu, CoinShares for institutional crypto trading",
    "url": "https://crypto.news/okx-partners-with-komainu-coinshares-for-institutional-crypto-trading/",
    "description": "OKX, in partnership with Komainu and CoinShares, aims to revolutionize institutional digital asset trading, enhancing security and trust. Crypto exchange OKX has partnered with custody provider Komainu and asset manager CoinShares, aiming to advance institutional adoption of digital assets through&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-15T13:11:41.000Z",
    "title": "XRP Price Retreats to $0.65, but Whales Inject $60 Million into the Market",
    "url": "https://www.crypto-news-flash.com/xrp-price-retreats-to-0-65-but-whales-inject-60-million-into-the-market/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-price-retreats-to-0-65-but-whales-inject-60-million-into-the-market",
    "description": "<img width=\"800\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XUMM\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-48x29.jpg 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" />Ripple&#8217;s XRP experiences a 10% decline, settling at $0.65 from a recent high of $0.72, with on-chain data indicating strategic moves by crypto whales. If buying activity persists, XRP may retest $0.70, facing resistance at $0.72 and a potential target of $0.80. Ripple (XRP) witnessed a 10% decline, falling to $0.65 from its recent three-month [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-11-15T13:17:33.000Z",
    "title": "Bitcoin and Altcoin Report – November Week 2",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/bitcoin-and-altcoin-report-november-week-2/",
    "description": "<p>Historically, October has proven to be a robust period for Bitcoin, earning the moniker &#8220;Uptober,&#8221; a title that holds this year as well. The recent price surge of Bitcoin is believed to be fueled by optimism surrounding spot ETFs and an escalating demand for safe-haven assets. The growing number of Bitcoin spot ETF applications has [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/bitcoin-and-altcoin-report-november-week-2/\">Bitcoin and Altcoin Report &#8211; November Week 2</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-11-15T13:14:01.000Z",
    "title": "FTT Outperforms Major Altcoins Despite Market Slowdown: Santiment",
    "url": "https://coinedition.com/ftt-outperforms-major-altcoins-despite-market-slowdown-santiment/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Tezos Narobi Deployment Yet to Impact on XTZ Price Action\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/06/PRICE-A-6-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Crypto data tracker Santiment, in a Wednesday post on X, listed FTT as one of the altcoins to have added significant gains to their value despite a prevailing slowdown in the market.&#160; Indeed, Santiment noted in the post that FTT has added over an 184% increase in its value in the past week. The performance [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/ftt-outperforms-major-altcoins-despite-market-slowdown-santiment/\">FTT Outperforms Major Altcoins Despite Market Slowdown: Santiment</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]