[
  {
    "source": "CoinDesk",
    "date": "2023-09-29T15:24:23.000Z",
    "title": "Valkyrie Backs Off Ether Futures Purchases Until SEC ETF Approval Officially Effective",
    "url": "https://www.coindesk.com/markets/2023/09/29/valkyrie-backs-off-ether-futures-purchases-until-sec-etf-approval-officially-effective/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The asset manager Thursday said it had already begun purchasing ether futures contracts."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-29T15:27:22.000Z",
    "title": "How On-Chain Attestations Unlock Blockchain’s Most Valuable Use Cases",
    "url": "https://decrypt.co/199326/how-on-chain-attestations-unlock-blockchains-most-valuable-use-cases",
    "description": "KYC alone won’t cut it—to open up real world use cases for crypto, on-chain attestations are the solution for identity verification."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-29T15:23:43.000Z",
    "title": "$3 Billion in Bitcoin Options Expire Today—What Will That Do to BTC's Price?",
    "url": "https://decrypt.co/199339/3-billion-bitcoin-options-expire-september-2023",
    "description": "Analysts say there's no sign that the expiring options will cause big swings in BTC's price."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-29T15:22:58.000Z",
    "title": "How Sam Bankman-Fried Ended Up in Jail",
    "url": "https://decrypt.co/199249/how-sam-bankman-fried-ended-up-in-jail",
    "description": "Super Bowl streaming with a VPN and witness tampering concerns eventually led Sam Bankman-Fried back to jail."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-29T15:30:35.000Z",
    "title": "Binance’s Bitcoin trading volume falls amid reintroduced fees and swelling regulatory woes",
    "url": "https://cryptoslate.com/binance-bitcoin-trading-volume-falls-amid-reintroduced-fees-and-swelling-regulatory-woes/",
    "description": "<p>Binance’s Bitcoin trading volume took a significant hit this month, falling 48% after the exchange reintroduced fees for its most liquid BTC trading pairs. In a Sept. 29 post on X (formerly Twitter), Kaiko research analyst Dessislava Ianeva pointed out that the recorded fall is the second-largest monthly decline since April, adding that &#8220;both drops [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/binance-bitcoin-trading-volume-falls-amid-reintroduced-fees-and-swelling-regulatory-woes/\">Binance&#8217;s Bitcoin trading volume falls amid reintroduced fees and swelling regulatory woes</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-29T14:46:00.000Z",
    "title": "Loom Network ($LOOM) Skyrockets 290% in a Month As Supply on Exchanges Drops",
    "url": "https://www.cryptoglobe.com/latest/2023/09/loom-network-loom-skyrockets-290-in-a-month-as-supply-on-exchanges-drops/",
    "description": "The price of Ethereum-based altcoin project Loom Network ($LOOM) has seen a rally of over 290% over the last 30 days, partly over a recent listing on a popular cryptocurrency trading platform as its liquidity grows. According to available data, the price of Loom Network’s native LOOM token was of around $0.038 late last month, […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T15:19:03.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T15:16:44.000Z",
    "title": "New US Outbound Investment Screening Rules Raise Concerns for European Investments in China",
    "url": "https://www.cryptopolitan.com/new-us-outbound-investment-screening-rules/",
    "description": "In a pivotal moment in the world of international finance and technology, the United States Treasury Department is closing the comment period on its long-anticipated proposal for new outbound investment screening rules. These rules are designed to curtail US investors&#8217; involvement in sensitive technology companies and activities in China that the US government deems detrimental ... <a title=\"New US Outbound Investment Screening Rules Raise Concerns for European Investments in China\" class=\"read-more\" href=\"https://www.cryptopolitan.com/new-us-outbound-investment-screening-rules/\" aria-label=\"More on New US Outbound Investment Screening Rules Raise Concerns for European Investments in China\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T14:52:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-29T14:48:02.000Z",
    "title": "Crypto exchange WOO X team up with OpenTrade to revolutionize tokenized assets in Asia",
    "url": "https://www.cryptopolitan.com/woo-x-team-up-with-opentrade-revolutionize-tokenized-assets-asia/",
    "description": "Crypto exchange WOO X has joined forces with OpenTrade to reshape the landscape of tokenized assets in Asia. However, this partnership is designed to offer tokenized U.S. Treasury bill products to Asian markets. A partnership geared towards yield and expansion WOO X, a Seychelles-registered crypto exchange, has clarified that Asia remains its priority for expansion. ... <a title=\"Crypto exchange WOO X team up with OpenTrade to revolutionize tokenized assets in Asia\" class=\"read-more\" href=\"https://www.cryptopolitan.com/woo-x-team-up-with-opentrade-revolutionize-tokenized-assets-asia/\" aria-label=\"More on Crypto exchange WOO X team up with OpenTrade to revolutionize tokenized assets in Asia\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-29T14:50:35.000Z",
    "title": "What is Ethereum ETF, and how could VanEck’s launch impact crypto?",
    "url": "https://crypto.news/what-is-ethereum-etf-and-how-could-vanecks-launch-impact-crypto/",
    "description": "The launch of Ethereum futures ETFs heralds cautious optimism in the crypto world. Here is everything you need to know."
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-29T15:00:54.000Z",
    "title": "MakerDAO Secures $6 Billion For Treasury Bill Investments As MKR Dominates 2023",
    "url": "https://www.newsbtc.com/analysis/mkr/makerdao-secures-6-billion-for-treasury-bill-investments-as-mkr-dominates-2023/",
    "description": "According to a Bloomberg report, MakerDAO, one of the prominent decentralized lenders in cryptocurrency, has reaffirmed its decision to invest billions of dollars in US government bonds. This strategic move has propelled its governance coin, MKR, to reach its highest level since April 2022, outperforming other major cryptocurrencies, including Bitcoin (BTC). MKR has experienced a remarkable surge of 77% this quarter, emerging as the best-performing cryptocurrency of the year. Despite a modest decline of 3.9% to $1,452 on Friday, the coin has nearly tripled in value.  MakerDAO Doubles Down On Treasury Bonds As per DefiLlama data, MakerDAO currently oversees $4.6 billion in assets. The rally of MKR can be attributed to MakerDAO&#8217;s 2022 decision to convert the backing funds of its stablecoin DAI into assets such as short-term US Treasuries and corporate bonds.  Related Reading: Bitcoin News: BTC Price Drops To $2,700 On Binance, CZ Explains Why This strategic shift aimed to seek more stable yields amid the downturn in the cryptocurrency markets. Subsequently, MakerDAO passed a proposal enabling the investment of up to $6 billion in short-term Treasuries, doubling the existing limit. Simon Peters, an analyst at investment platform eToro, suggests that the recent gains in MKR can be attributed to rising treasury yields following the Federal Reserve&#8217;s indication of keeping rates higher for longer. However, signs of a potential slowdown in the MKR rally have emerged. CryptoQuant data reveals a gradual increase in MKR tokens held on centralized exchanges (CEX), indicating that some traders are preparing to secure profits from the recent surge.  Notably, the drop experienced on September 29 ahead of the monthly close marked the largest decline since mid-September. According to Bloomberg, the trader enthusiasm for MKR has extended to DAI, MakerDAO&#8217;s stablecoin. DAI&#8217;s circulation has grown from a low of $3.9 billion on August 20 to $5.5 billion.  Furthermore, MakerDAO introduced a limited-time offer of an 8% annual yield to DAI holders, which, combined with the approval of the investment proposal, could potentially trigger a fresh wave of buying in short-term Treasuries. Allan Pedersen, the CEO of Monetalis, a firm assisting MakerDAO in its investments, expressed that if the supply of DAI continues to increase, it could lead to a significant expansion of MakerDAO&#8217;s T-bill investments in a short time frame. The developments surrounding MakerDAO&#8217;s investment strategy in US government bonds, which have propelled MKR to new heights, signify a calculated move to achieve stability and sustainable yields by the decentralized protocol. MKR Hits 18-Month High MKR has declined over 4.5% in the past 24 hours, causing the token to retrace to its current trading price of $1,452. However, over the last month, MKR has exhibited consistent gains across various time frames, with notable increases of 12%, 19%, and nearly 40% over the seven, fourteen, and thirty-day periods, respectively. Related Reading: Important Events That Could Have A Massive Impact On XRP Price Furthermore, MKR has reached an impressive 18-month high, surging by 101% year to date and briefly peaking at $1,590 earlier on Friday. In the short term, safeguarding against an extended decline, MKR has two crucial support levels that bulls must defend. The first immediate support rests at $1,430, while the second support level, spanning two months, is positioned at $1,341. Meanwhile, MakerDAO and its ecosystem appear poised for further gains with their investment strategy. With a few months remaining in 2023, there is a potential for MKR to conclude the year as the top-performing asset if the ongoing rally continues. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-29T15:00:29.000Z",
    "title": "Bitcoin (BTC) Eyes $27K as Fed Holds Rates; Monero (XMR) & InQubeta (QUBE) Gearing Up for Leap",
    "url": "https://www.crypto-news-flash.com/bitcoin-btc-eyes-27k-as-fed-holds-rates-monero-xmr-inqubeta-qube-gearing-up-for-leap/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-btc-eyes-27k-as-fed-holds-rates-monero-xmr-inqubeta-qube-gearing-up-for-leap",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-176.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-176.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-176-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-176-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The financial arena was abuzz with speculation as the United States Federal Reserve recently held a meeting closely watched by stakeholders from various sectors. While many asset classes reacted predictably to the decisions, some of the best cryptocurrencies showcased their inherent resilience. Leading the charge, Bitcoin eyes a formidable $27K benchmark, with top altcoins like [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-29T15:32:00.000Z",
    "title": "Is Filecoin a Fraud Orchestrated by ETH Foundation and CCP entities?",
    "url": "https://coinedition.com/is-filecoin-a-fraud-orchestrated-by-eth-foundation-and-ccp-entities/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/12/Filecoin-FIL-Price-Analysis.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Is Filecoin a Fraud Orchestrated by ETH Foundation and CCP entities?\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/12/Filecoin-FIL-Price-Analysis.jpg 730w, https://coinedition.com/wp-content/uploads/2022/12/Filecoin-FIL-Price-Analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/12/Filecoin-FIL-Price-Analysis-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/12/Filecoin-FIL-Price-Analysis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/12/Filecoin-FIL-Price-Analysis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/12/Filecoin-FIL-Price-Analysis-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>A researcher alleges Filecoin ICO fraud involving Ethereum Foundation and CCP entities. The investigation reveals suspicious patterns in Filecoin&#8217;s ICO transactions. Potential implications for wallet owners and venture capitalists under scrutiny. A prominent crypto investigator, TruthLabs, has unveiled allegations suggesting that Filecoin (FIL), a crypto project that gained significant attention in the blockchain community, might [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/is-filecoin-a-fraud-orchestrated-by-eth-foundation-and-ccp-entities/\">Is Filecoin a Fraud Orchestrated by ETH Foundation and CCP entities?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Bitfinex Blog",
    "date": "2023-09-29T14:53:52.000Z",
    "title": "Why is Blockchain Governance Important?",
    "url": "https://blog.bitfinex.com/education/why-is-blockchain-governance-important/",
    "description": "<p>Blockchain governance systems can be broadly categorised into several models, each possessing distinct characteristics, advantages, and drawbacks. Understanding the nuances of these varied governance structures can yield crucial insights into the enduring stability, flexibility, and overall success of many diverse blockchain projects. A Look at...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blog.bitfinex.com/education/why-is-blockchain-governance-important/\">Why is Blockchain Governance Important?</a> appeared first on <a rel=\"nofollow\" href=\"https://blog.bitfinex.com\">Bitfinex blog</a>.</p>\n"
  }
]