[
  {
    "source": "Cointelegraph",
    "date": "2023-05-31T17:27:47.000Z",
    "title": "Bitcoin played second fiddle as KAVA, XRP, TRX, RPL and RNDR led the crypto market in May",
    "url": "https://cointelegraph.com/news/bitcoin-played-second-fiddle-as-kava-xrp-trx-rpl-and-rndr-led-the-crypto-market-in-may",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/9cb2de0f-3c32-4c07-8374-896397f77782.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin is about to close its worst performing month since FTX collapsed, but a handful of altcoins posted noteworthy gains in May.</p>\n                    <p><p>The cryptocurrency market experienced a dull month with Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) dropping 7.37%, its worst performance since November 2022 and Ethereum (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) losing 0.22% in May. </p><p>The average loss across the market stands at 5.62% on the last day before the monthly close. </p><p>However, some outliers posted impressive gains thanks to popular investment narratives and the growth of the Ethereum staking sector. </p><p>In the first half of May, memecoins grabbed headlines with <a href=\"https://cointelegraph.com/learn/what-is-pepecoin-pepe-memecoin\">Pepecoin (PEPE) leading</a> the narrative. The memecoin cycle guzzled up a lot of gas on Ethereum in the first half of May.</p><p>PEPE’s market capitalization surged to a peak of $1.54 billion in the first week of May, according to CoinGecko. It has witnessed a sell-off since then as token holders booked profit. However, the token still ended the month with over 300% gains. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/bd3b4e7c-cadf-4fc2-bc4f-9804c02df74f.JPG\"  /><figcaption style=\"text-align: center;\"><em>Top 5 performers among the top 100 cryptocurrencies by market cap. Source: CoinMarketCap</em></figcaption></figure><h2>Kava price analysis</h2><p>The positive catalyst that propelled KAVA price came from a mainnet upgrade on May 17. KAVA price started surging a week before the update, which enhanced the blockchain’s throughput and security. </p><p>KAVA also got a boost from token holder’s suggestions to terminate the project’s grants and rewards programs by the end of 2023. </p><p>Technically, the KAVA/USD pair faces resistance from the long-term support and resistance level at $1.14. A successful breakout above this level will motivate buyers to push KAVA toward $1.50. Support for buyers to the downside lies at $0.96 and $0.80. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/721a7f37-ff7e-4570-95cf-18dabec5cdb0.png\"  /><figcaption style=\"text-align: center;\"><em>KAVA/USD daily price chart. Source: TradingView</em></figcaption></figure><h2>XRP price analysis</h2><p>XRP posted a 7.29% gain over the month with most of its price surge coming in the last few days. </p><p>The token <a href=\"https://cointelegraph.com/news/why-is-xrp-price-up-today\">recorded a spike</a> in its daily transfer activity, which usually precedes a positive rally. Traders piled in with buy orders after on-chain analytics, Santiment, reported the activity on Twitter.</p><p>According to popular opinion, Ripple, the fintech company behind the XRP token, is close to winning its <a href=\"https://cointelegraph.com/news/ripple-vs-sec-could-newly-released-documents-tip-the-balance\">securities case</a> against the Securities and Exchange Commission (SEC). The verdict could come as early as June.</p><p>Technically, XRP faces resistance from the October 2022 and 2023 yearly peak levels around $0.54. A successful breakout above this level can propel the price to the 2022 breakdown levels around $0.79.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/bf6dc48f-15bc-4cdc-aee5-5596d38f2210.png\"  /><figcaption style=\"text-align: center;\"><em>XRP/USD daily price chart. Source: TradingView</em></figcaption></figure><h2>Tron price analysis</h2><p>Tron, a Layer-1 blockchain platform, has gained popularity in the last few weeks as reports around its usage in market making on centralized exchanges and the network’s revenue made headlines. </p><p>While Tron’s DeFi usage is limited, it is the leading blockchain platform for USDT issuance. The amount of USDT on Tron at $40 billion surpasses the stablecoin’s supply on Ethereum by $10 billion, according to CoinMetrics’ supply data.</p><p>Kaiko, a crypto research firm, cited that the reason for Tron’s dominance could be low fees which makes transactions cheaper for market makers on centralized exchanges. </p><p>The stablecoin transfers led to a spike in Tron fees to make it the second highest revenue generating blockchain after Ethereum, per Token Terminal data.</p><p>The TRX/USD pair has a bullish breakout from an ascending triangle pattern with a target of $0.112. Before the pattern’s bullish target is reached, buyers will face resistance at the 2022 high levels of around $0.093. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/ca200624-2637-4262-b729-0b05a01f0193.png\"  /><figcaption style=\"text-align: center;\"><em>TRX/USD daily price chart. Source: TradingView</em></figcaption></figure><h2>Rocket Pool price analysis</h2><p>Rocket Pool is the second most popular decentralized Liquid Staking Derivative (LSD) platform after Lido. It commands 3% market share of the total Ethereum staking pool and has grown two-fold in the last six months, according to Dune data from Hildobby. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/4cc2c7bf-8232-424b-94f5-eb1ee862614f.JPG\"  /><figcaption style=\"text-align: center;\"><em>Top Ethereum liquid staking platforms. Source: Dune</em></figcaption></figure><p>The daily chart of the RPL/USD pair looks bullish with RPL forming a trend of higher lows restricted by the horizontal resistance at $52. If buyers conquer this resistance level, RPL can witness a 60% upside based target of the on the ascending triangle pattern.</p><p>The all-time high for the token is $61.90, per CoinGecko data. A price breakout above this level would technically put the token into price discovery mode without any resistances to the upside.</p><p>On the other hand, sellers will target local lows of $45.57 and $37.95 in case of correction. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/explained/what-are-artificial-intelligence-ai-crypto-coins-and-how-do-they-work\"><strong><em>What are artificial intelligence (AI) crypto coins, and how do they work?</em></strong></a></p><h2>Render Token price analysis</h2><p>Render Token benefited from the <a href=\"https://cointelegraph.com/news/nvidia-briefly-hits-1-trillion-market-cap\">recent AI</a> hype that has culminated in an uptick of companies requiring graphics cards for training AI models.</p><p>RNDR is an ERC-20 utility token that powers Render Network, a protocol that provides a decentralized marketplace for graphics processing unit (GPU) power. Using RNDR as the medium of exchange, Render Network connects users looking to rent the processing power with those who have idle GPUs.</p><p>RNDR has added 5.5% gains in May, rallying strongly in the second half of the month. Data from Nansen shows that the smart token holding for RNDR token has reduced since the start of this year. Nevertheless, the number of unique smart wallets holding RNDR has increased linearly during the same period. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-05/c8c16338-edd0-4850-a00d-5baf3dbd7344.JPG\"  /><figcaption style=\"text-align: center;\"><em>The number of smart money wallets holding RNDR and the total balances. Source: Nansen</em></figcaption></figure><p>The RNDR/USD pair has exhibited significant volatility around the resistance and support level of $2.13. If buyers build support above it, the token could enter a crucial pivotal parallel range between $3.19 and $2.13. </p><p>There is minimal resistance above $3.19 with the potential to touch 2022 highs of $5.29. To the downside, buyers may find support around local lows at $1.62 and $0.90. </p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-05-31T17:20:50.000Z",
    "title": "US court says IRS has legal authority to access Coinbase users’ trading data",
    "url": "https://cryptoslate.com/court-says-irs-has-legal-authority-to-access-coinbase-users-trading-data/",
    "description": "<p>A federal court ruled that the IRS has the legal authority to access Coinbase users&#8217; trading data via a &#8220;John Doe&#8221; summons, and doing so is not a violation of constitutional rights, according to court filings. The ruling was made in a case filed by James Harper against the IRS in 2020. The suit sought [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/court-says-irs-has-legal-authority-to-access-coinbase-users-trading-data/\">US court says IRS has legal authority to access Coinbase users’ trading data</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-05-31T17:30:09.000Z",
    "title": "Crypto Exchange Binance to Remove Privacy Coins From 4 European Markets",
    "url": "https://news.bitcoin.com/crypto-exchange-binance-to-remove-privacy-coins-from-4-european-markets/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/binn-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Crypto Exchange Binance to Remove Privacy Coins From 4 European Markets\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/05/binn-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/binn-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/binn-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/binn-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/binn-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/binn-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/05/binn.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Multiple reports have revealed that Binance, the crypto exchange with the highest trade volume, has announced the removal of 12 privacy-focused cryptocurrencies from its markets in Spain, France, Poland, and Italy. Commencing on June 26, 2023, users residing in these four countries will no longer have the option to purchase or trade these privacy coins [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T17:38:28.000Z",
    "title": "Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?",
    "url": "https://www.cryptopolitan.com/polygon-price-prediction/",
    "description": "Polygon Price Prediction 2023-2032 In an official blog post, Polygon explains how they were able to retire $400,000 of carbon credits that offset the entirety of CO2 debt accumulated by the network since inception. Polygon is always on the forefront of green business. They lead their industry by converting to carbon neutrality and moving towards ... <a title=\"Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-price-prediction/\" aria-label=\"More on Polygon Price Prediction 2023-2032: Is MATIC Going Past $1 Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T17:28:46.000Z",
    "title": "Pauly0x earns nearly $1M through unconventional Ethereum transfers",
    "url": "https://www.cryptopolitan.com/pauly0x-earns-1m-through-ethereum-transfers/",
    "description": "Crypto influencer Pauly0x has unexpectedly made nearly $1 million by demanding Ethereum transfers to his yougetnothing.eth wallet. With a tweet calling the Bitcoin sector &#8220;an absolute joke,&#8221; this experiment drew much attention and more than $1 million in just seven minutes. The episode demonstrates the crypto sphere&#8217;s quirkiness and unpredictability. Pauly0x swoops $1 million in ... <a title=\"Pauly0x earns nearly $1M through unconventional Ethereum transfers\" class=\"read-more\" href=\"https://www.cryptopolitan.com/pauly0x-earns-1m-through-ethereum-transfers/\" aria-label=\"More on Pauly0x earns nearly $1M through unconventional Ethereum transfers\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T17:25:18.000Z",
    "title": "Polkadot price analysis: DOT declines tremendously to $5.29",
    "url": "https://www.cryptopolitan.com/polkadot-price-analysis-2023-05-31/",
    "description": "Polkadot price analysis reveals a relatively upbeat approach today; the price has gained most of its lost value. In the last few days, the cost of DOT has received much positive attention and has increased to a slight degree. On May 30, 2023, the price suddenly decreased from $5.53 to $5.31. However, the price started to ... <a title=\"Polkadot price analysis: DOT declines tremendously to $5.29\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-analysis-2023-05-31/\" aria-label=\"More on Polkadot price analysis: DOT declines tremendously to $5.29\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-31T17:11:44.000Z",
    "title": "Roger Ver hails Ethereum as the catalyst for crypto Adoption",
    "url": "https://www.cryptopolitan.com/ethereum-as-catalyst-for-crypto-adoption-ver/",
    "description": "Despite its scaling issues and competition from layer-one clones, Roger Ver has commended Ethereum as the primary force behind worldwide crypto adoption. Speaking on the Show Me The Crypto podcast, Ver praised the development of layer-2 scaling techniques like Polygon MATIC and the rise of Ethereum.&#160; Ethereum&#8217;s Growth and Scaling Solutions: Ver&#8217;s Perspective According to ... <a title=\"Roger Ver hails Ethereum as the catalyst for crypto Adoption\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-as-catalyst-for-crypto-adoption-ver/\" aria-label=\"More on Roger Ver hails Ethereum as the catalyst for crypto Adoption\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-05-31T17:20:11.000Z",
    "title": "Magic raises $52m despite crypto bear market",
    "url": "https://crypto.news/magic-raises-52m-despite-crypto-bear-market/",
    "description": "Non-custodial wallet-as-a-service provider, Magic, has secured $52 million in funding in a recent funding round, despite challenging bear market conditions. "
  }
]