[
  {
    "source": "CryptoSlate",
    "date": "2024-03-13T22:56:38.000Z",
    "title": "MicroStrategy looks to raise another $500 million via debt to buy more ‘apex property’",
    "url": "https://cryptoslate.com/microstrategy-to-raise-another-500-million-via-debt-to-buy-more-apex-property/",
    "description": "<p>MicroStrategy is looking to raise another $500 million via a bond offering to continue growing its Bitcoin stash less than a week after completing a similar debt sale, according to a March 13 press release. The latest senior convertible notes come with a March 15, 2031, maturity date and offer investors a semi-annual interest payment. [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/microstrategy-to-raise-another-500-million-via-debt-to-buy-more-apex-property/\">MicroStrategy looks to raise another $500 million via debt to buy more &#8216;apex property&#8217;</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-03-13T23:02:00.000Z",
    "title": "Shiba Inu ($SHIB) and $PEPE Face Sell-Off as Whales Cash Out Millions",
    "url": "https://www.cryptoglobe.com/latest/2024/03/shiba-inu-shib-and-pepe-face-sell-off-as-whales-cash-out-millions/",
    "description": "While leading cryptocurrencies Bitcoin ($BTC) and Ethereum ($ETH) keep rising, the memecoin market has been on a quieter note after surging earlier this year, with meme-inspired cryptocurrency Shiba Inu ($SHIB) and $PEPE facing downward pressure as large holders, colloquially known as whales, start taking profits. According to on-chain analysis service Spot On Chain, pseudonymous memecoin […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-13T23:00:33.000Z",
    "title": "TRON Integrated With Amazon Web Services to Accelerate Blockchain Adoption",
    "url": "https://news.bitcoin.com/tron-integrated-with-amazon-web-services-to-accelerate-blockchain-adoption/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/image1-8-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/image1-8-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/image1-8-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/image1-8-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/image1-8-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/image1-8-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/image1-8-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/image1-8.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. Geneva, Switzerland, March 13, 2024 &#x2013; TRON DAO is glad to announce the integration with Amazon Web Services (AWS). This integration introduces the TRON Full Node on AWS, enabling users and developers to launch a TRON Full Node with unparalleled ease and efficiency. Seamless Full Node Deployment on AWS Through this integration, launching [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-13T23:00:33.000Z",
    "title": "Dogecoin Influencer Sounds Critical Warning Alarm For Scams Targeting The Community",
    "url": "https://www.newsbtc.com/news/dogecoin/dogecoin-influencer-scams/",
    "description": "Dogecoin influencer Mishaboar has issued a vital warning to members of the Dogecoin (DOGE) community. This warning could prove timely as meme coin-related scams look to be on the rise in the crypto community.  Beware Of Fake Dogecoin Airdrops   Mishaboar warned community members in an X (formerly Twitter) post to be “extremely careful,” stating that there are several fake airdrops targeting the Dogecoin tag and other popular meme coins. The influencer also added that some of these scams are also deployed using the tags of popular AI tokens. Related Reading: Crypto Institutional Investors Are Frontrunning Retail As Inflows Reach Record Highs These scammers are said to promise airdrops to community members with the aim of solely stealing the tokens of unsuspecting users in the process. It is not surprising that these schemes are perpetuated using the tags of popular meme and AI tokens, as these categories of crypto tokens are two of the leading narratives for this bull cycle.  Therefore, using these token tags is likely to help these scammers gain more reach and attract more users. Mishaboar’s warning is no doubt crucial, especially for newbies in the crypto space who could easily fall prey to these scams in the bid to earn ‘airdrops’ that could give them more leverage entering into the bull run.  As part of his warning, the influencer advised his followers to report any account they suspected to be a scam. Mishaboar also noted that some of these accounts have a huge following and might seem legitimate, but users shouldn’t be deceived. Accounts with a significant following always tend to look more legit. That’s why these crypto users have to be extra vigilant.  Mishaboar is known to be very particular about the safety of crypto users. When the ‘MyDogeWallet’ Hack occurred, he advised members of the crypto community to enable two-factor authentication (2FA) on their X accounts using an authenticator application or a physical security key.  Shiba Inu Community Also Faced Similar Scams At the beginning of the year, Shiba Inu scam detector platform Susbarium drew the SHIB community’s attention to scams that were targeted at obtaining people’s identities and stealing their crypto holdings. Back then, Susbarium warned that one of the scams involved fake accounts promoting fake TREAT tokens to unsuspecting investors.  Related Reading: Solana Demand Soars As Institutions Buy Up SOL At A Massive 870% Premium Like Mishaboar, Susbarium urged users to enable 2FA on all their crypto accounts. They also proposed using hardware wallets to help community members securely store their crypto tokens. Some scam accounts clone or impersonate official accounts, so the scam detector advised to be wary of unsolicited messages they might receive from these impersonators.  DOGE price at $0.17 &#124; Source: DOGEUSD on Tradingview.com Featured image from Securities.io, chart from Tradingview.com"
  }
]