[
  {
    "source": "Cryptopolitan",
    "date": "2023-09-11T04:21:57.000Z",
    "title": "Meta’s Upcoming AI System Aims to Trump GPT-4 in Power and Accessibility",
    "url": "https://www.cryptopolitan.com/metas-ai-system-trump-gpt-4-in-power/",
    "description": "Meta is said to be developing a cutting-edge AI system poised to outshine OpenAI&#8217;s GPT-4, in a bold stride towards reclaiming its stature in the ever-evolving realm of artificial intelligence. The Wall Street Journal reports that Meta&#8217;s ambitious project is slated for release in the coming year, with early training set to commence in 2024. ... <a title=\"Meta&#8217;s Upcoming AI System Aims to Trump GPT-4 in Power and Accessibility\" class=\"read-more\" href=\"https://www.cryptopolitan.com/metas-ai-system-trump-gpt-4-in-power/\" aria-label=\"More on Meta&#8217;s Upcoming AI System Aims to Trump GPT-4 in Power and Accessibility\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-11T04:21:55.000Z",
    "title": "This Confluence Of Bearish Factors Shows Ethereum Could Decline Heavily",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-could-decline-heavily-1600/",
    "description": "Ethereum price failed to settle above $1,650 and trimmed gains against the US Dollar. ETH is now trading in a bearish zone and could decline heavily. Ethereum peaked near $1,670 and started a fresh decline. The price is trading below $1,650 and the 100-hourly Simple Moving Average. There is a key bearish trend line forming with resistance near $1,620 on the hourly chart of ETH/USD (data feed via Kraken). The pair could gain bearish momentum if there is a close below $1,600 and $1,580. Ethereum Price Turns Red Ethereum’s price attempted a fresh increase above the $1,620 pivot level. ETH even broke the $1,650 resistance but the bears were active near the $1,670 level. As a result, the price failed to continue higher and started a fresh decline below $1,650, like Bitcoin. There was a downside break below the $1,620 level and the 100-hourly Simple Moving Average. The price even retested the $1,600 support zone. A low is formed near $1,600 and the price is now consolidating losses. Ether is now trading below $1,650 and the 100-hourly Simple Moving Average. Besides, there is a key bearish trend line forming with resistance near $1,620 on the hourly chart of ETH/USD. The trend line is close to the 23.6% Fib retracement level of the downward move from the $1,669 swing high to the $1,600 low. On the upside, the price might face resistance near the $1,620 level and the trend line. The next resistance is near the $1,635 level or the 50% Fib retracement level of the downward move from the $1,669 swing high to the $1,600 low. Source: ETHUSD on TradingView.com The first major resistance is near $1,650, above which the price could rise toward the $1,670 level. The next major hurdle is near the $1,700 level. A close above the $1,700 level might send Ethereum further higher toward $1,750. Downside Break in ETH? If Ethereum fails to clear the $1,620 resistance, it could start another decline. Initial support on the downside is near the $1,600 level. The first key support is close to $1,580. The next key support is $1,540. A downside break below $1,540 might start a major decline toward $1,450. If there is a downside break below $1,450, the price could test the $1,320 support level. Technical Indicators Hourly MACD – The MACD for ETH/USD is slowly gaining momentum in the bearish zone. Hourly RSI &#8211; The RSI for ETH/USD is now below the 50 level. Major Support Level – $1,600 Major Resistance Level – $1,650"
  }
]