[
  {
    "source": "CoinDesk",
    "date": "2023-08-29T12:35:29.000Z",
    "title": "First Mover Americas: Is Bitcoin Close to Breaking Out of Its Current Range? ",
    "url": "https://www.coindesk.com/markets/2023/08/29/first-mover-americas-is-bitcoin-close-to-breaking-out-of-its-current-range/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest price moves in bitcoin (BTC) and crypto markets in context for August 29, 2023. First Mover is CoinDesk’s daily newsletter that contextualizes the latest actions in the crypto markets."
  },
  {
    "source": "CoinDesk",
    "date": "2023-08-29T12:29:44.000Z",
    "title": "Dogecoin's 10% Decline This Year Led By Bearish European Hours",
    "url": "https://www.coindesk.com/markets/2023/08/29/dogecoins-10-decline-this-year-led-by-bearish-european-hours/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "DOGE's cumulative year-to-date return during the European hours were -44.44% at press time."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-29T12:37:26.000Z",
    "title": "Canaan’s 2Q mining revenue jumps 43% on 1Q, but net loss climbs 31%",
    "url": "https://cointelegraph.com/news/canaan-s-2q-mining-revenue-jumps-43-on-1q-but-net-loss-climbs-31",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/37b05de6-454b-43cf-a625-db6f6cfc6510.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin mining firm Canaan posts second quarter financials, with Bitcoin mining revenue up 43% from Q1 2023, though net loss also rose 31% to $110 million. </p>\n                    <p><p><a href=\"https://cointelegraph.com/learn/how-to-mine-bitcoin-a-beginners-guide-to-mine-btc\">Bitcoin mining</a> company <a href=\"https://cointelegraph.com/tags/canaan\">Canaan</a> announced its unaudited financial results for Q2 2023, showing growth in computing power sold and BTC mining revenues while it tackled a significant net loss of $110 million. up 31% on Q1.</p><p>The NASDAQ-listed company <a href=\"https://www.canaan.io/1565.html\" target=\"_blank\" rel=\"noopener nofollow\">outlined </a>a variety of reasons influencing increased revenues and a significant headwind that included an inventory write-down and equipment impairment totaling $54 million.</p><p>Canaan recorded $73.9 million in revenue in Q2 2023, up from $55.2 million quarter-on-quarter. This consisted of $57.9 million from products revenue and $15.9 million in Bitcoin mining revenue.</p><p>BTC mining revenues reflected 43.3% growth compared to Q1’s $11.1 million, with Canaan’s 2023 Q2 more than doubling Q2 2022's $7.8 million in BTC mining revenues. The company attributed this surge to the recovery in Bitcoin prices and the consequent rise in Bitcoin rewards.</p><blockquote>“The sequential increase was mainly driven by the Bitcoin price recovery and increased Bitcoin rewards across the network during the quarter.”</blockquote><p>Canaan also reported significant growth in its total computing power sold, reaching 6.1 million Thash/s, up 45% quarter-on-quarter, with the sector becoming a major driver of revenue for the company.</p><p>Canaan also detailed net losses totalling $110.7 million in Q2, which it attributed to non-cash accruals and provisions reflecting changes in selling prices, regulatory shifts, and partner agreements. </p><p><a href=\"https://cointelegraph.com/news/bitcoin-asic-manufacturer-canaan-saw-82-revenue-drop-in-q4\"><strong><em>Related: Bitcoin ASIC manufacturer Canaan saw 82% revenue drop in Q4</em></strong></a></p><p>Canaan CFO James Jin Cheng added that the losses included inventory write-down, provision for commitment reserve and impairment of property and equipment which totaled US$54.7 million. </p><blockquote>“These non-cash accruals and provisions reflect our consideration of the latest selling price change, regulation changes in Kazakhstan, and the default by the partner at a U.S. project, which did not influence our cash flow.”</blockquote><p>As of June 2023, Canaan’s listed cryptocurrency holdings included 1,125 BTC valued at US$28.8 million. 747 BTC are owned by Canaan, while 378 BTC are attributed to customer deposits.</p><p>Canaan also reported that it had suspended 2.0 exahash/s of its mining computing power based in Kazakhstan to ensure legal compliance with the Rules for Licensing of Digital Mining Activities coming into effect.</p><p>The company is in the process of obtaining a specialized license to continue its operations and expects a reduction in its Q3 BTC generation as a result of the offline hardware. </p><p><em>Magazine: <a href=\"https://cointelegraph.com/magazine/blockchain-games-decentralized-lattice-starknet-cartridge/\">Blockchain games aren’t really decentralized… but that’s about to change</a></em></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-29T12:30:02.000Z",
    "title": "Mastercard Multi-Token Network moving at ‘amazing pace’ as Polytrade tests RWA token integration – report",
    "url": "https://cryptoslate.com/mastercard-multi-chain-network-is-moving-at-amazing-pace-as-polytrade-tests-rwa-token-integration-report/",
    "description": "<p>Mastercard held its first-ever blockchain innovation sprint in London last week as part of the development of its Multi-Token Network (MTN.) Among the participants was fintech startup Polytrade, which showcased how its blockchain-based platform for trade financing could integrate with the MTN. The network aims to enable consumers, merchants, and banks to transact seamlessly and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/mastercard-multi-chain-network-is-moving-at-amazing-pace-as-polytrade-tests-rwa-token-integration-report/\">Mastercard Multi-Token Network moving at &#8216;amazing pace&#8217; as Polytrade tests RWA token integration &#8211; report</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-29T12:36:03.000Z",
    "title": "\n                        Bitget Unveils Bitget Smart Awards In Partnership with 0xScope\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/bitget-unveils-bitget-smart-awards-in-partnership-with-0xscope",
    "description": "\n                        <p dir=\"ltr\">Bitget, top crypto derivatives and copy trading platform, is thrilled to unveil an exciting initiative that shines light on outstanding achievements and individuals within the blockchain ecosystem&mdash;the Bitget Smart Awards. This pioneering awards program aims to recognize and honor exceptional performance in key on-chain activities that are shaping the future of the decentralized world.</p>\n<p dir=\"ltr\">Underpinning this initiative is a strategic partnership with 0xScope, a renowned name in blockchain analytics solutions. This collaboration not only accentuates Bitget's commitment to promoting excellence and innovation across the blockchain landscape, but also exemplifies the &ldquo;Trade smarter&rdquo; philosophy in its rebranding initiative. The Bitget Smart Awards serve as a testament to the platform's dedication to advancing the capabilities and recognition of those who contribute significantly to the evolution of blockchain technologies and copy trading. By identifying and presenting these excellent performing on-chain activities, we aim to empower individuals with different tools, knowledge, investment strategies, and insights.</p>\n<p dir=\"ltr\">The Bitget Smart Awards encompass two segments&mdash;the Smart Money Awards and the Hero Trader Awards. The awards cast a spotlight on exemplary investment activities through meticulous analysis of on-chain data.&nbsp;</p>\nSmart Money Awards:\n<p dir=\"ltr\">- Memecoin Master: This prestigious award celebrates blockchain addresses that exhibit an unparalleled knack for uncovering hidden meme coin gems and making early investments that yield substantial returns.</p>\n<p dir=\"ltr\">- Airdrop Hunter: Acknowledging the vital role of airdrops in the crypto ecosystem, this award recognizes blockchain addresses that display remarkable activity and acumen in seizing valuable crypto airdrop opportunities.</p>\n<p dir=\"ltr\">- NFT Guru: With NFTs reshaping digital ownership, this award honors blockchain addresses that have demonstrated remarkable expertise in curating a diverse collection of NFTs and achieving notable gains from their investments in digital collectibles.&nbsp;&nbsp;</p>\nHero Trader Awards\n<p dir=\"ltr\">- Wealth Hunter: The top performers in Bitget 2023 copy trading competition will become Wealth Hunters after emerging victorious from head-to-head battles.</p>\n<p dir=\"ltr\">- Trader of The People: Bitget will select the most popular elite trader from each region and award them the fan favorite prize.</p>\n<p dir=\"ltr\">The laurels of the Bitget Smart Awards will be conferred upon the deserving winners at the highly anticipated Bitget EmpowerX Summit, scheduled to unfold in Singapore on September 12, 2023. This exclusive summit is set to be a gathering of visionary minds and industry pioneers, offering attendees a unique opportunity to immerse themselves in a curated environment of innovation and learning.</p>\n<p>Gracy Chen, Managing Director of Bitget, said</p>\n\n<p dir=\"ltr\">\"The Bitget Smart Awards program, coupled with the Bitget EmpowerX Summit, embodies Bitget's commitment to shaping the future of blockchain by recognizing and celebrating those who are steering the industry towards unprecedented horizons. This endeavor seamlessly aligns with Bitget's overarching mission of empowering individuals to navigate the complex world of crypto and blockchain with unwavering confidence.\"</p>\n\n<p>Jackson Li, Founder of 0xScope, added:</p>\n\n<p dir=\"ltr\">&ldquo;By working closely with Bitget, we aim to set new standards for evaluating smart money projects on the blockchain. Our expertise in data analysis and the development of evaluation criteria will ensure a fair and unbiased selection process. The outcome of these awards will not only benefit Bitget and the participating projects, but also the broader ecosystem. We hope to encourage more members of the community to use advanced blockchain analytics tools to learn and grow as investors and investigators. Together, we are shaping the future of on-chain smart money, and this collaboration with Bitget is a testament to our shared vision and dedication to unlock the full potential of blockchain technology and deliver superior value to its users.&rdquo;</p>\n\n<p dir=\"ltr\">The Summit offers awardees recognition and exposure within the blockchain community, fostering valuable connections and networking opportunities with like-minded individuals, while also providing them with valuable insights, strategic knowledge, and networking opportunities within the blockchain industry.</p>\n<p dir=\"ltr\">The Bitget Smart Awards program, coupled with the Bitget EmpowerX Summit, symbolizes Bitget's commitment to shaping the future of blockchain by acknowledging those who are propelling the industry forward. This initiative aligns seamlessly with Bitget's broader mission of empowering individuals to navigate the world of crypto and blockchain with confidence and expertise.</p>\n<p dir=\"ltr\">For more information about the Bitget Smart Awards and the empowering opportunities offered by the Bitget EmpowerX Summit, please visit here.</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n<p>&nbsp;</p>\n                    "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-29T12:33:33.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 How much is LTC worth? The current price of Litecoin stands at $64.7. Over the past 24 hours, it has experienced a trading volume of $1.72B and a market capitalization of $6.71B. Litecoin’s market dominance is at 0.55%. However, there has been a decrease in the LTC price by 1.1% within ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-29T12:20:57.000Z",
    "title": "Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?",
    "url": "https://www.cryptopolitan.com/rollbit-price-prediction/",
    "description": "Rollbit coin price prediction 2023-2032 Rollbit has quickly become one of the most popular crypto casinos and trading platforms. Launched in 2019, Rollbit offers a wide range of gaming, sports betting, futures trading, and NFT options for users. With no KYC requirements and support for numerous cryptocurrencies, Rollbit provides an easy entry into the world ... <a title=\"Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/rollbit-price-prediction/\" aria-label=\"More on Rollbit Price Prediction 2023-2032:  Is It Time To Buy RLB?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-29T12:17:44.000Z",
    "title": "How is AI Driving Economic Prosperity and Peace to Reshape the New World Order?",
    "url": "https://www.cryptopolitan.com/ai-economic-prosperity-peace-new-world-order/",
    "description": "In a world grappling with the repercussions of a global pandemic and navigating the complexities of evolving global dynamics, the concept of building an open world economy has gained prominence. Amidst this, the role of Artificial Intelligence (AI) is emerging as a driving force in shaping the new world order, one that emphasizes cooperation, mutual ... <a title=\"How is AI Driving Economic Prosperity and Peace to Reshape the New World Order?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-economic-prosperity-peace-new-world-order/\" aria-label=\"More on How is AI Driving Economic Prosperity and Peace to Reshape the New World Order?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-29T12:25:29.000Z",
    "title": "Clockwork to cease operations over limited commercial viability",
    "url": "https://crypto.news/clockwork-to-cease-operations-over-limited-commercial-viability/",
    "description": "Clockwork, a Solana-based smart contract automation project, is set to cease key operations by the end of October due to a lack of commercial viability."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-29T12:32:38.000Z",
    "title": "BTC Price Analysis: Bitcoin’s Struggle at $26k Support – Will it Slip Below $25k Before Reaching $30k?",
    "url": "https://www.crypto-news-flash.com/btc-price-analysis-bitcoins-struggle-at-26k-support-will-it-slip-below-25k-before-reaching-30k/",
    "description": "<img width=\"2560\" height=\"1536\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/bitcoin-3406638-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/04/bitcoin-3406638-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/bitcoin-3406638-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/04/bitcoin-3406638-1024x614.jpg 1024w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Bitcoin tightening Bollinger band hints at a price breakout and implied volatility going ahead. According to the PoW Floor pricing model, there is potential for the BTC price to decrease by an additional 40 percent to levels below $15,000. The world&#8217;s largest cryptocurrency Bitcoin (BTC) has been struggling to stay afloat at $26,000 and continues [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-29T12:31:45.000Z",
    "title": "Meme Coins Shiba Inu (SHIB) and Pepe (PEPE) Cannot Compete with Real-Life Utility",
    "url": "https://www.crypto-news-flash.com/meme-coins-shiba-inu-shib-and-pepe-pepe-cannot-compete-with-real-life-utility/",
    "description": "<img width=\"512\" height=\"309\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-104.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-104.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-104-300x181.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />While meme coins like Shiba Inu (SHIB) and Pepe (PEPE) have gained attention due to their cultural virality, they stand in stark contrast to utility-driven tokens like VC Spectra (SPCT). SPCT, backed by tangible use cases within its ecosystem, offers real-life applications and investment opportunities. Let’s see which of the three will come out the [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-29T12:25:00.000Z",
    "title": "ATOM Shows Resilience Amid Signs of Looming Bearish Turn",
    "url": "https://coinedition.com/atom-shows-resilience-amid-signs-of-looming-bearish-turn/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/ATOMs-Future-Looks-Gloomy-Can-the-Bulls-Pull-Something-Special.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"ATOM’s Future Looks Gloomy, Can the Bulls Pull Something Special\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/ATOMs-Future-Looks-Gloomy-Can-the-Bulls-Pull-Something-Special.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/ATOMs-Future-Looks-Gloomy-Can-the-Bulls-Pull-Something-Special-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/ATOMs-Future-Looks-Gloomy-Can-the-Bulls-Pull-Something-Special-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/ATOMs-Future-Looks-Gloomy-Can-the-Bulls-Pull-Something-Special-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/ATOMs-Future-Looks-Gloomy-Can-the-Bulls-Pull-Something-Special-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/ATOMs-Future-Looks-Gloomy-Can-the-Bulls-Pull-Something-Special-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Despite an early bear grip that hit a 24-hour bottom of $7.09, almost exceeding the monthly low of $7.07, positive momentum has prevailed in the Cosmos (ATOM) in the previous 24 hours. Buyers stepped in to take advantage of the low prices, and the market swiftly recovered. Consequently, the price rose steadily throughout the day, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/atom-shows-resilience-amid-signs-of-looming-bearish-turn/\">ATOM Shows Resilience Amid Signs of Looming Bearish Turn</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]