[
  {
    "source": "Cointelegraph",
    "date": "2023-08-30T13:46:20.000Z",
    "title": "Genesis lenders call DCG agreement ‘wholly insufficient’",
    "url": "https://cointelegraph.com/news/genesis-lenders-call-dcg-agreement-wholly-insufficient",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/5577a5b4-5a37-4d3c-bc0d-ded891caaac7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The agreement in-principle reached by DCG and creditors also said that the Ad Hoc Group and Gemini did not support the deal. </p>\n                    <p><p>The lenders of the bankrupt cryptocurrency lender Genesis are not satisfied with the latest in-principle settlement agreement with other parties including the Digital Currency Group (DCG).</p><p>The Ad Hoc Group of Genesis Global Capital (GGC) lenders — represented by lawyers Brian Rosen and Jordan Sazant — on Aug. 29 <a href=\"https://restructuring.ra.kroll.com/genesis/Home-DownloadPDF?id1=MjQ2OTI4Mw==&amp;id2=-1\" target=\"_blank\" rel=\"noopener nofollow\">responded</a> to a public bankruptcy plan update, calling the reached in-principle agreement “wholly insufficient.”</p><p>Posted hours before, the public update said that <a href=\"https://cointelegraph.com/news/digital-currency-group-genesis-reaches-agreement-with-genesis\">DCG reached an agreement in principle</a> with Genesis’ unsecured creditors (UCC) and debtors, proposing USD equivalent recoveries of 70%–90%. The update stressed that neither the Ad Hoc Group nor the Gemini exchange supported the deal in principle described in the plan update.</p><p>“Although the mediation has terminated, constructive discussions with the Ad Hoc Group and Gemini regarding the aforementioned agreed-upon deal in principle are ongoing,” the update noted.</p><p>In response, the Ad Hoc Group stressed that it indeed does not support the proposed agreement in principle, calling DCG’s contribution “wholly insufficient to satisfy” the loan amounts. The lenders argued that the debtors and UCC are “unwilling to comply with their fiduciary obligations” to maximize creditor recoveries, arguing that they are instead trying to put the base behind them. The filing added:</p><blockquote>“The Ad Hoc Group, which includes dozens of creditors for whom these assets are critical, does not have such luxury and cannot support the proposed terms of the plan update which permit DCG to walk away untouched and, in fact, paying less than already committed.”</blockquote><p>The Genesis lenders also argued that DCG should not be entitled to non-consensual third party releases, which release non-debtor parties from liability to other non-debtor parties without the consent of all potential claimholders.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/gemini-reply-brief-dismiss-sec-lawsuit\"><strong><em>Gemini files brief in lawsuit against SEC, requests to keep it simple</em></strong></a></p><p>The Ad Hoc Group argued that the debtors and UCC have agreed to “improperly cause the release of third party claims” against DCG and its related parties.</p><p>“Instead of receiving $630 million that matured and should have been paid 3 months ago, DCG will only be paying $275 million now and will pay another $328.8 million in another 2 years,” the lenders stated, adding:</p><blockquote>“There is no conceivable scenario where these contributions can be considered to be a substantial contribution of assets sufficient to merit releases from the estate claims, let alone third-party creditor claims.”</blockquote><p>Genesis is among cryptocurrency lending firms that were affected by the cryptocurrency winter of 2022. The lender <a href=\"https://cointelegraph.com/news/crypto-lender-genesis-files-for-bankruptcy\">filed for bankruptcy</a> in January 2023 after <a href=\"https://cointelegraph.com/news/breaking-crypto-lender-genesis-global-halts-withdrawals\">suspending withdrawals</a> amid a massive liquidity crisis in mid-November 2022. The firm reportedly <a href=\"https://cointelegraph.com/news/gemini-considers-forbearance-as-dcg-defaults-on-630-million-payment\">owed more than $3.5 billion</a> to its top 50 creditors, including firms like Gemini.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-miner-gets-life-in-prison-china-offers-bounties-for-crypto-firms-asia-express/\"><strong><em>Asia Express: Bitcoin miner gets life in prison, China offers bounties for crypto firms</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-30T14:37:40.000Z",
    "title": "Huobi seeing increased outflows to competitors according to new reliance metrics",
    "url": "https://cryptoslate.com/a-closer-look-at-huobi-reserves-and-reliance-metrics/",
    "description": "<p>The downfall of FTX has underscored the counter-party risks that exchanges can impose on the market. As traders and investors tread with heightened caution, there&#8217;s an evident demand for reliable metrics to evaluate the health of these platforms. Using the FTX data set as a benchmark, Glassnode has rolled out three innovative indicators designed to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/a-closer-look-at-huobi-reserves-and-reliance-metrics/\">Huobi seeing increased outflows to competitors according to new reliance metrics</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-30T13:43:03.000Z",
    "title": "Binance’s Send Cash: A New Transfer Service for Latin America",
    "url": "https://cryptobriefing.com/binances-send-cash-transfer-service-for-latin-america/?utm_source=feed&utm_medium=rss",
    "description": "Binance introduces a new transfer service in Latin America, and Colombia, Argentina can receive funds with direct deposit."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-30T14:00:00.000Z",
    "title": "\n                        Poor Peter Schiff still doesn’t get bitcoin\n                    ",
    "url": "https://cryptodaily.co.uk/2023/08/poor-peter-schiff-still-doesnt-get-bitcoin",
    "description": "\n                        <p dir=\"ltr\">Peter Schiff took to Twitter to assure his followers that bitcoin adoption was not imminent and that a gambling use case would not be good enough either.</p>\nSchiff scathing of Grayscale success\n<p dir=\"ltr\">Success for Bitcoin is absolute anathema to Peter Schiff. He has staked much of his reputation on Bitcoin just being a passing fancy and whenever anything happens to the contrary he heads straight to Twitter to give his anti-bitcoin views.</p>\n<p dir=\"ltr\">When CNBC talking heads made the case that the recent victory for Grayscale over the SEC would likely lead to a momentum shift in the bitcoin price, Schiff took to Twitter to give his views on the subject.</p>\n<p dir=\"ltr\">&nbsp;</p>\n\n<p dir=\"ltr\" lang=\"en\">Once again the #Bitcoin shills on @CNBC have it wrong. A spot Bitcoin ETF does nothing to increase adoption. All it does is make it easier for some speculators to place directional bets on price. CNBC shills don't realize that gambling doesn't count as a use case for a currency.</p>\n&mdash; Peter Schiff (@PeterSchiff) August 29, 2023\n<p>&nbsp;</p>\nGambling\n<p dir=\"ltr\">Schiff really has the bit between his teeth as he accuses speculators of &ldquo;gambling&rdquo; on bitcoin&rsquo;s price direction. Of course, he is right in some respects here, as there are also others who do not yet understand what bitcoin offers over and above short term price movements.</p>\n<p dir=\"ltr\">To gamble on bitcoin moving up or down when good or bad news drops is one thing, but Schiff does not mention the 75% or so of long term holders who haven&rsquo;t sold anything in the last year, in spite of bitcoin visiting its cycle lows.</p>\nEntrenched views\n<p dir=\"ltr\">Poor Peter has dug himself into a bit of a hole now with Bitcoin. Known as quite an eminent economist and financial analyst, Schiff has always been 100% against Bitcoin. Initially treating it as a bit of a joke, and more recently becoming more vehement in his dislike of the asset.</p>\n<p dir=\"ltr\">Many might wonder how Schiff is still so entrenched in his views when even the likes of multi-trillion asset management Blackrock CEO Larry Fink is extolling the virtues of the king of the cryptocurrencies.</p>\nGold, not Bitcoin\n<p dir=\"ltr\">The answer is probably quite straightforward. Bitcoin takes the spotlight and much of the wealth away from what is dear to Schiff&rsquo;s heart, and that is gold.</p>\n<p dir=\"ltr\">Schiff&rsquo;s business is gold, and with an economic catastrophe looming on the horizon, he would expect many to put their wealth into this proven hedge in the very worst times in monetary history.</p>\nWhen realisation hits\n<p dir=\"ltr\">Bitcoin is probably becoming an irritating distraction to Schiff, and instead of acknowledging that it is an alternative asset to gold and just buying both, Schiff is bent on propagating the somewhat silly view put out by certain bankers and heads of global financial agencies that Bitcoin has no intrinsic value.</p>\n<p dir=\"ltr\">Just like a staunch, fully paid-up member of the Flat Earth Society, Schiff looks as though he is going to tough it out no matter what. When bitcoin gets to its cycle top at a potential $100k and then enters the next bear market, he will say: &ldquo;I told you so&rdquo;.&nbsp;</p>\n<p dir=\"ltr\">When Schiff comes to the full realisation that he has been wrong all this time it will be very interesting to see how he reacts. He does have a good sense of humour, and will need to call on it when the time comes.</p>\n<p dir=\"ltr\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>\n                    "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-30T13:43:06.000Z",
    "title": "\n                        Korea Blockchain Week 2023, Asia’s Most Impactful Blockchain Conference, Presents Web3’s Leading Voices\n                    ",
    "url": "https://cryptodaily.co.uk/2023/08/korea-blockchain-week-2023-asias-most-impactful-blockchain-conference-presents-web3s-leading-voices",
    "description": "\n                        <p>Seoul, South Korea, August 30th, 2023, Chainwire</p>\n<p>&nbsp;</p>\n<p class=\"ql-align-center\">It brings together the most sought-after builders, enterprises, thought leaders, and innovators to spark crucial conversations that shape the future of the industry</p>\n<p>FactBlock, a Web3 ecosystem accelerator and the organizer of KBW2023 along with the co-host Hashed, a prominent Web3 venture fund based in South Korea, are delighted to announce that delegates attending the 6th Edition of the Korea Blockchain Week will get to witness the most influential people in the industry sharing their learnings and insights on every aspect of crypto, Web3 infrastructure and beyond. It&rsquo;s where the change makers shape the narratives and set the agenda for the future.</p>\n<p>This year&rsquo;s impressive speaker lineup features more than 200 thought leaders and builders including Ethereum Co-founder Vitalik Buterin, Circle CEO Jeremy Allaire, Wemade CEO Henry Chang, Maelstrom CIO Arthur Hayes, Hashed CEO Simon Kim,&nbsp; BitGo Co-founder and CEO Mike Belshe, Polygon Co-founder Sandeep Nailwal, Line Next&rsquo;s Business Director Woosuk Kim, and SkyBridge Capital&rsquo;s Founder and Managing Partner Anthony Scaramucci.</p>\n<p>Seonik Jeon, CEO of FactBlock, said, &ldquo;Established in 2018 to rectify information imbalances in blockchain and cryptocurrency, KBW now enters its sixth year. Evolving annually, we provide global crypto communities with insightful knowledge, networking, and entertainment. This year, in addition to featuring renowned speakers and diverse sessions to share insights at the Impact conference, we are launching a Web 3-based art and music festival. We anticipate all KBW 2023 participants will relish an immersive week-long engagement with shared knowledge, art, music, and culture in Korea.&rdquo;</p>\n<p>Attendees will also have more opportunities than ever before for networking, collaboration, and discussion. As Asia&rsquo;s most impactful blockchain event, the week-long conference will be a platform where blockchain builders from all over the world discover the future of Web3, and explore its impact on various industries and cultures. The conference will take place from September 4 to September 10, with the main event, KBW: Impact, running from September 5 to 6 at The Shilla Seoul.</p>\n<p>Simon Kim, CEO of Hashed, stated &ldquo;KBW is establishing itself as a B2B platform that goes beyond mere conferences and events, generating practical multinational business collaboration opportunities. In this event, we can anticipate not only the participation of exceptional speakers as mentioned above but also the excitement of more than 150 diverse side events scheduled to take place.&rdquo;</p>\n<p>With the rising technology, institutional fever, and mass adoption in focus, the organizers aim to make KBW2023 an idea lab rather than an echo chamber. It&rsquo;s where builders, investors, legacy finance executives, policymakers, and crypto-curious newcomers flock to exchange ideas, collaborate, and find solutions to some of the thorniest challenges facing the industry.&nbsp;</p>\n<p>The biggest highlight of the upcoming conference will be KBW: IMPACT, the main 2-day event that brings together thought leaders and crypto-curious from around the world to spark discussions along the following core themes:&nbsp;</p>\n<ul>\n<li>Fundamentals&ndash; Dedicated to answering the fundamental questions of blockchain and crypto.&nbsp;</li>\n<li>Kingdom of Ethereum &ndash; Shining light on the future of Ethereum infrastructure and community.</li>\n<li>Oil the Wheels &ndash; Addressing subjects that make blockchain ecosystem and developers&rsquo; growth.</li>\n<li>Way to Billions &ndash; Analyzing the key challenges and contributors to mass adoption.</li>\n<li>What's on Chain &ndash; Showcasing and harnessing the power of on-chain data for research, analysis, DeFi, risk management, and more.</li>\n<li>Regional Taste &ndash; A look at how the unique strengths of markets like Korea, Japan, India and Southeast Asia are helping them embrace blockchain technology.</li>\n<li>Tech Unleashed &ndash; A deep dive into emerging trends and technologies such as zero knowledge, shared sequencing, orderbook DEXes, privacy, interoperability, and more.</li>\n<li>Digital Nation &ndash; Dedicated to exploring how blockchain technology will shape the social structures with DAOs, decentralized social graphs, and metaverse.</li>\n<li>Institutional Fever &ndash; Dedicated to the B2B side of blockchain, it would serve as a bridge between Web2 enterprises, financial conglomerates, and Web3 projects.</li>\n<li>Code in Law &ndash; To help the industry players understand the regulatory landscape.</li>\n</ul>\n<p>The week-long industry gathering will spotlight three main events, an official afterparty, and almost two hundred side events. Highlights include the two-day keystone conference \"Impact\" on September 5th and 6th; the two-day immersive digital art experience \"The Gateway: Korea&rdquo; with nft now on September 7th and 8th; and the two-day music festival \"Micro Seoul: Seoulbound\" as the official closing ceremony of KBW. Rounding off the week, \"Beyond Seoul\" will take center stage as the official KBW afterparty from September 7th to 10th, celebrating the intersection of technology, culture, and self-expression. With over a hundred registered side events, attendees can expect a week brimming with engagement and insight.</p>\nAbout Korea Blockchain Week\n<p>Korea Blockchain Week is the premier blockchain and cryptocurrency event in Asia, bringing together industry leaders, investors, and enthusiasts worldwide to discuss and explore the latest developments and trends. Organized by Factblock and co-hosted by Hashed, the conference features a series of speeches and panel discussions by the leading minds of the blockchain space, as well as a rich selection of side events and networking opportunities to foster collaboration within the Korean and global blockchain community.</p>\n<ul>\n<li>Buy Tickets&nbsp;</li>\n<li>Attend as Media&nbsp;</li>\n<li>Discover Sponsors&nbsp;</li>\n<li>Check out FAQ&nbsp;&nbsp;</li>\n</ul>\n<p>&nbsp;</p>\nContact\n<p>Itai ElizurMarketAcrossitai@marketacross.com</p>\n                    "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-30T14:30:31.000Z",
    "title": "Prosecutors Challenge FTX Founder’s Legal Advice Defense Ahead of Fraud Trial",
    "url": "https://news.bitcoin.com/prosecutors-challenge-ftx-founders-legal-advice-defense-ahead-of-fraud-trial/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbfss-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Prosecutors Challenge FTX Founder&#039;s Legal Advice Defense Ahead of Fraud Trial\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbfss-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbfss-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbfss-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbfss-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbfss-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbfss-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/sbfss.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Sam Bankman-Fried&#8217;s legal team claimed last week that the FTX founder received assurances from lawyers his actions were lawful. However, federal prosecutors are now contesting the validity of Bankman-Fried&#8217;s defense strategy ahead of trial. Bankman-Fried&#8217;s Legal Defense in Question After DOJ Objection In a court filing published Tuesday, federal prosecutors questioned Bankman-Fried&#8217;s ability to rely [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-30T14:37:03.000Z",
    "title": "Top crypto tweets of the day – August 30th",
    "url": "https://www.cryptopolitan.com/top-crypto-tweets-of-the-day-august-30th/",
    "description": "Bitcoin’s exchange supply was boosted significantly just prior to Grayscale&#8217;s win DCG claims to have reached an in-principle agreement on its debt ETF approval could open the floodgates and allow the everyday investor to get bitcoin Total global wealth in terms of Bitcoin Bitcoin fear and greed index is 49 — neutral Art NFTs have ... <a title=\"Top crypto tweets of the day &#8211; August 30th\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-crypto-tweets-of-the-day-august-30th/\" aria-label=\"More on Top crypto tweets of the day &#8211; August 30th\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-30T14:09:01.000Z",
    "title": "Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Flow Coin Price Prediction 2023-2032 Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the ... <a title=\"Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flow-coin-price-prediction/\" aria-label=\"More on Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-30T13:55:42.000Z",
    "title": "NIST Framework Guides Companies Towards Responsible AI Use in a Proliferating Landscape",
    "url": "https://www.cryptopolitan.com/nist-guides-ai-use-in-a-landscape/",
    "description": "In a world where companies are increasingly exploring the benefits of artificial intelligence (AI) to gain a competitive edge, concerns about the responsible and trustworthy use of AI have become more prominent. Instances of AI-generated legal citations and accidental exposure of confidential code underscore the urgency of addressing AI&#8217;s risks. While the US struggles to ... <a title=\"NIST Framework Guides Companies Towards Responsible AI Use in a Proliferating Landscape\" class=\"read-more\" href=\"https://www.cryptopolitan.com/nist-guides-ai-use-in-a-landscape/\" aria-label=\"More on NIST Framework Guides Companies Towards Responsible AI Use in a Proliferating Landscape\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-30T13:47:48.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-30T14:36:32.000Z",
    "title": "EOS gains 4% amid regulatory approval in Japan",
    "url": "https://crypto.news/eos-gains-4-amid-regulatory-approval-in-japan/",
    "description": "The EOS Network Foundation has received whitelist approval from the Japanese regulator. Its token EOS has gained 4% amid the news. Initially, the EOS token will start trading on the cryptocurrency exchange BitTrade in September. Later, the token will be&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-30T14:19:42.000Z",
    "title": "Hong Kong grants crypto license to Swiss bank SEBA’s branch",
    "url": "https://crypto.news/hong-kong-grants-crypto-license-to-swiss-bank-sebas-branch/",
    "description": "The Swiss bank SEBA received an in-principle license approval from the Hong Kong Securities and Futures Commission (SFC). The in-principle approval from the financial authority will allow the entity to operate in the crypto industry. The company can offer advisory&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-30T14:01:29.000Z",
    "title": "Where 2024 US presidential candidates stand on the future of crypto",
    "url": "https://crypto.news/where-2024-us-presidential-candidates-stand-on-the-future-of-crypto/",
    "description": "As the 2024 US presidential election looms, will the White House's next occupant usher in a cryptocurrency bull market, or will they double down on stringent regulations?"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-30T13:45:24.000Z",
    "title": "Ethereum will dominate stablecoin wars, expert says",
    "url": "https://crypto.news/ethereum-will-dominate-stablecoin-wars-expert-says/",
    "description": "Bloomberg analyst predicts Ethereum's triumph in stablecoin wars due to network adoption indicators and upcoming scaling advancements."
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-30T14:00:09.000Z",
    "title": "Binance To Delist Eight BUSD Trading Pairs Soon, End Full BUSD Support By 2024",
    "url": "https://www.newsbtc.com/binance/binance-to-delist-eight-busd-trading-pairs-soon-end-full-busd-support-by-2024/",
    "description": "The world&#8217;s largest exchange, Binance, has announced plans to delist eight Binance USD (BUSD) trading pairs as the company looks to withdraw full support of the stablecoin by 2024. This follows increased regulatory pressure on the stablecoin in 2023, which has led to a drastic decline in its market share so far.  Binance To Delete Nine Margin Trading Pairs By September 7 In a blog post on Wednesday, Binance laid out intentions to delist eight BUSD cross margin and isolated trading pairs. These include AMB/BUSD, DASH/BUSD, FIDA/BUSD, HARD/BUSD, HOT/BUSD, NULS/BUSD, PORTO/BUSD and REQ/BUSD. In addition, the exchange will also be deleting the IOST/BTC margin trading pair.  Related Reading: Binance Will Halt These 39 Liquidity Mining Pools This Week According to Binance, the delisting process will occur in two stages. Firstly, the exchange will suspend all isolated margin borrowing for these specific pairs on September 1, 2023, at 06:00 (UTC). Thereafter, Binance will close all users&#8217; positions, terminate any pending order, and enable an automatic settlement before proceeding to delist these pairs from its isolated margin market on September 7, 2023, at 06:00 (UTC). On the same day and at the same time, these trading pairs will also be removed from Binance&#8217;s cross margin market.  Binance has stated that users would not be permitted to modify their trading positions during the delisting procedure. Thus, they are advised to close all open positions and transfer their assets from margin wallets to spot wallets prior to September 7 to avoid any possible losses. In the announcement, the exchange did not state a specific reason for delisting eight BUSD pairs at once. However, emerging reports indicate that this move is part of a much larger plan by the crypto exchange.  BUSD market cap valued at $3.101 billion on the daily chart &#124; Source: BUSD chart on Tradingview.com Binance To Cease Full Support For BUSD In 2024? According to several posts on the social media platform X, Binance plans to terminate its support for its native BUSD stablecoin by 2024, urging users to convert the token to other crypto assets. This development was revealed via a pop-up notification on the exchange&#8217;s mobile app. Although there was no specific date in the notification, it was stated that Paxos Trust, BUSD’s issuer and operator, will stop BUSD redemption by February 2024. Following this, Binance will gradually withdraw its support for the stablecoin. As earlier stated, the BUSD token has been affected by the high level of regulatory scrutiny faced by the cryptocurrency industry in 2023.  Related Reading: Bitcoin Cash (BCH) Records Surprising 15% Rally – What’s Behind It? In February, the New York Department of Financial Services ordered Paxos to halt the issuance of BUSD, citing “several unresolved issues related to Paxos’ oversight of its relationship with Binance regarding Paxos-issued BUSD.” Following this directive, BUSD has lost over 80% of its market cap, falling from $16.13 billion on February 9 to its current value of $3.1 billion based on data from Tradingview. Featured image from Binance, chart from Tradingview"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-30T13:48:56.000Z",
    "title": "Ethereum Price Prediction for 2023, 2024, 2025, 2030 and Beyond",
    "url": "https://www.newsbtc.com/news/ethereum/ethereum-price-prediction-for-2023-2024-2025-2030/",
    "description": "Ethereum has rapidly become the second most valuable cryptocurrency after Bitcoin. With its recent transition to a proof-of-stake consensus model and its expanded capabilities, Ethereum&#8217;s future looks bright. This guide provides a data-driven Ethereum price prediction for the short, medium and long-term. What is Ethereum (ETH)? Ethereum is a decentralized blockchain platform created by Vitalik Buterin in 2015. Like Bitcoin, it uses a blockchain to store transaction records. But Ethereum&#8217;s key innovation was enabling decentralized applications (dApps) and smart contracts on its blockchain. The Ethereum blockchain serves as a secured public ledger for verifying and recording transactions. Ether (ETH) is the native cryptocurrency of the platform that acts as &#8216;gas&#8217; to power transactions and run smart contracts. Some key aspects of Ethereum include: Smart contracts These are applications that run exactly as programmed without risk of downtime or third-party interference. Decentralized platform Ethereum operates via a global peer-to-peer network, avoiding centralized control. Programmable blockchain Developers can use Ethereum to build and deploy decentralized applications of all kinds. Proof-of-stake consensus Ethereum has transitioned to a more efficient proof-of-stake system called Casper that requires less energy. These features make Ethereum extremely versatile and a promising platform for decentralized finance (DeFi), NFTs, DAOs, dApps and much more. Factors Influencing Ethereum Price Ethereum&#8217;s growth has been explosive, but not without volatility. Here are some factors that affect ETH prices. Cryptocurrency Market Trends Like most cryptos, Ethereum price depends heavily on trends in the overall crypto market. Bitcoin&#8217;s price actions in particular have a ripple effect on altcoins. Gas Fees and Transaction Costs Ethereum gas fees rising during times of network congestion reduces usage and can suppress price. Efforts like scaling solutions aim to lower transaction costs. Mainstream Adoption With increasing real-world Ethereum usage cases in DeFi, NFTs etc. mainstream adoption is rising, leading to higher demand and prices. Competition While Ethereum is the dominant smart contract platform currently, competition from projects like Solana, Cardano etc. can potentially erode its market share and affect ETH prices. Regulations Regulatory crackdowns or increased clarity on crypto/Ethereum can both positively and negatively impact prices by affecting investor sentiment. Technology Upgrades Recent Ethereum developments like the Merge upgrade to proof-of-stake or ETH 2.0 implementating sharding may improve capabilities and affect value over time. Burning Ether Burning ETH taken out of circulation through EIP-1559 helps reduce supply and may gradually increase the value of remaining Ether. Related Reading: Bitcoin Price Prediction for 2023, 2024, 2025, 2030 and Beyond Ethereum Price History Ethereum launched in 2015 at an initial price of around $0.30. Here is a look at key price developments since then. 2015-2017 &#8211; The Early Days After launch, Ethereum traded in the $1-$15 range till early 2017. As crypto markets gained steam in 2017, Ethereum shot up to $380 by June. Several factors drove growth: Increasing developer adoption with global Ethereum hackathons held in 2017. Hundreds of projects were built on Ethereum. Mainstream coverage of Ethereum as a revolutionary technology in magazines like Forbes ICO boom &#8211; projects raising millions via Ethereum-based ICOs bought Ether at inflated prices This growth was unsustainable long-term and by September 2018, ETH had fallen to around $170. But immense developer interest and real-world usage potential was now apparent. 2018-2020 &#8211; Building During the Bear Market In the 2018-2020 bear market, Ethereum stayed afloat better than most altcoins, remaining above $100. Major mileposts include: Despite market conditions, steady progress continued on Ethereum 2.0 upgrades like Beacon Chain, proof-of-stake, and sharding. Increasing DeFi (decentralized finance) dominance with Ethereum facilitating over 90% of activity and billions in value. Launch of Ethereum-based Tether (USDT), the most used stablecoin. USDT transactions dwarfed payment coins. ERC-20 standard became the de-facto for issuing new tokens. Most ICOs continued to launch on Ethereum. This demonstrated Ethereum&#8217;s real-world utility and helped prevent steeper declines. 2021 &#8211; 2022 &#8211; From Mainstream Mania To Manic Depression 2021 marked a parabolic rise for Ethereum, breaking out beyond crypto circles into mainstream recognition. The parabolic rise also brought an abrupt peak, sending Ethereum prices crashing all throughout 2022 as the US Federal Reserve began hiking interest rates to the highest levels in decades. Key factors driving this bull run: Continued DeFi growth, with the total value locked in DeFi rising from $20B to over $100B during 2021. NFT mania beginning in early 2021, with Ethereum hosting headline-grabbing sales like Beeple&#8217;s $69 million digital art piece. Ethereum network upgrades like Berlin hard fork and London&#8217;s EIP-1559 built investor confidence. Large companies like Visa and JP Morgan began settling transactions on the Ethereum blockchain. Institutional investment rose with SEC allowing Ethereum futures ETFs. This perfect storm took ETH from under $800 in January 2021 to an all-time high of $4,800 in November 2021. In 2022 the crypto market endured a painful bear market, with Ethereum dropping below $1,000. However, a major milestone was reached in September 2022, with Ethereum completing The Merge upgrade to become a proof-of-stake blockchain. This reduced Ethereum inflation and carbon footprint. While sentiments remain low currently, The Merge was a huge technological leap cementing Ethereum&#8217;s lead in blockchain development. The stage is potentially set for the next bull market. Recent Ethereum Price Performance Unlike Bitcoin which found a local bear market bottom in November 2022, Ethereum set a local low in mid-June at around $878 per ETH. An almost immediate bounce took Ether over double from the low to $2,000, but retested $1,000 before the year ended. Throughout 2023 while Bitcoin and other cryptocurrencies have recovered, Ethereum&#8217;s rally has been relatively muted. In August 2023, Ethereum once again retested $1,500, possibly putting in a lower low before the start of a more substantial rally or collapse. Short Term Ethereum Price Prediction for 2023 Since the 2022 local bottom, Ethereum has been forming an Ascending Triangle pattern. This is predominantly a bullish pattern, but can occasionally appear in a bear market before the final move in a sequence, ultimately breaking down. Targets based on the measure rule put an immediate upside breakout around $3,800 per ETH, while a breakdown would send Ether back down to $871 for a double possible double bottom or new low. With only a few months left in 2023, trajectories will be limited based on time. Medium Term Ethereum Price Prediction for 2024 &#8211; 2025 Based on historical 4-year market cycles and Elliott Wave Principle patterns, Ethereum appears to be at a critical junction, where it could retrace further and break down from a large rising wedge structure, or could rally and fill out the upper portion of the pattern one more time. The black-colored wave scenario puts ETHUSD at $10,000 between 2024 and 2025. Meanwhile, the red-colored corrective wave scenario suggests Ether will reach around $440 during a C-wave of continuation. Long Term Ethereum Price Prediction for 2030 and Beyond If Ethereum establishes itself as the primary platform for decentralized apps and finance by 2030, its utility could be immense. Based on a long-term linear mean, Ethereum could fluctuate between $20,000 and nearly $100,000 per ETH by the year 2030 arrives. Ethereum Price Predictions by Experts Here what some industry experts and analysts forecast for Ethereum: Popular analyst Benjamin Cowen is conservative in his Ethereum price prediction, claiming that “Ethereum has the potential to eventually achieve $10,000 to $15,000 per ETH in the next five to ten years.” He cautions that scaling needs to be achieved without diluting ETH’s value. RealVision CEO Raoul Pal predicts ETH at $20,000 by 2025. CertiK CEO Ronghui Gu forecasts Ethereum at $30,000 to $50,000 by 2030. Justin Bennett sees ETH potentially reaching $40,000 if bullish sentiment returns. Ethereum Price Prediction FAQs Here are some common questions about Ethereum price predictions: What was Ethereum&#8217;s lowest price? Ethereum hit record lows between $0.4 to $0.7 in 2015 and 2016 during its earliest days. Its recent low was around $800 in June 2022. What was Ethereum&#8217;s highest price? Ethereum&#8217;s all-time high price was $4,891 reached in November 2021. It also briefly exceeded $4,600 in the same month. How high can Ethereum realistically go long-term? Based on expert forecasts and models, Ethereum potentially could reach over $100,000 by 2030, and even $500,000+ in the 2050 timeframe as a bull case scenario if it achieves global adoption. Can Ethereum drop to zero? While unlikely, the possibility that Ethereum drops to near zero can&#8217;t be ruled out entirely. Competition, failure to scale sufficiently, or critical bugs in the codebase are threats. Why is Ethereum price volatile? As a relatively new asset class, Ethereum is prone to high volatility. Speculation, hype cycles, and changing investor sentiment amplify price swings. When will Ethereum&#8217;s price stabilize? Ethereum price volatility should stabilize significantly once it achieves full-scale mainstream adoption as a blockchain platform, which could happen within the next 5-10 years. Will Ethereum go up in 2023? The most likely scenario based on market trends is Ethereum rising gradually throughout 2023, although price will remain volatile in the short-term."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-30T14:06:46.000Z",
    "title": "IOTA Displays Uptrend with 2.3% Gain: A Bullish Outlook Amidst 38% Increase in Trading Volume",
    "url": "https://www.crypto-news-flash.com/iota-displays-uptrend-with-2-3-gain-a-bullish-outlook-amidst-38-increase-in-trading-volume/",
    "description": "<img width=\"5500\" height=\"3667\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"IOTA\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1.jpg 5500w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-2048x1365.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-1-48x32.jpg 48w\" sizes=\"(max-width: 5500px) 100vw, 5500px\" />IOTA&#8217;s Volatility has jumped amid the surge in trading volumes over the past week. IOTA&#8217;s RSI has experienced a notable shift, currently residing above the average threshold hinting at a bullish sentiment. One altcoin that&#8217;s made a healthy move on the upside over the last week is IOTA&#8217;s native cryptocurrency MIOTA. Over the last 24 [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-30T14:00:26.000Z",
    "title": "Pikamoon Presale Continues to Soar While Dogecoin Dips 10% in 7 Days",
    "url": "https://www.crypto-news-flash.com/pikamoon-presale-continues-to-soar-while-dogecoin-dips-10-in-7-days/",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-110.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-110.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-110-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-110-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />It&#8217;s all green in the Pikamoon ecosystem and every PIKA investor is counting their profits while anticipating the token launch. As the Pikamoon presale continues to smash records, it&#8217;s a bearish situation for the pioneering meme coin, Dogecoin, and its investors. And as Dogecoin investors struggle to keep their portfolio afloat following the latest 10% [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-30T14:25:00.000Z",
    "title": "SEC Reasseses Court Opinion After Losing in Grayscale Case",
    "url": "https://coinedition.com/sec-reasseses-court-opinion-after-losing-in-grayscale-case/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/SEC-72.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/SEC-72.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/SEC-72-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/SEC-72-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/SEC-72-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/SEC-72-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/SEC-72-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/SEC-72-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/SEC-72-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/SEC-72-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/SEC-72-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/SEC-72-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/SEC-72-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/SEC-72-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/SEC-72-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/SEC-72-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/SEC-72-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Journalist Eleanor Terrett of FOX Business took to Twitter today to unveil a statement from the U.S. Securities and Exchange Commission (SEC) about their next steps in the ongoing Grayscale case.  According to the SEC, the agency is currently evaluating the recent court opinion to determine its subsequent actions. ETFs update specialist James Seyffart provided [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sec-reasseses-court-opinion-after-losing-in-grayscale-case/\">SEC Reasseses Court Opinion After Losing in Grayscale Case</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-30T13:58:00.000Z",
    "title": "Starknet Halts Quantum Leap NFT Campaign Due To Network Issues",
    "url": "https://coinedition.com/starknet-halts-quantum-leap-nft-campaign-due-to-network-issues/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/nft1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/nft1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/nft1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/nft1-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/nft1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/nft1-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/nft1-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/nft1-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/nft1-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/nft1-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/nft1-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/nft1-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/nft1-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/nft1-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/nft1-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/nft1-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/nft1-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Earlier today Starknet Ecosystem announced that users can now mint their Quantum Leap NFT for the next 24 hours, till August 31, 5 AM UTC. In the Twitter thread, the team noted that one account can mint once only. Simultaneously, cautioning users to triple-check the link to avoid scams. However, Starknet soon halted the drop [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/starknet-halts-quantum-leap-nft-campaign-due-to-network-issues/\">Starknet Halts Quantum Leap NFT Campaign Due To Network Issues</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-30T13:49:46.000Z",
    "title": "213 Million TrueUSD Stablecoins Minted At Unknown Wallets",
    "url": "https://coinedition.com/213-million-trueusd-stablecoins-minted-at-unknown-wallets/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/TRU-should-not-be-related-to-TUSD..jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/TRU-should-not-be-related-to-TUSD..jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/TRU-should-not-be-related-to-TUSD.-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/TRU-should-not-be-related-to-TUSD.-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/TRU-should-not-be-related-to-TUSD.-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/TRU-should-not-be-related-to-TUSD.-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/TRU-should-not-be-related-to-TUSD.-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a sudden turn of events earlier today, hundreds of millions of TrueUSD (TUSD) stablecoins were minted at multiple unknown wallets. On-chain data tracker Whale Alert reported on X (formerly Twitter) that four unknown wallets had minted nearly 54 million TUSD each in a span of 30 minutes today. The crypto community on X was [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/213-million-trueusd-stablecoins-minted-at-unknown-wallets/\">213 Million TrueUSD Stablecoins Minted At Unknown Wallets</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-30T14:30:10.000Z",
    "title": "Ethereum, Chainlink and Altcoins Now Setting Up for ‘The Real Move,’ Says Analyst Michaël Van De Poppe",
    "url": "https://dailyhodl.com/2023/08/30/ethereum-chainlink-and-altcoins-now-setting-up-for-the-real-move-says-analyst-michael-van-de-poppe/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/08/The-Real-Move.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/08/The-Real-Move.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/08/The-Real-Move.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/08/The-Real-Move.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/08/The-Real-Move.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/08/The-Real-Move.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/08/The-Real-Move.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst says that smart contract platform Ethereum (ETH) and other altcoins are likely setting the stage for a big move to the upside. Crypto trader Michaël van de Poppe suggests to his 665,600 followers on the social media platform X that the digital assets market is following a historical pattern before [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/30/ethereum-chainlink-and-altcoins-now-setting-up-for-the-real-move-says-analyst-michael-van-de-poppe/\">Ethereum, Chainlink and Altcoins Now Setting Up for ‘The Real Move,’ Says Analyst Michaël Van De Poppe</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]