[
  {
    "source": "Cointelegraph",
    "date": "2023-09-07T07:16:18.000Z",
    "title": "Nigeria's Web3 education efforts seek to tackle language challenges",
    "url": "https://cointelegraph.com/news/web-3-nigeria-education-efforts-tackle-language-challenge",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/a28f4a51-c4df-4f83-a856-49fa26f7a9ad.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> The chief operating officer (COO) of Bitkova Academy, a blockchain education platform, Bello Usman Abdullahi said the language barrier is one of the current major challenges.</p>\n                    <p><p>While Nigeria appears to have a <a href=\"https://cointelegraph.com/news/99-of-nigerians-are-crypto-aware-consensys-report\">high level of blockchain and crypto awareness</a>, the country is still facing issues related to public education in the field. A group of local blockchain experts discussed blockchain education's challenges in Nigeria at the Stakeholders in Blockchain Technology Association of Nigeria (SIBAN)’s Digital Assets Summit 2023, held in Abuja, the nation’s capital.</p><p>In the panel titled “Web3 Education: Capacity Building,” the group discussed the current level of blockchain and Web3 awareness in the country and the challenges that have surfaced in the journey so far.</p><p>The chief operating officer (COO) of Bitkova Academy, a blockchain education platform, Bello Usman Abdullahi said that the language barrier is one of the current major challenges due to the complexity of blockchain technology and its jargon. Nigeria is one of the most linguistically diverse countries in the world, with over 500 languages spoken. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/7512c28f-77f5-4f9d-a9a3-3a8fece64175.JPG\"  /><figcaption style=\"text-align: center;\"><em>The Web3 Education- Capacity Building panel session at SIBAN's Digital Assets Summit  </em></figcaption></figure><p>However, local blockchain hubs have begun educating individuals who are not familiar with blockchain technology using local Nigerian languages. Abdullahi said that it is important to help individuals who are new to blockchain technology and Web3 understand what Satoshi Nakamoto was trying to achieve with blockchain technology. This is mostly important to correct the fear and negativity created in the minds of citizens by the <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/central-bank-of-nigeria\">Central Bank of Nigeria (CBN)</a> and the government, he said.</p><p>In February 2021, the Central Bank of Nigeria <a href=\"https://cointelegraph.com/news/more-harm-than-good-nigerian-crypto-users-in-disbelief-over-cbn-ban\">severed connections between local banks and cryptocurrency exchange firms</a>. According to Abdullahi, this act by the government and the CBN played a role in slowing down the level of blockchain awareness in Nigeria, associating blockchain and crypto with adverse perceptions. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/99-of-nigerians-are-crypto-aware-consensys-report\"><strong><em>99% of Nigerians are crypto aware — ConsenSys report</em></strong></a></p><p>Nigeria has seen better days in terms of crypto interest, with Google Trends <a href=\"https://trends.google.com/trends/explore?q=Bitcoin\" target=\"_blank\" rel=\"noopener nofollow\">data</a> showing the country stepped down from its previous top placing to No. 2 in the world in terms of search interest for Bitcoin <a href=\"https://cointelegraph.com/bitcoin-price\">(BTC).</a></p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/web-3-nigeria-education-efforts-tackle-language-challenge&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-07T07:30:19.000Z",
    "title": "Riot Platforms power strategy reaps $31.7M in Texas energy credits",
    "url": "https://cryptoslate.com/riot-platforms-power-strategy-reaps-31-7m-in-texas-energy-credits/",
    "description": "<p>Continuing its strategic shift aimed at mitigating losses, Riot Platforms, a prominent Bitcoin miner, continues to capitalize on Texas&#8217;s energy credits system, earning a substantial $31.7 million in August alone. According to a report by CNBC, Riot voluntarily adjusted its operations during the state&#8217;s record-breaking heatwave, thus significantly reducing its power consumption and gaining advantage [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/riot-platforms-power-strategy-reaps-31-7m-in-texas-energy-credits/\">Riot Platforms power strategy reaps $31.7M in Texas energy credits</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-09-07T07:14:07.000Z",
    "title": "Anthony Pompliano Discusses SEC Rulings, Spot Bitcoin ETFs, and Market Trends on Fox Business",
    "url": "https://www.cryptoglobe.com/latest/2023/09/anthony-pompliano-discusses-sec-rulings-spot-bitcoin-etfs-and-market-trends-on-fox-business/",
    "description": "On September 6, 2023, Anthony “Pomp” Pompliano, a prominent entrepreneur and crypto investor, appeared on Fox Business’ “The Claman Countdown,” hosted by Liz Claman. Pompliano began by commenting on Grayscale’s recent legal win against the SEC. He noted that the American legal system allows for disagreements between market participants and regulators to be settled in […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-07T07:30:23.000Z",
    "title": "Blockchain Firm Raises Millions From Andreessen Horowitz, Paris Hilton to Help Monetize AI Mashups",
    "url": "https://news.bitcoin.com/blockchain-firm-raises-millions-from-andreessen-horowitz-paris-hilton-to-help-monetize-ai-mashups/",
    "description": "<img width=\"768\" height=\"433\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2286457963-768x433.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Blockchain Firm Raises Millions From Andreessen Horowitz, Paris Hilton to Help Monetize AI Mashups\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2286457963-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2286457963-1024x577.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2286457963-768x433.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2286457963-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2286457963-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2286457963-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/shutterstock_2286457963.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Investors led by Andreessen Horowitz have backed a company that has set out to help content creators monetize their work in the age of artificial intelligence (AI). The tech firm intends to employ blockchain technology to track remixes and mashups that have been spreading online since the invent of AI tools like Chatgpt. Investors Pledge [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-07T07:33:22.000Z",
    "title": "Solana Price Prediction 2023-2032: Is SOL a Good Investment?",
    "url": "https://www.cryptopolitan.com/solana-price-prediction/",
    "description": "Solana Price Prediction 2023-2032 How much is SOL worth? Today&#8217;s Solana price is $19.65, with a 24-hour trading volume of $618,897,839. Solana is up 0.92% in the last 24 hours. The current CoinMarketCap ranking is #9, with a live market cap of $9,473,881,101. It has a circulating supply of 418,890,490 SOL coins, and the maximum supply is not available. Solana price ... <a title=\"Solana Price Prediction 2023-2032: Is SOL a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/solana-price-prediction/\" aria-label=\"More on Solana Price Prediction 2023-2032: Is SOL a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-07T07:28:22.000Z",
    "title": "Anoma Foundation announces the launch of Namada: The forefront of multichain privacy",
    "url": "https://www.cryptopolitan.com/anoma-foundation-announces-launch-of-namada/",
    "description": "The Anoma Foundation, a visionary nonprofit organization in blockchain infrastructure, has unveiled its newest endeavor, the Namada protocol. This mainnet launch aims to enhance multichain privacy, positioning Namada as a revolutionary tool for users to transact with robust confidentiality. Introducing shielded swaps Namada&#8217;s debut introduces the groundbreaking concept of “shielded swaps.” Awa Sun Yin, co-founder ... <a title=\"Anoma Foundation announces the launch of Namada: The forefront of multichain privacy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/anoma-foundation-announces-launch-of-namada/\" aria-label=\"More on Anoma Foundation announces the launch of Namada: The forefront of multichain privacy\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-07T07:30:50.000Z",
    "title": "Is Bitcoin A Buy Or Sell? Ark Invest Shares Market Analysis",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-a-buy-or-sell-ark-invest-market-analysis/",
    "description": "In its new monthly report titled &#8220;The Bitcoin Monthly: Bitcoin Battles Resistance Around Its On-Chain Mean&#8221;, Ark Invest has provided an exhaustive analysis of the current market landscape. The report categorizes its findings into bullish, neutral, and bearish perspectives, providing a holistic view of Bitcoin&#8217;s current and potential future stance. Bullish Arguments For Bitcoin Grayscale Spot ETF and GBTC’s Discount To NAV: On August 29, a pivotal decision was made by a US Federal Appeals Court. They ruled that the U.S. Securities and Exchange Commission (SEC) must revisit and reconsider its earlier rejection of the Grayscale Bitcoin Trust’s (GBTC) application to transition into a spot ETF. This legal development saw GBTC’s discount to NAV shift from -24% to -18% on the same day, indicating heightened market optimism. By the end of August, GBTC was at a discount-to-NAV of -20.6%. Bitcoin’s General Cost Basis Recovery: Bitcoin&#8217;s realized capitalization, which encompasses both its primary (miners) and secondary (investors) markets, is a measure of the aggregate cost basis of BTC. Between Q4 2022 and Q1 2023, the realized cap drawdown stood at -19%, marking its steepest since 2012. This drawdown serves as a barometer for capital outflows from the network. Ark&#8217;s analysis suggests that the deeper the drawdown, the higher the likelihood of Bitcoin holders exiting the market, potentially setting the stage for a more robust bull market. The realized cap has improved from its all-time high in 2021, moving from a 19% low post the FTX collapse in November 2022 to 15.6%, indicating capital inflows over the past 8 months. Related Reading: Bitcoin HODLer Dominance Rises To Record Levels, Bullish Sign? Futures Open Interest Collapse: August 17 witnessed a rapid liquidation of Bitcoin futures by 21.7%, the swiftest since December 2021. Ark Invest interprets this price correction as a &#8220;cathartic sentiment correction.&#8221; Neutral Arguments Bitcoin Price and the 200-Week Moving Average: August was a challenging month for Bitcoin as its price dipped by 5.4%, settling below its 200-week moving average at $27,580. This was the first instance since June 2023. However, Ark Invest posits that Bitcoin should find substantial downside support at its realized price of $20,300. Bitcoin’s On-Chain Mean Resistance: The &#8220;on-chain mean,&#8221; also termed as the &#8220;active-investor price&#8221; or &#8220;true market mean,&#8221; reached $29,608 in August, establishing a potential significant resistance for BTC. This metric, a collaborative effort between ARK Invest and Glassnode, calculated by dividing investors’ cost basis by the number of active coins. These coins are determined based on the aggregate time they&#8217;ve remained dormant relative to the total supply. Stablecoins Market Cap and Liquidity: Stablecoins, often viewed as a liquidity barometer for the market, have seen their 90-day supply drop over 20% from $162 billion in March 2022 to $120 billion currently, signaling a decline in onchain liquidity. However, net inflows during the same timeframe hint at a building bullish market momentum. Bearish Arguments For BTC (All Macro) Real GDP vs. Real GDI Growth Rates: A record divergence has been observed between the YoY percent changes in real Gross Domestic Product (GDP) and real Gross Domestic Income (GDI). Historically, GDP and GDI should be on par, as income earned should equate to the value of goods and services produced. Former Federal Reserve economist, Jeremy Nalewaik, has posited that GDI might be a more accurate indicator than GDP. Related Reading: Turning Point For Bitcoin And Crypto? DXY At 5-Month High Real Federal Funds Policy Rate vs. Natural Rate of Interest: For the first time since 2009, the Real Federal Funds Policy Rate has surpassed the Natural Rate of Interest, indicating a shift towards restrictive monetary policy. This theoretical rate, as conceptualized by New York Federal Reserve President, John Williams, is the rate where the economy neither expands nor contracts. With monetary policy&#8217;s impact on the economy being long and variable, lending and borrowing are expected to face increased downward pressure. Government&#8217;s Employment Revision: Employment, a lagging indicator, has been pivotal in the Federal Reserve’s rate decisions. Despite the labor disruptions caused by the COVID-19 pandemic expected to have been resolved by now, the government has revised nonfarm payroll statistics downward for six consecutive months. This suggests a weaker labor market than initially reported. The last instance of such a trend, outside of a recession, was in 2007, right before the Great Financial Crisis. In summary, Ark Invest&#8217;s report presents three bullish, four neutral, and three bearish arguments on Bitcoin and the broader market, emphasizing that the market could be at a crucial turning point. At press time, BTC traded at $25,789. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-07T07:37:46.000Z",
    "title": "Best Crypto Selection — Mastering Chancer’s Presale Capacity in an Evolving Market",
    "url": "https://www.crypto-news-flash.com/best-crypto-selection-mastering-chancers-presale-capacity-in-an-evolving-market/?utm_source=rss&utm_medium=rss&utm_campaign=best-crypto-selection-mastering-chancers-presale-capacity-in-an-evolving-market",
    "description": "<img width=\"1251\" height=\"632\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Chancor.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Chancor.jpg 1251w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Chancor-300x152.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Chancor-1024x517.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Chancor-768x388.jpg 768w\" sizes=\"(max-width: 1251px) 100vw, 1251px\" />Crypto markets continue to evolve in 2023 with the launch of more compelling new projects vying to become the best crypto investment of the year. One of these is Chancer, a brand-new online predictions market harnessing blockchain’s power to revolutionize the growing online betting industry. With its exciting presale event in full swing, having already [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-07T07:25:11.000Z",
    "title": "Ripple President: World’s Trillion-Dollar Banks Must “Adapt to XRP or Die” to Be Part of Future Finance – Could it Drive XRP Price to $1?",
    "url": "https://www.crypto-news-flash.com/ripple-president-worlds-trillion-dollar-banks-must-adapt-to-xrp-or-die-to-be-part-of-future-finance-could-it-drive-xrp-price-to-1/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-president-worlds-trillion-dollar-banks-must-adapt-to-xrp-or-die-to-be-part-of-future-finance-could-it-drive-xrp-price-to-1",
    "description": "<img width=\"1131\" height=\"765\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Defi.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Defi.jpg 1131w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Defi-300x203.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Defi-1024x693.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Defi-768x519.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Defi-104x69.jpg 104w\" sizes=\"(max-width: 1131px) 100vw, 1131px\" />The recent partnership between SBI Remit, a branch of SBI Holdings, and Ripple emphasizes the increasing importance of DeFi in the traditional banking sector. Ripple&#8217;s president, Monica Long, suggests the necessity for major banks to adopt decentralized finance (DeFi) for their future sustainability. The crypto space buzzed with excitement following the Paris Blockchain Week&#8217;s tweet [...]"
  }
]