[
  {
    "source": "Cryptopolitan",
    "date": "2024-02-14T07:02:12.000Z",
    "title": "AI in Neurological Diagnosis – Brain Death Declarations, Parkinson’s-Paraquat Links, and AI Advancements in ARIA Detection",
    "url": "https://www.cryptopolitan.com/ai-in-neurological-diagnosis-brain-death/",
    "description": "In the ever-evolving landscape of medical science and ethics, the intersection of contentious debates, emerging research, and technological breakthroughs often takes center stage, with advancements such as AI in neurological diagnosis illuminating new pathways for understanding and addressing complex medical challenges.&#160; Amidst ongoing discussions surrounding brain death declarations, the safety implications of paraquat exposure in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-14T06:59:40.000Z",
    "title": "Arbitrum Price Prediction 2024 – 2033: ARB breaks key barrier",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2024 &#8211; 2033 Scaling solutions operate on top of a blockchain’s base layer, such as Ethereum, to enhance performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their transactions more efficiently. Arbitrum adds to Ethereum’s numerous advantages, boosts the network’s sluggish performance, and [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-14T06:44:29.000Z",
    "title": "Crypto investor loses big after spending $113K in gas to snipe token launch",
    "url": "https://www.cryptopolitan.com/crypto-loses-113k-in-gas-to-snipe-token-lau/",
    "description": "In a daring move indicative of the fervor surrounding cryptocurrency markets, a crypto investor recently made headlines by spending a staggering $113,000 in gas fees to snipe the launch of a new ERC-404 token.&#160; The investor, aiming to seize an opportunity in the rapidly evolving landscape of crypto assets, transferred 10 ETH (approximately $26,000) to [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-14T06:41:29.000Z",
    "title": "The Hidden Expanse of the World’s Coral Reefs",
    "url": "https://www.cryptopolitan.com/the-hidden-expanse-of-the-worlds-coral-reefs/",
    "description": "In a groundbreaking discovery, scientists have revealed that the world&#8217;s coral reefs cover an area 25% larger than earlier estimates suggested. Utilizing a blend of high-resolution satellite imagery, advanced machine learning algorithms, and invaluable insights from a global network of coral reef communities, researchers have identified an additional 64,000 square kilometers of coral reefs, equivalent [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-14T07:08:15.000Z",
    "title": "Rebel Satoshi presale at last round, Solana crosses $110",
    "url": "https://crypto.news/rebel-satoshi-presale-at-last-round-solana-crosses-110/",
    "description": "Solana (SOL) recently rose to $110 as more investors explored the last round of the Rebel Satoshi (RBLZ) presale"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-14T07:07:57.000Z",
    "title": "Crypto market, Bitcoin go bearish following US CPI report",
    "url": "https://crypto.news/crypto-market-bitcoin-go-bearish-following-us-cpi-report/",
    "description": "The global crypto market and the leading cryptocurrency, Bitcoin (BTC), registered a slight decline as the U.S. Consumer Price Index (CPI) data exceeded expectations. According to data from the CME Group, the CPI annual rate dropped from 3.4% to 3.1%&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-14T07:02:13.000Z",
    "title": "Sushi to launch Susa — a decentralized derivatives platform on Layer N",
    "url": "https://crypto.news/sushi-to-launch-susa-a-decentralized-derivatives-platform-on-layer-n/",
    "description": "Sushi is set to launch Susa, a decentralized derivatives platform on Layer N, an Ethereum Layer 2 solution aiming for high-speed transactions. Layer N will support the development of applications, from smart contracts to rollups, through its Nord Engine, promising&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-14T06:53:45.000Z",
    "title": "Bitcoin reclaims $50,000, BNB and InQubeta post solid growth",
    "url": "https://crypto.news/bitcoin-reclaims-50000-bnb-and-inqubeta-post-solid-growth/",
    "description": "Bitcoin, BNB, and InQubeta have been firm in recent sessions. Analysts believe their uptrend will continue"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-14T06:53:18.000Z",
    "title": "Crypto liquidations daily volume approaches $140m",
    "url": "https://crypto.news/crypto-liquidations-daily-volume-approaches-140m/",
    "description": "Between Feb. 13 and Feb. 14, 2024, the volume of liquidations in the cryptocurrency market approached $140 million. According to&#160;CoinGlass, 45,965 traders have had their positions liquidated in the last 24 hours. Approximately $91 million in losses came from long&#8230;"
  }
]