[
  {
    "source": "Cointelegraph",
    "date": "2024-01-09T02:16:05.000Z",
    "title": " ‘Nothing left to decide’ — Former SEC chair says Bitcoin ETF is inevitable ",
    "url": "https://cointelegraph.com/news/bitcoin-etf-approval-inevitable-sec-chair-former-jay-clayton",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvZjUxOTdiYjEtZTVmOS00ZDA5LWFiOTktY2NlYmMyYmI5OTU0LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Former SEC chair Jay Clayton says there’s no doubt whether the SEC will approve a spot Bitcoin ETF.</p>\n                    <p><p>A former chairman of the United States Securities and Exchange Commission (SEC) says it is “inevitable” that a spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) ETF will be approved.</p><p>Speaking in a Jan. 8 <a href=\"https://www.cnbc.com/video/2024/01/08/fmr-sec-chair-jay-clayton-on-bitcoin-etf-approval-is-inevitable-theres-nothing-left-to-decide.html\" target=\"_blank\" rel=\"noopener nofollow\">interview</a> with CNBC, former SEC chair Jay Clayton said that it is now a foregone conclusion that the SEC will approve the first spot Bitcoin ETF for trading in the United States. </p><p>For the last ten years, the <a href=\"https://cointelegraph.com/news/bitcoin-spot-etf-deny-rug-pull-gary-gensler-sec-bloomberg-analysts\">SEC has denied every application</a> for a spot Bitcoin ETF, citing concerns over potential market manipulation and fraud.</p><p><a href=\"https://cointelegraph.com/news/bitcoin-etf-approval-inevitable-sec-chair-former-jay-clayton\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-09T02:21:32.000Z",
    "title": "Crypto Projects Embrace A New Paradigm As Communities Shape Their Evolution",
    "url": "https://www.cryptopolitan.com/crypto-projects-embrace-a-new-paradigm-as-communities-shape-their-evolution/",
    "description": "Cryptocurrency was originally conceived as a form of decentralized money that no central bank or government could control, but since the birth of Bitcoin in 2009 it has evolved far beyond that vision.&#160; These days, crypto represents a global movement that’s driven by the thousands of dedicated communities that have sprung up around its most [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-09T02:25:52.000Z",
    "title": "Presale mania as Pushd (PUSHD) sells out stage one in just 5 days while Ethereum (ETH) and Cardano (ADA) fall in price",
    "url": "https://nulltx.com/presale-mania-as-pushd-pushd-sells-out-stage-one-in-just-5-days-while-ethereum-eth-and-cardano-ada-fall-in-price/",
    "description": "In the whirlwind of presale excitement, Pushd (PUSHD) emerges as a star, selling out Stage One in an astonishing 5 days. While Pushd (PUSHD) experiences a surge, Ethereum (ETH) stumbles alongside Cardano (ADA), both witnessing a decline in prices. This presale phenomenon highlights the dynamic shifts within the crypto landscape, [&#8230;]"
  }
]