[
  {
    "source": "Cointelegraph",
    "date": "2023-08-14T03:55:07.000Z",
    "title": "Sam Bankman-Fried spends 3rd night in notorious New York prison",
    "url": "https://cointelegraph.com/news/sam-bankman-fried-in-notorious-brooklyn-jail",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/72e219f3-9bb3-4883-b21a-aac54d298e77.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The former FTX CEO has swapped his parent's cozy Stanford home for the Metropolitan Detention Center in Brooklyn, which isn't known for its comforts.</p>\n                    <p><p>Former FTX CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried</a> is going into his third night with over 1,500 other inmates in one of New York's most notorious prisons — a far cry from his parent's multi-million dollar five-bedroom home in Stanford.</p><p>The FTX co-founder <a href=\"https://cointelegraph.com/news/judge-orders-sam-bankman-fried-bail-revoked-following-allegations-witness-intimidation\">had his bail revoked</a> by Judge Lewis Kaplan in an Aug. 11 hearing, where he described the Brooklyn Metropolitan Detention Center (MDC) as being a jail “not on anybody’s list of five-star facilities.” </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Duuude they put SBF in MDC?<br><br>That’ll break him. Going to get a guilty plea within days…. <a href=\"https://t.co/WrUf8rzKUO\">https://t.co/WrUf8rzKUO</a></p>&mdash; Adam Cochran (adamscochran.eth) (@adamscochran) <a href=\"https://twitter.com/adamscochran/status/1690886790914142208?ref_src=twsrc%5Etfw\">August 14, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The MDC is a federal administrative detention center based in New York. It is an all-gender facility accommodating individuals under federal custody. The facility currently <a href=\"https://www.bop.gov/locations/institutions/bro/\" target=\"_blank\" rel=\"noopener nofollow\">houses</a> over 1,500 inmates but was only built to accommodate 1,000. </p><p>Bankman-Fried is expected to spend at least the next two months at the facility as he awaits his criminal trial, though his lawyers have already filed an appeal to have his bail revocation revised.</p><h3>Not exactly Club Me</h3><p>Unfortunately for Bankman-Fried, the prison has long been embroiled in scandals involving inmate mistreatment and corruption.</p><p>Ex-warden Cameron Lindsay <a href=\"https://www.nytimes.com/2019/02/09/nyregion/brooklyn-jail-no-heat-inmates.html\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in 2019 that the MDC was “one of the most troubled, if not the most troubled facility in the Bureau of Prisons.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/09cb446a-3baf-4ba2-8235-9e2815538def.JPG\"  /><figcaption style=\"text-align: center;\"><em>Outside of the Brooklyn MDC in 2008. Source: Jim Henderson, Wikimedia Commons</em></figcaption></figure><p>In April prosecutors <a href=\"https://www.justice.gov/usao-edny/pr/brooklyn-federal-correctional-officer-charged-bribery\" target=\"_blank\" rel=\"noopener nofollow\">charged</a> a guard with taking bribes in exchange for smuggling in contraband such as phones, cigarettes, and drugs.</p><p>In winter 2019 the facility suffered a week-long power outage leaving inmates with no heating.</p><p>The Intercept <a href=\"https://theintercept.com/2019/02/16/metropolitan-detention-center-mdc-brooklyn-jail/\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> inmates were banging on cell windows to outside onlookers and those non-violently protesting the conditions were pepper sprayed, thrown in solitary confinement or had their toilets shuttered.</p><h3>MDC's star-studded former inmates</h3><p>Many high-profile figures have previously been remanded in the Brooklyn big house including artists 6ix9ine, R. Kelly and Fetty Wap.</p><p>Martin Shkreli, better known as “pharma bro,” also had a stint at the MDC along with Jeffery Epstein’s sex trafficking accomplice Ghislaine Maxwell.</p><p>Up until recently, Bankman-Fried was on bail confined to his parent's $4 million Palo Alto home that boasts five bedrooms and a pool.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/4efe79ce-8ed9-40bb-b09a-15e8483ed097.png\"  /><figcaption style=\"text-align: center;\"><em>Aerial view of the Bankman-Fried house in Palo Alo, California. Source: Google Maps</em></figcaption></figure><p>The revocation of Bankman-Fried’s bail came after <a href=\"https://cointelegraph.com/news/ftx-founder-accused-of-leaking-caroline-ellisons-private-papers\">a leak of a diary</a> belonging to former Alameda Research CEO Caroline Ellison to The New York Times which described her feelings toward Bankman-Fried and her role at the company.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/ftx-law-firm-fenwick-west-faces-class-lawsuit\"><strong><em>FTX’s former law firm hit with lawsuit alleging it set up shadowy entities</em></strong></a></p><p>Prosecutors alleged Bankman-Fried leaked the diary in an attempt to discredit Ellison — a witness in his criminal trial — and intimidate her.</p><p>His lawyers <a href=\"https://cointelegraph.com/news/sbf-denies-witness-tampering-caroline-ellison-diary-jail\">denied the allegations</a>, calling Bankman-Fried’s contact with reporters a “proper exercise of his rights to make fair comment on an article already in progress” and appealed the judge’s decision to revoke his bail.</p><p><strong><em>Deposit risk: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  }
]