[
  {
    "source": "Cryptopolitan",
    "date": "2023-09-02T14:35:45.000Z",
    "title": "Top 5 NFT APIs on Arbitrum, the Optimal Environment for NFT Transactions",
    "url": "https://www.cryptopolitan.com/top-5-nft-apis-on-arbitrum/",
    "description": "In the dynamic realm of blockchain technology, Non-Fungible Tokens (NFTs) have emerged as revolutionary assets, transforming how we perceive ownership and value in the digital sphere. These distinct digital assets have transcended conventional collectibles, penetrating diverse industries like art, gaming, and music. Yet, the surge in NFT popularity has underscored the scalability challenges facing major ... <a title=\"Top 5 NFT APIs on Arbitrum, the Optimal Environment for NFT Transactions\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-5-nft-apis-on-arbitrum/\" aria-label=\"More on Top 5 NFT APIs on Arbitrum, the Optimal Environment for NFT Transactions\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-02T14:24:22.000Z",
    "title": "Is AI the Ultimate Investment Opportunity of Our Time?",
    "url": "https://www.cryptopolitan.com/is-ai-the-ultimate-investment/",
    "description": "Artificial Intelligence (AI) has emerged as a compelling investment opportunity, sparking comparisons to historic innovations such as the internet and smartphones. While AI is just one of several emerging technologies, it plays a pivotal role in powering a wide array of innovations. The question remains: Can AI truly deliver the unprecedented returns investors are hoping ... <a title=\"Is AI the Ultimate Investment Opportunity of Our Time?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/is-ai-the-ultimate-investment/\" aria-label=\"More on Is AI the Ultimate Investment Opportunity of Our Time?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-02T14:30:33.000Z",
    "title": "Crypto Analyst’s September Warning: Bitcoin Faces A Red Month",
    "url": "https://www.newsbtc.com/bitcoin-news/crypto-analysts-september-warning-bitcoin-faces-a-red-month/",
    "description": "In a recent video by renowned cryptocurrency analyst Benjamin Cowen, ominous predictions for Bitcoin performance in September have emerged. Cowen, known for his data-driven approach to cryptocurrency analysis, shared his insights regarding Bitcoin&#8217;s historical performance in September and its potential trajectory for the current year. Cowen acknowledged that September has traditionally been a challenging month for BTC, often characterized by negative price movements. He emphasized that while historical trends suggest a red month for Bitcoin in September, there are no guarantees, and occasional green September does occur. Related Reading: Shiba Inu Marketing Lead Sends Important Message To SHIB Holders The analyst highlighted that Bitcoin had experienced six consecutive red September from 2017 to 2022. The average return for Bitcoin in September has historically been around -6.6%, with a standard deviation that adds to the unpredictability of the cryptocurrency&#8217;s performance. Examining Potential Price Declines Cowen then delved into the potential price decline for Bitcoin in September. Given Bitcoin&#8217;s opening price of just below $26,000 for the month, a 7% decrease would bring its value to approximately $24,000. He further pointed out that in the pre-halving year of 2019, Bitcoin witnessed a 14% drop in September, potentially pushing its price down to $22,000. To bolster his argument, Cowen referred to a recent tweet in which he speculated a substantial chance of Bitcoin reaching $23,000 in September. Although he stressed that this prediction is far from a guarantee, he underscored the seasonal pattern, the downward momentum, and the recent monthly close below certain support levels as factors that make a dip to $23,000 plausible. Moreover, Cowen discussed the average returns in all pre-halving years for the month, revealing a drop of approximately 17.7%, which could result in Bitcoin trading at around $21,500 if history repeats itself. On August&#8217;s performance, Cowen noted that Bitcoin had already experienced a 10% drop. While August&#8217;s long-term average is approximately 21%, averaging only the last two pre-halving years (2015 and 2019) suggests a more modest -11% to -12% average drop. This highlights that Bitcoin may follow a similar pattern in September, potentially softening the blow to around $24,000. The current price of Bitcoin (BTC) is  $25,813, with a 24-hour price change of -0.99%. As the leading cryptocurrency, Bitcoin commands a significant market cap of $502,654,681,515, securing its position as the number one cryptocurrency by market capitalization. In the past 24 hours, Bitcoin has experienced a trading volume of $17,603,174,408, making it the second most actively traded cryptocurrency by volume. This high trading volume indicates strong interest and activity within the Bitcoin market, contributing to its liquidity. Navigating Bitcoin&#8217;s Cyclical Nature Cowen emphasized that despite the uncertainty, the seasonality of Bitcoin and the existing downward momentum make a test of the $23,000 level highly likely in the near future, possibly in September or October. Cowen reflected on the cyclical nature of Bitcoin&#8217;s price movements in a broader context, stating that it often alternates between bullish and bearish phases. He stressed that during pre-halving years, Bitcoin tends to rise significantly during the first half and experience declines in the latter half. According to Cowen, this pattern is designed to &#8220;wreck&#8221; both bulls and bears before entering a period of sustained growth. He also pointed out that while BTC may face challenges in the short term, once quantitative easing (QE) returns and the cryptocurrency market sentiment improves, altcoins could regain momentum. Related Reading: On-chain Sleuth Potentially Unveils Shiba Inu Founder With Shocking Affiliates In conclusion, Cowen cautioned his audience to remain vigilant in September, historically a month of red returns for Bitcoin. He urged caution, citing past data and market dynamics as indicators of a potentially challenging month ahead. While the future remains uncertain, Cowen&#8217;s data-driven analysis serves as a valuable resource for those navigating the turbulent waters of the cryptocurrency market. Investors and enthusiasts will undoubtedly watch closely to see if Bitcoin&#8217;s performance aligns with his predictions in the coming weeks and months. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-02T14:12:53.000Z",
    "title": "Robinhood’s Shiba Inu Holdings Skyrocket: Acquires 14 Trillion SHIB Tokens",
    "url": "https://www.crypto-news-flash.com/robinhoods-shiba-inu-holdings-skyrocket-acquires-14-trillion-shib-tokens/",
    "description": "<img width=\"1920\" height=\"1080\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/shiba-6763358_1920.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/shiba-6763358_1920.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/shiba-6763358_1920-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/shiba-6763358_1920-1024x576.jpg 1024w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" /> Robinhood is emerging as a significant player in the cryptocurrency space, with a massive holding of 34 trillion Shiba Inu (SHIB) tokens, making it a dominant force. Robinhood&#8217;s SHIB holdings have grown rapidly, increasing by 70.4 percent in just 20 days to approximately $279.85 million. Arkham Intelligence has designated Robinhood as a dominant force in [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-02T14:30:46.000Z",
    "title": "Over 90% of Cardano, Polygon and One Ethereum Rival’s Holders Are Underwater: Analytics Firm IntoTheBlock",
    "url": "https://dailyhodl.com/2023/09/02/over-90-of-cardano-polygon-and-one-ethereum-rivals-holders-are-underwater-analytics-firm-intotheblock/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/02/cardano-three-oversold.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/02/cardano-three-oversold.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/02/cardano-three-oversold.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/02/cardano-three-oversold.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/02/cardano-three-oversold.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/02/cardano-three-oversold.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/02/cardano-three-oversold.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A leading blockchain analytics firm says that a huge percentage of Cardano (ADA) and Polygon (MATIC) holders are underwater. According to IntoTheBlock, 94% of the holders of Ethereum (ETH) competitor Cardano are sitting on losses, just 5% are profitable and 1% are breaking even. Cardano is trading for $0.25 at time of writing, down 91.73% [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/02/over-90-of-cardano-polygon-and-one-ethereum-rivals-holders-are-underwater-analytics-firm-intotheblock/\">Over 90% of Cardano, Polygon and One Ethereum Rival’s Holders Are Underwater: Analytics Firm IntoTheBlock</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]