[
  {
    "source": "Cointelegraph",
    "date": "2023-07-23T02:47:40.000Z",
    "title": "Terra interim CEO says any 'little progress' made gets derailed by accusations",
    "url": "https://cointelegraph.com/news/terra-ceo-progress-derailed-accusations",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/7f60a1c2-0c7c-446d-8d39-bf5d5c71522f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Terraform Labs recently appointed CEO Chris Amani held a Twitter Spaces with the purpose of separating the operations of Terraform Labs from Do Kwon’s personal affairs.</p>\n                    <p><p>Terraform Labs faces a “big hill to climb” as the progress of its various projects in development are constantly being impeded by frequent accusations, according to Terra’s new interim CEO Chris Amani.</p><p>During a July 20 Twitter <a href=\"https://twitter.com/statuses/1682012601042059265\" target=\"_blank\" rel=\"noopener nofollow\">Spaces</a>, titled <em>A Terra Community Talk</em>, Amani joined several Terra employees to discuss the challenges ahead for Terra moving forward. This took place shortly after Amani was <a href=\"https://cointelegraph.com/news/do-kwon-terraform-labs-appoints-new-ceo-from-existing-team-report\">appointed as Terra’s new CEO</a>, while the former CEO, Do Kwon, continues to battle legal issues.</p><p>He noted that the <a href=\"https://cointelegraph.com/news/terra-co-founder-do-kwon-reportedly-indicted-for-document-forgery\">frequent allegations</a> against Do Kwon, who is currently in a jail cell in Montenegro and facing possible extradition to South Korea or the United States, has shattered any momentum that Terra has been building recently.</p><blockquote>“Everytime we would make a little progress there would be some accusation or something that would derail us”.</blockquote><p>Cointelegraph reported on June 19 that Kwon was found guilty of attempting to leave Montenegro using a <a href=\"https://cointelegraph.com/news/do-kwon-sentenced-to-4-months-in-prison-in-montenegro-on-fake-passport-charges\">false Costa Rican passport</a>. He was sentenced to four months in prison despite reportedly telling the court that he wasn’t aware the passport was allegedly forged. </p><p>Amani further stated that Terra has “maybe 9” different projects at various levels of development to be released over the coming months.</p><p>It was noted that no new tokens will be launched with any of these new developments, as it will be focusing on “driving utility” back to its native token, Luna (<a href=\"https://cointelegraph.com/terra-price-index\">LUNA</a>). </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We have 3 projects on the shelf, close to complete, looking for teams to finish off and launch on Terra.  If you have a team to take one and want to learn more, let <a href=\"https://twitter.com/mc_ust?ref_src=twsrc%5Etfw\">@mc_ust</a> know.</p>&mdash; Chris Amani (@fleece_cannon) <a href=\"https://twitter.com/fleece_cannon/status/1682170430147428353?ref_src=twsrc%5Etfw\">July 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Amani believes that it is going to be a “big hill to climb,” but stated it is not a unique situation within the cryptocurrency industry. </p><p>“This is not going to be easy rebuilding; I mean nothing is easy in crypto right now” he said.</p><p>He explained that the shortage of liquidity is due to a lot of DeFi applications having to compete with risk free rate of returns that are “fairly compelling right now.”</p><p><strong><em>Related:</em></strong><a href=\"https://cointelegraph.com/news/legal-proceedings-terraform-labs-south-korea\"><strong><em> </em></strong><strong><em>Legal proceedings start for Terraform Labs co-founder in South Korea: Report</em></strong></a></p><p>He further acknowledged that Terra currently faces difficulty competing with other layer one blockchain projects, as it “doesn’t even have a treasury of Luna.\"</p><blockquote>“Despite the lack of activity in crypto, despite the bear market, it’s still incredibly competitive from a layer one perspective. There are still teams with very big treasuries that can pay developers a lot of money to come build on their blockchain.”</blockquote><p>However, he claims that most employees have stood by the company, despite the struggles faced by the company. </p><p>“We have been able to hold a large portion of the team that was here before the depeg” he stated.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/sec-reviews-ripple-ruling-us-bill-seeks-control-over-defi-and-more-hodlers-digest-july-16-22/\"><strong><em>SEC reviews Ripple ruling, US bill seeks control over DeFi, and more: Hodler’s Digest, July 16-22</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]