[
  {
    "source": "Crypto Briefing",
    "date": "2023-10-09T16:02:16.000Z",
    "title": "Solana Institutional Inflows Hit 2022 High",
    "url": "https://cryptobriefing.com/solana-institutional-inflows-hit-2022-high/?utm_source=feed&utm_medium=rss",
    "description": "Solana led altcoin inflows of $24 million last week, hitting a 2022 high, while Bitcoin attracted $43 million."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-09T16:02:17.000Z",
    "title": "VitaDAO launches biotech firm for medical research",
    "url": "https://www.cryptopolitan.com/vitadao-launches-biotech-medical-research/",
    "description": "A decentralized autonomous organization (DAO), VitaDAO, is pushing the boundaries of life extension by founding a biotech company dedicated to cutting-edge research in the treatment of cancer and age-related diseases. VitaDAO, a community-driven collective with a primary goal of funding and advancing early-stage longevity research, has unveiled Matrix Biosciences in partnership with renowned biologist Vera ... <a title=\"VitaDAO launches biotech firm for medical research\" class=\"read-more\" href=\"https://www.cryptopolitan.com/vitadao-launches-biotech-medical-research/\" aria-label=\"More on VitaDAO launches biotech firm for medical research\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-09T15:56:55.000Z",
    "title": "Is There a Redemptive Road for Bitcoin Miners as Energy Consumers?",
    "url": "https://www.cryptopolitan.com/bitcoin-miners-as-energy-consumers/",
    "description": "In the dynamic realm of digital currencies, Bitcoin, with its decentralized and cryptographic nature, has not only revolutionized the financial landscape but also sparked a fervent discussion regarding its environmental footprint. This guide seeks to delve into the intricate relationship between Bitcoin miners and their escalating energy consumption, unraveling the multifaceted implications they cast upon ... <a title=\"Is There a Redemptive Road for Bitcoin Miners as Energy Consumers?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-miners-as-energy-consumers/\" aria-label=\"More on Is There a Redemptive Road for Bitcoin Miners as Energy Consumers?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-09T15:56:00.000Z",
    "title": "Concerns Raised Over Sympathetic Portrayal of SBF Amid Trial",
    "url": "https://www.cryptopolitan.com/concerns-over-sympathetic-portrayal-of-sbf/",
    "description": "In the midst of the ongoing trial of Sam Bankman-Fried (SBF), co-founder of the defunct crypto exchange FTX, prominent figure Charles Hoskinson has voiced alarm over what he perceives as a sympathetic portrayal of SBF in recent media coverage. Hoskinson&#8217;s concerns center around influential individuals connected to Bankman-Fried potentially influencing the narrative to avoid his ... <a title=\"Concerns Raised Over Sympathetic Portrayal of SBF Amid Trial\" class=\"read-more\" href=\"https://www.cryptopolitan.com/concerns-over-sympathetic-portrayal-of-sbf/\" aria-label=\"More on Concerns Raised Over Sympathetic Portrayal of SBF Amid Trial\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-09T15:45:41.000Z",
    "title": "HTX Hacker Returns Stolen Funds to Huobi’s Global Exchange",
    "url": "https://www.cryptopolitan.com/htx-hacker-returns-stolen-funds/",
    "description": "In a surprising turn of events, the hacker responsible for a recent attack on Huobi&#8217;s global exchange, HTX, has returned all stolen funds to the platform. The incident, which occurred in late September, saw the hacker make off with approximately $7.9 million worth of Ethereum (ETH) from the exchange&#8217;s hot wallet.&#160; HTX CEO Justin Sun ... <a title=\"HTX Hacker Returns Stolen Funds to Huobi&#8217;s Global Exchange\" class=\"read-more\" href=\"https://www.cryptopolitan.com/htx-hacker-returns-stolen-funds/\" aria-label=\"More on HTX Hacker Returns Stolen Funds to Huobi&#8217;s Global Exchange\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-09T16:04:20.000Z",
    "title": "SophiaVerse partners with Decentraland",
    "url": "https://crypto.news/sophiaverse-partners-with-decentraland/",
    "description": "SophiaVerse has partnered with Decentraland, mixing the world of the metaverse and the AI."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-09T16:00:16.000Z",
    "title": "Shiba Inu-Based BONE Gearing Up For Massive Rally, Here’s Why",
    "url": "https://www.newsbtc.com/bone/shiba-inu-based-bone-rally/",
    "description": "The Shiba Inu ecosystem has witnessed a recent surge in BONE Shibaswap investors, as witnessed a recent surge in BONE Shibaswap investors, as some of Shiba Inu&#8217;s biggest whales are loading up their bags. According to data from IntoTheBlock, whales of BONE tokens have boosted their holdings in the past month to increase their concentration of the ecosystem to over 43%.  Whale Wallets Loading Up On BONE In Anticipation Of A Rally BONE (Shibaswap) is one of the most important tokens in the Shiba Inu ecosystem and has done well since the launch of Shibarium, as the token went on a bullish trend to reach $1.70 in August. Since then, things have cooled down in the Shiba Inu ecosystem, and the token has lost most of this gain. Related Reading: Dogecoin In A Dire Position As Daily Active Addresses Drop Drastically At the time of writing, BONE is trading at $0.7813, has a market cap of $195 million, and a max supply of 230,003,023 BONE tokens.  On-chain data from intelligence company IntoTheBlock has shown that most of this market cap is concentrated between 12 whale addresses with 108.53 million tokens. However, these whale wallets have been steadily accumulating BONE over the past month. Whale activity rises &#124; Source: IntoTheBlock The total net flow between addresses holding at least 0.1% of the total market cap has increased by +272.92% in a 7-day timeframe. A similar metric following the movement of BONE tokens has shown that the concentration of these tokens in whale addresses (wallets holding more than 1% of the total supply) has increased by +19.74% in the past 30 days.  On the other hand, concentration in investor addresses (wallets holding between 0.1% and 1% of the total supply) has reduced by 1.37% in the past 30 days. BONE holder concentration &#124; Source: IntoTheBlock Recent Price Action Shows Bullish Momentum Might Be Building BONE is currently trending downward after having a bullish run since Shibarium&#8217;s introduction. Data has also shown only 34% of holders are making money at the current price. However, the increase in large wallet holdings of BONE coupled with a 33.48% increase in the past 24-hour trading volume is a bullish reversal signal, as it can increase buying pressure from retail investors.  Related Reading: When Are AMMs Coming To XRP Ledger? Ripple CTO Gives Clear Answer Price action reveals BONE is currently at a major support zone of $0.76. A reaction to the support by bulls might see a rally back up. On the other hand, a break below the support might suggest a further fall in the price of the token. This comes after Shiba Inu&#8217;s lead developer recently renounced the BONE smart contract. Renouncing the contract means developers no longer have control of the token, making it fully decentralized.  Token price sitting at $0.766 &#124; Source: BONEUSD on Tradingview.com Featured image from Watcher Guru, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-09T16:00:25.000Z",
    "title": "Will Shiba Inu, ApeMax, and Dogecoin Moon in the Next Crypto Bull Run?",
    "url": "https://www.crypto-news-flash.com/will-shiba-inu-apemax-and-dogecoin-moon-in-the-next-crypto-bull-run/?utm_source=rss&utm_medium=rss&utm_campaign=will-shiba-inu-apemax-and-dogecoin-moon-in-the-next-crypto-bull-run",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-32.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-32.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-32-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The undulating waves of the cryptocurrency ecosystem often offer glimpses of potential titans on the horizon. As the crypto community eagerly anticipates the next major rally, tokens like Dogecoin and Shiba Inu, which previously captivated headlines, now share the limelight with other young tokens in 2023 such as ApeMax — a novel entrant swiftly catching [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-09T16:07:00.000Z",
    "title": "Crypto Watchlist For The Week Ahead: FXS, BNB, APT, RDNR, & SNX",
    "url": "https://coinedition.com/crypto-watchlist-for-the-week-ahead-fxs-bnb-apt-rdnr-snx/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bears Capture AVAX Market After Bulls Fail to Breach $21.84 Resistance\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1.jpg 730w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/02/Price-analysis-1-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The analyst known as The DeFi Investor shared in an X post yesterday that the coming week will be a very busy one in the cryptocurrency space with a number of developments and unlocks taking place. The analyst urged traders to keep tokens like FXS, BNB, APT, RDNT, and SNX on their watchlists. Frax Share [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/crypto-watchlist-for-the-week-ahead-fxs-bnb-apt-rdnr-snx/\">Crypto Watchlist For The Week Ahead: FXS, BNB, APT, RDNR, &amp; SNX</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]