[
  {
    "source": "Cointelegraph",
    "date": "2024-04-03T23:44:29.000Z",
    "title": " Coinbase partners with Lightspark for Bitcoin Lightning payments ",
    "url": "https://cointelegraph.com/news/coinbase-partners-lightspark-bitcoin-lightning-payments",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvMGY2NzFmZDktNWM2Ni00ZDgxLWExOGEtZDUxMDcyM2ZiN2JkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Lightspark says the integration on Coinbase will offload more transaction activity away from Bitcoin’s base layer, where fees have increased considerably over the last 12 months.</p>\n                    <p><p>Coinbase is one step closer to integrating Bitcoin Lightning on its platform amid a new partnership with Lightspark, an enterprise-focused Lightning solution led by former PayPal president David Marcus.</p><p>In an April 4 X post, Coinbase’s CEO Brian Armstrong <a href=\"https://x.com/brian_armstrong/status/1775620529384296740\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the integration of the Bitcoin layer-2 network will happen “soon” — which will allow its 108 million user base to leverage potentially faster and cheaper Bitcoin transactions. </p><p>“Lighting up all Coinbase touchpoints with Lightning” will offload more transaction activity to Bitcoin’s second layer, which will combat the recent rise in fees on Bitcoin’s base layer, Lightspark <a href=\"https://www.lightspark.com/news/coinbase-selects-lightspark?utm_source=owned&amp;utm_medium=social&amp;utm_campaign=coinbase\" target=\"_blank\" rel=\"noopener nofollow\">explained</a> in an April 3 post.</p><p><a href=\"https://cointelegraph.com/news/coinbase-partners-lightspark-bitcoin-lightning-payments\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-04-04T00:00:00.000Z",
    "title": "Weathering the Storm: Holding Bitcoin ($BTC) Was Profitable in 99.92% of Days, Data Shows",
    "url": "https://www.cryptoglobe.com/latest/2024/04/weathering-the-storm-holding-bitcoin-btc-was-profitable-in-99-92-of-days-data-shows/",
    "description": "For Bitcoin ($BTC) holders the last few months have been largely profitable as the price of the cryptocurrency moved up over 140% over the last six months, in a rise that has meant only a minuscule 0.16%, or six days out of the past 3,732 trading days, have resulted in losses for investors based on […]\n"
  },
  {
    "source": "NullTX",
    "date": "2024-04-04T00:01:55.000Z",
    "title": "SUI boosts, ApeWifHat rises, BlockDAG 2024’s crypto star!",
    "url": "https://nulltx.com/sui-boosts-apewifhat-rises-blockdag-2024s-crypto-star/",
    "description": "20,000x ROI Potential: BlockDAG Whitepaper Launches, Presale Hits $12.4M; SUI Investors Rush Amid ApeWifHat Surges  This article is aimed at investors seeking the next promising cryptocurrency investment but are facing uncertainty in their decision-making process. By examining recent developments such as SUI Network&#8217;s community access program, which has distributed $66.8 [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-04T00:00:38.000Z",
    "title": "Memecoins Reign Supreme: CoinGecko Reveals Most Profitable Crypto Narrative Of Q1",
    "url": "https://www.newsbtc.com/meme-coins/memecoins-reign-supreme-coingecko-reveals-most-profitable-crypto-narrative-of-q1/",
    "description": "In the first quarter of 2024 (Q1), memecoins emerged as the most profitable crypto narrative, delivering massive average returns of 1312.6% across its top tokens, according to a recent study and report conducted by CoinGecko. This figure far surpassed the returns of other narratives, highlighting the growing popularity and frenzy surrounding memecoins in the cryptocurrency market. RWA Vs Memecoins Three newly launched tokens were among the top 10 memecoins by market cap at the end of the quarter: Brett (BRETT), BOOK OF MEME (BOME) and Cat in a dogs world (MEW).  BRETT generated the highest returns since its launch with a gain of 7727.6%, closely followed by dogwifhat (WIF) with a gain of 2721.2% during the quarter. Notably, the memecoin narrative outperformed other crypto narratives by a significant margin. Related Reading: Bitcoin Traders No Longer Extremely Greedy: Rebound Signal?   Compared to the second most profitable narrative, RWA, memecoins were 4.6 times more profitable, and their returns were 33.3 times higher than those of the Layer 2 narrative, which experienced the lowest gains in Q1. The RWA narrative, which stands for &#8220;Real-World Assets&#8220;, returned 285.6% in Q1. Although it briefly held the title of the most profitable narrative in early February, memecoins and artificial intelligence-based (AI) tokens outperformed RWA in terms of returns. However, RWA managed to regain its position ahead of the AI narrative by the end of March.  Notable winners in the RWA category included MANTRA (OM) and TokenFi (TOKEN), which posted quarter-to-date (QTD) returns of 1074.4% and 419.7% respectively. XDC Network (XDC) was the only RWA token to decline, falling 15.6% for the quarter. Artificial intelligence closely followed RWA as the only other narrative to deliver three-digit returns, reaching 222.0% in Q1. All large-cap AI tokens experienced gains, with AIOZ Network (AIOZ) leading the pack at 480.2% and Fetch.ai (FET) following closely at 378.3%.  Even the lowest gainer in the AI category, OriginTrail (TRAC), returned a respectable 74.9% during the quarter, indicating the overall interest in AI-related tokens. Layer 1 Tokens Trail Behind The decentralized finance (DeFi) narrative delivered moderate returns of 98.9% in the first quarter. In late February, DeFi returns were boosted by the Uniswap (UNI) fee switch proposal. DeFi tokens that performed well included Jupiter (JUP) with gains of 125.7%, Maker (MKR) with 121.2%, and The Graph (GRT) with 111.0% QTD. In contrast, the Layer 1 (L1) narrative delivered relatively lower profitability with 70.0% returns in Q1 2024. While Solana (SOL) garnered attention as a popular memecoin chain, the top-performing large L1 cryptocurrencies were Toncoin (TON) and Bitcoin Cash (BCH) with gains of 131.2% and 130.5%, respectively.  Bitcoin (BTC) achieved a 65.1% gain, reaching new all-time highs, while Ethereum (ETH) posted a more modest 53.9% increase, despite the anticipation surrounding US spot Ethereum ETF applications. Related Reading: Shiba Inu To Rally 100% To $0.000062? Analyst Reveals Why This Is Possible Layer 2 (L2) emerged as the least profitable crypto narrative in Q1, with a relatively lower gain of 39.5%. Established Ethereum L2 solutions underperformed, with Arbitrum (ARB) returning 5.6%, Polygon (MATIC) seeing a 1.2% gain, and Optimism (OP) closing the quarter with a slight decline of 1.2%. However, Stacks (STX) and Mantle (MNT) recorded relatively strong returns of 142.5% and 95.8% QTD, respectively. As of this writing, Dogecoin (DOGE), the largest memecoin by market capitalization, is trading at $0.1745. Over the past 24 hours, it has experienced a price correction of nearly 7%. In the last month, Dogecoin has shown limited bullish momentum, with a marginal gain of only 0.7% during this time period. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-04-04T00:00:23.000Z",
    "title": "Trader Bullish on This Gaming Altcoin, Says One AI Crypto Project Will Do Well in Bull Run",
    "url": "https://dailyhodl.com/2024/04/03/trader-bullish-on-this-gaming-altcoin-says-one-ai-crypto-project-will-do-well-in-bull-run/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/04/trader-on-this-gaming.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/04/trader-on-this-gaming.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/04/trader-on-this-gaming.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/04/trader-on-this-gaming.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/04/trader-on-this-gaming.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/04/trader-on-this-gaming.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/04/trader-on-this-gaming.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A popular crypto trader is bullish on a blockchain gaming platform. The pseudonymous analyst known as Altcoin Sherpa tells his 213,600 followers on the social media platform X that he sees Gala (GALA) finding support at $0.053 and $0.046, which represent the 0.5 and 0.618 Fibonacci retracement levels. The analyst believes that GALA may bounce [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/04/03/trader-bullish-on-this-gaming-altcoin-says-one-ai-crypto-project-will-do-well-in-bull-run/\">Trader Bullish on This Gaming Altcoin, Says One AI Crypto Project Will Do Well in Bull Run</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]