[
  {
    "source": "Crypto Briefing",
    "date": "2024-01-24T03:29:46.000Z",
    "title": "BlackRock’s and three other Bitcoin ETFs billions now tracked on-chain",
    "url": "https://cryptobriefing.com/blackrocks-four-bitcoin-etfs-billions-tracked-on-chain/?utm_source=feed&utm_medium=rss",
    "description": "Almost 17,000 BTC were sent to addresses related to those four ETFs in the past 24 hours, with the total AUM surpassing $3 billion."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-24T03:30:54.000Z",
    "title": "SEC Got SIM Swapped: How Hacker Gained Control of SEC’s X Account",
    "url": "https://news.bitcoin.com/sec-got-sim-swapped-how-hacker-gained-control-of-secs-x-account/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-sim-swapped-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"SEC Got SIM Swapped: How Hacker Gained Control of SEC&#039;s X Account\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-sim-swapped-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-sim-swapped-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-sim-swapped-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-sim-swapped-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-sim-swapped-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-sim-swapped-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/sec-sim-swapped.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The U.S. Securities and Exchange Commission (SEC) has admitted that a SIM swap attack compromised its X account, where a fake announcement about the approval of spot bitcoin exchange-traded funds (ETFs) was posted. &#8220;The unauthorized party obtained control of the SEC cell phone number associated with the account in an apparent &#8216;SIM swap&#8217; attack,&#8221; the [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T03:34:59.000Z",
    "title": "How Can Solar Power Data Software Reshape Clean Energy Strategies?",
    "url": "https://www.cryptopolitan.com/solar-power-data-software-clean-energy/",
    "description": "In a significant leap towards enhancing clean energy utilization, researchers from SLAC National Accelerator Laboratory’s Grid Integration Systems and Mobility lab (GISMo) have introduced groundbreaking solar power data software, Solar Data Tools. This open-source software aims to demystify the complexities of solar energy data, empowering users to optimize the performance of their solar panel systems.&#160; [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T03:31:47.000Z",
    "title": "Analysts skeptical about approval of spot XRP ETF in the near future",
    "url": "https://www.cryptopolitan.com/analysts-about-approval-of-spot-xrp-etf/",
    "description": "In the world of cryptocurrency exchange-traded funds (ETFs), the anticipation for a spot XRP ETF approval has been met with skepticism from financial analysts. While there is a glimmer of hope among some XRP enthusiasts, experts believe that regulatory hurdles and an ongoing legal battle between the Securities and Exchange Commission (SEC) and Ripple could [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T03:21:56.000Z",
    "title": "SEC Commissioner “Crypto Mom” expects no lawsuit required for spot Ether ETF approvals",
    "url": "https://www.cryptopolitan.com/crypto-mom-expects-no-sec-lawsuit-on-eth-etf/",
    "description": "In a recent interview with Coinage Media, Hester &#8220;Crypto Mom&#8221; Peirce, a Commissioner at the United States Securities and Exchange Commission (SEC), expressed confidence that lawsuits would not be necessary to persuade the SEC to approve spot Ether (ETH) exchange-traded fund (ETF) applications. Peirce&#8217;s remarks come amidst growing anticipation for the approval of Ether ETFs, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T03:14:40.000Z",
    "title": "Facial Recognition Fallout – Texas Man’s Lawsuit Reveals Misidentification and Injustice",
    "url": "https://www.cryptopolitan.com/facial-recognition-fallout-texas-man-lawsuit/",
    "description": "In a shocking turn of events, a Texas man, Harvey Eugene Murphy Jr., has come forward with a disturbing allegation that Macy’s and Sunglass Hut&#8217;s facial recognition software wrongly implicated him in an armed robbery, leading to his arrest and subsequent harrowing experiences in jail. The lawsuit contends that Murphy was falsely identified as a [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T03:12:53.000Z",
    "title": "Crypto Fear & Greed Index hits 100-day low as Bitcoin drops below $40,000",
    "url": "https://www.cryptopolitan.com/crypto-fear-greed-index-hits-100-day-low/",
    "description": "The Crypto Fear &#38; Greed Index, a widely watched indicator of sentiment in the cryptocurrency market, has reached a 100-day low as Bitcoin (BTC) struggles to maintain its price following the recent approval of spot exchange-traded funds (ETFs) in the United States.&#160; On January 24th, the index dropped to a score of 48, signaling a [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-24T03:30:11.000Z",
    "title": "Bitcoin Price At Risk? Grayscale’s $335M Coinbase Transfer Stirs $30,000 Plunge Potential",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-price-at-risk-grayscales-335m-coinbase-transfer-stirs-30000-plunge-potential/",
    "description": "The Bitcoin price has experienced a notable shift as selling pressure mounts, with BTC bears gaining the upper hand. Asset manager Grayscale, the owner and manager of the Grayscale Bitcoin Trust (GBTC), is a significant contributor to this trend.  Since the trading of spot Bitcoin exchange-traded funds (ETFs) began on January 12, Grayscale has been on a selling spree, as evidenced by substantial transfers of BTC to the United States-based crypto exchange Coinbase. Bitcoin Price Under Pressure As Grayscale Selling Spree Continues According to Akrham Intelligence data, in addition to the previously reported 69,994 BTC ($2.9 billion) transfers, Grayscale sent an additional 8,593,075 BTC (approximately $335.19 million) to the exchange on Tuesday, suggesting the possibility of further selling activities. These developments have affected the Bitcoin price, which has experienced a significant downtrend, declining by 20% over the past week and a half.  Related Reading: Bitcoin Long Positions Surge On Bitfinex: Whales Add 4,230 BTC, Signaling Potential Price Reversal On Tuesday, the largest cryptocurrency dropped as low as $38,500, placing considerable pressure on a crucial support level. Despite the bearish pressure, the $38,500 support level has demonstrated resilience so far, with the cryptocurrency rebounding to $39,300 at the time of writing.  Nevertheless, the duration of Grayscale&#8217;s selling spree remains uncertain, and if market sentiment continues to turn negative, Bitcoin could potentially revisit the $30,000 mark. This figure is just above the key $29,000 level that marked the beginning of the bull run that took Bitcoin to its 22-month high of $49,000 on January 11th. Bears On The Rise If the $38,500 threshold succumbs to Grayscale&#8217;s selling pressure and profit-taking, market observers should closely monitor the $37,750 level as the next resistance.  Failure to hold above this level would open the door to a potential decline toward the major resistance at $35,600, which could further prevent a dip to the next support level at $33,000. However, if these support levels are breached and the Bitcoin price continues its downtrend, the next significant key levels to watch for bullish momentum would be $29,000 to $30,000. A breakdown below these levels could signal an end to the current bull market structure and grant the bears the upper hand in the mid-term, at least until the anticipated halving event in April.  Historically, halving events have acted as major catalysts for the Bitcoin price, and their influence has been demonstrated. Related Reading: Crypto Analyst Reveals Top Altcoins To Buy Amid Market Slump As the Bitcoin market faces intensified selling pressure and Grayscale&#8217;s ongoing selling spree, market participants remain cautious about the potential for a significant price plunge. The coming days and weeks will be critical in determining whether Bitcoin can regain its bullish momentum or if it will succumb to further downward pressure. Featured image from Shutterstock, chart from TradingView.com"
  }
]