[
  {
    "source": "Cointelegraph",
    "date": "2024-01-02T18:59:50.000Z",
    "title": " Why is Ether (ETH) price up today? ",
    "url": "https://cointelegraph.com/news/why-is-ethereum-eth-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDEvNjJhOWU5MTEtNDNhMi00Y2M0LTkyYTEtZjQ4MTlkOGYwZGI1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Ether price rallies back toward a monthly high as the crypto markets heat up in anticipation of a potential spot BTC ETF approval.  </p>\n                    <p><p>Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) price is witnessing a breakout on the back of increasing institutional interest in Bitcoin and the crypto market in general. The <a href=\"https://cointelegraph.com/news/black-rock-ether-etf-eth-price-btc-etf-done-deal\">increased bullish sentiment</a> pushed Ether price up above $2,400 briefly on Jan. 2 before the price pulled back slightly. The fact that ETH trades above $2,300 could indicate that increased attention is shifting toward Ether and over the past year, the altcoin has seen its price rise by 97.1%. </p><p>Let’s review a few of the reasons for Ether’s price strength. </p><p>A surge in traders’ interest in Ether began on Nov. 5, 2023, when the U.S. Securities and Exchange Commission (<a href=\"https://www.sec.gov/comments/sr-nysearca-2023-70/srnysearca202370.htm\" target=\"_blank\" rel=\"noopener nofollow\">SEC</a>) acknowledged Grayscale Investment’s application to convert its Ethereum trust into an ETF. </p><p><a href=\"https://cointelegraph.com/news/why-is-ethereum-eth-price-up-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-02T19:04:01.000Z",
    "title": "OKX implements new regulatory measures for UK users",
    "url": "https://www.cryptopolitan.com/okx-implements-new-regulatory-measures/",
    "description": "OKX has announced the introduction of stringent user verification procedures for its UK-based customers to align with the latest regulatory standards set by the UK Financial Conduct Authority (FCA), the cryptocurrency exchange It is also important to know that this development, effective from January 8, 2024, comes as part of the broader effort to enhance [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-02T18:54:44.000Z",
    "title": "VanEck’s director drums the importance of Bitcoin ETFs in the future",
    "url": "https://www.cryptopolitan.com/vaneck-director-importance-bitcoin-etfs/",
    "description": "Vaneck’s Director of Digital Assets Strategy, Gabor Gurbacs, recently shared insights into the potential long-term impact of a U.S. spot bitcoin exchange-traded fund (ETF) on social media. Vaneck is among several asset management firms seeking approval from the U.S. Securities and Exchange Commission (SEC) to launch such an ETF. VanEck’s Grubacs drums the future impact [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-02T18:49:35.000Z",
    "title": "Nobel Prize Winner Cautions on Rush Into STEM After Rise of AI",
    "url": "https://www.cryptopolitan.com/nobel-prize-winner-cautions-on-rush-into-stem-after-rise-of-ai/",
    "description": "Renowned labor market economist and Nobel Prize winner, Christopher Pissarides, has sounded a cautionary note for the younger generation considering careers in science, technology, engineering, and mathematics (STEM) fields. Pissarides highlights the importance of cultivating &#8220;empathetic&#8221; and creative skills, which he believes may prove invaluable in a world increasingly dominated by artificial intelligence (AI). The [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-02T18:43:27.000Z",
    "title": "Orbit Chain Collaborates with South Korean Authorities for Enhanced Crypto Investigations",
    "url": "https://www.cryptopolitan.com/orbit-chain-south-korean-authorities-crypto/",
    "description": "Orbit Chain has embarked on a collaboration with the South Korean National Police Agency and the Korea Internet and Security Agency (KISA). The partnership is focused on developing a sophisticated investigation support and cause analysis system, tailored specifically for the complexities of the cryptocurrency and blockchain sector. The initiative represents a significant stride in enhancing [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-02T18:42:04.000Z",
    "title": "United States CBDC anti-surveillance bill gains momentum",
    "url": "https://www.cryptopolitan.com/united-states-cbdc-anti-surveillance-mometum/",
    "description": "In recent legislative developments, Congressman Tom Emmer’s CBDC Anti-Surveillance State Act has garnered substantial support, boasting 75 cosponsors. The legislation, introduced by Congressman Emmer in January 2022 and later reintroduced in September 2023, aims to address growing concerns regarding the potential surveillance and control of Americans’ financial transactions through a central bank digital currency (CBDC). [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-02T19:00:18.000Z",
    "title": "Bitcoin Price Targets: MVRV Points To $52,000 And $70,000 Levels For BTC, Expert Suggests",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-price-targets-mvrv-points-to-52000-and-70000-levels-for-btc-expert-suggests/",
    "description": "In a recent development, the Bitcoin price witnessed a remarkable surge of 7% within 24 hours, reaching a high point of $45,300. This significant price increase coincides with the anticipation surrounding the potential approval of a Bitcoin spot exchange-traded fund (ETF) by the US Securities and Exchange Commission (SEC).  In addition, market experts, backed by multiple models aligning to indicate increased price action and bullish momentum, suggest that Bitcoin could soon reach the $50,000 level and potentially establish a new all-time high (ATH). Bitcoin Price Poised To Reach New All-Time High?  At the forefront of this analysis is Ali Martinez, a renowned crypto analyst, who emphasizes the valuable insights provided by the Bitcoin Market Value to Realized Value (MVRV) pricing bands.  These bands serve as a metric to analyze the price movement and potential levels of Bitcoin, or any other cryptocurrency, by comparing the market value to the average value at which coins were last moved on-chain. The MVRV ratio assesses whether Bitcoin is overvalued or undervalued relative to its historical on-chain activity.  A high MVRV ratio suggests that the market value of Bitcoin has surpassed the average value at which coins were last moved, indicating a potential overvaluation. Conversely, a low MVRV ratio may indicate that Bitcoin is undervalued. Related Reading: Crypto Analyst Predicts XRP Price Breakout To $22.39, Here’s When Considering these factors, Martinez highlights the significance of the MVRV pricing bands, which reveal key price targets for Bitcoin at $52,680 and $70,250, surpassing its previous ATH of $69,000.  This analysis presents an optimistic outlook for Bitcoin&#8217;s future performance and reinforces the belief among investors that the cryptocurrency&#8217;s upward momentum is likely to continue. However, despite these Bitcoin price projections that could propel the largest cryptocurrency on the market into uncharted waters, another analyst points to a more prudent prediction. Cooling Period For BTC?  According to renowned crypto analyst Crypto Con, despite a year-long bullish stance, he believes it is time for a cooldown as the new year, 2024, begins. Crypto Con predicts a 30% correction from the directional movement index (DMI) overheat zone, projecting prices around $30,000. The overheat zone mentioned by Crypto Con suggests that the price of Bitcoin has experienced a significant upward movement and may be due to a correction or cooling period.  As seen in the chart above, when the price enters this zone, it is seen as a signal that the trend may have become overextended and could potentially reverse or experience a pullback. Drawing parallels to the example in 2019, characterized by a double peak in red, Crypto Con anticipates a drawdown that is both smaller in magnitude and shorter in duration.  Related Reading: $3,830 &#38; $5,100 Next Major Ethereum Targets According To This Model Furthermore, the analyst points to the consistent support offered by diagonal green zones throughout each cycle, suggesting a pattern that has been held thus far. While some analysts project a new all-time high for the Bitcoin price, reaching uncharted waters above $70,000, others, such as Crypto Con, advocate for a cooling period and anticipate a correction in the near term. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-01-02T18:44:38.000Z",
    "title": "Forecasting the Crypto Landscape in 2024: Unveiling Key Developments That Will Shape the Year Ahead",
    "url": "https://www.crypto-news-flash.com/forecasting-the-crypto-landscape-in-2024-unveiling-key-developments-that-will-shape-the-year-ahead/?utm_source=rss&utm_medium=rss&utm_campaign=forecasting-the-crypto-landscape-in-2024-unveiling-key-developments-that-will-shape-the-year-ahead",
    "description": "<img width=\"1280\" height=\"853\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/01/new-years-day-8431886_1280.webp\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" />2024 will be the year of mainstream crypto adoption, with a Bitcoin and Ether spot ETF expected to be approved this month amid rising institutional investor interest from multi-trillion-dollar giants. Other major events will include Bitcoin&#8217;s fourth halving, the US election, the ruling on the SEC vs Ripple, and more, with some experts predicting BTC [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-02T19:05:09.000Z",
    "title": "PlanB Says ‘We Will Hit $100k in 2024’ As Bitcoin (BTC) Starts Year Off With Fresh Rallies",
    "url": "https://dailyhodl.com/2024/01/02/planb-says-we-will-hit-100k-in-2024-as-bitcoin-btc-starts-year-off-with-fresh-rallies/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/04/swiss-bitcoin-reserve.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/04/swiss-bitcoin-reserve.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/04/swiss-bitcoin-reserve.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/04/swiss-bitcoin-reserve.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/04/swiss-bitcoin-reserve.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/04/swiss-bitcoin-reserve.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/04/swiss-bitcoin-reserve.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Widely followed on-chain analyst PlanB says he&#8217;s confident that Bitcoin (BTC) will breach the six-figure mark this year. On the social media platform X, the pseudonymous analyst reveals to his 1.9 million followers a set of forecasts for 2024, which he says haven&#8217;t changed since late 2022 during the depths of the bear market. One [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/02/planb-says-we-will-hit-100k-in-2024-as-bitcoin-btc-starts-year-off-with-fresh-rallies/\">PlanB Says ‘We Will Hit $100k in 2024’ As Bitcoin (BTC) Starts Year Off With Fresh Rallies</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]