[
  {
    "source": "CoinDesk",
    "date": "2024-03-19T13:51:20.000Z",
    "title": "Genesis to Pay SEC $21M Penalty to Settle Charges Over Gemini Earn Product",
    "url": "https://www.coindesk.com/policy/2024/03/19/genesis-to-pay-sec-21m-penalty-to-settle-charges-over-gemini-earn-product/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The bankrupt crypto lender Genesis Global Capital has agreed to a final judgment ordering it to pay $21 million to settle charges with the U.S. Securities and Exchange Commission (SEC) for violating securities laws by offering and selling its now-defunct Gemini Earn program, the SEC announced Tuesday."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-19T13:41:30.000Z",
    "title": "Coinbase's Allies Join Crypto Firm's Case Against SEC",
    "url": "https://www.coindesk.com/policy/2024/03/19/coinbases-allies-join-crypto-firms-case-against-sec/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Several allies joined Coinbase Inc. (COIN) in its court fight against the U.S. Securities and Exchange Commission (SEC) to force the agency to rethink its refusal to write specific rules to govern the crypto industry, with Paradigm, the Crypto Council for Innovation and others filing outside arguments with the circuit court."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-19T14:08:38.000Z",
    "title": " What was Michael Saylor’s mistake?  ",
    "url": "https://cointelegraph.com/news/what-was-michael-saylor-s-mistake",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMzhhMTk2MDItODZiOC00N2E2LTgzN2QtMDBkY2FhNGM4ZTFkLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>We uncover the controversial decisions of Michael Saylor, former CEO of MicroStrategy, namely his bold move to invest heavily in Bitcoin and perhaps a fundamental flaw in his strategy being overlooked.</p>\n                    <p><p data-ct-non-breakable=\"true\">On the Cointelegraph YouTube channel, a thought-provoking discussion has ignited under the latest video “What was Michael Saylor’s Mistake?”. </p><p>In the video, authors assess Michael Saylor's past investment decisions, delving into the intricacies of his journey in the crypto realm. It presents an essay-style reflection of whether the renowned figure’s actions constitute missteps or calculated maneuvers. </p><p>The authors call his strategy for acquiring Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) one of his mistakes. They argue that Michael Saylor frequently buys Bitcoin at its price peaks — a behavior often termed as “FOMO buying.” </p><p><a href=\"https://cointelegraph.com/news/what-was-michael-saylor-s-mistake\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-19T14:00:00.000Z",
    "title": " Umoja closes $4M seed round, aims to democratize wealth creation ",
    "url": "https://cointelegraph.com/news/umoja-seed-round-democratize-wealth-creation",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvNzFkZTUyYjgtZmQyZi00ZWU2LTk3ZGEtYzc1NTNkODUwNGQ3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Umoja will use the funds to democratize retail access to digital investment strategies through its smart money protocol.</p>\n                    <p><p data-ct-non-breakable=\"true\">Smart money protocol Umoja has successfully closed a $2 million extension to its initial seed funding round, bringing the total amount raised to $4 million.</p><p>Umoja aims to use the funds to democratize access to its smart money protocol, which offers automated investment strategies enabling tokens to self-trade, hedge against market volatility and optimize yield.</p><p>By accessing tokenized strategies, or “Synths,” in the Umoja decentralized application, users can create financial instruments, such as delta-neutral stablecoins similar to Ethena’s USDe synthetic dollar, and hedged assets, like zero-downside Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) contracts, according to a March 19 press release shared with Cointelegraph.</p><p><a href=\"https://cointelegraph.com/news/umoja-seed-round-democratize-wealth-creation\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-19T14:07:32.000Z",
    "title": "BITFLEX Revamps iOS App Access with TestFlight",
    "url": "https://cryptodaily.co.uk/2024/03/bitflex-revamps-ios-app-access-with-testflight",
    "description": "BITFLEX, the leading cryptocurrency exchange platform, is thrilled to announce an exciting update for iOS users – the BITFLEX’s iOS app is now available via TestFlight!"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-03-19T13:50:27.000Z",
    "title": "MemeLife Announces Upcoming Presale Event Focused on Meme-Based Cryptocurrency Innovation",
    "url": "https://cryptodaily.co.uk/2024/03/memelife-announces-upcoming-presale-event-focused-on-meme-based-cryptocurrency-innovation",
    "description": "MemeLife Announces Upcoming Presale Event Focused on Meme-Based Cryptocurrency Innovation"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-19T13:48:36.000Z",
    "title": "Crypto Lender Genesis Agrees to $21 Million SEC Fine, Funds to Await Bankruptcy Claim Settlements",
    "url": "https://news.bitcoin.com/crypto-lender-genesis-agrees-to-21-million-sec-fine-funds-to-await-bankruptcy-claim-settlements/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/3_text-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Crypto Lender Genesis Agrees to $21 Million SEC Fine, Funds to Await Bankruptcy Claim Settlements\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/3_text-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/3_text-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/3_text-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/3_text-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/3_text-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/3_text-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/3_text.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Genesis Global Capital has settled with the U.S. Securities and Exchange Commission (SEC) and agreed to pay a $21 million civil penalty. The SEC further disclosed that the regulator will “not receive any portion of the penalty until after payment of all other allowed claims by the bankruptcy court, including claims by retail investors in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-19T14:12:01.000Z",
    "title": "Partisia Blockchain Listing Today, What to Expect?",
    "url": "https://www.cryptopolitan.com/partisia-blockchain-listing-today-what-to-expect/",
    "description": "Partisia blockchain is a revolutionary infrastructure looking to impact the current status quo by increasing overall performance. The infrastructure allows blockchain users to enjoy superior privacy features, promote interoperability, and promote sustainable blockchain development practices.&#160; The partisia blockchain platform has been recently informed by popular exchange platforms like Gate.io, Bitfinex, BitMart, MEXC, Bitrue, and KuCoin, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-19T14:09:46.000Z",
    "title": "Unlock Exceptional Gains: Dive Into Stage 1 of Our NFTFN Token Presale Now",
    "url": "https://www.cryptopolitan.com/unlock-exceptional-gains-dive-into-stage-1-of-our-nftfn-token-presale-now/",
    "description": "NFTFN, a leading web3 fintech player, has rolled out the highly anticipated presale of its namesake token. Despite only being in its first stage, the NFTFN token has made significant buzz throughout the crypto community, attracting the attention of crypto enthusiasts and pundits alike. Let’s take a closer look at this innovative project to understand [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-19T14:09:41.000Z",
    "title": "Early Birds Get the Profits: Why Stage 1 of This NFT Presale Is Your Golden Ticket",
    "url": "https://www.cryptopolitan.com/early-birds-get-the-profits-why-stage-1-of-this-nft-presale-is-your-golden-ticket/",
    "description": "NFTFN, a prominent player in the web3 fintech space, has launched the first phase of its presale for the NFTFN token. This highly anticipated event has garnered significant interest within the crypto community, with investors eager to participate. NFTFN: Disrupting The NFT Sector NFTFN positions itself as a comprehensive platform for trading a diverse range [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-19T14:07:47.000Z",
    "title": "Solana (SOL) Price Predictions 2024: AI Insights and Current Market Analysis",
    "url": "https://www.cryptopolitan.com/solana-sol-price-predictions-2024-analysis/",
    "description": "Artificial intelligence (AI) algorithms are offering promising insights into the future price trajectory of Solana (SOL) cryptocurrency. According to these projections, Solana could potentially surge to $354.78 by December 31, 2024, marking a substantial increase of 104.47% from its current price level. These projections are based on a comprehensive analysis of historical SOL trends, technical [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-19T14:00:00.000Z",
    "title": "Elon Musk Teases DOGE Acceptance By Tesla; Avalanche’s (AVAX) Bulls Breeze Past Bears; InQubeta (QUBE) Enters Whales Radar",
    "url": "https://www.cryptopolitan.com/elon-musk-teases-doge-acceptance-by-tesla-avalanches-avax-bulls-breeze-past-bears-inqubeta-qube-enters-whales-radar/",
    "description": "We have heard “Doge to the Moon” so many times. Maybe this time, the price will go through the roof. Earlier this week, Elon Musk, one of the most influential figures on Earth—and maybe Mars, considering his dedication to space travel—sent shockwaves through the crypto industry after his Dogecoin (DOGE) announcement. He emphasized his steadfast [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-19T13:51:22.000Z",
    "title": "Fidelity’s updated spot Ether ETF proposal sparks market reaction",
    "url": "https://www.cryptopolitan.com/fidelitys-updated-spot-ether-etf-proposal/",
    "description": "Financial giant Fidelity has submitted an amended proposal to the United States Securities and Exchange Commission (SEC) regarding its spot Ether exchange-traded fund (ETF). The proposal includes plans to stake a portion of the fund&#8217;s Ether holdings through trusted providers, aiming to generate additional income for investors. Market reaction to Fidelity&#8217;s proposal Following the announcement [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-19T14:06:26.000Z",
    "title": "Borroe Finance’s presale sparks investor debate over TRON and XRP potential",
    "url": "https://crypto.news/borroe-finances-presale-sparks-investor-debate-over-tron-and-xrp-potential/",
    "description": "Borroe Finance ($ROE) raises investor interest with its unique AI-powered funding marketplace presale and potential to challenge established cryptos like Tron (TRX) and XRP. #partnercontent"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-19T13:41:33.000Z",
    "title": "Emerging coin investors eye Fezoo, a promising new DEX",
    "url": "https://crypto.news/emerging-coin-investors-eye-fezoo-a-promising-new-dex/",
    "description": "Fezoo (FEZ) is emerging as a standout decentralized exchange in the fluctuating crypto market, attracting diverse investors, including from emerging coins such as Aptos (APT) and Immutable (IMX). #partnercontent"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-19T13:41:07.000Z",
    "title": "Genesis agrees to pay $21m penalty to settle SEC charges",
    "url": "https://crypto.news/genesis-agrees-to-pay-21m-penalty-to-settle-sec-charges/",
    "description": "Genesis Global Capital will pay a $21 million fine and enter a permanent injunction to resolve the SEC&#8217;s allegations. Genesis will seek an injunction alleging that it offered and sold securities without proper registration, according to a March 19 SEC&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-19T14:00:58.000Z",
    "title": "Bitcoin Suffers Massive Drop On BitMEX, Is The Rally Over?",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-suffers-massive-drop-on-bitmex-bulls-over/",
    "description": "Since Bitcoin (BTC) witnessed a crash this week to $64,000, the crypto asset has not been able to reclaim its momentum, with the price falling even lower. This has led to a general market decline that has affected altcoins. Bitcoin Plummets To $8,900 On BitMEX Exchange In a devastating turn of events, Bitcoin witnessed a steep decline on the Seycelles-based cryptocurrency exchange BitMEX on Monday. Reports from blockchain media, Wu Blockchain, revealed that Bitcoin fell to around $8,900, following a massive BTC sell-off on the platform. Related Reading: BitMEX Whales Buy Bitcoin: What History Says Will Happen Next Wu Blockchain reported that a user sold over 400 BTC, which led to the price of Bitcoin falling to the aforementioned figure. Over the space of two hours, the unidentified user sold the 400 BTC in groups of 10–50 BTC. Consequently, BitMEX&#8217;s market stability was impacted since the user sold the assets for incredibly low prices. However, according to reports from Blockchain Daily, the event was short-lived as prices have now returned to the normal level. In response to the development, BitMEX has assured the crypto community that it is &#8220;looking into odd behavior&#8221; involving users selling substantial orders on the spot market for BTC-USDT. The crypto platform further stated that while the investigation is ongoing, &#8220;the derivatives market will still be operational, including the index price for its popular XBT derivatives contracts.&#8221; Furthermore, the exchange confirmed the safety of users&#8217; funds and assets, and the platform is &#8220;running as usual.&#8221; Given that the price of Bitcoin was situated at $68,000 before the incident, the drop indicates an over 87% decline. After falling to $8,900, Bitcoin recovered, but the abnormal price fluctuations lasted for an additional 30 minutes before things returned completely to normal. The development has since stirred quite a frenzy within the cryptocurrency landscape, leaving the community to ponder on the reason behind the drop. Several crypto enthusiasts believe that the incident was a move orchestrated by BitMEX to manipulate prices to liquidate investors and end up making a lot of money. Larger Crash Might Take Place As Bitcoin continues to move downward, Gold advocate and crypto critic Peter Schiff has forecasted a larger crash for prices. At first, Peter Schiff drew the crypto community&#8217;s attention to the 2021 rally, in which BTC peaked at $69,000. Related Reading: Peter Schiff Warns Investors From Bitcoin, Says They Should Buy This Instead However, the largest cryptocurrency witnessed a collapse the next year, and by November 2022, it was already trading at $16,000. As a result, Schiff mocked Bitcoin enthusiasts, asking, &#8220;How many of them still have their laser eyes on their profiles.&#8221; Thus, considering that the majority are presently more optimistic about BTC, Schiff anticipates a &#8220;bigger crash&#8221; is probably on the horizon. As of the time of writing, the price of Bitcoin was trading at $62,943, indicating an over 7% decline in the past 24 hours. Its market cap is down more than 7%, while its trading volume holds steady increasing by 63% in the past day. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-19T14:05:17.000Z",
    "title": "Binance Coin (BNB) Poised for New All-Time High, Eyes Solana (SOL) in Rankings",
    "url": "https://www.crypto-news-flash.com/binance-coin-bnb-poised-for-new-all-time-high-eyes-solana-sol-in-rankings/?utm_source=rss&utm_medium=rss&utm_campaign=binance-coin-bnb-poised-for-new-all-time-high-eyes-solana-sol-in-rankings",
    "description": "<img width=\"1918\" height=\"1200\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Binance-Coin-BNB-with-black-background.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binance Coin (BNB)\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Binance-Coin-BNB-with-black-background.jpg 1918w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Binance-Coin-BNB-with-black-background-300x188.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Binance-Coin-BNB-with-black-background-1024x641.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Binance-Coin-BNB-with-black-background-768x481.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Binance-Coin-BNB-with-black-background-1536x961.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Binance-Coin-BNB-with-black-background-150x94.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Binance-Coin-BNB-with-black-background-450x282.jpg 450w, https://www.crypto-news-flash.com/wp-content/uploads/2023/12/Binance-Coin-BNB-with-black-background-1200x751.jpg 1200w\" sizes=\"(max-width: 1918px) 100vw, 1918px\" />Binance Coin (BNB) is on the rise, nearing its all-time high of $686, despite recent market dips. BNB&#8217;s surge is fueled by growth in the Binance Smart Chain (BSC) ecosystem and its deflationary token-burning mechanism. Binance Coin (BNB), expected to reach new heights this month, stands out among digital asset prices during an overall decline. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2024-03-19T13:47:04.000Z",
    "title": "Solana (SOL) Bull Run Ahead? Analyst Predicts 70% Upside if History Repeats",
    "url": "https://www.crypto-news-flash.com/solana-sol-bull-run-ahead-analyst-predicts-70-upside-if-history-repeats/?utm_source=rss&utm_medium=rss&utm_campaign=solana-sol-bull-run-ahead-analyst-predicts-70-upside-if-history-repeats",
    "description": "<img width=\"1200\" height=\"799\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-16T121735.967.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-16T121735.967.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-16T121735.967-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-16T121735.967-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-16T121735.967-150x100.jpg 150w, https://www.crypto-news-flash.com/wp-content/uploads/2024/02/unnamed-2024-02-16T121735.967-450x300.jpg 450w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Solana&#8217;s network activity surpasses Ethereum, with on-chain memecoin trading contributing to Solana&#8217;s fee capture exceeding Bitcoin&#8217;s over the past week. Solana&#8217;s meme coin ecosystem witnesses a significant correction, notably impacting tokens like BOME, while SLERF emerges as a standout performer. Ethereum Layer-1 competitor Solana has witnessed a strong surge over the last week. Earlier on [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-19T14:01:20.000Z",
    "title": "HTX Facilitates Refunds with SMOLE in Industry-Leading Move",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/htx-facilitates-refunds-with-smole-in-industry-leading-move/",
    "description": "<p>This collaboration, started by Smole Coin founder 0xDekadente, marks a key milestone for $SMOLE private sale participants in the crypto space. HTX has set a precedent as the first exchange to take such a proactive stance on refunds. HTX and SMOLE Unite for Historic Refund Initiative This effort aids HTX users impacted by the $SMOLE [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/htx-facilitates-refunds-with-smole-in-industry-leading-move/\">HTX Facilitates Refunds with SMOLE in Industry-Leading Move</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]