[
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T13:30:00.000Z",
    "title": "6 Questions for Thiago Cesar of Transfero",
    "url": "https://cointelegraph.com/magazine/questions-thiago-cesar-transfero/",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/magazine-Thiago-Cesar-6q-scaled.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Transfero’s Thiago Cesar says when he started buying Bitcoin in 2012 he knew it had amazing potential for “internationalizing money.”</p>\n                    <p><p><strong>Thiago Cesar is the 34-year-old co-founder of Transfero, a company helping to make crypto more accessible for Brazilians with BRZ, the first stablecoin pegged to the Brazilian real.</strong></p><p>Cesar grew up in southern Brazils Pindamonhangaba municipality, before making the 90-mile trek to Sao Paulo for college. He graduated from Fundao Armando Alvares Penteado, and it wasnt long, Cesar says, before he became infatuated with Bitcoin as a graduate student at the University of London.</p><p>“By 2014, I’d been convinced that Bitcoin and cryptocurrencies in general were going to be a big thing,” Cesar says, leading him to author his graduate thesis on the competitive and comparative advantages that Bitcoin could bring to a business.</p><p>In 2015, Transfero was born.</p><h2 id=\"h-what-inspired-you-to-start-transfero\"><strong>What inspired you to start Transfero?</strong></h2><p>Transfero was a joint dream between me and my four Brazilian co-founders. We met in Rio de Janeiro just after I returned from the University of London in 2015, where coincidentally, I wrote my master’s thesis about Bitcoin.</p><figure class=\"wp-block-image alignright size-full is-resized\"><img decoding=\"async\" src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Thiago-Cesar.jpg\" alt=\"Thiago\" class=\"wp-image-20708\" width=\"300\" height=\"317\" srcset=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Thiago-Cesar.jpg 658w, https://cointelegraph.com/magazine/wp-content/uploads/2023/06/Thiago-Cesar-284x300.jpg 284w\" sizes=\"(max-width: 300px) 100vw, 300px\" /><figcaption class=\"wp-element-caption\"><em>Cointelegraph’s Rudy Takala, Transfero’s Thiago Cesar and Tezos co-founder Kathleen Breitman. (Thiago Cesar)</em></figcaption></figure><p>One of my co-founders, Marlyson Silva, had previous experience in the payments industry and developed a payment gateway that could also process Bitcoin transactions. The system immediately converted Bitcoin into reais, so merchants didn’t have to worry about price fluctuations.</p><p>Being a crypto-native group, our idea was to leverage everything that a borderless and permissionless asset class could provide. Brazil and other neighboring countries were always financially limited in some way: be it due to inflation-inducing economic policy like in Argentina, or a rigid FX market with some degree of capital controls like in Brazil.<br><br>Crypto can fill multiple gaps for citizens coming from emerging markets. Asset protection, international remittance rails, portfolio diversification and so on. Transfero builds on top of legacy financial technologies in LATAM  such as PIX in Brazil  and combines the abovementioned crypto elements to deliver products and services that solve real-world pains that are common in emerging markets.</p><section class=\"adv-banner adbutler-ad adbutler-ad__desktop\"><div class=\"container\"><!-- 1456x180 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=728x90;setID=601214;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><section class=\"adv-banner adbutler-ad adbutler-ad__mobile\"><div class=\"container\"><!-- 600x500 [img] --><a href=\"https://servedbyadbutler.com/go2/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100\" target=\"_blank\"><img src=\"https://servedbyadbutler.com/adserve/;ID=169476;size=300x250;setID=601213;referrer=https%3A%2F%2Fcointelegraph.com%2Fmagazine%2Fwp-json%2Fwp%2Fv2%2Fposts%3F_embed%26per_page%3D100;type=img\" ></a></div></section><h2><strong>What are the biggest things Transfero is doing?</strong></h2><p>Transfero is one of the largest fiat ramps in Brazil and Argentina. Multiple international businesses  crypto and non-crypto related  use Transfero to receive deposits and perform payments within the Brazilian and Argentine banking systems.</p><p><strong>Also read: <em><a href=\"https://cointelegraph.com/magazine/bitcoin-net-zero-2050-climate-change/\" target=\"_blank\" rel=\"nofollow\" >Bitcoin is on a collision course with Net Zero promises</a></em></strong></p><p>Transfero is also the issuer of BRZ, a stablecoin for BRL. Thats the basis for our stablecoin settlements for flows between the United States, Europe, Asia and Latin America.It is a synthetic representation of BRZ, as the actual BRL currency is non-deliverable. That means international companies cant carry it unless they have bank accounts in Brazil.</p><h2><strong>You also started the Transfero Academy. What’s its goal?</strong></h2><p>Transfero Academy is an educational program for Brazilians from vulnerable neighborhoods. We offer a full-time blockchain technical course, which prepares students for a career in crypto. We have a 95% employment rate for students who have graduated.</p><p>Transfero Academy changed the lives of hundreds of students; now we’re partnering up with governmental and private educational groups throughout the country.</p><h2><strong>Cryptocurrency has a higher adoption rate in Brazil than any other country in Latin America. Why are Brazilians so interested in crypto?</strong></h2><p>Crypto opened up the international financial world to Brazilians. Not a lot of people know, but in Brazil, you can only have bank accounts denominated in BRL, and retail traders can only trade stocks on a local exchange called B3.</p><p>When Bitcoin, Ethereum and stablecoins arrived, Brazilians could finally access international platforms and open up their financial horizons. Crypto is not only a different asset class but also an international financial rail for Brazilians.</p><h2><strong>What brought you to crypto?</strong></h2><p>Back in 2012, when I was working for a South Korean company, a friend told me about some type of internet money called Bitcoin that was used for “Deep Web transactions.” I became interested in the subject and started my own research.</p><div class=\"article-suggest\">      <div class=\"article-suggest__title display3\">Read also</div>      <div class=\"article-suggest__items\">                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/how-the-crypto-workforce-changed-in-the-pandemic/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>How the crypto workforce changed in the pandemic</p>                        </a>                    </div>                    <div class=\"article-suggest__item\">                        <a href=\"https://cointelegraph.com/magazine/this-is-how-to-make-and-lose-a-fortune-with-nfts/\" class=\"article-suggest__subtitle display4\">                            <span>Features</span>                            <p>This is how to make  and lose  a fortune with NFTs</p>                        </a>                    </div></div></div><p>As with most people, I didn’t understand much at the time, even after reading the white paper. But when I started buying Bitcoin at the end of 2012, I was amazed by the potential it had for internationalizing money. Coming from Brazil, the idea that I could carry a USD-priced asset that could move or be sent anywhere was groundbreaking for me. </p><p>By 2014, I’d been convinced that Bitcoin and cryptocurrencies in general were going to be a big thing. That led me to talk focus on crypto for my master’s thesis at the University of London.</p><h2><strong>What are your hopes or goals for Transfero on a 5-10 year time horizon?</strong></h2><p>Transfero is expanding throughout LATAM. Right now, we provide services in Brazil and Argentina, but our main goal is to be the main issuer of stablecoins and fiat ramp for the region, operating a settlement network between emerging markets.</p><div class=\"subscribe subscribe--inner\"><div class=\"container\"><div class=\"subscribe__inner\"><div class=\"subscribe__content\">    <div class=\"subscribe__title display2\">Subscribe</div>    <div class=\"subscribe__desc text-l\">The most engaging reads in blockchain. Delivered once a        week.</div>        <div class=\"wpcf7 no-js\" id=\"wpcf7-f13672-o1\" lang=\"en-US\" dir=\"ltr\"><div class=\"screen-reader-response\"><p role=\"status\" aria-live=\"polite\" aria-atomic=\"true\"></p> <ul></ul></div><form action=\"/magazine/wp-json/wp/v2/posts?_embed&per_page=100#wpcf7-f13672-o1\" method=\"post\" class=\"wpcf7-form init subscribe__form demo\" aria-label=\"Contact form\" novalidate=\"novalidate\" data-status=\"init\"><div style=\"display: none;\"><input type=\"hidden\" name=\"_wpcf7\" value=\"13672\" /><input type=\"hidden\" name=\"_wpcf7_version\" value=\"5.7.4\" /><input type=\"hidden\" name=\"_wpcf7_locale\" value=\"en_US\" /><input type=\"hidden\" name=\"_wpcf7_unit_tag\" value=\"wpcf7-f13672-o1\" /><input type=\"hidden\" name=\"_wpcf7_container_post\" value=\"0\" /><input type=\"hidden\" name=\"_wpcf7_posted_data_hash\" value=\"\" /></div><fieldset class=\"form-group\"><p><input size=\"40\" class=\"wpcf7-form-control wpcf7-text wpcf7-email wpcf7-validates-as-required wpcf7-validates-as-email\" id=\"footer-subscribe\" aria-required=\"true\" aria-invalid=\"false\" value=\"\" type=\"email\" name=\"your-email\" /><label for=\"footer-subscribe\">Email address</label></p></fieldset><p><button class=\"subscribe__btn btn btn-white\">SUBSCRIBE</button></p><div class=\"wpcf7-response-output\" aria-hidden=\"true\"></div></form></div></div><div class=\"subscribe__img\">    <img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2022/10/reading-copy.png\" alt=\"Subscribe to Magazine by Cointelegraph Newsletter.\" /></div></div></div></div></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T13:25:00.000Z",
    "title": "Bitcoin payments exec shares adoption challenges in the Philippines  ",
    "url": "https://cointelegraph.com/news/bitcoin-payments-exec-philippines-adoption-interview",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/d0672d3f-b20f-4029-be57-c3e723c8f3d9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Pouch founder Ethan Rose said that they've managed to convince 400 businesses to accept Bitcoin in the Philippines. </p>\n                    <p><p>As many developments within the space show how far the Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) community has come, an executive from a BTC payment provider shared how in other parts of the world, adoption may still be in its early stages. </p><p>At the BTC Prague event, Cointelegraph reporter Joseph Hall interviewed Ethan Rose, the founder of Pouch, a wallet service that supports the Bitcoin Lightning Network in the Philippines. The duo spoke about the state of adoption in the country and how the Pouch team is trying to introduce Bitcoin to merchants on the island of Boracay, a popular tourist hotspot in the country. </p><p>According to Rose, their team has already managed to onboard around 250 businesses within the island and 400 businesses in the country. Their team is working to promote Bitcoin adoption in the country by offering merchants another way to attract customers. </p><p>“They're not really hard sold on Bitcoin. They're not like they haven't decided to spend the rest of their life stacking SATs. Right? So, our pitch is more like a way to just attract new customers to your business over the long term,” Rose said. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/a3053f90-27b9-43ab-a7ad-0838d3c2600b.jpg\"  /><figcaption style=\"text-align: center;\"><em>Cointelegraph reporter Joseph Hall with Pouch founder Ethan Rose at BTC Prague. Source: Cointelegraph</em></figcaption></figure><p>Apart from this, the executive also shared that there are still some difficulties in introducing Bitcoin to people. He explained: </p><blockquote>“It's hard to orange pill. If you can just like walk up to somebody and convince them to like that Bitcoin is the best money and they just decide on the fly to switch their mental model of what money is, like right there. I would say that's a pretty gullible person.”</blockquote><p>In addition to the challenge of introducing Bitcoin to people, the executive also shared that as more businesses start to accept Bitcoin, there are also risks of them not getting any sales from it. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/0b3e6574-1564-4650-a501-199adb7db08d.jpeg\"  /><figcaption style=\"text-align: center;\"><em>Local eatery in the Philippines accepting Bitcoin. Source: Pouch</em></figcaption></figure><p>“We need more spenders,” he explained. The executive said there’s a risk that businesses would not have a good experience because spenders could get diluted if many stores accept Bitcoin in a single area. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/the-philippines-delays-publishing-crypto-framework\"><strong><em>The Philippines delays publishing crypto framework</em></strong></a></p><p>In addition, Rose reiterated that it’s crucial for businesses to have a good experience when they accept Bitcoin. The executive explained that merchants could potentially end up just abandoning the endeavor if it doesn’t bear any fruits. “If nobody shows up after a couple of months, they just like, uninstall their wallet,” he added. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\"><strong><em>Tornado Cash 2.0: The race to build safe and legal coin mixers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-08T13:15:00.000Z",
    "title": "The role of blockchain in combatting fraud and revolutionizing the gaming industry",
    "url": "https://cointelegraph.com/innovation-circle/the-role-of-blockchain-in-combatting-fraud-and-revolutionizing-the-gaming-industry",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/08c93fad-7d1b-40b1-8522-14082d4470a3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Blockchain's transparency is another key weapon in the fight against fraud.</p>\n                    <p><p>A new dawn is breaking in the gaming industry, driven by the transformative power of blockchain technology. As this industry — expected to hit <a href=\"https://venturebeat.com/games/newzoo-game-market-will-hit-200b-in-2024/\">$200 billion in 2023</a> — continues to grapple with the scourge of fraud, blockchain is emerging as a potent ally, armed with its inherent traits of decentralization, transparency and immutability. Moreover, blockchain is not merely a tool to combat fraud but also an innovation set to revolutionize the gaming experience itself.</p> <h2><strong>A decentralized defense against fraud</strong></h2> <p>Central to blockchain’s appeal is its decentralized nature. In contrast to traditional systems that rely on a single central authority for validation, blockchain operates on a network of computers, or nodes. Each node on the network holds a copy of the entire blockchain, which significantly enhances system security. This decentralized model thwarts hackers by requiring them to simultaneously breach the majority of nodes to execute a fraudulent act — a feat virtually impossible with current technology.</p> <h3><strong>Transparency and traceability: A new standard in gaming</strong></h3> <p>Blockchain’s transparency is another key weapon in the fight against fraud. Every transaction conducted on the blockchain is visible to all network participants, allowing for easy detection and tracing of illicit transactions. Moreover, blockchain’s transparency extends to the enforcement of game rules, thanks to the implementation of smart contracts. These self-executing contracts, governed by explicit terms and conditions, drastically reduce the potential for cheating or manipulation within games.</p> <h3><strong>Immutability: Ensuring true ownership</strong></h3> <p>Blockchain’s immutable records offer an effective solution to fraud related to trading in-game assets. Once a transaction is recorded on the blockchain, it cannot be altered or deleted. This immutability ensures the indisputable ownership of in-game assets, which can be associated with unique digital assets, like non-fungible tokens (NFTs). The booming NFT market, <a href=\"https://www.statista.com/outlook/dmo/fintech/digital-assets/nft/worldwide#:~:text=Revenue%20in%20the%20NFT%20market,US%241%2C601.00m%20in%202023.\">projected</a> to reach $1.6 billion in 2023, is a testament to the increasing acceptance of this blockchain-based concept.</p> <h3><strong>Beyond fraud prevention: A revolutionary economic layer in gaming</strong></h3> <p class=\"has-black-color has-text-color has-background\" style=\"background-color: #fabf2c;padding: 20px 30px\">Join the community where you can transform the future. Cointelegraph Innovation Circle brings blockchain technology leaders together to connect, collaborate and publish. <strong><a href=\"https://circle.cointelegraph.com/learn-more?utm_campaign=Coin&_ga=2.123197772.699257063.1649682515-719256619.1645538730\" target=\"_blank\" rel=\"noopener\">Apply today</a></strong></p> <p>Blockchain’s role in gaming extends beyond security and fraud prevention. It is set to introduce a new economic layer to gaming, granting players genuine digital ownership, transferability and exchangeability of their in-game assets. In this blockchain-enabled paradigm, the players’ effort and skills translate into tangible assets that they can own outright and transact freely.</p> <p>This model of true ownership, coupled with the tokenization of game currency and the creation of scarcity for game assets via NFTs, can emulate real-world economic systems within games. This enhances the overall fairness of game economies and results in a more immersive and rewarding gaming experience that acknowledges and appreciates players’ dedication and skills.</p> <h3><strong>Challenges and future considerations</strong></h3> <p>While blockchain’s potential in gaming is immense, its implementation comes with a set of challenges. Technological hurdles such as scalability issues and energy consumption, along with legal and regulatory considerations, need to be addressed. Moreover, user education is a crucial factor for the successful adoption of blockchain in gaming. Players need to understand how blockchain works and its implications for security, privacy and digital ownership.</p> <h2><strong>The future of gaming is decentralized</strong></h2> <p>Blockchain technology is heralding a new age in the gaming industry, bringing transformative potential that goes beyond merely combating fraud. Its inherent security, transparency and fairness features align perfectly with the industry’s need for integrity and sustainability. The future of gaming will pivot around embracing this innovative technology, as it holds the potential to redefine gaming rules, set new standards, and elevate the industry to unprecedented heights. Always at the cutting edge of technological innovation, the gaming industry now sees the integration of blockchain as the next logical step in its evolution, a move that promises to make games more engaging, fair and rewarding.</p> <p>However, the path to blockchain integration is not devoid of challenges, which include the need for continued technological advancements, regulatory clarity and user education. As the industry navigates these hurdles, blockchain is expected to become an integral part of the gaming landscape, reshaping it in significant ways. Amidst these changes, the promise of blockchain remains clear: a gaming future with enhanced player control, richer and more immersive experiences developed by game creators and a substantial reduction in the menace of fraud.</p> <p>As we venture into this thrilling future, it is imperative that all stakeholders in the gaming ecosystem, from developers and publishers to players and regulators, participate in a collaborative dialogue. This collective effort will ensure that the integration of blockchain is not only smooth and effective but also beneficial for all parties involved. The role of blockchain in the gaming industry is about steering a new era of gaming, characterized by unparalleled levels of security, transparency, fairness and user empowerment. The game is indeed on, and it’s time to play by the new rules of blockchain.</p> <p>As we continue to explore and implement this technology, the future of gaming looks bright, full of exciting possibilities and challenges that will guide our journey forward.</p> <p><em>Tomer Warschauer Nuni is CBDO @<a href=\"https://kryptomon.co/\">Kryptomon</a>, a serial entrepreneur, advisor and investor focused on the innovative blockchain & Web3 industry.</em></p> <div class=\"wp-block-columns\"> <div class=\"wp-block-column\" style=\"flex-basis:100%\"> <hr class=\"wp-block-separator\" /> </div> </div> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p> <p><a href=\"https://circle.cointelegraph.com/\"><em><strong>Learn more about Cointelegraph Innovation Circle and see if you qualify to join</strong></em></a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-08T13:12:48.000Z",
    "title": "Speculation mounts that a regulatory attack on Bitcoin is coming",
    "url": "https://cryptoslate.com/speculation-mounts-that-a-regulatory-attack-on-bitcoin-is-coming/",
    "description": "<p>Former Coinbase CTO Balaji Srinivasan stirred speculation over U.S. regulatory actions on Twitter, writing, &#8220;The attack on Bitcoin is coming.&#8221; The comment was made in agreement with Alexander Leishman, the CEO of River Financial, who called for Bitcoiners to stay humble &#8220;during all of this regulatory drama,&#8221; as regulators would come for Bitcoin in due [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/speculation-mounts-that-a-regulatory-attack-on-bitcoin-is-coming/\">Speculation mounts that a regulatory attack on Bitcoin is coming</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-06-08T13:30:00.000Z",
    "title": "6 Questions for Thiago Cesar of Transfero",
    "url": "https://cointelegraph.com/magazine/questions-thiago-cesar-transfero/",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://cointelegraph.com/magazine/wp-content/uploads/2023/06/magazine-Thiago-Cesar-6q-scaled.jpg\"></p><p>Transfero’s Thiago Cesar says when he started buying Bitcoin in 2012 he knew it had amazing potential for “internationalizing money.”</p>\n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-08T13:15:00.000Z",
    "title": "Ankr Launches Enterprise RPC On Microsoft Azure Marketplace",
    "url": "https://cryptodaily.co.uk/2023/06/ankr-launches-enterprise-rpc-on-microsoft-azure-marketplace",
    "description": "<p class=\"md-end-block md-p\">San Francisco-based Web3 developer hub Ankr has officially launched Enterprise Remote Procedure Call (RPC) services on Microsoft's Azure Marketplace, following their partnership announcement in February this year.</p>\n<p class=\"md-end-block md-p\">The service is intended to provide Azure's vast customer base with low-latency, globally accessible blockchain connections, aiding them in their Web3 project and application development.</p>\n<p class=\"md-end-block md-p md-focus\">Notably, Ankr's AppChains, a solution enabling enterprises to deploy dedicated, customizable blockchains, will also be made available on Azure Marketplace. Initial offerings will include the deployment of Polygon Supernets with a promise of more blockchain ecosystem choices in the near future.</p>\n\n<p class=\"md-end-block md-p\">\"Through this partnership, we are abstracting away what is often an impediment to testing, deploying, and scaling Web3 projects seamlessly,\" shares Daniel An, Microsoft's Director of Business Development.</p>\n\n<p class=\"md-end-block md-p\">AppChains have been part of Ankr's product line-up for a year now. These scalable, application-specific blockchains facilitate decentralized app development and project execution for Web3 organizations. Their popularity among traditional enterprises has grown significantly due to their versatile application potential across banking, institutional clients, CBDCs, gaming, and more.</p>\n<p class=\"md-end-block md-p\">By offering AppChains through the Azure Marketplace, enterprises have a vetted and trusted platform to explore and adopt this new technology. Ankr's AppChains aim to overcome significant hurdles faced by enterprises, such as scalability, user experience, and the cost of hiring new Web3 engineering talent. </p>\n<p class=\"md-end-block md-p\">AppChains provide speedy and affordable transactions, seamless user experiences, regulatory compliance, and comprehensive engineering support. These advantages could streamline the transition to Web3 for many firms interested in the digital asset space. </p>\n<p class=\"md-end-block md-p\">Peter Stewart, Head of Infrastructure at Ankr, praised the collaboration with Microsoft and highlighted their anticipation for increased demand following the Azure Marketplace launch. Simultaneously, Kev Silk, Ankr AppChains Lead, underscored Ankr's commitment to facilitating Web3 accessibility for large businesses through this enterprise-grade chain solution.</p>\n\n<p class=\"md-end-block md-p\">\"With Microsoft's guidance, we will continue to innovate and improve based on user feedback and performance metrics. This partnership has been remarkable, and we are excited for the future of our Enterprise RPC service,\" Stewart shares.</p>\n\n<p class=\"md-end-block md-p\">Ankr, as an all-in-one Web3 developer hub, offers an extensive toolkit to build Web3 apps and establish high-performance connections to over 30 blockchains. Ankr is an approved infrastructure partner for constructing application-specific blockchains on ecosystems like the BNB Smart Chain, Polygon, and Avalanche.</p>\n<p class=\"md-end-block md-p\">According to data from 2022, Microsoft Azure is the second-largest cloud service provider worldwide, commanding a market share of approximately 20%. Analysts predict that by 2024, global blockchain technology revenues are expected to reach $23.3 billion. Given this context, the Ankr-Microsoft partnership could be a significant step in catering to this emerging demand.</p>\n<p class=\"md-end-block md-p\">The Ankr and Microsoft Azure collaboration represents an important development in the expansion of Web3, emphasizing the increasing importance of reliable infrastructure in fostering its growth. By facilitating the rapid deployment of customized blockchains and providing scalable connections to over 30 blockchain networks, this partnership could catalyze the mainstream adoption of Web3 technologies.</p>\n<p class=\"md-end-block md-p\">Building Web3 infrastructure is akin to creating the foundational pillars of the next-generation internet. It provides the necessary groundwork that enables decentralized applications (dApps) and platforms to run smoothly. This not only enhances performance but also ensures that these platforms can effectively maintain the decentralized ethos at the heart of the Web3 vision.</p>\n<p class=\"md-end-block md-p\">What's Next For Ankr and Microsoft Azure?</p>\n<p class=\"md-end-block md-p\">Microsoft Azure's involvement in this endeavor is notable. As one of the leading cloud service providers, Azure brings extensive expertise in facilitating scalable, reliable, and secure cloud solutions for various applications. Its entry into the Web3 infrastructure space underscores the intersection of traditional tech giants with the burgeoning field of blockchain technology.</p>\n<p class=\"md-end-block md-p\">In terms of broader implications, the Ankr-Microsoft partnership provides an excellent example of how cloud services can fuel the growth of Web3. Cloud computing, with its inherent flexibility, scalability, and cost-effectiveness, provides an ideal environment for developing and deploying dApps, smart contracts, and other blockchain-powered applications. </p>\n<p class=\"md-end-block md-p\">In fact, the synergy of cloud computing and blockchain could serve as a catalyst for new business models and applications in the Web3 space. For instance, decentralized data storage and management, enhanced digital identity solutions, and streamlined supply chain systems are among the numerous potential applications of a blockchain-cloud fusion.</p>\n<p class=\"md-end-block md-p\">Microsoft Azure, with its robust cloud infrastructure, has a history of fostering such innovations. The platform's as-a-service offerings &ndash; including Software-as-a-Service (SaaS), Platform-as-a-Service (PaaS), and Infrastructure-as-a-Service (IaaS) &ndash; have already disrupted multiple sectors. By extending these capabilities to Web3 infrastructure development, Azure could unlock new frontiers in the decentralized tech landscape.</p>\n<p class=\"md-end-block md-p\">The integration of Ankr&rsquo;s Enterprise RPC services and AppChains into Azure Marketplace, therefore, not only marks a significant step in Web3 infrastructure development but also demonstrates the potential of cloud services in accelerating the growth of Web3. As enterprises worldwide increasingly recognize the potential of blockchain technology, collaborations like these are likely to become more prominent, shaping the evolution of the Internet as we know it. Partnerships such as Ankr and Microsoft Azure's represent a critical step in this direction, bringing together the flexibility of cloud services with the transformative potential of blockchain technology. </p>\n<p class=\"md-end-block md-p\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>\n<p class=\"md-end-block md-p\">&nbsp;</p>\n<p class=\"md-end-block md-p\">&nbsp;</p>\n<p class=\"md-end-block md-p\">&nbsp;</p>\n<p class=\"md-end-block md-p\">&nbsp;</p>\n<p class=\"md-end-block md-p\">&nbsp;</p>\n<p class=\"md-end-block md-p\">&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T13:37:19.000Z",
    "title": "TMS Network (TMSN) – A Brilliant 2000% Bombshell Punishing Monero (XMR) And Solana (SOL)",
    "url": "https://www.cryptopolitan.com/tms-network-tmsn-a-brilliant-2000-bombshell-punishing-monero-xmr-and-solana-sol/",
    "description": "2023 has clearly been the year of TMS Network (TMSN) since it started its presale. Previous darlings of crypto Monero (XMR) and Solana (SOL) are finding it impossible to keep up. TMS Network (TMSN) has raised more than $6 million already, and it’s still only in the fourth phase of its presale. Let’s take a ... <a title=\"TMS Network (TMSN) &#8211; A Brilliant 2000% Bombshell Punishing Monero (XMR) And Solana (SOL)\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tms-network-tmsn-a-brilliant-2000-bombshell-punishing-monero-xmr-and-solana-sol/\" aria-label=\"More on TMS Network (TMSN) &#8211; A Brilliant 2000% Bombshell Punishing Monero (XMR) And Solana (SOL)\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T13:30:30.000Z",
    "title": "Aave Price Prediction 2023-2032: Is AAVE a Good Investment?",
    "url": "https://www.cryptopolitan.com/aave-price-prediction/",
    "description": "Aave Price Prediction 2023-2032 How much is Aave worth today? The live Aave price is $59.82, with a 24-hour trading volume of $37,275,436. Aave is down 1.72% in the last 24 hours. The current CoinMarketCap ranking is #50, with a live market cap of $863,617,654. It has a circulating supply of 14,422,799 AAVE coins and a max. supply of 16,000,000 ... <a title=\"Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aave-price-prediction/\" aria-label=\"More on Aave Price Prediction 2023-2032: Is AAVE a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-08T13:10:44.000Z",
    "title": "Terra Luna Classic Price Prediction 2023-2032: Is LUNC A Good Investment?",
    "url": "https://www.cryptopolitan.com/terra-luna-price-prediction/",
    "description": "Terra Luna Classic (LUNC) Price Prediction 2023-2032 A quick recall: Terra Luna was rebranded the original Terra Chain as Terra Classic.&#160;Click here&#160;for the Terra V2 CMC page. The official announcement regarding the migration can be found&#160;here. Due to the de-pegging of UST, LUNA is experiencing extreme volatility. Please proceed with caution. The Terra blockchain was ... <a title=\"Terra Luna Classic Price Prediction 2023-2032: Is LUNC A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/terra-luna-price-prediction/\" aria-label=\"More on Terra Luna Classic Price Prediction 2023-2032: Is LUNC A Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-08T13:10:50.000Z",
    "title": "Australian Bank Takes Stance Against Payments To Select Crypto Exchanges",
    "url": "https://www.newsbtc.com/crypto/australian-bank-takes-stance-against-payments-to-select-crypto-exchanges/",
    "description": "Due to concerns over the risk of scams, Australia&#8217;s largest bank, Commonwealth Banks (CBA), has recently announced the temporary delay of certain payments associated with crypto exchanges. This decision arose after the United States Securities Regulator (SEC) sued two major global exchanges, Coinbase and Binance. This comes just a few weeks after another major Australian bank, Westpac, banned customers from transacting with crypto exchange Binance. Commonwealth Bank Combat Scams, Prioritizing Customer Protection On June 8, CBA disclosed its intention to decline or place a 24-hour hold on “certain payments to crypto exchanges.” Nevertheless, the bank has yet to specify which crypto exchanges or payment types would be impacted by these new measures. Related Reading: Ripple CEO Blasts SEC Chair For Anti-Innovation Stance, XRP Bulls Remain Optimistic According to a statement, CBA claimed that the measures they&#8217;ve introduced safeguard their clients from scams associated with making payments to crypto exchanges. The bank added that customers sending funds to crypto exchanges to purchase cryptocurrencies will have a monthly limit of AUD 10,000 ($6,650). The general manager of CBA&#8217;s fraud management services, James Roberts, said; Consumer interest in cryptocurrencies has been increasing, and unfortunately, scammers globally are capitalizing on this trend and masquerading as legitimate investment opportunities or diverting funds into cryptocurrency exchanges. James further emphasized that the limits on outbound payments to crypto exchanges and the 24-hour holds will help fight the number of scams and money lost by customers. CBA said continual evaluation and monitoring would be conducted to assess the impacts of these scam response measures. This recent security measure marks a significant reversal from its previous plans. Notably, in November 2021, the bank introduced crypto trading services through its CommBank app, holding millions of users. During that period, the bank&#8217;s CEO, Matt Comyn, acknowledged the associated risks but emphasized the greater risks of not participating.  He stated that &#8220;The sector and the technology [isn&#8217;t] going away anytime soon.&#8221; Uncertain Future for Crypto Exchange Binance Australia Services Following De-banking Amid the ongoing global de-banking of crypto businesses, Binance users in Australia now face limited options for purchasing cryptocurrencies.  According to Binance, starting from 5:00 pm local time on June 1, bank transfers for fiat on-ramps and off-ramps have been suspended in Australia, including trading for Australian dollar (AU$) pairs. The recent suspension of deposits and withdrawals is connected to previous events that have affected Binance in Australia. Related Reading: US SEC Sues Binance, Fails To Mention Ripple (XRP) As Security In February, Binance&#8217;s local derivatives division informed users that specific positions and accounts would be closed for those who did not meet the criteria to be classified as wholesale investors. According to the law, a wholesale investor has sufficient capital to invest in higher-risk and more speculative assets. This investor category is also called an institutional or accredited investor.  To qualify as a wholesale investor in Australia, one must possess net assets of at least $2.5 million or have an annual gross income of at least $250,000. Notably, a report published by Binance in July of 2022 clearly states that the derivatives products are strictly for Australian wholesale clients. Related Reading: Galaxy Digital CEO Mike Novogratz Says This Will Kickstart The Bitcoin Bull Market However, after Binance closed non-compliant accounts, local regulators initiated a “targeted review” of the exchange’s local derivatives operations. On April 6, the Australian Securities and Investment Commission (ASIC) revoked the Binance Australian Derivatives license. Featured image from Pixabay and chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-08T13:20:14.000Z",
    "title": "Binance CEO Summoned by US Court: SEC Action Crosses Borders, Allows Virtual Appearance for CZ ",
    "url": "https://www.crypto-news-flash.com/binance-ceo-summoned-by-us-court-sec-action-crosses-borders-allows-virtual-appearance-for-cz/?utm_source=rss&utm_medium=rss&utm_campaign=binance-ceo-summoned-by-us-court-sec-action-crosses-borders-allows-virtual-appearance-for-cz",
    "description": "<p>US Court summons Changpeng Zhao (CZ) days after SEC filed a lawsuit against Binance.  CZ has 21 days to respond to the summon but has shown a willingness to cooperate.  The US Securities and Exchange Commission has filed 13 charges against Binance and its CEO Changpeng Zhao. In the latest update, the US District Court [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/binance-ceo-summoned-by-us-court-sec-action-crosses-borders-allows-virtual-appearance-for-cz/\">Binance CEO Summoned by US Court: SEC Action Crosses Borders, Allows Virtual Appearance for CZ </a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-08T13:35:20.000Z",
    "title": "XRP Could Potentially Rally to $0.8 if Bullish Sentiment Upholds",
    "url": "https://coinedition.com/xrp-could-potentially-rally-to-0-8-if-bullish-sentiment-upholds/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/XRP_Price_Might_Rally_To_0_80_If_Bulls_Hold_This_Crucial_Level-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/XRP_Price_Might_Rally_To_0_80_If_Bulls_Hold_This_Crucial_Level-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/XRP_Price_Might_Rally_To_0_80_If_Bulls_Hold_This_Crucial_Level-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/XRP_Price_Might_Rally_To_0_80_If_Bulls_Hold_This_Crucial_Level.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>A crypto analyst in the TradingView community, DemiGod, shared an incisive analysis of the XRP price. With a combination of indicators, the analyst predicts XRP could rally to $0.80 if it upholds the current price level. DemiGod’s analysis tools include a couple of simple moving averages (SMA), the relative strength index (RSI), and a downward [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/xrp-could-potentially-rally-to-0-8-if-bullish-sentiment-upholds/\">XRP Could Potentially Rally to $0.8 if Bullish Sentiment Upholds</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-08T13:14:07.000Z",
    "title": "Ankr Enterprise RPC, AppChain Solutions Now Available On Microsoft Azure",
    "url": "https://coinedition.com/ankr-enterprise-rpc-appchain-solutions-now-available-on-microsoft-azure/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Ankrs_Enterprise_RPC_and_AppChain_Solutions_Now_Available_On_Microsoft-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Ankrs_Enterprise_RPC_and_AppChain_Solutions_Now_Available_On_Microsoft-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Ankrs_Enterprise_RPC_and_AppChain_Solutions_Now_Available_On_Microsoft-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Ankrs_Enterprise_RPC_and_AppChain_Solutions_Now_Available_On_Microsoft.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Ankr, the all-in-one Web3 developer hub, has officially launched its Enterprise Remote Procedure Call (RPC) and AppChain solutions on Microsoft Azure Marketplace. This release follows the partnership announcement made earlier this year between Ankr and Microsoft, aiming to provide seamless access to blockchain infrastructure for Azure’s vast customer base. The Enterprise RPC service offers global, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ankr-enterprise-rpc-appchain-solutions-now-available-on-microsoft-azure/\">Ankr Enterprise RPC, AppChain Solutions Now Available On Microsoft Azure</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-08T13:15:07.000Z",
    "title": "Cardano Creator Warns SEC Lawsuit Against Binance Is Part of Crypto Suppression Efforts, Says End Goal Is a CBDC",
    "url": "https://dailyhodl.com/2023/06/08/cardano-creator-warns-sec-lawsuit-against-binance-is-part-of-crypto-suppression-efforts-says-end-goal-is-a-cbdc/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/cardano-creator-warns-efforts.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/cardano-creator-warns-efforts.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/cardano-creator-warns-efforts.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/cardano-creator-warns-efforts.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/cardano-creator-warns-efforts.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/cardano-creator-warns-efforts.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/cardano-creator-warns-efforts.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Cardano (ADA) creator Charles Hoskinson says that the U.S. Securities and Exchange Commission (SEC) is taking legal action against Binance as part of a broader effort to clamp down on the digital assets industry. On Monday, the SEC filed 13 charges against the world’s largest crypto exchange and its founder, Changpeng Zhao, for allegedly violating [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/08/cardano-creator-warns-sec-lawsuit-against-binance-is-part-of-crypto-suppression-efforts-says-end-goal-is-a-cbdc/\">Cardano Creator Warns SEC Lawsuit Against Binance Is Part of Crypto Suppression Efforts, Says End Goal Is a CBDC</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]