[
  {
    "source": "Cointelegraph",
    "date": "2023-11-20T02:48:52.000Z",
    "title": "A timeline of Sam Altman’s outing from OpenAI",
    "url": "http://cointelegraph.com/news/sam-altman-fired-from-openai-timeline",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/c03ac480-19c8-4460-9564-837b6e1c608c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Here’s everything that’s happened since OpenAI co-founder Sam Altman was suddenly fired from his role as CEO.</p>\n                    <p><p>The tech world reeled and Altman’s colleagues rallied to his side, with then-OpenAI president and co-founder Greg Brockman announcing his own resignation. With enormous public backlash from shareholders and employees, the board of directors is holding talks to possibly reinstate Altman.</p><p>Here’s what’s happened so far.</p><h2>Thursday, Nov. 16</h2><h3>Ilya Sustekever schedules call with Altman</h3><p>According to an X (formerly Twitter) post from Brockman, OpenAI chief scientist Ilya Sutskever sent Altman a message on Thursday evening to schedule a meeting for Friday afternoon. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Sam and I are shocked and saddened by what the board did today.<br><br>Let us first say thank you to all the incredible people who we have worked with at OpenAI, our customers, our investors, and all of those who have been reaching out.<br><br>We too are still trying to figure out exactly…</p>&mdash; Greg Brockman (@gdb) <a href=\"https://twitter.com/gdb/status/1725736242137182594?ref_src=twsrc%5Etfw\">November 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Additionally, he claimed that OpenAI CTO Mira Murati was made aware that Altman would be fired that evening. </p><h2>Friday, Nov. 17</h2><h3>Brockman notified Altman was fired</h3><p>Just after midday on Nov. 17, Brockman said Sutskever texted him asking to jump on a call. After joining the call a few minutes later he was informed he was being removed from OpenAI’s board of directors but would maintain his role as president and that Altman had been fired. </p><h3>OpenAI publicly says Altman is out</h3><p>OpenAI published a blog post stating <a href=\"https://cointelegraph.com/news/sam-altman-ousted-from-open-ai-chatgpt-cto-mira-murati-named-interim-ceo\">Altman had been fired</a> due to not being “consistently candid in his communications with the board” and added <a href=\"https://cointelegraph.com/news/who-is-mira-murati-openai-interim-ceo\">Murati would be taking over</a> as interim CEO. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">OpenAI announces leadership transition <a href=\"https://t.co/fFYDLwGXQz\">https://t.co/fFYDLwGXQz</a></p>&mdash; OpenAI (@OpenAI) <a href=\"https://twitter.com/OpenAI/status/1725611900262588813?ref_src=twsrc%5Etfw\">November 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>Microsoft issues statement on OpenAI</h3><p>Microsoft, the largest investor and partner in OpenAI issued a <a href=\"https://blogs.microsoft.com/blog/2023/11/17/a-statement-from-microsoft-chairman-and-ceo-satya-nadella/\" target=\"_blank\" rel=\"noopener nofollow\">statement</a> concerning Altman’s ousting with CEO Satya Nadella trying to calm the market’s nerves and offer reassurance that Altman’s axing would have no major impact on the partnership moving forward. </p><p>“We have a long-term agreement with OpenAI with full access to everything we need to deliver on our innovation agenda and an exciting product roadmap, and remain committed to our partnership, and to Mira and the team.”</p><h3>Brockman resigns </h3><p>Following the public announcement of Altman’s departure, Brockman announced his own resignation.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">After learning today’s news, this is the message I sent to the OpenAI team: <a href=\"https://t.co/NMnG16yFmm\">https://t.co/NMnG16yFmm</a> <a href=\"https://t.co/8x39P0ejOM\">pic.twitter.com/8x39P0ejOM</a></p>&mdash; Greg Brockman (@gdb) <a href=\"https://twitter.com/gdb/status/1725667410387378559?ref_src=twsrc%5Etfw\">November 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h3>Resignations pile up</h3><p>In the wake of Brockman’s resignation, a number of senior OpenAI executives followed suit, with the company’s head of preparedness Aleksander Madfry, and director of research Jakub Pachoki announcing their respective resignations. </p><h2>Saturday, Nov. 18</h2><h3>Shock firing was surprise to management</h3><p>OpenAI chief operating officer Brad Lightcap said the announcement to the entire management by surprise, per an internal <a href=\"https://www.axios.com/2023/11/18/openai-memo-altman-firing-malfeasance-communications-breakdown\" target=\"_blank\" rel=\"noopener nofollow\">memo</a> seen by Axios on Nov. 18.</p><p>\"We can say definitively that the board's decision was not made in response to malfeasance or anything related to our financial, business, safety, or security/privacy practices. This was a breakdown in communication between Sam and the board.\"</p><h3>Altman eyes new venture</h3><p>The Information <a href=\"https://www.theinformation.com/articles/openai-co-founder-altman-plans-new-venture\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> on Nov. 18 that Altman had already begun discussing a new AI-related venture with investors. Brockman is expected to join Altman in whatever endeavor he moves forward with.</p><h3>Microsoft “furious” at Altman’s outing, pushes board to bring him back</h3><p>Bloomberg <a href=\"https://www.bloomberg.com/news/articles/2023-11-18/openai-altman-ouster-followed-debates-between-altman-board\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> on Nov. 18 that Microsoft CEO Satya Nadella was “furious” with the decision and began pushing the board to consider reinstating Altman as CEO.</p><h3>Board agrees to reconsider Altman’s position</h3><p>The Verge <a href=\"https://www.theverge.com/2023/11/18/23967199/breaking-openai-board-in-discussions-with-sam-altman-to-return-as-ceo\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> on Nov. 18 that OpenAI’s board had “in principle” agreed to resign and bring back both Altman as CEO and Brockman and president.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/meta-dissolves-responsible-ai-division-amid-restructuring\">Meta dissolves responsible AI division amid restructuring</a></em></strong></p><p>Multiple sources claimed Sutskever’s “integral role” in Altman’s firing suggested there was a hotbed of tension between the nonprofit and for-profit sides of the company. </p><h2>Sunday, Nov. 19</h2><h3>Altman at OpenAI ahead of decision deadline</h3><p>Altman posted a picture to X on Nov. 19 at OpenAI’s headquarters with a guest badge as a deadline for a decision regarding his reinstatement as CEO was set for 5 pm PST. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">first and last time i ever wear one of these <a href=\"https://t.co/u3iKwyWj0a\">pic.twitter.com/u3iKwyWj0a</a></p>&mdash; Sam Altman (@sama) <a href=\"https://twitter.com/sama/status/1726345564059832609?ref_src=twsrc%5Etfw\">November 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Bringing back Altman as CEO may require the board to issue an apology as well as a statement that frees him of wrongdoing, sources told Bloomberg. </p><h3>Microsoft eyes board seat as insiders push for Altman</h3><p>The Information <a href=\"https://www.theinformation.com/articles/microsoft-eyes-seat-on-openais-revamped-board\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> on Nov. 19 that Microsoft is eyeing either a board seat or board observer role without voting power if Altman returns. Bloomberg earlier <a href=\"https://www.bloomberg.com/news/articles/2023-11-19/openai-negotiations-to-reinstate-altman-hit-snag-over-board-role\" target=\"_blank\" rel=\"noopener nofollow\">reported</a> that OpenAI’s top brass is pushing for Altman to return including interim CEO Mira Murati, chief strategy officer Jason Kwon, and chief operating officer Brad Lightcap.</p><p>On Nov. 17 the artificial intelligence startup OpenAI made the shock announcement that CEO Sam Altman was fired — the man behind viral AI-powered tech such as chatbots ChatGPT, GPT4 and image generator DallE-3.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/ai-eye-real-ai-usecases-crypto-gemini-gpt-4-rival-roblox-assistant-ai-cheating/\">AI Eye — Real uses for AI in crypto, Google’s GPT-4 rival, AI edge for bad employees</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-20T03:08:17.000Z",
    "title": "OpenAI Leaders Confront Crisis with Stalled Talks on Sam Altman’s Return",
    "url": "https://www.cryptopolitan.com/openai-leaders-crisis-stalled-talks-sam/",
    "description": "In a high-stakes drama within the corridors of OpenAI, efforts to bring back the ousted CEO, Sam Altman, have hit a roadblock. Negotiations, spearheaded by a group of OpenAI executives and investors, are deadlocked over the composition and role of the board, shedding light on the internal struggles plaguing the prominent artificial intelligence company. Amidst ... <a title=\"OpenAI Leaders Confront Crisis with Stalled Talks on Sam Altman&#8217;s Return\" class=\"read-more\" href=\"https://www.cryptopolitan.com/openai-leaders-crisis-stalled-talks-sam/\" aria-label=\"More on OpenAI Leaders Confront Crisis with Stalled Talks on Sam Altman&#8217;s Return\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-20T03:07:01.000Z",
    "title": "Bitcoin Price Regains Strength As The Bulls Aim For $40K",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-regains-strength-40k/",
    "description": "Bitcoin price started a fresh increase above the $37,000 resistance zone. BTC could accelerate higher once there is a clear move above the $37,350 resistance. Bitcoin started a fresh increase from the $35,500 support zone. The price is trading above $36,700 and the 100 hourly Simple moving average. There is a key bullish trend line forming with support near $36,720 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could continue to move up toward $40,000 if it clears $37,350 and $38,000. Bitcoin Price Restarts Increase Bitcoin price found support near the $35,500 zone after a steady decline. BTC bulls were active above the $35,500 level and were able to start a fresh increase. There was a move above the $36,500 and $37,000 resistance levels. The price climbed above the 50% Fib retracement level of the downward wave from the $37,950 swing high to the $35,518 low. The price even spiked above $37,200. Bitcoin is now trading above $36,700 and the 100 hourly Simple moving average. There is also a key bullish trend line forming with support near $36,720 on the hourly chart of the BTC/USD pair. On the upside, immediate resistance is near the $37,350 level. It is near the 76.4% Fib retracement level of the downward wave from the $37,950 swing high to the $35,518 low. A clear move above the $37,350 resistance might send the price toward the $37,800 level. Source: BTCUSD on TradingView.com The next key resistance could be near $38,000. A close above the $38,000 resistance could start a strong increase. The first major resistance is near $39,200, above which the price might accelerate further higher. In the stated case, it could test the $40,000 level. Any more gains might send BTC toward the $42,000 level. Another Rejection In BTC? If Bitcoin fails to rise above the $37,350 resistance zone, it could start another decline. Immediate support on the downside is near the $37,000 level. The next major support is $36,700 and the trend line. If there is a move below $36,700, there is a risk of more downsides. In the stated case, the price could drop toward the $35,950 support in the near term. The next key support or target could be $35,500. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $37,000, followed by $36,700. Major Resistance Levels – $37,350, $37,800, and $38,000."
  }
]