[
  {
    "source": "Bitcoin.com",
    "date": "2023-06-24T19:30:22.000Z",
    "title": "Record High Credit Card Debt: 55% of Americans Concerned About Repayment as Inflation Pushes Consumers to Credit Reliance",
    "url": "https://news.bitcoin.com/record-high-credit-card-debt-55-of-americans-concerned-about-repayment-as-inflation-pushes-consumers-to-credit-reliance/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/usdcc-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Record High Credit Card Debt: 55% of Americans Concerned About Repayment as Inflation Pushes Consumers to Credit Reliance\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/usdcc-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/usdcc-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/usdcc-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/usdcc-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/usdcc-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/usdcc-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/usdcc.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />According to a Newsweek poll conducted by Redfield &#38; Wilton Strategies, 55% of Americans are &#8220;very&#8221; or &#8220;fairly&#8221; concerned about paying off credit debt this year. The total credit card balance of Americans is at its highest point since the U.S. Federal Reserve began tracking the data, and current metrics indicate that Americans are using [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-24T19:30:49.000Z",
    "title": "Goldman Sachs fires 125 managing directors",
    "url": "https://www.cryptopolitan.com/goldman-sachs-fires-125-managing-directors/",
    "description": "Goldman Sachs, one of the world&#8217;s most respected banking giants, is engaging in a notable shift of strategy as it faces the realities of a rapidly changing global market landscape. Approximately 125 managing directors are slated to lose their jobs in this latest round of downsizing, as the firm copes with a notable drop in ... <a title=\"Goldman Sachs fires 125 managing directors\" class=\"read-more\" href=\"https://www.cryptopolitan.com/goldman-sachs-fires-125-managing-directors/\" aria-label=\"More on Goldman Sachs fires 125 managing directors\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-24T19:34:12.000Z",
    "title": "Momentum: Why The Bitcoin Train Is Ready To Leave The Station",
    "url": "https://www.newsbtc.com/bitcoin-news/momentum-why-the-bitcoin-train-station/",
    "description": "The latest Bitcoin price action has pushed momentum into the positive on just about every timeframe that matters: From today the daily through the monthly. If these signals confirm with a June monthly close, the train might have officially left the station when it comes to the next crypto bull run. BTCUSD Momentum Builds Across Multiple Timeframes Imagine a train that’s come to a complete stop. It’s a lot easier to board a train as it’s idle, and before it has gained momentum. Momentum starts off slow, then once the train really begins rolling it picks up seemingly unstoppable steam. Slowing back down takes force, time, and distance before it once again comes to a stop. Getting in the train’s path can prove dangerous. Related Reading: Bitcoin Price Breaks Above $30,000: Is The Bull Run Back On? If Bitcoin price can continue to climb through the end of June, strengthening bullish momentum will confirm across nearly every significant timeframe from the daily to the weekly to the monthly. That is according to the LMACD, which in the chart below shows the following timeframes forming a bullish crossover and buy signal: 1D, 3D, 1W, 2W, 3W, and 1M (clockwise). Such a signal could mean the train has left the station. Bitcoin has reclaimed $30,000 &#124; BTCUSD on TradingView.com Are The Stars Aligning For A Bitcoin Bull Run? Much like when stars align, people expect something special, the majority of important timeframes signaling strengthening momentum could mean like a locomotive, Bitcoin is starting to gain steam. And once that begins, and the train leaves the station, it isn’t quite as easy to get on for a ride. However, it isn’t fully clear if yet if that phase has begun, or if the train has a few more stops before it moves onto its final destination. Related Reading: Bitcoin Recovers Above Critical Level, Why Bulls Could Be Ready To Charge In contrast, the weekly LMACD crossover could fail and cause the monthly crossover to follow and diverge downward. At that point, things could get dicey for crypto and put lower timeframe bullish crossovers in serious jeopardy. Anyone aboard the train currently would more than likely end up disappointed. What do you think? Has the train left the station in Bitcoin? This chart originally appeared in Issue #9 of CoinChartist (VIP). Get 10% off a year subscription with this link: https://coinchartist.substack.com/NEWSBTC Tony is the author of the CoinChartist (VIP) newsletter. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  }
]