[
  {
    "source": "Cointelegraph",
    "date": "2024-03-21T04:11:39.000Z",
    "title": " Ethereum core devs launch ‘pump the gas’ effort to raise gas limit ",
    "url": "https://cointelegraph.com/news/ethereum-pump-the-gas-initiative-raise-limit-cut-fees",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMTJhN2VkNGEtNjY0Ni00ZTg1LTg5ODQtOGUyMTQzYjJjYjVjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The devs argue that raising the gas limit to 40 million will cut Ethereum’s layer-1 transaction fees by around 15 to 33%.  </p>\n                    <p><p>Ethereum developers have launched a new initiative in a bid to raise the blockchain network’s long-static gas limit, arguing that the change can be used to help scale Ethereum. </p><p>On March 20, core Ethereum developer Eric Connor and former head of smart contracts at MakerDAO Mariano Conti unveiled a new <a href=\"https://pumpthegas.org/\" target=\"_blank\" rel=\"noopener nofollow\">website</a> called ‘pump the gas’ to raise the Ethereum gas limit from 30 million to 40 million, which they say will reduce transaction fees on layer 1. </p><p>“This can result in a 15% to 33% reduction in layer-1 transaction fees,” <a href=\"https://twitter.com/econoar/status/1770136717401419859\" target=\"_blank\" rel=\"noopener nofollow\">said</a> Connor in a March 19 post on X before adding, “We are calling on solo stakers, client teams, pools, and community members to help.”</p><p><a href=\"https://cointelegraph.com/news/ethereum-pump-the-gas-initiative-raise-limit-cut-fees\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-21T04:30:20.000Z",
    "title": "The AI Concerns Report – Terminator Producer’s Grim Forecast",
    "url": "https://www.cryptopolitan.com/ai-concerns-report-terminator-producer/",
    "description": "In a digital age where AI concerns blur the boundaries between science fiction and reality, apprehensions surrounding artificial intelligence (AI) continue to proliferate. Among the latest voices to join the chorus of apprehension is Gale Ann Hurd, renowned for her role as executive producer of the iconic film &#8220;Terminator 2: Judgment Day.&#8221; In a series [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-21T04:38:03.000Z",
    "title": "LITECOIN PRICE ANALYSIS & PREDICTION (March 21) – LTC Retests Key Level After Breakout, Possible Rebound Ahead",
    "url": "https://nulltx.com/litecoin-price-analysis-prediction-march-21-ltc-retests-key-level-after-breakout-possible-rebound-ahead/",
    "description": "Litecoin appeared bearish again following a recent break out of a crucial resistance level to a multi-month high. However, it has found support and bounced slightly but there’s not enough volume to bring the bulls back.  The early month break out from an accumulation phase saw Litecoin&#8217;s price increase above the [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-03-21T04:32:12.000Z",
    "title": "BINANCE COIN PRICE ANALYSIS & PREDICTION (March 21) – BNB Loses Steam After Rallying 220% In Five Months, Now Under Retracement",
    "url": "https://nulltx.com/binance-coin-price-analysis-prediction-march-21-bnb-loses-steam-after-rallying-220-in-five-months-now-under-retracement/",
    "description": "After exploding massively near its all-time high, BNB halted the rally and started to fade out. It broke down this week and lost about 10% of its valuation. Despite the reductions, the trend remains bullish weekly. Last Saturday, BNB reached a local peak of $643 after doubling its price in [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-21T04:24:27.000Z",
    "title": "Ethereum Price Rallies 10%, Why Close Above $3,550 Is The Key",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-rallies-3550/",
    "description": "Ethereum price started a recovery wave from the $3,050 zone. ETH is up over 10% and is now struggling to clear the $3,550 resistance zone. Ethereum started a decent recovery wave from the $3,050 zone. The price is trading above $3,350 and the 100-hourly Simple Moving Average. There was a break above a major bearish trend line with resistance at $3,400 on the hourly chart of ETH/USD (data feed via Kraken). The pair could continue to rise if it settles above the $3,550 resistance zone. Ethereum Price Starts Recovery Ethereum price extended its decline below the $3,350 and $3,200 levels, like Bitcoin. ETH even declined below the $3,150 support level before the bulls appeared. It tested the $3,050 zone. A low was formed at $3,059 and the price is moving higher. There was a strong recovery wave above the $3,350 resistance. The price cleared the 50% Fib retracement level of the downward wave from the $3,675 swing high to the $3,059 low. There was also a break above a major bearish trend line with resistance at $3,400 on the hourly chart of ETH/USD. Ethereum price is now trading above $3,400 and the 100-hourly Simple Moving Average. On the upside, immediate resistance is near the $3,520 level or the 76.4% Fib retracement level of the downward wave from the $3,675 swing high to the $3,059 low. The first major resistance is near the $3,550 level. The next key resistance sits at $3,675, above which the price might gain bullish momentum. Source: ETHUSD on TradingView.com In the stated case, Ether could rally toward the $3,820 level. If there is a move above the $3,820 resistance, Ethereum could even rise toward the $4,000 resistance. Any more gains might call for a test of $4,080. Another Decline In ETH? If Ethereum fails to clear the $3,550 resistance, it could start another decline. Initial support on the downside is near the $3,380 level. The first major support is near the $3,320 zone. The next key support could be the $3,220 zone. A clear move below the $3,220 support might send the price toward $3,150. Any more losses might send the price toward the $3,050 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $3,380 Major Resistance Level – $3,550"
  },
  {
    "source": "Coin Edition",
    "date": "2024-03-21T04:30:10.000Z",
    "title": "Cardano (ADA) Price Prediction 2024-2030: Will ADA Price Hit $5 Soon?",
    "url": "https://coinedition.com/cardano-ada-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/Cardano-ADA-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano-ADA-Price-Prediction\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/Cardano-ADA-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/Cardano-ADA-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/Cardano-ADA-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/Cardano-ADA-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/Cardano-ADA-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>After the first and second-generation cryptocurrencies, Bitcoin and Ethereum, Cardano was introduced in 2017 as a third-generation blockchain. Cardano claims to be a more scalable, secure, and efficient alternative to Ethereum and other decentralized application platforms. A cryptocurrency like Cardano, which has been around for a while, is one with a growing ecosystem. This year, [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/cardano-ada-price-prediction/\">Cardano (ADA) Price Prediction 2024-2030: Will ADA Price Hit $5 Soon?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]