[
  {
    "source": "CoinDesk",
    "date": "2023-06-27T20:25:38.000Z",
    "title": "Latin American Crypto Firm Ripio Approved to Operate in Spain as an Exchange",
    "url": "https://www.coindesk.com/business/2023/06/27/latin-american-crypto-firm-ripio-approved-to-operate-in-spain-as-an-exchange/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "It’s the latest in a number of licenses to crypto companies granted by the Bank of Spain."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-27T20:32:47.000Z",
    "title": "Nevada Forces Crypto Custodian Prime Trust to Shut Down",
    "url": "https://decrypt.co/146448/nevada-forces-crypto-custodian-prime-trust-to-shut-down",
    "description": "Nevada regulators are moving to shut down crypto custodian Prime Trust after finding it owed millions to customers."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-27T20:28:02.000Z",
    "title": "These Three AI Startups Just Raised $2 Billion",
    "url": "https://decrypt.co/146440/three-ai-startups-raised-2-billion-ai-business-investors",
    "description": "VCs are pouring big money into AI startups, hoping to increase the frequency and velocity of innovation in the industry."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-27T20:17:37.000Z",
    "title": "These ChatGPT Plugins Can Boost Your Productivity with AI",
    "url": "https://decrypt.co/146439/these-chatgpt-plugins-can-boost-your-productivity-with-ai",
    "description": "Generative AI can help with online research, PDF queries, reminders, and social media searches."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-27T20:31:40.000Z",
    "title": "New exchange EDX reportedly switching out Paxos' custody services for Anchorage's",
    "url": "https://cointelegraph.com/news/new-exchange-edx-reportedly-switching-out-paxos-custody-services-for-anchorage-s",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/77fc29cd-5f60-4551-82a2-dad1da8bfc11.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The new exchange does not custody customer funds itself to avoid conflict of interest – and a hot-button issue with the SEC.</p>\n                    <p><p>EDX, a cryptocurrency exchange launched a week ago with the backing of tradfi heavyweights such as Citadel Securities, Fidelity Digital Assets and Charles Schwab, is reportedly preparing to switch custody providers, <a href=\"https://www.bloomberg.com/news/articles/2023-06-27/citadel-securities-backed-crypto-exchange-partnership-drops-paxos-for-anchorage#xj4y7vzkg\" target=\"_blank\" rel=\"noopener nofollow\">dropping</a> Paxos Trust in favor of Anchorage Digital. EDX has a noncustodial business model designed to remove conflicts of interest. </p><p>EDX supports trading in four cryptocurrencies – Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>), Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) and Bitcoin Cash (<a href=\"https://cointelegraph.com/bitcoin-cash-price-index\">BCH</a>). At the time of writing, BCH had risen 70.43% in the week since EDX began operating, and 101.36% in the last month.</p><p>EDX <a href=\"https://www.businesswire.com/news/home/20221004006072/en/EDX-Markets-Partners-with-Paxos-for-Digital-Asset-Custody-Services-on-New-Exchange\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> its partnership with Paxos to “facilitate the custody and wallet infrastructure of digital assets” in October, shortly after the launch of <a href=\"https://cointelegraph.com/news/wall-street-mainstays-setting-up-digital-assets-exchange-with-on-chain-settlement\">the exchange was announced</a>. The United States Securities and Exchange Commission <a href=\"https://cointelegraph.com/news/sec-proposes-tougher-rules-as-part-of-its-crypto-custody-crackdown\">has since announced a proposal</a> for stricter custody rules for crypto firms. A Paxos spokesperson told Cointelegraph: </p><blockquote>“EDX shifted to focus on a non-custodial offering at launch. We are very excited about what EDX is building, and we hope to support EDX customers with our regulated custody when banks and brokers onboard to the platform.” </blockquote><p>Blockchain infrastructure platform Paxos holds a so-called BitLicense from the New York Department of Financial Services. That agency was <a href=\"https://cointelegraph.com/news/stablecoin-issuer-paxos-probed-by-new-york-regulators\">reported to be investigating</a> Paxos earlier this year for an unspecified reason. Paxos was <a href=\"https://cointelegraph.com/news/paxos-receives-preliminary-conditional-approval-for-us-bank-charter\">granted “preliminary conditional approval”</a> for US bank charter from the United States Comptroller of the Currency (OCC) in 2021, but that approval reportedly <a href=\"https://www.benzinga.com/markets/cryptocurrency/23/04/31714389/paxoss-national-banking-charter-application-expired-but-it-may-try-again\" target=\"_blank\" rel=\"noopener nofollow\">expired</a> at the end of March.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/prometheum-subsidiary-receives-finra-approval-for-digital-asset-qualified-custody\">Prometheum subsidiary receives FINRA approval for digital asset qualified custody</a></em></strong></p><p>Anchorage Digital <a href=\"https://cointelegraph.com/news/anchorage-gets-occ-s-first-national-charter-to-a-crypto-bank\">was the first crypto firm</a> to receive a national trust bank charter from the OCC in January 2021. It <a href=\"https://cointelegraph.com/news/occ-issues-order-against-anchorage-digital-over-aml-compliance\">ran afoul of that regulator</a> a year later for Anti-Money Laundering (AML) deficiencies and agreed to a consent order. Shortly after that, Anchorage Digital <a href=\"https://cointelegraph.com/news/anchorage-forms-custody-network-with-five-crypto-exchanges\">formed a custody network</a> with crypto exchanges Binance.US, CoinList, Blockchain.com, Strix Leviathan and Wintermute.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ EDX Markets, a non-custodial exchange, went live today.<br><br>That sounds like a contradiction right? <br><br>Here&#39;s background on EDX and initial thoughts. <a href=\"https://t.co/cPqARF5BmG\">pic.twitter.com/cPqARF5BmG</a></p>&mdash; Ram Ahluwalia, higher for longer crypto CFA (@ramahluwalia) <a href=\"https://twitter.com/ramahluwalia/status/1671218916058705928?ref_src=twsrc%5Etfw\">June 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>EDX plans to introduce EDX Clearing, a clearinghouse to settle trades executed on the EDX Markets platform, later this year. EDX declined to comment on the matter of its custody provider, and Anchorage Digital did not respond to a request for comment.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\">Unstablecoins: Depegging, bank runs and other risks loom</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T20:32:37.000Z",
    "title": "Indian business tycoon and philanthropist Ratan Tata refutes cryptocurrency investment rumours",
    "url": "https://www.cryptopolitan.com/ratan-tata-refutes-crypto-investment-rumours/",
    "description": "Ratan Tata, an Indian business tycoon and philanthropist, has debunked reports that he has any association with cryptocurrencies. The chairman emeritus of the Tata Group warned that people stay vigilant to avoid being scammed by those making false reports in an attempt to lure unsuspecting citizens and crypto investors. Tata shuts down crypto investment rumours ... <a title=\"Indian business tycoon and philanthropist Ratan Tata refutes cryptocurrency investment rumours\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ratan-tata-refutes-crypto-investment-rumours/\" aria-label=\"More on Indian business tycoon and philanthropist Ratan Tata refutes cryptocurrency investment rumours\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T20:27:34.000Z",
    "title": "Ankr launches AppChains on Ethereum",
    "url": "https://www.cryptopolitan.com/ankr-launches-appchains-on-ethereum/",
    "description": "Amid the relentless acceleration of technological advancement, the world bears witness to a novel turning point as Ankr, a forerunner in blockchain solutions, inaugurates its trailblazing initiative – AppChains on Ethereum. This game-changing development addresses the pressing need for blockchain scalability, particularly on the Ethereum network, which is renowned for its unrivaled security and decentralization ... <a title=\"Ankr launches AppChains on Ethereum\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ankr-launches-appchains-on-ethereum/\" aria-label=\"More on Ankr launches AppChains on Ethereum\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-27T20:30:06.000Z",
    "title": "Ripple Thrives Despite Legal Battle – What’s The Market Reaction Of XRP?",
    "url": "https://www.newsbtc.com/news/ripple/ripple-thrives-despite-legal-battle-whats-the-market-reaction-of-xrp/",
    "description": "Ripple is confidently addressing its ongoing legal challenges while actively exploring new opportunities to expand the capabilities of the Ripple platform. Although the exact role of XRP is still under scrutiny, notable signs suggest a growing interest in its potential. Ripple&#8217;s Resilience In The Legal Battle In a recent twist to the SEC v. Ripple case, XRP holders&#8217; attorney and legal representative, John Deaton, took to Twitter to share a rollercoaster of emotions. Initially filled with anticipation, according to Deaton, he received an email filing related to the case with SEC. However, his hopes were swiftly crushed when he discovered that the email merely announced a lawyer&#8217;s withdrawal from the proceedings. Related Reading: Ripple CEO Blasts SEC Chair For Anti-Innovation Stance, XRP Bulls Remain Optimistic Deaton promptly clarified that this departure holds no significant impact on the ongoing legal battle between Ripple and the SEC. Additionally, it is crucial to note that the lawyer&#8217;s exit should not be misconstrued as a settlement or any substantial change in the case. And Deaton concluded that the withdrawal does not alter the course of the litigation. Surge in Active Addresses Data from Santiment highlights a surge in active addresses for Ripple&#8217;s XRP in the past weeks. Analysis of the chart reveals that this upward trend commenced in late May and has continued to gain momentum throughout June, ultimately reaching an all-time high. Related Reading: ‘Ripple (XRP) Is A Must-Hold For The Next Bull Run,’ Says Bitcoin Maxi The average number of active addresses was close to one million. However, a discernible upward trajectory emerged, pushing the average to approximately 1.1 million. At present, the number of active addresses has surpassed 1.1 million, indicating a sustained growth pattern. XRP Price Stagnation And Potential Reversal Before now, Ripple&#8217;s XRP experienced a distinctive price pattern that deviated from the broader market, displaying an upward trajectory. However, in recent days, its price movement has become stagnant, lacking a clear indication of either an upward or downward trend. XRPUSD daily chart at $0.4801 &#124; Source: TradingView At the time of writing, XRP was trading at approximately $0.48, reflecting a decrease of more than 4%. It is worth noting that the overall trend appears bearish, as evidenced by the positioning of its Relative Strength Index (RSI) line. Nevertheless, the bearish trend observed in XRP&#8217;s price movement has displayed a relatively subdued strength, leaving room for the possibility of a sudden upswing that could propel it back into a bullish trajectory. Additionally, it is worth noting that XRP&#8217;s current trading price remains above its short Moving Average (represented by the yellow line), which also acts as an immediate support level for the cryptocurrency. Featured image from iStock, charts from TradingView.com"
  }
]