[
  {
    "source": "CoinDesk",
    "date": "2023-09-05T09:44:19.000Z",
    "title": "Traditional Finance Exchanges Divided on Crypto Services: Survey",
    "url": "https://www.coindesk.com/business/2023/09/05/traditional-finance-exchanges-divided-on-crypto-services-survey/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "A World Federation of Exchanges survey found 41% of respondents already offer crypto-related products or services, with a further 24% planning to offer them in the future."
  },
  {
    "source": "CoinDesk",
    "date": "2023-09-05T09:43:47.000Z",
    "title": "Deribit Sees 17% Growth in Crypto Derivatives Trading Volume in August, Led by Options",
    "url": "https://www.coindesk.com/markets/2023/09/05/deribit-sees-17-growth-in-crypto-derivatives-trading-volume-in-august-led-by-options/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Options tied to ether recorded their highest volumes since March of this year, Deribit's Luuk Strijers told CoinDesk."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-05T09:46:32.000Z",
    "title": "ECB Exec Takes Aim At PayPal's Stablecoin, Praises Digital Euro",
    "url": "https://decrypt.co/154966/ecb-exec-takes-aim-at-paypals-stablecoin-praises-digital-euro",
    "description": "European Central Bank executive Fabio Panetta warned of the risks associated with private stablecoins, while making the case for CBDCs."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-05T09:57:27.000Z",
    "title": "Cronos Labs begins recruitment phase for $100M accelerator program",
    "url": "https://cointelegraph.com/news/cronos-labs-begins-recruitment-for-100-million-accelerator-program",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/af65ee87-9ae6-4ddf-a92f-7fa8264c2072.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cronos tapped Google Cloud, Amazon Web Services, CertiK, PeckShield and various other firms to participate as mentors in the accelerator program. </p>\n                    <p><p>Web3 startup accelerator Cronos Labs has launched the third cohort of its accelerator program which aims to support early-stage projects by providing funding opportunities and mentorship. The scheme is backed by $100 million in investment that will be used to support crypto startups. </p><p>In an announcement sent to Cointelegraph, Cronos Labs highlighted that the accelerator's goal is to nurture startups that have the potential to \"shape the future of Web3.\" Furthermore, Cronos is looking for projects that focus on creating practical use cases that can push the adoption of <a href=\"https://cointelegraph.com/learn/what-are-dapps-everything-there-is-to-know-about-decentralized-applications\">decentralized applications (DApps)</a> that can attract genuine users rather than bots. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Exciting news for blockchain devs!  Cronos Labs is launching a $100M accelerator program to support cutting-edge blockchain solutions. Join the program to gain mentorship, funding, and resources for your project. Apply now on the official Cronos Labs website! <a href=\"https://twitter.com/hashtag/Blockchain?src=hash&amp;ref_src=twsrc%5Etfw\">#Blockchain</a> <a href=\"https://t.co/ZgS39IRg9C\">pic.twitter.com/ZgS39IRg9C</a></p>&mdash; CryptoEmery (@CryptoEmery1) <a href=\"https://twitter.com/CryptoEmery1/status/1698867587495637434?ref_src=twsrc%5Etfw\">September 5, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The program's recruitment phase began on Sept. 4, coinciding with the start of the Korea Blockchain Week, which will run until Sept. 10. Cronos Labs will choose eight startups that will participate in a 12-week remote program that will have mentorship, master classes, marketing and financial support and introduction to strategic partners. At the end of the program, there will be a demo day that will start discussions on fundraising. </p><p>In a statement, Charlotte Kapoor, the head of innovation programs at Cronos, said that the number and quality of applicants to previous iterations of the accelerator was “overwhelming” and said that it’s going to be tough to create a final shortlist. “We’re looking for novel proposals that solve real problems while demonstrating ingenious uses for AI, blockchain, and decentralized technology,” Kapoor added. </p><p>Cronos tapped various companies to become mentors and partners in the program. These include Google Cloud, Amazon Web Services (AWS) and blockchain security firms CertiK and PeckShield. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/private-id-verification-wins-binance-web3-reality-show\"><strong><em>Private ID verification wins Binance Web3 reality show</em></strong></a></p><p>Meanwhile, funding support for Web3 technology has been slowly gaining momentum. On Aug. 7, the Monetary Authority of Singapore (MAS), the country’s central bank, committed $112 million to <a href=\"https://cointelegraph.com/news/singapore-commits-112m-to-support-fintech-solutions-like-web3\">support various financial technology solutions</a> like Web3. The scheme will foster innovation by supporting projects that use cutting-edge tech. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/recursive-inscriptions-bitcoin-supercomputer-defi-aws-possible/\"><strong><em>Recursive inscriptions: Bitcoin ‘supercomputer’ and BTC DeFi coming soon</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "BTCManager",
    "date": "2023-09-05T09:56:49.000Z",
    "title": "Binance vs. SEC update, BNB and Monero firm as Everlodge draws traders",
    "url": "https://crypto.news/binance-vs-sec-update-bnb-and-monero-firm-as-everlodge-draws-traders/",
    "description": "Everlodge is drawing traders while BNB and Monero are relatively firm, offering different propositions to investors. ELDG presale is ongoing"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-05T10:00:34.000Z",
    "title": "Worst Behind For BTC Price? Whales Accumulate Bitcoin, But It’s Not BlackRock",
    "url": "https://www.newsbtc.com/news/bitcoin/worst-behind-whales-accumulate-bitcoin-not-blackrock/",
    "description": "The Bitcoin price currently remains in a vulnerable position. Meanwhile, recent on-chain data suggests that Bitcoin whales are accumulating, but contrary to popular rumors, BlackRock isn&#8217;t among them. Meanwhile, analysts are divided on whether the worst is behind for Bitcoin&#8217;s price. Whales Accumulate Bitcoin, But It&#8217;s Not BlackRock On-chain analyst James V. Straten recently highlighted a trend in the accumulation score by cohort chart. He remarked, &#8220;Seems like peak Bitcoin distribution is behind us, as we can see a slight tick-up in accumulation. This is the most aggressive accumulation since June/July for whales that have over 10k BTC.&#8221; However, the waters are muddied by rumors surrounding BlackRock&#8217;s involvement. Speculation has been rife that BlackRock has been suppressing Bitcoin prices to buy cheap. But these claims are unfounded. &#8220;Many individuals don&#8217;t realize that BlackRock would require actual Bitcoin to back their Spot ETF. They might have already purchased their Bitcoin months ago when prices were lower,&#8221; is a statement that&#8217;s been debunked. The reality is that BlackRock, being a financial behemoth managing people&#8217;s money, undergoes audits every three months. This means they can&#8217;t hide Bitcoin purchases from auditors. If they were to invest in Bitcoin, it would be through an exchange-traded fund. Related Reading: Bitcoin Price Prediction For September 2023: What To Expect In fact, BlackRock has already shown interest in the space by investing in Bitcoin mining stocks and MicroStrategy as a proxy. Remarkably, BlackRock is a major shareholder in 4 out of the 5 largest Bitcoin mining companies. Is The Worst Behind For BTC Price? The Bitcoin price trajectory remains a topic of intense debate among analysts. Will Clemente, a prominent figure in the space, shared the chart below and commented, &#8220;From a high-time-frame valuation perspective, Bitcoin&#8217;s position is intricate. While it&#8217;s not overheated relative to historical values, there&#8217;s a tangible risk of retesting the lows akin to Q1 2020.&#8221; He further emphasized the prevailing market apathy, pointing to the lowest aggregated trading volume since 2020, the dwindling Google search trends for Bitcoin at multi year lows and realized volatility, implied volatility, weekly Bollinger Bands all near record lows. Joe Burnett of Blockware Solutions chimed in with a compelling observation, &#8220;A staggering 94.6% of all Bitcoin remained stationary in the last 30 days. We set a record high at August&#8217;s end, and this might soon be surpassed. Historically, bear markets conclude when supply dries up. A mere spark of demand could ignite the next explosive bull market.&#8221; Related Reading: How Bitcoin And Crypto Are Impacted By The Fed’s Growing War Chest: Report Crypto traders, too, are closely monitoring key levels. @DaanCrypto remarked the significance of the $26K-26.1K range as it marks the daily, weekly and monthly open, high volume node and weekly VWAP. Therefore, for bulls, it&#8217;s the line of action, and for bears, it&#8217;s the fortress to defend. Rekt Capital, a well-regarded crypto analyst, has been closely monitoring Bitcoin&#8217;s price action, especially in relation to its volume dynamics. He also highlights the significance of the $26,000 support level on the weekly chart, pointing out that Bitcoin&#8217;s price has been hovering around this mark even after retracing most of its gains from the previous Grayscale rally. However, the simultaneous decline in both buy-side and sell-side volumes is a cause for concern, suggesting a market that&#8217;s currently directionless. &#8220;The declining sell-side volume coupled with a lackluster buyer volume is concerning. Without a volume breakout, neither from sellers nor buyers, the market lacks momentum,&#8221; the analyst states. On the topic of the double top, a traditionally bearish pattern, Rekt Capital indicated that a breach below the $26,000 mark on the weekly chart could potentially send BTC tumbling towards $22,000. However, he also hinted at a silver lining: an inverse head and shoulders pattern observed earlier this year. If Bitcoin approaches the $24,000 mark, which serves as the neckline for this pattern, it could act as a robust support and possibly signal a bullish turnaround. At press time, BTC traded at $25,734. Featured image from Mike Doherty / Unsplash, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-05T10:00:21.000Z",
    "title": "Pepe (PEPE), ApeCoin (APE) and Pomerdoge (POMD) – Tokens That Will Return 10x Gains by the End of 2023",
    "url": "https://www.crypto-news-flash.com/pepe-pepe-apecoin-ape-and-pomerdoge-pomd-tokens-that-will-return-10x-gains-by-the-end-of-2023/",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T105553.575.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T105553.575.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T105553.575-300x200.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-2023-09-05T105553.575-104x69.png 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />After turbulent market trends, Pepe (PEPE), ApeCoin (APE), and Pomerdoge (POMD) are tokens that are very much on an upward trajectory. As a result, they have caught the attention of investors who have seen through their potential. Apart from their current performance, these tokens have unique use cases that distinguish them from other tokens. As [...]"
  }
]