[
  {
    "source": "Crypto Daily",
    "date": "2023-07-19T06:51:00.000Z",
    "title": "SEC Faces Deadlines For Spot ETF Applications As Pressure Mounts",
    "url": "https://cryptodaily.co.uk/2023/07/sec-faces-deadlines-for-spot-etf-applications-as-pressure-mounts",
    "description": "<p>The United States Securities and Exchange Commission is under pressure to accept spot Bitcoin ETF applications as deadline looms.</p>\n<p>They have already accepted BlackRock&rsquo;s refiled application sparking speculation that approval could be granted.</p>\nDeadline For Approvals On The Horizon\n<p>The clock has started ticking for the United States Securities and Exchange Commission (SEC) to approve or reject BlackRock&rsquo;s application for a spot Bitcoin exchange traded fund. According to the SEC&rsquo;s official calendar, BlackRock&rsquo;s application for a spot Bitcoin ETF will be published in the Federal Register and kickstart a 21-day comment period. The application has been added to the SEC docket as part of the rule change process.</p>\n<p>The development is a significant milestone for the application being considered by the Securities and Exchange Commission. The world&rsquo;s largest asset manager had submitted its original application in June. However, the Securities and Exchange Commission knocked back the application, prompting BlackRock to amend it. The updated application included a &ldquo;surveillance sharing&rdquo; provision with Coinbase, addressing one of the SEC&rsquo;s primary concerns with the initial application.</p>\nMore Bitcoin ETFs In The Pipeline\n<p>BlackRock has over $9.4 trillion in assets under management and is known for obtaining ETF approvals. As a result, the asset manager&rsquo;s initial application for a spot Bitcoin ETF sparked a rush of applications from other firms looking to do the same. If the ETF is approved, BlackRock customers will be able to invest in Bitcoin without having to hold the token. Instead, these assets can be traded on traditional stock markets. The Securities and Exchange Commission has already approved the first Bitcoin Futures ETF.</p>\n<p>The Securities and Exchange Commission also has to decide on other applications apart from BlackRock&rsquo;s for a spot Bitcoin ETF. These include Bitwise&rsquo;s Bitcoin ETP Trust&rsquo;s application which was included in the Federal Register on Tuesday. The other applications under consideration are WisdomTree Bitcoin Trust, VanEck Bitcoin Strategy ETF, Invesco Galaxy Bitcoin ETF, and Fidelity&rsquo;s Wise Origin Bitcoin Trust.</p>\n<p>The Securities and Exchange Commission had published documents for public consultation on Bitcoin ETFs last week. However, the review process officially starts when the filings are included in the Federal Register. The initial deadline for approval or rejection is 45 days but can be extended to 240 days. Additionally, there is no guarantee that the SEC would approve any of the applications filed. However, BlackRock&rsquo;s application has led to considerable optimism surrounding approval. Other applications have already hit the Federal Register, with the ARK 21Shares Bitcoin ETF included in the register on the 15th of May. However, the SEC extended the approval deadline in June. Meanwhile, Valkyrie&rsquo;s application for a spot Bitcoin exchange traded fund has not yet been listed on the Federal Register.</p>\nEurope&rsquo;s Spot Bitcoin ETF\n<p>While American regulators are still considering approval, Europe has moved ahead, with its highly anticipated and long-delayed spot Bitcoin exchange traded fund set to debut later this year. The ETF was filed by London-based multi-asset investment platform Jacobi Asset Management and was originally set to debut on the Euronext Amsterdam Exchange in July 2022. However, the launch was delayed indefinitely thanks to unfavorable market conditions caused by the collapse of the Terra ecosystem and the FTX exchange.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-19T06:52:56.000Z",
    "title": "China  21 high-stakes USDT scam suspects arrested ",
    "url": "https://www.cryptopolitan.com/china-21-usdt-scam-suspects-arrested/",
    "description": "In a major crackdown on cryptocurrency-related illegal activities, authorities in China&#8217;s Shanxi Province have arrested 21 individuals involved in an alleged money laundering scheme linked to USDT, a popular stablecoin pegged to the U.S. dollar. According to a report by China&#8217;s national broadcasting service, CCTV, the total value of the money laundering operation is estimated ... <a title=\"China  21 high-stakes USDT scam suspects arrested \" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-21-usdt-scam-suspects-arrested/\" aria-label=\"More on China  21 high-stakes USDT scam suspects arrested \">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-19T06:52:24.000Z",
    "title": "XRP Flexes Muscles: Ripple Token Unfazed By Crypto Turmoil With 68% Rally",
    "url": "https://www.newsbtc.com/news/xrp-flexes-muscles-ripple-token-unfazed-by-crypto-turmoil-with-60-rally/",
    "description": "Following Ripple&#8217;s victory against the United States Securities and Exchange Commission, a U.S. district court ruled that XRP was not a security; the token&#8217;s price has risen dramatically. Among the top 25 cryptocurrencies, the token native to the Ripple payment system had the best 24-hour performance. XRP has regained the number four spot by market capitalization, moving past Binance&#8217;s problematic BNB coin. Importantly, XRP held its ground, unaffected by the turmoil gripping the broader crypto market as the leading cryptocurrency Bitcoin threatens to lose its hold on the crucial $30,000 handle, and many altcoins begin the day in a sea of red. Related Reading: This Under-The-Radar Coin Just Beat The Top 100 Cryptocurrencies With 120% Explosion XRP is a cryptocurrency that Ripple employs to transfer funds internationally. With a market capitalization of $37.8 billion, it is the fifth-largest cryptocurrency in circulation. XRP Dominates The Weekly Timeframe According to crypto market tracker Coingecko data, XRP was trading at $0.817, an increase of nearly 10% over the previous 24 hours. At the time of writing, however, it was in the weekly timeframe that the token proved its worth, skyrocketing by nearly 68%. Source: Coingecko Bitcoin (BTC) and ether (ETH), the two largest cryptocurrencies by market capitalization, are currently trading below their psychologically significant price levels of $30,000 and $1,500, respectively. Although Bitcoin&#8217;s price has been fluctuating around the $30,000 mark recently, Jake Boyle, Chief Commercial Officer of Australian crypto exchange Caleb &#38; Brown, has stated that significant price changes are unlikely unless certain crucial events transpire. For the past three years, Ripple has fought the SEC on claims that the company and two of its executives made an illicit $1.3 billion in sales of XRP. Ripple has refuted these allegations, maintaining that XRP is more akin to a commodity than a security. XRP price movement in the weekly chart. Source: Coingecko. A Watershed Moment For Ripple The SEC Ripple lawsuit&#8217;s ruling was a significant moment for cryptocurrencies. Although XRP was deemed not a security, certain token sales were classified as securities transactions. This decision sheds light on the regulatory status and classification of cryptocurrencies by the SEC, impacting the entire industry. It may trigger discussions and lead to clearer regulations for digital assets, boosting investor confidence and fostering a more stable market. The ruling&#8217;s ripple effects (no pun intended) may extend globally, influencing other countries&#8217; regulatory approaches. XRP market cap currently at $41.5 billion on the daily chart: TradingView.com Related Reading: Elon Musk Fires Another Tweet – But Did It Lift Dogecoin Price? Regulatory Clarity A Must As the cryptocurrency ecosystem matures, regulatory clarity becomes crucial for striking a balance between innovation and consumer protection. Market participants will closely monitor how this ruling shapes the future of cryptocurrency regulation. Meanwhile, if the court had sided with the SEC, it might have established a negative precedent for treating other cryptocurrencies, opening the door to more stringent regulations and control. This would have repercussions for any venture with an initial coin offering (ICO) or token sale, including Ripple and XRP. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Muscle &#38; Fitness"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-19T07:04:57.000Z",
    "title": "Fundstrat’s Tom Lee Predicts Bitcoin Rally to $200,000, Says People Underestimating Impact of Spot BTC ETF",
    "url": "https://dailyhodl.com/2023/07/19/fundstrats-tom-lee-predicts-bitcoin-rally-to-200000-says-people-underestimating-impact-of-spot-btc-etf/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Tom-Lee-Predicts-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Tom-Lee-Predicts-Bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Tom-Lee-Predicts-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Tom-Lee-Predicts-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Tom-Lee-Predicts-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Tom-Lee-Predicts-Bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Tom-Lee-Predicts-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The managing partner of Fundstrat Global Advisors, Tom Lee, is making a six-figure prediction for Bitcoin (BTC). Lee says in a new CNBC interview that Bitcoin could explode by over 500% from the current level within five years. Asked to give a timeline for his price prediction, the Fundstrat managing partner says Bitcoin could surge [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/19/fundstrats-tom-lee-predicts-bitcoin-rally-to-200000-says-people-underestimating-impact-of-spot-btc-etf/\">Fundstrat’s Tom Lee Predicts Bitcoin Rally to $200,000, Says People Underestimating Impact of Spot BTC ETF</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]