[
  {
    "source": "Decrypt",
    "date": "2023-08-29T23:02:02.000Z",
    "title": "AI Policy 'Weaknesses' in UK Put Artists at Risk, MPs Warn",
    "url": "https://decrypt.co/154174/ai-policy-weaknesses-in-uk-put-artists-at-risk-mps-warn",
    "description": "British lawmakers say Rishi Sunak's government must heed the concerns of musicians, authors and artists over the future of their livelihoods."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-29T22:54:10.000Z",
    "title": "AI-Generated Books on Amazon Could Give Deadly Advice",
    "url": "https://decrypt.co/154187/ai-generated-books-on-amazon-could-give-deadly-advice",
    "description": "If people blindly follow AI guides into the forest, it's not going to end well."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-29T22:56:21.000Z",
    "title": "Tether adds Bahamas-based private bank Britannia as partner: Report",
    "url": "https://cointelegraph.com/news/tether-adds-bahamas-based-bank-britannia-as-new-partner",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/d7bd1a7d-e1e1-40d1-bdbf-1e7919b9543f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Tether’s reported new partnership with Britannia Bank makes it the third Bahamas-based bank to join forces with the stablecoin issuer. </p>\n                    <p><p>Tether, the stablecoin issuer behind <a href=\"https://cointelegraph.com/tether-price-index\">USDT,</a> has reportedly added Britannia Bank &amp; Trust, a private bank based in The Bahamas to process dollar transfers on its platform.</p><p>It is understood Tether has instructed clients to send money to Britannia’s bank account over the last few months, <a href=\"https://news.bloomberglaw.com/securities-law/stablecoin-issuer-tether-finds-another-bank-partner-in-bahamas?utm_source=rss&amp;amp%3Butm_medium=SLNW&amp;amp%3Butm_campaign=0000018a-431a-dfeb-a1eb-43da978f0003\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to an Aug. 29 report by Bloomberg, citing people familiar with the matter.</p><p>However, it isn’t clear when Tether’s banking relationship with Britannia Bank started, but its other reported banking partners include <a href=\"https://cointelegraph.com/news/controversial-stablecoin-tether-confirms-new-banking-partner-deltec-after-weeks-of-rumors\">Deltec Bank</a> and <a href=\"https://cointelegraph.com/news/tether-s-reported-bank-partner-capital-union-shares-its-crypto-strategy\">Capital Union Bank</a>.</p><p>In recent months, United States-based cryptocurrency firms have had to increasingly look offshore for banking partners amid increased scrutiny by U.S. regulators following the <a href=\"https://cointelegraph.com/news/ftx-collapse-the-crypto-industry-s-lehman-brothers-moment\">shock collapse of FTX in November.</a></p><p><a href=\"https://cointelegraph.com/news/tether-boasts-of-its-financial-stability-after-strong-profits-money-moved-out-of-banks\">Tether’s unwillingness to publicly disclose</a> the full extent of its balance sheet and banking relationships has also fueled industry FUD (an acronym for fear, uncertainty and doubt) in the past over how the stablecoin issuer stores its <a href=\"https://tether.to/en/transparency/#usdt\" target=\"_blank\" rel=\"noopener nofollow\">$86 billion</a> in assets.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/us-fed-increases-bank-oversight-on-crypto\"><strong><em>US Fed steps up oversight of banks' involvement with crypto firms </em></strong></a></p><p>Tether’s USDT currently dominates the stablecoin market, with its $82.9 billion market cap representing 66.5% of the total market, <a href=\"https://www.coingecko.com/en/categories/stablecoins\" target=\"_blank\" rel=\"noopener nofollow\">according </a>to CoinGecko.</p><p>USDT’s market cap rallied over 20% to $80 billion over the first four months of 2023 — amid the banking crisis involving <a href=\"https://cointelegraph.com/news/silvergate-capital-corporation-will-voluntarily-liquidate-silvergate-bank\">Silvergate Bank,</a> <a href=\"https://cointelegraph.com/news/signature-bank-failed-to-understand-risks-associated-with-crypto-fdic-chair\">Signature Bank</a> and <a href=\"https://cointelegraph.com/news/silicon-valley-bank-s-downfall-has-many-causes-but-crypto-isn-t-one\">Silicon Valley Bank</a> — but has since steadied out around the $80-82 billion since then.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/f8c342c8-7b85-4583-b7d0-7e836fea78eb.png\"  /><figcaption style=\"text-align: center;\"><em>USDT's change in market cap over the last 12 months. Source: CoinGecko</em></figcaption></figure><p><strong>Magazine: </strong><a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\"><strong><em>Unstablecoins: Depegging, bank runs and other risks loom</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-29T22:55:48.000Z",
    "title": "Google leans into AI by expanding Duet, integrating Meta’s Llama, and more",
    "url": "https://cryptoslate.com/google-leans-into-ai-by-expanding-duet-integrating-metas-llama-and-more/",
    "description": "<p>Google Cloud made several announcements related to artificial intelligence (AI) during its Next &#8217;23 conference and in a series of press releases published on Aug. 29. Thomas Kurian, CEO of Google Cloud, said at the event: &#8220;We are in an entirely new era of cloud, fueled by generative AI&#8230;our goal is to help companies use [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/google-leans-into-ai-by-expanding-duet-integrating-metas-llama-and-more/\">Google leans into AI by expanding Duet, integrating Meta&#8217;s Llama, and more</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-29T23:00:27.000Z",
    "title": "UniLend Finance Empowers Community Governance with the Launch of UFTG Token",
    "url": "https://news.bitcoin.com/unilend-finance-empowers-community-governance-with-the-launch-of-uftg-token/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/3243-4v-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/3243-4v-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/3243-4v-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/3243-4v-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/3243-4v-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/3243-4v-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/3243-4v-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/3243-4v.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. UniLend Finance, a leading decentralized finance (DeFi) protocol is thrilled to announce the launch of its new wrapped governance token, UFTG (UniLend Finance Governance Token) as the revolutionary protocol approaches closer to Governance launch on 4th September. This groundbreaking token signifies UniLend’s commitment to community-driven decision-making and plays a pivotal role in making [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-29T23:00:15.000Z",
    "title": "Shiba Inu Community Celebrates New Milestone One Day After Shibarium Goes Public",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-shibarium-public/",
    "description": "Shiba Inu’s (SHIB) community’s resolution was tested following Shibarum’s launch, as the network didn’t get off to the best start, dragging SHIB’s price down in the process. However, the community’s faith didn’t waiver, and now, it is in celebratory mode as Shibarium marks a major milestone just a day after its relaunch. Shibarium Wallets Cross 100,000 Members of the SHIB community have stormed social media to celebrate this major milestone, with many users on the X (formerly Twitter) platform posting several tweets in this regard with the hashtag “#SHIBARMYSTRONG.” Related Reading: Bloomberg Expert Analyst Explains Why A Fall To $10,000 Isn’t Bad For Bitcoin According to data from block explorer Shibariumscan, over 100,000 wallets have been created on the Shibarium network since going live. This figure signifies an increase of over 35,000 wallets created since Shibarium relaunched yesterday. Shibarium’s lead developer, Shytoshi Kusama, announced on August 28 that the network was ready for “prime time” and that the network was going to be reopened to the public. As part of the announcement, he noted that Shibarium had accumulated over 65,000 wallets before the relaunch.  Since then, new users have flocked to the network, with the total number of wallet addresses on the network standing at around 101,658 (at the time of writing). That represents more than a 50% increase in the number of users on the network since it relaunched.  This figure may not surprise the SHIB community, considering that Kusama had earlier credited them for the “massive influx of transactions and users” that overwhelmed the network upon launch.  Such a milestone suggests that the SHIB community remains bullish on the layer-2 network despite the difficulties it experienced upon launch. Shibarium is projected to become a major player in the decentralized finance (DeFi) space as demand for the network increases.  The network’s success is also expected to significantly impact the Shiba Inu token, considering that it is one of the governance tokens on the network. As such, its value should rise as trading activity on Shibarium increases. SHIB recovers above $0.000008 &#124; Source: SHIBUSD on Tradingview.com More To Come, Says Shiba Inu Lead Dev In his update on Shibarium’s restart, Kusama noted that there was more to come for the network as it continues to build. He further stated that the team would keep providing Shibarium updates on their official channels. As part of these updates, Kusama announced on their official Telegram channel that the official WBone will be launched shortly, stating that the contract verification “should be up early this week.” He also mentioned that there are plans to renounce BONE’s token contract. BONE is one of the governance tokens on the Shibarium network. With this development, the token’s developer will no longer be able to make future changes in a move that strengthens holders’ confidence. Related Reading: Binance Will Halt These 39 Liquidity Mining Pools This Week Shibaswap, Shiba Inu’s decentralized exchange (DEX), will also be moved to Shibarium. The DEX is currently built on the Ethereum network. This marks part of the efforts to move all Shiba Inu-related products to the layer-2 network.  Kusama noted that Shibarium was still “very early” and had a long way to go. However, he will continue to focus on “building decentralized systems and showcasing projects.” Featured image from iStock, chart from Tradingview.com"
  }
]