[
  {
    "source": "Cointelegraph",
    "date": "2023-08-11T13:49:19.000Z",
    "title": "Hong Kong securities regulator issues in-principle approval to HKVAX",
    "url": "https://cointelegraph.com/news/hong-kong-regulator-hkvax-in-principle-approval",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/87f05641-33f4-4ceb-9e5f-ab5ea27d79c7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The announcement comes after Hong Kong debuted crypto retail trading with exchanges HashKey and OSL. </p>\n                    <p><p>Hong Kong’s Securities and Futures Commission (SFC) has issued an in-principle approval to Hong Kong Virtual Asset Exchange (HKVAX) to operate a virtual asset trading platform under the region’s securities laws. </p><p>On Aug. 11, HKVAX <a href=\"https://www.hkvax.com/news/detail?diffId=1673250247927656448\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> that it had received an “approval-in-principle” from the SFC to carry out Type 1 and Type 7 regulated activities. The announcement highlighted that a Type 1 license allows the platform to operate a digital asset trading platform that deals with securities, while a Type 7 officially allows the company to provide automated trading services to retail users and institutional investors. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/f7e74f3d-e061-449a-ad5e-bf2b167dbf21.png\"  /><figcaption style=\"text-align: center;\"><em>Types of regulated activities by the Securities and Futures Commission. Source: SFC</em></figcaption></figure><p>According to the announcement, HKVAX is aiming to offer a product category called security token offerings to leverage Web3 investment opportunities. Once the exchange receives the final approval, it noted that it will offer over-the-counter (OTC) brokerage that allows users to trade between fiat and digital assets, an institutional-grade exchange platform and an insured custody solution. </p><p>Anthony Ng, co-founder and CEO of HKVAX, said in the announcement that as the exchange grows, it will continue to expand its product offerings in Hong Kong and work with strategic investors for its next funding rounds. </p><p>HKVAX’s announcement comes after Hong Kong <a href=\"https://cointelegraph.com/news/crypto-hong-kong-debuts-retail-crypto-trading-with-hash-key-exchange\">debuted crypto retail trading</a> with exchanges HashKey and OSL. On Aug. 3, both firms became the first to obtain the necessary licenses to offer crypto trading services in Hong Kong. </p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/hong-kong-securities-regulator-warns-criminal-activity-unlicensed-exchanges\"><strong>Hong Kong securities regulator warns of ‘criminal’ activity by unlicensed exchanges</strong></a></em></p><p>Hong Kong regulators have recently been focused on regulating crypto since the FTX collapse. On June 24, SFC CEO Julia Leung Fung-yee said that crypto trading is an important part of the virtual asset ecosystem after the FTX exchange collapse in 2022. In a speech, Leung said that the new licensing system for virtual asset service providers will <a href=\"https://cointelegraph.com/news/crypto-trading-is-important-virtual-asset-ecosystem-hong-kong-sfc-chief\">ensure that investors are protected</a> as they trade. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/chinas-blockchain-satellite-in-space-hong-kongs-mcnuggets-metaverse-asia-express/\"><strong><em>China’s blockchain satellite in space, Hong Kong’s McNuggets Metaverse: Asia Express</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-11T13:45:00.000Z",
    "title": "TradFi shifts perspectives on crypto assets",
    "url": "https://cointelegraph.com/innovation-circle/tradfi-shifts-perspectives-on-crypto-assets",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/52710edd-7579-4f1c-9db4-6d6e70008eac.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>But again, there was a progression where the analog versions of this entertainment content were with us. So, many of us in the older crowd have grown to accept that progression.</p>\n                    <p><p>Recently, Larry Fink, the CEO of BlackRock asset management fund, <a href=\"https://www.cnbc.com/2023/07/14/blackrock-has-a-responsibility-to-democratize-investing-including-in-crypto-larry-fink-says.html\">talked</a> about crypto in an interview on CNBC. He said that crypto “has a differentiating value versus other asset classes, but more importantly, because it’s so international, it’s going to transcend any one currency.”</p> <p>BlackRock is now the world’s largest asset management fund, with over $9 trillion in assets. Fink himself was a crypto and Bitcoin skeptic as recently as 2017 when he was <a href=\"https://www.coindesk.com/consensus-magazine/2023/07/07/thank-blackrocks-clients-for-larry-finks-change-of-heart/#:~:text=2017%20that%20Bitcoin%20was%20an,hedges%20and%20geopolitical%20risk%20hedges.\">quoted</a> as saying that Bitcoin was simply an “index for money laundering.” He was insinuating that the more people who wanted to launder money (they would use Bitcoin), the more the price would shoot up. </p> <p>But fast forward to mid-2023 and he and others in TradFi are now singing a different tune. Not only that, but he sees crypto’s potential to democratize investing. Right now, in this age of artificial intelligence, we still have rules where only accredited investors with several hundred thousand dollars are allowed to invest in certain asset classes for their protection.</p> <p>The 2017 view of Fink was pretty much in the same mold as the pronouncements of Warren Buffett, Jaime Dimon, Elizabeth Warren and even Bill Gates. What these people have in common is that they are mainly from the Baby Boomer or Gen-X generation. This is significant because a lot of us who grew up during those post-World War II years often associate assets or things of value we can hold on to and sell for a higher price, with things that we can hold in our hand or physically touch. Assets to us include cars, houses, fine art, jewelry, precious metals and collectibles like watches, stamps, coins, etc. </p> <p>Although bonds and stocks are now digital, many in the older crowd still associate those with the paper certificates that came along with them, including the nicely designed intricate artwork, fonts and paper we could admire. In that sense, these still fell in the realm of “physical assets” in our brains even if these have been in digital form for some time.</p> <p>In terms of music and movies, we used to own LPs, 8-tracks, cassette tapes, CDs and DVDs which often had nice album cover designs that we could collect, admire and display on our living room shelves along with our expensive Hi-Fi systems. The arrival of MP3 and MP4 audio and video formats sort of eased us into the digital asset domains, but these are either sold for trivial amounts (like $0.99 per song) or streamed on Spotify, Netflix, HBO and the like. But again, there was a progression where the analog versions of this entertainment content were with us. So, many of us in the older crowd have grown to accept that progression.</p> <p class=\"has-black-color has-text-color has-background\" style=\"background-color: #fabf2c;padding: 20px 30px\">Join the community where you can transform the future. Cointelegraph Innovation Circle brings blockchain technology leaders together to connect, collaborate and publish. <strong><a href=\"https://circle.cointelegraph.com/learn-more?utm_campaign=Coin&_ga=2.123197772.699257063.1649682515-719256619.1645538730\" target=\"_blank\" rel=\"noopener\">Apply today</a></strong></p> <p>But digital assets like crypto and Bitcoin were totally digital from the day these were introduced, and hence have no analog counterpart. This throws off many from the Baby Boomer and Gen-X generations. They just can’t accept that an asset can purely be digital.</p> <p>Here’s what we all realize eventually though. Even Fink probably came to this realization. Those who have grown up in the purely digital world are coming of age and entering the workforce. Their life experience has not included rotary dial pay phones, LPs, CDs and cassettes. Instead, they’ve grown up with Spotify, Netflix, AirBNB, Uber and other digital services. So why should assets be any different? Why should money for example just be limited to the legal tender that Uncle Sam issues as currency? These are questions that the younger generations may be asking without the baggage of analog counterparts.</p> <p>So when Fink and BlackRock say that crypto may eventually transcend any one currency, they are not trying to be controversial. They simply recognize the age-old cycle of a new technology that comes in, gets adopted by a younger more adventurous class of people and then spreads to the rest of society.</p> <p>If as a Boomer or a member of Gen-X you are having a hard time grasping the concept of digital assets, think of the songs or films in digital format on your hard drive or even on streaming. You wouldn’t think these would have no value because these are digital right? </p> <p>Another way to think of it is a valuable baseball card. Someone skilled enough could counterfeit it, but you would know that the value is with the real thing, not the fake. If an NFT is digitally guaranteed to have only one copy whose ownership gets transferred to the buyer, then other similar-looking NFTs not issued by the artist are also fakes, right? In fact, the digital ownership of the artwork can’t be contested because it’s on the blockchain.</p> <p>We’ve seen it with the airplane, the automobile, the personal computer and the internet. Some in TradFi now realize it too, and if we don’t pay attention, we may be one of those still wanting to listen to music on a turntable or make phone calls from a payphone.</p> <p><em>The information provided here is not investment, tax or financial advice. You should consult with a licensed professional for advice concerning your specific situation.</em></p> <p><em><a href=\"http://www.zain-ventures.com/\">Zain Jaffer</a> is the CEO of Zain Ventures focused on investments in Web3 and real estate.</em></p> <div class=\"wp-block-columns\"> <div class=\"wp-block-column\" style=\"flex-basis:100%\"> <hr class=\"wp-block-separator\" /> </div> </div> <p><em>This article was published through Cointelegraph Innovation Circle, a vetted organization of senior executives and experts in the blockchain technology industry who are building the future through the power of connections, collaboration and thought leadership. Opinions expressed do not necessarily reflect those of Cointelegraph.</em></p> <p><a href=\"https://circle.cointelegraph.com/\"><em><strong>Learn more about Cointelegraph Innovation Circle and see if you qualify to join</strong></em></a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-11T14:00:00.000Z",
    "title": "Binance’s $5M CRV Investment: Fortifying DeFi",
    "url": "https://cryptodaily.co.uk/2023/08/binance-5m-usd-crv-investment-fortifying-defi",
    "description": "<p>Binance Labs, the venture capital and incubation division of Binance, has plunged $5 million into the Curve DAO Token (CRV), cementing its stance in the DeFi realm.&nbsp;</p>\nSupport From Industry Bigwigs\n<p>The $5 million investment from Binance Labs in the CRV token is part of a strategic deal under which Curve will explore deployment to the BNB Chain. With $2.4 billion in total value locked (TVL) and a daily volume of $215 million, Curve is the second-largest decentralized exchange (DEX).&nbsp;</p>\n<p>CRV, the Ethereum-based utility token of the Curve DeFi protocol, serves as a linchpin for exchanging stablecoins and other ERC-20 tokens, alongside staking, boosting, and governance voting.</p>\n<p>The DeFi platform was recently hit by a severe re-entrancy exploit that robbed it of over $60 million worth of funds from its liquidity pools. It affected Curve even further as several exchanges withdrew their support for the CRV token from their platforms. Binance Labs&rsquo; investment in the CRV token has somewhat reversed that effect, acting as a vote of confidence.&nbsp;</p>\n<p>The platform has also received support from other crypto bigwigs, like Justin Sun and DCF God.&nbsp;</p>\nBinance Labs' Forward-Thinking Approach\n<p>Yi He, Co-Founder of Binance and Head of Binance Labs, underscored the partnership's significance, stating,&nbsp;</p>\n\n<p>\"Curve is the largest stableswap, and as a key protocol in DeFi, it has contributed to the steady growth of the space in 2023. Binance Labs has offered our full support to Curve through our investment and strategic collaboration. We view this cooperation as a starting point and look forward to working together to further propel the growth of the DeFi ecosystem.\"</p>\n\nStrategic Amalgamation for BNB Chain Boost\n<p>Curve's multi-chain presence, capitalizing on speed and cost efficiency, is set to expand with its planned deployment to BNB Chain. This strategic move aims to bolster the growth of the BNB Chain DeFi ecosystem, amplifying its influence in the DeFi landscape.&nbsp;</p>\n<p>Curve founder Michael Egorov noted,&nbsp;</p>\n\n<p>\"BNB Chain has earned a significant presence in DeFi, and is well positioned to deploy Curve's current and future products on its chain. We look forward to collaboratively fostering innovation and growth across the DeFi ecosystem.\"</p>\n\n<p>The integration of Curve onto the BNB Chain will enhance scalability paving the way for handling more transactions and catering to the escalating user demand. Additionally, the alluring prospect of reduced transaction fees on BNB Chain serves as a magnet for cost-conscious users, solidifying the appeal of Curve.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T14:08:13.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T13:55:37.000Z",
    "title": "How to find BEP-20 wallet address on Trust Wallet & Metamask",
    "url": "https://www.cryptopolitan.com/bep-20-wallet-address-trust-wallet-metamask/",
    "description": "Similar to Ethereum’s ERC-20, all smart contract blockchains have a stipulated token standard that informs the creation, issuance, and deployment of native tokens. BEP-20 is the token standard used on BNB Chain (previously known as Binance Smart Chain).  Whether you intend to receive, trade, or store any token on the BNB Chain, you will need ... <a title=\"How to find BEP-20 wallet address on Trust Wallet &#038; Metamask\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bep-20-wallet-address-trust-wallet-metamask/\" aria-label=\"More on How to find BEP-20 wallet address on Trust Wallet &#038; Metamask\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T13:41:33.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-08-11T14:00:48.000Z",
    "title": "Bitcoin Spark reduces barrier of entry that Bitcoin and Dogecoin have",
    "url": "https://nulltx.com/bitcoin-spark-reduces-barrier-of-entry-that-bitcoin-and-dogecoin-have/",
    "description": "Mining cryptocurrency has never been easy. Apart from strict regulations in the sector, most cryptos have a huge barrier of entry to mining, especially major coins such as Bitcoin and Dogecoin. Bitcoin is the first and largest cryptocurrency in the world. It uses the Proof-of-Work (PoW) consensus mechanism to verify and validate transactions on the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-11T14:00:08.000Z",
    "title": "San Francisco’s SoFi Bank Reveals Significant Holdings In BTC, ETH, And DOGE",
    "url": "https://www.newsbtc.com/analysis/btc/sofi-bank-holdings-in-btc-eth-doge/",
    "description": "San Francisco’s SoFi Bank, a rising financial institution with 6.2 million customers, has unveiled its substantial cryptocurrency holdings, demonstrating a proactive embrace of the evolving digital asset landscape.  BTC, ETH, and DOGE Lead the Way A recent report shows that the bank&#8217;s second-quarter earnings totaled $170 million in various cryptocurrencies, including Bitcoin (BTC), Ethereum (ETH), and Dogecoin (DOGE). Related Reading: Bittrex, SEC Reach Settlement In Securities Violation Case Among its cryptocurrency investments, SoFi Bank boasts $82 million worth of Bitcoin, solidifying its position in ‘digital gold.’ Ethereum follows closely, with $55 million, showcasing the bank&#8217;s belief in the blockchain&#8217;s potential.  The meme-inspired Dogecoin takes the third spot with $5 million, while Cardano secures the fourth place with $4.5 million. The bank also diversifies with digital assets like Solana (SOL), Litecoin (LTC), and Ethereum Classic (ETC). SoFi Bank's crypto holdings &#124; Source: X SoFi Bank&#8217;s unique proposition lies in its commitment to fee-free cryptocurrency investments, allowing customers to allocate a portion of their direct deposits to digital assets.  The bank further incentivizes newcomers by offering a $100 crypto bonus upon registration. With a minimum investment threshold as low as $10, the platform fosters accessibility to a variety of cryptocurrencies beyond Bitcoin. While SoFi Bank&#8217;s innovative approach to cryptocurrency has garnered attention, it faces regulatory scrutiny, particularly from the United States Federal Reserve. The regulatory body has raised concerns over the bank&#8217;s involvement in crypto-related activities, requiring alignment with established policies. The bank has been given until January 2024 to ensure compliance, a process that involves navigating regulatory capital treatment intricacies. Founded in 2011, SoFi Bank transitioned from its status as a non-bank entity in 2019 to a fully-fledged financial institution the following year. BTC price falls to $29,300 &#124; Source: BTCUSD on Tradingview.com Strategic Growth And Financial Success The earnings report highlights SoFi Bank&#8217;s business acumen, reflected in its strong second-quarter performance. With a remarkable 37% surge in revenue ($498 million) compared to the previous year, the bank showcases its ability to thrive amidst a rapidly evolving financial landscape. SoFi Technology Stock also witnessed a 17% surge in July following its Q2 report. &#8220;As a result of this growth in high-quality deposits, we have benefited from a lower cost of funding for our loans,” SoFi CEO Anthony Noto said. Related Reading: New Milestone For Ethereum Could Spell Good News For ETH Price SoFi is not the only bank that has made its way into cryptocurrencies. Major US banks like Wells Fargo, JP Morgan, and Goldman Sachs, among others, have also taken the plunge to provide access to digital assets and cryptocurrencies for their clients. Other notable entrants into the industry include BlackRock and ARK Invest, which have filed applications for Spot Bitcoin ETFs with the SECs. On August 13, the first of these, the ARK Invest application, will be deliberated on to be approved or rejected by the SEC. However, the regulator could also end up extending the deadline. Featured image from BitIRA, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-11T14:07:35.000Z",
    "title": "Unleashing Unrivaled ROI: The Epic Showdown Between Sandbox (SAND) and Pikamoon (PIKA) Investment",
    "url": "https://www.crypto-news-flash.com/unleashing-unrivaled-roi-the-epic-showdown-between-sandbox-sand-and-pikamoon-pika-investment/?utm_source=rss&utm_medium=rss&utm_campaign=unleashing-unrivaled-roi-the-epic-showdown-between-sandbox-sand-and-pikamoon-pika-investment",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-10.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-10.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-10-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-10-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Every investor knows that the crypto market is at a point where only strategic and well-researched investment decisions will survive. Preparing for the bull run and surviving the present bear run means you only need investments that will offer unmatched ROI. Here, we review investing in Sandbox (SAND) and Pikamoon (PIKA) to discover which would [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-11T14:03:06.000Z",
    "title": "HUAWEI CLOUD Expands Web3 Market with Ethereum and TRON Node Engine Updates – Report",
    "url": "https://www.crypto-news-flash.com/huawei-cloud-expands-web3-market-with-ethereum-and-tron-node-engine-updates-report/?utm_source=rss&utm_medium=rss&utm_campaign=huawei-cloud-expands-web3-market-with-ethereum-and-tron-node-engine-updates-report",
    "description": "<img width=\"1920\" height=\"1296\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Huawei.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Huawei.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Huawei-300x203.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Huawei-1024x691.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Huawei-768x518.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Huawei-1536x1037.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Huawei-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Huawei Cloud is strengthening its position in the Web3 ecosystem, with a major update to its Web3.0 Node Engine Service. The new development comes not long after the launch of Node Engine Service (NES), which currently supports Ethereum and Tron.  Huawei, a leading information and communication technology company based in China, is expanding its reach. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-11T13:49:34.000Z",
    "title": "Empowering Banking Services for Those Who Need It Most",
    "url": "https://www.crypto-news-flash.com/empowering-banking-services-for-those-who-need-it-most/?utm_source=rss&utm_medium=rss&utm_campaign=empowering-banking-services-for-those-who-need-it-most",
    "description": "<img width=\"512\" height=\"307\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-14.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-14.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-14-300x180.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-14-336x200.png 336w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Across the globe, billions of individuals remain unbanked, unable to access baking services and store their finances in a safe manner. The vast majority of the 1.4 billion unbanked population are women, people living in poorer countries, and those living in rural areas. Even in developing economies, only around 74% of men and an even [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-11T13:46:00.000Z",
    "title": "Court Files Ripple’s Jury Trial: Crypto Attorney Assures XRP’s Status",
    "url": "https://coinedition.com/court-files-ripples-jury-trial-crypto-attorney-assures-xrps-status/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Its_simply_a_matter_of_simple_facts_The_judge_ruled_on_the_question.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Its_simply_a_matter_of_simple_facts_The_judge_ruled_on_the_question.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Its_simply_a_matter_of_simple_facts_The_judge_ruled_on_the_question-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Its_simply_a_matter_of_simple_facts_The_judge_ruled_on_the_question-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Its_simply_a_matter_of_simple_facts_The_judge_ruled_on_the_question-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Its_simply_a_matter_of_simple_facts_The_judge_ruled_on_the_question-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Its_simply_a_matter_of_simple_facts_The_judge_ruled_on_the_question-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Its_simply_a_matter_of_simple_facts_The_judge_ruled_on_the_question-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Its_simply_a_matter_of_simple_facts_The_judge_ruled_on_the_question-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Its_simply_a_matter_of_simple_facts_The_judge_ruled_on_the_question-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Its_simply_a_matter_of_simple_facts_The_judge_ruled_on_the_question-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Its_simply_a_matter_of_simple_facts_The_judge_ruled_on_the_question-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Its_simply_a_matter_of_simple_facts_The_judge_ruled_on_the_question-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Its_simply_a_matter_of_simple_facts_The_judge_ruled_on_the_question-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Its_simply_a_matter_of_simple_facts_The_judge_ruled_on_the_question-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Its_simply_a_matter_of_simple_facts_The_judge_ruled_on_the_question-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Its_simply_a_matter_of_simple_facts_The_judge_ruled_on_the_question-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>CryptoLaw, the crypto regulatory news platform, run by the XRP pro attorney John E Deaton, recently shared a Twitter post, commenting on the jury trial scheduled by the court to oversee the long-held SEC-Ripple legal war. The Securities and Exchange Commission (SEC) filed a lawsuit against the crypto platform Ripple Labs in 2020, alleging that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/court-files-ripples-jury-trial-crypto-attorney-assures-xrps-status/\">Court Files Ripple’s Jury Trial: Crypto Attorney Assures XRP’s Status</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]