[
  {
    "source": "CoinDesk",
    "date": "2023-10-02T18:40:08.000Z",
    "title": "Fed Report: Silvergate Bank Got Fatally Ensnared in Crypto While Examiners Shrugged",
    "url": "https://www.coindesk.com/policy/2023/10/02/fed-report-silvergate-bank-got-fatally-ensnared-in-crypto-while-examiners-shrugged/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Silvergate Bank transformed from a community lender to a high-flying crypto bank without its Federal Reserve examiners raising an alarm, according to a report from the Federal Reserve’s Office of Inspector General (OIG), allowing the bank to take risks that would turn fatal."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-02T19:07:01.000Z",
    "title": "Generative AI Concentrates in Key Metro Areas Raising Concerns of Inequality",
    "url": "https://www.cryptopolitan.com/gen-ai-concentrates-in-key-metro-areas/",
    "description": "New data reveals that the growth of generative AI is concentrated in a few key metro areas, prompting discussions on the need for intervention to promote a more inclusive AI landscape. The generative AI landscape is experiencing rapid growth, with numerous entrepreneurs, investors, and tech thinkers anticipating its winners. However, recent data suggests that despite ... <a title=\"Generative AI Concentrates in Key Metro Areas Raising Concerns of Inequality\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gen-ai-concentrates-in-key-metro-areas/\" aria-label=\"More on Generative AI Concentrates in Key Metro Areas Raising Concerns of Inequality\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-02T19:00:46.000Z",
    "title": "Pro-XRP Lawyer Reveals The Impact Of SEC’s Lawsuit Against Ripple",
    "url": "https://www.newsbtc.com/analysis/xrp/pro-xrp-lawyer-sec-ripple/",
    "description": "A pro-XRP lawyer has highlighted more casualties and negative impacts the regulatory authority has inflicted on XRP and its investors as well as individuals and businesses associated with the cryptocurrency.  So while Ripple has stated it has lost over $200 million in its fight against the US SEC, it seems that is not the only loss that has been incurred in the drawn-out battle.  SEC Allegedly Damaged 75K XRP Followers John E. Deaton, a pro-XRP lawyer has taken to X (formerly Twitter) to publicly admonish the United States Securities and Exchange Commission (SEC) for its series of legal actions and enforcements against XRP, the native token of Ripple Labs.  Related Reading: Crypto CEO Very Bullish On XRP Price, Sets Make Or Break Point Deaton has been a strong advocate for XRP since its fight against the US SEC began in 2020, and the cryptocurrency enthusiast and lawyer has actively participated in the community, airing out his views in defense of the cryptocurrency and its value as a global payment asset.  In a recent post, Deaton stated that the US SEC has negatively affected thousands of XRP investors and users and these people have been protesting against the SEC’s actions toward the ecosystem for three years. “The SEC harmed a lot of innocent people in the process. 75K investors, users, developers, and small businesses have been screaming the above for 3 years,” Deaton stated.  According to a civil filing, the SEC has destroyed more than $15 billion worth of assets owned by innocent holders of XRP who had acquired the token on secondary marketplaces. Ripple And SEC Legal Battle Developments RealClearPolicy (RCPC), an American policy website, recently published an article titled “The SEC is not King” on Thursday, September 30.  In an X repost, Deaton acknowledged the article which highlighted significant aspects of the Ripple and SEC legal case from when the regulatory body filed a lawsuit against the crypto firm earlier in 2020, alleging that Ripple was selling unregistered security offerings.  Ripple had aggressively defended itself against the SEC and achieved a partial victory after Judge Analisa Torres ruled in favor of Ripple and rejected the SEC’s allegations that sales of XRP tokens on exchanges are security sales.  In a possible attempt to salvage its reputation and also gain the upper hand against XRP, the SEC filed an interlocutory appeal to reevaluate the Judge’s ruling and its case against the token. In light of this, Deaton published a blog post titled “The Irony of Interlocutory Appeal” last week, castigating the SEC’s appeal scheme to potentially delay the litigation. Related Reading: XRP Price Threatened As Ripple Unlocks 1 Billion Coins The US SEC has also been struck by a blow that may put a dent in its case with XRP. The defense team of Ripple recently exposed a pile of internal SEC documents and secret positions about the token which could significantly undermine the SEC’s argument that XRP should be treated as a security.  This recent development has thrown a curveball in the ongoing legal battle between the US SEC and XRP, raising questions about the SEC’s intentions for the crypto industry and its method of handling cryptocurrencies. Token price shows strength to kick off new week &#124; Source: XRPUSD on Tradingview.com Featured image from Bitcoin News, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-02T19:08:42.000Z",
    "title": "Shiba Inu Could Surge 422% in October: Historical Data Reveals",
    "url": "https://www.crypto-news-flash.com/shiba-inu-could-surge-422-in-october-historical-data-reveals/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-could-surge-422-in-october-historical-data-reveals",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T093610.708.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shiba Inu\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T093610.708.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-21T093610.708-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Shiba Inu historically registered significant gains in October, with data from CryptoRank reinforcing this trend. Shibarium, Shiba Inu&#8217;s layer-2 blockchain, shows growth in transactions and staking, although it faced initial challenges. As the calendar page turns to October, the financial world is abuzz about the potential performance of Shiba Inu. This token could witness another [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-02T19:00:06.000Z",
    "title": "Analyst: The Bear Market Is In The Last Phase, Time To Accumulate $QUBE And Top-Tier Altcoins",
    "url": "https://www.crypto-news-flash.com/analyst-the-bear-market-is-in-the-last-phase-time-to-accumulate-qube-and-top-tier-altcoins/?utm_source=rss&utm_medium=rss&utm_campaign=analyst-the-bear-market-is-in-the-last-phase-time-to-accumulate-qube-and-top-tier-altcoins",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />As the bear market draws to a close, now is the time to explore platforms like InQubeta, a game-changing AI startup funding platform driven by the deflationary $QUBE token, and investigate the potential of top-tier altcoins like Ethereum and Binance Coin. This article unlocks the exciting world of alternative crypto investments. Analyst: The Bear Market [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-02T18:45:07.000Z",
    "title": "DOJ Says Agency Will Call Sam Bankman-Fried’s Coconspirators Who Entered Guilty Pleas To Witness Stand",
    "url": "https://dailyhodl.com/2023/10/02/doj-says-agency-will-call-sam-bankman-frieds-coconspirators-who-entered-guilty-pleas-to-witness-stand/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/Says-FTX-US-Users-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/Says-FTX-US-Users-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/Says-FTX-US-Users-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/Says-FTX-US-Users-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/Says-FTX-US-Users-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/Says-FTX-US-Users-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/Says-FTX-US-Users-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The U.S. Department of Justice (DOJ) says that the coconspirators of FTX co-founder Sam Bankman-Fried who have already pleaded guilty will be called to the witness stand during litigation against the disgraced former billionaire. In new court documents, the US government tells Judge Kaplan that it anticipates questioning several types of witnesses, including FTX customers [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/02/doj-says-agency-will-call-sam-bankman-frieds-coconspirators-who-entered-guilty-pleas-to-witness-stand/\">DOJ Says Agency Will Call Sam Bankman-Fried’s Coconspirators Who Entered Guilty Pleas To Witness Stand</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-02T18:41:58.000Z",
    "title": "Crypto Markets Rise As Ethereum Futures ETFs From VanEck, ProShares and Bitwise Launch",
    "url": "https://dailyhodl.com/2023/10/02/crypto-markets-rise-as-ethereum-futures-etfs-from-vaneck-proshares-and-bitwise-launch/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/Massive-Profit-Selling-Ethereum.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/Massive-Profit-Selling-Ethereum.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/03/Massive-Profit-Selling-Ethereum.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/03/Massive-Profit-Selling-Ethereum.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/03/Massive-Profit-Selling-Ethereum.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/03/Massive-Profit-Selling-Ethereum.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/03/Massive-Profit-Selling-Ethereum.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto markets are spiking as the launch of three major Ethereum (ETH) futures exchange-traded funds (ETFs) debut. Announcements today from VanEck, ProShares and Bitwise confirm the launches of futures ETFs based on the price of ETH. Says ProShares’ CEO Michael L. Sapir, &#8220;We have seen substantial demand from investors for access to the performance of cryptocurrencies through ETFs with [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/02/crypto-markets-rise-as-ethereum-futures-etfs-from-vaneck-proshares-and-bitwise-launch/\">Crypto Markets Rise As Ethereum Futures ETFs From VanEck, ProShares and Bitwise Launch</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]