[
  {
    "source": "CryptoGlobe",
    "date": "2023-06-20T22:29:00.000Z",
    "title": "$ADA: Crypto Analyst Predicts Prolonged Downtrend for Cardano",
    "url": "https://www.cryptoglobe.com/latest/2023/06/ada-crypto-analyst-predicts-prolonged-downtrend-for-cardano/",
    "description": "In a bearish forecast for the cryptocurrency Cardano ($ADA), popular digital currency analyst Benjamin Cowen suggested that the digital asset could continue to languish for the remainder of the year before bottoming out. During a recent strategy discussion, Cowen drew on historical market trends to suggest that Cardano may not hit its nadir until 2023 […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T22:16:47.000Z",
    "title": "Elon Musk’s legal team undergoes changes amid market manipulation lawsuit",
    "url": "https://www.cryptopolitan.com/elon-musks-legal-team-undergoes-changes/",
    "description": "In a recent development, it has been revealed that Tesla’s founder and CEO, Elon Musk, has experienced a change in his in-house legal team. According to a document filed in federal court, one of the company’s leading litigators, Adam Gabor Mehes, has motioned to withdraw counsel in Musk’s $258 billion lawsuit relating to an alleged ... <a title=\"Elon Musk’s legal team undergoes changes amid market manipulation lawsuit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/elon-musks-legal-team-undergoes-changes/\" aria-label=\"More on Elon Musk’s legal team undergoes changes amid market manipulation lawsuit\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-20T22:11:40.000Z",
    "title": "Polygon unveils game-changing security upgrade",
    "url": "https://www.cryptopolitan.com/polygon-unveils-security-upgrade/",
    "description": "Polygon co-founder Mihailo Bjelic has recently proposed a significant upgrade to the Polygon proof-of-stake (PoS) network, aiming to enhance its security and scalability. In a forum post on June 20, Bjelic suggested implementing a &#8220;zkEVM validium&#8221; version, which would utilize zero-knowledge proofs to bolster security measures. Polygon PoS, initially launched in 2019, is a prominent ... <a title=\"Polygon unveils game-changing security upgrade\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polygon-unveils-security-upgrade/\" aria-label=\"More on Polygon unveils game-changing security upgrade\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-20T22:30:48.000Z",
    "title": "Bitcoin Miners Deposit To Exchanges, What Does This Mean?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-miners-deposit-exchanges-more-decline-ahead/",
    "description": "On-chain data shows that Bitcoin miners have been depositing large amounts to exchanges. Here&#8217;s what this could mean for the asset&#8217;s price. Bitcoin Miners Have Been Depositing Big To Exchanges Recently An analyst in a CryptoQuant post pointed out that BTC miners have been transferring coins out of their wallets recently. The relevant indicator here is the &#8220;miner outflow,&#8221; which measures the total amount of Bitcoin miners withdraw from their combined supply. The counterpart metric, the &#8220;miner inflow,&#8221; naturally keeps track of the reverse flow of coins. Here is a chart that shows the trend in both the Bitcoin miner outflow and the inflow over the past few days: Looks like the value of one of the metrics has been elevated in recent days &#124; Source: CryptoQuant The above graph shows that the Bitcoin miner outflow has observed a spike during the past day, while the inflow has remained relatively low. This would imply that the miners have transferred a net amount of coins from their wallets in this period. Related Reading: Bitcoin Whales Continue To Accumulate As BTC Makes Recovery Push Generally, whenever miners withdraw coins from their wallets, there is always a risk that they are doing so to sell said coins. Such selling can naturally have a bearish effect on the cryptocurrency&#8217;s value. One way to better guess the intent behind these withdrawals is by checking whether the destination of the coins is a centralized exchange platform. The chart also shows the data for the Bitcoin miner to exchange flow. This indicator specifically keeps track of the coins flowing from these chain validators&#8217; holdings to exchange wallets. This indicator has also seen a sharp spike at the same time as the miner outflow surge. The magnitude of both spikes is also pretty much the same; both are slightly above 1,000 BTC. Thus, almost all the outflows from the past day appear to have headed toward exchanges. Related Reading: Bullish Signal: Bitcoin Realized Profit And Loss Fall To October 2020 Levels Knowing that there have been deposits to exchanges only tells us a part of the story, however, as the indicator used here doesn&#8217;t specify which type of platforms the inflows have been towards. A modified version of the indicator, which only tracks deposits to derivative exchanges, reveals that the transfers have been almost entirely toward the derivative platforms. The value of the metric seems to have spiked recently &#124; Source: CryptoQuant When miners plan to sell their coins, they make deposits to spot exchanges. Since they have sent their Bitcoin to derivative platforms instead this time, it would seem likely that the intent behind their transfers may not have been selling after all. As for what effect this might have on the market; usually more derivative positions being opened usually results in higher price volatility. However, this volatility can go either bullish or bearish, depending on the wider sentiment. BTC Price At the time of writing, Bitcoin is trading around $27,400, up 6% in the last week. BTC has observed an uplift today &#124; Source: BTCUSD on TradingView Featured image from Michael Förtsch on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  }
]