[
  {
    "source": "CoinDesk",
    "date": "2023-12-14T09:49:12.000Z",
    "title": "Crypto Exchange CoinList Settles OFAC's Russian Sanctions Allegations for $1.2M",
    "url": "https://www.coindesk.com/policy/2023/12/14/crypto-exchange-coinlist-settles-ofacs-russian-sanctions-allegations-for-12m/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "CoinList did not detect users who claimed to be from non-embargoed countries, but provided addresses in Crimea, OFAC said."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-14T09:52:46.000Z",
    "title": " Philippines SEC begins Binance ban countdown ",
    "url": "https://cointelegraph.com/news/philippines-sec-begins-binance-ban-countdown",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvZGFjM2M0NTctZmI3OC00NGU4LTk5MTEtYTQ4NGZhYTlkY2E3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The head of the Philippines SEC clarified that Binance and any other unregistered exchange issued with an advisory has three months before they're banned from the country.  </p>\n                    <p><p>The Philippine Securities and Exchange Commission head Kelvin Lee clarified in a panel on Dec. 13 that the ban on Binance would come into effect three months after the advisory was issued.  </p><p>According to a <a href=\"https://bitpinas.com/regulation/sec-clarifies-3-months-until-binance-ban/\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from local news BitPinas, Lee said there has been a lot of confusion on the internet about the ban after <a href=\"https://cointelegraph.com/news/binance-operates-no-license-philippines\">regulators issued an advisory to the cryptocurrency exchange</a> for operating without a license on Nov. 28.</p><p>He was asked to clarify the matter and that the ban was “supposed to be three months from the issuance date,” which he said was given on Nov. 29.  </p><p><a href=\"https://cointelegraph.com/news/philippines-sec-begins-binance-ban-countdown\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-12-14T09:56:13.000Z",
    "title": "Bitwise predicts $80k BTC in 2024 as ETF launch will be most successful in history",
    "url": "https://cryptoslate.com/bitwise-predicts-80k-btc-in-2024-as-etf-launch-will-be-most-successful-in-history/",
    "description": "<p>Bitwise Investments, currently awaiting a decision on its spot Bitcoin ETF filing with the SEC, has followed VanEck in releasing a set of bold predictions for the crypto market in 2024. Bitcoin&#8216;s new all-time high above $80,000 is the first of Bitwise&#8217;s predictions. The report attributes this potential surge to two major catalysts: the expected [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitwise-predicts-80k-btc-in-2024-as-etf-launch-will-be-most-successful-in-history/\">Bitwise predicts $80k BTC in 2024 as ETF launch will be most successful in history</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T10:06:35.000Z",
    "title": "Bitcoin’s role on corporate balance sheets expands with regulatory update",
    "url": "https://www.cryptopolitan.com/bitcoins-role-on-corporate-balance-sheets/",
    "description": "In a significant development for the world of cryptocurrency, the Financial Accounting Standards Board (FASB) has introduced a groundbreaking rule change set to take effect in December 2024.&#160; This rule change will enable companies that hold cryptocurrencies, such as Bitcoin, to report their paper gains on their balance sheets, a monumental departure from the previous [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T09:59:24.000Z",
    "title": "Chinese grannies are coming for your airdrops",
    "url": "https://www.cryptopolitan.com/chinese-grannies-coming-for-your-airdrops/",
    "description": "The cryptocurrency space, long dominated by tech-savvy youth, is witnessing a surprising twist: the rise of Chinese grannies in the airdrop arena. These bold, unassuming seniors are not just breaking stereotypes; they&#8217;re redefining the dynamics of digital asset distributions, known as airdrops, in the crypto world. The unlikely crypto enthusiasts In the bustling streets of [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T09:47:37.000Z",
    "title": "Gemini Trust’s controversial payout plan sparks backlash from creditors",
    "url": "https://www.cryptopolitan.com/gemini-trusts-controversial-payout-plan/",
    "description": "Gemini Trust&#8217;s plan to reorganize payouts for its Earn users has sparked outrage among creditors who stand to receive significantly less than expected.&#160; The proposal, which has been sent to creditors for a vote, could result in payouts worth just 30% of current market rates. This development comes as a shock to many, as it [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-14T09:46:19.000Z",
    "title": "Donald Trump is bullish on U.S. economy – Here is why",
    "url": "https://www.cryptopolitan.com/donal-trump-is-bullish-on-u-s-economy/",
    "description": "Amid the ebb and flow of economic forecasts, one voice stands distinctively optimistic. Donald Trump, the former U.S. President, envisions 2025 as a landmark year for the U.S. economy, predicting it to be one of the most remarkable in history, should he be re-elected in 2024. Trump&#8217;s confidence seems to radiate from the anticipated momentum [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-14T10:00:07.000Z",
    "title": "Crypto Analyst Reveals Uncanny Similarities In The Bitcoin Charts Of 2020 And 2023",
    "url": "https://www.newsbtc.com/news/bitcoin/similarities-bitcoin-2020-2023/",
    "description": "A crypto analyst has revealed what seems to be one of the most uncanny similarities in two separate Bitcoin charts. The two charts taken from 2020 and 2023 show a very similar price trend, and the most important part is what happens if Bitcoin continues to follow this trend. Bitcoin Charts From 2020 And 2023 Compared Pseudonymous crypto analyst Crypto El Presidente first shared his comparison of two Bitcoin charts back on December 1. In this initial post on X (formerly Twitter), the analyst revealed that the current market movements matched those that were seen in 2020. Related Reading: Crypto Pundit Predicts That XRP Price Will Rise “Dramatically,” Here’s When To make this clearer, El Presidente puts the movements from both years into consideration when they are both unmorphed and morphed to scale. The similarities between both trends were eerily alike, with dips and recoveries at almost the same angles. Then in a follow-up post, the crypto analyst showed an even more glaring similarity with a new chart. These charts took the Bitcoin price movements from the last six months of the year and looked at how they moved. As shown in the chart, both started out trailing low but then surged as August moved into view. Then the dips would happen around September and trail the lows once more before recovering again. Then toward November, there was a recovery once more. While not exactly identical, these dips and recoveries, as well as subsequent ones, share an obvious likeness that could continue going forward. BTC bulls reclaim control of price &#124; Source: BTCUSD On Tradingview.com What Happens If This Trend Continues? If the historical performance of Bitcoin back in 2020 is repeating itself once more, then it is very bullish for the price. This is because 2020 is actually the year the last bull run began. From December 2020, going into the year 2021, the Bitcoin price would rise continuously to beat its previous all-time high set in 2018. Related Reading: Shiba Inu Rally To $0.0001? Shibarium Transaction Count Breaches 90 Million Milestone A repeat of this trend would mean the recent dip below $41,000 was only a short pit stop. Furthermore, such a recovery would see the price break above $45,000 once more, before correcting back downward again, as shown in the chart. The next leg-up after this dip, however, would be the main event as the chart shows a push toward $50,000. In such a case, the price of Bitcoin would be looking at an at least 20% increase by the time that 2024 rolls around. The significance of this similarity also doesn’t end at just the 20% increase given that the 2020 surge kickstarted another bull market. So a repeat of this would likely mean that BTC is headed into another bull run. Featured image from Kiplinger, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-12-14T10:04:38.000Z",
    "title": "ADA’s Remarkable Rally: Cardano’s Value Skyrockets by 47% in 30 Days",
    "url": "https://www.crypto-news-flash.com/adas-remarkable-rally-cardanos-value-skyrockets-by-47-in-30-days/?utm_source=rss&utm_medium=rss&utm_campaign=adas-remarkable-rally-cardanos-value-skyrockets-by-47-in-30-days",
    "description": "<img width=\"800\" height=\"533\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/05/coin-cryptocurrency-ada-cardano-golden-background-coin-cryptocurrency-cardano-gold-fabric-background-ada-144701154.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"ADA\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/05/coin-cryptocurrency-ada-cardano-golden-background-coin-cryptocurrency-cardano-gold-fabric-background-ada-144701154.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/coin-cryptocurrency-ada-cardano-golden-background-coin-cryptocurrency-cardano-gold-fabric-background-ada-144701154-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/coin-cryptocurrency-ada-cardano-golden-background-coin-cryptocurrency-cardano-gold-fabric-background-ada-144701154-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/coin-cryptocurrency-ada-cardano-golden-background-coin-cryptocurrency-cardano-gold-fabric-background-ada-144701154-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/coin-cryptocurrency-ada-cardano-golden-background-coin-cryptocurrency-cardano-gold-fabric-background-ada-144701154-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/coin-cryptocurrency-ada-cardano-golden-background-coin-cryptocurrency-cardano-gold-fabric-background-ada-144701154-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/coin-cryptocurrency-ada-cardano-golden-background-coin-cryptocurrency-cardano-gold-fabric-background-ada-144701154-48x32.jpg 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" />Cardano&#8217;s decentralized finance (DeFi) ecosystem hit an all-time high with a 50% surge in total value locked (TVL) in the past month, ranking ninth in DeFi TVL. ADA, Cardano&#8217;s native cryptocurrency, saw a 47% gain in the last month, reaching $0.57, driven by increased demand and profitable transactions with an MVRV ratio of 1.76%. Recently, [...]"
  }
]