[
  {
    "source": "Decrypt",
    "date": "2023-08-22T14:40:45.000Z",
    "title": "Retro Gaming Console Atari 2600 Is Making a Comeback",
    "url": "https://decrypt.co/153323/retro-gaming-console-atari-2600-making-comeback",
    "description": "The new Atari 2600+ game console, launching in November, can play classic 2600 and 7800 cartridges along with new ones."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-22T14:45:17.000Z",
    "title": "Algorand’s ALGO token nosedives amid SEC classification and deflating DeFi activity",
    "url": "https://cryptoslate.com/algorands-algo-token-nosedives-amid-sec-classification-and-deflating-defi-activity/",
    "description": "<p>Algorand&#8217;s ALGO token price has plunged to new lows following the crypto market&#8217;s epic crash on Aug. 17. According to CryptoSlate&#8217;s data, the digital asset fell to an all-time low of $0.08846 last Thursday. While its value has since rebounded to $0.09673 as of press time, market sentiments surrounding the asset remain negative. Why is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/algorands-algo-token-nosedives-amid-sec-classification-and-deflating-defi-activity/\">Algorand&#8217;s ALGO token nosedives amid SEC classification and deflating DeFi activity</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-08-22T14:54:28.000Z",
    "title": "$DOGE: Dogecoin Core Developer May Exit Over Controversial Shift to Proof-of-Stake",
    "url": "https://www.cryptoglobe.com/latest/2023/08/doge-dogecoin-core-developer-may-exit-over-controversial-shift-to-proof-of-stake/",
    "description": "A prominent Dogecoin core developer has recently voiced concerns over the potential transition of Dogecoin from its current Proof-of-Work (PoW) consensus mechanism to Proof-of-Stake (PoS). In fact, he has gone so far as to suggest that such a move might lead to their departure from the project. It all started on 20 August 2023 when […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-22T14:42:03.000Z",
    "title": "\n                        LBank Launchpad Addresses False Rumors Surrounding Project PINs Launch\n                    ",
    "url": "https://cryptodaily.co.uk/2023/8/lbank-launchpad-addresses-false-rumors-surrounding-project-pins-launch",
    "description": "\n                        <p>In light of recent community chatter, LBank Launchpad has stepped forward to address misleading speculations regarding its forthcoming Project PINs launch. Set to debut on August 31st, the LBank Launchpad has taken it upon themselves to correct the record and prioritize the safety of its users.</p>\n<p>Recent rumors have been suggesting privileges for certain individuals, including direct purchase access to Project PINs, obtaining extra allocations, or guaranteed whitelist spots. LBank Launchpad firmly dispels these rumors, assuring the community that no such privileges exist.</p>\n<p>For those interested in the Project PINs token sale event, it is scheduled exclusively for August 31st, 6:00 AM (UTC) on LBank Launchpad. Any information regarding this launch should be verified using the official LBank Launchpad website: LBank Launchpad's Project PINs.</p>\n<p>Users and interested parties are encouraged to exercise caution and verify any information they come across regarding the Project PINs launch. For questions or further clarity, LBank Launchpad's dedicated customer support team stands ready to assist.</p>\n<p>As always, the community's unwavering support and enthusiasm for LBank Launchpad projects are deeply appreciated.</p>\n<p>For more details, please check https://support.lbank.com/hc/en-gb/articles/22061348602521.</p>\nAbout LBank\n<p>LBank is one of the top crypto exchanges, established in 2015. It offers specialized financial derivatives, expert asset management services, and safe crypto trading to its users. The platform holds over 9 million users from more than 210 regions across the world. LBank is a cutting-edge growing platform that ensures the integrity of users&rsquo; funds and aims to contribute to the global adoption of cryptocurrencies.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\nContact\n<p>LBK Blockchain Co. Limitedmarketing@lbank.info</p>\n                    "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-22T15:00:06.000Z",
    "title": "Defi TVL Dips Below $40B Amidst Market Turbulence and Shrinking Confidence",
    "url": "https://news.bitcoin.com/defi-tvl-dips-below-40b-amidst-market-turbulence-and-shrinking-confidence/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/defi-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Defi TVL Dips Below $40B Amidst Market Turbulence and Shrinking Confidence\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/defi-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/defi-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/defi-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/defi-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/defi-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/defi-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/defi.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />After remaining above $40 billion for much of 2023, the total value locked in decentralized finance, or defi, fell below the threshold on August 17, reaching $37.9 billion by August 22. Additionally, from August 13, the top 100 DeFi tokens have decreased by $1.74 billion in value over nine days. Defi&#x2019;s Rocky August: Value Retreats [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-22T14:59:10.000Z",
    "title": "Dubai grants full license to crypto custody Komainu",
    "url": "https://crypto.news/dubai-grants-full-license-to-crypto-custody-komainu/",
    "description": "Komainu, a joint venture of Ledger, CoinShares, and Nomura, gains a full operating license from Dubai’s VARA, bolstering Dubai&#8217;s ambition to become a crypto hotspot. Crypto custody service Komainu, backed by Nomura, Ledger, and Coinshares, has received final approval from&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-22T14:48:30.000Z",
    "title": "Thailand threatens Facebook shutdown over crypto scams",
    "url": "https://crypto.news/thailand-threatens-facebook-shutdown-over-crypto-scams/",
    "description": "Thailand has warned Facebook of a potential shutdown due to the rise in crypto scams and misleading ads on the platform. The Minister of Digital Economy and Society (DES), Mr. Chaiwut Thanakmanusorn, is taking action against fraudulent activities on Facebook.&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-22T14:40:28.000Z",
    "title": "3rd Biggest Bitcoin Stash Now Belongs To Unknown Wallet, Amassed In Over 3 Months",
    "url": "https://www.newsbtc.com/news/bitcoin/3rd-biggest-bitcoin-stash-now-belongs-to-unknown-wallet-amassed-in-over-3-months/",
    "description": "An unknown Bitcoin wallet has emerged as the global third-largest BTC holder. The wallet used three months to accumulate BTC to climb to its present position in the ranking of holders. Following the recent revelation, some speculations and theories have been trending about the owner of the mysterious wallet. BitInfoCharts Shares Data About Mysterious Wallet The crypto statistics platform, BitInfoCharts, provided data regarding the mysterious wallet. The data indicated that the wallet first received some BTC coins on March 8. Within three months and two weeks, the wallet amassed 118,000 BTC. Going by the current prices in the crypto market, the coins are worth $3.08 billion. Related Reading: Polygon (MATIC) At June Lows Again – Prospects For Bullish Recovery? Despite holding such a large number of BTC, the whale is still not the largest in the sector. Data from BitInfoCharts disclosed that the current largest Bitcoin wallets in the world belong to Binance and Bitfinex and these top two BTC wallets are currently operating as cold wallets. Binance&#8217;s cold wallet emerged as the global largest BTC holder on March 10, 2021, with 143,528 BTC. It progressed gradually to hit an all-time high of 299,427 BTC by June 2021. But the wallet&#8217;s holding as of June 2023 was 248,597 BTC coins worth over $6 billion, according to the current prices. On the other hand, Bitfinex&#8217;s cold wallet is ranked the second-largest BTC holder, while the mysterious wallet occupies the third position currently. Interestingly, the fourth-largest Bitcoin wallet is another Binance cold wallet. Does BlackRock Own The Mysterious Wallet? Following the emergence of the mysterious wallet as the third-largest Bitcoin holder, speculations and theories started flowing within the crypto space and many have suggested the possible owner of the wallet. One X (formerly Twitter) user, DivXMan, pointed out that the mysterious wallet witnessed its initial major transaction of 3,400 BTC tokens on May 16, 2023. One month later, the largest global asset manager Blackrock filed for a spot in Bitcoin ETF on June 15. Another user posted a huge black rock, suggesting that the wallet belongs to BlackRock. This has triggered a rumor that BlackRock could be the owner of the unknown wallet. This is based on close timing between its Bitcoin ETF filing and the wallet&#8217;s key accumulation of BTC. However, the theories about BlackRock being the possible owner of the mysterious wallet lack concrete evidence.  Notably, the application for a spot BTC ETF from BlackRock created a large wave within the crypto market. And if the US Securities and Exchange Commission (SEC) approves the filing, it would become the first Spot Bitcoin ETF to trade in the US. Related Reading: Bitcoin On-Chain Data Suggests Price Is Top Heavy, What It Means Besides BlackRock, other prominent companies and entities applied for a spot in Bitcoin ETF. These include Fidelity, Valkyrie, Invesco, and Wisdom Tree, among others. Featured image from Pixabay and chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-22T15:00:08.000Z",
    "title": "Shiba Inu (SHIB) vs. Gala Games (GALA) vs. ANA: Which Coin Holds the Key to Wealth Creation in 2023",
    "url": "https://www.crypto-news-flash.com/shiba-inu-shib-vs-gala-games-gala-vs-ana-which-coin-holds-the-key-to-wealth-creation-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-shib-vs-gala-games-gala-vs-ana-which-coin-holds-the-key-to-wealth-creation-in-2023",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-67.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-67.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-67-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-67-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The cryptocurrency market has become a playground for investors seeking lots of money, and 2023 promises to be no different. As the market shows signs of resurgence, many are looking to identify the coin that can unlock the door to wealth creation in the coming months. In this article, we will take a look at [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-22T14:41:56.000Z",
    "title": "RBN, MASK, FLOW, GT, C98 Unlocks May Lead to Trade Opportunities",
    "url": "https://coinedition.com/rbn-mask-flow-gt-c98-unlocks-may-lead-to-trade-opportunities/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/5_Projects_to_Unlock_Tokens_Will_This_Cause_a_Price_Surge_C98_RBN.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"RBN, MASK, FLOW, GT, C98 Unlocks May Lead to Trade Opportunities\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/5_Projects_to_Unlock_Tokens_Will_This_Cause_a_Price_Surge_C98_RBN.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/5_Projects_to_Unlock_Tokens_Will_This_Cause_a_Price_Surge_C98_RBN-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/5_Projects_to_Unlock_Tokens_Will_This_Cause_a_Price_Surge_C98_RBN-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/5_Projects_to_Unlock_Tokens_Will_This_Cause_a_Price_Surge_C98_RBN-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/5_Projects_to_Unlock_Tokens_Will_This_Cause_a_Price_Surge_C98_RBN-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/5_Projects_to_Unlock_Tokens_Will_This_Cause_a_Price_Surge_C98_RBN-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/5_Projects_to_Unlock_Tokens_Will_This_Cause_a_Price_Surge_C98_RBN-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/5_Projects_to_Unlock_Tokens_Will_This_Cause_a_Price_Surge_C98_RBN-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/5_Projects_to_Unlock_Tokens_Will_This_Cause_a_Price_Surge_C98_RBN-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/5_Projects_to_Unlock_Tokens_Will_This_Cause_a_Price_Surge_C98_RBN-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/5_Projects_to_Unlock_Tokens_Will_This_Cause_a_Price_Surge_C98_RBN-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/5_Projects_to_Unlock_Tokens_Will_This_Cause_a_Price_Surge_C98_RBN-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/5_Projects_to_Unlock_Tokens_Will_This_Cause_a_Price_Surge_C98_RBN-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/5_Projects_to_Unlock_Tokens_Will_This_Cause_a_Price_Surge_C98_RBN-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/5_Projects_to_Unlock_Tokens_Will_This_Cause_a_Price_Surge_C98_RBN-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/5_Projects_to_Unlock_Tokens_Will_This_Cause_a_Price_Surge_C98_RBN-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The tokenomics tracking platform Token Unlocks indicated at press time that several altcoins were on the verge of having tokens introduced to their supply. According to the platform, notable cryptocurrencies with upcoming unlocking events include Coin98 (C98), Ribbon Finance (RBN), Mask Network (MASK), GateToken (GT), and Flow (FLOW). Coin98 (C98) C98 will see 19.45 million [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/rbn-mask-flow-gt-c98-unlocks-may-lead-to-trade-opportunities/\">RBN, MASK, FLOW, GT, C98 Unlocks May Lead to Trade Opportunities</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]