[
  {
    "source": "CoinDesk",
    "date": "2024-01-05T19:04:19.000Z",
    "title": "Arthur Hayes Foresees 30% Bitcoin Crash Amid 'Vicious Washout.' Here's Why",
    "url": "https://www.coindesk.com/markets/2024/01/05/arthur-hayes-foresees-30-bitcoin-crash-amid-vicious-washout-heres-why/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Depletion of the Fed's reverse repo program and expiry of a crucial funding facility for troubled banks may trigger a market crash in March and force the Fed to cut interest rates, Maelstrom CIO Arthur Hayes said."
  },
  {
    "source": "CoinDesk",
    "date": "2024-01-05T19:00:10.000Z",
    "title": "U.S. SEC Seeks to Leverage Terraform Win in Coinbase, Binance Disputes",
    "url": "https://www.coindesk.com/policy/2024/01/05/us-sec-seeks-to-leverage-terraform-win-in-coinbase-binance-disputes/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The U.S. Securities and Exchange Commission (SEC) has been blowing a horn in its various legal clashes with crypto exchanges, asking courts to see how its recent win in the Terraform Labs dispute should convince other judges that the regulator is right about platforms like Coinbase and Binance trading unregistered securities."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-05T18:52:26.000Z",
    "title": "Pixels Game Airdrop Announced—Here’s How to Get Pixel Tokens",
    "url": "https://decrypt.co/211855/pixels-game-airdrop-announced-heres-how-to-get-pixel-tokens",
    "description": "Airdrops continue to keep crypto believers enthralled, further fueled by Pixels’ latest announcement."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-05T18:44:37.000Z",
    "title": "Anthropic Says It Won’t Use Your Private Data to Train Its AI",
    "url": "https://decrypt.co/211846/anthropic-says-it-wont-use-your-private-data-to-train-its-ai",
    "description": "As AI companies hungrily consume every trove of data they can find, the makers of Claude.AI say they won’t their its own customers' work to improve its chatbot."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-05T18:50:15.000Z",
    "title": " Here’s what happened in crypto today ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDYvNzhkNzg3NjEtM2JkMi00NTY5LTk2YTctNjJhOTdmMGExYjBhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p data-ct-non-breakable=\"true\">Hackers from Norht Korea stole $600 million worth of cryptocurrency in 2023, according to research from TRM Labs. Meanwhile, crypto traders have gambled $1.5 million on what the eagerly-awaited Bitcoin ETF approval results may be, and crypto Twitter is abuzz with speculation that the U.S. Securities and Exchange Commission is about to approve Bitcoin ETFs are soon as Friday.</p><p>Hacker groups associated with the Democratic People’s Republic of Korea syphoned <a href=\"https://cointelegraph.com/news/north-korea-hackers-stole-crypto\">$600 million worth of digital assets</a> in 2023, according to blockchain intelligence firm TRM Labs. </p><p>The Jan. 5 report suggested that North Korean hackers may have stolen up to $700 million worth of crypto, though only $600 million was confirmed. Since 2017, North Korean hackers have stolen <a href=\"https://cointelegraph.com/news/north-korean-hackers-stolen-crypto\">roughly $3 billion worth of crypto</a>.</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-today\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-05T18:45:33.000Z",
    "title": "Spanish central bank finalizes partners for wholesale CBDC pilot",
    "url": "https://cryptoslate.com/spanish-central-bank-finalizes-partners-for-wholesale-cbdc-pilot/",
    "description": "<p>The Bank of Spain&#8217;s selection of Cecabank, Abanca, and Adhara Blockchain for its wholesale central bank digital currency (CBDC) pilot is a strategic move towards exploring the benefits and feasibility of digital currencies in the banking sector, according to a Jan. 3 release. The six-month pilot program will simulate interbank payment processing and settlement using [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/spanish-central-bank-finalizes-partners-for-wholesale-cbdc-pilot/\">Spanish central bank finalizes partners for wholesale CBDC pilot</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-05T18:47:54.000Z",
    "title": "Fintech firm Dave to pay FTX liquidators $71m",
    "url": "https://crypto.news/fintech-firm-dave-to-pay-ftx-liquidators-71m/",
    "description": "Neobank Dave will pay $71 million to FTX liquidators by acquiring a convertible promissory note from FTX Ventures, valued at $100 million. "
  },
  {
    "source": "BTCManager",
    "date": "2024-01-05T18:39:45.000Z",
    "title": "VanEck to support Bitcoin developers using ETF profits",
    "url": "https://crypto.news/vaneck-to-support-bitcoin-developers-using-etf-profits/",
    "description": "Investment firm VanEck commits 5% of potential profits from its proposed Bitcoin ETF to support Brink, increasing corporate support for open-source development."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-05T19:00:50.000Z",
    "title": "Shiba Inu’s Shibarium Hit Major Milestone Amid Rapid Network Recovery",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-shibarium-milestone/",
    "description": "The Shiba Inu Layer 2 Shibarium network is recovering once again after the festivities of the holidays have died down. This time around, the layer 2 network is celebrating a major milestone after a couple of months of impressive outperformance. Shibarium Network Crosses 250 Million Transactions The Shibarium network has now crossed a total of 250 million transactions that have been processed since it was launched last year. This latest milestone coincides with a significant recovery in the network’s daily transactions which had plunged at the start of the new year. Related Reading: Crypto Analyst Predicts Cardano Price Jump In January – Here’s The Target As NewsBTC reported on Thursday, the average daily transactions on the network had fallen around 50% from the 7 million average to 4 million. This decline would persist for at least two days, on January 2 and January 3, where an average of 4 million transactions were carried out. Source: ShibariumScan However, there has since been another jump in the number of transactions processed by the network. Currently, the daily transactions for Friday are sitting at 6.19 million at the time of writing. This translates to a 50% jump from the numbers recorded over the last few days. The total number of blocks produced has also risen rapidly at this time as well. As the data shows, there are now over 2.84 million blocks produced on the Shibarium network. If the daily transactions on the Shiba Inu layer 2 network continue to rise, then the total number of blocks produced could cross 2.5 million before the month is over. SHIB bulls losing control &#124; Source: SHIBUSDT on Tradingview.com Shiba Inu Burn Rate Mounts A Comeback The transactions carried out on the Shibarium network are not the only thing making a comeback at this time. The Shiba Inu burn rate is also seeing a significant surge after being subject to a slow start to the year. Related Reading: Shibarium Transactions Crash Almost 50%, Shiba Inu Price Wobbles According to data from the burn tracking website Shibburn, there have been more than 4.2 million SHIB tokens burned in the last day. This figure translates to a 244% surge in the burn rate over this time, continuing the trend that was registered on Thursday. The rise in the Shiba Inu burn rate shows that interest is not only localized to the Layer 2 network alone. But also, community members continue to work together in their bid to reduce the total circulating supply of the meme coin. In the year 2023, the total number of SHIB tokens burned through this initiative has come out to more than 76 billion. However, this figure is minute compared to the over 400 trillion supply of the SHIB token, showing a need to ramp up burning. Featured image from NewsBTC, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-05T19:05:18.000Z",
    "title": "There’s Now a ‘Very Big Hole’ in Ethereum’s Value Proposition, Crypto Trader Warns – Here’s Why",
    "url": "https://dailyhodl.com/2024/01/05/theres-now-a-very-big-hole-in-ethereums-value-proposition-crypto-trader-warns-heres-why/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/Laws-of-btc-eth.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/Laws-of-btc-eth.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/Laws-of-btc-eth.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/Laws-of-btc-eth.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/Laws-of-btc-eth.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/Laws-of-btc-eth.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/Laws-of-btc-eth.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is warning that interest in the Ethereum (ETH) ecosystem is declining as attention shifts to Bitcoin (BTC). In a new strategy session, Nicholas Merten, the host of DataDash, tells his 510,000 YouTube subscribers that future crypto development will likely focus on Bitcoin, which may diminish Ethereum&#8217;s future value. “There’s a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/05/theres-now-a-very-big-hole-in-ethereums-value-proposition-crypto-trader-warns-heres-why/\">There’s Now a ‘Very Big Hole’ in Ethereum’s Value Proposition, Crypto Trader Warns – Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]