[
  {
    "source": "Decrypt",
    "date": "2023-09-21T15:01:12.000Z",
    "title": "South Korea's Dreamus Debuts Avalanche NFT Tickets for Events, K-Pop Concerts",
    "url": "https://decrypt.co/198091/south-koreas-dreamus-puts-nft-tickets-avalanche-events-kpop-concerts",
    "description": "SK Planet's loyalty app OK Cashbag is integrating Avalanche NFTs for live events like K-pop concerts, musicals, and more."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-21T15:01:02.000Z",
    "title": "'Pirate Nation' Studio Raises $33 Million to Build Fully On-Chain Games",
    "url": "https://decrypt.co/198093/pirate-nation-studio-raises-33-million-build-fully-on-chain-games",
    "description": "Proof of Play, founded by the co-creator of Zynga’s FarmVille, reveals seed funding and free-to-play plans for Pirate Nation."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-21T15:00:00.000Z",
    "title": "Farmville co-creator-led company raises $33M to create Web3 games",
    "url": "https://cointelegraph.com/news/farmville-co-creator-led-company-raises-33-million-create-web3-games",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/a5484bb9-1ce0-486c-a913-ce3958b680f6.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Proof of Play raised $33 million to create fully on-chain games that “quickly immerse players in fun gameplay.“</p>\n                    <p><p>Proof of Play, a company led by Farmville co-creator Amitt Mahajan, raised $33 million to create Web3 games, according to a Sept. 21 announcement. Majahan is the CEO of Proof of Play, and Twitch co-founder Emmett Shear is a board member.</p><p>The funding was co-led by Chris Dixon at Andreessen Horowitz (a16z) and Neil Mehta at Greenoaks. Investors Naval Ravikant, Balaji Srinivasan and the founders of streaming platform Twitch also participated, as well as Web3 firms Anchorage Digital, Mercury, Firebase, Zynga and Alchemy.</p><p>Proof of Play released a closed beta of its first game, Pirate Nation, in December 2022.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/87195ab2-589a-484d-b7e7-f143b835fcf1.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Pirate Nation Web3 game. Source: Proof of Play</em></figcaption></figure><p>In its announcement, the company claimed it can overcome many roadblocks players commonly encounter when attempting to play Web3 games. It stated that it possesses “a set of technological and product innovations” that will “quickly immerse players in fun gameplay” without learning about blockchain first.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/animoca-yat-siu-nolan-bushnell-atari-praise-ownership-web3-gaming\"><strong>Atari founder sees Web3 games as vital for virtual ownership and education</strong></a></em></p><p>Proof of Play also stated that it is committed to decentralization. Pirate Nation is a “Forever Game” that can be run without external servers or creator intervention, adding that the company intends to open-source its technology framework in the future to decentralize further.</p><p>The Proof of Play team includes members from several large gaming and web companies, including Epic Games, Zynga, EA, Activision and Google.</p><p>Multimillion-dollar funding rounds from Web3 companies have become the norm in 2023. EVE Online developer CCP Games raised $40 million in March to <a href=\"https://cointelegraph.com/news/ccp-games-secures-40m-funding-for-upcoming-web3-game\">develop a new spinoff EVE game</a>, and Hyperplay<a href=\"https://cointelegraph.com/news/hyperplay-raises-in-series-a-funding-round\"> raised $12 million in June</a> to further develop its distribution platform and Steam competitor.</p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-21T14:57:59.000Z",
    "title": "Near Foundation CEO Marieke Flement resigns",
    "url": "https://cointelegraph.com/news/near-foundation-ceo-marieke-flement-resigns",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/73b6037a-3b4c-429c-9d52-03cc95fb34c3.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Near Foundation treasury grew to $350 million under Flament's tenure. </p>\n                    <p><p>Marieke Flament, CEO of Near Foundation, the developer of the namesake community layer-one protocol, has resigned.</p><p>According to the September 21 <a href=\"https://pages.near.org/blog/a-personal-message-from-marieke-flament/\" target=\"_blank\" rel=\"noopener nofollow\">announcement</a>, Chris Donovan, Near Foundation's general counsel, will replace Flament as the new CEO following the resignation. Flament gave no specific reason for her departure. Speaking on her tenure, Flament said: </p><blockquote>\"Two years ago, I had never heard of NEAR. Upon doing a bit of research and after several conversations it became clear that NEAR had a tremendous potential – fantastic tech, a diverse and vibrant community and a world of open possibilities, and so I joined.\"</blockquote><p>From 2021 to 2023, Flament claims that the daily active user count of Near Protocol grew from 50,000 to 3 million. Its Twitter followers also grew from 200,000 to over 2 million, citing more than 2,000 pieces of press coverage. Partnerships signed by Near during this period include SWEAT, Playember, Circle, Ledger, Alibaba, Amazon, Google, KPMG, Cosmose AI, SailGP, The Littles, PipeFlare, Shemaroo, Kakao Games, Inven / Vortex and Netmarble / Marblex in Korea.</p><p>In addition, Flament disclosed that the current treasury balance of the Near Foundation is 330 million NEAR, worth an estimated $350 million. Summing up her leadership strategy, Flament wrote:</p><blockquote>\"My strategy has been one of driving mainstream adoption, enabling and empowering grassroot communities and continuing our journey to decentralization. Bringing onboard large web2 players, while nurturing web3 innovators has also been key to our growth.\"</blockquote><p>Near is currently the 40th largest crypto by market cap, with its tokens worth an estimated $1.04 billion. In June, Czech automobile conglomerate Škoda Auto <a href=\"https://cointelegraph.com/news/czech-automobile-conglomerate-skoda-auto-launches-nft-platform\">launched</a> a nonfungible tokens platform on the Near Protocol. </p><p><strong>Magazine: <a href=\"https://cointelegraph.com/magazine/nft-collector-william-mapan-explains-generative-art-using-crayon-dice-nouns-cool-cats/\">NFT Collector: William Mapan explains generative art using a crayon and dice</a></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-21T15:00:05.000Z",
    "title": "Liquid staking protocol stake.link introduces AI-powered chatbot amid new upgrades",
    "url": "https://cryptoslate.com/liquid-staking-protocol-stake-link-introduces-ai-powered-chatbot-amid-new-upgrades/",
    "description": "<p>Liquid staking protocol stake.link plans to launch new features and an AI-powered chatbot called SergAI. These advancements aim to consolidate its role as a leading staking solution on Chainlink (LINK), according to a Sept. 21 statement shared with CryptoSlate. The upgrades One newly introduced upgrade is the priority pool feature built to automate LINK staking [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/liquid-staking-protocol-stake-link-introduces-ai-powered-chatbot-amid-new-upgrades/\">Liquid staking protocol stake.link introduces AI-powered chatbot amid new upgrades</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T15:04:25.000Z",
    "title": "Belong.Life’s AI-Powered SaaS, Tara, Transforms Cancer Care with Precise Clinical Trial Matching",
    "url": "https://www.cryptopolitan.com/belonglifes-transforms-cancer-care/",
    "description": "Belong.Life, a prominent player in the healthcare technology sector, has unveiled its latest innovation, Tara—a groundbreaking AI-powered Software as a Service (SaaS) platform designed to facilitate the precise matching of cancer patients with appropriate clinical trials. This development marks a significant milestone in the realm of cancer care, leveraging seven years of invaluable real-world patient ... <a title=\"Belong.Life&#8217;s AI-Powered SaaS, Tara, Transforms Cancer Care with Precise Clinical Trial Matching\" class=\"read-more\" href=\"https://www.cryptopolitan.com/belonglifes-transforms-cancer-care/\" aria-label=\"More on Belong.Life&#8217;s AI-Powered SaaS, Tara, Transforms Cancer Care with Precise Clinical Trial Matching\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-21T14:54:58.000Z",
    "title": "TRI Revolutionizes Robot Skills with Breakthrough Diffusion Policy AI",
    "url": "https://www.cryptopolitan.com/tri-revolutionizes-robot-skills-diffusion/",
    "description": "In a significant stride toward enhancing the capabilities of robots, the Toyota Research Institute (TRI) has announced a pioneering generative AI technique known as Diffusion Policy. This innovative approach empowers robots to swiftly acquire new, intricate skills, thereby expanding their utility in various applications. This development is reminiscent of the transformative impact that large language ... <a title=\"TRI Revolutionizes Robot Skills with Breakthrough Diffusion Policy AI\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tri-revolutionizes-robot-skills-diffusion/\" aria-label=\"More on TRI Revolutionizes Robot Skills with Breakthrough Diffusion Policy AI\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-21T14:48:03.000Z",
    "title": "Investor loses $4.5m in USDT phishing scam",
    "url": "https://crypto.news/investor-loses-4-5m-in-usdt-phishing-scam/",
    "description": "An unfortunate crypto investor has reportedly been swindled out of a staggering $4.46 million in a phishing scam involving Tether (USDT). According to blockchain data from Etherscan, the funds were initially withdrawn from a Kraken crypto exchange wallet and later&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-21T15:00:21.000Z",
    "title": "What The SEC’s Latest Announcement Means For The Crypto Industry",
    "url": "https://www.newsbtc.com/crypto/sec-announcement-crypto/",
    "description": "A recent announcement by the US Securities and Exchange Commission (SEC) suggests that the crypto industry may be in for more pain as it continues to endure the far-reaching consequences that the Commission’s enforcement actions have had on it.  More Pain Incoming For Crypto? During the Securities Enforcement Forum Central 2023, David Hirsch stated that his office plans to bring action against other crypto companies that were breaking the law. Hirsch heads the agency’s unit (Crypto Assets and Cyber Unit) that handles crypto enforcement, including the lawsuits against the biggest crypto exchanges in the world, Binance and Coinbase, and another against Ripple. Related Reading: Grayscale Takes New Approach As It Files For Another Ethereum Futures ETF These actions are already negatively impacting these companies and, by extension, the crypto industry. As such, any further action could dampen the mood in the crypto market further. For instance, Binance US, the American arm of Binance, has seen a significant drop in its trading volumes since it began to face regulatory scrutiny.  In June, the SEC sued Binance US for a range of infractions, including misrepresentation of trading controls and oversight on the platform. This forced the company to suspend trading for more than 100 token pairs, causing a significant drop in trading activity and investor confidence. Also, despite securing a major victory against the SEC, Ripple’s XRP has lost most of its gains that resulted from the judgment. The XRP price has remained tepid overall, and one of the reasons for this could be that the Commission’s regulatory stance on Ripple has cast doubts in the minds of potential investors, especially with the SEC contesting Judge Analisa Torres’ ruling.   The SEC’s continued clampdown on companies in the industry evidently influences how outsiders interact with stakeholders in the industry as they may be looking to avoid the SEC’s wrath. Ripple’s CTO, David Schwartz, also recently revealed how the SEC’s lawsuit made the company lose a deal with a stablecoin issuer.  Meanwhile, others in the industry may be forced to leave the market or shut down certain parts of their operations, as in the case of crypto exchange Bittrex, which had to shut down its US operations earlier this year. DeFi Not Exempted From SEC’s Wrath So far, the SEC has been known to have largely gone after crypto projects that are more centralized. However, Hirsch stated that Decentralized Finance (DeFi) projects, which could be a direct reference to decentralized exchanges (DEXs), would not be exempted from his unit’s enforcement actions as the “label of DeFi” will not deter them from conducting investigations and doing their job.  Related Reading: Bearish Signal? Bitcoin Whale Wakes Up From 6-Year Slumber And Transfers $56 Million He, however, admitted that the Commission might not have enough resources to go after all these projects as they are already burdened with several lawsuits. This is in line with pro-XRP legal expert Fred Rispoli’s reasoning that the Commission may be looking to avoid any further legal battle as they do not have enough manpower to handle any additional lawsuit.  Total market cap trailing at $1.039 trillion &#124; Source: Crypto Total Market Cap on Tradingview.com Featured image from The Street, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-21T15:08:43.000Z",
    "title": "Stellar’s Secret to Success: $300M+ Fund and Soroban Smart Contracts ",
    "url": "https://www.crypto-news-flash.com/stellars-secret-to-success-300m-fund-and-soroban-smart-contracts/?utm_source=rss&utm_medium=rss&utm_campaign=stellars-secret-to-success-300m-fund-and-soroban-smart-contracts",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Stellar\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-1024x576.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-768x432.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-1536x864.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-2048x1152.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/09/stellar-crypto-altcoin-bitcoin-shutterstock_1024356946-scaled-1-48x27.jpg 48w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />The latest report confirms that the collaboration between Stellar Lumen and Franklin Templeton brings more RWA to the platform, much higher than any other network.  XLM has, however, failed to live up to the hype as the asset has fallen by 4.7 percent in the last 24 hours.  In July, CNF reported that Stellar Lumen [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-21T15:01:00.000Z",
    "title": "stake.link Unveils Game-Changing Upgrades for Delegated Liquid Staking",
    "url": "https://www.crypto-news-flash.com/stake-link-unveils-game-changing-upgrades-for-delegated-liquid-staking/?utm_source=rss&utm_medium=rss&utm_campaign=stake-link-unveils-game-changing-upgrades-for-delegated-liquid-staking",
    "description": "<img width=\"512\" height=\"256\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Stake.link_.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Stake.link_.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/Stake.link_-300x150.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Chainlink-based stake.link is set to revolutionize staking within the oracle&#8217;s ecosystem. Its mission will be compounded by the introduction of its chatbot, SergAI. stake.link, an innovative platform built on the Chainlink ecosystem, has just announced a significant expansion to its forthcoming staking program. This suite of new features and optimizations aims to reinforce stake.link’s position [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-21T15:00:24.000Z",
    "title": "Make an Easy 10x Profit With Chiliz (CHZ) and Anarchy (ANA)",
    "url": "https://www.crypto-news-flash.com/make-an-easy-10x-profit-with-chiliz-chz-and-anarchy-ana/?utm_source=rss&utm_medium=rss&utm_campaign=make-an-easy-10x-profit-with-chiliz-chz-and-anarchy-ana",
    "description": "<img width=\"480\" height=\"254\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/dd.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/dd.jpg 480w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/dd-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/dd-351x185.jpg 351w\" sizes=\"(max-width: 480px) 100vw, 480px\" />We all dream of hitting it big in crypto space. We’ve seen investors do it so many times. After all, if they can, why can’t we? Understanding these sets of individuals and following their investment strategy is our surest bet at this point. If you can’t beat them, join them. Recently, investors have been lowkey [...]"
  }
]