[
  {
    "source": "Cointelegraph",
    "date": "2023-05-28T23:30:00.000Z",
    "title": "Turns out, it’s pretty difficult to insure crypto users and platforms",
    "url": "https://cointelegraph.com/news/crypto-insurance-difficult-users-platforms",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-05/76906484-a62a-490b-ac38-424c94b164a4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A crypto insurance provider will typically assess at least 2,000 variables across 20 risk areas before they even consider insuring a platform, according to an insurance executive.</p>\n                    <p><p>Crypto insurance providers spend enormous amounts of time judging whether to provide coverage to a crypto company, and almost none of them offer assurances to individuals, insurance and crypto executives told Cointelegraph.</p><p>Last year saw <a href=\"https://cointelegraph.com/news/3-9-billion-lost-in-the-cryptocurrency-market-in-2022-report\">$3.9 billion stolen from</a><a href=\"https://cointelegraph.com/news/3-9-billion-lost-in-the-cryptocurrency-market-in-2022-report\"></a> crypto companies, decentralized finance platforms and users, a massive 22% rise from the <a href=\"https://blog.chainalysis.com/reports/2022-crypto-crime-report-introduction/#:~:text=Cryptocurrency%20theft%20grew%20even%20more,were%20stolen%20from%20DeFi%20protocols.\" target=\"_blank\" rel=\"noopener nofollow\">prior</a> year — and that’s only counting hacks and exploits. Some believe 2023 <a href=\"https://cointelegraph.com/news/crypto-hacks-fall-q1-temporary\">could be even worse</a>. </p><p>Raymond Zenkich, president of cryptocurrency insurance firm Evertas, told Cointelegraph that it’s a complicated process to initially assess the risks of a crypto platform.</p><p>He explained that initially, an underwriting — the process of evaluating and analyzing the risks of insuring the assets — is performed “based on a very detailed application form” that involves crunching 2,000 variables across 20 risk areas.</p><p>“A significant risk factor is key management: whether keys are stored in hot, warm, or cold wallets,” Zenkich noted.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Hot, warm, and cold crypto wallets each have different levels of risk. Did you know that until we did it, there was no standard definition of hot vs. warm? Standards development is one way insurance helps emerging markets mature.<a href=\"https://t.co/5OtqpLa8Oh\">https://t.co/5OtqpLa8Oh</a></p>&mdash; Evertas (@Evertas) <a href=\"https://twitter.com/Evertas/status/1616521662157017088?ref_src=twsrc%5Etfw\">January 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>He added that it doesn’t just stop there, as “there are several gradations of hot and warm, each with their own risk profile.”</p><p>On April 14, cryptocurrency exchange Bitrue <a href=\"https://cointelegraph.com/news/crypto-exchange-bitrue-suffers-23m-hack-due-to-hot-wallet-eploit#:~:text=Bitrue%20cryptocurrency%20exchange%20has%20suffered,exploit”%20of%20its%20hot%20wallet.\">suffered a hot wallet</a> exploit, with attackers stealing nearly $23 million worth of crypto assets. The affected hot wallet held less than 5% of the exchange’s overall funds, and the remaining wallets have “not been compromised,\" according to the firm.</p><p>Zenkich explained that after determining the level of storage risk, the firm will then need to look at thousands of \"business, technology, and operational variables,” before being able to work out how much of a premium to charge, stating:</p><blockquote>“Once we have the answers to all the applicable questions, we determine what kind of premium we would need to charge to justify taking on the risk.”</blockquote><p>That being said, <a href=\"https://cointelegraph.com/news/crypto-insurance-market-expands-with-decentralized-and-centralized-options\">crypto insurance providers</a> are usually unwilling to insure individuals whodon’t hold assets on an exchange — such as through self-custody or other means.</p><p>Adrian Przelozny, CEO of the Australian crypto exchange Independent Reserve, said that this is because it “would be very hard” for a customer to prove to the insurance provider they actually lost the crypto and didn’t just take it themselves.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">: Crypto hacks are down (for now)<br>Following a record-setting 2022, which saw USD 3.7 billion in stolen crypto, new research from TRM Labs shows crypto hacks are down 70% in Q1 2023. What&#39;s driving the trend and how long will last  <a href=\"https://t.co/exxBwJKzjP\">https://t.co/exxBwJKzjP</a></p>&mdash; TRM Labs (@trmlabs) <a href=\"https://twitter.com/trmlabs/status/1660824583652376581?ref_src=twsrc%5Etfw\">May 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Przelozny explained that while the provider only insures assets on the exchange platform itself, its “customers have a direct relationship with the insurer,” and “can choose to have 100% insurance coverage,” for a small fee when signing up.</p><p>He added that it’s a long insurance contract with many events covered, from hacks to “theft caused by our team.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/can-you-recover-stolen-bitcoin-from-crypto-scams\"><strong><em>Can you recover stolen Bitcoin from crypto scams?</em></strong></a></p><p>Meanwhile, a spokesperson for cryptocurrency exchange Binance told Cointelegraph that its emergency insurance fund, the Secure Asset Fund for Users (SAFU), is managed internally.</p><p>“It is a fund that is owned by Binance [that] was established in July 2018 to protect users’ interests,” they said. </p><p>“A verified loss sustained by a user from a vulnerability or other deficiency in Binance’s security systems and/or security protocols would be covered by SAFU,” said the spokesperson.</p><p>Simon Dixon,  CEO of online investment platform BnkToTheFuture, however, believes there are things that traditional insurance providers can learn from their crypto counterparts to improve their practices.</p><blockquote>“There is an opportunity to improve on traditional insurance with Smart Contracts and make it more accessible to all which I look forward to seeing grow as an industry, with our sector's usual growing pains.”</blockquote><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/hyperbitcoinization-underway-rfk-seeks-bitcoin-donations-hodlers-digest/\"><strong><em>Hyperbitcoinization is underway, RFK seeks Bitcoin donations and other news: Hodler’s Digest, May 14-20</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  }
]