[
  {
    "source": "Bitcoin.com",
    "date": "2023-09-15T00:00:22.000Z",
    "title": "Coinbase CEO Urges Defi Protocols to Challenge Regulatory Crackdowns in Court",
    "url": "https://news.bitcoin.com/coinbase-ceo-urges-defi-protocols-to-challenge-regulatory-crackdowns-in-court/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/brian-armstrong-defi-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Coinbase CEO Urges Defi Protocols to Challenge Regulatory Crackdowns in Court\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/brian-armstrong-defi-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/brian-armstrong-defi-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/brian-armstrong-defi-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/brian-armstrong-defi-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/brian-armstrong-defi-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/brian-armstrong-defi-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/brian-armstrong-defi.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The CEO of the cryptocurrency exchange Coinbase has encouraged decentralized finance (defi) protocols to fight regulators in court if they face regulatory crackdowns. He stressed that the Commodity Futures Trading Commission (CFTC) “should not be creating enforcement actions against decentralized (defi) protocols,” emphasizing that they are not financial service businesses. “The only thing this is [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-15T00:00:21.000Z",
    "title": "75% Of All Binance Fiat Trading Volume Is In Turkish Lira",
    "url": "https://www.newsbtc.com/binance/binance-fiat-trading-volume-turkish-lira/",
    "description": "75% of all fiat volume in Binance, the largest cryptocurrency exchange by client count, is dominated by the Turkish Lira (TRY). At this rate, Kaiko, a blockchain analytics firm, confirms that the Turkish Lira is the most preferred currency, pointing to a shift in the global dynamics, especially regarding crypto adoption.  Turkish Lira Popular Fiat In Binance As of September 14, 75% of all fiat volume was in Turkish Lira, ahead of the Euro and Brazilian Real (BRL). In the past three years, an unidentified cryptocurrency has gained popularity over traditional fiat currencies. From 2021, TRY&#8217;s use was among the lowest, with the Euro and BRL being popular. However, the trend changed in 2022 as adoption spiked, pushing the currency to the top in 2023. Related Reading: FTX’s Billion-Dollar Solana Liquidation: Market Crash Or Just Hype? When writing on September 14, Binance remains the most popular cryptocurrency exchange, supporting over 380 coins. At the same time, the crypto exchange supports over ten fiat currencies, of which other coins, besides those mentioned above, include the Nigerian Naira, GBP, and the Australian Dollar (AUD).  Looking at statistics, USDT, TUSD, and FUSD pairs are among the most liquid. This observation has been confirmed by Kaiko data, which shows that fiat trading on Binance had contracted by over 95% from 2021 when prices of top crypto assets peaked. By November 2021, Bitcoin prices had soared to nearly $70,000, lifting trading volumes in fiat and stablecoin pairs. USDT And Stablecoins Still Reign Supreme CoinMarketCap data reveals that the BTC/USDT pair is the most liquid, with the average daily trading volume exceeding $986 million when writing. On the other hand, the BTC/TUSD attracts over $486 million in trading volume.  This development highlights the level of liquidity of stablecoins and how they are entrenched in crypto trading. For example, the processing of fiat deposits or withdrawals on Binance can range from hours to days, depending on the method used. Unlike fiat currencies, stablecoins are more fluid and can be transferred within seconds. For instance, USDT, the world&#8217;s largest stablecoin by market cap, is available in over five blockchains, with Ethereum and Tron emerging as the most popular minting platforms.  Related Reading: Analyst’s Ultra Bullish Prediction Puts XRP Price At $10,000, But When? Following the delisting of USDC, BUSD volumes spiked. However, the New York Department of Financial Services (NYDFS) directive, barring Paxos&#8211;the then issuer&#8211;from minting new tokens, saw activity shrink as USDT cemented its position. TUSD and FUSD activity on Binance remains high, as data shows. A recent survey by KuCoin, a crypto exchange, reveals that over 50% of people in Turkey own crypto. The Turkish government has also been experimenting with a central bank digital currency (CBC), the Digital Lira. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-09-15T00:00:27.000Z",
    "title": "Top Trader Says 2019-Style Market Expansion Coming to Crypto Markets – Here’s His Timeline",
    "url": "https://dailyhodl.com/2023/09/14/top-trader-says-2019-style-market-expansion-coming-to-crypto-markets-heres-his-timeline/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/09/top-trader-style-his.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/09/top-trader-style-his.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/09/top-trader-style-his.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/09/top-trader-style-his.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/09/top-trader-style-his.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/09/top-trader-style-his.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/09/top-trader-style-his.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist is predicting a massive expansion for the digital assets market similar to what occurred in 2019. Pseudonymous analyst The Flow Horse, also known as Cantering Clark, tells his 182,300 X followers that the crypto market could end this year on a positive note. In 2019, the crypto markets bounced back [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/09/14/top-trader-says-2019-style-market-expansion-coming-to-crypto-markets-heres-his-timeline/\">Top Trader Says 2019-Style Market Expansion Coming to Crypto Markets – Here’s His Timeline</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]