[
  {
    "source": "Decrypt",
    "date": "2023-09-19T15:01:12.000Z",
    "title": "Decrypt’s 1000x Launches First-of-its-Kind Affiliate Program for Degens",
    "url": "https://decrypt.co/197405/1000x-affiliate-program-degens",
    "description": "The affiliate program allows partners to make 25% commission by growing the 1000x community of risk-hungry degens."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-19T14:46:28.000Z",
    "title": "Why is Litecoin price up today?",
    "url": "https://cointelegraph.com/news/why-is-litecoin-price-up-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-03/41b86269-3174-43a2-9dc8-a579feb96cb8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Litecoin price is up today, mirroring a broader crypto market rebound ahead of this week's Fed rate decision.</p>\n                    <p><p>Litecoin (<a href=\"https://cointelegraph.com/ltc-price-index\">LTC</a>) price is up today, hitting a fresh three-week high amid a broader cryptocurrency market rally.</p><p>On Sep. 19, LTC price rose 3.85% to nearly $68.50, outperforming the crypto market that gained 2% on the same day. Still, the Litecoin market has underperformed the broader crypto market in 2023. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-investors-federal-reserve-100-billion-loss\">Bitcoin investors are bullish on the US Fed’s $100B loss</a></em></strong></p><p>It's down 3.85% year-to-date (YTD) compared to the latter's <a href=\"https://cointelegraph.com/market-releases/6-new-cryptocurrencies-with-potential-to-watch-in-2023\">39% gains</a> in the same period. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/d5254bb9-8d72-49cd-b220-a58e90ded89e.png\"  /><figcaption style=\"text-align: center;\"><em>LTC/USD daily price chart. Source: TradingView</em></figcaption></figure><h2>Rate pause bets boost Litecoin's price recovery</h2><p>Most of this week's attention in the market is on the Federal Open Market Committee (FOMC) meeting concluding on Sep. 20. There, Federal Reserve officials will likely decide to <a href=\"https://cointelegraph.com/news/fomc-btc-price-local-bottom-5-things-bitcoin-this-week\">pause the ongoing interest rate hikes</a>. </p><p>The rate pause bets have boosted investors' appetite for risky assets, with U.S. stocks and most crypto assets rising ahead of the decision. At the same time, the <a href=\"https://cointelegraph.com/news/how-does-the-u-s-dollar-index-dxy-impact-cryptocurrencies-watch-macro-markets\">U.S. dollar</a> has underperformed against a basket of top foreign currencies, with its benchmark index down 0.5% week-to-date, including selloffs on Sep. 19.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/eef68404-ab85-44e6-b0ba-9b9e224cfcaf.png\"  /><figcaption style=\"text-align: center;\"><em>U.S. dollar index daily performance chart. Source: TradingView</em></figcaption></figure><p>Litecoin and the dollar's weekly correlation coefficient has been negative since December 2021, meaning their probability of trending opposite to one another remains high. LTC is, therefore, moving higher on Sep. 19 simultaneous to the dollar's downside moves.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/b7d8426d-a874-415c-a0c1-4ea2db99500a.png\"  /><figcaption style=\"text-align: center;\"><em>LTC/USD vs. U.S. dollar index weekly performance chart. Source: TradingView</em></figcaption></figure><h2>LTC price: technical rebound</h2><p>Litecoin's market gains on Sep. 19 come as a part of a rebound trend that started last week.</p><p>Notably, the buying started near what appears to be a long-term ascending trendline support, which has capped Litecoin's downside attempts since December 2018. The LTC price has bounced 18.5% eight days after testing the said trendline.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/65d67eb2-8c4b-4e11-accd-0ce9390740ae.png\"  /><figcaption style=\"text-align: center;\"><em>LTC/USD weekly price chart. Source: TradingView</em></figcaption></figure><h2>Short liquidations</h2><p>Litecoin's price gains has resulted in short liquidations worth around $477,300 on Sep. 19. In comparison, only $87,850 worth of long positions have faced liquidations, as shown in the CoinGlass chart below.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/bfa9a167-0bc5-40b4-b3c6-d2b96d436e20.png\"  /><figcaption style=\"text-align: center;\"><em>LTC total liquidation chart. Source: CoinGlass</em></figcaption></figure><p>Liquidating short positions require derivatives traders to buy the underlying asset, which, coupled with the buying behavior in spot markets, boost the asset's prices.</p><h2>Litecoin price analysis for Q3/2023</h2><p>From a technical standpoint, a Litecoin price bounce from its long-standing ascending trendline support could extend toward its multi-month descending trendline resistance, as shown below.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/df751522-e958-4091-bac8-a69f50163ce4.png\"  /><figcaption style=\"text-align: center;\"><em>LTC/USD weekly price chart. Source: TradingView</em></figcaption></figure><p>As a result, LTC price can reach $78.50 as its next upside target in the coming weeks, up around 16.5% from current price levels. The $78.50-level has served as support in March 2023 and June 2023 and was also resistance in January 2023.</p><p>In addition, this level coincides with Litecoin's 50-week exponential moving average (50-week EMA; the red wave in the chart above).</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-19T14:54:56.000Z",
    "title": "Why Savvy Investors Are Swapping Chainlink (LINK) and Hedera (HBAR) for Tradecurve Markets (TCRV) – Find Out Here",
    "url": "https://cryptodaily.co.uk/2023/09/why-savvy-investors-are-swapping-chainlink-link-and-hedera-hbar-for-tradecurve-markets-tcrv-find-out-here",
    "description": "A notable trend in the crypto market has emerged, which involves investors swapping their Chainlink (LINK) and Hedera (HBAR) holdings for Tradecurve Markets (TCRV). This article will delve into this fascinating trend and explain why Tradecurve Markets is catching the attention of savvy investors."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-19T14:48:43.000Z",
    "title": "From Legacy to Lively: Cardano (ADA) and Tezos (XTZ) Investors Warm Up to Pomerdoge (POMD) 's P2E Potential",
    "url": "https://cryptodaily.co.uk/2023/09/from-legacy-to-lively-cardano-ada-and-tezos-xtz-investors-warm-up-to-pomerdoge-pomd-s-p2e-potential",
    "description": "The crypto world is abuzz as investors from legacy coins like Cardano (ADA) and Tezos (XTZ) are beginning to recognize the potential of upcoming projects like Pomerdoge (POMD)"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-19T14:57:03.000Z",
    "title": "Kunji Finance to Launch IDO on Poolz Finance and GameFi",
    "url": "https://cryptodaily.co.uk/2023/09/kunji-finance-to-launch-ido-on-poolz-finance-and-gamefi",
    "description": "Kunji Finance to Launch IDO on Poolz Finance and GameFi"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-09-19T14:58:50.000Z",
    "title": "Partisia Blockchain unveil the future of Web3 with MetaMask Snaps",
    "url": "https://cryptodaily.co.uk/2023/09/partisia-blockchain-unveil-the-future-of-web3-with-metamask-snaps",
    "description": "Partisia Blockchain unveil the future of Web3 with MetaMask Snaps"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-19T15:05:09.000Z",
    "title": "German regulatory authority compares certain defi projects to ‘unidentifiable flying objects’",
    "url": "https://crypto.news/german-regulatory-authority-compares-certain-defi-projects-to-unidentifiable-flying-objects/",
    "description": "Rupert Schaefer, the executive director of strategy, policy, and control at BaFin, the German financial regulatory authority, emphasized the significance of establishing a unified global regulatory framework for the cryptocurrency sector. Drawing a comparison to aviation, Schaefer likened regulators to&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-19T15:00:45.000Z",
    "title": "Bitcoin Rally Driven By Coinbase Users? Premium Would Say So",
    "url": "https://www.newsbtc.com/all/bitcoin-rally-driven-by-coinbase-users-premium/",
    "description": "The Bitcoin Coinbase Premium Gap has been positive during the past few days, implying the surge above $27,000 may be driven by the platform&#8217;s users. Coinbase Users Have Been Participating In Aggressive Bitcoin Buying Recently In a new post on X, the CryptoQuant Netherlands community manager, Maartunn, has pointed out how there appears to have been buying going on at Coinbase recently. The relevant indicator here is the &#8220;Coinbase Premium Gap,&#8221; which keeps track of the difference between the Bitcoin prices listed on the cryptocurrency exchanges Coinbase and Binance. The former platform is more popular among US-based investors (including large institutional holders), while the latter receives more global traffic. As such, the Premium Gap&#8217;s value may provide insight into how the behaviors of these two audiences differ. When the value of this metric is positive, it means that the price on Coinbase is greater than that on Binance right now. This would imply that the American investors have either been applying a higher buying pressure or a lower selling pressure as compared to the global users. Related Reading: This Bitcoin Metric Continues To Retest Bear-Bull Junction, Will A Break Happen? Now, here is a chart that shows the trend in the Bitcoin Coinbase Premium Gap over the last few days: Looks like the value of the metric has been going up in recent days &#124; Source: @JA_Maartun on X As displayed in the above graph, the Bitcoin Coinbase Premium Gap had been negative earlier in the month, implying that Coinbase users had been selling more than Binance users. The metric had turned especially deep in the leadup to and during the plunge towards the $25,000 level, suggesting the selloff was driven by the American holders. During the recovery that had followed, the Premium Gap had turned positive, but only after a delay, implying that the US-based investors didn&#8217;t initially contribute towards the surge. Since then, however, the indicator has remained at notable positive values, meaning that the platform&#8217;s user base has been constantly accumulating the cryptocurrency. Related Reading: Next Bitcoin Peak: Why It Could Still Be 2 Years Away From the graph, it&#8217;s visible that the buying on Coinbase appears to have only ramped up during the past couple of days, as the Premium Gap has observed a sharp spike. The timing of this surge could indicate that the US-based investors are the ones helping the asset&#8217;s recent growth beyond the $27,000 level. This is a good sign, naturally, as strong buying pressure from the US institutional holders could provide the appropriate fuel for the cryptocurrency to retest higher levels. It now remains to be seen whether the Bitcoin Coinbase Premium Gap would continue to remain at positive values in the coming days, or if buying would cool down on the platform. BTC Price Bitcoin had observed a sharp drop from the $27,200 level to $26,600 yesterday but has since made a swift recovery back to the mark, as the below chart displays. BTC has gone through a bit of a rollercoaster during the past couple of days &#124; Source: BTCUSD on TradingView Featured image from Michael Förtsch on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-19T15:00:13.000Z",
    "title": "New Meme coin Offer Solace to Discouraged WOJAK Investors: 20x Potential ROI Looks Enticing",
    "url": "https://www.crypto-news-flash.com/new-meme-coin-offer-solace-to-discouraged-wojak-investors-20x-potential-roi-looks-enticing/?utm_source=rss&utm_medium=rss&utm_campaign=new-meme-coin-offer-solace-to-discouraged-wojak-investors-20x-potential-roi-looks-enticing",
    "description": "<img width=\"512\" height=\"272\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-93.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-93.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-93-300x159.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-93-351x185.jpg 351w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Crypto investors and whales are renowned for their big investments and strategic profit-seeking moves. They continuously research various crypto projects, carefully assessing their market potential. When whales decide to make a move, it typically signifies a well-considered and credible decision. Recently, there has been a noticeable trend among WOJAK whales and investors who are shifting [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-19T14:55:32.000Z",
    "title": "BNB Bulls Tread Cautiously Amid SEC-Binance Showdown",
    "url": "https://www.crypto-news-flash.com/bnb-bulls-tread-cautiously-amid-sec-binance-showdown/?utm_source=rss&utm_medium=rss&utm_campaign=bnb-bulls-tread-cautiously-amid-sec-binance-showdown",
    "description": "<img width=\"1920\" height=\"1277\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binace-bnb-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Binace Japan\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binace-bnb-2.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binace-bnb-2-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binace-bnb-2-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/03/binace-bnb-2-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Binance Coin (BNB) faces uncertainty due to SEC pressure and executive departures, making investors cautious. BNB&#8217;s market sentiment is declining despite high trading volumes, reflecting worries about regulatory troubles. Binance Coin (BNB), a prominent player in the cryptocurrency world, grapples with various challenges that have left investors and enthusiasts on edge. This piece explores the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-19T14:43:55.000Z",
    "title": "High-Stakes Lawsuit: Dogecoin Inventor and Influencers Accused in $258 Billion Battle",
    "url": "https://www.crypto-news-flash.com/high-stakes-lawsuit-dogecoin-inventor-and-influencers-accused-in-258-billion-battle/?utm_source=rss&utm_medium=rss&utm_campaign=high-stakes-lawsuit-dogecoin-inventor-and-influencers-accused-in-258-billion-battle",
    "description": "<img width=\"1000\" height=\"664\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5-768x510.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/04/mk1one-Dogecoin5-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />The Dogecoin lawsuit has indicted more influencers and personalities in the industry. The indicted influencers include Dogecoin co-creator, Billy Markus. The Dogecoin (DOGE) lawsuit which involves Elon Musk, Tesla’s CEO who doubles as the world&#8217;s richest man, seems to be getting messy by the day. A new court filing has shown that some celebrities and [...]"
  }
]