[
  {
    "source": "CryptoSlate",
    "date": "2023-07-18T19:25:44.000Z",
    "title": "US lawmaker urges SEC to rethink crypto regulation following landmark XRP ruling",
    "url": "https://cryptoslate.com/us-lawmaker-urges-sec-to-rethink-crypto-regulation-following-landmark-xrp-ruling/",
    "description": "<p>U.S. lawmaker Ritchie Torres has urged the Securities and Exchange Commission (SEC) to reconsider its approach to regulation in the cryptocurrency industry following Judge Analisa Torres&#8217;s landmark ruling, according to a July 18 letter directed at chair Gary Gensler. On June 13, Judge Torres ruled that the programmatic sales of XRP did not constitute a securities [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/us-lawmaker-urges-sec-to-rethink-crypto-regulation-following-landmark-xrp-ruling/\">US lawmaker urges SEC to rethink crypto regulation following landmark XRP ruling</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-18T19:33:00.000Z",
    "title": "Celsius Network Dumps Various Altcoins on Exchanges Including $LINK, $BNB, and $ZRX",
    "url": "https://www.cryptoglobe.com/latest/2023/07/celsius-network-dumps-various-altcoins-on-exchanges-including-link-bnb-and-zrx/",
    "description": "Bankrupt cryptocurrency lending platform Celsius Network has started divesting of a signficnat amount of altcoins, at a time in which it faces managerial unrest after its former CEO, Alex Mashinsky, was arrested over a slew of federal charges. According to data from on-chain analytics service Lookonchain, Celsius Network has embarked on a massive sale of […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-18T19:15:00.000Z",
    "title": "Oasis Network Launches Sapphire Privacy Blockchain $ROSE",
    "url": "https://cryptodaily.co.uk/2023/07/oasis-network-launches-sapphire-privacy-blockchain-rose",
    "description": "<p class=\"md-end-block md-p\">Oasis Network, developers of privacy-centric blockchain products, has announced the launch of Sapphire, a privacy-focused Ethereum Virtual Machine (EVM)-compatible blockchain.</p>\n<p class=\"md-end-block md-p\">The chain makes use of Oasis's privacy layer, and aims to offer a more secure platform for existing decentralized apps across EVM networks, eliminating the need for cross-chain swaps.</p>\nSapphire: A New Dawn for Web3 Development\n<p class=\"md-end-block md-p\">Sapphire represents an exciting development for privacy-focused Web3 development. With its unique privacy-first features, it is set to significantly enhance the security of dApps on any EVM network. </p>\n<p class=\"md-end-block md-p\">Oasis Foundation Director Jernej Kos explained how the Oasis Privacy Layer (OPL) and Sapphire work in harmony to bolster the functionality of DApps. Specifically, he outlined how DApps can incorporate various features of Sapphire without migrating to the Oasis blockchain.</p>\n\n<p class=\"md-end-block md-p\">\"Being fully EVM-compatible means that developers can build private smart contracts in an environment that they are already familiar with,\" Kos stated.</p>\n\n<p class=\"md-end-block md-p\">Sapphire's full compatibility with EVM environments also bolsters cross-chain Web3 development, providing a confidential voting mechanism for decentralized autonomous organization (DAO) smart contracts, for instance. The outcome of such confidential voting can then be conveyed to the core DAO contract on a different chain.</p>\nUnlocking the Power of Privacy\n<p class=\"md-end-block md-p\">The majority of DApps built on the Oasis blockchain are privacy-centric, and this trend is reflected in the tools and platforms developed within the Oasis ecosystem. Sapphire's release is expected to drive the development of privacy-enabled blockchain games, confidential decentralized exchanges, private voting systems, sealed-bid auctions, and key management tools, among other applications.</p>\n<p class=\"md-end-block md-p\">Sapphire employs Oasis' proprietary privacy technology that relies on a secure computing technology known as a Trusted Execution Environment (TEE), which serves as a secure enclave for smart contract execution. During execution, encrypted data is fed into the Secure Enclave alongside the smart contract, where it's decrypted and processed. The data is then re-encrypted before it leaves the Secure Enclave, ensuring that user data remains confidential and isn't disclosed to node operators or application developers.</p>\nA Gateway to Familiarity and Interoperability\n<p class=\"md-end-block md-p\">Sapphire offers a familiar environment for blockchain developers due to its EVM compatibility. User-facing tools like the Web3 gateway, wallets, and block explorers are already familiar to many, and developers will recognize tools such as Solidity/Vyper, Hardhat/Truffle, and Web3.js/Ethers. Developers can port their DApps to Sapphire within minutes and start using its privacy technology and built-in functions such as Random Number Generation (RNG), signing, and encryption.</p>\n<p class=\"md-end-block md-p\">The launch of Sapphire on testnet marks an important milestone in Oasis's roadmap. Oasis has already planned a mainnet deployment for later this year and is encouraging developers to utilize the testnet to familiarize themselves with Sapphire's capabilities. In an effort to cultivate a vibrant developer community around Sapphire, Oasis plans to host its first Sapphire Hackathon in September.</p>\n<p class=\"md-end-block md-p\">Sapphire&rsquo;s inception offers a more privacy-focused era for Web3 development, enabling developers to incorporate enhanced security features into their DApps without compromising the familiarity of their build environment. The privacy capabilities offered by Sapphire represent an essential step in the pursuit of a more secure and private Web3 environment, advancing the blockchain industry's progress towards widespread Web3 adoption.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-18T19:30:22.000Z",
    "title": "Scarce Open Market Supply of Top Two Gold Tokens as Concentration Levels Run High Among Top Holders",
    "url": "https://news.bitcoin.com/scarce-open-market-supply-of-top-two-gold-tokens-as-concentration-levels-run-high-among-top-holders/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/2gold2gold-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Scarce Open Market Supply of Top Two Gold Tokens as Concentration Levels Run High Among Top Holders\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/2gold2gold-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/2gold2gold-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/2gold2gold-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/2gold2gold-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/2gold2gold-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/2gold2gold-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/2gold2gold.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Over the last six months, the value of an ounce of gold has witnessed a 3.8% surge in relation to the U.S. dollar. Within the realm of cryptocurrencies, there exist two noteworthy tokens backed by gold: pax gold (PAXG) and tether gold (XAUT). Together, these tokens amass a considerable worth of nearly $1 billion. Although [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T19:38:41.000Z",
    "title": "Chainlink launches cross-chain protocol on its mainnet",
    "url": "https://www.cryptopolitan.com/chainlink-launches-protocol-mainnet/",
    "description": "Chainlink, a dominant data oracle provider, has unveiled its Cross-Chain Interoperability Protocol (CCIP) on the Mainnet, marking a significant milestone in the blockchain and decentralized finance (DeFi) landscape. With early access support for Avalanche, Ethereum, Optimism, and Polygon (MATIC) networks, CCIP has already garnered adoption from major DeFi lending protocols like Aave and Synthetix. Chainlink ... <a title=\"Chainlink launches cross-chain protocol on its mainnet\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-launches-protocol-mainnet/\" aria-label=\"More on Chainlink launches cross-chain protocol on its mainnet\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T19:37:20.000Z",
    "title": "HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?",
    "url": "https://www.cryptopolitan.com/hbar-price-prediction/",
    "description": "HBAR Price Prediction 2023-2032 Hedera Hashgraph is a trending cryptocurrency focused on providing a sustainable, enterprise-grade blockchain.&#160; The asset has been performing extremely well recently, prompting investors everywhere to search for a Hedera Hashgraph price prediction. So that is a heads-up in crypto winter despite the doom which tends to pull everyone else connected to ... <a title=\"HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hbar-price-prediction/\" aria-label=\"More on HBAR Price Prediction 2023-2032: Hedera Hashgraph Soon to Retest its ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T19:34:22.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T19:23:02.000Z",
    "title": "Celo announces transition to layer-2 network on Ethereum",
    "url": "https://www.cryptopolitan.com/celo-announces-transition-network-ethereum/",
    "description": "C Labs, the development team behind the Celo blockchain, has unveiled a proposal to transition from being an independent layer-1 blockchain to a layer-2 solution on Ethereum. The decision was announced on Twitter, following extensive research and discussions with members of both communities. The Celo team will release the proposal by July 22 A preliminary ... <a title=\"Celo announces transition to layer-2 network on Ethereum\" class=\"read-more\" href=\"https://www.cryptopolitan.com/celo-announces-transition-network-ethereum/\" aria-label=\"More on Celo announces transition to layer-2 network on Ethereum\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T19:12:34.000Z",
    "title": "Congressman Ritchie Torres asks SEC to stop its assault on crypto",
    "url": "https://www.cryptopolitan.com/congressman-ritchie-torres-asks-sec-to-stop-its-assault-on-crypto/",
    "description": "US Congressman Ritchie Torres has written a scathing letter to the SEC Chair, Gary Gensler, urging SEC to stop its assault on cryptocurrencies. In the aftermath of a decisive lawsuit loss against Ripple Labs, wherein the court ruled XRP was not a security, Torres questioned the SEC&#8217;s continued, harsh scrutiny of digital assets in one ... <a title=\"Congressman Ritchie Torres asks SEC to stop its assault on crypto\" class=\"read-more\" href=\"https://www.cryptopolitan.com/congressman-ritchie-torres-asks-sec-to-stop-its-assault-on-crypto/\" aria-label=\"More on Congressman Ritchie Torres asks SEC to stop its assault on crypto\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-18T19:11:47.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here&#8217;s a ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy the AVAX Dip?\">Read more</a>"
  }
]