[
  {
    "source": "CoinDesk",
    "date": "2023-07-20T16:00:00.000Z",
    "title": "UK's FCA Is Designing Prudential Requirements for Firms Carrying Out Crypto Activities",
    "url": "https://www.coindesk.com/policy/2023/07/20/uks-fca-is-designing-prudential-requirements-for-firms-carrying-out-crypto-activities/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Financial Conduct Authority will consult on rules once the government gives it the necessary powers, the regulator said in its annual report."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-20T16:00:00.000Z",
    "title": "UK financial watchdog announces launch of permanent Digital Sandbox in August",
    "url": "https://cointelegraph.com/news/uk-financial-watchdog-announces-launch-digital-sandbox",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/a50090f2-350c-4feb-8333-16c41ddd7482.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>According to the FCA, the sandbox will be open to businesses, start-ups and data providers, including those involved in banking, investment, lending and payments.</p>\n                    <p><p>The United Kingdom's Financial Conduct Authority (FCA) has announced the launch of a Digital Sandbox aimed at supporting tech firms in the early stages of product development.</p><p>In a July 20 announcement, the FCA <a href=\"https://www.fca.org.uk/news/news-stories/launch-permanent-digital-sandbox\" target=\"_blank\" rel=\"noopener nofollow\">said</a> the Digital Sandbox will become available on a permanent basis starting on Aug. 1. The financial watchdog conducted two pilot programs of the initiative, which will be open to businesses, start-ups and data providers — including those involved in banking, investment, lending and payments.</p><p>A sandbox allows projects to operate in a testing environment to evaluate their products and services largely without unintended side effects impacting the real world. According to the FCA, the Digital Sandbox was aimed at helping innovative firms in their efforts to launch new products and services, as well as support economic growth and international competitiveness.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/crypto-uk-rejects-regulating-crypto-gambling\"><strong><em>UK government rejects lawmaker’s call to treat crypto like gambling</em></strong></a></p><p>The U.K.’s Economic and Finance Ministry proposed a “financial market infrastructure sandbox\" in April 2022 <a href=\"https://cointelegraph.com/news/uk-government-moves-forward-with-regulatory-framework-on-stablecoins-for-payments\">alongside its plans</a> for a regulatory framework on payment stablecoins. HM Treasury has also <a href=\"https://cointelegraph.com/news/uk-treasury-exclude-derivatives-unbacked-tokens-regulatory-sandbox\">opened up a consultation</a> for a digital securities sandbox which could include crypto products in July.</p><p>On July 3, the European Commission <a href=\"https://cointelegraph.com/news/eu-blockchain-sandbox-unveils-first-20-use-cases-after-wave-applications\">announced 20 projects</a> had been selected for an EU regulatory sandbox. Those qualifying for the initiative included firms in finance and capital markets, telecoms and information technology and global trade.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-20T15:57:29.000Z",
    "title": "Bitcoin rejects at 21-day trendline — How low can BTC price go?",
    "url": "https://cointelegraph.com/news/bitcoin-price-rejects-trendline-btc-how-low-go",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/51bf8507-cb6c-4e15-9245-da29ce724014.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>BTC price fails to protect the $30,000 mark after a brief resurgence, and Bitcoin traders are not confident of new highs.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) failed to hold above $30,000 after the July 20 Wall Street open as one analyst forecast a return to range lows.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/1caf26d0-3b81-4add-a62a-a9c652361309.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-hour chart. Source: TradingView</em></figcaption></figure><h2>BTC price sinks through $30,000</h2><p>Data from <a href=\"https://pro.cointelegraph.com/?via=markets&amp;_ga=2.173325223.503936973.1685953699-1136475544.1627545224\">Cointelegraph Markets Pro</a> and <a href=\"https://www.tradingview.com/symbols/BTCUSD/?exchange=BINANCE\" target=\"_blank\" rel=\"noopener nofollow\">TradingView</a> tracked weak BTC price action after a rejection at the 21-day simple moving average (SMA).</p><p>Sitting at $30,400, that SMA provided the day’s high for Bitcoin, with the market then retracing its intraday progress entirely.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/0449e3f0-a51c-42cc-8bf4-230e4c2b5e1e.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD 1-day chart with 21SMA. Source: TradingView</em></figcaption></figure><p>Reacting, Michaël van de Poppe, founder and CEO of trading firm Eight, warned that lower levels could well come next.</p><p>“Not breaking the crucial area, seems like we're going to have another sweep of the low for Bitcoin,” he <a href=\"https://twitter.com/CryptoMichNL/status/1682042874123419653\" target=\"_blank\" rel=\"noopener nofollow\">told</a> Twitter followers.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/036d2075-81cd-4821-8c17-19883310ba8d.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Michaël van de Poppe</em><em>/Twitter</em></figcaption></figure><p>Popular trader Daan Crypto Trades added that volatility could return thanks to rising open interest.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Open Interest rising sharply near these levels.<br><br>Likely more volatility ahead for <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a>.<br><br>Stay safe  <a href=\"https://t.co/GqUnaH20Ha\">pic.twitter.com/GqUnaH20Ha</a></p>&mdash; Daan Crypto Trades (@DaanCrypto) <a href=\"https://twitter.com/DaanCrypto/status/1682043890986266624?ref_src=twsrc%5Etfw\">July 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“Bitcoin Has been finding support on the bottom of the range and 4H 200MA/EMA,” he <a href=\"https://twitter.com/DaanCrypto/status/1682022741065764867\" target=\"_blank\" rel=\"noopener nofollow\">continued</a> in a further Twitter post about the 4-hour 200-period moving average and exponential moving average. </p><blockquote>“So far, the bounce has not been very convincing yet and the lower timeframes are extremely choppy. $30.5K and $29.5K remain my levels of interest in the short term.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/e229addb-9efc-4110-b8e3-b05741e28981.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD annotated chart. Source: Daan Crypto Trades/Twitter</em></figcaption></figure><p>On-chain monitoring resource Material Indicators meanwhile noted the significance of the 21-day SMA, suggesting that a temporary peak may be in for BTC/USD.</p><p>“A hard rejection from technical resistance at the 21-Day Moving Avg and more asks stacking at $31k could indicate things are getting toppy for the moment,” part of the day’s analysis <a href=\"https://twitter.com/MI_Algos/status/1682017859113721858?s=20\" target=\"_blank\" rel=\"noopener nofollow\">read</a>. </p><blockquote>“Bulls need to regroup here and gather the herd if they want a legit chance to stampede past those sell walls.”</blockquote><p>A <a href=\"https://twitter.com/MI_Algos/status/1682005042897797120/photo/1\" target=\"_blank\" rel=\"noopener nofollow\">prior print</a> of the Binance BTC/USD order book showed a lack of bid liquidity immediately below the $30,000 mark.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/4d25a8c6-313a-4b0c-84b7-af8c34769cac.png\"  /><figcaption style=\"text-align: center;\"><em>BTC/USD order book data for Binance. Source: Material Indicators/Twitter</em></figcaption></figure><h2>Labor market data boosts U.S. dollar</h2><p>Macroeconomic events on the day meanwhile focused on strong tech earnings along with a slowdown in United States jobless claims.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/bitcoin-traders-get-ready-btc-price-preps-2023-bull-market\">Bitcoin traders say ‘get ready’ as BTC price preps 2023 bull market</a></em></strong></p><p>The impact on the U.S. dollar was pronounced, the U.S. dollar index (DXY) gaining ground to near 101 for the first time in several days.</p><p>\"So today, Initial Jobless Claims was less than previous &amp; forecasted so the trajectory expected for increasing layoffs is slower (lower is good for USD),\" popular trader Skew <a href=\"https://twitter.com/52kskew/status/1682051793537335296\" target=\"_blank\" rel=\"noopener nofollow\">wrote</a> in part of a response. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/02a50782-2002-46ab-a80e-068ded99519d.png\"  /><figcaption style=\"text-align: center;\"><em>U.S. dollar index (DXY) 1-day chart. Source: TradingView</em></figcaption></figure><p>Cointelegraph previously wrote about the <a href=\"https://cointelegraph.com/news/bitcoin-btc-price-40k-dollar-dxy-last-time\">changing dynamics</a> between BTC price performance and DXY strength.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\">Should you ‘orange pill’ children? The case for Bitcoin kids books</a></em></strong></p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-20T16:00:37.000Z",
    "title": "Rapid shift in Bitcoin liquidity reflects strong holder conviction",
    "url": "https://cryptoslate.com/insights/rapid-shift-in-bitcoin-liquidity-reflects-strong-holder-conviction/",
    "description": "<p>Quick Take The latest data reveals that a significant portion of the Bitcoin supply, approximately 15.2 million, is deemed illiquid. In other words, these are held by entities that aren&#8217;t regularly selling or trading, potentially implying a long-term investment strategy. On the other hand, around 4 million Bitcoin are classified as liquid or highly liquid, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/rapid-shift-in-bitcoin-liquidity-reflects-strong-holder-conviction/\">Rapid shift in Bitcoin liquidity reflects strong holder conviction</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-20T16:00:19.000Z",
    "title": "The Bitcoin futures contango",
    "url": "https://cryptoslate.com/the-bitcoin-futures-contango/",
    "description": "<p>As the crypto market matures, Bitcoin&#8217;s spot price is increasingly influenced by global geopolitical events, regulatory changes, traditional financial market movements, and other relevant macroeconomic events. However, the growing Bitcoin derivatives market also shapes Bitcoin&#8217;s price movements, albeit a smaller one. Futures and options contracts are particularly insightful for predicting Bitcoin&#8217;s future movements as they [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/the-bitcoin-futures-contango/\">The Bitcoin futures contango</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-20T16:00:00.000Z",
    "title": "A16z Exec Touts Promise of Web3 Social Platforms",
    "url": "https://cryptodaily.co.uk/2023/07/a16z-exec-touts-promise-of-web3-social-platforms",
    "description": "<p class=\"md-end-block md-p md-focus\">In a recent keynote speech at the Ethereum Community Conference (EthCC), Andreessen Horowitz (a16z) partner Sriram Krishnan expressed confidence that Web3 has the potential to remedy the issues plaguing current Web2-based social media platforms. </p>\n<p class=\"md-end-block md-p\">Krishnan criticized the state of modern social media, calling it &ldquo;stuck in a different era,&rdquo; and urging that it was time for a change. He proposed the construction of \"large-scale crypto consumer social media marketplace applications\" as the way forward.</p>\n<p class=\"md-end-block md-p\">The a16z partner highlighted key flaws in current social media platforms: a restrictive follower system, limited application programming interface support, meager economic benefits for creators, and a lack of user and creator input in platform governance.</p>\n<p class=\"md-end-block md-p\">In contrast, Krishnan painted an optimistic picture of the potential that Web3 social platforms could offer, emphasizing the opportunities they present to underserved communities and high-status individuals whose voices are muted on other platforms.</p>\nSocial Platforms From Web3\n<p class=\"md-end-block md-p\">Krishnan also proposed an unconventional approach to developing these platforms: eschewing financial incentives at the outset. Instead of initially focusing on monetary rewards for creators, Krishnan suggested centering the early stages of a platform's life on fostering community and engagement.</p>\n\n<p class=\"md-end-block md-p\">&ldquo;Social media dynamics are weird and complicated. These are complex human dynamics, and when you introduce money, I think it gets challenging to kind of map those dynamics,\" Krishnan claimed.</p>\n\n<p class=\"md-end-block md-p\">According to the exec, prioritizing the monetary aspect can detract from the aim of community building and enjoyment.</p>\nHandling Contradictions\n<p class=\"md-end-block md-p\">This doesn't mean the introduction of financial mechanisms should be completely foregone. According to Krishnan, once the platform has established its user base and community, creator economics and governance stakes can then be introduced. This incremental approach, he argues, could foster a more balanced and sustainable social media landscape.</p>\n<p class=\"md-end-block md-p\">On the outset, Krishnan's views hold a promising potential not only for the reinvention of social media platforms but for the broader realization of Web3's inherent capabilities. Web3 technology, built on decentralized blockchain systems, offers a level of transparency and user control not feasible within the limitations of previous Web2 environments. These traits could lend themselves well to creating a social media ecosystem more responsive to user needs and desires.</p>\n<p class=\"md-end-block md-p\">In this sense, then, the potential economic benefits offered by Web3 platforms could foster a more equitable digital environment. This is particularly significant for creators, who currently receive a minimal share of the revenue generated by their content on traditional platforms. Web3 has the potential to rectify this imbalance, offering creators a larger piece of the economic pie. The caution(s) proposed by Krishnan, to delay the introduction of financial incentives, could help ensure that these economic benefits do not overshadow the vital elements of community and engagement.</p>\n<p class=\"md-end-block md-p\">Despite such a potential, Krishnan's vision of the future of social media is by no means assured, though it does provide a compelling blueprint for what could be possible. By harnessing the power of Web3, the next generation of social media platforms might not only resolve the issues inherent in existing platforms, but also open up new avenues for user engagement and creator remuneration.</p>\n<p class=\"md-end-block md-p md-focus\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T15:47:43.000Z",
    "title": "FTX administrators seek recovery of $71 million from its philanthropic and life science entities",
    "url": "https://www.cryptopolitan.com/ftx-administrators-seek-recovery-71-million-philanthropic-life-science-entities/",
    "description": "In a bid to recover funds for creditors, administrators overseeing the bankruptcy proceedings of crypto exchange FTX are pursuing the retrieval of over $71 million from the exchange&#8217;s philanthropic arm, the FTX Foundation, and Sam Bankman-Fried&#8217;s Latona life sciences fund. These entities had received investments totaling $71.5 million from FTX and Alameda Research, which were ... <a title=\"FTX administrators seek recovery of $71 million from its philanthropic and life science entities\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ftx-administrators-seek-recovery-71-million-philanthropic-life-science-entities/\" aria-label=\"More on FTX administrators seek recovery of $71 million from its philanthropic and life science entities\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-20T15:42:37.000Z",
    "title": "Telegram bot tokens witness a meteoric rise, nearing $100M market cap milestone",
    "url": "https://www.cryptopolitan.com/telegram-bot-tokens-have-100m-market-cap/",
    "description": "The rise in the market cap of Telegram bot tokens, which are moving toward the elusive $100 million threshold, has made headlines in the crypto industry. Telegram&#8217;s influence on crypto is more important than ever as crypto traders swarm to take advantage of this emerging trend. What are Telegram bot tokens? These are automated programs ... <a title=\"Telegram bot tokens witness a meteoric rise, nearing $100M market cap milestone\" class=\"read-more\" href=\"https://www.cryptopolitan.com/telegram-bot-tokens-have-100m-market-cap/\" aria-label=\"More on Telegram bot tokens witness a meteoric rise, nearing $100M market cap milestone\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-20T16:00:35.000Z",
    "title": "Dogecoin’s Momentum Stalls, Pepe & TOADS Continues to Make Waves As DigiToads Presale Breaks Over $6.2 Million",
    "url": "https://www.crypto-news-flash.com/dogecoins-momentum-stalls-pepe-toads-continues-to-make-waves-as-digitoads-presale-breaks-over-6-2-million/?utm_source=rss&utm_medium=rss&utm_campaign=dogecoins-momentum-stalls-pepe-toads-continues-to-make-waves-as-digitoads-presale-breaks-over-6-2-million",
    "description": "<img width=\"512\" height=\"491\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T161702.297.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T161702.297.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-20T161702.297-300x288.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The crypto market has been abuzz with the attention that meme coins have drawn. For instance, even as Dogecoin records a dip in its popularity, Pepe Coin has been maintaining its momentum. At the same time, DigiToads (TOADS) has been making waves with its presale success. Powered by Ethereum, DigiToads is proof of how impactful [...]"
  }
]