[
  {
    "source": "Cointelegraph",
    "date": "2023-11-25T05:49:33.000Z",
    "title": "CZ challenges US gov't attempt to restrict travel before sentencing date",
    "url": "http://cointelegraph.com/news/changpeng-cz-zhao-us-government",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/e66b4ebe-a990-46cf-bdb5-042f3fd096d8.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Former Binance CEO Changpeng \"CZ\" Zhao has contested the U.S. Department of Justice's assertions that he is a flight risk and may not return before his sentencing next year.</p>\n                    <p><p>Former Binance CEO Changpeng \"CZ\" Zhao has opposed the United States government's efforts to block his return to the United Arab Emirates (UAE) to be with his family while awaiting sentencing following his guilty plea.</p><p>In a court <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.wawd.328570/gov.uscourts.wawd.328570.38.0_2.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> on November 23, Zhao’s lawyers urged the judge to reject the proposed alteration of his bail conditions, as put forth by the U.S. Department of Justice (DoJ). It was further reiterated that Zhao should be granted permission to leave the U.S. and return to the UAE until his sentencing in February 2024.</p><p>The lawyers firmly stated that he has no intention of staying in UAE to evade his sentencing date, despite the potential 18-month prison term.</p><blockquote>“As Judge Tsuchida found, all the facts and circumstances amply demonstrate that Mr. Zhao poses no risk of flight and should be permitted to reside at home with his family in the UAE pending sentencing. The government’s motion should be denied.”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/29267cf1-317a-4711-bf24-5014e810a00d.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Extract of court filing in the US District Court for the Western District of Washington. Source: CourtListener</em></figcaption></figure><p>Furthermore, Zhao's lawyers argued that he has taken responsibility for his actions by flying over from the UAE to the U.S.</p><p>\"His intent is to resolve this case and it would be illogical to take all of these material steps without the intent to appear for sentencing,\" the filing noted.</p><p>On November 22, U.S. prosecutors submitted a court filing, contending <a href=\"https://cointelegraph.com/news/cz-a-flight-risk-should-stay-in-us-doj\">that Zhao should be restricted</a> from leaving the United States due to the perceived flight risk. </p><p>The DoJ assert that if he chooses not to return for sentencing from the UAE, ensuring his return would pose challenges for the government.</p><p>However, as per a bond document filed to the court on November 21, it was disclosed that Zhao had a $175 million release bond and committed to returning to the U.S. 14 days before his sentencing date on February 23, 2024.</p><p><strong>Related: </strong><strong><a href=\"https://cointelegraph.com/news/crypto-biz-binance-cz-falls-grayscale-black-rock-meet-sec\">Crypto Biz: Binance’s CZ falls, Grayscale and BlackRock meet with SEC, and more</a></strong></p><p>This comes after Zhao agreed to step down as CEO of Binance amid pleading guilty to several charges levied by the Department of Justice (DoJ).</p><p>While the deal allows him to maintain his <a href=\"https://cointelegraph.com/news/breaking-binance-changpeng-zhao-pleads-guilty-violating-anti-money-laundering-requirements-wsj\">majority stake in Binance</a>, he will not be allowed to hold an executive position at the crypto exchange. </p><p>The deal does not <a href=\"https://cointelegraph.com/news/kraken-co-founder-more-fair-game-doj-fines-binance\">affect the pending litigation</a> that Binance has against the US Securities and Exchange Commission (SEC), however will resolve the company’s issues with the Commodities Futures Trading Commission (CFTC).</p><p><strong>Magazine: </strong><a href=\"https://cointelegraph.com/magazine/htx-hacked-again-100k-koreans-test-cbdcs-binance-asia-express/\"><strong>HTX hacked again for $30M, 100K Koreans test CBDC, Binance 2.0: Asia Express</strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-25T06:03:50.000Z",
    "title": "Huawei Funds AI Institute in Alberta Amid Security Debates",
    "url": "https://www.cryptopolitan.com/huawei-funds-ai-institute-in-alberta/",
    "description": "The University of Alberta has announced the establishment of the Openmind Research Institute (ORI), bolstered by $4.8 million in funding from Chinese telecom giant Huawei. This development, first reported by the Globe and Mail, marks a notable collaboration in the tech world, placing the University at the forefront of AI research. The ORI, led by ... <a title=\"Huawei Funds AI Institute in Alberta Amid Security Debates\" class=\"read-more\" href=\"https://www.cryptopolitan.com/huawei-funds-ai-institute-in-alberta/\" aria-label=\"More on Huawei Funds AI Institute in Alberta Amid Security Debates\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-25T05:46:09.000Z",
    "title": "Zscaler Amplifies Leadership Team with Key AI and Data Expertise",
    "url": "https://www.cryptopolitan.com/zscaler-amplifies-leadership-team/",
    "description": "Zscaler, Inc., a frontrunner in cloud security, has fortified its executive team by appointing two industry veterans. Claudionor Coelho Jr. takes on the role of Chief AI Officer, while Mohamed Shabar steps in as EVP of Data &#38; AI Platforms. This decision underscores Zscaler’s dedication to spearheading technological advancements, particularly in Machine Learning (ML) and ... <a title=\"Zscaler Amplifies Leadership Team with Key AI and Data Expertise\" class=\"read-more\" href=\"https://www.cryptopolitan.com/zscaler-amplifies-leadership-team/\" aria-label=\"More on Zscaler Amplifies Leadership Team with Key AI and Data Expertise\">Read more</a>"
  }
]