[
  {
    "source": "CryptoSlate",
    "date": "2023-07-09T12:06:16.000Z",
    "title": "The SEC’s arguments against Coinbase are ‘not particularly strong,’ law expert says",
    "url": "https://cryptoslate.com/the-secs-arguments-against-coinbase-are-not-particularly-strong-law-expert-says/",
    "description": "<p>The U.S. Securities and Exchange Commission (SEC) provided a preview of the arguments it plans to use against Coinbase in a letter to the judge on July 7. However, the SEC&#8217;s case against Coinbase does not inspire much confidence, crypto lawyer James Murphy tweeted on July 9. Murphy, who goes by MetaLawMan on Twitter, said [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/the-secs-arguments-against-coinbase-are-not-particularly-strong-law-expert-says/\">The SEC’s arguments against Coinbase are ‘not particularly strong,’ law expert says</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-09T12:00:59.000Z",
    "title": "Vitalik Calls Out ‘Centralized World’ Stifling Crypto Innovation, Tim Draper Adjusts BTC Price Prediction, and More — Week in Review",
    "url": "https://news.bitcoin.com/vitalik-calls-out-centralized-world-stifling-crypto-innovation-tim-draper-adjusts-btc-price-prediction-and-more-week-in-review/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/untitled-design-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Vitalik Calls Out &#039;Centralized World&#039; Stifling Crypto Innovation, Tim Draper Adjusts BTC Price Prediction, and More — Week in Review\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/untitled-design-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/untitled-design-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/untitled-design-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/untitled-design-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/untitled-design-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/untitled-design-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/untitled-design.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />&#8220;The real competition is not other chains, it’s the rapidly expanding centralized world that is imposing itself on us as we speak.&#8221; So says Ethereum co-founder Vitalik Buterin addressing the current volatile regulatory realities in crypto. In other news, venture capitalist Tim Draper adjusted the timeframe of his $250K bitcoin price prediction, and a former [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-09T12:08:44.000Z",
    "title": "Marathon mined 21% less bitcoin in June partly due to bad weather in Texas",
    "url": "https://crypto.news/marathon-mined-21-less-bitcoin-in-june-partly-due-to-bad-weather-in-texas/",
    "description": "Marathon Digital Holdings has revealed that its performance in June was mixed, partly because of bad weather"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-09T12:00:00.000Z",
    "title": "Bitcoin stalls as meme coins, Dogecoin, and DigiToads presale shine",
    "url": "https://crypto.news/bitcoin-stalls-as-meme-coins-dogecoin-and-digitoads-presale-shine/",
    "description": "The DigiToads presale is in progress with over 95% of all TOADS allocated to the crowdfund sold, raising over $5.8 million. Meanwhile, dogecoin recently gained as bitcoin stagnates"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-09T11:52:32.000Z",
    "title": "Coinbase Shake-Up: Top Execs Sell Off COIN Shares – How Will It Affect The Stock Price?",
    "url": "https://www.newsbtc.com/coinbase/coinbase-shake-up-top-execs-sell-off-coin-shares-how-will-it-affect-the-stock-price/",
    "description": "Reputable cryptocurrency company Coinbase, headquartered in the United States, has recently experienced significant stock sales by its top executives. This development occurs against the backdrop of the company&#8217;s ongoing struggles, such as regulatory scrutiny and a stagnant trading volume on the cryptocurrency market, which have hampered its growth prospects. Detailed information concerning the stock sales made by the exchange executives has been disclosed through filings submitted to the U.S. Securities and Exchange Commission. The most recent Form 4 filing submitted to the SEC shows the stock sales executed by key individuals at Coinbase, namely Chief Legal Officer Paul Grewal, and CEO Brian Armstrong. Related Reading: SEC Sues Binance, Coinbase Then BlackRock Files For Bitcoin Spot ETF; Is This An Inside Job? Stock Sales By Coinbase Executives According to Coinbase&#8217;s SEC filings, in March, Armstrong and Grewal sold approximately $7 million worth of Coinbase (COIN) stocks. More recently, Armstrong sold shares exceeding $5.8 million in value this week, followed by an additional sale of shares worth $2.6 million on May 25. It is worth noting that Armstrong has not made any purchases of COIN shares in the past two years and has been selling more frequently in 2023. He previously disclosed his intention to gradually sell his 2% stake in Coinbase over the next year, with the proceeds being directed towards funding advancements in science and technology within his co-founded companies, including NewLimit (a biotechnology company) and ResearchHub (a scientific research firm). Related Reading: Coinbase CEO Takes On SEC, Igniting Crypto Community’s Passion for Clarity COIN Performance Amidst Challenges Coinbase token, COIN has witnessed a significant surge in its stock price, with gains of over 125% so far this year. Currently priced at $78.72, Coinbase Global Inc&#8217;s stock market cap is $18.46 billion with $13.20 million trading volume. This upward trend reflects positive investor sentiment towards the company. However, this upbeat trajectory has been affected by various factors, including ongoing regulatory scrutiny from U.S. authorities and a lawsuit filed by the SEC against the exchange. The SEC alleges that Coinbase offered unregistered securities, which poses a potential threat to the core trading business of the company. Amidst these challenges, the stock price of COIN experienced a 12% increase when BlackRock updated its Bitcoin ETF through Nasdaq, with Coinbase listed as a partner under a surveillance sharing arrangement. Meanwhile, the future of Coinbase Global&#8217;s stock performance remains uncertain, with investors and industry observers closely monitoring these developments as they unfold, shaping the company&#8217;s trajectory in the coming months. Featured image from Twitter, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-09T11:45:49.000Z",
    "title": "Crypto Capitalist Arthur Hayes Predicts Mega Mania Phase for Bitcoin (BTC) Driven by Two Key Catalysts",
    "url": "https://dailyhodl.com/2023/07/09/crypto-capitalist-arthur-hayes-predicts-mega-mania-phase-for-bitcoin-btc-driven-by-two-key-catalysts/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/Bitcoin-Heading-Straight-30.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/Bitcoin-Heading-Straight-30.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/Bitcoin-Heading-Straight-30.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/Bitcoin-Heading-Straight-30.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/Bitcoin-Heading-Straight-30.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/Bitcoin-Heading-Straight-30.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/Bitcoin-Heading-Straight-30.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>BitMEX founder Arthur Hayes says that the artificial intelligence (AI) revolution could enable Bitcoin (BTC) to be part of two mania phases. In his latest essay, the crypto veteran says that AI will likely adopt Bitcoin as the currency of its economy. According to Hayes, AI will be the primary beneficiary of a new age [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/09/crypto-capitalist-arthur-hayes-predicts-mega-mania-phase-for-bitcoin-btc-driven-by-two-key-catalysts/\">Crypto Capitalist Arthur Hayes Predicts Mega Mania Phase for Bitcoin (BTC) Driven by Two Key Catalysts</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]