[
  {
    "source": "CoinDesk",
    "date": "2023-11-15T09:20:18.000Z",
    "title": "Bitcoin's Options Market Has Overtaken Its Futures Market in a Sign of Growing Sophistication",
    "url": "https://www.coindesk.com/markets/2023/11/15/bitcoins-options-market-has-overtaken-its-futures-market/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The notional open interest in the global BTC options market stood at $17.5 billion at press time, while open interest in the futures market was $15.84 billion."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-15T09:27:36.000Z",
    "title": "OpenSea NFT users report massive email phishing campaign",
    "url": "http://cointelegraph.com/news/opensea-nft-email-phishing",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/66ac40c5-9b86-4288-b443-636e8aba8389.JPG\" class=\"type:primaryImage\"></p>\n                    \n                    <p>OpenSea users have reportedly been targeted with a widespread email phishing campaign, including a fake developer API risk alert and a fake NFT offer.</p>\n                    <p><p>Users of the major nonfungible token (NFT) marketplace OpenSea have said they are being targeted with a new email phishing attack, and have received emails containing malicious links from attackers posing as the marketplace itself.</p><p><a href=\"https://x.com/realScamSniffer/status/1724214900527116630?s=20\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to social media reports, OpenSea users and developers have been targeted by various email phishing campaigns, including a fake developer account risk alert and a fake NFT offer.</p><p>One OpenSea developer took to X (formerly Twitter) on Nov. 13 to report receiving a phishing attempt to an email strictly dedicated to their OpenSea Application Programming Interface (API) key. “In other words, dev contacts have been exfiltrated from OpenSea and are the real target in this campaign,” the poster said.</p><p>The social media report came in response to OpenSea's insistence that the platform has not been hacked and urging users not to click on links they don’t trust.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Correct- there is no smart contract vuln. But unfortunately for <a href=\"https://twitter.com/opensea?ref_src=twsrc%5Etfw\">@opensea</a> I just received a phishing attempt, to an email that was strictly dedicated to my OpenSea API key. In other words, dev contacts have been exfiltrated from OpenSea and are the real target in this campaign <a href=\"https://t.co/GD4UgwWIrx\">https://t.co/GD4UgwWIrx</a> <a href=\"https://t.co/rtyUJBMlwl\">pic.twitter.com/rtyUJBMlwl</a></p>&mdash; Quantity (@quantity) <a href=\"https://twitter.com/quantity/status/1724181767643381953?ref_src=twsrc%5Etfw\">November 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Another OpenSea user took to Reddit to <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/17vbg6n/did_something_happen_to_opensea/\" target=\"_blank\" rel=\"noopener nofollow\">express</a> confusion about the ongoing phishing campaign on Nov. 14. </p><p>“Haven't used OpenSea for years and all of a sudden, I keep getting emails talking about my NFT listings getting offers,” the poster wrote, adding that all the vulnerable links were trying to direct the reader to install a malicious app.</p><p>“Right now I'm getting 3-4 scam/phishing emails a day which is crazy since I got zero just a few weeks ago,” the Redditor wrote, adding:</p><blockquote>“So my question is did something new happen to OpenSea. The email address of mine they are hitting is one I created specifically for OpenSea so not concerned but I know OpenSea had hacks previously. Are they just now hitting up my email or is there a new one?”</blockquote><p>The news comes a few weeks after one of OpenSea’s third-party vendors experienced a security incident that exposed information related to user API keys. OpenSea reported the breach in a notification email to affected users in late September 2023, stating that user emails and developer API keys may have been leaked due to the attack.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Choose your third party well…<br>Opensea posted that a vendor was attacked, resulting in the leak of developers&#39; API keys!<br>Get advice from a professional security consultant about the safety of the third party before choosing. E.g. <a href=\"https://twitter.com/SlowMist_Team?ref_src=twsrc%5Etfw\">@SlowMist_Team</a>  <a href=\"https://t.co/jcBJ9IaAEN\">pic.twitter.com/jcBJ9IaAEN</a></p>&mdash; 23pds (@IM_23pds) <a href=\"https://twitter.com/IM_23pds/status/1705504084978205090?ref_src=twsrc%5Etfw\">September 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>OpenSea users have received phishing emails previously. In February 2022, OpenSea officially confirmed that its platform faced a phishing attack from outside the OpenSea website and urged users to stay away from clicking on any links in the emails. The firm was also investigating rumors of <a href=\"https://cointelegraph.com/news/opensea-phishing-scandal-reveals-a-security-need-across-the-nft-landscape\">an exploit associated with OpenSea-related smart contracts</a>.</p><p><strong><em>Related</em></strong><strong><em>: </em></strong><a href=\"https://cointelegraph.com/news/chinese-hackers-use-fake-skype-app-to-target-crypto-users-in-new-phishing-scam\"><strong><em>Chinese hackers use fake Skype app to target crypto users in new phishing scam</em></strong></a></p><p>OpenSea did not immediately respond to Cointelegraph’s request for comment.</p><p>This latest phishing campaign is happening just after <a href=\"https://cointelegraph.com/news/opensea-lays-off-staff-severance-version-2-0-launch\">OpenSea laid off 50% of its staff</a>, with the stated intention of launching OpenSea 2.0 with a smaller team.</p><p>This attack is yet another reminder for the cryptocurrency community to stay vigilant when receiving emails from service providers. <a href=\"https://cointelegraph.com/learn/what-is-a-phishing-attack-in-crypto-and-how-to-prevent-it\">To avoid a phishing hack</a>, users should be cautious of the email sender’s authenticity and the associated links. Users should also remember that crypto firms never ask their users for personal data like wallet addresses or private keys.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-15T09:17:39.000Z",
    "title": "IMF head: CBDCs can replace cash, help financial inclusion",
    "url": "http://cointelegraph.com/news/imf-head-cbdcs-replace-cash-help-financial-inclusion",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/9ef12b33-235d-48af-8f3e-043000bbc48b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>International Monetary Fund Managing Director Kristalina Georgieva urged the public sector to “keep preparing to deploy” central bank digital currencies. </p>\n                    <p><p>During her opening <a href=\"https://www.youtube.com/watch?v=qisFRnu4Q_s\" target=\"_blank\" rel=\"noopener nofollow\">speech</a> at the Singapore FinTech Festival, International Monetary Fund (IMF) Managing Director Kristalina Georgieva urged the public sector to “keep preparing to deploy” central bank digital currencies (CBDCs) and related payment platforms in the future.</p><p>Georgieva expressed her optimism toward the implementation of CBDCs around the globe, although making a reservation that “we have not yet reached the land” and there is still much uncertainty:</p><h3>“Adoption of CBDCs is nowhere close. But about 60 percent of countries are exploring them in some form today.”</h3><p>The executive believes that CBDCs can replace cash, offer resilience in advanced economies and improve financial inclusion in the underbanked communities. According to Georgieva, CBDCs can co-exist with “private money,” being its “safe and low-cost alternative.” </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/imf-director-urges-financial-inclusion-via-digitalization\"><strong><em>IMF director urges ‘financial inclusion’ via digitalization</em></strong></a></p><p>Georgieva also highlighted the importance of technological infrastructure in CBDC projects, personal data protection and even the possible role of artificial intelligence (AI) in enhancing the national digital currencies. She put a particular emphasis on cross-border payment support:</p><h3>“To the extent CBDCs are deployed, they must be built to facilitate cross-border payments, which are at present expensive, slow, and available to few. Again, we must start this work today so we don’t have to backpedal tomorrow.”</h3><p>The IMF head <a href=\"https://www.imf.org/en/Topics/fintech/central-bank-digital-currency/virtual-handbook\" target=\"_blank\" rel=\"noopener nofollow\">presented</a> its CBDC virtual handbook and marked the Bank for International Settlements (BIS) role in the public sector’s digital money experiments. </p><p>The IMF has recently been active in its analysis of necessary crypto regulations. On Sept. 29, it proposed a crypto-risk assessment matrix (C-RAM) for countries to spot indicators and <a href=\"https://cointelegraph.com/news/crypto-imf-working-paper-assessment-matrix-risks\">triggers of potential risks</a> in the sector.</p><p>The IMF’s Synthesis paper — jointly prepared with the Bank for International Settlements (BIS) — <a href=\"https://cointelegraph.com/news/crypto-regulation-g20-adopts-imf-fsb-synthesis-paper\">was unanimously adopted</a> by the “G20 Finance Ministers and Central Bank Governors Communique” in October.</p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/i-spent-a-week-working-in-vr-it-was-mostly-terrible-however/\"><strong><em>I spent a week working in VR. It was mostly terrible, however…</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-15T09:35:52.000Z",
    "title": "Record single-day liquidation of $300M as Bitcoin slipped under $35K",
    "url": "https://cryptoslate.com/insights/record-single-day-liquidation-of-300m-as-bitcoin-slipped-under-35k/",
    "description": "<p>Quick Take Bitcoin&#8217;s market performance on Nov. 14 presented a notable shift, dipping below $35,000, marking a 9% decrease from its YTD high of just below $38,000. This aligns with a previously discussed premise on CryptoSlate that bull market periods may experience corrections of up to 20%, signifying a natural market adjustment. However, a massive [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/record-single-day-liquidation-of-300m-as-bitcoin-slipped-under-35k/\">Record single-day liquidation of $300M as Bitcoin slipped under $35K</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-11-15T09:18:02.000Z",
    "title": "Judge denies Binance and SEC request for protective order to avoid filings under seal",
    "url": "https://cryptoslate.com/judge-denies-binance-and-sec-request-for-protective-order-to-avoid-filings-under-seal/",
    "description": "<p>Judge Amy Berman Jackson has denied the joint motion for a protective order in a notable development in the legal tussle between Binance, the world&#8217;s largest cryptocurrency exchange, and the U.S. Securities and Exchange Commission (SEC). This decision underscores the heightened scrutiny and legal complexities characterizing the cryptocurrency sector&#8217;s current regulatory landscape. The recent order [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/judge-denies-binance-and-sec-request-for-protective-order-to-avoid-filings-under-seal/\">Judge denies Binance and SEC request for protective order to avoid filings under seal</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-15T09:38:19.000Z",
    "title": "AI Editor Unlocks Microbial Potential for Renewable Chemicals and Fuels",
    "url": "https://www.cryptopolitan.com/ai-editor-microbial-potential-renewable/",
    "description": "In a groundbreaking move toward sustainable bioengineering, researchers at Oak Ridge National Laboratory (ORNL) have harnessed the power of artificial intelligence to develop an AI editor to revolutionize genome editing. The team utilized CRISPR Cas9, a powerful bioengineering tool, and combined it with an innovative AI editor to genetically alter microbes, paving the way for ... <a title=\"AI Editor Unlocks Microbial Potential for Renewable Chemicals and Fuels\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-editor-microbial-potential-renewable/\" aria-label=\"More on AI Editor Unlocks Microbial Potential for Renewable Chemicals and Fuels\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-15T09:35:04.000Z",
    "title": "Truth Labs exposes rampant fraud in Ethereum network",
    "url": "https://www.cryptopolitan.com/truth-labs-exposes-rampant-fraud-in-ethereum/",
    "description": "In a detailed investigation, Truth Labs has brought to light numerous fraudulent activities within the Ethereum ecosystem, challenging the integrity of this blockchain network. The inquiry, motivated by escalating security concerns, unearthed a disturbing pattern of illegal practices, including theft, exploit schemes, and deceptive trading. Truth Labs’ investigation revealed that these illicit activities permeate various ... <a title=\"Truth Labs exposes rampant fraud in Ethereum network\" class=\"read-more\" href=\"https://www.cryptopolitan.com/truth-labs-exposes-rampant-fraud-in-ethereum/\" aria-label=\"More on Truth Labs exposes rampant fraud in Ethereum network\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-11-15T09:29:23.000Z",
    "title": "JPMorgan’s digital token JPM coin eyes $10b daily transactions",
    "url": "https://crypto.news/jpmorgans-digital-token-jpm-coin-eyes-10b-daily-transactions/",
    "description": "JPMorgan&#8217;s JPM Coin, processing $1 billion daily, is projected to handle up to $10 billion in transactions within the next year. The bank&#8217;s global head of payments for financial institutions, Umar Farooq, announced this estimate. Farooq said he expects transactions&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-15T09:35:04.000Z",
    "title": "ChatGPT Picks Ripple, Ethereum, and Everlodge for Upward Price Movements in 2023",
    "url": "https://www.crypto-news-flash.com/chatgpt-picks-ripple-ethereum-and-everlodge-for-upward-price-movements-in-2023/?utm_source=rss&utm_medium=rss&utm_campaign=chatgpt-picks-ripple-ethereum-and-everlodge-for-upward-price-movements-in-2023",
    "description": "<img width=\"512\" height=\"307\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-28.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-28.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-28-300x180.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/unnamed-28-336x200.png 336w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Recently, traders have turned to artificial intelligence (AI) to help them make smart investment choices. ChatGPT, a leader in this area, has picked three coins: Ripple, Ethereum, and Everlodge to see more bullish price movements in 2023. Let&#8217;s find out why. Ripple (XRP) Cross-Border Payment Usage Expands Ripple, a cross-border remittance company, talked about its [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-15T09:30:45.000Z",
    "title": "Crypto Carnage: $300M Liquidated as Bitcoin and Ether Stumble Amid ETF Disappointment",
    "url": "https://www.crypto-news-flash.com/crypto-carnage-300m-liquidated-as-bitcoin-and-ether-stumble-amid-etf-disappointment/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-carnage-300m-liquidated-as-bitcoin-and-ether-stumble-amid-etf-disappointment",
    "description": "<img width=\"1350\" height=\"900\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/03/BTC-ETH.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"BTC ETH\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/03/BTC-ETH.jpg 1350w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/BTC-ETH-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/BTC-ETH-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2021/03/BTC-ETH-104x69.jpg 104w\" sizes=\"(max-width: 1350px) 100vw, 1350px\" />Over $307 million in leveraged crypto long positions were liquidated recently, marking the largest event in three months. Bitcoin&#8217;s drop below $37,000 triggered widespread liquidations, with Binance accounting for over half of these. The cryptocurrency market experienced one of its most tumultuous periods in recent months. Tuesday&#8217;s trading session saw an unprecedented liquidation of leveraged [...]"
  }
]