[
  {
    "source": "Cointelegraph",
    "date": "2023-07-21T20:20:00.000Z",
    "title": "Centralized exchanges will become gateways for DeFi: Finance Redefined",
    "url": "https://cointelegraph.com/news/centralized-exchanges-will-become-gateways-for-defi-finance-redefined",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/a088205d-cc81-4cc9-bff3-cecd54924e57.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The top 100 DeFi tokens had a mixed week, with most of the tokens continuing to trade in a similar range as the previous week.</p>\n                    <p><p>Welcome to Finance Redefined, your weekly dose of essential <a href=\"https://cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/learn/defi-a-comprehensive-guide-to-decentralized-finance/amp\">decentralized finance (DeFi)</a> insights — a newsletter crafted to bring you the most significant developments from the past week.</p><p>The past week in DeFi saw new advancements in zero-knowledge proofs (ZK-proofs) as a scaling solution as more DeFi protocols embraced the technology.</p><p>A new United States Senate DeFi bill attracted a lot of scrutiny — though not necessarily of the positive kind — as many stakeholders came out to slam the “unworkable” legislation.</p><p>The CEO of the dydx Foundation made a bold prediction that centralized exchanges will eventually become a gateway for DeFi, while Polygon 2.0 laid the groundwork for decentralized governance.</p><p>The top 100 DeFi tokens had another mixed week of ups and downs, with most tokens continuing to trade in the same range as the previous week.</p><h2>Centralized exchanges will become gateways for DeFi — DYdX Foundation CEO</h2><p>The dYdX Foundation — an independent DeFi nonprofit founded to support the dYdX protocol — recently launched a public testnet for its latest version, v4. According to the foundation, this puts dYdX ahead of schedule for the impending launch of the v4 mainnet, something the foundation claims represents complete decentralization for dYdX.</p><p>As Cointelegraph recently reported, <a href=\"https://cointelegraph.com/news/dydx-exchange-launches-testnet-fully-decentralized-version-4\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/dydx-exchange-launches-testnet-fully-decentralized-version-4/amp\">the July 5 testnet launch</a> represented the fourth of five milestones dYdX laid out in its 2022 roadmap toward decentralization.</p><p><a href=\"https://cointelegraph.com/news/centralized-exchanges-gateways-defi-dxdy-foundation-ceo-charles-dhaussy\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/centralized-exchanges-gateways-defi-dxdy-foundation-ceo-charles-dhaussy/amp\"><strong>Continue reading</strong></a></p><h2>Polygon 2.0 begins groundwork for decentralized governance</h2><p>Polygon Labs has started work on an expansion intended to include all blockchains and applications running on the Polygon network, and seeks to democratize the upgrade process and encourage community participation.</p><p>On July 19, the company’s developers proposed revamping the governance mechanism for the forthcoming Polygon 2.0 roadmap to establish several layer 2s on the network. </p><p><a href=\"https://cointelegraph.com/news/polygon-2-0-begins-groundwork-for-decentralized-governance\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/polygon-2-0-begins-groundwork-for-decentralized-governance/amp\"><strong>Continue reading</strong></a></p><h2>Coin Center and Blockchain Association slam ‘unworkable’ U.S. Senate DeFi bill</h2><p>Crypto industry advocacy bodies have slammed a newly proposed U.S. Senate bill for what they say is a confused approach to regulating the DeFi sector.</p><p>On July 20, crypto think tank Coin Center and crypto advocacy group the Blockchain Association released separate statements describing the legislation as a “messy,” “unworkable” and “unconstitutional” way of regulating DeFi.</p><p><a href=\"https://cointelegraph.com/news/coin-center-blockchain-association-criticize-senate-defi-bill\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/coin-center-blockchain-association-criticize-senate-defi-bill/amp\"><strong>Continue reading</strong></a></p><h2>Chainlink launches cross-chain protocol bridging blockchain to TradFi</h2><p>The development firm behind the Chainlink protocol and its native <a href=\"https://cointelegraph.com/chainlink-price-index\">LINK</a> token has gone live with its cross-chain protocol aimed at providing interoperability between traditional financial firms, and public and private blockchains.</p><p>In a July 17 post on the Chainlink blog, Chainlink Labs chief product officer Kemal El Moujahid announced that its cross-chain interoperability protocol has launched under early access on Ethereum, Avalanche, Polygon, Arbitrum and Optimism.</p><p><a href=\"https://cointelegraph.com/news/chainlink-launches-cross-chain-protocol-ccip-ethereum-blockchain-mainnet\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/chainlink-launches-cross-chain-protocol-ccip-ethereum-blockchain-mainnet/amp\"><strong>Continue reading</strong></a></p><h2>DeFi liquidity protocol adds ConsenSys-developed zkEVM rollup Linea</h2><p>Amid the growing popularity of layer-2 scaling solutions based on ZK-proofs, decentralized finance liquidity protocol Symbiosis has added support for Linea, a zero-knowledge Ethereum Virtual Machine (zkEVM)-based scaling solution for cross-chain swaps developed by ConsenSys.</p><p>Symbiosis said in a statement that Linea is a developer-ready zkEVM rollup, which means it is Ethereum-compatible and thus lets developers reuse a lot of existing infrastructure for creating multi-asset solutions. Linea comprises 100+ protocols, developer tools and decentralized applications, making it a potentially helpful scaling tool for developers in the Ethereum ecosystem.</p><p><a href=\"https://cointelegraph.com/news/defi-liquidity-protocol-adds-consensys-developed-zkevm-rollup-linea\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/defi-liquidity-protocol-adds-consensys-developed-zkevm-rollup-linea/amp\"><strong>Continue reading</strong></a></p><h2>DeFi market overview</h2><p>DeFi’s total market value saw a bullish surge after three bearish weeks. Data from <a href=\"https://pro.cointelegraph.com/users/sign_in?\">Cointelegraph Markets Pro</a> and TradingView shows that DeFi’s top 100 tokens by market capitalization had a bullish week, with most tokens trading in the green. The total value locked in DeFi protocols remained below $50 billion.</p><p>Thanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.</p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template>\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-21T20:30:00.000Z",
    "title": "XRP Is on the Rise but Still Struggles to Reach a $1 Mark",
    "url": "https://cryptodaily.co.uk/2023/07/xrp-is-on-the-rise-but-still-struggles-to-reach-a-1-dollar-mark",
    "description": "<p>Following Ripple&rsquo;s victory against SEC, XRP&rsquo;s price skyrocketed on the same day but hasn&rsquo;t seen much more growth over the past week.</p>\nXRP Price Boom after Ripple&rsquo;s Partial Win Against SEC\n<p>Last week, XRP experienced an incredible price surge, growing by over 100% in value in just one day. The rise was a direct consequence of Ripple's partial win in a long battle against the U.S. Securities and Exchange Commission&rsquo;s (SEC).</p>\n<p>SEC first sued Ripple for its supposed breach of the U.S. Securities laws back in 2020 which started the 3-year-long crusade. Finally, on July 13, 2023, judge Analisa Torres of District Court of the Southern District of New York pronounced in her ruling that XRP does not qualify as a security, at least regarding programmatic sales and &ldquo;other distributions&rdquo; (it is considered a security in regard to institutional sales).&nbsp;</p>\n<p>The remarkable Ripple victory sent a bullish wave not only to XRP but to the whole crypto market. Besides, the XRP token was relisted on many big exchanges such as Coinbase and Gemini after the announcement of the court ruling.&nbsp;</p>\nXRP Network Usage Data Indicates a Short Pullback\n<p>Traders have clearly shown much interest in XRP over the past week, with the coin&rsquo;s spot trading volumes even exceeding that of Bitcoin and Ethereum.&nbsp;</p>\n<p>Yet, according to the recent data, the network&rsquo;s activity hasn&rsquo;t seen much increase. Ripple&rsquo;s blockchain-based distributed ledger technology XRP Ledger has maintained about the same number of transactions for over a year. This means that there&rsquo;s still a lack of new entities entering the network.</p>\nNew Bullish Trend for XRP\n<p>Following the court&rsquo;s ruling in favor of Ripple on July 13, the price of XRP has been consistently growing during the whole week, hitting a mark of $0.84 on July 19. The growth could mark an end to the bearish trend that the token has been witnessing since its 2018 peak.</p>\n<p>Despite the huge surge in value XRP saw last week, it still hasn&rsquo;t managed to reach the price of $1 and pulled back a little bit in the last couple of days. At the time of writing the token&rsquo;s value is $0.7831.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T20:27:00.000Z",
    "title": "Monero Price Prediction 2023-2032: Should You Buy XMR Now?",
    "url": "https://www.cryptopolitan.com/monero-price-prediction/",
    "description": "Monero Price Prediction 2023-2032 This Monero Price Prediction will cover details about Monero, applications, price history, and factors affecting the native currency. There are plenty of things to consider before moving on to the Monero (XMR) price prediction. How much is Monero worth? Today&#8217;s Monero price is&#160;$166.67 USD with a 24-hour trading volume of $86,921,028 ... <a title=\"Monero Price Prediction 2023-2032: Should You Buy XMR Now?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/monero-price-prediction/\" aria-label=\"More on Monero Price Prediction 2023-2032: Should You Buy XMR Now?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-21T20:16:00.000Z",
    "title": "Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better ... <a title=\"Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fantom-price-prediction/\" aria-label=\"More on Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\">Read more</a>"
  }
]