[
  {
    "source": "Cointelegraph",
    "date": "2023-07-25T20:00:00.000Z",
    "title": "Zero-knowledge tech development heats up amid bear market ",
    "url": "https://cointelegraph.com/news/zero-knowledge-tech-development-heats-up-amid-bear-market",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/c9c1080c-8142-4a2d-b1fe-8c37977b8dff.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The intersection of ZK proofs and multichain bridges has become one of the industry's more intriguing development. </p>\n                    <p><p>Zero-knowledge (ZK) proofs, or cryptographic methods that allow one party to prove to another party that something is true without revealing any sensitive underlying private information, have been a hot topic of discussion among crypto veterans. At last week's zkDay event as part of EthCC Paris, over 2,000 attendees arrived at a small venue by Rue l'Aubrac to catch a glimpse of the latest ZK projects on display. P0x Labs, the developer behind ZK protocol Manta Network, even <a href=\"https://cointelegraph.com/news/manta-network-developer-raises-25m-in-series-a-launches-layer-2-for-zk-apps\">announced a $25 million raise</a> during the event. </p><p>Currently, the technology has played a critical role in powering layer-2 solutions. By computing a simple cryptographic proof on layer-2, transactions can be finalized nearly instantly while the record is simply sent back to the underlying blockchain as a succinct proof. At the same time, ZK proofs can enable private transactions that do not relay sensitive information to observers.</p><p>Speaking to Cointelegraph during zkDay, Tiancheng Xie, CTO of ZK protocol Polyhedra, outlined another application of the emerging technology in the realm of cross-chain bridges. The Polyhedra team says the protocol has over 50,000 daily active users and 800,000 monthly active users since its mainnet launch in April.</p><p><strong>Cointelegraph: I think the ZK bridge is quite unique among all the ZK companies that we've seen so far. Could you elaborate a little bit about that?</strong></p><p><strong>Tiancheng Xie: </strong>We are building a [ZK] bridge that connects more than 10 different layer-1 and layer-2 blockchains. Since we are using zero-knowledge proofs to prove a state, our security is solely based on the security of proofs and the security of the source chain. So basically, if none of them are broken, then our security will not be broken.</p><p><strong>CT: What is the advantage of building something like this versus interchain, such as the Cosmos SDK?</strong></p><p><strong>TX: </strong>The one big advantage is the cost. So as you know that ZK can provide scalability to blockchains, such as roll-ups, and compress users request into one transaction. For example, if two or three users are going to send messages to Ethereum. We can combine these messages together to make it one unified proof. And the gas cost remains the same. So, if more users come into the batch, they can all get free proofs.</p><p><strong>CT: Interchain is still a very new technology, and unfortunately, we've seen quite a few security incidents involving them. So how does the Polyhedra ZK bridge address this problem?</strong></p><p><strong>TX: </strong>So zero [knowledge] proof cannot be broken because it's already proven to be true. Next is the security of the source chain, which is very hard to break, because, for example, to break the source chain you first need to break Ethereum [the underlying chain], which is very hard. I think the foundation is very solid compared to other chain protocols, where you may rely on a set of computer nodes. But this is not very secure because the volume of transactions can be very high, up to 200,000 or 300,000 per day, so it's possible for attacks against nodes to be disguised.</p><p><strong>CT: The sector is changing very fast. Do you think developers' knowledge has caught up with the ZK technology they're trying to build?</strong></p><p><strong>TX:</strong> So when you look at AI, progress of AI, we are actually following a similar path. Every year, we are making better tools, and developers are getting better and better. So eventually, these tools will be easy to use for the web. So I think the gap should be very small.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/3461507a-7d05-4fdc-a0c5-96c0ad433170.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>zkDay Paris Main Stage | Source: Cointelegraph</em></figcaption></figure><p><em>This interview has been edited from its original format for clarity.</em></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-25T19:56:25.000Z",
    "title": "Crypto Compliance Just Got An Upgrade: Deloitte, Chainalysis Team Up",
    "url": "https://cryptobriefing.com/crypto-compliance-just-got-an-upgrade/?utm_source=feed&utm_medium=rss",
    "description": "Deloitte, a Big Four accounting firm, and blockchain analysis company Chainalysis announced on July 25 a strategic partnership focused on improving crypto compliance for their mutual clients. The announcement comes..."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-25T20:00:44.000Z",
    "title": "Fundstrat Predicts Bitcoin Will Reach $180,000 In 2024, But What’s The Catalyst?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-will-reach-180000-in-2024/",
    "description": "Bitcoin has been on the lips of many crypto investors and news outlets for the past few months as major investment companies like BlackRock look to bring on Spot Bitcoin ETFs. The world&#8217;s largest digital currency has also seen an increase in price in the past few months as a result of this, ranging around $30,000 for almost a month.  Now, Fundstrat, an equity research firm based in New York City, has made a daring bullish prediction on the price of BTC. According to the investment research firm, the price of the cryptocurrency could reach $180,000 before its April 2024 halving. Fundstrat Makes Bullish Bitcoin Prediction In a Monday note to its clients, the firm put forward that BTC&#8217;s price could be on the verge of skyrocketing in the next year. A big part of their prediction revolves around the possibility of the trading of Spot Bitcoin ETFs by investment firms spearheaded by BlackRock, the world’s largest asset manager with over $9 trillion in assets. If approved, Spot Bitcoin ETFs could open the gates for mainstream investors and institutions to pour billions of dollars into Bitcoin. Related Reading: Elon Musk Incorporates Dogecoin Symbol In Twitter Bio, Triggering 5% Increase In Price The investment research firm said that the current daily demand for BTC currently at $25 million could skyrocket to $100 million with Spot Bitcoin ETFs. This would put bitcoin ETFs in direct rivalry with the market for precious metals ETFs, which currently has a total market capitalization of approximately $230 billion. &#8220;This [bitcoin ETF launch] would bring daily demand to $125 million, while daily supply is only $25 million. The implied equilibrium price would need to rise so daily supply matches daily demand,” Fundstrat said in the research note. Fundstrat&#8217;s head of digital asset strategy, Sean Farrell, also added: &#8220;We anticipate [a bitcoin ETF] would attract new investors and generate increased demand for bitcoin.&#8221; BTC price recovers slightly to $29,227 &#124; Source: BTCUSD on Tradingview.com  Upcoming BTC Halving Another thing the research note mentions is the influence of the upcoming Bitcoin halving. Done once approximately every four years, the Bitcoin halving cuts in half the reward given to miners for mining a block on the blockchain. Past halvings have been known to reduce inflationary pressure on BTC, thereby steadily increasing its price.  According to Fundstrat, the impending reduction of the daily mining incentive to $6 million from its current $12 million would result in a sizeable increase in the price of Bitcoin in order to achieve a state of equilibrium between buyers and sellers. The effect of the halving is then expected to compound with the Spot Bitcoin ETFs, leading to a greater price increase. Related Reading: Ripple’s XRP Sales Jump Significantly In 2023, But Is This Bearish For The Altcoin? Coincidentally, Fundstrat is not the only firm anticipating BTC reaching the $100,000 mark in the near future. In April, Standard Chartered predicted that a unit of Bitcoin would go for more than $100,000 by the end of 2024. Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-25T20:00:14.000Z",
    "title": "Trader Predicts Slow Grind Up for Bitcoin, Says $20,000 Level Out of the Picture for BTC",
    "url": "https://dailyhodl.com/2023/07/25/trader-predicts-slow-grind-up-for-bitcoin-says-20000-level-out-of-the-picture-for-btc/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/slow-gring-up-level.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/slow-gring-up-level.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/slow-gring-up-level.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/slow-gring-up-level.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/slow-gring-up-level.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/slow-gring-up-level.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/slow-gring-up-level.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto analyst believes that Bitcoin (BTC) is unlikely to revisit the $20,000 price area anytime soon even though it is now trading below the psychological level of $30,000. In a new strategy session, trader Cheds tells his 50,300 YouTube subscribers that even though Bitcoin can do the unexpected, he doesn&#8217;t see the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/25/trader-predicts-slow-grind-up-for-bitcoin-says-20000-level-out-of-the-picture-for-btc/\">Trader Predicts Slow Grind Up for Bitcoin, Says $20,000 Level Out of the Picture for BTC</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-25T19:55:18.000Z",
    "title": "Trader Makes Dogecoin (DOGE) Prediction Amid Elon Musk’s Twitter Rebrand – Here’s His Outlook",
    "url": "https://dailyhodl.com/2023/07/25/trader-makes-dogecoin-doge-prediction-amid-elon-musks-twitter-rebrand-heres-his-outlook/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/Dogecoin-and-a-Top.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/Dogecoin-and-a-Top.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/Dogecoin-and-a-Top.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/Dogecoin-and-a-Top.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/Dogecoin-and-a-Top.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/Dogecoin-and-a-Top.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/Dogecoin-and-a-Top.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A widely followed crypto analyst is predicting that Elon Musk will spark a big Dogecoin (DOGE) move after he completes a rebrand of Twitter. Pseudonymous analyst Kaleo tells his 594,000 Twitter followers that he believes Musk will soon integrate Dogecoin into the popular microblogging platform. Kaleo predicts in the next several weeks, Elon Musk will [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/25/trader-makes-dogecoin-doge-prediction-amid-elon-musks-twitter-rebrand-heres-his-outlook/\">Trader Makes Dogecoin (DOGE) Prediction Amid Elon Musk’s Twitter Rebrand – Here’s His Outlook</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]