[
  {
    "source": "CryptoSlate",
    "date": "2024-03-18T22:44:46.000Z",
    "title": "Fidelity adds staking to Ethereum ETF application amid mixed reception",
    "url": "https://cryptoslate.com/fidelity-adds-staking-to-ethereum-etf-application-amid-mixed-reception/",
    "description": "<p>Fidelity Investments has amended its application for an Ethereum (ETH) spot exchange-traded fund (ETF) to include a staking feature, according to a regulatory filing. The amendment was filed with the US SEC on March 18 and has stirred significant interest in the industry, but market analysts and observers have mixed feelings.  It introduces the possibility [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/fidelity-adds-staking-to-ethereum-etf-application-amid-mixed-reception/\">Fidelity adds staking to Ethereum ETF application amid mixed reception</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-18T23:00:01.000Z",
    "title": "Arbitrum whales steadily accumulate ARB tokens amid price correction",
    "url": "https://cryptobriefing.com/arbitrum-whales-accumulate-arb-tokens/",
    "description": "Major holders continue to accumulate ARB tokens despite market concerns about increased supply and potential sell-offs."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-18T23:00:07.000Z",
    "title": "New ICO Green Bitcoin Introduces the Gamified Green Staking and Raises $6M in 2 Weeks",
    "url": "https://news.bitcoin.com/new-ico-green-bitcoin-introduces-the-gamified-green-staking-and-raises-6m-in-2-weeks/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/untitled-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/untitled-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/untitled-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/untitled-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/untitled-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/untitled-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/untitled-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/untitled.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. A new project called Green Bitcoin (GBTC) saw a sudden burst of popularity around the time when the original Bitcoin (BTC) saw its massive price surge. While Bitcoin skyrocketed to an all-time high, Green Bitcoin &#x2014; currently still in presale &#x2014; managed to raise $6 million in only two weeks. Green Bitcoin&#x2019;s presale [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-18T23:00:04.000Z",
    "title": "Profit-Taking Panic, Short-Term Bitcoin Holders Sell Off – What’s Next For BTC?",
    "url": "https://www.newsbtc.com/bitcoin-news/profit-taking-panic-short-term-bitcoin-holders/",
    "description": "Recent on-chain data highlighted a significant trend: a wave of profit-taking by investors who have held Bitcoin (BTC) for less than five months. As detailed by CryptoQuant&#8217;s latest data, this phenomenon is not just a random market movement but an echo of patterns observed at the zeniths of previous bull markets. Related Reading: Bitcoin Sentiment Cools Off, Price Rebound Soon? Profit-Taking Among Short-Term Bitcoin Holders Signals Market Shift According to CryptoQuant, the Spent Output Profit Ratio (SOPR), a key metric in evaluating the profit and loss of Bitcoin transactions over a specific period, showcases a pronounced uptick indicative of widespread profit realization. This tendency among short-term holders to liquidate their holdings for gains parallels historical market peaks and suggests a critical juncture for Bitcoin. Crypto Dan, a seasoned market analyst, emphasized the significance of this trend, stating, &#8220;This movement is something that only happens once every few years,&#8221; highlighting the uniqueness and possible consequences of the present market trends. $BTC short-term investors took large profits &#8220;In relation to this adjustment, if we look at the SOPR, there was a big movement related to profit realization by short-term holders who held #BTC for less than 5 months.&#8221; by @DanCoinInvestor Link 👇https://t.co/RqBtDm81hO — CryptoQuant.com (@cryptoquant_com) March 18, 2024 New Market Forces At Play: ETFs Inflow Set To Rebalance The Equation While the SOPR metric might signal alarm bells reminiscent of past bull market peaks, the crypto landscape is underpinned by factors that could mitigate the traditional outcomes of such profit-taking. Among these is the recent introduction of a BTC spot Exchange-Traded Fund (ETF). This new avenue for Bitcoin investment introduces a complex layer to the market&#8217;s dynamics, potentially cushioning any adverse effects of short-term holders&#8217; profit-taking activities. Dan concluded by noting: But considering the BTC spot ETF and potential additional inflows from institutions and individuals, it is difficult to judge it as simply a signal of the peak of a bull market. After a short-term correction period, it&#8217;s very likely that we will see a strong further bull in 2024. CoinShares Head of Research, James Butterfill, provides a further layer of analysis, suggesting an imminent &#8220;positive demand shock&#8221; for Bitcoin. According to Butterfill, the delay in making spot Bitcoin ETFs accessible to the Registered Investment Advisors (RIA) market — a sector managing around $50 trillion in assets — is set to end. With RIAs requiring three months of trading data before including new ETFs in their portfolios, the market is on the cusp of witnessing a substantial influx of new investments into Bitcoin. &#8220;If 10% of RIAs chose to invest 1% of their portfolios, this could result in approximately $50 billion in additional inflows,&#8221; Butterfill elaborated, highlighting the scale of potential market impact. Moreover, the current supply-demand dynamics within the Bitcoin market are skewed towards increasing demand against decreasing supply. Related Reading: Bitcoin Approaches Risky Territory As Halving Event Draws Near The daily demand for BTC, fueled by the trade of spot BTC ETFs and the average production of new coins, underscores a growing discrepancy that ETF issuers are filling by tapping into the secondary market. This scenario is evidenced by a dramatic decrease in OTC desk coin holdings, a direct consequence of ETF-driven demand, according to Butterfill. Featured image from Unsplash, Chart from TradingView"
  }
]