[
  {
    "source": "Cointelegraph",
    "date": "2023-06-19T19:00:00.000Z",
    "title": "Crypto lender Delio to resume withdrawals after counterparty contagion",
    "url": "https://cointelegraph.com/news/crypto-lending-platform-delio-resume-withdrawals-after-counterparty-contagion",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/c23e3248-75da-4c79-97a4-913756757503.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>\"We will come up with a plan to recover the loss,\" said company officials. </p>\n                    <p><p>According to a recent report by local news outlet Decenter, South Korean crypto lending platform Delio will <a href=\"https://www.decenter.kr/NewsView/29QW2HCXOK/GZ03\" target=\"_blank\" rel=\"noopener nofollow\">resume</a> withdrawals, albeit with no fixed schedule, after <a href=\"https://cointelegraph.com/news/south-korean-bitcoin-lending-platform-delio-pauses-withdrawals\">pausing them on June 14</a>. In a meeting with investors on June 17, CEO Jung Sang-ho explained, \"[Delio] will secure as much capital as possible to compensate” and that \"users’ withdrawals would come in phases.\" No details regarding the specific repayment period, method and amount of damage were disclosed, however. </p><p>Delio is one of South Korea’s largest crypto lending firms and claims to hold an estimated $1 billion in Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), $200 million in Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) and approximately $8.1 billion in altcoins. The firm entrusted a sizable portion of clients’ funds to fellow South Korean crypto yield platform Haru Invest.</p><p>On June 13, Haru <a href=\"https://cointelegraph.com/news/crypto-yield-platform-haru-suspends-transfers-after-investigation\">suspended deposits and withdrawals</a> after claiming “certain information provided by a consignment operator was suspected to be false” during an “internal inspection process.\" Haru Invest claims to have a user base of over 80,000 individuals and has facilitated 9.8 million crypto earn payouts. During last week’s Delio investor meeting, Sang-ho alleged that Haru is currently facing bankruptcy:</p><blockquote>“It is difficult to guarantee the rate of return that was initially promoted in the deposit product, but it is explained that there will be a plan to recover the loss.\"</blockquote><p>On June 14, Haru filed a criminal complaint against its service operator, B&amp;S Holdings, and said it plans to proceed with civil litigation as well. The company stated:</p><blockquote>“Once again, we apologize for causing concerns and inconveniences to our investors and customers. We will continue to work on the issue in a faithful manner.\"</blockquote><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-home-loan-bitcoin-mortgage-risky/\">Home loans using crypto as collateral: Do the risks outweigh the reward?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-19T19:07:18.000Z",
    "title": "Ethereum core devs consider raising limit on maximum effective validator balance",
    "url": "https://cryptoslate.com/ethereum-core-devs-consider-raising-limit-on-maximum-effective-validator-balance/",
    "description": "<p>Ethereum&#8217;s core developers are currently considering a proposal that would significantly raise the maximum effective validator balance cap from 32 ETH to 2,048 ETH, while retaining the minimum staking amount at 32 ETH. This proposal, if adopted, would have far-reaching implications on the Ethereum network&#8217;s operations, particularly in the context of network decentralization and validator [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/ethereum-core-devs-consider-raising-limit-on-maximum-effective-validator-balance/\">Ethereum core devs consider raising limit on maximum effective validator balance</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-19T18:57:26.000Z",
    "title": "Future of Cross-Border Payments: IMF’s Vision for a New Infrastructure",
    "url": "https://www.cryptoglobe.com/latest/2023/06/future-of-cross-border-payments-imfs-vision-for-a-new-infrastructure/",
    "description": "In a speech delivered on June 19, 2023, in Rabat, Morocco, Tobias Adrian, Financial Counsellor and Director of the Monetary and Capital Markets Department at the International Monetary Fund (IMF), presented a compelling vision for the future of cross-border payments. He outlined a blueprint for a new class of payment and contracting platforms that could […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T18:55:58.000Z",
    "title": "Bank of France governor backs the regulation of crypto conglomerates",
    "url": "https://www.cryptopolitan.com/bank-of-france-governor-backs-regulation/",
    "description": "In a speech delivered at the Vivatech technology conference in Paris, Francois Villeroy de Galhau, the Governor of the Bank of France, emphasized the necessity of international collaboration to regulate crypto conglomerates. The Bank of France Governor stressed that it is insufficient to regulate individual entities within a single jurisdiction, using U.S. crypto companies as ... <a title=\"Bank of France governor backs the regulation of crypto conglomerates\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bank-of-france-governor-backs-regulation/\" aria-label=\"More on Bank of France governor backs the regulation of crypto conglomerates\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T18:51:47.000Z",
    "title": "Twitter suspends memecoin-linked AI bot after Elon Musk’s ‘scam crypto’ allegations",
    "url": "https://www.cryptopolitan.com/elon-musks-twitter-suspends-memecoin-ai-bot/",
    "description": "Controversies and scandals are often brewing in the lightning-fast world of crypto. Elon Musk, the influential CEO of Tesla and SpaceX, is behind the newest upheaval, which involves Twitter suspending a memecoin-linked AI bot.&#160; The incident demonstrates how influential and powerful social media can be in the Bitcoin industry, where even a single tweet can ... <a title=\"Twitter suspends memecoin-linked AI bot after Elon Musk&#8217;s &#8216;scam crypto&#8217; allegations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/elon-musks-twitter-suspends-memecoin-ai-bot/\" aria-label=\"More on Twitter suspends memecoin-linked AI bot after Elon Musk&#8217;s &#8216;scam crypto&#8217; allegations\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-19T18:49:17.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-19T19:00:11.000Z",
    "title": "Bitcoin Short-Term Holders Still Bullish, Will Rally Restart?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-short-term-holders-still-bullish-will-rally-restart/",
    "description": "On-chain data shows that Bitcoin short-term holders have participated in buying recently despite the price briefly dropping below their cost basis. Bitcoin Has Rebounded Back Above Short-Term Holder Realized Price As pointed out by an analyst in a CryptoQuant post, the BTC price had recently fallen below the realized price of the short-term holders. The &#8220;realized price&#8221; here refers to a metric that&#8217;s derived from the &#8220;realized cap.&#8221; The realized cap is a popular capitalization model for Bitcoin that assumes that the true value of each coin in circulation is not the current spot price, but the price at which it was last moved/sold on the blockchain. When this cap is divided by the total number of coins in circulation, the &#8220;realized price&#8221; emerges. The significance of this indicator is that it represents the cost basis of the average investor in the market. In the context of the current discussion, the average acquisition price of the entire market isn&#8217;t of interest, however; the realized price for only a segment of the market is relevant: the short-term holders. The &#8220;short-term holders&#8221; (STHs) here refer to investors who bought their coins less than 155 days ago. These investors are generally fickle and their behavior has historically been relevant to the trend BTC has followed. Now, here is a chart that shows the trend in the Bitcoin STH realized price over the past year: The value of the metric seems to have been near the spot price recently &#124; Source: CryptoQuant The STH realized price has historically displayed some interesting interactions with the spot price of Bitcoin. During bearish periods, the metric has provided resistance to the price, while in bullish trends, it has switched its role to being a support level. Both these patterns are also visible in the above graph, where the cryptocurrency saw a negative reaction to the line around the time of the November 2022 FTX collapse, while it found support at it when the rally had taken a step back in March 2023. As for why this pattern exists at all, the reason likely lies in the fact that the STHs look at their cost basis differently depending on the wider trend being followed in the market at the time. During bear markets, the investors look at their acquisition price as a chance to escape. They believe that selling at their cost basis would at least mean that they can avoid taking losses. It&#8217;s this selling that becomes the source of resistance at the line. Related Reading: Ethereum Cancun Upgrade: Why Arbitrum, Optimism Will Profit Massively In rallies, on the other hand, the STHs generally hold a bullish sentiment. They look at their cost basis as a profitable buying opportunity, as they think that the price would go up in the near future. The mass buying when the price touches the line may explain why the asset has observed rebounds here. From the chart, it&#8217;s visible that Bitcoin had recently dipped slightly under this line, raising concerns about whether the bullish regime had come to an end. In the past few days, however, the asset has been able to regain itself back above the level. Related Reading: Bitcoin Price Steadies Above $26K, Can Bulls Pump It Further? Since the STHs didn&#8217;t participate in selling at the level when the asset retested the line from below, it&#8217;s looking likely that they still lean towards a bullish sentiment. Naturally, this could suggest that the Bitcoin rally not be over yet after all. BTC Price At the time of writing, Bitcoin is trading around $26,400, up 2% in the last week. BTC has recovered back above $26,000 &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-19T18:45:07.000Z",
    "title": "Grayscale Bitcoin Trust Discount Shrinks Following BlackRock’s Application for Spot Bitcoin ETF",
    "url": "https://dailyhodl.com/2023/06/19/grayscale-bitcoin-trust-discount-shrinks-following-blackrocks-application-for-spot-bitcoin-etf/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/digital-giant-grayscale-amid.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/digital-giant-grayscale-amid.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/digital-giant-grayscale-amid.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/digital-giant-grayscale-amid.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/digital-giant-grayscale-amid.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/digital-giant-grayscale-amid.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/digital-giant-grayscale-amid.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The Bitcoin (BTC) trust controlled by digital asset management titan Grayscale is flashing signs of life following BlackRock&#8217;s latest filing for an exchange-traded fund (ETF) designed to track the performance of the crypto king. The Grayscale Bitcoin Trust (GBTC) surged more than 12% on Friday, a day after $10 trillion investment firm BlackRock sent a [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/19/grayscale-bitcoin-trust-discount-shrinks-following-blackrocks-application-for-spot-bitcoin-etf/\">Grayscale Bitcoin Trust Discount Shrinks Following BlackRock’s Application for Spot Bitcoin ETF</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-19T18:41:53.000Z",
    "title": "XRP, Cardano (ADA) and Polygon (MATIC) See Institutional Flows After Big Altcoin Discount: CoinShares",
    "url": "https://dailyhodl.com/2023/06/19/xrp-cardano-ada-and-polygon-matic-see-institutional-flows-after-big-altcoin-discount-coinshares/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-Cardano-XRP-one.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-Cardano-XRP-one.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-Cardano-XRP-one.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-Cardano-XRP-one.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-Cardano-XRP-one.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-Cardano-XRP-one.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/Bitcoin-Cardano-XRP-one.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Digital assets manager CoinShares says institutional investors are eyeing up altcoins as crypto markets suffer outflows for the ninth week in a row. In its latest Digital Asset Fund Flows Weekly Report, CoinShares finds that institutional investors sold off $5.1 million in crypto holdings last week, significantly less than in the previous eight weeks. &#8220;Digital asset investment [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/19/xrp-cardano-ada-and-polygon-matic-see-institutional-flows-after-big-altcoin-discount-coinshares/\">XRP, Cardano (ADA) and Polygon (MATIC) See Institutional Flows After Big Altcoin Discount: CoinShares</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]