[
  {
    "source": "Cointelegraph",
    "date": "2024-03-11T04:46:49.000Z",
    "title": " Weekend Wrap: Sony’s ‘super-fungible token,’ $250K for Vegas Sphere wifhat and more  ",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-on-the-weekend",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMDgvNDljZTRmMTMtNTA1My00MTk3LTg0MmYtNTMwMTIyYTZiODYwLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>A Sony patent proposes video game assets tracked with a “super-fungible token,” and dogwifhat punters are close to buying an ad on the Las Vegas Sphere.</p>\n                    <p><p>Technology giant Sony has laid out its concept for a distributed ledger-based “super-fungible token for gaming,” according to a United States patent application.</p><p>The August 2022 patent <a href=\"https://ppubs.uspto.gov/dirsearch-public/print/downloadPdf/20240066408\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> was publicly released by the U.S. Patent and Trademark Office (USPTO) on Feb. 29 and details a process for how a player’s gaming assets can be tracked through a bundle of nonfungible tokens (NFTs).</p><p>The patent describes an electronic device that would track gaming assets tied to a player. Metadata from those assets would make up a super-fungible token — depicted as a “set of nonfungible tokens” — stored on “a distributed ledger associated with the gaming application.”</p><p><a href=\"https://cointelegraph.com/news/what-happened-in-crypto-on-the-weekend\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-11T04:58:43.000Z",
    "title": "LINK Price Regains Strength, Why Chainlink Could Surge Over 10%",
    "url": "https://www.newsbtc.com/analysis/link/link-price-regains-strength-20/",
    "description": "Chainlink’s LINK price is moving higher above the $20.00 resistance. The price is now up over 5% and might aim for a move toward the $25.00 resistance. Chainlink price is showing positive signs above $20.00 against the US dollar. The price is trading above the $20.50 level and the 100 simple moving average (4 hours). There was a break above a key bearish trend line with resistance near $20.00 on the 4-hour chart of the LINK/USD pair (data source from Kraken). The price could rally further if it clears the $22.00 resistance zone. Chainlink (LINK) Price Eyes More Upsides In the past few sessions, Chainlink bulls were able to send the price above a few key hurdles at $18.50. Earlier, LINK price formed a base above the $16.75 and started a fresh increase. There was a break above a key bearish trend line with resistance near $20.00 on the 4-hour chart of the LINK/USD pair. The bulls pumped the pair above the $22.00 level. A new multi-month high was formed at $22.85 before the price started a downside correction. There was a move below the $22.00 level. The price declined below the 23.6% Fib retracement level of the upward move from the $16.75 swing low to the $22.85 high. LINK is now trading above the $20.50 level and the 100 simple moving average (4 hours). The price is up over 5% and outpacing both Bitcoin and Ethereum. If the bulls remain in action, the price could rise further. Immediate resistance is near the $21.80 level. Source: LINKUSD on TradingView.com The next major resistance is near the $22.00 zone. A clear break above $22.00 may possibly start a steady increase toward the $23.00 and $24.20 levels. The next major resistance is near the $24.80 level, above which the price could test $25.00. Are Dips Limited? If Chainlink’s price fails to climb above the $22.00 resistance level, there could be a downside correction. Initial support on the downside is near the $21.00 level. The next major support is near the $20.00 level or the 50% Fib retracement level of the upward move from the $16.75 swing low to the $22.85 high, below which the price might test the $18.80 level. Any more losses could lead LINK toward the $17.65 level in the near term. Technical Indicators 4 hours MACD – The MACD for LINK/USD is gaining momentum in the bullish zone. 4 hours RSI (Relative Strength Index) – The RSI for LINK/USD is now above the 50 level. Major Support Levels – $21.00 and $20.00. Major Resistance Levels – $22.00 and $23.00."
  }
]