[
  {
    "source": "Cointelegraph",
    "date": "2023-09-29T03:53:01.000Z",
    "title": "FTX founder Sam Bankman-Fried criminal trial schedule revealed",
    "url": "https://cointelegraph.com/news/ftx-founder-sam-bankman-fried-criminal-trial-schedule",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/c258e4b9-a68c-429e-864f-b61d6f140a8e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In a hearing, Assistant U.S. Attorney Danielle Kudla said the Department of Justice estimated the case could last four to five weeks.</p>\n                    <p><p>Former FTX CEO Sam Bankman-Fried will spend at least 21 days in court as part of his criminal trial, which will begin in earnest on Oct. 4 and last until Nov. 9, according to a newly released trial calendar posted to the public court docket.</p><p>The burgeoning trial calendar, released on Sept. 28, begins on Oct. 3 with jury selection. The first official date of the <a href=\"https://cointelegraph.com/learn/who-is-sam-bankman-fried-ftx\">Bankman-Fried</a> trial is Oct. 4, where they will begin discussing seven fraud charges laid against him.</p><p>There are two substantive charges where the prosecution must convince a jury that Bankman-Fried had committed the crime. Five other “conspiracy” charges involve the prosecution convincing a jury that Bankman-Fried planned to commit the crimes.</p><p>There are 15 full trial days in October and another six in November. The court will not be in session between Oct. 20 and Oct. 25 and on weekends. Public holidays also fall on Oct. 9 and Nov. 10 and there is also no trial slated for Nov. 3.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/b722e253-96c7-4716-9cc1-786b73256425.jpg\"  /><figcaption style=\"text-align: center;\"><em>United States vs. Sam Bankman-Fried trial calendar. Source: </em><a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.590940/gov.uscourts.nysd.590940.297.0.pdf\" target=\"_blank\" rel=\"noopener nofollow\"><em>Courtlistener</em></a></figcaption></figure><p>The former FTX CEO has been serving pre-trial detention at the Metropolitan Detention Center since Aug. 11. Through his attorneys, Bankman-Fried has filed numerous motions for temporary release to prepare for his upcoming trial. </p><p>His latest attempt was <a href=\"https://cointelegraph.com/news/judge-denies-sam-bankman-temporary-release\">knocked back</a> again on Sept. 28 by U.S. District Judge Lewis Kaplan, suggesting Bankman-Fried might be a flight risk, given his young age and a “very long sentence” if convicted.</p><blockquote>“If things begin to look bleak … maybe the time would come when he would seek to flee.”</blockquote><p>However, Kaplan said that he was sympathetic to the defense’s concerns, and has granted Bankman-Fried permission to arrive at court at 7am local time on most trial days to speak with his lawyers before testimony begins.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bankman-fried-request-temporary-release-denied-amid-upcoming-trial\"><strong><em>Sam Bankman-Fried’s temporary release request denied as trial date looms</em></strong></a></p><p>During the hearing on Sept. 28, assistant U.S. attorney Danielle Kudla said the Department of Justice estimated the case could last four to five weeks. </p><p>SBF, who pleaded not guilty to seven counts of fraud and conspiracy following the collapse of FTX, faces a statutory maximum of 110 years in prison.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\">Deposit risk: What do crypto exchanges really do with your money?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-29T03:42:03.000Z",
    "title": "Bitcoin Price Breaks Higher, Is the Rally Just Getting Started?",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-breaks-higher-27200/",
    "description": "Bitcoin price is gaining pace above the $26,700 resistance. BTC is consolidating above $26,800 and might continue to rise above the $27,200 resistance. Bitcoin gained pace above the $26,500 and $26,700 resistance levels. The price is trading above $26,700 and the 100 hourly Simple moving average. There is a key bullish trend line forming with support near $26,800 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could accelerate higher above the $27,200 resistance zone. Bitcoin Price Aims Higher Bitcoin price remained stable above the $26,000 support zone. BTC formed a base and started a steady increase above the $26,500 resistance zone. The bulls finally managed to pump the price above the $26,700 resistance. It even spiked above the $27,200 level. A high is formed near $27,312 and the price is now consolidating gains. There was a minor decline below the 23.6% Fib retracement level of the upward move from the $26,100 swing low to the $27,312 high. Bitcoin is trading above $26,700 and the 100 hourly Simple moving average. There is also a key bullish trend line forming with support near $26,800 on the hourly chart of the BTC/USD pair. Source: BTCUSD on TradingView.com Immediate resistance on the upside is near the $27,200 level. The next key resistance could be near the $27,500 level. A close above the $27,500 resistance could send the price further higher. In the stated case, the price could climb toward the $28,200 resistance. Any more gains might call for a move toward the $28,500 level. Are Dips Limited In BTC? If Bitcoin fails to continue higher above the $27,200 resistance, there could be a downside correction. Immediate support on the downside is near the $26,800 level and the trend line. The next major support is near the $26,500 level or the 50% Fib retracement level of the upward move from the $26,100 swing low to the $27,312 high. A downside break and close below the $26,500 level might start another major decline. The next support sits at $26,000. Any more losses might call for a test of $25,400. Technical indicators: Hourly MACD – The MACD is now losing pace in the bullish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level. Major Support Levels – $26,800, followed by $26,500. Major Resistance Levels – $27,200, $27,500, and $28,000."
  }
]