[
  {
    "source": "Decrypt",
    "date": "2023-09-18T19:32:28.000Z",
    "title": "Mila Kunis' Stoner Cats Banned From NFT Marketplaces After SEC Charges",
    "url": "https://decrypt.co/197622/mila-kunis-stoner-cats-trading-banned-nft-marketplaces-sec",
    "description": "OpenSea and Rarible both confirmed that they blocked Stoner Cats NFT trades, while Blur shows no active listings after the SEC settlement."
  },
  {
    "source": "Decrypt",
    "date": "2023-09-18T19:18:29.000Z",
    "title": "'House of Mirrors': SEC Demands Urgent Inspection of Binance US Assets",
    "url": "https://decrypt.co/197620/sec-demands-binance-us-inspection-in-house-of-mirrors-case",
    "description": "The top regulator has slammed Binance US in Monday court documents for allegedly not cooperating. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-18T19:30:00.000Z",
    "title": "Bitcoin investors are bullish on the US Fed’s $100B loss",
    "url": "https://cointelegraph.com/news/bitcoin-investors-federal-reserve-100-billion-loss",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/bfb431ef-6b62-440f-b855-e31852227474.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The debt ceiling is unlikely to hold as the government faces increased pressure from interest rate payments, a potential catalyst for Bitcoin and cryptocurrencies.</p>\n                    <p><p>The U.S. Federal Reserve made a significant announcement on Sept. 14, revealing accumulated losses of $100 billion in 2023. What’s more, this situation is expected to <a href=\"https://www.reuters.com/markets/us/fed-losses-breach-100-billion-interest-costs-rise-2023-09-15/\" target=\"_blank\" rel=\"noopener nofollow\">worsen</a> for the Fed, according to Reuters. But for risk assets like Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), this may actually be a blessing in disguise. </p><h2>The Fed in the red</h2><p>The primary reason behind this financial setback is that the interest payments on the Fed’s debt have surpassed the earnings generated from its holdings and the services it provides to the financial sector.</p><p>As a result of this development, investors are now scrambling to grasp how this will impact interest rates and the demand for provably scarce assets like BTC.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/92d74d0f-9b50-4101-8b59-0e348f00f014.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Fed earnings remittances due to the U.S. Treasury, USD (millions). Source: St. Louis Fed</em></figcaption></figure><p>Some analysts are of the opinion that the Fed’s losses, which commenced a year ago, could potentially double by 2024. The central bank categorizes these negative results as “deferred assets,” arguing that there’s no immediate necessity to cover them.</p><h2>The Fed used to generate revenue for U.S. Treasury</h2><p>Historically, the Federal Reserve has been a profitable institution. However, the absence of profits does not hinder the central bank’s ability to conduct monetary policy and achieve its objectives. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/how-do-the-fed-s-interest-rates-impact-the-crypto-market\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/how-do-the-fed-s-interest-rates-impact-the-crypto-market/amp\">How do the Fed’s interest rates impact the crypto market?</a></em></strong></p><p>The fact that the Fed’s balance sheet has incurred losses isn’t surprising, especially given the substantial interest rate hikes, which escalated from near-zero in March 2022 to the current level of 5.25%. Even if interest rates remain unchanged, Reuters suggested that the Fed’s losses are likely to persist for some time. This can be attributed to the expansionary measures implemented in 2020 and 2021 when the central bank aggressively acquired bonds to stave off a recession.</p><p>Even if interest rates remain unchanged, Reuters suggested that the Fed’s losses are likely to persist for some time. This can be attributed to the expansionary measures implemented in 2020 and 2021 when the central bank aggressively acquired bonds to stave off a recession.</p><p>In essence, the Fed functions like a conventional bank, as it must provide yields to its depositors, which primarily consist of banks, money managers and financial institutions.</p><p>An article in Barron's effectively <a href=\"https://www.barrons.com/articles/fed-money-market-funds-6e81cfe0\" target=\"_blank\" rel=\"noopener nofollow\" data-amp=\"https://www-barrons-com.cdn.ampproject.org/c/s/www.barrons.com/amp/articles/fed-money-market-funds-6e81cfe0\">illustrates</a> the impact of the $100 billion loss, stating,</p><blockquote>“The Fed banks’ losses don’t increase federal budget deficits. But the now-vanished big profits that they used to send the Treasury did help hold down the deficit, which is $1.6 trillion so far this fiscal year..”</blockquote><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/9a322c7b-5d87-42ae-afc8-9ba2ce0c6c88.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>U.S. total gross debt and debt ceiling, USD (trillions). Source: BBC</em></figcaption></figure><p>Clearly, this situation is unsustainable, particularly considering that the U.S. debt has now reached $33 trillion. While one might point fingers at the Fed for raising interest rates initially, it’s essential to recognize that without such measures, inflation would not have returned to 3.2%, and the cost of living would have continued to exert pressure on the economy. </p><p>Ultimately, the significant demand for short-term bonds and money market funds is a reflection of the trillions of dollars injected into the economy during the peak of the pandemic. Nevertheless, even if one settles for a fixed 5% yield on a three-month investment, there’s no guarantee that inflation will remain below this threshold for an extended period.</p><p>Furthermore, investors are confronted with the risk of dilution each time the U.S. Federal Reserve injects liquidity into the market, whether through the sale of assets from its balance sheet or when the Treasury raises the debt limit. </p><p>Ultimately, it’s improbable that fixed-income returns will outpace inflation for another 12 months because, at some point, the government will exhaust its funds and be compelled to issue additional Treasurys.</p><h2>Real estate and stocks no longer a reliable store of value</h2><p>There remains a significant unanswered question regarding which sector or asset class will reap the most benefits when inflation catches up with short-term <a href=\"https://cointelegraph.com/news/us-treasury-yields-are-rising-what-does-it-mean-for-bitcoin-price\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-treasury-yields-are-rising-what-does-it-mean-for-bitcoin-price/amp\">Treasury yields</a>. This uncertainty arises as the S&P 500 stands just 7% below its all-time high, while the real estate market exhibits signs of strain due to mortgage rates hitting their highest levels in over two decades.</p><p>On one hand, the S&P 500 index doesn’t appear excessively valued, trading at 20x estimated earnings — especially when compared with previous peaks that reached 30x multiples or even higher. However, investors are apprehensive that the Fed may find itself compelled to further raise interest rates in order to combat the prevailing inflationary pressures. </p><p>As the cost of capital continues its ascent, corporate earnings will come under pressure, leaving investors with no secure harbor for their cash reserves. </p><p>Presently, Bitcoin and other cryptocurrencies may not seem like a viable hedge option, but this perspective could shift as investors realize that the U.S. government’s debt ceiling is essentially boundless. Thus, it might make sense to gradually accumulate these assets regardless of short-term price trends.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/bitcoin-investors-federal-reserve-100-billion-loss&utm_source=cointelegraph_com&utm_medium=appendix&utm_campaign=articles\" data-amp=\"https://mint-cointelegraph-com.cdn.ampproject.org/c/s/mint.cointelegraph.com/?url=https://cointelegraph.com/news/bitcoin-investors-federal-reserve-100-billion-loss&utm_source=cointelegraph_com&utm_medium=appendix&utm_campaign=articles/amp\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n\n\n\n\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-18T19:30:00.000Z",
    "title": "Rep. Tom Emmer: Digital assets will be a ‘sleeper issue’ for 2024 elections",
    "url": "https://cointelegraph.com/news/tom-emmer-crypto-sleeper-issue-2024-elections",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/4c17f4bf-a60e-4479-bc6c-0f320120d4fc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Three candidates from both the Democratic and Republican parties have taken anti-CBDC positions as part of their 2024 presidential run.</p>\n                    <p><p><a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/tom-emmer\">Tom Emmer</a>, majority whip of the United States House of Representatives and crypto proponent, says that digital assets have become a “sleeper issue” in U.S. politics, both at the state and federal levels.</p><p>Speaking to Cointelegraph at the Permissionless II conference in Austin, Texas on Sept. 11, Emmer said certain candidates running for office in 2024 may underestimate the impact of issues surrounding crypto and blockchain. He pointed to financial privacy concerns, specifically mentioning government oversight of central bank digital currencies, or CBDCs.</p><p>“It’s politically potent regardless of your political persuasion,” said Emmer. “Democrats, Republicans and others believe that your personal information is supposed to be yours, and you get to choose when you get to share it.” </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/51747032-87bd-4a4e-bd33-d890ea1512fe.jpeg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Rep. Tom Emmer speaking to policymakers at Permissionless II on Sept. 11. Source: Cointelegraph</em></figcaption></figure><p>According to Emmer, there is a generational divide in the U.S. in which residents could push back on policies that potentially inhibit the digital space and, in doing so, “flush out” technologically ignorant lawmakers. At least three candidates from both major U.S. political parties have taken a public position on CBDCs for the 2024 race. </p><p>Florida Gov. Ron DeSantis, a Republican polling second behind former president Donald Trump, <a href=\"https://cointelegraph.com/news/ron-desantis-vows-to-ban-cdbc-in-the-us\">promised in July to ban CBDCs</a> in the U.S. should his campaign be successful. In May, he <a href=\"https://cointelegraph.com/news/florida-governor-signs-cbdc-bill-into-law-restricting-some-uses-of-us-and-foreign-cbdcs\">signed a Florida bill</a> into law aimed at largely prohibiting the use of a federally issued digital dollar in the U.S. state. Other longshot candidates who have taken positions opposing CBDCs include Republican Vivek Ramaswamy and Democrat Robert F. Kennedy Jr. </p><p>“We have a whole host of laws and regulations that say when you have to disclose, what you have to disclose, but it shouldn’t be just a blanket [statement on CBDCs],” said Emmer. “[The U.S. government] can do a central bank digital currency if it’s open, permissionless and private. It has to emulate cash.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/blockchain-could-authenticate-ai-as-crypto-racks-up-court-victories-rep-emmer\"><strong><em>Blockchain could authenticate AI as crypto racks up court victories: Rep. Emmer</em></strong></a></p><p>Emmer has <a href=\"https://cointelegraph.com/news/tom-emmer-anti-cbdc-bill-reintroduced\">reintroduced a bill</a> aimed at limiting the Federal Reserve from issuing a CBDC in the United States. He has also backed an appropriations amendment for the Securities and Exchange Commission’s funds, which could <a href=\"https://cointelegraph.com/news/congressman-tom-emmer-seeks-amendment-to-limit-sec-crypto-oversight\">reduce the commission’s ability</a> to follow through with enforcement actions on crypto firms. </p><p>On Sept. 20, the House Financial Services Committee will meet in a markup session for the Digital Dollar Pilot Prevention Act — legislation that could prohibit the Fed from initiating CBDC pilot programs without approval from Congress. The committee <a href=\"https://cointelegraph.com/news/house-financial-services-committee-witnesses-air-multiple-anti-cbdc-arguments\">discussed CBDCs in a Sept. 14 hearing</a> for the first time since Congress’ August recess.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/opinion-republican-crypto-maxis-democrat-anti-crypto-army-mchenry-warren/\"><strong><em>Opinion: GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-18T19:16:28.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Representatives from the United States Securities and Exchange Commission (SEC) and Binance were in Washington, D.C. for a hearing centered around BAM, the holding company for Binance.US. U.S. Sen. Elizabeth Warren’s Digital Asset Anti-Money Laundering Act has won the support of nine further senators, a statement from her office said. Meanwhile, crypto platform JPEX has blamed “certain institutions” and \"third-party market makers” for causing the ongoing liquidity issues on its platform.</p><h3>SEC lobs more accusations at Binance </h3><p>The SEC claims that <a href=\"https://cointelegraph.com/news/sec-claims-ceffu-binance-related-motion-against-bam\">wallet provider Ceffu is “Binance-related”</a> in its latest filing against BAM, the holding company for Binance.US.</p><p>The redacted filing, which was dated Sept. 18, argues that Binance’s request seeking a protective order against the SEC’s investigation is meritless and calls on the court to deny the request. The filing also raises questions about Ceffu, which the SEC recently flagged for its alleged ties to the Binance exchange. </p><p>Ceffu rebranded from Binance in March but “appears to have control of Customer Assets,” the SEC said in a Sept. 14 memorandum. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/6<br><br>SEC seeks court order for inspection of Binance US.<br><br>Now expressly calling out that Ceffu is indeed a Binance related entity and that Binance US has been misleading the court. <a href=\"https://t.co/2XZ2kChib3\">pic.twitter.com/2XZ2kChib3</a></p>&mdash; Adam Cochran (adamscochran.eth) (@adamscochran) <a href=\"https://twitter.com/adamscochran/status/1703808897654427841?ref_src=twsrc%5Etfw\">September 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In the Sept. 18 filing, the securities regulator wrote: “The limited inspection the SEC has been able to conduct so far demonstrates the urgent need for an inspection. [redacted] The Court should order the inspection the SEC seeks as set forth in its Motion to Compel.”</p><p>Representatives from Binance and the SEC were in Washington, D.C. on Sept. 18 for a hearing over <a href=\"https://cointelegraph.com/news/binance-sec-hearing-washington-dc-updates\">the regulator’s motion to compel</a> against BAM.</p><h3>Nine U.S. senators publicly back Elizabeth Warren’s crypto bill</h3><p>Nine U.S. senators have added their support to Sen. Elizabeth Warren’s Digital Asset Anti-Money Laundering Act, according to a statement from Warren’s office. </p><p>The press release on Warren’s official Senate webpage names Democratic Party Sens. Gary Peters, Dick Durbin, Tina Smith, Jeanne Shaheen, Bob Casey, Richard Blumenthal, Michael Bennet and Catherine Cortez Masto, along with independent Sen. Angus King, as those who joined the bipartisan coalition supporting the bill. Peters is the chair of the Senate Homeland Security and Governmental Affairs Committee, while Durbin is the chair of the Senate Judiciary Committee.</p><p>Warren herself welcomed the new bill supporters, stating:</p><blockquote>“Our expanding coalition shows that Congress is ready to take action — our bipartisan bill is the toughest proposal on the table cracking down on crypto’s illicit use and giving regulators more tools in their toolbox.”</blockquote><p>This bill has also been endorsed by Transparency International U.S., Global Financial Integrity, the National District Attorneys Association, the Major County Sheriffs of America, the National Consumer Law Center and the National Consumers League.</p><p>Warren reintroduced the Digital Asset Anti-Money Laundering Act, along with Sens. Joe Manchin, Roger Marshall and Lindsey Graham, in July 2023. In the current version, the document intends to crack down on noncustodial digital wallets, extend Bank Secrecy Act responsibilities, establish an Anti-Money Laundering/Combating the Financing of Terrorism compliance examination and implement other legal measures to fight the illicit use of digital money.</p><p>Warren believes there is a “$50 billion crypto tax gap,” with the Internal Revenue Service and U.S. Treasury risking missing out on roughly $1.5 billion in tax revenue for the 2024 financial year if a tax policy update is delayed.</p><h3>Crypto platform JPEX blames partners for \"maliciously\" freezing funds</h3><p>Dubai-based cryptocurrency exchange JPEX has <a href=\"https://cointelegraph.com/news/jpex-blames-market-makers-hong-kong-liquidity-crisis\">slammed regulators</a> and “third-party market makers” for a liquidity crisis that has seen the platform hike withdrawal fees and suspend certain operations. </p><p>In a Sept. 17 blog post, JPEX <a href=\"https://blog.jp-ex.io/en/jpex-special-announcement-20230917/\" target=\"_blank\" rel=\"noopener nofollow\">said</a> “unfair treatment” from certain institutions in Hong Kong, along with negative news, caused its third-party market makers to “maliciously” freeze funds.</p><p>“They demanded more information from the platform for negotiation, restricting our liquidity and significantly increasing our daily operating costs, leading to operational difficulties,” it said. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/e4605630-4139-4d84-9188-be9f32074cc7.PNG\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>JPEX said it would be pausing Earn transactions starting Sept. 18. Source: JPEX</em></figcaption></figure><p>The exchange is currently undergoing a probe by the Hong Kong Securities and Futures Commission for <a href=\"https://cointelegraph.com/news/jpex-increases-withdrawal-fee-to-almost-1k-after-warning-from-hong-kong-s-watchdog\">allegedly promoting its services</a> to Hong Kong residents despite not having applied for a license in the country.</p><p>Local police in Hong Kong have now received at least 83 complaints concerning the exchange, <a href=\"https://www.scmp.com/news/hong-kong/law-and-crime/article/3234873/jpex-crypto-platform-suspend-trades-monday-amid-investigation-hong-kong\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to a Sept. 18 report from the South China Morning Post.</p><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-18T19:11:03.000Z",
    "title": "Europol sounds alarm on rising criminal activities in DeFi and NFT sectors",
    "url": "https://www.cryptopolitan.com/europol-sounds-alarm-on-rising-criminal-activities-in-defi-and-nft-sectors/",
    "description": "In a recent report that has sent ripples through the European Union&#8217;s financial sector, Europol, the EU&#8217;s law enforcement agency, lauded the security and independence offered by blockchain technology. However, the agency simultaneously raised red flags over the increasing criminal activities within the decentralized finance (DeFi) and non-fungible token (NFT) spaces. The report, titled &#8220;European ... <a title=\"Europol sounds alarm on rising criminal activities in DeFi and NFT sectors\" class=\"read-more\" href=\"https://www.cryptopolitan.com/europol-sounds-alarm-on-rising-criminal-activities-in-defi-and-nft-sectors/\" aria-label=\"More on Europol sounds alarm on rising criminal activities in DeFi and NFT sectors\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-18T19:31:58.000Z",
    "title": "Bitcoin mining firm Hut 8 gets judicial approval for USBTC merger",
    "url": "https://crypto.news/bitcoin-mining-firm-hut-8-gets-judicial-approval-for-usbtc-merger/",
    "description": "Canadian Bitcoin mining giant Hut 8 secured pivotal judicial approval for its merger with USBTC.&#160; The British Columbia Supreme Court has granted the final judicial go-ahead for the union between Canadian Bitcoin miner Hut 8 and U.S. Bitcoin Corp (USBTC).&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-18T19:32:54.000Z",
    "title": "Unlocking the Secrets: Ripple Engineer Reveals Rare XRPL Liquidity Feature",
    "url": "https://www.crypto-news-flash.com/unlocking-the-secrets-ripple-engineer-reveals-rare-xrpl-liquidity-feature/?utm_source=rss&utm_medium=rss&utm_campaign=unlocking-the-secrets-ripple-engineer-reveals-rare-xrpl-liquidity-feature",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP Lawyer John Deaton\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />A Senior staff software engineer at Ripple highlights a key functionality of the XRP Ledger (XRPL). Crypto holders can deposit and withdraw XRP single-side into/from an AMM pool of restricted token/XRP pairs. In a recent post shared to X, formerly Twitter, a staff at Ripple shared some of his new findings on the structure of [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-18T19:32:00.000Z",
    "title": "North Korean Hackers Tied With Dictator Are Exploiting DeFi: Laura Shin",
    "url": "https://coinedition.com/north-korean-hackers-tied-with-dictator-are-exploiting-defi-laura-shin/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/North-Korean-Hackers-Tied-With-Dictator-Are-Exploiting-DeFi-Laura-Shin.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"North Korean Hackers Tied With Dictator Are Exploiting DeFi Laura Shin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/North-Korean-Hackers-Tied-With-Dictator-Are-Exploiting-DeFi-Laura-Shin.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/North-Korean-Hackers-Tied-With-Dictator-Are-Exploiting-DeFi-Laura-Shin-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/North-Korean-Hackers-Tied-With-Dictator-Are-Exploiting-DeFi-Laura-Shin-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/North-Korean-Hackers-Tied-With-Dictator-Are-Exploiting-DeFi-Laura-Shin-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/North-Korean-Hackers-Tied-With-Dictator-Are-Exploiting-DeFi-Laura-Shin-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/North-Korean-Hackers-Tied-With-Dictator-Are-Exploiting-DeFi-Laura-Shin-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/North-Korean-Hackers-Tied-With-Dictator-Are-Exploiting-DeFi-Laura-Shin-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/North-Korean-Hackers-Tied-With-Dictator-Are-Exploiting-DeFi-Laura-Shin-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/North-Korean-Hackers-Tied-With-Dictator-Are-Exploiting-DeFi-Laura-Shin-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/North-Korean-Hackers-Tied-With-Dictator-Are-Exploiting-DeFi-Laura-Shin-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/North-Korean-Hackers-Tied-With-Dictator-Are-Exploiting-DeFi-Laura-Shin-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/North-Korean-Hackers-Tied-With-Dictator-Are-Exploiting-DeFi-Laura-Shin-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/North-Korean-Hackers-Tied-With-Dictator-Are-Exploiting-DeFi-Laura-Shin-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/North-Korean-Hackers-Tied-With-Dictator-Are-Exploiting-DeFi-Laura-Shin-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/North-Korean-Hackers-Tied-With-Dictator-Are-Exploiting-DeFi-Laura-Shin-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/North-Korean-Hackers-Tied-With-Dictator-Are-Exploiting-DeFi-Laura-Shin-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Messari CEO Ryan Selkis tweeted that he doesn’t believe North Korea is behind billions of dollars worth of crypto hacks. Crypto journalist Laura Shin explained that North Korea is a dictatorship regime, and hence, the hacks are carried out by the government. ZachXBT recently accused a North Korea-linked hacker group of stealing from the crypto [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/north-korean-hackers-tied-with-dictator-are-exploiting-defi-laura-shin/\">North Korean Hackers Tied With Dictator Are Exploiting DeFi: Laura Shin</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]