[
  {
    "source": "Cointelegraph",
    "date": "2023-09-26T08:16:29.000Z",
    "title": "CZ appoints Binance security team to track Huobi HTX stolen funds",
    "url": "https://cointelegraph.com/news/cz-binance-investigate-huobi-htx-hack",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/72a2e833-6d83-45ca-994c-b80592b53d9f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>To minimize the damage, HTX proactively offered 5% of the drained funds as a “white-hat bonus,” which would amount to nearly $400,000.</p>\n                    <p><p>Hours after the crypto exchange HTX (rebranded from Huobi) reported a hack that resulted in a loss of $8 million, Changpeng ‘CZ’ Zhao offered the help of the Binance security team in investigating the attack. </p><p>Timely intervention is key to tracking down and retrieving stolen cryptocurrencies as hackers attempt to hide their tracks using mixers or converting the loot to privacy tokens. On Sept. 24, blockchain analytics platform Cyvers identified a hack that managed to drain 5,000 Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) from one of HTX’s hot wallets.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Red CodeYesterday, our ML-powered system detected a suspicious transaction involving <a href=\"https://twitter.com/HuobiGlobal?ref_src=twsrc%5Etfw\">@HuobiGlobal</a> and <a href=\"https://twitter.com/HTX_Global?ref_src=twsrc%5Etfw\">@HTX_Global</a>.<br>Despite our attempts to reach out, we received no response. An EOA received 5K <a href=\"https://twitter.com/search?q=%24ETH&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$ETH</a>  $7.9M from <a href=\"https://twitter.com/HuobiGlobal?ref_src=twsrc%5Etfw\">@HuobiGlobal</a>&#39;s hot wallet.<br><br> This morning, we spotted… <a href=\"https://t.co/3oqHhAVi8P\">pic.twitter.com/3oqHhAVi8P</a></p>&mdash;  Cyvers Alerts  (@CyversAlerts) <a href=\"https://twitter.com/CyversAlerts/status/1706301345223897506?ref_src=twsrc%5Etfw\">September 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>To minimize the damage, HTX proactively offered 5% of the drained funds as a “white-hat bonus,” which would amount to nearly $400,000. However, the hacker has been provided with seven days to comply. HTX communicated the offer in Mandarin (Chinese) as shown in the screenshot below.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-09/05d9b72c-620b-4576-981d-1234fba76b4f.png\"  /><figcaption style=\"text-align: center;\"><em>HTX offering hacker immunity for returning 95% of the stolen funds. Source: etherscan.io</em></figcaption></figure><p>On a lighter note, CZ joked about the resemblance of the newly rebranded HTX with Sam Bankman-Fried’s infamous crypto exchange FTX. However, the loss of funds in both exchange are incomparable — given that HTX was hacked and FTX was an alleged scam.</p><p>Responding to a tweet from Tron founder Justin Sun, who also serves as an advisor for HTX, CZ appointed Binance’s security team to help track the stolen funds. Additionally, Sun confirmed that HTX will cover all losses for its users. He added:</p><blockquote>“$8 million represents a relatively small sum in comparison to the $3 billion worth of assets held by our users. It also amounts to just two weeks' revenue for the HTX platform.”</blockquote><p>HTX also implemented real-time monitoring mechanisms to prevent such losses. While Sun denies owning a major stake on HTX, he committed to conducting several live streams — in English and Chinese — to discuss exchange security.</p><p>Binance did not immediately respond to Cointelegraph’s request for comment about the ongoing HTX hack investigations. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/coinex-compromised-private-keys-behind-70-million-hack\"><strong><em>CoinEx hack: Compromised private keys led to $70M theft</em></strong></a></p><p>Just a day before the HTX hack, Decentralized peer-to-peer network Mixin Network lost nearly $200 million in a hack involving the compromise of the database of a third-party cloud service provider.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">[Announcement] In the early morning of September 23, 2023 Hong Kong time, the database of Mixin Network&#39;s cloud service provider was attacked by hackers, resulting in the loss of some assets on the mainnet. We have contacted Google and blockchain security company <a href=\"https://twitter.com/SlowMist_Team?ref_src=twsrc%5Etfw\">@SlowMist_Team</a>…</p>&mdash; Mixin Kernel (@MixinKernel) <a href=\"https://twitter.com/MixinKernel/status/1706139175018529139?ref_src=twsrc%5Etfw\">September 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>An independent investigation from Web3 SaaS analytics platform 0xScope revealed the hacker's historical relationship with Mixin Network. In 2022, the address 0x1795 — which has been linked to the hacker — received 5 ETH from Mixin, and was deposited into Binance later.</p><p>Deposits and withdrawals on Mixin Network will recommence “once the vulnerabilities are confirmed and fixed.” The plans to recover the lost assets for users were not announced immediately.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-killed-translation-industry-easytranslate-boss-change-human-jobs/\"><strong><em>‘AI has killed the industry’: EasyTranslate boss on adapting to change</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-26T08:36:03.000Z",
    "title": "Leaked documents reveal Microsoft’s plans to bring crypto wallets to Xbox",
    "url": "https://cryptoslate.com/leaked-documents-reveal-microsofts-plans-to-bring-crypto-wallets-to-xbox/",
    "description": "<p>Recently leaked documents reveal that tech giant Microsoft plans to integrate cryptocurrency wallets into its Xbox gaming console. The leaked internal documents posted on the gaming forum ResetEra show that the Xbox roadmap for May 2022 included crypto wallet support. However, specifics about this planned integration were not shown. Phil Spencer, head of Xbox, attributed [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/leaked-documents-reveal-microsofts-plans-to-bring-crypto-wallets-to-xbox/\">Leaked documents reveal Microsoft&#8217;s plans to bring crypto wallets to Xbox</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-26T08:31:47.000Z",
    "title": "Bitcoin shows resilience as traditional markets quake, yen stumbles, bond market looms with turbulence",
    "url": "https://cryptoslate.com/insights/bitcoin-shows-resilience-as-traditional-markets-quake-yen-stumbles-bond-market-looms-with-turbulence/",
    "description": "<p>Quick Take Despite intensifying macroeconomic conditions, Bitcoin has demonstrated remarkable resilience, holding steady at $26,000. This is a noteworthy observation, considering the instability reflected in traditional markets. The Japanese yen is witnessing a swift depreciation against the dollar, currently at 149, indicative of the tumult in the Asian financial sphere. On the other side of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/bitcoin-shows-resilience-as-traditional-markets-quake-yen-stumbles-bond-market-looms-with-turbulence/\">Bitcoin shows resilience as traditional markets quake, yen stumbles, bond market looms with turbulence</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-26T08:38:53.000Z",
    "title": "Tokens Creator of Bitcoin Ordinals Proposes New Fungible Protocol: Runes",
    "url": "https://www.cryptopolitan.com/bitcoin-ordinal-creator-fungible-token-runes/",
    "description": "In the ever-evolving world of cryptocurrency, Bitcoin remains a dominant force. Yet, as with any technology, there are always innovators looking to improve upon existing systems. One such innovator is Casey Rodarmor, the creator of Bitcoin Ordinals. Recently, Rodarmor has been in the spotlight for his proposal of a new Bitcoin-based fungible token protocol named ... <a title=\"Tokens Creator of Bitcoin Ordinals Proposes New Fungible Protocol: Runes\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-ordinal-creator-fungible-token-runes/\" aria-label=\"More on Tokens Creator of Bitcoin Ordinals Proposes New Fungible Protocol: Runes\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-26T08:15:24.000Z",
    "title": "Bitcoin Price Predictions For 2024: Insights From Major Banks To Hedge Funds",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-price-predictions-2024-banks-hedge-funds/",
    "description": "With anticipation around Bitcoin ETFs from giants like BlackRock, Fidelity, and Invesco, and an expected halving in April 2024, forecasts for Bitcoin&#8217;s price next year show a significant range. From JPMorgan to Standard Chartered Bank, here are the most notable estimates for 2024: Pantera Capital: $150,000 In their August &#8220;Blockchain Letter&#8221;, Pantera Capital, led by Dan Morehead, predicts a possible rise to $147,843 post the 2024 halving. Employing the stock-to-flow (S2F) ratio, they believe the price model suggests the valuation of Bitcoin against its scarcity will become more pronounced. Related Reading: MicroStrategy Expands Bitcoin Holdings with $147.3 Million Purchase Specifically, Pantera Capital stated, “The 2020 halving reduced the supply of new bitcoins by 43% relative to the previous halving. It had a 23% as big an impact on price.” With history as a reference, this could indicate a hike from $35k before the halving to $148k after. However, not all Bitcoin supporters are on board, having witnessed failed predictions based on this model in the recent past. Standard Chartered Bank: $120,000 In a recent research report from July, Standard Chartered Bank offered a bullish outlook on Bitcoin&#8217;s potential trajectory. The British multinational bank now expects Bitcoin&#8217;s value to ascend to $50,000 by the end of the current year, with the potential to soar as high as $120,000 by the close of 2024. This revised forecast from Standard Chartered marks an increase from their previous April prediction, where they projected a top of $100,000 for Bitcoin. The upward revision in the bank&#8217;s forecast is underpinned by several determining factors. Notably, one primary reason cited for the potential price escalation is the ongoing banking-sector crisis. Additionally, the report sheds light on the rising profitability for Bitcoin miners as a pivotal factor influencing the price trajectory. Geoff Kendrick, the head of FX and digital assets research, emphasizes the instrumental role of miners. He notes, “The rationale here is that, in addition to maintaining the Bitcoin ledger, miners play a key role in determining the net supply of newly mined BTC.” JPMorgan: $45,000 Per Bitcoin JPMorgan, one of the world&#8217;s leading investment banks, anticipates a more restrained growth for Bitcoin, predicting a rise to $45,000. This forecast is influenced by the surging gold prices. Historically, Bitcoin and gold have shown correlation in their price movements, and with the gold price recently surpassing the $2,000 mark per ounce, it has bolstered JPMorgan&#8217;s conservative outlook on Bitcoin. In a detailed note from May, JPMorgan strategists explained, &#8220;With the gold price rising above $2,000, the value of gold held for investment purposes outside central banks stands at about [$3 trillion]. Consequently, this suggests a Bitcoin price of $45,000, based on the premise that BTC will achieve a standing akin to gold among private investors.&#8221; Matrixport: $125,000 By End-2024 In July, Matrixport, a prominent crypto services provider, predicted that Bitcoin&#8217;s price could surge to as high as $125,000 by the close of 2024. This optimistic outlook was based on historical price patterns and a significant signal: Bitcoin&#8217;s recent breach of $31,000 in mid-July, marking its highest level in over a year. Historically, such milestones have signaled the end of bear markets and the beginning of robust bull markets. By comparing these patterns with historical data from 2015, 2019, and 2020, Matrixport estimated potential gains of up to 123% within twelve months and 310% within eighteen months. This translates to potential Bitcoin prices of $65,539 and $125,731 within those respective timeframes. Tim Draper: $250,000 Tim Draper, a prominent venture capitalist, maintains a highly bullish outlook on Bitcoin. While his previous prediction for Bitcoin to reach $250,000 by June 2023 didn&#8217;t materialize, he remains optimistic about the cryptocurrency&#8217;s long-term potential. In a July interview on Bloomberg TV, Draper attributed recent regulatory actions in the United States, such as those against Coinbase and Binance, to BTC&#8217;s short-term downtrend. Related Reading: Will Bitcoin Drop To $20,000? EURUSD Correlation Indicates It Might Despite these challenges, Draper continues to believe in Bitcoin&#8217;s transformative power and sees it potentially reaching $250,000, albeit now possibly by 2024 or 2025. His confidence in Bitcoin&#8217;s ability to revolutionize finance and retain its long-term value remains unwavering. Berenberg: $56,630 At Bitcoin Halving The German investment bank Berenberg revised its prediction in July, pointing toward $56,630 by April 2024. This upward adjustment was supported by improved market sentiment attributed to the anticipation of the Bitcoin halving event expected in April 2024 and the growing interest exhibited by prominent institutional players. Berenberg&#8217;s team of analysts, led by the insightful Mark Palmer, emphasizes their expectation of significant appreciation in Bitcoin&#8217;s value in the coming months. This projection is driven by two key factors: the highly anticipated Bitcoin halving event and the growing enthusiasm displayed by significant institutions. Highlighting their confidence in the market, Berenberg also reaffirmed its buy rating on the stock of Microstrategy. The bank has revised its share price target for Microstrategy from $430 to $510, driven by a higher valuation of the company&#8217;s BTC holdings and an improved outlook for its software business. Blockware Solutions: $400,000 Blockware Intelligence, in an analysis from August titled &#8220;2024 Halving Analysis: Understanding Market Cycles and Opportunities Created by the Halving,&#8221; delved into the intriguing possibility of Bitcoin&#8217;s price reaching $400,000 during the next halving epoch, anticipated in 2024/25. A central factor identified in the research is the role of the halving in shaping Bitcoin&#8217;s market cycles. The report asserts that miners, responsible for a significant portion of sell pressure, receive newly minted BTC, much of which they must sell to cover operational costs. However, the halving events serve to weed out inefficient miners, leading to reduced sell pressure. With supply diminishing due to halvings, the research emphasizes that demand becomes the primary determinant of BTC&#8217;s market price. Historical data indicates that a surge in demand typically follows halving events. Market participants, equipped with an understanding of the supply-side dynamics introduced by halvings, prepare to deploy capital at the first signs of upward momentum, potentially leading to substantial price appreciation. This surge in demand is particularly evident in current on-chain data, validating the positive sentiment surrounding halving events. Beyond these notable forecasts, there are a plethora of other price predictions for BTC, ranging from Cathie Wood&#8217;s (ARK Invest) ambitious $1 million projection to Mike Novogratz&#8217;s (Galaxy Digital) $500,000, Tom Lee&#8217;s (Fundstrat Global) $180,000, Robert Kiyosaki&#8217;s (Rich Dad Company) $100,000, Adam Back&#8217;s $100,000, and Arthur Hayes&#8217; $70,000 prediction, underscoring the diverse perspectives on Bitcoin&#8217;s future value. At press time, Bitcoin traded at $26,286. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-26T08:11:22.000Z",
    "title": "Is ApeMax the Next Meme Coin to 1000x? Analyzing the Best Crypto Presale of 2023",
    "url": "https://www.crypto-news-flash.com/is-apemax-the-next-meme-coin-to-1000x-analyzing-the-best-crypto-presale-of-2023/?utm_source=rss&utm_medium=rss&utm_campaign=is-apemax-the-next-meme-coin-to-1000x-analyzing-the-best-crypto-presale-of-2023",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-157.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-157.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-157-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the ever-evolving crypto sphere, the quest for remarkable new cryptocurrencies that stand out is unceasing. Amidst a sea of newcomers, ApeMax is making waves and attracting attention in the crypto arena. With its presale gaining significant traction, the burning question on everyone&#8217;s mind is whether ApeMax has the potential to become the next meme [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-26T08:11:31.000Z",
    "title": "Coinbase CLO Expresses Frustration Over SEC’s Objection to Celsius Partnership",
    "url": "https://coinedition.com/coinbase-clo-expresses-frustration-over-secs-objection-to-celsius-partnership/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/01/Coinbase-Has-Not-Registered-with-DNB-Fine-for-Non-Compliance.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Coinbase Has Not Registered with DNB Fine for Non-Compliance\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/01/Coinbase-Has-Not-Registered-with-DNB-Fine-for-Non-Compliance.jpg 730w, https://coinedition.com/wp-content/uploads/2023/01/Coinbase-Has-Not-Registered-with-DNB-Fine-for-Non-Compliance-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/01/Coinbase-Has-Not-Registered-with-DNB-Fine-for-Non-Compliance-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/01/Coinbase-Has-Not-Registered-with-DNB-Fine-for-Non-Compliance-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/01/Coinbase-Has-Not-Registered-with-DNB-Fine-for-Non-Compliance-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/01/Coinbase-Has-Not-Registered-with-DNB-Fine-for-Non-Compliance-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Chief Legal Officer at Coinbase, Paul Grewal, shared his frustration about the U.S. Securities and Exchange Commission (SEC) objecting to their engagement with Celsius, the bankrupt crypto lender platform. Recently, Celsius proposed to engage Coinbase as a distribution agent for international customers and sought the court’s approval of the Coinbase agreements. Grewal stated that Coinbase [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/coinbase-clo-expresses-frustration-over-secs-objection-to-celsius-partnership/\">Coinbase CLO Expresses Frustration Over SEC&#8217;s Objection to Celsius Partnership</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]