[
  {
    "source": "CryptoSlate",
    "date": "2023-08-18T15:35:09.000Z",
    "title": "No decision expected today on Grayscale’s challenge to SEC over Bitcoin ETF conversion",
    "url": "https://cryptoslate.com/no-decision-expected-today-on-grayscales-challenge-to-sec-over-bitcoin-etf-conversion/",
    "description": "<p>Despite rumors,  there will be no decision today, Aug. 18, Grayscale&#8217;s lawsuit against the Securities and Exchange Commission (SEC) over their denial of a spot Bitcoin Exchange-Traded Fund (ETF) conversion, While some had hoped for a decision today, that idea was dispelled by Bloomberg Intelligence Analyst James Seyffart in an Aug. 18 tweet. The potential [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/no-decision-expected-today-on-grayscales-challenge-to-sec-over-bitcoin-etf-conversion/\">No decision expected today on Grayscale&#8217;s challenge to SEC over Bitcoin ETF conversion</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T15:33:28.000Z",
    "title": "Binance CEO reveals ban on futures trading for staff, amid insider trading claims",
    "url": "https://www.cryptopolitan.com/binance-ceo-prohibition-on-futures-trading/",
    "description": "Changpeng Zhao, the CEO of Binance, has revealed that all employees of Binance, including himself, are now barred from participating in futures trading. The move is a part of the cryptocurrency exchange&#8217;s ongoing endeavors to prioritize integrity and prevent potential conflicts of interest within its workforce. Binance prohibited from futures trading Zhao revealed that the ... <a title=\"Binance CEO reveals ban on futures trading for staff, amid insider trading claims\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-ceo-prohibition-on-futures-trading/\" aria-label=\"More on Binance CEO reveals ban on futures trading for staff, amid insider trading claims\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T15:33:05.000Z",
    "title": "Polkadot Price Prediction 2023-2032: A Bullish Pattern?",
    "url": "https://www.cryptopolitan.com/polkadot-price-prediction/",
    "description": "Gavin Wood, the founder of Polkadot, the blockchain interoperability platform, has come under fire for&#160;putting a condition on a possible $5M donation&#160;to help the Ukrainian govt with the crisis caused by the Russian invasion.&#160;Some respondents felt this was less of a humanitarian gesture and more of a marketing punt. Will this affect our Polkadot Price ... <a title=\"Polkadot Price Prediction 2023-2032: A Bullish Pattern?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/polkadot-price-prediction/\" aria-label=\"More on Polkadot Price Prediction 2023-2032: A Bullish Pattern?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-18T15:24:02.000Z",
    "title": "MiCA doesn’t guarantee absolute safety, warns EU Securities Head",
    "url": "https://www.cryptopolitan.com/mica-doesnt-guarantee-absolute-safety/",
    "description": "The European Union (EU) has been at the forefront of many financial and regulatory innovations, and its latest venture into digital assets is no exception. The Markets in Crypto Assets (MiCA) legislation, approved in April, is Europe&#8217;s ambitious attempt to bring clarity and oversight to the rapidly evolving world of cryptocurrencies. However, as with any ... <a title=\"MiCA doesn&#8217;t guarantee absolute safety, warns EU Securities Head\" class=\"read-more\" href=\"https://www.cryptopolitan.com/mica-doesnt-guarantee-absolute-safety/\" aria-label=\"More on MiCA doesn&#8217;t guarantee absolute safety, warns EU Securities Head\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-18T15:30:19.000Z",
    "title": "Bitcoin Investors Fall Into Fear As BTC Crashes To $26,500",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-investors-fall-fear-btc-crashes-26500/",
    "description": "Data shows the Bitcoin market sentiment has plunged into fear as the cryptocurrency&#8217;s price has observed a crash to the $26,500 level. Bitcoin Fear &#38; Greed Index Points At &#8220;Fear&#8221; In The Market The &#8220;Fear &#38; Greed Index&#8221; is an indicator that tells us about the general sentiment among investors in the Bitcoin and wider cryptocurrency market. This metric uses a numeric scale that runs from 0-100 for displaying the sentiment. All values above the 54 mark suggest the presence of greed among the investors, while those below 46 imply a majority mentality of fear. The region between these cutoffs reflects the neutral sentiment. As for how the index calculates the sentiment, Alternative.me, the creator of the metric, explains that it takes into account several different factors. Namely; volatility, trading volume, social media sentiment, market cap dominance, and Google Trends are what the indicator currently makes use of to pinpoint the market mentality. Now, here is what the Bitcoin Fear &#38; Greed Index&#8217;s value looks like right now: The value of the metric seems to be inside the fear territory at the moment &#124; Source: Alternative As you can see above, the index&#8217;s value is 37 currently, which suggests that the majority of the investors are fearful. This latest value of the indicator reflects a new shift in the sector, as prior to today, the indicator had been stuck inside the neutral territory for more than three weeks straight. Related Reading: Bitcoin Liquidations Top $500 Million Amid $1 Billion Crypto Decimation The below chart displays the trend in the fear and greed index over the past year. Looks like the value of the metric has taken a plunge recently &#124; Source: Alternative From the graph, it&#8217;s visible how sharp this latest drop in the metric has been. In a flash, the market sentiment went from being completely neutral (50), to firmly inside the fear territory (37). The reason behind this hit to the investor mentality has been the sharp crash that Bitcoin has observed during the past day, as the cryptocurrency&#8217;s price has now slumped below $26,500. Earlier, when the index was consolidating in neutral territory, investors had been hesitant and undecided. But with this price action, it would appear that their mind has been made up, and they think that the asset would go down even lower. Historically, the market has actually tended to make moves that the majority of the holders aren&#8217;t expecting. The harder investors lean toward any one direction (fear or greed), the more probable price action of the opposite type becomes. The Bitcoin Fear &#38; Greed Index also has two sub-sentiments inside fear and greed called extreme fear and extreme greed. These take place at values below 25 and above 75, respectively. Cyclical bottoms and tops in the asset have usually always formed whenever the market has been inside these zones, showcasing the aforementioned effect in action. Related Reading: Will Bitcoin Volatility Continue? These Metrics Say Yes As the market hasn&#8217;t yet dipped too deep into the fear region, the probability of a bottom is likewise not raised too much yet. Back in March, however, Bitcoin did manage to find its bottom when the investors were fearful to a degree not much greater than right now. It now remains to be seen how the market sentiment will develop in the coming days, and if BTC will be able to find its bottom off the back of this fearful situation. BTC Price At the time of writing, Bitcoin is trading around $26,400, down 10% in the last week. BTC has rapidly gone down during the past 24 hours &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Alternative.me"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-18T15:14:59.000Z",
    "title": "Shibarium Launch: Shiba Inu’s Layer 2 Solution Faces Challenges, Offers Long-Term Promise",
    "url": "https://www.crypto-news-flash.com/shibarium-launch-shiba-inus-layer-2-solution-faces-challenges-offers-long-term-promise/?utm_source=rss&utm_medium=rss&utm_campaign=shibarium-launch-shiba-inus-layer-2-solution-faces-challenges-offers-long-term-promise",
    "description": "<img width=\"1920\" height=\"1277\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1.0.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Shina Inu\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1.0.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1.0-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1.0-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/01/shib-shiba-inu-1.0-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />After a sloppy launch, Shibarium core developers immediately stepped in to resolve the technical difficulties caused by network congestion. Lead Shibarium developer Shytoshi Kusama has committed $2 million to ensure the funds are locked in the bridge in case they are irretrievable. The Shibarium course is well and ready to take the Shiba Inu ecosystem [...]"
  }
]