[
  {
    "source": "CoinDesk",
    "date": "2023-09-11T13:00:00.000Z",
    "title": "Crypto Safekeeping Specialist Fireblocks Introduces Non-Custodial Wallet Service",
    "url": "https://www.coindesk.com/business/2023/09/11/crypto-safekeeping-specialist-fireblocks-introduces-non-custodial-wallet-service/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Fireblocks’ multi-party computation technology works well in a non-custodial setting, shifting counterparty risk away from a corporate entity, Shaulov explained in an interview with CoinDesk."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-11T13:00:06.000Z",
    "title": "Five accused of illicit $76M cryptocurrency scam captured in Thailand",
    "url": "https://cryptoslate.com/five-accused-of-illicit-76m-cryptocurrency-scam-captured-in-thailand/",
    "description": "<p>In a massive cross-border operation, four Chinese nationals and a Lao citizen were apprehended over their alleged involvement in a multimillion cryptocurrency scam that left a trail of devastation and losses amounting to over 2.7 billion baht ($76 million), according to the Cyber Crime Investigation Bureau (CCIB). As the Bangkok Post reported, the fraudulent scheme [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/five-accused-of-illicit-76m-cryptocurrency-scam-captured-in-thailand/\">Five accused of illicit $76M cryptocurrency scam captured in Thailand</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-11T13:00:17.000Z",
    "title": "Pro-XRP Lawyer John Deaton Reveals The Countries Topping The 75,000 Holder List",
    "url": "https://www.newsbtc.com/analysis/xrp/xrp-75000-list/",
    "description": "Over the course of Ripple’s legal battle with the United States Securities and Exchange Commission (SEC), John Deaton has grown to become one of the most prominent voices in support of the crypto firm. The result of this was a list containing 75,000 potential intervenors, all of which hold XRP. Up until now, the regional composition of this 75,000-holder list has been unknown. But Deaton has finally revealed which countries are leading the pack as ‘potential intervenors.’ The United States Leads The 75,000 XRP Holder List In a tweet shared on the X (formerly Twitter) platform, Deaton revealed to his more than 292,000 followers that the United States made up the majority of the 75,000 XRP holder list. The tweet highlighted that US holders currently make up 53% of the list, making it the leading region. Related Reading: Crypto Analyst Presents Bull Case For XRP Price To Hit $130, Here’s When Going forward, the pro-XRP lawyer points to the United Kingdom as having the second-largest holder base on the list. This is then followed by Australia, which the lawyer excitedly reveals has moved up to the third position as of the last time he checked the holder list. However, Deaton explained that Australia’s lead over Canada in the fourth place only comes down to a difference of around 11 holders. The lawyer’s tweet comes in response to an announcement from the Wave of Innovation official X handle that Deaton would be the keynote speaker of an upcoming event. The event totaled “XRP Gold Coast” would run from March 22-24 in 2024, and Deaton was picked as the keynote speaker due to his “significant contributions to the XRP community through his legal work and advocacy efforts.” Deaton went on to highlight his pleasure of being the keynote speaker at this event by pointing out Australia’s growing dominance on the 75,000 XRP holder list. “I could not say no, nor pass on the opportunity to meet many of them,” he tweeted. I checked the 75K #XRP Holder list. Australia 🇦🇺 has moved to the #3 spot. About 53% of the 75K #XRP Holders are from the United States 🇺🇸 The United Kingdom 🇬🇧 comes in at #2. After that, Australia 🇦🇺 has a very small lead (ie like 11 people) over Canada 🇨🇦, as the 3rd most… https://t.co/HYfaNOioju — John E Deaton (@JohnEDeaton1) September 10, 2023 Token price loses $0.5 support &#124; Source: XRPUSD on Tradingview.com Representing The Interest Of Investors John Deaton’s rise to fame, especially among crypto investors, first came when the lawyer began advocating for XRP holders. While Ripple Labs battled the SEC in the courtrooms, Deaton was the attorney of choice for XRP investors who wanted to make their voices heard in the case. Support for Ripple had grown rapidly as many referred to the regulator’s actions as an overreach. Meanwhile, the number of XRP investors throwing their hats in the ring grew to over 75,000 on Deaton’s list. Related Reading: Can Ripple Control The XRP Price? Crypto Analysts Weigh In According to the attorney, being on this ’75K List’ meant that XRP investors could potentially be able to seek reimbursement if the price of XRP were to suffer as a result of the regulator’s actions. The legal battle that began in 2020 is currently still ongoing with the SEC filing an interlocutory appeal in response to Judge Analisa Torres’s ruling back in July. So whether or not there will be any reimbursement for XRP holders impacted by the regulator’s actions remains to be seen. Featured image from Bitcoinist, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-11T12:55:09.000Z",
    "title": "Injective Token (INJ) Price Prediction 2023-2030: Will INJ Price Hit $15 Soon?",
    "url": "https://coinedition.com/injective-token-inj-price-prediction/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Injective-Token-INJ-Price-Prediction.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Injective Token (INJ) Price Prediction\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Injective-Token-INJ-Price-Prediction.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Injective-Token-INJ-Price-Prediction-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Injective-Token-INJ-Price-Prediction-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Injective-Token-INJ-Price-Prediction-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Injective-Token-INJ-Price-Prediction-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Bullish Injective Token  (INJ)price prediction ranges from $8 to $15. Analysis suggests that the Injective Token price might reach above $14. The Injective Token bearish market price prediction for 2023 is $1.2. If you want to diversify your holdings and get experience with different cryptocurrencies, there are several alternative digital currencies to explore besides Bitcoin [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/injective-token-inj-price-prediction/\">Injective Token (INJ) Price Prediction 2023-2030: Will INJ Price Hit $15 Soon?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-11T12:55:00.000Z",
    "title": "G20 Leaders To Closely Monitor Risks in Crypto Asset Ecosystem",
    "url": "https://coinedition.com/g20-leaders-to-closely-monitor-risks-in-crypto-asset-ecosystem/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/11/Digital-Assets-Record-42M-Inflow-Bitcoin-Inflow-Totals-19M.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Digital Assets Record $42M Inflow; Bitcoin Inflow Totals $19M\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/Digital-Assets-Record-42M-Inflow-Bitcoin-Inflow-Totals-19M.jpg 730w, https://coinedition.com/wp-content/uploads/2022/11/Digital-Assets-Record-42M-Inflow-Bitcoin-Inflow-Totals-19M-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/Digital-Assets-Record-42M-Inflow-Bitcoin-Inflow-Totals-19M-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/Digital-Assets-Record-42M-Inflow-Bitcoin-Inflow-Totals-19M-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/Digital-Assets-Record-42M-Inflow-Bitcoin-Inflow-Totals-19M-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/Digital-Assets-Record-42M-Inflow-Bitcoin-Inflow-Totals-19M-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The G20 member nations have endorsed the crypto regulation, supervision, and oversight recommendations by the Financial Stability Board (FSB). The endorsement was contained in a declaration by the group’s spokesperson over the weekend. The G20 declared: &#8220;We endorse the Financial Stability Board&#8217;s (FSB&#8217;s) high-level recommendations for the regulation, supervision, and oversight of crypto-asset activities and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/g20-leaders-to-closely-monitor-risks-in-crypto-asset-ecosystem/\">G20 Leaders To Closely Monitor Risks in Crypto Asset Ecosystem</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]