[
  {
    "source": "Cointelegraph",
    "date": "2023-09-06T20:13:42.000Z",
    "title": "OpenAI and Microsoft accused of stealing data to train ChatGPT in new class-action suit",
    "url": "https://cointelegraph.com/news/open-ai-microsoft-accused-stealing-data-train-chat-gpt-artificial-intelligence-lawsuit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/c0f59e52-ed5c-4201-b43d-6ee5fa44dae9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The lawsuit alleges that OpenAI’s profits came as a result of using illegally scraped data to train its models.</p>\n                    <p><p>OpenAI and Microsoft have been named as the defendants in yet another class-action lawsuit over their alleged use of web scraping techniques to obtain supposedly private data for the use of training ChatGPT and other associated artificial intelligence (AI) models. </p><p>The most recent class-action suit was filed on Sept. 5 in San Francisco by a law firm representing a pair of unnamed engineers.</p><p>According to a <a href=\"https://dockets.justia.com/docket/california/candce/3:2023cv04557/417880\" target=\"_blank\" rel=\"noopener nofollow\">filing</a> registered with the United States District Court for the Northern District of California: </p><blockquote>“This class action lawsuit arises from Defendants’ unlawful and harmful conduct in developing, marketing, and operating their AI products, including ChatGPT-3.5, ChatGPT-4.0, Dall-E, and Vall-E (the 'Products'), which use stolen private information, including personally identifiable information, from hundreds of millions of internet users, including children of all ages, without their informed consent or knowledge.”</blockquote><p>The lawsuit goes on to complain that OpenAI “doubled down on a strategy to secretly harvest massive amounts of personal data from the internet” after <a href=\"https://techcrunch.com/2019/03/11/openai-shifts-from-nonprofit-to-capped-profit-to-attract-capital/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuYmluZy5jb20v&amp;guce_referrer_sig=AQAAAJThRY0FFhnS9IrFFvCoYBNMxbqBh7FOPYYPr4ld5JmTQWY_yrJhWgKpOltqaKNQUIwZ09WC3QrX0cLXit0hKfa3AqqqM-MZ9FJNH8iSUgNPTbowLkN1KYfpORu6cSXrzaGHAe5vDhggAhPthkCnDKXSmh2k2I-AgR6zbSobMABd#:~:text=OpenAI%20may%20not%20be%20quite%20so%20open%20going,cuts%20returns%20from%20investments%20past%20a%20certain%20point.\" target=\"_blank\" rel=\"noopener nofollow\">restructuring</a> in 2019. </p><p>“Without this unprecedented theft of private and copyrighted information belonging to real people,” write the plaintiffs, “the products,” referring to ChatGPT, DALL-E and OpenAI’s other models, “would not be the multi-billion-dollar business they are today.”</p><p>According to the filing, the plaintiffs are asking the courts to award damages to the plaintiffs and any members of the proposed classes — which could conceivably include anyone whose information was allegedly scraped. </p><p>The suit also asks the courts to order the defendants to conduct “nonrestituionary disgorgement” of profits made as a result of the alleged illegal scraping of data. </p><p>Scraping is the practice of using an automated bot, often called a “crawler,\" to collect data from the internet. This most recent suit alleges that OpenAI and Microsoft knowingly engaged in “illegal” scraping activity. </p><p>A previous class-action lawsuit making nearly identical <a href=\"https://fingfx.thomsonreuters.com/gfx/legaldocs/akveaomgxvr/OPENAI%20PRIVACY%20LAWSUIT%20clarkson.pdf\" target=\"_blank\" rel=\"noopener nofollow\">claims</a> against OpenAI and Microsoft was filed in the same court district on June 28. It’s unclear at this time if the court or defendants in the separate cases would consider combining the suits. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/us-copyright-office-issues-notice-of-inquiry-on-artificial-intelligence\"><strong><em>US Copyright Office issues notice of inquiry on artificial intelligence</em></strong></a></p><p>This isn’t the first time Microsoft’s been involved in a lawsuit over alleged scraping. The Redmond, Washington company <a href=\"https://law.justia.com/cases/federal/appellate-courts/ca9/17-16783/17-16783-2022-04-18.html\" target=\"_blank\" rel=\"noopener nofollow\">issued</a> a cease-and-desist order on behalf of its LinkedIn brand to data analytics company HiQ in 2019 over its admitted data scraping practices. </p><p>In that case, Microsoft and LinkedIn alleged that HiQ had violated the terms of service agreement required to log in to the LinkedIn website and thus have access to user data. Initially, the circuit court ruled in favor of HiQ, but upon Microsoft’s appeals, the Supreme Court vacated the judgment. </p><p>The case was then kicked back down to the circuit court, where Microsoft found itself on the winning side of the case. HiQ agreed to a settlement with Microsoft for an undisclosed amount and was ordered to cease its scraping activities. </p><p>Microsoft and OpenAI did not immediately respond to requests for comment.</p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-09-06T20:10:33.000Z",
    "title": "Tornado Cash developer Roman Storm pleads not guilty to charges of conspiracy, money laundering; released on $2M bond",
    "url": "https://cryptoslate.com/tornado-cash-developer-roman-storm-pleads-not-guilty-to-charges-of-conspiracy-money-laundering-will-be-released-on-2m-bond/",
    "description": "<p>Roman Storm, a key developer behind cryptocurrency mixer Tornado Cash, pleaded not guilty to several criminal charges, Inner City Press said on Sept. 6. That report indicates that Storm pleaded not guilty to charges contained within an earlier indictment. Those charges, which were first announced on Aug. 23, include conspiracy to commit money laundering, conspiracy [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/tornado-cash-developer-roman-storm-pleads-not-guilty-to-charges-of-conspiracy-money-laundering-will-be-released-on-2m-bond/\">Tornado Cash developer Roman Storm pleads not guilty to charges of conspiracy, money laundering; released on $2M bond</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-06T20:30:06.000Z",
    "title": "Tornado Cash Co-Founder Pleads Innocence Amidst Money Laundering and Hacking Scandal",
    "url": "https://news.bitcoin.com/tornado-cash-co-founder-pleads-innocence-amidst-money-laundering-and-hacking-scandal/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/jdjduuf-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/jdjduuf-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/jdjduuf-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/jdjduuf-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/jdjduuf-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/jdjduuf-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/jdjduuf-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/jdjduuf.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />On the 6th of September, 2023, the Inner City Press (ICP) delivered an account of the legal proceedings involving Roman Storm, one of the co-creators behind the ethereum (ETH) mixing protocol, Tornado Cash. In the courtroom drama that unfolded, Storm resolutely declared his innocence by pleading not guilty to the charges levied against him. Tornado [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-06T20:34:16.000Z",
    "title": "Digital currencies’ unwanted role in the culture wars",
    "url": "https://www.cryptopolitan.com/digital-currencies-unwanted-role-culture-war/",
    "description": "Amid the growing political turbulence and societal divisions of our age, a new player has entered the arena: cryptocurrencies, or more specifically, Central Bank Digital Currencies (CBDCs). As nations from China to Nigeria embrace digital currencies, their true implications in the modern world raise eyebrows and fuel conspiracy theories. From Wonkish Debate to Political Hot ... <a title=\"Digital currencies&#8217; unwanted role in the culture wars\" class=\"read-more\" href=\"https://www.cryptopolitan.com/digital-currencies-unwanted-role-culture-war/\" aria-label=\"More on Digital currencies&#8217; unwanted role in the culture wars\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-06T20:12:41.000Z",
    "title": "Binance’s smart contract miracle: Xirtam $3M scam victims rejoice",
    "url": "https://www.cryptopolitan.com/binances-smart-contract-miracle/",
    "description": "Binance, a prominent cryptocurrency exchange, has taken a significant step in addressing the fallout from the Xirtam rug pull incident by introducing an automated smart contract to facilitate the reimbursement of affected users. This development was announced on September 6th, marking a proactive response to the unfortunate events surrounding Xirtam. The process for users affected ... <a title=\"Binance&#8217;s smart contract miracle: Xirtam $3M scam victims rejoice\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binances-smart-contract-miracle/\" aria-label=\"More on Binance&#8217;s smart contract miracle: Xirtam $3M scam victims rejoice\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-06T20:30:58.000Z",
    "title": "Analyst: Blackrock’s Bitcoin Spot ETF May Unleash $30 Trillion From US Advisors",
    "url": "https://www.newsbtc.com/bitcoin-news/analyst-blackrock-bitcoin-spot-etf-may-unlock-trillion/",
    "description": "The possibility of a Bitcoin spot Exchange Traded Fund (ETF) launching in the US, which has gained much attention over the past months, has again made headlines due to Bloomberg ETF analyst Eric Balchunas&#8217;s recent suggestions. According to the analyst, should the US Securities and Exchange Commission (SEC) approve BlackRock&#8217;s Bitcoin spot ETF, a vast pool of $30 trillion capital overseen by US financial advisors could be directed toward Bitcoin investments. Notably, Balchunas clarified that while the approval of a BTC spot ETF could serve as an accessible pathway for the $30 trillion managed by financial advisors to flow into BTC investments potentially, it is not particularly sure if the entirety of the $30 trillion would move into Bitcoin. Related Reading: BREAKING: Grayscale Triumph: SEC Crushed, GBTC Rockets Towards ETF, Bitcoin Targets $28,000 The analyst noted that only a fraction of that amount might consider investing. Balchunas noted: &#8220;But even if 0.5% of that allocates, it&#8217;s $150b.&#8221; Hey I said that a spot ETF will be a bridge to the $30T advisors manage, a very small amt of which may invest, not all 30! 🙂 But even if 0.5% of that allocates it&#8217;s $150b — Eric Balchunas (@EricBalchunas) September 5, 2023 Aftermath Of A BlackRock’s Bitcoin Spot ETF It is worth noting that when BlackRock, boasting over $9 trillion in assets under management, lodged its Bitcoin spot ETF application, it didn’t merely mark its entry. It also dramatically tilted the probability scales for an ETF approval. Before BlackRock stepped into the frame, the Bloomberg expert claimed that the odds of a BTC spot ETF seeing the light of day in the US hovered around a mere 1%. However, after BlackRock&#8217;s involvement, Balchunas disclosed in a podcast that the probability surged to 50%. Their application had consequences. Balchunas observed a subsequent surge in similar applications from renowned entities, namely ARK Investment, Valkyrie, and Fidelity. This underscored BlackRock’s influence and the escalating competition in the space. Balchunas noted: Their application triggered a wave of similar filings by other prominent firms such as ARK Investment, Valkyrie, and Fidelity, setting the stage for a highly competitive environment. Spot ETF Vs. Futures ETF: The Real Potential The US isn’t entirely unacquainted with BTC ETFs. Bitcoin futures ETFs have already made their mark, albeit in a limited manner. As it stands, these futures-based ETFs amass roughly $1 billion in total assets under management. A figure that, though impressive, may appear minor in the face of a spot ETF&#8217;s potential. Balchunas went as far as to term the BTC spot ETF the &#8220;holy grail.&#8221; A product that, if approved, could overshadow existing futures ETFs and charge up the crypto domain in ways so far unseen. Related Reading: Want A Bitcoin Spot ETF? Then Prove BTC Is Not Manipulated, Says SEC Meanwhile, amid the race to approve a Bitcoin spot ETF, BTC has been in a continuous downtrend over the past week. The asset has dipped below the $26,000 mark, down by 5.7%. Bitcoin currently trades for $25,501, at the time of writing, down by nearly 1%. Featured image from iStock, Chart from TradingView"
  }
]