[
  {
    "source": "CryptoSlate",
    "date": "2023-06-18T15:00:20.000Z",
    "title": "How Apple’s VisionOS can pave the way for mainstream metaverse adoption",
    "url": "https://cryptoslate.com/how-apples-visionos-can-pave-the-way-for-mainstream-metaverse-adoption/",
    "description": "<p>The future of the metaverse is highly debated at the moment with Instagram pulling NFT support, lackluster growth of many metaverse projects, the potential security classification for metaverse tokens such as SAND and MANA, and notably the launch of Apple&#8217;s VisionPro with no mention of a metaverse in its WWDC conference. However, simply because it [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/how-apples-visionos-can-pave-the-way-for-mainstream-metaverse-adoption/\">How Apple&#8217;s VisionOS can pave the way for mainstream metaverse adoption</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-18T14:56:43.000Z",
    "title": "NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?",
    "url": "https://www.cryptopolitan.com/near-price-prediction/",
    "description": "NEAR Price Prediction 2023-2032 Near Protocol (NEAR) is a blockchain platform with significant attention and partnerships within the cryptocurrency industry. Initially established by a small team in San Francisco, NEAR Protocol has rapidly expanded its influence and formed collaborations with industry giants. As a result, it has witnessed a consistent upward trajectory since its inception. ... <a title=\"NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-price-prediction/\" aria-label=\"More on NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-18T14:40:02.000Z",
    "title": "NatWest implements policy requiring prior notice for cash withdrawals",
    "url": "https://www.cryptopolitan.com/natwest-implements-policy-requiring-prior-notice-for-cash-withdrawals/",
    "description": "In a move that has raised eyebrows and fueled skepticism, NatWest, one of the largest banks in the United Kingdom, has introduced a new policy mandating customers to provide advance notice for cash withdrawals exceeding £2,000. The policy applies not only to traditional transactions but also to withdrawals from cryptocurrency platforms. The bank claims that ... <a title=\"NatWest implements policy requiring prior notice for cash withdrawals\" class=\"read-more\" href=\"https://www.cryptopolitan.com/natwest-implements-policy-requiring-prior-notice-for-cash-withdrawals/\" aria-label=\"More on NatWest implements policy requiring prior notice for cash withdrawals\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-18T14:50:20.000Z",
    "title": "Hinmann documents unsealed in Ripple vs. SEC case, Binance faces more regulatory headwinds | Weekly recap",
    "url": "https://crypto.news/hinmann-documents-unsealed-in-ripple-vs-sec-case-binance-faces-more-regulatory-headwinds-weekly-recap/",
    "description": "Hinman documents unsealed in the Ripple vs. SEC case, Binance and Coinbase navigate market conditions following SEC's charges, bill to dismiss Gary Gensler as SEC Chairperson reaches Congress"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-18T14:50:21.000Z",
    "title": "Quant Soars 20% After Partnership With Bank Of England, BIS For CBDC Project",
    "url": "https://www.newsbtc.com/all/quant-soars-20-after-partnership-with-bank-of-england-bis-for-cbdc-project/",
    "description": "The native currency of Quant, a  blockchain platform that helps financial institutions incorporate digital currencies into their businesses, on June 15 soared 20% following its partnership announcement with the Bank of England for Project Rosalind. Quant Collaborates With BIS And The Bank Of England Project Rosalind is a central bank digital currency (CBDC) initiative, led by the Bank for International Settlements (BIS) and the Bank of England. It aims to explore the implementation of APIs in CBDC systems to facilitate retail payments. Project Rosalind focuses on leveraging APIs in CBDCs and investigating innovative use cases for the technology. The project uses a collaborative model between the public and private sectors. The public sector provides the needed infrastructure, and the private sector is responsible for developing consumer applications. Related Reading: ZachXBT Slapped With Defamation Lawsuit For MachiBigBrother Exposé Quant contributed to the development of Project Rosalind, by designing and developing API functionalities that would enable programmability within the private sector. Following the announcement of their contribution, QUANT soared 20%, reversing losses posted early this week. Besides designing, Quant also provided the underlying infrastructure and blockchain platform, needed for the interoperability of central bank ledgers. Gilbert Verdian, Founder and CEO of Quant, expressed enthusiasm about the potential of CBDCs, saying:  “For the first time, money is ready for the digital age. A CBDC will enable citizens and businesses to automate cumbersome payments and processes and implement logic into money. For commercial banks and other institutions, the opportunity to apply this programmability to create innovative new products that differentiate themselves from challengers and competitors is almost endless. We encourage every bank and financial institution to read the Project Rosalind report and start planning their smart money infrastructure strategy.” Project Rosalind And CBDCs Project Rosalind, led by the London Centre, was designed to tackle crucial issues within the retail CBDCs&#8217; development. These issues include improving public-private sector collaboration, maximizing interoperability, and meeting the constantly changing needs of citizens. Project Rosalind seeks to improve public-private sector collaboration by creating prototype APIs that enable a central bank to interact safely with private sector service providers. The project adopts a two-tier distribution model, with the central bank in the background, forming the foundation of the retail CBDC and private sector applications handling customer requests. Related Reading: Binance Coin (BNB) Faces Sideways Movement, Bears Threaten Further Sell-Off Through extensive collaborations, Project Rosalind has demonstrated that APIs can play a crucial role in enhancing CBDCs&#8217; payment functionalities and security. By leveraging distributed ledger technologies like blockchain, Quant can also fulfill its vision of being a decentralized network of networks, bringing greater reliability and security to various industries. Feature image from Canva, chart from TradingView"
  }
]