[
  {
    "source": "Decrypt",
    "date": "2024-01-23T23:02:50.000Z",
    "title": "Watch Your Mouth, Anon: 'Call of Duty' AI Tool Punishes Millions of Toxic Players",
    "url": "https://decrypt.co/213971/watch-your-mouth-anon-call-of-duty-ai-tool-punishes-millions-of-toxic-players",
    "description": "Over 2 million accounts have faced enforcement for disruptive chat since the launch of the AI-powered ToxMod tool for Call of Duty."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-23T22:41:45.000Z",
    "title": "SEC Commissioner Hester Peirce : No Court Battle Needed for Spot Ether ETF Approval",
    "url": "https://www.cryptopolitan.com/hester-peirce-no-court-battle-spot-ether-etf/",
    "description": "In a recent statement, Securities and Exchange Commission (SEC) Commissioner Hester Peirce affirmed that spot ether exchange-traded funds (ETFs) won&#8217;t require legal battles for approval. Her remarks shed light on the SEC&#8217;s stance and the potential future of crypto-based ETFs. This development follows the SEC&#8217;s recent approval of multiple spot bitcoin ETFs, raising questions about [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-23T23:00:02.000Z",
    "title": "Solana Dominates Ethereum, Bitcoin In NFT, Activity: What’s Next For SOL?",
    "url": "https://www.newsbtc.com/news/solana/solana-dominates-ethereum-bitcoin-nft-activity/",
    "description": "According to on-chain data from SolanaFloor, Solana is dominating other blockchains, including Ethereum and Polygon, across various non-fungible token (NFT) activity metrics in the third week of January. Solana Dominates Ethereum, Bitcoin In NFT Activity In a post shared on X on January 23, Solana maintained its NFT dominance among competing blockchains, mainly Ethereum and other high throughput alternatives. Thus far, the blockchain has the highest numbers in unique wallets, transactions, unique buyers, and first-time wallets over the past week.  To illustrate, Solana had over 106,000 unique wallets by the third week of January 2024. This is more than twice those created in Ethereum. Meanwhile, there were over 22,000 first-time wallets on Solana, roughly 3X those in Ethereum and 2X in Bitcoin. At the same time, more than 2.8 million transactions were posted on Solana. This figure is over 20X those in Ethereum during the same time frame.  Related Reading: Bitcoin Price Drops Sub $39,000 – 3 Key Reasons Extrapolating from this data suggests that the blockchain is increasingly popular among NFT projects, collectors, and traders. Several factors could be contributing to Solana&#8217;s NFT success.  The platform is known for its high throughput and low transaction fees. Considering how minters and active traders are sensitive to trading fees, Solana is emerging as a layer-1 option for projects wishing to enjoy the security of the mainnet while also benefiting from low transaction fees. Legacy chains, including Ethereum, continue to struggle with on-chain scalability. Minting on the mainnet often translates to high fees, which can decrease profitability, especially for active traders and collectors. Beyond scalability advantages, Solana&#8217;s ecosystem is rapidly expanding. Despite the catastrophic drop of SOL prices at the end of 2022, the spectacular revival in 2023 activated on-chain activity with meme coins blooming and NFT projects opting to launch on Solana. The ongoing recovery of SOL and the increasing number of projects opting to deploy on the mainnet could further drive on-chain activities, including NFT minting and trading, to new levels in 2024. Developers At Work, Will SOL Reclaim $125? As the network draws users, its developers are also working to make the platform more robust and decentralized. In 2024, Solana developers plan to activate Firedancer, a validator client developed by Jump Capital. This client will help further decentralize Solana&#8217;s infrastructure, improve performance, and substantially improve reliability, eliminating network hitches that plagued the blockchain in 2022 and early 2023. SOL is cooling off, trading at around $80 when writing. The coin is down 34% from December 2023 peaks and below the dynamic 20-day moving average, pointing to bears. Related Reading: Shiba Inu Ecosystem Soars: Shibarium Hits Crucial Milestone Key support remains at around $70. If there is demand at this price point, SOL may recover and retest $125 in the sessions ahead. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-23T23:01:53.000Z",
    "title": "Regulators Investigating Collapsed Crypto Firm That Owes Creditors $58,000,000 After Going Bust in 2021: Report",
    "url": "https://dailyhodl.com/2024/01/23/regulators-investigating-collapsed-crypto-firm-that-owes-creditors-58000000-after-going-bust-in-2021-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/12/co-founder-scheme-faces.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/12/co-founder-scheme-faces.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/12/co-founder-scheme-faces.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/12/co-founder-scheme-faces.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/12/co-founder-scheme-faces.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/12/co-founder-scheme-faces.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/12/co-founder-scheme-faces.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Australian securities regulators are investigating Blockchain Global after a report connected two of its directors to previous crypto schemes. The Australian Securities and Investment Commission (ASIC) is investigating Blockchain Global directors Sam Lee and Ryan Xu after a newspaper investigation linked the two to another crypto scheme called Hyperverse, according to a report. Asic began investigating [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/23/regulators-investigating-collapsed-crypto-firm-that-owes-creditors-58000000-after-going-bust-in-2021-report/\">Regulators Investigating Collapsed Crypto Firm That Owes Creditors $58,000,000 After Going Bust in 2021: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]