[
  {
    "source": "Decrypt",
    "date": "2024-01-24T19:16:02.000Z",
    "title": "Self-Described Bitcoin Inventor Craig Wright Offers to Settle IP Case",
    "url": "https://decrypt.co/214116/self-described-bitcoin-inventor-craig-wright-offers-to-settle-ip-case",
    "description": "Wright proposes a settlement in the dispute over Bitcoin’s creation, offering concessions to COPA ahead of the February 5 trial."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-24T19:09:41.000Z",
    "title": "Trash-Fueled BTC Mining w/ Chris Bennet",
    "url": "https://decrypt.co/videos/interviews/uLy5Y1E7/trash-fueled-btc-mining-w-chris-bennet",
    "description": "Reza is joined by Chris Bennet from Spacestation Investments.\n\nThey discuss:\n- Mining BTC with energy generated from landfills\n- How to increase deal-flow\n- Running an agency vs running a fund"
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-24T19:35:21.000Z",
    "title": "Bitcoin’s retreat to under $37,800 might be a new chance to accumulate",
    "url": "https://cryptobriefing.com/bitcoins-retreat-under-37800-chance-accumulate/?utm_source=feed&utm_medium=rss",
    "description": "If GBTC outflows keep impacting Bitcoin prices, volatility may rise on the way down and new accumulation windows might open."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-24T19:29:26.000Z",
    "title": "Solana launches token extensions to facilitate secure and compliant Web3 transitions",
    "url": "https://cryptobriefing.com/solana-token-extensions-facilitate-secure-compliant-web3/?utm_source=feed&utm_medium=rss",
    "description": "Solana introduces token extensions, empowering developers to build on Solana blockchain with ease and efficiency."
  },
  {
    "source": "Crypto Daily",
    "date": "2024-01-24T19:17:44.000Z",
    "title": "Which Cryptos Will Take Off in 2024? 7 Promising Altcoins to Watch",
    "url": "https://cryptodaily.co.uk/2024/01/which-cryptos-will-take-off-in-2024-7-promising-altcoins-to-watch",
    "description": "The crypto market is always searching for the next big thing - those hidden gem altcoins that can deliver 10x or even 100x returns"
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-01-24T19:30:29.000Z",
    "title": "Hashkey Capital and FTSE Russell Launch Trio of Indices to Track Diverse Crypto Assets",
    "url": "https://news.bitcoin.com/hashkey-capital-and-ftse-russell-launch-trio-of-indices-to-track-diverse-crypto-assets/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/ftse-custom-digital-asset-infrastructure-index-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Hashkey Capital and FTSE Russell Launch Trio of Indices to Track Diverse Crypto Assets\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/01/ftse-custom-digital-asset-infrastructure-index-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ftse-custom-digital-asset-infrastructure-index-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ftse-custom-digital-asset-infrastructure-index-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ftse-custom-digital-asset-infrastructure-index-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ftse-custom-digital-asset-infrastructure-index-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ftse-custom-digital-asset-infrastructure-index-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2024/01/ftse-custom-digital-asset-infrastructure-index.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Digital asset investment company Hashkey Capital has collaborated with the London Stock Exchange Group (LSEG) subsidiary FTSE Russell to unveil three indices for tracking cryptocurrencies. These indices enable investors and traders to keep an eye on a diverse collection of assets spanning different segments of the digital asset market. Hashkey and FTSE Russell Introduce Comprehensive [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T19:34:20.000Z",
    "title": "KuCoin launches Apple pay integration for crypto debit card",
    "url": "https://www.cryptopolitan.com/kucoin-and-apple-pay-integration-for-crypto/",
    "description": "In a significant development for the cryptocurrency sector, KuCoin, a prominent cryptocurrency exchange, has announced the integration of Apple Pay into its crypto debit card, KuCard. This strategic move aims to augment the safety and privacy of digital transactions, aligning with the growing demand for secure payment methods in the crypto space. Enhanced security with [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T19:26:47.000Z",
    "title": "OKX promises to compensate users affected by its token decline",
    "url": "https://www.cryptopolitan.com/okx-promises-compensate-users-token-decline/",
    "description": "OKB, the native token of cryptocurrency exchange OKX, faced a sudden and drastic drop in value on Tuesday, experiencing a plunge of over 50% to reach a low of $25 in just three minutes before stabilizing. This abrupt movement prompted OKX executives to launch an investigation into the root cause behind the abnormal price fluctuation. [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T19:18:45.000Z",
    "title": "Fintech firm Brex cuts its workforce by 20%",
    "url": "https://www.cryptopolitan.com/fintech-firm-brex-cuts-its-workforce-by-20/",
    "description": "Brex, the fintech startup once valued at $12.3 billion, has recently undergone significant changes, including a workforce reduction of 282 employees, constituting about 20% of its staff. This move comes as part of the company’s efforts to pivot towards a more sustainable and profitable future. The company’s Chief Operating Officer (COO), Michael Tannenbaum, is transitioning [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-24T19:10:49.000Z",
    "title": "Riot Games cuts 350 jobs as it shuts down its publishing arm",
    "url": "https://www.cryptopolitan.com/riot-games-cuts-shuts-down-ipublishing-arm/",
    "description": "Riot Games, a leading game development company known for titles like League of Legends, recently announced a significant restructuring plan involving the layoff of approximately 11% of its workforce, totaling around 530 employees. The decision, revealed by the Tencent-owned company, also encompasses the discontinuation of Riot Forge, its publishing group established five years ago. Riot [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-24T19:17:41.000Z",
    "title": "Alameda gap is still haunting Bitcoin despite ETF approval ",
    "url": "https://crypto.news/alameda-gap-is-still-haunting-bitcoin-despite-etf-approval/",
    "description": "Despite spot Bitcoin ETFs generating over $20 billion in trading volume, the crypto market faces ongoing challenges with liquidity.&#160; The market&#8217;s liquidity, as measured by Bitcoin&#8217;s market depth, indicates that the ease and speed of executing transactions in the digital&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-24T19:30:53.000Z",
    "title": "Bitcoin Repayments: Mt Gox Starts Verifying Addresses For 200,000 BTC In Payouts",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-mt-gox-starts-200000-btc/",
    "description": "Defunct Japanese-based cryptocurrency exchange, Mt. Gox has taken the next steps toward its Bitcoin distribution process to customers who were previously affected by its 2014 hack attack. The crypto exchange has delivered mass emails to account holders as they confirm wallet addresses for individuals eligible for its repayment process.  Mt. Gox Prepares For Bitcoin Repayments Recently, Account holders at Mt. Gox reported in a Reddit post that they have been receiving new emails from the crypto exchange regarding an identity verification and confirmation procedure initiated by the exchange.  Mt. Gox disclosed that it has begun confirming wallet addresses from users who had officially owned accounts at the crypto exchange and had successfully completed their identity verification processes. The crypto exchange also revealed that it would be distributing Bitcoin (BTC) and Bitcoin Cash (BCH) as part of its repayment process to account holders, with the payout ranging from 142,000 BTC to 200,000 BTC.  Related Reading: JP Morgan Reveals Likelihood Of Spot Ethereum ETFs Getting Approved Furthermore, Mt. Gox disclosed that the rehabilitation trustee has shared customer details with the custodian to facilitate the account verification process. The crypto exchange warned that customers with disabled or frozen accounts may not be eligible for the fund distribution program.  In September 2023, Mt. Gox declared an extension of its repayment deadline from October 2023 to October 31, 2024, attributing the decision to the need for further discussions to ensure proper disbursement of funds. During December 2023, the crypto exchange encountered a slight hiccup in its payment distribution process after it announced it had unintentionally issued double payments to specific users.  Following the error, Mt Gox urgently requested these users to return the excess funds, warning of potential legal consequences and the possibility of being excluded from the reimbursement plan scheduled later this year.  This year marks nearly a decade since Mt. Gox suffered a hack attack resulting in the loss of a substantial 850,000 Bitcoin. Recent developments in the repayment process bring hope to former customers of the crypto exchange who were adversely affected by the cyber theft.  BTC price reclaims $40,000 &#124; Source: BTCUSD on Tradingview.com BTC Faces $20,000 Crash If Mt. Gox Customers Commence Bitcoin Sell-Off About 200,000 BTC presently worth over $7.7 billion, is expected to spread through multiple wallet addresses owned by Mt.Gox creditors. This raises concerns about the potential impact this Bitcoin distribution could have on the crypto market.  Related Reading: Is XRP Price At $20 Possible? Crypto Analyst Predicts Stunning Move Presently, Mt. Gox’s 200,000 BTC repayment amount surpasses the total value of Microstrategy and El Salvador’s Bitcoin holdings, which are among the largest in the world.  With Bitcoin currently at $39,909, if Mt.Gox account holders receive their reimbursements and attempt a sell-off to take their profits, which have grown by a substantial 99,900%, the price of Bitcoin may dip below $20,000. This would be a monumental crash for the pioneer cryptocurrency, bringing prices back to half of their present market value.  Featured image from Inside Bitcoins, chart from Tradingview.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-01-24T19:28:48.000Z",
    "title": "Vitruveo Surpasses $1 Million Milestone in NFT Sales, Strengthens Ecosystem With Successful Fundraising",
    "url": "https://dailyhodl.com/2024/01/24/vitruveo-surpasses-1-million-milestone-in-nft-sales-strengthens-ecosystem-with-successful-fundraising/",
    "description": "<img width=\"1024\" height=\"1024\" src=\"https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-Vitruveo-Industry-Announcement-Featured-Image-Template.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-Vitruveo-Industry-Announcement-Featured-Image-Template.jpg 1500w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-Vitruveo-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-Vitruveo-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-Vitruveo-Industry-Announcement-Featured-Image-Template.jpg?resize=768,768 768w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-Vitruveo-Industry-Announcement-Featured-Image-Template.jpg?resize=1024,1024 1024w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-Vitruveo-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-Vitruveo-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-Vitruveo-Industry-Announcement-Featured-Image-Template.jpg?resize=750,750 750w, https://dailyhodl.com/wp-content/uploads/2024/01/UPSCALED-Vitruveo-Industry-Announcement-Featured-Image-Template.jpg?resize=1140,1140 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Tortola, British Virgin Islands Vitruveo, the groundbreaking blockchain platform designed exclusively for creators, proudly announces a significant milestone, having exceeded $1 million in NFT (non-fungible token) sales. The achievement marks a momentous step forward for the ecosystem, which has rapidly gained traction within the creator and Web 3.0 community. This remarkable accomplishment reflects the growing [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/01/24/vitruveo-surpasses-1-million-milestone-in-nft-sales-strengthens-ecosystem-with-successful-fundraising/\">Vitruveo Surpasses $1 Million Milestone in NFT Sales, Strengthens Ecosystem With Successful Fundraising</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]