[
  {
    "source": "Crypto Daily",
    "date": "2023-07-11T10:08:59.000Z",
    "title": "Ethereum Blockchain Game Pikamoon Raises $3.6m, Final ICO Phase Selling Out Fast",
    "url": "https://cryptodaily.co.uk/2023/07/ethereum-blockchain-game-pikamoon-raises-36m-final-ico-phase-selling-out-fast",
    "description": "<p>Dubai, United Arab Emirates, July 11th, 2023, Chainwire</p><p class=\"ql-align-justify\">Pikamoon, an emerging Ethereum blockchain game, has raised $3.6 million in its ongoing ICO to bring more value to the Ethereum ecosystem and revolutionise the blockchain gaming space. Pikamoon would launch the world&rsquo;s most immersive metaverse game and a first-of-its-kind earning model that allows players to withdraw their in-game rewards directly to their wallet or bank account without the need for a third party.</p><p class=\"ql-align-justify\">Pikamoon focuses on becoming the most realistic metaverse game where players can get a 360-degree experience of the growing virtual space through unparalleled gameplay, stunning visuals, and innovative DeFi features. Drawing inspiration from legendary games like Fortnite, Pokemon, and FIFA, the Ethereum game has leaped forward and is prepared to blend NFTs, video gaming, and metaverse entertainment perfectly.</p><p class=\"ql-align-justify\">The Pikamoon game is built on Unity, the world&rsquo;s most advanced game development technology, to create the stunning visuals and architecture needed to give players a truly immersive experience.</p><p class=\"ql-align-justify\">Additionally, Pikamoon is built across two blockchains: Ethereum and MultiversX (formerly Elrond). While Ethereum provides scalability, MultiversX complements it by providing efficiency and ensuring the game is environmentally friendly by reducing carbon emissions generated by transactions. This dual blockchain feature ensures that the Pikamoon ecosystem can cater to legions of gamers without any lag.</p><p class=\"ql-align-justify\"></p><p class=\"ql-align-justify\">Gaming enthusiasts and smart investors are convinced Pikamoon is the future of gaming, and this is evident in how fast phase one and phase two of the ICO sold out. In the first phase, one PIKA sold for $0.0002, which increased to $0.0004 in the second phase, and now in the third and last phase, one PIKA is selling for $0.0006 and selling out faster.</p><p class=\"ql-align-justify\">Notable partners of this Ethereum-based game include future-thinking Web3 brands such as Ethereum, Transak, Cryptonews.com, Kevuru Games, and MultiversX. This line-up of industry leaders further reinforces the credibility of the project, reaffirming the fact that the team is committed to building the best of the best gaming projects.</p><p class=\"ql-align-justify\">Pikamoon offers investors the opportunity to enter what is strategically seen as a huge market of the Metaverse and gaming on the Ethereum blockchain. A core feature of the PIKA token is its deflationary nature. Whenever a sell or transfer transaction occurs in the Pikamoon ecosystem, 0.5% of the tokens involved in the transaction are burned forever, translating into more profits for long-term investors.</p><p class=\"ql-align-justify\">The much-talked-about presale, which is still on, uses Ethereum as its base currency, becoming the new favorite of the Ethereum community. This seamless integration with Ethereum not only simplifies the investment process for eager investors but also strengthens the overall Ethereum ecosystem.</p><p class=\"ql-align-justify\"></p><p class=\"ql-align-justify\">About Pikamoon</p><p class=\"ql-align-justify\">Pikamoon makes metaverse gameplay exciting and rewarding for players of all age groups. The Pikamoon&rsquo;s metaverse, the Pikaverse, offers players endless opportunities to explore, battle, trade, and earn a living within the game. It operates on two blockchains, Ethereum and MultiversX, ensuring smooth and glitch-free gameplay for every player. Similarly, Pikamoon&rsquo;s unique earning model allows players to easily monetize gameplay, solidifying its place as one of the best metaverse games on the market.</p><p class=\"ql-align-justify\">Find out more about Pikamoon (PIKA)</p><p class=\"ql-align-justify\">Website | Where to purchase PIKA | Twitter | Telegram</p>ContactFounderNick EvansPikamooninfo@pikamooncrypto.com"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-11T09:56:39.000Z",
    "title": "Former SEC Chair says Spot Bitcoin ETF should be approved",
    "url": "https://cryptodaily.co.uk/2023/07/former-sec-chair-says-spot-bitcoin-etf-should-be-approved",
    "description": "<p>Jay Clayton, former Head of the SEC, says that there are now no reasons why a Spot Bitcoin ETF should not be approved.</p>\n<p>The ex-chairman of the Securities and Exchange Commission was interviewed on CNBC Squawk Box on Monday and gave his views on the long-running saga of the SEC and Spot Bitcoin ETFs.</p>\n<p>In order to give the whole picture of ETFs for Bitcoin, Clayton started by giving his thoughts on the first Bitcoin ETF filings back in 2015/16, when he believed that things were very different to what they are today. He mused on his thoughts at that time:</p>\n\n<p>&ldquo;This is an offshore, retail, nothing close to what I would say the core of our financial markets. At that time, if you look at trading of bitcoin, the emergence of bitcoin, it looked like stocks, but it was not anything like it.&rdquo;</p>\n\n<p>However, since that time, he admitted that things had changed drastically to the point that blue chip companies such as Blackrock were willing to back it. He commented:</p>\n\n<p>&ldquo;companies whose reputation in the market matters are saying &lsquo;you know what, we think that trading, we think that the custody, we think that those protections around this market are sufficient, that we are willing to put our name on it&rsquo;&rdquo;</p>\n\n<p>In Clayton&rsquo;s view this was an &ldquo;incredible development&rdquo; and not one that he had expected. He had always been &ldquo;sceptical&rdquo; of bitcoin and said that studies had showed &ldquo;90% wash trading, manipulation&rdquo; and people &ldquo;dumping&rdquo;.</p>\n<p>However, for him, what had really changed was when companies that &ldquo;know the markets better than anybody&rdquo; had moved into the space and had said that they are &ldquo;willing to put their reputation behind it&rdquo;.</p>\n<p>On being asked if he thought that a Spot ETF should now be approved, Clayton said that when a Futures ETF had been approved, the protections for the investor had been in place, but this hadn&rsquo;t been the case for a Spot ETF. Now though, he says that institutions have been arguing that the protections for a Spot ETF are there, and that it is actually &ldquo;more efficient and less drag&rdquo; for the investor than the Futures ETF.</p>\n<p>When pressed on when he thought a Spot ETF might be approved, Clayton said that it would need to go through the regulatory process but if it was proved to have &ldquo;similar efficacy&rdquo; to a Futures ETF then it would be &ldquo;hard to resist approval&rdquo;.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-11T10:00:46.000Z",
    "title": "Standard Chartered Raises Bitcoin Price Forecast — Now Expects BTC to Reach $50,000 This Year, $120,000 Next Year",
    "url": "https://news.bitcoin.com/standard-chartered-raises-bitcoin-price-forecast-now-expects-btc-to-reach-50000-this-year-120000-next-year/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/standard-chartered-120k-bitcoin-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/standard-chartered-120k-bitcoin-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/standard-chartered-120k-bitcoin-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/standard-chartered-120k-bitcoin-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/standard-chartered-120k-bitcoin-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/standard-chartered-120k-bitcoin-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/standard-chartered-120k-bitcoin-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/standard-chartered-120k-bitcoin.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Banking giant Standard Chartered has updated its bitcoin price forecast. The bank&#x2019;s head of crypto research now expects bitcoin to reach $50,000 this year and $120,000 the following year. &#x201C;Increased miner profitability per bitcoin mined means they can sell less while maintaining cash inflows, reducing net BTC supply and pushing BTC prices higher,&#x201D; the analyst [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T10:09:18.000Z",
    "title": "Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?",
    "url": "https://www.cryptopolitan.com/litecoin-price-prediction/",
    "description": "Litecoin Price Prediction 2023-2032 How much is LTC worth? As of today, the price of Litecoin stands at $97.4, accompanied by a 24-hour trading volume of $1.98 billion. Its market capitalization amounts to $7.16 billion, with a market dominance of 0.60%. Over the past 24 hours, the price of LTC has experienced a 3.8% increase. ... <a title=\"Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/litecoin-price-prediction/\" aria-label=\"More on Litecoin Price Prediction 2023-2032: Will LTC Price skyrocket?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T10:05:11.000Z",
    "title": "Ethereum Blockchain Game Pikamoon Raises $3.6m, Final ICO Phase Selling Out Fast",
    "url": "https://www.cryptopolitan.com/ethereum-blockchain-game-pikamoon-raises-3-6m-final-ico-phase-selling-out-fast/",
    "description": "Dubai, United Arab Emirates, July 11th, 2023, Chainwire Pikamoon, an emerging Ethereum blockchain game, has raised $3.6 million in its ongoing ICO to bring more value to the Ethereum ecosystem and revolutionise the blockchain gaming space. Pikamoon would launch the world’s most immersive metaverse game and a first-of-its-kind earning model that allows players to withdraw ... <a title=\"Ethereum Blockchain Game Pikamoon Raises $3.6m, Final ICO Phase Selling Out Fast\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethereum-blockchain-game-pikamoon-raises-3-6m-final-ico-phase-selling-out-fast/\" aria-label=\"More on Ethereum Blockchain Game Pikamoon Raises $3.6m, Final ICO Phase Selling Out Fast\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T10:00:21.000Z",
    "title": "Cosmos teams gather in Paris as Interchain ecosystem faces pivotal year",
    "url": "https://www.cryptopolitan.com/cosmos-teams-gather-in-paris-as-interchain-ecosystem-faces-pivotal-year/",
    "description": "Paris, France, July 11th, 2023, Chainwire Nebular Summit, Europe’s premiere Interchain builders conference, returns to Paris, France, July 24th and 25th, 2023. Key thought leaders, founders, engineers, and investors will unveil the latest innovations within the Interchain developer community and discuss divisive issues crucial to the ecosystem’s long-term success.  “Teams have fortified the Cosmos stack ... <a title=\"Cosmos teams gather in Paris as Interchain ecosystem faces pivotal year\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cosmos-teams-gather-in-paris-as-interchain-ecosystem-faces-pivotal-year/\" aria-label=\"More on Cosmos teams gather in Paris as Interchain ecosystem faces pivotal year\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-11T09:56:06.000Z",
    "title": "FCA takes down illegal crypto ATMs in the UK, issues strong warning",
    "url": "https://www.cryptopolitan.com/fca-takes-down-illegal-crypto-atms-in-the-uk-issues-strong-warning/",
    "description": "The Financial Conduct Authority (FCA), the renowned financial watchdog in the United Kingdom, announced the disruption of 26 out of 34 cryptocurrency ATMs it inspected. Firmly addressing the UK crypto ATM operators on February 14, the FCA issued a stern warning, clarifying that compliance with legislation or facing closure of illicit activities was the only ... <a title=\"FCA takes down illegal crypto ATMs in the UK, issues strong warning\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fca-takes-down-illegal-crypto-atms-in-the-uk-issues-strong-warning/\" aria-label=\"More on FCA takes down illegal crypto ATMs in the UK, issues strong warning\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-11T10:07:22.000Z",
    "title": "Bitcoin sees 3-month high in new addresses following spike to $31,000",
    "url": "https://crypto.news/bitcoin-sees-3-month-high-in-new-addresses-following-spike-to-31000/",
    "description": "Bitcoin (BTC) metrics signal mixed sentiments amid the recent spike to $31,000. Notably, while the number of new addresses on the bitcoin network recently surged to a three-month high, a drop in fees to a four-month low might suggest decreasing&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-11T10:00:42.000Z",
    "title": "Microstrategy Stock Surges 7% As Berenberg Highlights Bitcoin Halving’s Impact",
    "url": "https://www.newsbtc.com/bitcoin-news/microstrategy-stock-surges-as-berenberg-highlights-bitcoin-halvings/",
    "description": "Hamburg-based Berenberg Capital Markets recently highlighted the upcoming Bitcoin halving event as a potential trigger for the bullish case of Microstrategy, a United States-based software firm, in a recent research note. The research note emphasized that Microstrategy, with a bullish price target of $430, primarily derives its value from its substantial holdings of over 150,000 BTC. And Berenberg expects the historical trend of Bitcoin rallying after each halving to repeat. Halving Events And Bitcoin&#8217;s Market Impact Halving events are significant occurrences in the Bitcoin network that happen approximately every four years. During these events, the rate of new coin issuance is reduced by 50%, resulting in a slower influx of new Bitcoins into the market. The upcoming fourth Bitcoin halving, scheduled for April 26, 2024, is expected to follow this pattern. Related Reading: Michael Saylor Doubles Down On Bitcoin, Adds 12,333 BTC To MicroStrategy’s Holdings Berenberg&#8217;s recent research note highlighted the historical trend observed in the previous three halvings and suggested that a pre-halving rally could potentially commence in about four months. If this rally follows a similar trajectory to previous halvings. It could persist until approximately October 2025, according to the research note. Berenberg noted: If the historical pattern established by the first three Bitcoin halvings continues to play out with the fourth halving, then the pre-halving rally would begin about four months from now. If a rally were to occur after the fourth halving, and if it were as long-lived as the rallies that occurred after the past couple of halvings, then it would continue until around October 2025. Correlation Between Bitcoin And Microstrategy&#8217;s Stock According to the research note, there is a strong correlation between Microstrategy&#8217;s stock price and the price of Bitcoin, estimated to be around 0.90. If the fourth bitcoin halving triggers a significant rally in the price of the cryptocurrency, it is likely that Microstrategy&#8217;s stock will follow suit. This forecast is due to the positive outlook for Bitcoin&#8217;s post-halving performance contributing to the anticipation of a potential rally in Microstrategy&#8217;s stock price. Following the release of Berenberg&#8217;s research note, Microstrategy&#8217;s stock, with the ticker symbol MSTR, has already witnessed a notable surge of 7% in the past day. The stock, which was trading below its current price range in the previous month, is now valued at $407. The market&#8217;s positive response reflects the optimism surrounding the potential impact of the upcoming Bitcoin halving event on Microstrategy&#8217;s performance. Furthermore, it is worth noting that the concept of halving has since been associated with significant market movements in the past. And investors closely monitor these events for potential opportunities. Related Reading: MicroStrategy Bought Bitcoin To Avoid Liquidation, Peter Schiff Reveals The reduction in new coin issuance, combined with market demand, has historically contributed to price appreciation in Bitcoin. As such, the anticipation of the upcoming halving has sparked interest and speculation among market participants. Berenberg&#8217;s analysis adds to the narrative that the halving event could have a bullish impact on the price of Bitcoin. And, consequently, on companies like Microstrategy, which holds a substantial amount of Bitcoin on its balance sheet. Featured image from Blockchain Reporter, Chart from TradingView"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-11T10:00:35.000Z",
    "title": "Dogecoin (DOGE) Price Downtrend Set To Persist – What To Expect",
    "url": "https://www.newsbtc.com/news/dogecoin-price-downtrend-set-to-persist/",
    "description": "Dogecoin (DOGE) experienced a substantial surge on the price chart towards the end of June. However, despite this notable increase, it failed to ward off the sellers who swiftly entered the market.  Can Dogecoin regain its momentum and rise again, or will it succumb to the mounting pressure from the bearish sentiment? Bitcoin (BTC) also experienced a downturn in the previous week, and this negative trend had a noticeable impact on the sentiment surrounding Dogecoin. Unfortunately, the figures did not provide a strong basis for a potential recovery in DOGE. Instead, it indicated a looming decline towards the price range of $0.053 and $0.048. DOGE Bearish Indicators Emerge The current DOGE price on CoinGecko stands at $0.0652, experiencing a modest 0.7% rally within the past 24 hours. However, it is important to note that a decline of 5.8% has been recorded over the course of the past seven days. Source: Coingecko This price movement has prompted a closer examination of the market conditions, revealing some bearish signals and underlying trends. Related Reading: Cardano Price Momentum Bid Fizzles Out Despite New Payment Feature Based on a DOGE price report, it appears that bears are preparing to exert downward pressure on prices once again. The Relative Strength Index (RSI) has slipped below the neutral 50 level, indicating a shift in momentum towards the bearish side, suggesting that selling pressure may increase in the near future. DOGE market cap back at $9 billion. Chart: TradingView.com Additionally, the On-Balance Volume (OBV) has been unable to surpass a resistance level since May, reflecting a lack of interest from buyers. This suggests that market participants may be hesitant to make significant purchases, contributing to the downward pressure on DOGE prices. Related Reading: PEPE Potential Rebound: Key Details You Shouldn’t Miss Although some buyers noticed the recent short-term rally and made purchases as prices slowly edged higher, it is worth noting that this rally pales in comparison to the significant surge the meme coin experienced in early April, when Dogecoin reached the $0.1 level. DOGE seven-day price action. Source: Coingecko. This discrepancy, referring to the difference between the current rally and previous ones, implies that the present market upswing may be lacking an equivalent degree of enthusiasm and support from buyers. This observation raises questions about the sustainability and strength of the crypto. Outlook For DOGE The bearish signals observed, such as the RSI dropping below the neutral 50 level and the lack of conviction from buyers indicated by the OBV, suggest a challenging road ahead for DOGE. These factors may contribute to increased selling pressure and further price declines. Considering the current market conditions, it is important to approach the outlook for DOGE with caution. The short-term rally, although relatively subdued compared to past performances, could still offer opportunities for traders looking for quick gains. However, it is vital to remain vigilant and closely monitor the market dynamics. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from iStock"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-11T10:03:52.000Z",
    "title": "Liquidity Boost for Polkadot: HydraDX Launches Hydrated Farms and Welcomes ASTAR and CFG",
    "url": "https://www.crypto-news-flash.com/liquidity-boost-for-polkadot-hydradx-launches-hydrated-farms-and-welcomes-astar-and-cfg/?utm_source=rss&utm_medium=rss&utm_campaign=liquidity-boost-for-polkadot-hydradx-launches-hydrated-farms-and-welcomes-astar-and-cfg",
    "description": "<img width=\"2560\" height=\"1440\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/12/AdobeStock_389442371-scaled.jpeg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"HydraDX integration in Polkadot\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/12/AdobeStock_389442371-scaled.jpeg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2020/12/AdobeStock_389442371-300x169.jpeg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/12/AdobeStock_389442371-1024x576.jpeg 1024w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />Through the implementation of Dollar Cost Averaging (DCA), users can judiciously distribute their trades over time. HydraDX successfully listed two major projects on the Polkadot network, namely ASTAR and CFG. In an announcement on its Twitter account, Polkadot unveiled the launch of HydraDX DCA. The integration of HydraDX DCA facilitates an exceptional tool catering to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-11T10:00:27.000Z",
    "title": "Cosmos teams gather in Paris as Interchain ecosystem faces pivotal year",
    "url": "https://www.crypto-news-flash.com/cosmos-teams-gather-in-paris-as-interchain-ecosystem-faces-pivotal-year/?utm_source=rss&utm_medium=rss&utm_campaign=cosmos-teams-gather-in-paris-as-interchain-ecosystem-faces-pivotal-year",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Youtube_1_1689007330bIdFFy43Q2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Youtube_1_1689007330bIdFFy43Q2.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Youtube_1_1689007330bIdFFy43Q2-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Youtube_1_1689007330bIdFFy43Q2-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/Youtube_1_1689007330bIdFFy43Q2-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />Paris, France, July 11th, 2023, Chainwire Nebular Summit, Europe’s premiere Interchain builders conference, returns to Paris, France, July 24th and 25th, 2023. Key thought leaders, founders, engineers, and investors will unveil the latest innovations within the Interchain developer community and discuss divisive issues crucial to the ecosystem’s long-term success.  “Teams have fortified the Cosmos stack [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-11T09:44:09.000Z",
    "title": "How Would I Invest $1,000 in Crypto in 2023?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-would-i-invest-1000-in-crypto-in-2023/",
    "description": "<p>Today I am going to show you my list of 5 altcoins in which I would invest $1000 at the moment. Why and which crypto coins are these? Let&#8217;s find out. 1) Arbitrum ($ARB) – $250 Arbitrum is a Layer 2 scaling solution. It is designed to enhance the speed, efficiency, and overall performance of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/how-would-i-invest-1000-in-crypto-in-2023/\">How Would I Invest $1,000 in Crypto in 2023?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]