[
  {
    "source": "Decrypt",
    "date": "2024-03-22T18:59:36.000Z",
    "title": "Cathie Wood’s ARK Invest Unloads Another $52M in Coinbase Stock",
    "url": "https://decrypt.co/223006/ark-invest-cathie-wood-coinbase-stock-sale",
    "description": "For the second time this month, three ETFs sold COIN, even as the stock has been on a roll."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-22T19:04:09.000Z",
    "title": " Final Fantasy 15 director says AI, VR, and web3 important for devs ‘whether you like it or not’ ",
    "url": "https://cointelegraph.com/news/final-fantasy-15-director-artificial-intelligence-ai-virtual-reality-vr-web3-future-gaming",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvMjA4NzE4M2MtNzYwOS00MTU5LWFiZTctZDIwM2Q1N2ZiMDc1LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The director’s commentary comes amid an organizational restructuring by Square Enix to support blockchain, web3 and AI.</p>\n                    <p><p>Developers should embrace future-facing technologies such as artificial intelligence (AI), virtual reality (VR), and web3 if they want to stay relevant in the changing gaming industry, says “Final Fantasy 15” director Hajime Tabata.</p><p>Tabata’s comments came during a seminar held by Human Academy featuring former Square Enix president Yoichi Wada and Tabata, who is now the CEO of JP Games. </p><p>According to a Google translation of a report from Japanese new source 4Gamer, the two gaming industry luminaries <a href=\"https://www.4gamer.net/games/999/G999905/20240131047/screenshot.html?num=002\" target=\"_blank\" rel=\"noopener nofollow\">discussed</a> the future of gaming with topics ranging from \"what is required of creators now\" to “these people are not suitable for creators\".</p><p><a href=\"https://cointelegraph.com/news/final-fantasy-15-director-artificial-intelligence-ai-virtual-reality-vr-web3-future-gaming\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-22T19:04:55.000Z",
    "title": "Animoca-backed OPEN launches on-chain ticketing ecosystem",
    "url": "https://cryptobriefing.com/open-coalition-ticketing-blockchain-disruption/",
    "description": "Backed by major Web3 players, the newly launched OPEN Ticketing Ecosystem provides on-chain ticketing infrastructure."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-22T18:49:18.000Z",
    "title": "Google Developing AI to Monitor Physical Health Through Sound",
    "url": "https://www.cryptopolitan.com/google-developing-ai/",
    "description": "In recent developments, Google has initiated research on a potentially groundbreaking artificial intelligence (AI) system to monitor physical health through sound analysis. This project, named Health Acoustic Representations (HeAR), has garnered attention for its ambitious goal of detecting and monitoring individuals&#8217; health conditions by analyzing sound data. Google&#8217;s innovative approach to health monitoring Google&#8217;s scientists [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-03-22T18:48:04.000Z",
    "title": "Gary Gensler criticizes crypto platforms for avoiding SEC regulations",
    "url": "https://www.cryptopolitan.com/gary-gensler-criticizes-crypto-platforms-for-avoiding-sec-regulations/",
    "description": "Gary Gensler, the Chairman of the U.S. Securities and Exchange Commission (SEC), addressed the compliance challenges within the cryptocurrency industry during a speech at Columbia Law School on Friday. During the speech, Gensler emphasized that certain participants in the crypto securities market are attempting to circumvent the SEC&#8217;s established disclosure regime. This regime mandates the [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-22T18:52:34.000Z",
    "title": "Solana and Toncoin Boom, Rebel Satoshi leads crypto charge",
    "url": "https://crypto.news/solana-and-toncoin-boom-rebel-satoshi-leads-crypto-charge/",
    "description": "Solana (SOL) and Toncoin (TON) draw attention for market performance. Rebel Satoshi (RBLZ) gains traction with promising potential. Explore the best crypto options for 2024. #partnercontent"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-22T19:00:38.000Z",
    "title": "FXS Price Poised For Uptrend As Frax Finance Unveils Roadmap To Reach $100B TVL",
    "url": "https://www.newsbtc.com/news/fxs-price-poised-for-uptrend-as-frax-finance-unveils-roadmap-to-reach-100b-tvl/",
    "description": "Frax Finance, a decentralized finance (DeFi) protocol, recently unveiled its Singularity Roadmap. It aims to propel the total value locked (TVL) of its layer 2 blockchain, Fraxtal, to $100 billion by the end of 2026. This notable surge would represent a 760,000% increase from the current TVL levels, which stand at $13 million.  Frax Finance Singularity Roadmap According to the protocol’s announcement, Fraxtal, the substrate that powers the Frax ecosystem, serves as Frax Finance&#8217;s operating system. With the launch of Fraxtal and achieving an effective 100% Collateralization Ratio (CR), Frax Finance claims to have consolidated its core product offerings.  Related Reading: Bitcoin Spot ETFs See 4 Consecutive Days Of Outflows, Here’s What Happened Last Time To reach the ambitious $100 billion TVL goal, the protocol has announced that it has already generated over $45 million, reaching the coveted 100% CR.  As announced, with this milestone achieved, the FRAX stablecoin, which has remained relatively dormant during the process, and the FXS revenue share, which has been temporarily reduced by 90% to conserve assets, can now undergo a &#8220;transformative change.&#8221;  In addition, the upcoming introduction of Layer 3s (L3s) on Fraxtal is expected to be a key factor in further contributing to the growth and adoption of the protocol. Fraxtal, which is built on the Optimism (OP) network, stands out as one of the most widely used layer 2 solutions on top of Ethereum (ETH), according to the protocol. The Frax team says it has developed its underlying incentives to provide a seamless experience for developers and users, further encouraging adoption.  In particular, by owning the entire stack, Frax can introduce advanced features such as account abstraction, new precompiles, privacy features, aggregated decentralized applications (dApps), and interoperability with Superchain.  The protocol believes these features will enhance the on-chain experience, making Fraxtal the “preferred” platform for holding, staking, and transferring crypto assets. Expansion Strategy The proposal also unveils Frax Finance&#8217;s plan to establish 23 Layer 3s within 365 days, kicking off the &#8220;Fraxtal Nation&#8221; community. By supporting these 23 chains with developer access, incentives, and investment, Frax aims to foster a positive-sum approach and provide additional support to official partners.  The protocol also suggests that these partners will receive &#8220;substantial allocations&#8221; of FXTL points, aiming to solidify the role of the FXS token as the ultimate beneficiary of the Frax ecosystem. Moreover, Frax Finance founder Sam Kazemian intends to allocate 50% of the revenue from protocol fees to veFXS token holders. In comparison, the remaining 50% will be used to acquire FXS and other Frax assets for pairing in the FXS Liquidity Engine (FLE). This initiative will increase liquidity, strengthen the Frax balance sheet, and provide additional incentives for the protocol&#8217;s stakeholders. Related Reading: Stablecoins Steal The Spotlight: $150 Billion Market Cap, $122 Billion Daily Trades Frax Finance&#8217;s proposal also seeks to reactivate the protocol fee switch, which was temporarily turned off during the consolidation phase of the protocol.  By reigniting this switch, a portion of the yield generated from protocol fees will be directed toward veFXS token holders. veFXS, or veiled FXS, represents a locked version of the native token, FXS, and offers enhanced voting power and participation in the Frax ecosystem. As of the time of writing, FXS has not responded favorably to the news. Its current trading price is $6.93, reflecting a 3.5% loss in the past 24 hours. It is important to note that the proposed protocol features are still in development, and the impact on the Frax Finance ecosystem and the token&#8217;s performance is yet to be determined. Featured image from Shutterstock, chart from TradingView.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2024-03-22T18:45:56.000Z",
    "title": "Telegram Game on Brand-New Ethereum Layer-2 Scaler Blast Exploited for $4,600,000 in Reported White Hat Hack",
    "url": "https://dailyhodl.com/2024/03/22/brand-new-ethereum-layer-2-scaler-blast-exploited-for-4600000-in-reported-white-hat-hack/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2024/03/ethereum-layer-white-hat.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2024/03/ethereum-layer-white-hat.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2024/03/ethereum-layer-white-hat.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2024/03/ethereum-layer-white-hat.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2024/03/ethereum-layer-white-hat.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2024/03/ethereum-layer-white-hat.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2024/03/ethereum-layer-white-hat.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An unknown entity has exploited a Telegram-based game that runs on the newly launched Ethereum (ETH) layer-2 scaling solution Blast Network. In a post on social media platform X, the team behind the game Super Sushi Samurai (SSS) says token transfers are paused after an attacker exploited a vulnerability that allows exploiters to double their [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2024/03/22/brand-new-ethereum-layer-2-scaler-blast-exploited-for-4600000-in-reported-white-hat-hack/\">Telegram Game on Brand-New Ethereum Layer-2 Scaler Blast Exploited for $4,600,000 in Reported White Hat Hack</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]