[
  {
    "source": "CoinDesk",
    "date": "2023-07-27T11:42:28.000Z",
    "title": "Trader Redeems $12.3M of Rocketpool's Staked Ether to Mark Largest Daily Burn",
    "url": "https://www.coindesk.com/business/2023/07/27/trader-redeems-123m-of-rocketpools-staked-ether-to-mark-largest-daily-burn/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Rocket Pool, a decentralized Ethereum-based staking service, experienced its largest daily redemption of its rocketpool ether (rETH) token this week, with one trader redeeming $12.3 million worth of the token before sending it to Binance."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-27T12:01:02.000Z",
    "title": "Tokenization Firm Securitize Kicks Off European Campaign in Spain",
    "url": "https://decrypt.co/150295/tokenization-firm-securitize-kicks-off-european-campaign-spain",
    "description": "Already established in the U.S., Securitize is now set to issue its first tokenized security in the European Union."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-27T12:00:00.000Z",
    "title": "Securitize issues tokenized assets in Spain, plans September trading start",
    "url": "https://cointelegraph.com/news/securitize-issues-tokenized-assets-in-spain-plans-september-trading-start",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/984a9e56-4aaf-4599-bb9c-570bbf446ecb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The U.S.-based trading platform is set to become the first to issue and trade tokenized assets in both the U.S. and the EU, and will operate under the new DLT pilot regime.</p>\n                    <p><p>Digital asset trading platform Securitize has begun tokenizing equity in the Spanish real estate investment trust Mancipi Partners, it announced on June 27. The firm expects to launch secondary trading on the Avalanche blockchain in September. </p><p>Securitize plans to carry out the first natively tokenized equity issuance under the European Union’s pilot regime for distributed ledger technology supervised by the European Securities Market Authority. The pilot regime <a href=\"https://cointelegraph.com/news/is-security-tokenization-the-amazon-moment-for-blockchain-technology\">was introduced in March</a>.</p><p>The company will undergo a six-month sandbox period under the supervision of Spain’s National Securities Market Commission, known by its Spanish acronym CNMV. In addition, it must receive regulatory approval under the pilot regime to allow it to issue, manage and trade tokenized securities in Spain and throughout the EU.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/private-equity-tokens-aim-to-bring-greater-liquidity-transparency-and-accessibility\">Private equity tokens aim to bring greater liquidity, transparency and accessibility</a></em></strong></p><p>Securitize is already registered with the United States Securities and Exchange Commission as a stock transfer agent and alternative trading system, and is a member of the Financial Industry Regulatory Authority. Securitize CEO Carlos Domingo said in a statement:</p><blockquote>“Securitize is now the first firm to be able to issue and trade tokenized securities in both the U.S. and Europe.”</blockquote><p>Securitize partnered with asset manager KKR to tokenize an interest in its Health Care Strategic Growth Fund II in September 2022. It <a href=\"https://securitize.io/press-releases/sbi-partnership\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> a partnership with SBI Digital Markets, a Singapore-based subsidiary of Japan’s SBI Digital Asset Holdings, in October 2022, shortly after <a href=\"https://cointelegraph.com/news/singapore-s-financial-authority-grants-license-to-sbi-s-digital-asset-arm\">SBI Digital Markets was granted</a> a license by the Monetary Authority of Singapore.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Though most value is created in private capital markets, they remain notoriously impenetrable, illiquid and inefficient. At Securitize, we’re making <a href=\"https://twitter.com/hashtag/privatemarkets?src=hash&amp;ref_src=twsrc%5Etfw\">#privatemarkets</a> more accessible, and securities more productive.<br><br>Listen to <a href=\"https://twitter.com/carlosdomingo?ref_src=twsrc%5Etfw\">@carlosdomingo</a>&#39;s full interview with <a href=\"https://twitter.com/fintechfrank?ref_src=twsrc%5Etfw\">@fintechfrank</a> for… <a href=\"https://t.co/DquglSYFuw\">pic.twitter.com/DquglSYFuw</a></p>&mdash; Securitize (@Securitize) <a href=\"https://twitter.com/Securitize/status/1682538338266259456?ref_src=twsrc%5Etfw\">July 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Tokenization makes private equity investment more accessible to retail investors and improves liquidity by making the tokenized assets tradable on secondary markets. It also benefits businesses. </p><p>“European businesses will be a major beneficiary of this innovation, giving businesses a new way to raise capital through primary capital raises, and obtain potential tax benefits and liquidity through secondary trading,” Domingo said.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/securitize-issues-tokenized-assets-in-spain-plans-september-trading-start&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/block-by-block-blockchain-technology-transforming-real-estate-market/\">Block by block: Blockchain technology is transforming the real estate market</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-27T11:41:32.000Z",
    "title": "Polygon, Cetif Team Up with Bank of Italy to Explore Tokenized Assets",
    "url": "https://cryptobriefing.com/bank-of-italy-to-explore-tokenized-assets/?utm_source=feed&utm_medium=rss",
    "description": "Milano Hub, the Bank of Italys Innovation Centre, has teamed up with Cetif Advisory and Polygon Labs on a project called Institutional DeFi for Security Token Ecosystem to explore opportunities..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-27T11:55:00.000Z",
    "title": "RFK Jr. Confirms $BTC Purchase",
    "url": "https://cryptodaily.co.uk/2023/07/rfk-jr-confirms-btc-purchase",
    "description": "<p>Democratic presidential candidate Robert F. Kennedy Jr. confirmed his recent purchase of a significant amount of Bitcoin earlier this year.</p>\nPutting His Money Where His Mouth Is\n<p>Kennedy had been previously criticized for publicly endorsing BTC at the Bitcoin Miami Conference in May. During a Twitter Space session on July 26, he revealed that he is not promoting an idea he does not believe in, as he has purchased 2 BTCs for each of his seven children. This disclosure marks the first time Kennedy has acknowledged owning cryptocurrency and aligns with his stance on promoting Bitcoin's potential benefits.&nbsp;</p>\n<p>In the interview, Kennedy reiterated his support for backing the U.S. dollar with Bitcoin and exempting the asset from capital gains taxes if he becomes President. He believes that Bitcoin can drive innovation in America.&nbsp;</p>\n<p>However, he emphasized that capital gains exemptions on Bitcoin conversions should be limited to smaller investors and businesses, avoiding windfalls for large corporations like BlackRock and Goldman Sachs.</p>\nBuying BTC In Response To Criticism&nbsp;\n<p>The decision to invest in Bitcoin came as a response to critics who accused him of promoting a \"volatile commodity\" without having any personal stake in it.&nbsp;</p>\n<p>Kennedy explained his reasoning, saying,&nbsp;</p>\n\n<p>\"Right after that Bitcoin conference I got a big check and I said, okay, you know, I'm going to put my money where my mouth is and so I bought two Bitcoin for every one of my seven children&hellip;Now I&rsquo;m a Bitcoin owner, and I&rsquo;m sure they&rsquo;ll now find a different way to come at me, but no one can say I didn&rsquo;t put my money where my mouth is.\"</p>\n\n<p>Kennedy has six biological children, four sons and two daughters, aged 22 to 38. His seventh child is likely from his marriage to actress Cheryl Hines, who had one daughter prior to their marriage in 2014.</p>\nPreviously Denied Holding BTC\n<p>During his speech at the conference in May, Kennedy denied any personal investment in cryptocurrency, stating that he was not an investor and not offering investment advice. However, a leaked financial disclosure later revealed that he held \"between $100,001 and $250,000\" worth of Bitcoin at the end of June.</p>\n<p>Based on available information, if Kennedy bought a total of 14 Bitcoin at an approximate price of $26,800 shortly after the conference, his holdings by the end of June would have exceeded $380,000. As of the time of publication, Bitcoin's price stands at $29,327, indicating that Kennedy's investment is currently worth around $410,000.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T12:00:50.000Z",
    "title": "Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?",
    "url": "https://www.cryptopolitan.com/shiba-inu-price-prediction/",
    "description": "Shiba Inu Price Prediction 2023-2032 Let&#8217;s walk through Shiba Inu&#8217;s tracks through time to help decide whether SHIB is an excellent addition to your crypto portfolio. Let&#8217;s see what Elon Musk will do to help push the meme coin. After our walkthrough of the Shiba Inu price predictions, we will hopefully be more aware of ... <a title=\"Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/shiba-inu-price-prediction/\" aria-label=\"More on Shiba Inu Coin Price Prediction 2023-2032: Is SHIB Skyrocketing Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T11:58:40.000Z",
    "title": "Crypto platforms in South Korea called to bolster compliance capacity",
    "url": "https://www.cryptopolitan.com/crypto-platforms-in-south-korea-called-to-bolster-compliance-capacity/",
    "description": "South Korean authorities have stepped up their efforts to combat crypto-related crime. Without specific laws addressing these challenges, the government has taken proactive measures to assist virtual asset service providers in complying with regulations and curb criminality in the crypto space. The Financial Services Commission&#8217;s recent statement revealed that the Korea Financial Intelligence Unit (KoFIU), ... <a title=\"Crypto platforms in South Korea called to bolster compliance capacity\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-platforms-in-south-korea-called-to-bolster-compliance-capacity/\" aria-label=\"More on Crypto platforms in South Korea called to bolster compliance capacity\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T11:52:39.000Z",
    "title": "SEC Targets AI, Proposes Rules to Protect Investors",
    "url": "https://www.cryptopolitan.com/sec-targets-ai-proposes-rules-investors/",
    "description": "The US Securities and Exchange Commission (SEC) is on the verge of overhauling its regulatory framework, focusing on predictive data analytics and similar technologies. The two recently published proposals aim to safeguard investors&#8217; interests and prevent conflicts of interest arising due to the increased use of these technologies by broker-dealers and investment advisers. SEC&#8217;s regulation ... <a title=\"SEC Targets AI, Proposes Rules to Protect Investors\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sec-targets-ai-proposes-rules-investors/\" aria-label=\"More on SEC Targets AI, Proposes Rules to Protect Investors\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T11:42:03.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-27T12:00:49.000Z",
    "title": "Short-Lived Hype: Worldcoin (WLD) Signups Dwindle Less Than A Week After Launch",
    "url": "https://www.newsbtc.com/altcoin/worldcoin-wld-signups-dwindle/",
    "description": "Newly-launched project Worldcoin has failed to achieve significant progress as signups for the platform’s ‘Digital ID’ continues to dwindle since launching on July 24.  What Is Wrong With Worldcoin? Controversies surrounding the project and reservations like privacy concerns have brought about skepticism and reluctance to sign up on the platform. As part of the sign-up process, users must scan their iris using “The Orb,” available at designated locations worldwide. Once the user is verified as human, they receive the “World ID” alongside 25 WLD, the project’s native token, worth roughly $60.  Related Reading: Singaporean Judge Declares Crypto Is Personal Property In ByBit Case Many have questioned how safe it is to use “The Orb” and how the project will handle such sensitive data, with prominent figures like Twitter’s former CEO Jack and Ethereum’s co-founder Vitalik Buterin expressing their concerns.  Stark Difference Between Pre-Launch And Post-Launch Figures Worldcoin saw an impressive 2 million sign-ups before the project’s launch. However, there seems to be a stark difference between the pre-launch and post-launch numbers. Hong Kong was one of the cities with the most number of sign-ups. The South China Morning Post reported that the three designated locations in Hong Kong saw a combined total of about 600 sign-ups on the first day.  According to the report, Heather Huang, an operator of one of the Orbs in the city, asserted that the 600 sign-ups accounted for almost half of the total Worldcoin sign-ups on launch day. If 600 sign-ups represent half of the total sign-ups on the first day, that will invariably mean only about 1,200 people signed up on launch day &#8211; a not-so-impressive figure compared to how many Worldcoin claims signed up pre-launch. WLD trails $2.2 as skepticism mounts &#124; Source: WLDUSD on TradingView.com Worldcoin’s Co-Founder Reacts In what may be a direct response to the alleged dwindling signups, Worldcoin’s co-founder and Open AI CEO Sam Altman tweeted a video of many users queuing to sign up at what looks like one of the designated locations of “The Orb.”  He posted the video with the caption: Day 3 of @worldcoin launch, crazy lines around the world. one person getting verified every 8 seconds now Many Twitter users were quick to react to the video, with some going as far as to suggest that users who were signing up were simply doing it for the money (the 25 WLD tokens users receive upon sign-up) without being aware of the repercussions. Related Reading: LayerZero Crosses This Significant Milestone, But Is An Airdrop Coming? A particular user (@_whitneywebb) tweeted: “One person is willing to sell their soul every 8 seconds for a shitcoin and a cattle tag. Extreme clown world alert.” Amid the mounting skepticism, WLD’s price has declined 6% to trade at $2.22 at the time of this writing, Coinmarketcap data shows. Featured image from Analytics Insight, chart from TradingView.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-27T11:58:09.000Z",
    "title": "Is Arbitrum Promise Fading? Downtime, Metrics Decline Raise ARB Price Alarms",
    "url": "https://www.newsbtc.com/news/is-arbitrum-promise-fading-downtime-metrics-decline-raise-arb-price-alarms/",
    "description": "Arbitrum (ARB), a Layer-2 scaling solution for Ethereum, has been on an eventful journey, with its promise of enhanced scalability and efficiency facing continuous scrutiny. Recent downtime incidents and declining metrics have raised concerns among investors and users, challenging the network&#8217;s resilience. This kind of downtime raises concerns about the network&#8217;s stability and the potential impact on users and DeFi protocols running on the platform. Traders and investors, already cautious about the rapidly evolving cryptocurrency landscape, may need more time to engage with a network facing repeated disruptions. Related Reading: Dogecoin Ascendance: How It Captured PEPE Investors’ Attention ARB Incident Raises Eyebrows A notable incident was reported via Twitter, where Arbitrum seemingly experienced a block production halt for approximately 15 minutes. The information surfaced through the Arbitrum scanner, but the exact cause of the disruption remained unclear. It was uncertain whether the issue originated from the scanner itself or if the network had indeed stopped producing blocks during that time.  looks like Arbitrum was down for ~15min a little bit ago? or arbiscan rugging again idk pic.twitter.com/h1evcO6wIP — Spreek (@spreekaway) July 25, 2023 This occurrence was not an isolated event for Arbitrum, as it had previously faced outages, including one in January that prompted a public statement from Offchain Labs, the team behind the development of Arbitrum. Challenges In Metrics And TVL In addition to the downtime concerns, Arbitrum has been experiencing declining metrics and a recent slump in its token price. As per CoinGecko, the cost of ARB stood at $1.20, with a 24-hour rally of 2.8%. However, over the last seven days, the token declined 8.1%, reflecting the uncertainty and hesitancy among investors following the downtime incidents. Source: Coingecko Another crucial metric, the Total Value Locked (TVL) on Arbitrum, experienced a slight decline over the past few weeks. While it managed to stay above the significant threshold of $2 billion, the overall value has decreased. At the time of writing, the TVL was approximately $2.10 billion, which indicates that some users may have withdrawn their assets from the platform or opted for other alternatives amidst the recent concerns. As of today, the market cap of cryptocurrencies stood at $1.1 trillion. Chart: TradingView.com Insights And Future Outlook Arbitrum&#8217;s journey has been a roller-coaster ride, with ups and downs testing its capabilities and investor confidence. The recent downtime incidents highlight the challenges faced by layer 2 solutions as they work towards improving Ethereum&#8217;s scalability and user experience. Related Reading: Polygon Warning Signs Point To Slide In MATIC Price On Support Breakdown Moving forward, the team at Offchain Labs and the broader community have promised to address these concerns head-on. Moreover, continuous efforts to improve the platform&#8217;s stability, security, and performance will be paramount to ensure that Arbitrum can fulfill its promise of being a reliable and scalable solution for Ethereum. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from ZebPay"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-27T11:57:41.000Z",
    "title": "BlackRock’s Bold Recommendation: Optimal BTC Allocation At 84.9% – Potential For Bitcoin To Surpass Total Value Of Equities, Real Estate, And Bonds Combined By Over 5x",
    "url": "https://www.crypto-news-flash.com/blackrocks-bold-recommendation-optimal-btc-allocation-at-84-9-potential-for-bitcoin-to-surpass-total-value-of-equities-real-estate-and-bonds-combined-by-over-5x/?utm_source=rss&utm_medium=rss&utm_campaign=blackrocks-bold-recommendation-optimal-btc-allocation-at-84-9-potential-for-bitcoin-to-surpass-total-value-of-equities-real-estate-and-bonds-combined-by-over-5x",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BLACKROCK-BITCOIN-BTC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BLACKROCK-BITCOIN-BTC.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/BLACKROCK-BITCOIN-BTC-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />BlackRock, the world&#8217;s largest asset manager, suggests an 84.9% optimal Bitcoin allocation, potentially driving its value to over 5x the combined worth of equities, real estate, and bonds. Despite Bitcoin&#8217;s volatility, BlackRock emphasizes its positive skewness, making it a prominent component in portfolios due to its utility function dominance. Economic analysts are focusing on BlackRock&#8217;s [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-27T11:43:45.000Z",
    "title": "Stellar, Ripple, and Solana-Based Investment Funds Experience Surge in AUM during July – Will XLM, XRP and SOL Prices Continue to Lead?",
    "url": "https://www.crypto-news-flash.com/stellar-ripple-and-solana-based-investment-funds-experience-surge-in-aum-during-july-will-xlm-xrp-and-sol-prices-continue-to-lead/?utm_source=rss&utm_medium=rss&utm_campaign=stellar-ripple-and-solana-based-investment-funds-experience-surge-in-aum-during-july-will-xlm-xrp-and-sol-prices-continue-to-lead",
    "description": "<img width=\"800\" height=\"480\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1.jpg 800w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2022/08/ripple-xrp-1-800x480-1-48x29.jpg 48w\" sizes=\"(max-width: 800px) 100vw, 800px\" />Post Ripple&#8217;s XRP court ruling, investment funds offering altcoins garnered a lot of attention in the last ten days of July. Grayscale&#8217;s Stellar Lumens Trust (XLM) saw its premium to net asset value surge to 330%. XRP and SOL-based investment products saw their AUM jumping by 30% and 50% respectively. The altcoin space clearly dominated [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-27T11:44:41.000Z",
    "title": "Hardest Concepts in Blockchain’s Industry – Part 1",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/hardest-concepts-in-blockchain-industry-part-1/",
    "description": "<p>As newcomers and even seasoned professionals delve into the blockchain ecosystem. They often encounter mind-boggling concepts that challenge their understanding. In this article, we explore the ten hardest concepts to grasp in the blockchain industry. Decentralization At the core of blockchain lies the concept of decentralization. Unlike traditional centralized systems governed by a single entity, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/hardest-concepts-in-blockchain-industry-part-1/\">Hardest Concepts in Blockchain&#8217;s Industry &#8211; Part 1</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-27T11:45:36.000Z",
    "title": "Bitcoin Still in a Bull Cycle Despite Correction, According to Quant Analyst – But There’s a Catch",
    "url": "https://dailyhodl.com/2023/07/27/bitcoin-still-in-a-bull-cycle-despite-correction-according-to-quant-analyst-but-theres-a-catch/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Still-Bull-Cycle.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Still-Bull-Cycle.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Still-Bull-Cycle.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Still-Bull-Cycle.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Still-Bull-Cycle.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Still-Bull-Cycle.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/Bitcoin-Still-Bull-Cycle.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>The co-founder and CEO of analytics platform CryptoQuant, Ki Young Ju, is analyzing Bitcoin (BTC) as the flagship crypto asset hovers nearly 10% below the 2023 high. Ki Young Ju says that Bitcoin is still in a bull cycle due to the low selling pressure being witnessed as a result of the majority of the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/27/bitcoin-still-in-a-bull-cycle-despite-correction-according-to-quant-analyst-but-theres-a-catch/\">Bitcoin Still in a Bull Cycle Despite Correction, According to Quant Analyst – But There’s a Catch</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]