[
  {
    "source": "CoinDesk",
    "date": "2024-03-14T16:00:00.000Z",
    "title": "Crypto Custody Firm Cordial Systems Names Jump Crypto as Client as It Exits Stealth",
    "url": "https://www.coindesk.com/business/2024/03/14/crypto-custody-firm-cordial-systems-names-jump-crypto-as-client-as-it-exits-stealth/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Cordial Treasury gives all the software to the customer, not just a bit of a cryptographic key."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-14T16:00:00.000Z",
    "title": "The Graph Expands Subgraph to More Than 40 Blockchains Including Arbitrum, Base",
    "url": "https://www.coindesk.com/tech/2024/03/14/the-graph-expands-subgraph-to-more-than-40-blockchains-including-arbitrum-base/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The indexing layer is also expanding to Avalanche and Celo."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-14T15:58:28.000Z",
    "title": "North Korean Hackers Used Tornado Cash to Launder $12M From Heco Bridge Hack: Elliptic",
    "url": "https://www.coindesk.com/business/2024/03/14/north-korean-hackers-used-tornado-cash-to-launder-12m-from-heco-bridge-hack-elliptic/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Notorious North Korean hackers Lazarus Group has returned to sanctioned coin mixing service Tornado Cash to launder $12 million worth of ether {{ETH}}."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-14T15:52:06.000Z",
    "title": "Justin Sun Deposits $480M of ETH to Restaking Protocol Ether.Fi",
    "url": "https://www.coindesk.com/business/2024/03/14/justin-sun-deposits-480m-of-eth-to-restaking-protocol-etherfi/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Tron founder Justin Sun deposited 120,000 ether worth $480 million into liquid restaking protocol Ether.Fi, according to blockchain data."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-14T15:45:00.000Z",
    "title": "Crypto for Advisors: The Investment Case of Bitcoin vs. Ether",
    "url": "https://www.coindesk.com/business/2024/03/14/crypto-for-advisors-the-investment-case-of-bitcoin-vs-ether/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "With the dual tailwind of bitcoin ETF flows and the upcoming halving, is bitcoin the best bet? Not so fast. Ethereum, the next biggest crypto asset by market cap, has a case of its own to make."
  },
  {
    "source": "CoinDesk",
    "date": "2024-03-14T16:00:00.000Z",
    "title": "Protocol Village: Ethereum Layer 2 Metis Claims First in Launching Decentralizing Sequencer",
    "url": "https://www.coindesk.com/tech/2024/03/14/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of March 14-March 20."
  },
  {
    "source": "Decrypt",
    "date": "2024-03-14T15:57:13.000Z",
    "title": "Bitcoin, Stock Prices Drop as US Inflation Data Comes in Hot",
    "url": "https://decrypt.co/221740/bitcoin-stock-prices-drop-us-inflation-data",
    "description": "After closing in on $74,000 early Thursday, the price of Bitcoin has fallen alongside prominent stocks following hot U.S. inflation data."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-03-14T16:00:00.000Z",
    "title": " First EU country adopts quantum-resistant technology ",
    "url": "https://cointelegraph.com/news/eu-country-quantum-resistant-tech",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDMvYmJmMjZiZmUtMmNjNi00YzMwLWFiNWEtNzc2M2U5NDQ1ZDM4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The QAN stack will serve as a key component in the country’s post-quantum security layer.</p>\n                    <p><p data-ct-non-breakable=\"true\">QANplatform’s quantum-resistant technology has been adopted by the first European country, according to a March 14 press release shared with Cointelegraph.</p><p>QANplatform’s technology is used to protect against quantum computing attacks on government-owned cybersecurity infrastructure. The quantum-resistant blockchain enables developers to build smart contracts and applications that are resistant to quantum attacks. The name of the adopting country wasn’t disclosed, due to national security reasons.</p><p>The integration of the QAN stack will serve as a key component in the country’s post-quantum cybersecurity layer, according to Patrick Storchenegger, the CEO of QAN’s Intellectual property holding company.</p><p><a href=\"https://cointelegraph.com/news/eu-country-quantum-resistant-tech\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-14T16:08:52.000Z",
    "title": "Wright is not Satoshi, UK High Court rules",
    "url": "https://cryptobriefing.com/uk-court-wright-not-satoshi/",
    "description": "The UK High Court has declared that Craig Wright is not Satoshi Nakamoto, as he has been claiming since 2016."
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-03-14T15:57:14.000Z",
    "title": "Injective launches Pyth price feeds on inEVM, empowers smart contract developers with over 450 real-time market data",
    "url": "https://cryptobriefing.com/injective-integrates-pyth-price-feeds-inevm/",
    "description": "Injective's inEVM now features Pyth price feeds, offering smart contract developers access to over 450 real-time market data."
  },
  {
    "source": "BTCManager",
    "date": "2024-03-14T15:42:24.000Z",
    "title": "Dencun is finally live. Did it actually reduce fees?",
    "url": "https://crypto.news/dencun-is-finally-live-did-it-actually-reduce-fees/",
    "description": "Ethereum&#8217;s much-anticipated update is here. Could this be the turning point for lower user fees on the network? Just before the Dencun update went live, the average gas fee on Ethereum was 66 Gwei — one of the highest levels&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2024-03-14T15:41:54.000Z",
    "title": "Bitcoin mining difficulty reaches new all-time high",
    "url": "https://crypto.news/bitcoin-mining-difficulty-all-time-high-2/",
    "description": "On March 14, the difficulty of Bitcoin mining reached a new historical maximum of 83.99 T."
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-14T16:00:56.000Z",
    "title": "Cardano Ready For Breakout As Network Adoption Hits Major Milestone",
    "url": "https://www.newsbtc.com/news/cardano/cardano-breakout-network/",
    "description": "Cardano is yet to venture into the $0.8 price level this year, despite most cryptocurrencies breaking past old price levels. Although the blockchain has seen some exciting developments, the price action has been a little bit behind when compared to its peers. However, Cardano continues to give investors a glimmer of hope, as activity keeps soaring to new highs.  On-chain data shows that the active addresses on the Cardano network are spiking, with the monthly active count reaching its highest in the past year. Monthly Cardano Active Addresses Hit One-Year High Cardano’s active address count just hit a one-year high, signaling major network adoption and hinting at big things to come. According to data from Danogo, the active addresses in the past 30 days reached 596,915 on March 11, its highest since May 2023. Related Reading: Ethereum Is Not Done: Crypto Analyst Sets New $5,000 Target Interestingly, this number almost doubles the 279,000 active addresses recorded in September 2023, the lowest monthly active addresses in the past year.  Active addresses are one of the few metrics to look at when measuring the adoption rate of cryptocurrencies. Notably, various metrics have shown a surge in activity on the Cardano network and its ability to process a high number of transactions. A further look at the chart data presented by Danogo shows that the monthly active addresses reversed to start a spike at the end of February after going on a free fall in January.   Data from Cardano Blockchain Insights tells a similar tale of increased activity, with the active daily addresses steadying above 50,000 since February 29. Active addresses in the past 24 hours were 66,970.  A similar activity metric from IntoTheBlock shows increased activity from Cardano whales. Its large transaction metric, which measures transactions greater than $100,000, puts the number of whale transactions at 6,810 in the past 24 hours and $73.86 billion in the past seven days. For comparison, Ethereum&#8217;s large transactions stand at $63.17 billion in the same time frame.  The supply in the top 1% has also shown a strong accumulation from whales, spiking by around 60 million ADA on March 10. ADA To Reclaim $1? Interestingly, ADA has more than tripled from a $0.24 price in the monthly active addresses low in September. At the time of writing, ADA is trading at $0.79, up by 42% in the past 30 days.  Related Reading: Dogecoin Influencer Sounds Critical Warning Alarm For Scams Targeting The Community ADA has been rejected at $0.8 twice this month already, but it is now on its way to retesting the price level again. If the bulls can push ADA above $0.8, this could give the cryptocurrency free rein to reach $1 for the first time since April 2022. Overall, the overall crypto market continues to retain a bullish sentiment, which could push ADA above $1 this month.  ADA price at $0.78 &#124; Source: ADAUSDT on Tradingview.com Featured image from Binance Academy, chart from Tradingview.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-14T16:04:25.000Z",
    "title": "Hivemapper Maps 15% of Global Roads in 14 Months",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/hivemapper-maps-15-of-global-roads-in-14-months/",
    "description": "<p>This milestone highlights how community projects can use technology to impact global data, transforming navigation and our world understanding. Hivemapper utilizes global user-contributed dashcam footage to collect and share road data. Global Community Powers Road Mapping Revolution This method quickly gathers extensive data, outpacing traditional mapping updates. The project thrives by engaging a wide range [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/hivemapper-maps-15-of-global-roads-in-14-months/\">Hivemapper Maps 15% of Global Roads in 14 Months</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2024-03-14T15:40:29.000Z",
    "title": "Judge Rules Craig Wright Is Not Satoshi Nakamoto",
    "url": "https://www.altcoinbuzz.io/cryptocurrency-news/judge-rules-craig-wright-is-not-satoshi-nakamoto/",
    "description": "<p>COPA sued Wright to prevent him from suing crypto developers and figures over Bitcoin&#8217;s technology claims. The ruling aimed to protect the crypto community from such intellectual property lawsuits. Court Halts Wright&#8217;s Crypto Lawsuits The court&#8217;s ruling is a key moment in the saga of Satoshi Nakamoto&#8217;s identity and the legal disputes affecting the crypto [&#8230;]</p>\n<p>The post <a href=\"https://www.altcoinbuzz.io/cryptocurrency-news/judge-rules-craig-wright-is-not-satoshi-nakamoto/\">Judge Rules Craig Wright Is Not Satoshi Nakamoto</a> appeared first on <a href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]