[
  {
    "source": "CoinDesk",
    "date": "2023-08-08T18:09:26.000Z",
    "title": "Bavaria's Data Regulator Had Not Concluded Assessment of Worldcoin When the Project Launched",
    "url": "https://www.coindesk.com/policy/2023/08/08/bavarias-data-regulator-had-not-concluded-assessment-of-worldcoin-when-the-project-launched/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The Sam Altman co-founded project has been shut down in Kenya over privacy concerns."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-08T18:21:36.000Z",
    "title": "Here’s what happened in crypto today",
    "url": "https://cointelegraph.com/news/what-happened-in-crypto-today",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/78d78761-3bd2-4569-96a7-62a97f0a1b0a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting the Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.</p>\n                    <p><p>Crypto exchange Binance has officially entered El Salvador. The news came shortly after it was revealed that the exchange sold its USD Coin (USDC) reserves for Bitcoin (BTC) and Ether (ETH) amid the collapse of Silvergate Bank. Meanwhile, markets are still buzzing after PayPal launched a new US dollar-backed stablecoin called PayPal USD (PYUSD) — issued by Paxos Trust Co.</p><p>Bitcoin-friendly El Salvador has granted Binance a license to offer crypto services in the Central American nation, potentially opening the door to wider digital-asset adoption. </p><p>On Aug. 8, Binance announced that El Salvador’s central bank <a href=\"https://cointelegraph.com/news/binance-receives-licenses-crypto-services-el-salvador\">approved its exchange application</a> for a Bitcoin Services Provider license — it was also granted a Digital Asset Services Provider license by the National Commission of Digital Assets. Min Lin, who heads Binance’s Latin America operations, said the Salvadoran licensing process took “many months” to complete. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Binance?src=hash&amp;ref_src=twsrc%5Etfw\">#Binance</a> is now El Salvador’s first fully licensed crypto exchange! <br><br>With this, Binance has approvals and registrations in 18 markets worldwide, more than any other crypto exchange, including France, Italy, Spain, Sweden and Dubai.<a href=\"https://t.co/BITj9zxdcZ\">https://t.co/BITj9zxdcZ</a></p>&mdash; Binance (@binance) <a href=\"https://twitter.com/binance/status/1688916994886959104?ref_src=twsrc%5Etfw\">August 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><a href=\"https://cointelegraph.com/news/el-salvador-president-bitcoin-law-will-be-approved-tonight\">El Salvador fully embraced Bitcoin</a> in 2021 after it became the first country to recognize the digital asset as legal tender. The Salvadoran government has described BTC as a tool to attract foreign direct investment, create new jobs and reduce reliance on the United States dollar. </p><h2>Binance enters ‘Bitcoin country’ </h2><h2>Binance sold USDC for BTC and ETH after Silvergate Bank collapse: PoR report</h2><p>Binance’s latest <a href=\"https://cointelegraph.com/news/what-are-proof-of-reserves-audits-and-how-do-they-work\">proof-of-reserves (PoR)</a> from Aug. 1 revealed that the crypto exchange converted its USD Coin (<a href=\"https://cointelegraph.com/usdc-price-index\">USDC</a>) reserves into Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) right after the collapse of Silvergate Bank.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/4a79f65c-c046-4c9b-99b9-d2f4fbca3d0c.png\"  /><figcaption style=\"text-align: center;\"><em>Binance reserves balance between December 2022–June 2023. Source: Binance</em></figcaption></figure><p>Binance started converting customers’ USDC to Binance USD in September internally, but at the time, it did hold a significant amount of USDC in its reserves as well. </p><h3>PayPal USD is a boon for Ethereum, not decentralization: Community</h3><p>PayPal’s new Ethereum-based stablecoin, PayPal USD (PYUSD) could herald the mainstream adoption of Ethereum, but at the cost of more centralization, <a href=\"https://cointelegraph.com/news/paypal-usd-boon-for-ethereum-but-not-decentralization-says-community\">according to the crypto community</a>. </p><p>The new stablecoin, PayPal USD, was announced on Aug. 7 and will soon be available to U.S. customers. </p><p>While Ethereum bulls such as Anthony Sassano and Ryan Sean Adams have lauded the announcement as a huge win for Ethereum adoption, others have pointed to its smart contract code, which would purportedly allow the firm to freeze and wipe funds. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The new Paypal USD stablecoin has an &quot;assetProtection&quot; role which can wipe your balance in two transactions (first `freeze`, then `wipeFrozenAddress`)<br><br>In smart contract security we call this a &quot;centralisation attack vector&quot; <a href=\"https://t.co/RsmqvsnKvi\">pic.twitter.com/RsmqvsnKvi</a></p>&mdash; pashov (@pashovkrum) <a href=\"https://twitter.com/pashovkrum/status/1688591468498239496?ref_src=twsrc%5Etfw\">August 7, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Digital asset lawyer Sarah Hodder believes many characteristics of PayPal’s stablecoin resemble that of a censorship-enabled central bank digital currency. Another smart contract auditor <a href=\"https://twitter.com/rdauditors/status/1688599549097480205\" target=\"_blank\" rel=\"noopener nofollow\">noted</a> that PYUSD’s smart contract can be changed by PayPal at any time.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Yes, PayPal&#39;s stablecoin is centralized.<br><br>No, that doesn&#39;t make it any less cool that PayPal has a stablecoin.<br><br>Ethereum being a settlement layer for all types of value means that different types of assets will exist on the network &amp; you get to choose which ones you want to use.</p>&mdash; sassal.eth  (@sassal0x) <a href=\"https://twitter.com/sassal0x/status/1688716600294383616?ref_src=twsrc%5Etfw\">August 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-08T17:47:40.000Z",
    "title": "CPI report may show uptick in US inflation — How will Bitcoin price react?",
    "url": "https://cointelegraph.com/news/cpi-report-may-show-uptick-in-us-inflation-how-will-bitcoin-price-react",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/6105dd8b-6f43-430a-b158-576f9ce40dfa.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin’s price remains range-bound as equities, gold and U.S. Treasurys offer competitive rates with reduced risk. This week’s CPI report could shake things up.</p>\n                    <p><p>The S&P 500 index is currently trading only 6% below its all-time high, which was reached in January 202. Traditionally, such a situation would be seen as a bullish sign for risk-on assets, including commodities and cryptocurrencies, but this time, it appears that investors have been using the stock market as a means of protection against the recent inflation surge, which sustained at over 4% between April 2021 and May 2023.</p><p>For Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) and cryptocurrency investors, inflation has typically been viewed as a positive factor influencing the price, as evidenced by the previous all-time highs of $65,000 and $69,000 that occurred during a period of monetary expansion and increasing inflation in 2021. However, the current situation is different because inflation is making a comeback while the Federal Reserve has been effectively reducing liquidity in the system. As a result, the impact of inflation on cryptocurrencies remains uncertain.</p><h2>Is the tech stock bubble bursting?</h2><p>The recent seven-day decline in tech giants — including Fortinet (FTNT) with a decrease of 25.7%, Block Inc. (SQ) with a drop of 20.5%, PayPal (PYPL) down by 15%, Shopify (SHOP) down 14.8% and Palo Alto Networks (PANW) down 13.9% — has caught the attention of investors, particularly in light of the expectation of an additional interest rate hike by the Federal Open Market Committee on Sept. 20.</p><p>Economists predict that the Consumer Price Index for July, which will be revealed on Aug. 10, will be around 3.3%, surpassing the previous month’s figure of 3% and exceeding the central bank’s 2% target. Given the latest unemployment rate of 3.5% in June, nearing a 40-year low, the Fed moving toward tightening the economy becomes more certain.</p><p>Gold, a traditional safe haven, has struggled to surpass the $2,000 mark on multiple occasions since 2020, indicating a lack of confidence in its ability to hedge against risks.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/2346ceb9-8c5e-4db2-8e56-b6af5e97cf37.png\"><figcaption style=\"text-align: center;\"><em>Gold price in USD (blue, right) vs. S&P 500 index (orange, left). Source: TradingView</em></figcaption></figure><p>The real estate market has also been impacted, facing limited housing supply and rising mortgage rates, as evidenced by Redfin’s second-quarter revenue drop of 21% compared to the previous year. The company expects a further decline of 15% to 20% in transaction value for Q3.</p><p>Even traditional safe assets like bonds are losing some of their appeal due to the ongoing increase in the United States federal debt. Investment mogul and hedge fund billionaire Bill Ackman reportedly <a href=\"https://cointelegraph.com/news/buffett-and-ackman-take-opposing-sides-on-treasury-yields-what-does-it-mean-for-bitcoin\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/buffett-and-ackman-take-opposing-sides-on-treasury-yields-what-does-it-mean-for-bitcoin/amp\">shorted 30-year U.S. Treasury bonds</a>, expressing concerns about long-term inflation.</p><p>A July 31 report by the U.S. Treasury Department <a href=\"https://www.bloomberg.com/news/articles/2023-07-31/us-treasury-boosts-quarterly-borrowing-estimate-to-1-trillion\" target=\"_blank\" rel=\"noopener nofollow\">revealed</a> a $1 trillion quarterly net borrowing estimate and an unexpected <a href=\"https://cointelegraph.com/news/could-a-bitcoin-bull-run-be-triggered-by-fitch-s-us-credit-rating-downgrade\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/could-a-bitcoin-bull-run-be-triggered-by-fitch-s-us-credit-rating-downgrade/amp\">Fitch Ratings downgrade of U.S. debt</a>, further fueling concerns in the financial markets.</p><p>Consequently, investors are now seeking alternative markets, and Bitcoin whales have increased their leverage long positions using derivatives despite the cryptocurrency’s price remaining around $29,500.</p><h2>Bitcoin’s price support at $29,000 is backed by solid derivatives metrics</h2><p>Bitcoin quarterly futures typically trade at a slight premium relative to spot markets, as sellers demand more money to delay the settlement. Healthy markets usually display BTC futures contracts trading at a 5% to 10% annualized premium, a situation known as contango, which is not unique to crypto markets.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/944035b7-53ac-4129-abdc-6a2bea919bab.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>Bitcoin 3-month futures premium. Source: Laevitas</em></figcaption></figure><p>The BTC futures premium (or basis rate) on platforms like Deribit and OKX reached 8%, the highest in over three weeks. This higher premium signals pro traders are willing to pay an additional cost to engage in leverage longs, thus reflecting a positive sentiment toward Bitcoin.</p><p>Traders can also gauge the market’s sentiment by measuring whether more activity is going through call (buy) options or put (sell) options. A 0.70 put-to-call ratio indicates that put option open interest lags the more bullish calls and is, therefore, bullish. In contrast, a 1.40 indicator favors put options, which can be deemed bearish.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/f17a4bcd-0d74-45e9-b387-8b9deb9537b8.png\" alt=\"\" title=\"\"><figcaption style=\"text-align: center;\"><em>BTC options volume put-to-call ratio. Source: Laevitas</em></figcaption></figure><p>The put-to-call ratio has been below 1.0 since July 24, revealing a strong demand for call (buy) instruments. Such data suggests investors' optimism for the potential price appreciation of Bitcoin.</p><p>There is a growing indication that Bitcoin might potentially benefit from the inflation surge. However, if investors start to believe that the Federal Reserve’s idea of a soft landing for the economy is unlikely and that a severe recession is on the horizon, they are likely to favor Treasurys and cash positions initially.</p><p>In the short-to-mid term, there is not much evidence to suggest that Bitcoin will experience a significant surge if inflation becomes widespread in the United States. Nevertheless, there is hope for bullish investors, as the cryptocurrency has shown solid support at the $29,000 mark.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p>\n</p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-08T17:45:30.000Z",
    "title": "Circle Unveils Web3 Programmable Wallets: A Technical Breakthrough for Developers",
    "url": "https://cryptobriefing.com/circle-unveils-web3-programmable-wallets/?utm_source=feed&utm_medium=rss",
    "description": "Circle rolls out a new Web3 wallet platform, aiming to bolster digital-asset interactions for both businesses and individual users."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-08T18:30:40.000Z",
    "title": "A Comprehensive Look at the New Paypal Stablecoin, Its Control Dynamics, and ‘Freeze’ Option Trending on Social Media",
    "url": "https://news.bitcoin.com/a-comprehensive-look-at-the-new-paypal-stablecoin-its-control-dynamics-and-freeze-option-trending-on-social-media/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/ppcoin-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"A Comprehensive Look at the New Paypal Stablecoin, Its Control Dynamics, and &#039;Freeze&#039; Option Trending on Social Media\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/ppcoin-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ppcoin-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ppcoin-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ppcoin-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ppcoin-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ppcoin-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/ppcoin.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />At the time of writing, the official Paypal stablecoin PYUSD smart contract has been unveiled, and as it stands, the maximum aggregate supply amounts to 26,905,005.66 PYUSD. In spite of the existence of more than 26 million Paypal stablecoins, the contract continues to retain a substantial 92.91% of this supply. Concurrently, the Paxos Treasury wields [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T18:38:31.000Z",
    "title": "ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?",
    "url": "https://www.cryptopolitan.com/apecoin-price-prediction/",
    "description": "ApeCoin Price Prediction 2023-2032 The NFT industry has been booming for the past few years and is not stopping anytime soon. The NFT project Bored Ape Yacht Club has been one of the most successful in the blockchain industry. However, recent statistics indicate that the project is losing its momentum. Various APE price highlights unfold ... <a title=\"ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apecoin-price-prediction/\" aria-label=\"More on ApeCoin Price Prediction 2023-2032: BAYC sales crush, Sell Sentiment for APE?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T18:33:01.000Z",
    "title": "Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?",
    "url": "https://www.cryptopolitan.com/floki-inu-price-prediction/",
    "description": "Floki Inu Price Prediction 2023-2032 What&#8217;s the good news from the Floki Inu community? Apparently, more believers are &#8220;flocking to it&#8221;. Another major exchange listing on Cetoex while waiting to be listed in Binance. Also, FLOKI joins the rest of the Musk dog-meme coins in celebrating a successful 2022 turnout. In case you&#8217;re wondering, here&#8217;s ... <a title=\"Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/floki-inu-price-prediction/\" aria-label=\"More on Floki Inu Price Prediction 2023-2032: Can FLOKI Surpass Previous ATH?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T18:32:59.000Z",
    "title": "Circle launches Programmable Wallets to simplify blockchain app development and foster crypto adoption",
    "url": "https://www.cryptopolitan.com/circle-launches-programmable-wallets-for-blockchain-development-crypto-adoption/",
    "description": "Circle has announced the launch of Programmable Wallets. This new product line is designed specifically for developers, empowering them to embed secure crypto wallets into any application and utilize the speed and reach of Web3 technology. Programmable Wallets, the first in Circle’s Web3 Services, answers the pressing need to simplify the development of blockchain-powered apps ... <a title=\"Circle launches Programmable Wallets to simplify blockchain app development and foster crypto adoption\" class=\"read-more\" href=\"https://www.cryptopolitan.com/circle-launches-programmable-wallets-for-blockchain-development-crypto-adoption/\" aria-label=\"More on Circle launches Programmable Wallets to simplify blockchain app development and foster crypto adoption\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T18:24:13.000Z",
    "title": "Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Flow Coin Price Prediction 2023-2032 Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the ... <a title=\"Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flow-coin-price-prediction/\" aria-label=\"More on Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T18:14:26.000Z",
    "title": "Crypto Today – Here’s what happened in the market",
    "url": "https://www.cryptopolitan.com/crypto-market-today-heres-what-happened/",
    "description": "The crypto market has been flooded with different market sentiments as the industry works to recover. On that end, Ark Invest CEO Cathie Wood and Galaxy Digital CEO Mike Novogratz are both bullish on the prospect of a spot bitcoin (BTC) ETF being approved soon. Here is a look at what took place in the ... <a title=\"Crypto Today &#8211; Here’s what happened in the market\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-market-today-heres-what-happened/\" aria-label=\"More on Crypto Today &#8211; Here’s what happened in the market\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T18:13:43.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T18:09:59.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T18:09:28.000Z",
    "title": "Aptos Price Prediction for 2023 – 2032: Will APT Token Hold Bullish Hopes?",
    "url": "https://www.cryptopolitan.com/aptos-price-prediction/",
    "description": "Aptos Price Prediction 2023-2032 As we venture into 2023 to 2032, the next decade promises to be a critical period for Aptos as it strives to establish itself as a significant blockchain platform. The rapidly changing market dynamics, technological advancements, and evolving adoption trends will undoubtedly shape Aptos&#8217;s path. Against this backdrop, investors and stakeholders ... <a title=\"Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/aptos-price-prediction/\" aria-label=\"More on Aptos Price Prediction for 2023 &#8211; 2032: Will APT Token Hold Bullish Hopes?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T18:05:29.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-08T17:49:33.000Z",
    "title": "Binance snags El Salvador crypto exchange license",
    "url": "https://www.cryptopolitan.com/binance-el-salvador-crypto-exchange-license/",
    "description": "Dominating headlines today, Binance has clinched the title as El Salvador&#8217;s premier fully licensed crypto exchange. This accomplishment wasn&#8217;t just handed to them on a silver platter, said the company&#8217;s latest blog post. It was earned through sheer perseverance, strategic collaboration, and a commitment to upholding global standards for the crypto and blockchain industry. Setting ... <a title=\"Binance snags El Salvador crypto exchange license\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-el-salvador-crypto-exchange-license/\" aria-label=\"More on Binance snags El Salvador crypto exchange license\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-08T18:00:38.000Z",
    "title": "Pro-XRP Lawyer John Deaton Says He Is Willing To Bet That Ripple Will Win SEC Appeal",
    "url": "https://www.newsbtc.com/ripple-2/deaton-ripple-will-win-sec-appeal/",
    "description": "Popular XRP advocate and notable attorney John Deaton recently predicted a comfortable appeal victory by Ripple against the United States Securities and Exchange Commission (SEC). The Managing Partner of ‘The Deaton Law Firm’ says he is willing to bet big on the exchange emerging victorious on appeal. Founded Belief Or Mere Speculation? John Deaton’s willingness to bet on an uncertain court judgment follows a recent thread penned by digital asset enthusiast and Australian-based lawyer Bill Morgan. According to the thread, Judge Analisa Torres did not err in her summary judgment decision.  Related Reading: Valkyrie Unveils Double-Barreled Approach To Launch An Ethereum ETF Alongside A Bitcoin ETF Morgan was of the opinion that the Securities and Exchange Commission (SEC) classified sales of XRP by Ripple into three unique classes; institutional sales, programmatic sales, and other XRP distributions. Following the classification, Judge Torres evaluated each class by applying the popular Howey test.  After evaluation, the Judge discovered major differences in each class. For instance, the Judge discovered that every institutional investor signed agreements with Ripple and expected to earn profits from the firm’s activities.  While institutional investors entered contracts with Ripple, programmatic sales on exchanges did not require the signing of contracts, and purchasers, therefore, did not expect to make profits directly from Ripple’s efforts.  Therefore, according to Morgan, Judge Torres ruled that the sale of XRP to institutional investors amounted to a sale of securities, while that of programmatic sales on virtual exchanges was not.  XRP price still sitting at $0.62 as community awaits SEC appeal &#124; Source: XRPUSD on Tradingview.com Deaton Ready To Go All In For Ripple Reacting to the thread, John Deaton commended Bill Morgan and noted that Judge Torres did not differentiate between Ripple’s XRP sales merely out of “thin air.” He stated that the Judge considered each sale the SEC alleges as securities “and applied the Howey test.” Therefore, given his confidence in the decision, he was willing to wager “significant funds that she doesn’t get reversed on appeal.” Related Reading: PayPal’s PYUSD Launch Triggers Calls For Stablecoin Bill While Deaton may have cause to believe in a favorable appeal outcome, recent developments may instigate some doubts in his prediction. Recently, US District Judge Jed Rakoff, who oversees the SEC’s lawsuit against Terraform Labs, rejected the approach used in Judge Torres’s ruling. This creates a certain unpredictability in the outcome of the upcoming SEC appeal.  In the interim, SEC’s Chair, Gary Gensler, has suggested that an appeal against the decision in the Ripple lawsuit is under strong consideration. While Gensler’s comment does not expressly guarantee an appeal, however; it indicates that the US SEC has not conceded a partial defeat in the suit.  Featured image from iStock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-08T18:19:50.000Z",
    "title": "Jia Expands Credit Solution on Huma to Foster Growth and Opportunity in Emerging Markets",
    "url": "https://www.crypto-news-flash.com/jia-expands-credit-solution-on-huma-to-foster-growth-and-opportunity-in-emerging-markets/?utm_source=rss&utm_medium=rss&utm_campaign=jia-expands-credit-solution-on-huma-to-foster-growth-and-opportunity-in-emerging-markets",
    "description": "<img width=\"1200\" height=\"720\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Huma-Jia_PR_1690809946C3qisAa1RX.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Huma-Jia_PR_1690809946C3qisAa1RX.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Huma-Jia_PR_1690809946C3qisAa1RX-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Huma-Jia_PR_1690809946C3qisAa1RX-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/Huma-Jia_PR_1690809946C3qisAa1RX-768x461.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />San Francisco, California, August 1st, 2023, Chainwire Addressing a $5 trillion global credit gap in emerging markets, Jia, which connects capital to small businesses in every corner of the world, scales up its credit solution on Huma, which builds infrastructure for real-world lending. Two months after launching its credit solution on the Huma platform, Jia [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-08T18:00:55.000Z",
    "title": "Cronos Backs AI in 3 Core Areas in Crypto, Borroe’s Features is Why $ROE Will Pump 300% After Launch",
    "url": "https://www.crypto-news-flash.com/cronos-backs-ai-in-3-core-areas-in-crypto-borroes-features-is-why-roe-will-pump-300-after-launch/?utm_source=rss&utm_medium=rss&utm_campaign=cronos-backs-ai-in-3-core-areas-in-crypto-borroes-features-is-why-roe-will-pump-300-after-launch",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-08T102232.465.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-08T102232.465.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-08T102232.465-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-08T102232.465-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-08T102232.465-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-08T102232.465-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the ever-evolving landscape of cryptocurrencies, innovation is a driving force that propels projects forward. Cronos (CRO), a name well-known in the crypto realm, has been on a determined mission to not just expand its ecosystem, but to redefine it through the integration of Artificial Intelligence (AI).  As the digital realm continues to intertwine with [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-08T18:05:06.000Z",
    "title": "Quant Analyst PlanB Says History Suggesting 2-Year Long Bitcoin Rally Approaching After Critical Indicator Turns Bullish",
    "url": "https://dailyhodl.com/2023/08/08/quant-analyst-planb-says-history-suggesting-2-year-long-bitcoin-rally-approaching-after-critical-indicator-turns-bullish/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/11/in-Losses-From-Bitcoin.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/11/in-Losses-From-Bitcoin.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/11/in-Losses-From-Bitcoin.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/11/in-Losses-From-Bitcoin.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/11/in-Losses-From-Bitcoin.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/11/in-Losses-From-Bitcoin.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/11/in-Losses-From-Bitcoin.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Closely followed quant analyst PlanB says that Bitcoin (BTC) has crossed a key resistance level that historically kicks off multi-year rallies. The pseudonymous analyst tells his 1.8 million X followers that BTC&#8217;s five-month realized price has crossed the two-year realized price, a pattern that has previously marked the start of a bull market three times [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/08/quant-analyst-planb-says-history-suggesting-2-year-long-bitcoin-rally-approaching-after-critical-indicator-turns-bullish/\">Quant Analyst PlanB Says History Suggesting 2-Year Long Bitcoin Rally Approaching After Critical Indicator Turns Bullish</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]