[
  {
    "source": "Cointelegraph",
    "date": "2023-08-09T17:15:00.000Z",
    "title": "Only 6 out of 45 crypto wallet brands have undergone penetration testing: Report",
    "url": "https://cointelegraph.com/news/most-crypto-wallet-brands-havent-undergone-penetration-testing-report",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/1d5dcf8c-5cfa-4586-8909-e547c3758c04.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Cybersecurity certification platform CER said the vast majority of wallets do not hire outside experts to perform penetration tests.</p>\n                    <p><p>A July <a href=\"https://cer.live/post/crypto-wallet-security-rating-report-key-insights-findings\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from cybersecurity certification platform CER found that only six of 45, or 13.3%, of cryptocurrency wallet brands have undergone penetration testing to find security vulnerabilities. Of these, only half have performed tests on the latest versions of their products. </p><p>The three brands that have done up-to-date penetration tests are MetaMask, ZenGo, and Trust Wallet, according to the report. Rabby and Bifrost performed penetration testing on older versions of their software and LedgerLive did them on an unknown version (listed as “N/A” in the report). All other brands listed did not provide any evidence of having done these tests.</p><p>The report also <a href=\"https://cer.live/wallets\" target=\"_blank\" rel=\"noopener nofollow\">provided</a> an overall ranking of the security of each wallet, listing MetaMask, ZenGo, Rabby, Trust Wallet, and Coinbase wallet as being the most secure wallets overall.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/60ec7da4-b21c-4d5f-a894-b1ba123d5c36.png\"  /><figcaption style=\"text-align: center;\"><em>CER rankings for wallet security. Source: CER.</em></figcaption></figure><p>“Penetration testing” is a method of finding security vulnerabilities in computer systems or software. A security researcher attempts to hack into the device or software and use it for purposes it wasn’t intended. In most cases, a penetration tester is given little to no information about how the product works. This process is used to simulate real-world attempts at hacking to uncover vulnerabilities before the product is released.</p><p>CER found that 39 out of 45 wallet brands didn't perform any penetration testing at all, not even on older versions of the software. CER speculated that the reason may be that these tests are expensive, especially if the company makes frequent upgrades to their products, stating, “We attribute it to the amount of updates an average app has, where each new update can disqualify the pentest made earlier.”</p><p>They found that the most popular wallet brands were more likely to perform security audits, including penetration tests, as they often had the funds to do so:</p><blockquote>“Essentially, popular wallets tend to adopt more robust security measures to protect their increasing user base. This seems logical – a higher user base often corresponds to more significant funds to secure, more visibility, and consequently, more potential threats. It can also result in a positive feedback loop, with more secure wallets attracting new users in higher numbers than the less secure ones.”</blockquote><p>CER’s ranking of wallets was based on a methodology that included factors like bug bounties, past incidents, and security features, such as restore methods and password requirements.</p><p>Although most wallet brands don’t perform penetration testing, CER stated that many of them do rely on bug bounties to find vulnerabilities, which is often an effective means of preventing hacks. They rated 47 out of 159 individual wallets as “secure” overall, meaning that they had a security score of above 60. These 159 wallets included some that were from the same brands. For example, MetaMask for Edge browser was considered a separate wallet from MetamlMask for Android.</p><p><em><strong>Related: </strong><a href=\"https://cointelegraph.com/news/bug-bounties-can-help-secure-blockchain-networks-but-have-mixed-results\"><strong>Bug bounties can help secure blockchain networks, but have mixed results</strong></a></em></p><p>Wallet security has become an urgent issue in 2023 as over $100 million <a href=\"https://cointelegraph.com/news/atomic-wallet-hack-statement-exploit-unanswered-questions\">was lost in the Atomic Wallet hack</a> on June 3. The Atomic team has speculated that the breach may have been caused by a virus or injection of malware in the company’s infrastructure, but the exact vulnerability that allowed the attack is still unknown. Web wallet MyAlgo also <a href=\"https://cointelegraph.com/news/algodex-reveals-wallet-infiltrated-by-malicious-actor-as-myalgo-renews-warning-withdraw-now\">suffered a security breach</a> in late February, resulting in an estimated loss to users of over $9 million.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-09T17:15:47.000Z",
    "title": "Fantom-based SpiritSwap heads for shutdown after Multichain hack drains treasury",
    "url": "https://cryptoslate.com/fantom-based-spiritswap-heads-for-shutdown-after-multichain-hack-drains-treasury/",
    "description": "<p>SpiritSwap, a Fantom-based decentralized exchange (DEX), is winding down its operation after Multichain&#8217;s (MULTI) hack drained its treasury of all funds, according to an Aug. 9 message on its Telegram channel. On July 14, the Multichain team closed the cross-chain protocol following their inability to reach CEO Zhaojun and effectively maintain its operation. Before then, the [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/fantom-based-spiritswap-heads-for-shutdown-after-multichain-hack-drains-treasury/\">Fantom-based SpiritSwap heads for shutdown after Multichain hack drains treasury</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-09T17:39:17.000Z",
    "title": "Optimism Price Prediction 2023 – 2032: Will OP Token Gain Momentum In 2023?",
    "url": "https://www.cryptopolitan.com/optimism-price-prediction/",
    "description": "Optimism Price Prediction 2023-2032 Imagine a world where Ethereum, the second largest cryptocurrency by market cap, is not just a giant because of its support for smart contracts, but also a fast, affordable, and efficient platform. This is the world that the Ethereum community dreams of, a world where decentralized apps (dApps) and decentralized finance ... <a title=\"Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/optimism-price-prediction/\" aria-label=\"More on Optimism Price Prediction 2023 &#8211; 2032: Will OP Token Gain Momentum In 2023?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-09T17:25:12.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-09T17:21:29.000Z",
    "title": "BlackRock insiders hint at Bitcoin ETF approval in 6 months",
    "url": "https://www.cryptopolitan.com/blackrock-bitcoin-etf-approval-in-6-months/",
    "description": "The world of cryptocurrency has long awaited a significant leap in terms of global acceptance. Now, insiders from BlackRock, the behemoth in the asset management arena, are dropping hefty hints that a Bitcoin exchange-traded fund (ETF) could hit the US markets within the next six months. With the rumors swirling, industry professionals and market analysts ... <a title=\"BlackRock insiders hint at Bitcoin ETF approval in 6 months\" class=\"read-more\" href=\"https://www.cryptopolitan.com/blackrock-bitcoin-etf-approval-in-6-months/\" aria-label=\"More on BlackRock insiders hint at Bitcoin ETF approval in 6 months\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-09T17:17:10.000Z",
    "title": "Aptos Labs’ Collaboration With Microsoft Sends APT Soaring By 17%",
    "url": "https://www.newsbtc.com/aptos-apt/aptos-labs-collaboration-with-microsoft-sends-apt-soaring-by-17/",
    "description": "Aptos Labs and Microsoft have announced a strategic partnership to showcase the convergence of artificial intelligence (A.I.) and blockchain technologies.  Aptos Labs, a leading blockchain developer, and Microsoft, a key backer of A.I. advancements through OpenAI, are joining forces to create the innovative Aptos Assistant, a ChatGPT-powered chatbot designed to provide users and developers with comprehensive information and analysis of the Aptos ecosystem. Aptos Labs And Microsoft Forge Alliances For Blockchain Development According to a report by Yahoo Finance, unlike previous endeavors in the crypto-related A.I. space, which primarily revolved around licensing OpenAI&#8217;s ChatGPT, Aptos Labs&#8217; collaboration with Microsoft ventures beyond boundaries.  The partnership encompasses various facets, with Aptos Labs hosting validator nodes on Microsoft&#8217;s Azure cloud computing platform, integrating its programming language, Move, into Microsoft&#8217;s popular coding platform, GitHub Copilot, and exploring opportunities to connect with major financial institutions seeking to build blockchain-powered applications on Azure. Related Reading: Bitcoin Longs Could Precipitate Plunge To $28,000, This Chart Urges Caution Rashmi Misra, General Manager of A.I. and Emerging Technologies at Microsoft, expressed excitement about the fusion of A.I. and blockchain, stating:  The intersection of A.I. and blockchain is among the most interesting combinations of emerging technologies. By fusing Aptos Labs&#8217; technology with the Microsoft Azure OpenAI Service capabilities, we aim to democratize the use of blockchain. Aptos Labs has already secured substantial funding of $400 million from investors, according to Crunchbase, highlighting the confidence in their technological prowess. The collaboration with Microsoft further solidifies its position as a formidable player in the blockchain space. While A.I. startups have dominated funding in 2023, raising nearly $25 billion, compared to around $3.6 billion for crypto ventures, Mo Shaikh, Co-founder and CEO of Aptos Labs, believes that A.I. and blockchain are not mutually exclusive.  Shaikh emphasizes the importance of blockchain&#8217;s ability to provide verified and accurate information, minimizing the risk of A.I. models generating false statements or hallucinations. The practical implications of this collaboration are still unfolding. Still, Shaikh underscores elements such as the A.I. assistant and integration into Github Copilot to represent a larger vision of deep integration and co-development between Aptos Labs and Microsoft.  APT Rebounds As Collaboration With Microsoft Reignites Investor Interest APT, the native token of the Aptos blockchain, experienced a significant surge of over 17% following the announcement of its partnership with Microsoft.  This surge marked a crucial turning point after a prolonged downtrend that persisted since the beginning of February. Notably, APT had reached an all-time high of $20 before succumbing to the downward trend. The decline in APT&#8217;s price can be attributed to an unlock event on February 12th, where Aptos released 4.5 million APT tokens.  The unlock event, involving the release of a significant number of tokens, resulted in increased selling pressure, leading to a continuous decline in APT&#8217;s price.  Related Reading: Bitcoin Open Interest Hits Peak Since FTX Crash: What It Means However, the recent partnership announcement with Microsoft has injected new life into the token&#8217;s value, reigniting investor interest and resulting in a remarkable price surge.  Despite experiencing some retracement, APT still holds a 10% profit since the disclosure of the partnership with Microsoft. It is currently trading at $7.3340, representing a 63% decrease from its all-time high reached in January 2023. Overall, investors have responded positively to this news, recognizing the potential of the Aptos-Microsoft partnership to drive innovation and expand the reach of the Aptos blockchain. The substantial surge in APT&#8217;s price reflects growing confidence in the project&#8217;s prospects and underscores the significance of this collaboration. Featured image from iStock, chart from TradingView.com "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-09T17:12:08.000Z",
    "title": "Bitcoin (BTC) and Crypto Surge: Factors Behind Price Rally",
    "url": "https://www.crypto-news-flash.com/bitcoin-btc-and-crypto-surge-factors-behind-price-rally/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-btc-and-crypto-surge-factors-behind-price-rally",
    "description": "<img width=\"1920\" height=\"1277\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP-BTC.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP-BTC.jpg 1920w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP-BTC-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP-BTC-1024x681.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP-BTC-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP-BTC-1536x1022.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/RIPPLE-XRP-BTC-104x69.jpg 104w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" />Bitcoin (BTC) is dragging the entire crypto up as investors accumulate in anticipation of a Bitcoin ETF approval.  An analyst predicts that Bitcoin could record one big dump before proceeding to hit $40k.  Bitcoin (BTC) is leading the entire crypto market to recover from the recent bearish run that saw most altcoins breaking multiple support [...]"
  }
]