[
  {
    "source": "Cointelegraph",
    "date": "2023-06-27T05:24:57.000Z",
    "title": "Australian banks claim 40% of scams 'touch' crypto as it defends restrictions",
    "url": "https://cointelegraph.com/news/australian-banks-claim-40-percent-scams-touch-crypto",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/2aeb1b33-ce15-40b1-b44f-ee238829ac1b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>During a panel at the Australian Blockchain Week, executives from Australia’s major banks explained why they added restrictions on payments to local crypto exchanges.</p>\n                    <p><p>Australia’s cryptocurrency industry banking woes will likely continue, with the government and major banks signaling no intention to back down against scams that “touch” crypto.</p><p>During a panel at the Australian Blockchain Week on June 26, Sophie Gilder, managing director of blockchain and digital assets at Commonwealth Bank (CBA) shed light on the bank's restrictions on crypto exchange payments, noting it was put in place after seeing an alarming rate of scams that ended up involving cryptocurrency.</p><p>“One in three of the dollars that are scammed from Australians touch crypto, one in three. So it's the single largest lever that we have to reduce this impact on our customers,” she said.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/5ae5a189-fb27-4f11-a0c3-a5ec022168d2.jpg\"  /><figcaption style=\"text-align: center;\"><em>Commonwealth Bank's Sophie Gilder speaking in a panel during Australian Blockchain Week. Source: Cointelegraph</em></figcaption></figure><p>Nigel Dobson, banking services portfolio lead at ANZ referred to data from the Australian Financial Crimes Exchange which suggests the figures may be even higher at 40%.</p><p>On June 8, CBA <a href=\"https://cointelegraph.com/news/australian-big-4-bank-begins-trial-for-cryptocurrency-payment-blocks\">followed Westpac’s lead</a> in <a href=\"https://cointelegraph.com/news/commonwealth-bank-decline-limit-payments-to-high-risk-crypto-exchanges\">imposing pauses, limits and outright blocks</a> on certain payments to cryptocurrency exchanges, both citing an increasing threat of investment scams. Australia's other two major banks, the ANZ and NAB, have not yet indicated whether they would impose similar restrictions.</p><p>A Treasury official confirmed that the moves so far have come at the banks' own “volition” but that both the banks and the government have a “shared view” that cryptocurrency scams are “unacceptably high” at the moment.</p><p>“From the government's point of view, [they] need to invest more in reducing scams, and that’s the government, but it's also banks, other people in the financial system have to work together to reduce scams to maintain trust in the system,\" said Trevor Power, the Australian Treasury assistant secretary. </p><h3>Not an attack on crypto</h3><p>However, Gilder clarified that CBA’s measures weren’t made to attack the industry and doesn’t necessarily reflect any wrongdoing by centralized exchanges. </p><blockquote>“It's not industry specific. It's based on data, patterns of behavior and identifying bad actors. So we do this with normal bank accounts already. So in that way, there's definitely parallels to work that we already do.”</blockquote><p>Gilder was also bullish about blockchain technology, noting that nearly every bank has established a digital assets team — a sign that “banks recognize” the need to understand the space, she said.</p><p>Digital asset lawyer Michael Bacina of Piper Alderman and chair of Blockchain Australia, who also moderated the session,  is hoping for closer collaboration between the banks and the industry to tackle the issue of scams together. </p><blockquote>\"The banks have put forward concerning figures of scams touching crypto as a payment rail in some way.\"</blockquote><p>\"It’s important to understand that data in more detail, but what is clear is that businesses in the blockchain and the crypto industry need to work collaboratively with banks and payment providers to ensure that scams are reduced as much as possible,\" he added.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Reporting from <a href=\"https://twitter.com/jessicasier?ref_src=twsrc%5Etfw\">@jessicasier</a> <a href=\"https://twitter.com/FinancialReview?ref_src=twsrc%5Etfw\">@FinancialReview</a> that <a href=\"https://twitter.com/CommBank?ref_src=twsrc%5Etfw\">@CommBank</a> have banned AUD transfers to “high-risk” crypto exchanges &amp; limited transactions with others to $10k per month, with a 24 hr delay. $700k per day leaves CBA as scammed money heading to crypto. Banks &amp; the crypto industry…</p>&mdash; Caroline Bowler (@CaroBowler) <a href=\"https://twitter.com/CaroBowler/status/1666665937133797376?ref_src=twsrc%5Etfw\">June 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The bank’s decision has continued to meet <a href=\"https://twitter.com/LindaSunshine66/status/1670275533731659776\" target=\"_blank\" rel=\"noopener nofollow\">criticism</a> from Australian crypto exchange customers.  Australian lawyer and senior research fellow at the RMIT Blockchain Innovation Hub Aaron Lane has defended the banks' actions, however.</p><blockquote>“Banks and other financial institutions are under increasing pressure to tackle the growing problem of scams involving cryptocurrency. Imposing time delays, declining transactions, and placing deposit limits are all mechanisms for banks to retake control and limit their legal and regulatory risks.”</blockquote><p>While these measures “may not be ideal” for Australian-based crypto exchanges and their customers, Lane said that a “risk-based approach is better than outright debanking.”</p><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/aussies-revealed-as-prime-targets-of-israel-crypto-scam-syndicate\"><strong>Aussies revealed as prime targets of Israel crypto scam syndicate</strong></a></p><p>According to the Australian Competition and Consumer Commission, Australians lost 221.3 million Australian dollars ($148.3 million) <a href=\"https://cointelegraph.com/news/australian-crypto-scams-increased-by-over-162-with-nearly-150m-lost\">from investment scams</a> where crypto was used as the payment method in 2022 — a massive 162.4% increase from 2021.</p><p>Power concluded that crypto remain a “significant vector” for scams in Australia, which calls on both banks and the government to clamp down on the sector.</p><p><strong><em>Magazine:</em></strong><a href=\"https://cointelegraph.com/magazine/unstable-coins-de-pegging-bank-runs-other-risks-2023/\"><strong><em> </em></strong><strong><em>Unstablecoins: Depegging, bank runs and other risks loom</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-27T05:30:54.000Z",
    "title": "HSBC Enables Bitcoin and Ethereum ETF Trading on Mobile Apps in Hong Kong",
    "url": "https://news.bitcoin.com/hsbc-enables-bitcoin-and-ethereum-etf-trading-on-mobile-apps-in-hong-kong/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/hsbc-futures-etfs-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"HSBC Enables Bitcoin and Ethereum ETF Trading on Mobile Apps in Hong Kong\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/hsbc-futures-etfs-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/hsbc-futures-etfs-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/hsbc-futures-etfs-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/hsbc-futures-etfs-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/hsbc-futures-etfs-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/hsbc-futures-etfs-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/hsbc-futures-etfs.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Banking giant HSBC has begun letting customers buy and sell bitcoin and ethereum exchange-traded funds (ETFs) that are listed on the Hong Kong stock exchange (HKEX) using its mobile apps. The stock exchange currently has three crypto futures ETFs listed. HSBC Customers Can Trade Crypto Futures ETFs Using Mobile Apps Banking giant HSBC has reportedly [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T05:37:00.000Z",
    "title": "XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?",
    "url": "https://www.cryptopolitan.com/xrp-price-prediction/",
    "description": "XRP Price Prediction 2023-2032 So LBRY lost its case against the SEC. Sad to say, the ruling still doesn&#8217;t provide regulatory clarity as to the definitive conditions (the essential ingredients) that establish an offered asset as a security. Especially when the Judge touches only on the third prong in this case. The 76-year-old Howey Test ... <a title=\"XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/xrp-price-prediction/\" aria-label=\"More on XRP Price Prediction 2023-2032 [After Lawsuit]: $1 Coming Soon?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-27T05:32:13.000Z",
    "title": "Circle Explores Expansion Opportunities in Hong Kong’s Crypto Market",
    "url": "https://www.cryptopolitan.com/circle-expansion-in-hong-kongs-crypto-market/",
    "description": "Circle Internet Financial Ltd., a leading stablecoin issuer based in the United States, is closely observing the evolving crypto regulations in Hong Kong. As the region&#8217;s new crypto rules went into effect earlier this month, Circle&#8217;s CEO, Jeremy Allaire, has expressed a strong interest in the potential expansion opportunities that Hong Kong presents. While the ... <a title=\"Circle Explores Expansion Opportunities in Hong Kong&#8217;s Crypto Market\" class=\"read-more\" href=\"https://www.cryptopolitan.com/circle-expansion-in-hong-kongs-crypto-market/\" aria-label=\"More on Circle Explores Expansion Opportunities in Hong Kong&#8217;s Crypto Market\">Read more</a>"
  }
]