[
  {
    "source": "CoinDesk",
    "date": "2024-01-31T14:00:00.000Z",
    "title": "Vibe Check: The Bullish Bounce Back: CoinDesk Indices' Todd Groth",
    "url": "https://www.coindesk.com/markets/2024/01/31/vibe-check-the-bullish-bounce-back-coindesk-indices-todd-groth/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Periodic observations and market musings from Todd Groth, Head of Research, CoinDesk Indices."
  },
  {
    "source": "Decrypt",
    "date": "2024-01-31T14:06:50.000Z",
    "title": "You Can Earn Bitcoin for Playing a Fun Mobile Word Game—Here's How Much",
    "url": "https://decrypt.co/214992/earn-bitcoin-playing-mobile-word-game",
    "description": "Word Breeze on iOS and Android presents a familiar premise, but it’s entertaining and pays out Bitcoin rewards. Should you play it?"
  },
  {
    "source": "Decrypt",
    "date": "2024-01-31T13:44:02.000Z",
    "title": "Global X Withdraws Spot Bitcoin ETF Application",
    "url": "https://decrypt.co/214991/global-x-withdraws-spot-bitcoin-etf-application",
    "description": "The ETF provider becomes the first to withdraw its application for a U.S. spot Bitcoin ETF since multiple funds were approved in January."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-01-31T14:01:00.000Z",
    "title": " How Move found new purpose after the collapse of Facebook’s stablecoin Diem ",
    "url": "https://cointelegraph.com/news/move-langauge-facebook-s-stablecoin-diem-defi",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvOTNhZGIyMzUtOTRiYy00OTcxLWIwZmItMjliN2FhMWRkYTkxLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Sam Blackshear, the creator of Move, spoke with Cointelegraph to give the inside story on the language of Aptos, Sei and Sui. </p>\n                    <p><p data-ct-non-breakable=\"true\">At Facebook, Sam Blackshear created Move, a programming language tailored specifically for blockchain applications, but Diem, the cryptocurrency powered by Move, never launched.</p><p>When lawmakers in the United States quashed Facebook’s cryptocurrency ambitions, Blackshear and others searched for new applications for the language they created. It didn’t take long to find them. Today, several successful blockchains use Move, including Aptos, Sei and Sui, the latter of which Blackshear continues to work on as chief technology officer of Mysten Labs.</p><p>Cointelegraph spoke with Blackshear to discover why the end of Diem was just the beginning for Move and why it is a better choice for building blockchains than Solidity, Rust or other preexisting languages:</p><p><a href=\"https://cointelegraph.com/news/move-langauge-facebook-s-stablecoin-diem-defi\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-31T13:50:59.000Z",
    "title": "Morgan Creek Capital CEO Mark Yusko Foresees Bitcoin’s Explosive Rally to $100,000 by 2024 End",
    "url": "https://www.cryptoglobe.com/latest/2024/01/morgan-creek-capital-ceo-mark-yusko-foresees-bitcoins-explosive-rally-to-100000-by-2024-end/",
    "description": "In a recent interview on the Thinking Crypto channel, Mark Yusko, the founder and CEO of Morgan Creek Capital, shared his optimistic forecast for Bitcoin (BTC), predicting a substantial rally for the cryptocurrency in the near future. Yusko believes that Bitcoin could reach or even surpass a value of $100,000 by the end of 2024, […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-31T14:08:21.000Z",
    "title": "UK government addresses privacy concerns in digital pound consultation",
    "url": "https://www.cryptopolitan.com/uk-government-addresses-privacy-concerns/",
    "description": "The United Kingdom&#8217;s efforts to address privacy concerns surrounding the proposed digital pound have garnered positive responses from experts in the crypto industry. The results of the highly anticipated UK consultation on the digital pound were released by the Bank of England (BoE) and the Treasury, revealing that while many respondents welcomed the proposed design, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-31T14:04:45.000Z",
    "title": "Marketing Giant Embraces AI for Future Growth in 2024",
    "url": "https://www.cryptopolitan.com/marketing-giant-embraces-ai/",
    "description": "Discover the transformative AI-driven growth strategy for the marketing giant WPP, focusing on creativity and technology. "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-31T14:00:28.000Z",
    "title": "Deepfake Fraud Among Emerging Risks for Insurance Industry, Says Kennedys Report",
    "url": "https://www.cryptopolitan.com/deepfake-fraud-for-insurance-industry/",
    "description": "Global law firm Kennedys has shed light on the potential benefits and risks that artificial intelligence (AI) brings to the insurance sector in its Global Forecast 2024: Evolving Insurance Risks report. While AI offers advantages such as improved risk assessment and streamlined claims processing, it also presents novel challenges. One of the highlighted risks is [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-31T14:00:00.000Z",
    "title": "Bitcoin Targets $48K, Analyst Cautions Pre-Halving; Chainlink and Borroe Finance Eye Major Growth",
    "url": "https://www.cryptopolitan.com/bitcoin-targets-48k-analyst-cautions-pre-halving-chainlink-and-borroe-finance-eye-major-growth/",
    "description": "In the dynamic and often unpredictable world of cryptocurrencies, Bitcoin&#8217;s latest buzz is a projected rally to $48,000 by April 2024, as per a Crypto Twitter analyst. Meanwhile, platforms like Chainlink and Borroe Finance, built on the Polygon blockchain, are eyeing significant growth in this shifting landscape. &#62;&#62;BUY $ROE TOKENS NOW&#60;&#60; Bitcoin&#8217;s Halving Horoscope The [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-31T13:41:33.000Z",
    "title": "Composable Options Protocol Ithaca Finance Announces $2.5M in Pre-Seed Funding",
    "url": "https://www.cryptopolitan.com/composable-options-protocol-ithaca-finance-announces-2-5m-in-pre-seed-funding/",
    "description": "Ithaca Finance, a new project focused on decentralized options trading, has emerged from stealth mode with the announcement of pre-seed funding and an invite-only mainnet launch on Arbitrum. $2.5 million will be used to develop the Ithaca Protocol for composable, non-custodial trading of on-chain options on Arbitrum. Ithaca’s funding news comes as VC interest in [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-31T13:57:47.000Z",
    "title": "Why the Experts Say Revolutionary Pushd (PUSHD) Will Hit 20x and Why Investors Move from Ethereum (ETH) and Ripple (XRP) into Presale",
    "url": "https://nulltx.com/why-the-experts-say-revolutionary-pushd-pushd-will-hit-20x-and-why-investors-move-from-ethereum-eth-and-ripple-xrp-into-presale/",
    "description": "The Pushd (PUSHD) presale has not only hit over 24,0000 registrations but also garnered a strong community. Pushd (PUSHD) is just about the best investment for investors in 2024 and any investor hungry for profits must key into the presale. Despite being new, experts believe Pushd (PUSHD) is the solution [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-31T13:55:56.000Z",
    "title": "Why are investors rushing into Kelexo (KLXO)? Analyst predicts Tron (TRX) and Ripple (XRP) to be overtaken",
    "url": "https://nulltx.com/why-are-investors-rushing-into-kelexo-klxo-analyst-predicts-tron-trx-and-ripple-xrp-to-be-overtaken/",
    "description": "Imagine having millions in the bank, yet you have no access to it and then you begin to watch it dwindle down in value. This is the dilemma of Tron (TRX) and Ripple (XRP) holders and after a loss like that of 2023, Investors are looking for a rising star [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2024-01-31T13:51:41.000Z",
    "title": "Meme Moguls Presale Advances To Stage 5, Analyst Michaël Van De Poppe Bullish for Arbitrum, Celestia Trades in the Green",
    "url": "https://nulltx.com/meme-moguls-presale-advances-to-stage-5-analyst-michael-van-de-poppe-bullish-for-arbitrum-celestia-trades-in-the-green/",
    "description": "Meme Moguls (MGLS) has recently made headlines as it entered Stage 5 of its presale. With close to $2M raised and 3,700 holders, it is clear that interest in this DeFi project is rising. Some analysts have even pegged it as the next 100x meme coin in 2024. Meanwhile, Arbitrum [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-31T13:45:00.000Z",
    "title": "XRP and Cardano struggling, Borroe Finance rallying in presale",
    "url": "https://crypto.news/xrp-and-cardano-struggling-borroe-finance-rallying-in-presale/",
    "description": "XRP and Cardano prices are still under pressure. Meanwhile, Borroe Finance is trending higher in the ongoing presale"
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-31T14:00:14.000Z",
    "title": "Bitcoin Miner Selloff Poses “Negligible Impact”, Quant Argues",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-miner-selloff-negligible-impact-quant/",
    "description": "On-chain data shows the Bitcoin miners have been selling recently, but this quant has argued that this selloff shouldn&#8217;t have much impact on the market. Bitcoin Miner Reserve Has Registered A Decline Recently In a CryptoQuant Quicktake post, an analyst discussed the latest selling pressure that the miners have been putting on the market. The indicator of interest here is the &#8220;miner reserve,&#8221; which keeps track of the total amount of Bitcoin that the miners combined hold in their wallets right now. This metric can naturally provide information about the collective behavior of these chain validators. Generally, the miners withdraw their coins from their reserve when they want to sell, so a decline in the indicator can potentially have bearish consequences for the asset. Related Reading: These Crypto Asset Classes Could Be Future Market Drivers: Santiment A rise in the metric, on the other hand, may be bullish for the cryptocurrency&#8217;s price as it suggests the miners as a whole are in accumulation mode at the moment. Now, here is a chart that shows the trend in the Bitcoin miner reserve over the past year: The value of the metric seems to have been heading down in recent days &#124; Source: CryptoQuant As displayed in the above graph, the Bitcoin miner reserve has been on its way down since October, implying that this cohort has withdrawn a net amount of BTC from their wallets during this period. This latest selloff from the miners has recently been a topic in the community, with many speculating about the possible bearish impact arising from it. The quant has a different opinion on the matter, however. &#8220;The sell-off of Bitcoin reserves by miners, as discussed on X and various portals, is unfounded,&#8221; explains the analyst. To back this claim, the quant has pointed out the exact numbers involved here. Before this selling started, the miner reserve had a value of around 1,84,997 BTC. Following the decline that the indicator has witnessed since then, the miners now hold about 1,833,222 BTC. This represents a decrease of 12,755 BTC, which, although substantial on its own, doesn&#8217;t seem too large in the grand scheme of things, especially considering the size of the miner reserve itself. &#8220;The minimal amount of bitcoin sold has negligible impact on the market,&#8221; notes the analyst. The trend in the miner inflows and outflows over the past couple of months &#124; Source: CryptoQuant The above chart shows the data for the Bitcoin inflows and outflows being made by the miners. There have indeed been outflows taking place recently, which is why there has been talk of a selloff. Related Reading: Bitcoin Rally Still Has Some Legs Left, Santiment Explains Why At the same time, the inflow transaction volume has also been at significant levels, making up for these outflows. This is the reason for the relatively small net decrease in the total miner reserve. BTC Price Bitcoin had recovered beyond the $43,000 mark earlier, but the asset has seen a setback during the past day as it has slipped back towards $42,500. Looks like the price of the coin has retraced some of its recent recovery &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-31T14:00:00.000Z",
    "title": "Terraform Says Bankruptcy Case Vital in Appealing SEC’s Fraud Lawsuit",
    "url": "https://coinedition.com/terraform-says-bankruptcy-case-vital-in-appealing-secs-fraud-lawsuit/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/10/Terra_CEO_Do_Kwon_faces_lawsuit_in_Singapore_next_hearing_on_Wednesday.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Terraform Says Bankruptcy Case Vital in Appealing SEC’s Fraud Lawsuit\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/10/Terra_CEO_Do_Kwon_faces_lawsuit_in_Singapore_next_hearing_on_Wednesday.jpg 730w, https://coinedition.com/wp-content/uploads/2022/10/Terra_CEO_Do_Kwon_faces_lawsuit_in_Singapore_next_hearing_on_Wednesday-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/10/Terra_CEO_Do_Kwon_faces_lawsuit_in_Singapore_next_hearing_on_Wednesday-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/10/Terra_CEO_Do_Kwon_faces_lawsuit_in_Singapore_next_hearing_on_Wednesday-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/10/Terra_CEO_Do_Kwon_faces_lawsuit_in_Singapore_next_hearing_on_Wednesday-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Terraforms said bankruptcy proceedings will help appeal the SEC’s lawsuit. Terraforms filed for bankruptcy last week and will have its first day of hearing today. The company can avoid costs by relying on protections offered under the Chapter 11 proceedings. Ahead of the commencement of its Chapter 11 proceedings, troubled cryptocurrency firm Terraform Labs revealed [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/terraform-says-bankruptcy-case-vital-in-appealing-secs-fraud-lawsuit/\">Terraform Says Bankruptcy Case Vital in Appealing SEC’s Fraud Lawsuit</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]