[
  {
    "source": "CoinDesk",
    "date": "2023-06-05T22:29:41.000Z",
    "title": "Crypto Traders Suffer $320M Losses in Liquidations as SEC Lawsuit Against Binance Spurs Market Plunge",
    "url": "https://www.coindesk.com/markets/2023/06/05/crypto-traders-suffer-320m-losses-in-liquidations-as-sec-lawsuit-against-binance-spurs-market-plunge/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Cryptocurrency prices nosedived Monday as the U.S. Securities and Exchange Commission (SEC) sued the crypto exchange and its chief executive for multiple federal securities law violations."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-05T22:37:43.000Z",
    "title": "The Ethereum Question: Why does the SEC avoid taking action against Ethereum when all else are fair game?",
    "url": "https://cryptoslate.com/the-ethereum-question-why-does-the-sec-avoid-taking-action-against-ethereum-when-all-else-are-fair-game/",
    "description": "<p>The U.S. Securities and Exchange Commission (SEC) filed suit against Binance today in a move that has rocked the cryptocurrency industry.  The complaint notably includes language in which the SEC clearly elucidates that it considers many of the tokens that traded on Binance to be unregistered securities and lays out its case against several it [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/the-ethereum-question-why-does-the-sec-avoid-taking-action-against-ethereum-when-all-else-are-fair-game/\">The Ethereum Question: Why does the SEC avoid taking action against Ethereum when all else are fair game?</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-06-05T22:30:00.000Z",
    "title": "$XRP Investment Product Inflows Stand Out as Crypto Outflows Continue for Seventh Week",
    "url": "https://www.cryptoglobe.com/latest/2023/06/xrp-investment-product-inflows-stand-out-as-crypto-outflows-continue-for-seventh-week/",
    "description": "Digital asset investment products have seen outflows totaling $62 million over the last week, marking the seventh consecutive week of outflows, to a total of $329 million or about 1% of total assets under management. Notably, $XRP investment products stood out as inflows surged. The sequence of outflows is now matching a similar trend seen […]\n"
  }
]