[
  {
    "source": "Cointelegraph",
    "date": "2023-11-29T05:17:00.000Z",
    "title": "Cristiano Ronaldo sued for promoting Binance, unregistered securities",
    "url": "http://cointelegraph.com/news/cristiano-ronaldo-class-action-lawsuit-over-binance-promotion",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/89c64f96-3d3c-4637-803b-426e10b0b410.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The soccer star’s Binance-tied NFTs allegedly promoted investments in unregistered securities on the crypto exchange.</p>\n                    <p><p>Pro-soccer star Cristiano Ronaldo has been hit with a proposed class-action lawsuit from plaintiffs claiming they suffered losses from his promotion of the now-legally embroiled crypto exchange Binance.</p><p>A Nov. 27 filing to a Florida District Court claimed Ronaldo “promoted, assisted in, and/or actively participated in the offer and sale of unregistered securities in coordination with Binance.”</p><p>Binance entered a multi-year partnership with Ronaldo in mid-2022 to promote a series of his own nonfungible tokens (NFT), of which he has at least three collections tied to Binance.</p><p>The complaint claims users who signed up for Ronaldo’s NFTs were more likely to use Binance for other purposes — including investing in what they claimed were unregistered securities, including Binance’s BNB (<a href=\"https://cointelegraph.com/binance-coin-price-index\">BNB</a>) and its crypto yield programs.</p><blockquote>“Ronaldo’s promotions solicited or assisted Binance in soliciting investments in unregistered securities by encouraging his millions of followers, fans, and supporters to invest with the Binance platform.”</blockquote><p>Ronaldo was a key part of Binance’s growing popularity due to his influence and reach, with 850 million followers across social media, says the complaint. They allege his NFT sales were “incredibly successful” at promoting the exchange, with a 500% increase in searches for “Binance” the week following the initial sale.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Cooking something up with <a href=\"https://twitter.com/binance?ref_src=twsrc%5Etfw\">@binance</a> <a href=\"https://t.co/FMAP5GAdxE\">https://t.co/FMAP5GAdxE</a></p>&mdash; Cristiano Ronaldo (@Cristiano) <a href=\"https://twitter.com/Cristiano/status/1729477584977600615?ref_src=twsrc%5Etfw\">November 28, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p>The suit alleges Ronaldo knew or should have known “about Binance selling unregistered crypto securities” as he has “investment experience and vast resources to obtain outside advisers.”</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/binance-us-plea-deal-crypto-adoption\"><strong><em>Why Binance’s US plea deal could be positive for crypto adoption</em></strong></a></p><p>The suit cited Securities and Exchange Commission guidance, <a href=\"https://cointelegraph.com/news/sec-chair-issues-warning-to-celebrities-promoting-crypto-amid-latest-enforcement-action\">which warned celebrities</a> of the need to disclose payments received for promoting cryptocurrencies — which the complaint claims Ronaldo didn’t do.</p><p>The class action plaintiffs are Michael Sizemore, Mikey Vongdara and Gordon Lewis, who seek damages and funds to cover legal fees.</p><p>Meanwhile, Binance and founder Changpeng “CZ” Zhao is facing their own legal woes, pleading guilty and paying a $4.3 billion settlement to the United States on money laundering charges and running an unregistered money-transmitting business.</p><p>Zhao stepped down as CEO and <a href=\"https://cointelegraph.com/news/judge-stays-decision-changpeng-zhao-leave-us\">faces up to 18 months in prison</a>. Binance agreed to up to five years of Justice Department and Treasury compliance monitoring. </p><p>The SEC has sued Binance claiming — among other charges — that it sold unregistered securities and is reportedly <a href=\"https://cointelegraph.com/news/sec-looking-evidence-potential-fraud-binance-us-changpeng-zhao\">investigating if Binance</a> misappropriated customer funds.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/diewiththemostlikes-superrare-dmt-hellboy-nft-creator/\"><strong><em>NFT Creator: DMT and a Hellboy outfit — How diewiththemostlikes got on SuperRare</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  }
]