[
  {
    "source": "CryptoGlobe",
    "date": "2023-12-21T23:55:00.000Z",
    "title": "Shiba Inu’s Burn Rate Skyrockets 28,000% Amid Plans to Launch .Shib Domains",
    "url": "https://www.cryptoglobe.com/latest/2023/12/shiba-inus-burn-rate-skyrockets-28000-amid-plans-to-launch-shib-domains/",
    "description": "The burn rate of the meme-inspired cryptocurrency Shiba Inu ($SHIB) has recently surged by more than 28,000% over just 24 hours after more than 6.3 million SHIB tokens were sent to dead wallet addresses that no one controls, effectively removing them from circulation. According to data from Shiba Inu burn tracking platform Shibburn, over the […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-21T23:56:12.000Z",
    "title": "SEC engages in joint conference call with Bitcoin ETF applicants amid approval speculations",
    "url": "https://www.cryptopolitan.com/sec-engages-call-with-bitcoin-etf-applicants/",
    "description": "In a recent development, the U.S. Securities and Exchange Commission (SEC) is reportedly in discussions with multiple applicants seeking approval for spot Bitcoin exchange-traded funds (ETFs). FOX Business correspondent Charles Gasparino revealed insider information, stating that the SEC is holding a rare joint conference call with prospective Bitcoin ETF filers. Unveiling SEC&#8217;s evaluation criteria During [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-22T00:00:37.000Z",
    "title": "XRP Price Forecast: Wave 5 Signals Impending Supercharged Growth To $13 By 2024",
    "url": "https://www.newsbtc.com/xrp-news/xrp-price-forecast-wave-5-signals-impending-supercharged-growth-to-13-by-2024/",
    "description": "XRP price has recently demonstrated a sideways price action, deviating from the overall trend witnessed across the cryptocurrency market and altcoins.  Despite a modest 2% growth in the past 30 days, with prices ranging between $0.6427 and $0.5994, a crypto analyst operating under the pseudonym James Crypto has made a bold prediction based on Elliott Wave Theory&#8217;s interpretation of XRP&#8217;s monthly chart.  Grand 5th Wave And Potential Rally For XRP Price James Crypto points to an intriguing possibility of XRP price entering a grand 5th wave, drawing attention to the extended durations of Wave 1 and Wave 3.  The Elliott Wave Theory, developed by Ralph Nelson Elliott in the 1930s, is a technical analysis tool widely used to forecast future price movements in financial markets.  The theory suggests that price movements unfold in recurring wave patterns, which can provide insights into potential future trends.  According to the theory, a complete market cycle consists of five waves, with three impulse waves (1, 3, and 5) and two corrective waves (2 and 4). The fifth and final wave is often associated with a significant price surge before a potential reversal or consolidation. Related Reading: Shiba Inu Eyes $0.00002 As Shibarium Marks Momentous Milestone James Crypto&#8217;s analysis focuses on XRP&#8217;s monthly chart, which provides a broader perspective on the asset&#8217;s price movements.  The extended duration of Wave 1 (20 weeks) and Wave 3 (spanning over 40 weeks) caught the analyst&#8217;s attention. By extrapolating this trend, the theory suggests the possibility of a 60-week Wave 5, which could mark a substantial price rally for XRP. Should XRP price follow the projected Elliott Wave pattern, James Crypto&#8217;s forecast points to a supercycle top expected to occur in March to April 2024. The target price range for XRP during this period is estimated to be between $5 and $13.  Struggles Amidst Price Declines Trading at $0.6147, XRP has experienced a decline of 0.5%, 1.4%, and 4.3% over the past 24 hours, seven days, and fourteen days, respectively. These downward trends highlight the token&#8217;s current lack of bullish momentum and catalyst. CoinGlass&#8217; liquidation heatmap indicates a critical juncture for XRP&#8217;s price, as significant leveraged positions exist on both sides of the market. The heatmap reveals notable liquidations at the $0.6284 and $0.6347 levels, with the largest amount observed at $0.5960 over the past three days. Considering these developments, XRP may initially break through the long liquidation level before experiencing another upward movement to bolster much-needed bullish momentum.  However, given the unpredictable nature of volatility and price actions, a short squeeze could potentially occur first, temporarily driving the XRP price above its nearest resistance levels. Related Reading: Renewed Hope For Crypto: 2023 Sets The Stage For A Monumental 2024 The outcome remains uncertain as to which side will yield first and what additional catalysts may contribute to a price surge for XRP, aligning it with the overall market trend of gains as we approach the end of the year. Featured image from Shutterstock, chart from TradingView.com "
  }
]