[
  {
    "source": "CoinDesk",
    "date": "2023-09-19T16:00:37.000Z",
    "title": "Appeal Court Punts on Bankman-Fried's Bid to Secure Release from Jail",
    "url": "https://www.coindesk.com/policy/2023/09/19/appeal-court-punts-on-bankman-frieds-bid-to-secure-release-from-jail/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The one-time crypto exchange executive has made several arguments to get out of jail before his trial."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-19T15:54:39.000Z",
    "title": "Judges weigh early release for Sam Bankman-Fried as lawyers push First Amendment issues: Report",
    "url": "https://cointelegraph.com/news/judges-weigh-early-release-sam-bankman-fried-lawyers-push-first-amendment",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/b79a2d90-6581-475e-80b1-f78834b65e9f.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A panel of three judges at the 2nd U.S. Circuit Court of Appeals in New York reportedly will consider requests from Sam Bankman-Fried’s lawyers for early release from jail.</p>\n                    <p><p>A three-judge panel from the United States Court of Appeals for the Second Circuit has reportedly taken arguments from lawyers representing former FTX CEO <a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/sam-bankman-fried-and-caroline-ellison\">Sam Bankman-Fried</a> (SBF) under advisement in considering releasing him from jail prior to his October trial. </p><p>SBF's defense team and the U.S. Attorney's office were each given roughly five minutes to argue before a panel of judges on Sept. 19. One of the judges reportedly <a href=\"https://twitter.com/innercitypress/status/1704150018662211862\" target=\"_blank\" rel=\"noopener nofollow\">claimed</a> SBF's legal team's First Amendment argument \"has no play anymore\" based on Bankman-Fried's alleged attempts to intimidate witnesses including Caroline Ellison, the former CEO of Alameda Research.</p><p>Lawyers representing Bankman-Fried pushed for release due to the need for Internet access in preparation for trial,  also claiming the U.S. District Court \"erred\" in denying their First Amendment arguments for release. Bankman-Fried previously admitted to releasing Ellison's private journals to a New York Times reporter, resulting in some of its contents being published. </p><p>Assistant U.S. Attorney Danielle Sassoon reportedly acknowledged \"there have been some issues with the Internet\" during SBF's confinement at the Metropolitan Detention Center in Brooklyn but suggested he had had time to prepare his case.</p><p>\"The incident with Ms. Ellison shows an intent to interfere with a fair trial,\" said Sassoon. \"The judge was correct to say the 1st Amendment had nothing to do with it. It was tampering. Counsel does not dispute that the content put Ms. Ellison in an unfavorable light.\"</p><p>Bankman-Fried has argued <a href=\"https://cointelegraph.com/news/sam-bankman-fried-lawyers-push-temporary-release-object-prosecutors-proposed-deal\">his time in jail</a> violated his First Amendment rights and impaired his ability to properly prepare for his trial, scheduled to begin on Oct. 3. A judge <a href=\"https://cointelegraph.com/news/appellate-judge-denies-sam-bankman-fried-request-immediate-release\">denied his lawyers' initial appeal</a> for release on Sept. 6, prompting the move to the three-judge panel. It's unclear when the panel will reach a decision on the former FTX CEO's release, likely one of his last opportunities to be freed ahead of trial.</p><p>The October trial will be the first of two for the former FTX CEO. The first trial will deal with seven fraud charges related to his <a href=\"https://cointelegraph.com/news/sec-charges-ftx-ceo-sbf-for-defrauding-investors-a-day-after-the-arrest\">management of user funds</a> at crypto exchange FTX and Alameda. The second trial, expected to start in March 2024, deals with five additional criminal charges. </p><p class=\"post-content__disclaimer\">This is a developing story, and further information will be added as it becomes available.\n</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-09-19T16:00:44.000Z",
    "title": "Bitcoin Shatters Records With Over 703,000 Transactions Confirmed in a Single Day as Ordinal Inscriptions Soar ",
    "url": "https://news.bitcoin.com/bitcoin-shatters-records-with-over-703000-transactions-confirmed-in-a-single-day-as-ordinal-inscriptions-soar/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/txs-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin Shatters Records With Over 703,000 Transactions Confirmed in a Single Day as Ordinal Inscriptions Soar \" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/09/txs-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/txs-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/txs-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/txs-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/txs-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/txs-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/09/txs.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />The count of Bitcoin ordinal inscriptions is on an upward trajectory, with the tally now eclipsing a staggering 33 million. Additionally, a milestone was achieved on September 15, 2023, when the Bitcoin blockchain set a new record by registering an astonishing 440,760 inscriptions in a single day, out of a total of 703,692 transactions confirmed [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-19T15:42:11.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-09-19T16:05:38.000Z",
    "title": "Dogelon Mars: The Fastest Rising Asset In Crypto",
    "url": "https://nulltx.com/dogelon-mars-the-fastest-rising-asset-in-crypto/",
    "description": "Dogelon Mars (ELON) is a meme coin that has been gaining popularity in recent months. The token is named after the dog of Elon Musk, Dogecoin co-founder Billy Markus, and Dogecoin mascot Floki Inu. ELON is the fastest rising asset in crypto, ahead of Bitcoin (BTC), Chainlink (LINK), and Bluzelle (BLZ), in terms of discussion [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-19T16:07:39.000Z",
    "title": "Nexera Exchange unveils on-chain limit order book",
    "url": "https://crypto.news/nexera-exchange-unveils-on-chain-limit-order-book/",
    "description": "Nexera Exchange, a decentralized exchange (DEX) by AllianceBlock, has unveiled its first trading feature, an on-chain limit order book"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-19T15:53:12.000Z",
    "title": "Hong Kong will potentially launch stablecoin regulations by mid-2024",
    "url": "https://crypto.news/hong-kong-will-potentially-launch-stablecoin-regulations-by-mid-2024/",
    "description": "Hong Kong is aiming to finalize stablecoin regulations by mid-2024, highlighting the territory&#8217;s contrasting approach to mainland China.&#160; Legislative Council member Duncan Chiu has signaled that Hong Kong is on track to finalize its stablecoin regulations by mid-2024. The announcement&#8230;"
  },
  {
    "source": "BTCManager",
    "date": "2023-09-19T15:43:07.000Z",
    "title": "Circle announces USDC stablecoin is now available on Polkadot Asset Hub",
    "url": "https://crypto.news/circle-announces-usdc-stablecoin-is-now-available-on-polkadot-asset-hub/",
    "description": "Circle, the issuer of USDC, has announced the official launch of USD Coin on the Polkadot network as of Sept. 19. Following the announcement, developers and users can now readily access Polkadot USDC and transfer to Polkadot parachains through the&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-19T16:00:35.000Z",
    "title": "Shiba Inu Team Member Reveals What Investors Should Do If They Want SHIB Burns",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-shib-burns/",
    "description": "A prominent Shiba Inu team member &#8220;Lucie&#8221; has shared insights on the highly anticipated Shiba Inu token burn through Shibarium, Shiba Inu&#8217;s Layer 2 blockchain, and has revealed what investors should do if they want the Shiba Inu token burns. Shiba Inu Team Member Tells Investors What To Do The content marketing specialist for Shiba Inu took to X on Monday, September 18, 2023, to address the Shiba Inu token burn questions coming from the community saying that SHIB burns are set per transaction, not based on tweets about burns. Related Reading: Ripple CTO Explains Company’s Stance On Debunking Outrageous XRP Price Predictions Lucie told the community that when will Shibarium initiate the SHIB burn is the wrong question and “The real question is, ‘when will you all migrate from exchanges and start using Shibarium?’” When will Shibarium initiate the SHIB burn?&#8221; Wrong question ☓ The real question is, &#8220;When will you all migrate from exchanges and start using Shibarium?&#8221; (hello DEFI, remember bankrupted exchanges like FTX) The burns are set per transaction, not based on tweets about burns.… — 𝐋𝐔𝐂𝐈𝐄 &#124; ✨Shibarium✨ (@LucieSHIB) September 18, 2023 Lucie further explained that the Shiba Inu token burns through Shibarium is a collective effort from both the community and the Devs since the burns are based on transaction activity and real engagement from within the platform. She told the community that expecting burns to happen solely through transactions without active community participation is unrealistic. The marketing expert went on to highlight the security features of choosing Shibarium as an alternative to centralized crypto exchanges. She guaranteed SHIB holders that assets stored on the platform are just as safe as they would be on centralized crypto exchanges.  She also stated that centralized crypto exchanges can be fragile using the case of the bankrupted centralized crypto platform FTX to back up her claims. So far, Lucie has urged the millions of SHIB holders to support this movement using Shibarium as an alternative to centralized crypto exchanges since each transaction on the platform contributes to the SHIB token burns.  She also added that transaction fees are pretty low on the platform, but might increase in the future along with the higher traffic, which would translate to a higher number of SHIB being burned. SHIB price sees a slight recovery to $0.00000738 &#124; Source: SHIBUSD on Tradingview.com Lucie also stretched her opinions to one of the most popular NFT marketplaces Opensea, inviting them to consider integrating Shibarium on the platform. Shibarium is a layer 2 blockchain built on the Ethereum network. It is a decentralized finance (DeFi) platform that was designed to serve as an alternative to centralized crypto exchanges which aims to provide a more sustainable and scalable infrastructure for Shiba Inu transactions. SHIB Price Predictions Following Shibarium&#8217;s Success For years now, Shiba Inu has been one of the most notable cryptocurrencies in the crypto market. The famous meme coin is likely to experience an upward trajectory if Shibarium becomes a success since it could catalyze a larger adoption and popularity of the SHIB tokens. Related Reading: Incoming Milestone Could Be Very Bullish For XRP Price, Here’s Why SHIB token is expected to reach $0.00001038 from its current price of $0.0000073 by the end of 2023 with expectations of another crypto market rally. However, with the success of Shibarium and the new development on the platform, the SHIB token could grow up to $0.000050 by the end of 2023. Nevertheless, if the SHIB token manages to maintain this trajectory, during the next bull market the token could beat its all-time high price of $0.00008845 achieved in the 2021 bull market. Featured image from CoinMarketCap, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-19T16:00:49.000Z",
    "title": "Between Stellar’s (XLM) Steadiness, Solana’s (SOL) Surge & VC Spectra’s (SPCT) Stunning Presale, Who Leads?",
    "url": "https://www.crypto-news-flash.com/between-stellars-xlm-steadiness-solanas-sol-surge-vc-spectras-spct-stunning-presale-who-leads/?utm_source=rss&utm_medium=rss&utm_campaign=between-stellars-xlm-steadiness-solanas-sol-surge-vc-spectras-spct-stunning-presale-who-leads",
    "description": "<img width=\"512\" height=\"325\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-94.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-94.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-94-300x190.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-94-312x198.jpg 312w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-94-163x102.jpg 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The wider market slump has brought about price changes across the board. Stellar (XLM) has turned bearish despite recent partnerships. Solana (SOL) surged following a partnership with Visa, while VC Spectra (SPCT) has emerged as the best ICO in the crypto space. The new market entrant offers current buyers a 142% ROI before it is [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-19T16:00:46.000Z",
    "title": "After XRP and BNB’s Prices Dive, Focus on SUI & $ROE Price Surges",
    "url": "https://www.crypto-news-flash.com/after-xrp-and-bnbs-prices-dive-focus-on-sui-roe-price-surges/?utm_source=rss&utm_medium=rss&utm_campaign=after-xrp-and-bnbs-prices-dive-focus-on-sui-roe-price-surges",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-87.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-87.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-87-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-87-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the ever-evolving landscape of cryptocurrencies, the quest for the best crypto investment is an ongoing journey. Recent market fluctuations, notably the declines in the prices of XRP and BNB, have shaken investors&#8217; confidence. Amidst this turbulence, two promising assets, SUI and Borroe.Finance ($ROE), have captured the attention of the crypto community, emerging as potential [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-19T16:00:24.000Z",
    "title": "Bitcoin Spark’s Competitive Edge Over Shiba Inu and Dogecoin",
    "url": "https://www.crypto-news-flash.com/bitcoin-sparks-competitive-edge-over-shiba-inu-and-dogecoin/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-sparks-competitive-edge-over-shiba-inu-and-dogecoin",
    "description": "<img width=\"512\" height=\"356\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-114.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-114.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-114-300x209.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Cryptocurrencies have made headlines with countless innovations aiming to change how we see our finances. Amongst the most notable are the meme-inspired cryptocurrencies Shiba Inu and Dogecoin. These digital assets have gained attention, but Bitcoin Spark is a new contender in the space. In this article, we will explore Bitcoin Sparks&#8217; unique features and how [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-09-19T15:50:16.000Z",
    "title": "Ripple’s $100M SEC Legal Battle: Garlinghouse Speaks Out",
    "url": "https://www.crypto-news-flash.com/ripples-100m-sec-legal-battle-garlinghouse-speaks-out/?utm_source=rss&utm_medium=rss&utm_campaign=ripples-100m-sec-legal-battle-garlinghouse-speaks-out",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"XRP Lawyer John Deaton\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/09/unnamed-11-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Ripple&#8217;s legal defense against the SEC has cost the company over $100 million to date. CEO Brad Garlinghouse remains optimistic about the case&#8217;s outcome, citing the judge&#8217;s remarks that XRP is not a security. Ripple Faces the Regulator: Insights from the Frontline Ripple, the blockchain heavyweight, has found itself entrenched in a courtroom tussle with [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-19T16:08:00.000Z",
    "title": "Hodlnaut Rejects OPNX’s $30 Million Token Offer in Takeover Bid",
    "url": "https://coinedition.com/hodlnaut-rejects-opnxs-30-million-token-offer-in-takeover-bid/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2022/08/Hodlnaut_Could_Collapse_If_It_Complies_With_Singaporean_Police-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Hodlnaut_Could_Collapse_If_It_Complies_With_Singaporean_Police\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2022/08/Hodlnaut_Could_Collapse_If_It_Complies_With_Singaporean_Police-2.jpg 730w, https://coinedition.com/wp-content/uploads/2022/08/Hodlnaut_Could_Collapse_If_It_Complies_With_Singaporean_Police-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/08/Hodlnaut_Could_Collapse_If_It_Complies_With_Singaporean_Police-2-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/08/Hodlnaut_Could_Collapse_If_It_Complies_With_Singaporean_Police-2-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/08/Hodlnaut_Could_Collapse_If_It_Complies_With_Singaporean_Police-2-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The interim judicial managers of Hodlnaut, the embattled crypto lender, have opposed the proposed terms of a takeover bid made by OPNX, a digital asset exchange platform. OPNX was created by the founders of Three Arrows Capital, a failed hedge fund. OPNX has offered a $30 million capital injection in FLEX digital tokens, after which [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/hodlnaut-rejects-opnxs-30-million-token-offer-in-takeover-bid/\">Hodlnaut Rejects OPNX&#8217;s $30 Million Token Offer in Takeover Bid</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]