[
  {
    "source": "Decrypt",
    "date": "2023-12-15T00:46:02.000Z",
    "title": "Vatican Says AI Is the ‘Highest-Stakes Gamble of Our Future’",
    "url": "https://decrypt.co/209925/pope-declares-ai-the-highest-stakes-gamble-of-our-future",
    "description": "Pope Francis urged global leaders to work together to adopt a binding international treaty that regulates AI."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-12-15T01:08:31.000Z",
    "title": "Ethernal Labs and Ethernity Collaborate with Bruce Lee Family Companies to Launch \"Bruce Lee: The Year of The Dragon\" Digital Collectibles Collection",
    "url": "https://cryptodaily.co.uk/2023/12/ethernal-labs-and-ethernity-collaborate-with-bruce-lee-family-companies-to-launch-bruce-lee-the-year-of-the-dragon-digital-collectibles-collection",
    "description": "Ethernal Labs and Ethernity Collaborate with Bruce Lee Family Companies to Launch \"Bruce Lee: The Year of The Dragon\" Digital Collectibles Collection"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-15T01:00:03.000Z",
    "title": "Bitwise Unveils 10 Crypto Predictions for 2024: Bitcoin to Surpass $80,000, Spot Bitcoin ETFs Could Capture $72 Billion",
    "url": "https://news.bitcoin.com/bitwise-unveils-10-crypto-predictions-for-2024-bitcoin-to-surpass-80000-spot-bitcoin-etfs-could-capture-72-billion/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/vaneck-bitcoin-ath-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitwise Unveils 10 Crypto Predictions for 2024: Bitcoin to Surpass $80,000, Spot Bitcoin ETFs Could Capture $72 Billion\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/vaneck-bitcoin-ath-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/vaneck-bitcoin-ath-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/vaneck-bitcoin-ath-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/vaneck-bitcoin-ath-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/vaneck-bitcoin-ath-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/vaneck-bitcoin-ath-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/vaneck-bitcoin-ath.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Crypto asset manager Bitwise has unveiled 10 crypto predictions for 2024 that include bitcoin trading over $80,000, setting a new all-time high. The firm also estimates that spot bitcoin exchange-traded funds (ETFs) could capture $72 billion in assets under management. In addition, the asset manager expects Ethereum revenue to more than double to $5 billion [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-15T01:08:41.000Z",
    "title": "Ethernal Labs and Ethernity Collaborate with Bruce Lee Family Companies to Launch “Bruce Lee: The Year of The Dragon” Digital Collectibles Collection",
    "url": "https://www.cryptopolitan.com/ethernal-labs-and-ethernity-collaborate-with-bruce-lee-family-companies-to-launch-bruce-lee-the-year-of-the-dragon-digital-collectibles-collection/",
    "description": "Los Angeles, United States, December 15th, 2023, Chainwire In a landmark collaboration, Ethernal Labs, together with the Bruce Lee Family Companies and Ethernity, is proud to announce the launch of the &#8220;Bruce Lee: The Year of The Dragon&#8221; digital collectibles collection. This innovative collection, featuring five unique digital statues, is set to debut on December [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-15T01:00:47.000Z",
    "title": "DeFi Researcher Questions Injective Protocol’s Appeal: Is INJ Overvalued?",
    "url": "https://www.newsbtc.com/news/defi/researcher-injective-protocol-appeal-inj-overvalued/",
    "description": "Thor Hartvigsen, a data-driven decentralized finance (DeFi) researcher, is questioning the appeal of Injective Protocol, a layer-1 platform whose creators say is designed to expressly power finance. As of December 2023, INJ, the native currency of Injective Protocol, is one of the top-performing coins, surpassing Bitcoin (BTC) and Ethereum (ETH). Is Injective Protocol Undervalued Based On On-Chain Metrics? Taking to X on December 14, Hartvigsen highlighted the platform&#8217;s relatively low total value locked (TVL) of $11 million and the limited number of protocols launched on the platform, currently standing at seven. Based on the researcher&#8217;s analysis, the largest dapp on the layer-1, Helix Protocol, a decentralized exchange (DEX), only manages a daily trading volume of about $7.4 million.  Hartvigsen states this is significantly lower than other perpetual futures protocols, including the Perpetual Protocol. These competitors, the analyst notes, are valued at around $200 and $300 million based on fully diluted valuation (FDV). So far, looking at data, there are only seven active protocols on Injective, with Helix managing over 60% of the ecosystem&#8217;s TVL, reinforcing its dominance. Related Reading: SHIB Roars As Shibarium Hits 100 Million Transactions – Big Things Unfolding If on-chain activity and the number of active protocol leads, Hartvigsen wants answers to irrefutably justify Injective Protocol&#8217;s $3.2 billion valuation. The researcher compares Injective with other blockchains, including Ethereum and Solana. These platforms command relatively higher trading volume and on-chain activity.  To illustrate, Hartvigsen cites DefiLlama data, which shows that Injective&#8217;s volume ranges from $5 to $7 million daily from seven dapps. On the other hand, Solana, a competing layer-1, presently processes between $500 and $700 million. Meanwhile, Injective Protocol cannot match Ethereum, which processes over $1 billion in trading volume. INJ Up 395%, Will Prices Continue Rising On Investor Optimism? In response to Hartvigsen&#8217;s analysis, yiggit, a user claiming to be a legal counsel, defended Injective Protocol. The user emphasized that TVL, as the researcher cited, cannot be the sole determinant to gauge a project&#8217;s potential.  Related Reading: Bitcoin Deja Vu: Capital Inflows Mirror Pre-2021 Bull Run Momentum Yiggit added that Injective Protocol&#8217;s potential is rooted in the expected number of upcoming apps. Notably, the legal counsel notes that optimism also stems from the Injective Protocol&#8217;s origins in Cosmos. In the Cosmos ecosystem, staking tends to catalyze participation as users seek to receive airdrops. Still, whether or not the researcher&#8217;s assessment is valid depends on time. So far, looking at the INJ price action in the daily chart, the coin has been charting higher, registering new all-time highs. To illustrate, INJ is up 395% from mid-October 2023, rallying as the broader crypto market recovers. At this valuation, CoinMarketCap data shows that the project has a market cap of over $2.7 billion. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-12-15T01:00:35.000Z",
    "title": "Ethereum DeFi Altcoin Showing Bullish Divergence As Indicator Enters ‘Bounce Zone’: Santiment",
    "url": "https://dailyhodl.com/2023/12/14/ethereum-defi-altcoin-showing-bullish-divergence-as-indicator-enters-bounce-zone-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/12/indicator-bounce-zone.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/12/indicator-bounce-zone.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/12/indicator-bounce-zone.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/12/indicator-bounce-zone.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/12/indicator-bounce-zone.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/12/indicator-bounce-zone.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/12/indicator-bounce-zone.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>An Ethereum (ETH)-based native token for a decentralized finance (DeFi) project is flashing a couple of bullish divergences, according to the crypto analytics firm Santiment. Aave (AAVE), a DeFi lending protocol, is trading at $93.89 at time of writing and is up more than 2.3% in the past 24 hours. Santiment notes that the asset&#8217;s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/12/14/ethereum-defi-altcoin-showing-bullish-divergence-as-indicator-enters-bounce-zone-santiment/\">Ethereum DeFi Altcoin Showing Bullish Divergence As Indicator Enters ‘Bounce Zone’: Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]