[
  {
    "source": "CoinDesk",
    "date": "2023-07-07T12:36:26.000Z",
    "title": "U.S. Added 209K Jobs in June, Missing Expectations for 230K",
    "url": "https://www.coindesk.com/business/2023/07/07/us-added-209k-jobs-in-june-missing-expectations-for-230k/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The unemployment rate TKTK to 3.X% versus 3.7% in June and against expectations for 3.7%."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-07T12:15:44.000Z",
    "title": "Bitcoin Falls to $30,000 Amid Expectations of Fed Rate Hike",
    "url": "https://decrypt.co/147635/bitcoin-falls-to-30000-amid-expectations-of-fed-rate-hike",
    "description": "A preliminary monthly report on the U.S. job sector jolted risk-on sentiments yesterday, as the market prepared for higher interest rates in July."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-07T12:38:17.000Z",
    "title": "Unemployment rate stays at historic lows, Bitcoin jumps 1.5%",
    "url": "https://cryptoslate.com/insights/unemployment-rate-stays-at-historic-lows-bitcoin-jumps-1-5/",
    "description": "<p>Quick Take Data from Zerohedge on U.S. data June nonfarm payrolls 209K, Exp. 230K, Last 339K Unemployment rate 3.6 %, Exp. 3.6%, Last 3.7% Average hourly earnings 0.4%, Exp. 0.3%, Last 0.4% Average weekly hours all workers 34.4, Exp. 34.3, Last 34.3 Bitcoin up 1.3%, $30,300</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/unemployment-rate-stays-at-historic-lows-bitcoin-jumps-1-5/\">Unemployment rate stays at historic lows, Bitcoin jumps 1.5%</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-07-07T12:26:52.000Z",
    "title": "DeFi Exclusion From EU’s MiCA Regulation Raises Concerns",
    "url": "https://cryptobriefing.com/defi-exclusion-from-mica-regulation-raises-concerns/?utm_source=feed&utm_medium=rss",
    "description": "The Association for Financial Markets in Europe (AFME)  the organization that represents European wholesale markets  has sounded the alarm on the exclusion of DeFi from the European Union&#8217;s..."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T12:38:34.000Z",
    "title": "Top 5 Under the radar Altcoins Poised to Propel Your Portfolio to New Heights",
    "url": "https://www.cryptopolitan.com/top-5-under-the-radar-altcoins-poised-to-propel-your-portfolio-to-new-heights/",
    "description": "In the fast-paced world of cryptocurrencies, staying ahead of the curve is essential for investors looking to maximize their returns. While Bitcoin and Ethereum continue to dominate the market, there are several under the radar altcoins that have the potential to propel your portfolio to new heights.&#160; These hidden gems offer unique features and promising ... <a title=\"Top 5 Under the radar Altcoins Poised to Propel Your Portfolio to New Heights\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-5-under-the-radar-altcoins-poised-to-propel-your-portfolio-to-new-heights/\" aria-label=\"More on Top 5 Under the radar Altcoins Poised to Propel Your Portfolio to New Heights\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T12:26:52.000Z",
    "title": "Janet Yellen takes on China to defend US firms",
    "url": "https://www.cryptopolitan.com/yellen-takes-on-china-to-defend-us-firms/",
    "description": "In an ever-evolving global theater, the economic relations between the United States and China have been turbulent, to say the least. Treasury Secretary Janet Yellen, with her diplomatic acumen, attempts to steady the seesaw, not letting national security disputes overshadow the economic prospects. Her recent trip to Beijing, intended to stabilize the strained relations between ... <a title=\"Janet Yellen takes on China to defend US firms\" class=\"read-more\" href=\"https://www.cryptopolitan.com/yellen-takes-on-china-to-defend-us-firms/\" aria-label=\"More on Janet Yellen takes on China to defend US firms\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-07T12:15:17.000Z",
    "title": "Apple’s Vision Pro headset woes exposed – Details",
    "url": "https://www.cryptopolitan.com/apples-vision-pro-headset-woes-exposed/",
    "description": "The Apple Vision Pro headset finds itself under the industry microscope as a consequence of Apple&#8217;s recent drastic reduction in its production forecasts. Originally aiming for a sales target of 1 million units in its first year, Apple has now revised its 2024 expectations to a sobering 400,000 units. The spotlight has turned onto the ... <a title=\"Apple&#8217;s Vision Pro headset woes exposed &#8211; Details\" class=\"read-more\" href=\"https://www.cryptopolitan.com/apples-vision-pro-headset-woes-exposed/\" aria-label=\"More on Apple&#8217;s Vision Pro headset woes exposed &#8211; Details\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-07T12:12:46.000Z",
    "title": "Bitcoin mining stock prices outperformed BTC in H1 2023",
    "url": "https://crypto.news/bitcoin-mining-stock-prices-outperformed-btc-in-h1-2023/",
    "description": "Bitcoin mining stock prices outperformed bitcoin prices in H1 2023"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-07T12:30:31.000Z",
    "title": "BarnBridge DAO Freezes Operations Amid SEC Probe, Can They Weather The Storm?",
    "url": "https://www.newsbtc.com/news/barnbridge-dao-freezes-operations-amid-sec-probe-can-they-weather-the-storm/",
    "description": "On July 6, Douglas Park, a lawyer representing the BarnBridge decentralized autonomous organization, shared important news with the members via the platform&#8217;s Discord channel. Park disclosed that the Securities and Exchange Commission (SEC) had initiated an investigation into BarnBridge DAO and individuals associated with it. In an effort to mitigate potential legal liabilities, Park advised that all work on BarnBridge-related products, including the closure of liquidity pools, should cease. Additionally, he suggested that individuals should not receive compensation for their contributions resulting from the DAO&#8217;s investment activities. Shortly after Park&#8217;s message, co-founder Tyler Ward, also known as &#8216;Lord Tyler&#8216; on Discord, confirmed the accuracy of the information on BarnBridge&#8217;s Discord platform. While the reason behind the SEC&#8217;s probe into BarnBridge DAO was not explicitly explained by Park and Ward, Park clarified that due to the investigation being ongoing and non-public, only limited information could be shared at this time. Related Reading: Ripple vs SEC: No Money For Years, XRP Holders Lose If SEC Wins, Says John Deaton Speculations Arise Among DAO Members In Response To Announcement Following the announcement, a number of BarnBridge DAO members expressed skepticism regarding the SEC&#8217;s investigation. One member on the Discord platform requested substantiating evidence of the SEC&#8217;s involvement and insinuated that BarnBridge&#8217;s founders might be using the investigation as a pretext for orchestrating an &#8216;exit strategy&#8217; that could potentially defraud investors. Tyler Ward, however, dismissed this claim, asserting that it would be the &#8220;worst thought-out rug attempt in history,&#8221; implying that such intentions were baseless. Related Reading: Bitcoin Price Takes A Hit As SEC Deems Spot ETF Filings ‘Inadequate’ Some members adopted a more light-hearted approach to the news, with one suggesting that it was time to relocate to Europe, humorously implying that DAO members could potentially evade scrutiny from the SEC. Another member playfully remarked that anyone who had engaged with BarnBridge would face dire consequences, jesting that SEC Chair Gary Gensler would &#8216;shoot&#8217; them on live television, alluding to Gensler&#8217;s perceived strict stance on cryptocurrencies. The Impact Of SEC Lawsuits On BarnBridge Native Crypto And Previous SEC Lawsuits Following the emergence of the news about the investigation, the native token of BarnBridge, BOND, experienced a decline of 9.4%, with its price dropping to $3.02, CoinGecko shows. BOND is now down 98.3% from its all-time high of $185.7 on October 27, 2020, and presently has a market cap of only $28 million. This is not the only time the regulator is coming for crypto firms as the SEC recently made news for launching litigation against two leading industry exchanges, Binance and Coinbase, for purportedly providing unregistered securities. The reported investigation into BarnBridge, a DAO of moderate size, may indicate that the securities regulator is extending its scrutiny beyond the larger entities within the cryptocurrency space. This development raises questions about the breadth of the SEC&#8217;s focus within the industry. Featured image from Twitter, chart from Tradingview.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-07T12:30:23.000Z",
    "title": "Compound (COMP) Token Rallies Over 100% After CEO Quits – Details",
    "url": "https://www.newsbtc.com/all/compound-rallies-over-100/",
    "description": "Robert Leshner, the well-known creator of the DeFi lending platform Compound Finance, has resigned from his position as the CEO of the DeFi lending protocol. Leshner recently announced his plan to launch Superstate Trust, a new business venture. The creation of a short-term government bond fund is the goal of this endeavor. Notably, Superstate Trust has already raised $4 million in startup money from a variety of DeFi investors. Compound (COMP), the native token of Compound Finance, is still on the rise despite Leshner&#8217;s resignation. COMP, which is currently trading at $55.87, has experienced a spectacular rise in value of 22.47% over the last two days. Related Reading: Recent 800 Billion Shiba Inu Dump Has Short Traders Worried – Here’s Why The Defiant Terminal reports that Compound Finance has $2 billion in assets and that its governance token COMP has increased by over 100% in the last week. Significant digital assets including Bitcoin (BTC), Ethereum (ETH), and the S&#38;P 500 have all increased by less than 3% during that time period. This outstanding performance demonstrates Compound&#8217;s (COMP) robustness and adaptability in the face of organizational changes and reflects increased investor trust in the token&#8217;s potential. Compound (COMP) token soars after CEO quits. Source: The Defiant Terminal Compound supporters believe that recent significant cryptocurrency ownership outflows by important market participants are clear signs that the price of Compound (COMP) will continue to rise. These backers are optimistic that Compound and its chances for future growth are looking good thanks to the withdrawals made by crypto whales, who own substantial sums of digital assets. Bullish investors predict Compound may even surpass the remarkable valuation of about $80 in the upcoming weeks as a result. This upbeat attitude is based on the idea that these powerful players&#8217; withdrawal activities reveal their trust and confidence in Compound&#8217;s long-term potential, acting as a catalyst for the stock&#8217;s upward trend. COMP market cap currently at $431 million. Chart: TradingView.com The Superstate assets will have the chance to be represented on the Ethereum blockchain, claims a prospectus filed with the Securities and Exchange Commission. The prospectus stressed the use of blockchain technology and the advantages of &#8220;operational efficiencies&#8221; that come with it. On the Ethereum blockchain, Compound is a protocol for an algorithmic money market. In particular, the current DeFi craze is ascribed to this network for initiating it. In the middle of the summer of 2020, Compound was the first platform to introduce yield farming to the market. In many ways, yield farming is comparable to staking cryptocurrency. Related Reading: Countdown To Litecoin Halving: Is LTC Meeting Expectations? Leshner established one of DeFi&#8217;s earliest protocols to draw substantial asset contributions. Compound and a few other protocols, including MakerDAO, were among the first to demonstrate that blockchains might be used for purposes more than just transferring tokens. The DeFi Summer liquidity mining boom began with COMP&#8217;s introduction in June 2020. Meanwhile, rumors spreading across social media that COMP holders would get some form of airdrop from Superstate provide a potential reason for the price movement of COMP. However, there has been no formal statement from Superstate stating that COMP will participate in the activities of the new company. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from InsideBitcoins"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-07T12:38:39.000Z",
    "title": "Ethereum NFT Royalties Reach Lowest Point in Two Years as Bored Ape Floor Price Drops",
    "url": "https://www.crypto-news-flash.com/ethereum-nft-royalties-reach-lowest-point-in-two-years-as-bored-ape-floor-price-drops/?utm_source=rss&utm_medium=rss&utm_campaign=ethereum-nft-royalties-reach-lowest-point-in-two-years-as-bored-ape-floor-price-drops",
    "description": "<img width=\"1000\" height=\"666\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/AlekseyIvanov-3-Ethereum.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Ethereum\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2019/06/AlekseyIvanov-3-Ethereum.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/AlekseyIvanov-3-Ethereum-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/AlekseyIvanov-3-Ethereum-768x511.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2019/06/AlekseyIvanov-3-Ethereum-104x69.jpg 104w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />Royalties in Ethereum-based NFT projects like BAYC dropped to a two-year low amid the major slowdown in the NFT market. Nansen data shows the top 10 NFT collections have made more than $345 million in royalties, with Yuga Labs having a 44% share. Blockchain analytics firm Nansen recently reported that royalties earned through non-fungible tokens [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-07-07T12:19:29.000Z",
    "title": "APE Prediction Comes True as Crypto’s Price Breaks Support",
    "url": "https://coinedition.com/ape-prediction-comes-true-as-cryptos-price-breaks-support/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/058.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/058.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/058-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/058-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/058-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/058-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/058-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/058-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/058-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/058-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/058-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/058-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/058-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/058-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/058-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/058-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/058-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>The crypto analysis platform, CryptoBusy, shared on Twitter earlier today that Apecoin (APE) saw a big breakout to the downside over the past few days of trading. This came in response to one of their earlier tweets predicting that APE would experience a breakout, but it was still unsure in what direction the crypto’s price [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ape-prediction-comes-true-as-cryptos-price-breaks-support/\">APE Prediction Comes True as Crypto’s Price Breaks Support</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]