[
  {
    "source": "Bitcoin.com",
    "date": "2023-12-03T20:30:57.000Z",
    "title": "Lido Achieves 9 Million Ethereum Milestone as Rocket Pool Surpasses 1 Million in Defi’s Booming Staking Sector",
    "url": "https://news.bitcoin.com/lido-achieves-9-million-ethereum-milestone-as-rocket-pool-surpasses-1-million-in-defis-booming-staking-sector/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/lsp-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Lido Achieves 9 Million Ethereum Milestone as Rocket Pool Surpasses 1 Million in Defi&#039;s Booming Staking Sector\" decoding=\"async\" loading=\"lazy\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/lsp-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/lsp-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/lsp-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/lsp-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/lsp-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/lsp-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/lsp.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Recent data reveals that Lido, the leading liquid staking protocol (LSP), now holds over 9 million ethereum within its system. This figure represents a significant 77.81% of the total ethereum value locked in current LSPs, underscoring Lido&#x2019;s dominant position in the market. Lido and Rocket Pool Reach New Heights with 9 Million and 1 Million [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-03T20:25:04.000Z",
    "title": "Binance ex-CEO Zhao faces travel ban, progress in BTC ETF filings, BTC clinches $39k | Weekly Recap",
    "url": "https://crypto.news/binance-ex-ceo-travel-ban-btc-etf-39k-weekly-recap/",
    "description": "Binance ex-CEO banned from leaving the U.S. before his sentencing in February; progress made on spot BTC ETF filings; Zhao resigns as Binance.US CEO; Bitcoin hits $39,000."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-03T20:11:06.000Z",
    "title": "Attorney recommends SEC disbar attorneys over misconduct",
    "url": "https://crypto.news/attorney-sec-lawyers-disbarred-over-misconduct/",
    "description": "Lawyer Bill Morgan is joining CryptoLaw founder John Deaton and Ripple's chief legal officer Stuart Alderoty in criticizing the SEC over crypto-related cases."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-03T20:30:34.000Z",
    "title": "Dogecoin Price Rallies To 4-Month Highs – Can Bulls Take It Above $0.3?",
    "url": "https://www.newsbtc.com/news/dogecoin-price-rallies-to-4-month-highs-can-bulls-take-it-above-0-3/",
    "description": "The growth of Dogecoin has lagged this year, but the meme coin recently went on a rally in the last week, hitting four-month highs. The question that still has to be answered is whether or not the cryptocurrency can maintain its momentum and continue to rocket forward.  DOGE started as a meme token but has grown to become an outlier among cryptocurrencies in the past few years. Despite posting a double-digit percent rise in price, the crypto saw itself lagging behind during the late October and early November gains when the majority of cryptocurrencies recovered from the long bearish market of the first half of the year.  Related Reading: Top 5 Cryptos Set For A Price Explosion This December – ADA, TIA, RUNE, LUNC, BTC Dogecoin Price Rallies To 4-Month Highs After reaching its monthly low of $0.0565 in October, Doge experienced a gain of 21%, and then it experienced a gain of 22% in November, resulting in the formation of two consecutive monthly green candles for the first time since October 2022. The crypto has continued on this trajectory, and its price has increased by 9.1% in the past seven days, one of the best gains among top cryptocurrencies. This recent price gain saw DOGE reach $0.08715, its highest level since April 2023.  DOGE trading volume on various exchanges is up by 30.7% in the past 24 hours. At the same time, exchange data from IntoTheBlock&#8217;s Order Books metrics reveal an interesting current overview of the power struggle between bulls and bears. According to the trading books 14 crypto exchanges tracked by IntoTheBlock, the bulls look to have the upper edge at the moment.  DOGE market cap currently at $12.07 billion on the daily chart: TradingView.com At the time of writing, buyers have placed buy orders of 901.7 million DOGE at an average price of $0.085112. Meanwhile, sellers have only put up 848.13 million DOGE for sale at an average price of $0.085137. This interesting dynamic indicates that there are considerably more buyers than sellers, which could create scarcity and continue to drive the price up. Related Reading: Ethereum ATH: Exploring The Possibility Of Ether’s New Peaks In 2024 &#160; Can Bulls Take DOGE Above $0.3?  In light of the price surge and some on-chain metrics, data suggests that the crypto might be on its way to a sustained price increase. DOGE immediately bounced off what seems like a resistance at the $0.08715 level and is currently trading at $0.08515. Although DOGE is up by 21% since the beginning of the year, it is 13% down from December 3, 2022.  DOGE went on a spectacular 525% run the last time it closed two consecutive monthly green candles. If history repeats itself, the crypto could shoot past $0.55 in the coming months. The first step would be to move back up and maintain a strong break above the resistance at $0.087 on the convergence of the 0.786 Fibonacci level and the 100-week and 200-week Moving Averages. Then, the next resistance to watch would be the yearly high of $0.096 in April.  Featured image from Shutterstock"
  }
]