[
  {
    "source": "Decrypt",
    "date": "2023-09-01T21:35:09.000Z",
    "title": "Just One Dose of Magic Mushroom Psychedelic Can Ease Depression for Weeks, Study Finds",
    "url": "https://decrypt.co/154664/depression-treatment-psychedelic-psilocybin-mushrooms",
    "description": "Psilocybin is having a magical effect on major depression disorders, but more study is needed, new research suggests."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-01T21:30:47.000Z",
    "title": "Digital rupee gets big usability boost through Yes Bank integration with UPI ",
    "url": "https://cointelegraph.com/news/digital-rupee-gets-big-usability-boost-through-yes-bank-integration-with-upi",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/365bad1b-b33f-406f-924d-cf0299c34d73.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Yes Bank’s app UPI integration is the first for the Indian retail CBDC, which has seen a variety of projects since its pilot launch since December.</p>\n                    <p><p>The Reserve Bank of India (RBI) central bank digital currency (CBDC), the digital rupee, will have enhanced usability, Yes Bank <a href=\"https://www.yesbank.in/about-us/media/press-releases-details/1481794463342-yes_bank_goes_live_with_upi_interoperability_on_cbdc\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> Aug. 30. This was thanks to Yes Bank’s integration of the Unified Payments Interface (UPI) with the RBI digital rupee app. Now Yes Bank account holders will be able to make transactions with the digital rupee by scanning UPI QR codes.</p><p>The UPI is a national payment portal operated by the National Payments Corporation of India (NPCI), a division of the RBI. The NPCI provides the infrastructure for both the UPI and the digital rupee. The UPI is used by 150 million merchants in India, <a href=\"https://economictimes.indiatimes.com/industry/banking/finance/banking/yes-bank-goes-live-with-upi-interoperability-on-cbdc/articleshow/103212653.cms\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to local press reports.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We are pleased to share that YES BANK has gone live with Unified Payments Interface (UPI) interoperability on the Reserve Bank of India (RBI) Central Bank Digital Currency (CBDC) app. <br><br>With this, users can simply scan any UPI enabled QR Code through the YES BANK Digital Rupee… <a href=\"https://t.co/dXxrerptoC\">pic.twitter.com/dXxrerptoC</a></p>&mdash; YES BANK (@YESBANK) <a href=\"https://twitter.com/YESBANK/status/1696857260084060318?ref_src=twsrc%5Etfw\">August 30, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The Yes Bank app marks the first integration of the UPI with the CBDC. Yes Bank executive Ajay Rajan <a href=\"https://www.yesbank.in/about-us/media/press-releases-details/1481794463342-yes_bank_goes_live_with_upi_interoperability_on_cbdc\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a statement:</p><blockquote>“The transition to an interoperable CBDC platform holds the promise of seamless, efficient, and broader transactional capabilities for YES BANK customers. […] This transformational enabler will facilitate a quantum leap in CBDC usage, driven by the enhanced convenience and accessibility.” </blockquote><p>Yes Bank <a href=\"https://cointelegraph.com/news/the-reserve-bank-of-india-to-launch-a-retail-cbdc-pilot-in-december\">was one of the eight original participating</a> banks in the retail digital rupee pilot project, which launched in December. The project <a href=\"https://cointelegraph.com/news/india-explores-offline-functionality-of-cbdcs-rbi-executive-director\">enlisted 5,000 participating merchants</a> and 50,000 CBDC users and had carried out 800,000 transactions worth $134 million by February. A separate wholesale digital rupee pilot <a href=\"https://cointelegraph.com/news/reserve-bank-of-india-to-reportedly-launch-digital-rupee-pilot-in-november\">was launched in November</a>. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/jpmorgan-uses-blockchain-for-24-7-dollar-transfers-with-indian-banks\">JPMorgan uses blockchain for 24/7 dollar transfers with Indian banks</a></em></strong></p><p>The digital rupee <a href=\"https://cointelegraph.com/news/indian-retail-chain-rolls-out-support-for-cbdc-payments-in-stores-report\">is already accepted at some of the stores</a> in the country's large Reliance Retail chain through a program using QR codes that began in February in conjunction with ICICI Bank, Kotak Mahindra Bank and Innoviti Technologies. </p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/thailands-national-airdrop-delio-vietnam-top-crypto-country-asia-express/\">Thailand’s national airdrop, Delio users screwed, Vietnam top crypto country: Asia Express</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Coin Telegraph India",
    "date": "2023-09-01T21:30:47.000Z",
    "title": "Digital rupee gets big usability boost through Yes Bank integration with UPI ",
    "url": "https://cointelegraph.com/news/digital-rupee-gets-big-usability-boost-through-yes-bank-integration-with-upi",
    "description": "\n                <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/365bad1b-b33f-406f-924d-cf0299c34d73.jpg\"></p><p>Yes Bank’s app UPI integration is the first for the Indian retail CBDC, which has seen a variety of projects since its pilot launch since December.</p>\n            "
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-01T21:30:25.000Z",
    "title": "Shiba Inu Frenzy: Shibarium Surpasses 800,000 Wallets, SHIB Slips 2% On The Sidelines",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-frenzy-shibarium-surpasses-800000-wallets-shib-slips-2-on-the-sidelines/",
    "description": "After overcoming initial setbacks, Shibarium, an Ethereum (ETH) layer-2 (L2) network backed by Shiba Inu (SHIB) tokens, has experienced a remarkable surge in metrics. With over 820,000 new wallet addresses and more than 90,000 daily transactions, Shibarium has demonstrated its appeal to users seeking faster, cheaper, and more private off-chain transactions while leveraging the security of the underlying Ethereum blockchain. Shibarium Emerges Strong Shibarium operates as a layer-2 network built on the Ethereum blockchain, aiming to enable faster, more cost-effective, and privacy-focused off-chain transactions while leveraging Ethereum&#8217;s security features.  Related Reading: Bitcoin Freefall Alert: On-Chain Metrics Expose Vulnerability, Targets $23,000 The recent increase in Shibarium&#8217;s metrics carries significant implications for the Shiba Inu project and its native token, SHIB.  Furthermore, the growing number of wallet addresses and daily transactions within the network indicates an expanding user base and increased interest in the SHIB token. On the same note, the rapid growth of Shibarium&#8217;s user base demonstrates its potential to enhance scalability and drive wider adoption of the Shiba Inu project. By addressing Ethereum&#8217;s scalability limitations through its layer-2 solution, Shibarium aims to improve the user experience by enabling faster and more cost-efficient transactions. Shibarium scan plays a crucial role in monitoring the network&#8217;s progress. The platform&#8217;s data reveals surpassing 820,000 new wallet addresses, indicating the growing community embracing Shibarium&#8217;s benefits. As Shibarium&#8217;s metrics continue to show positive trends, it bodes well for the future of the Shiba Inu ecosystem and the SHIB token. The network&#8217;s ability to provide faster, cost-effective, and private transactions will likely attract more users, driving adoption and strengthening the ecosystem. Looking ahead, Shibarium is expected to play a pivotal role in supporting the growth and scalability of the Shiba Inu project. The recent surge in Shibarium&#8217;s metrics, with over 820,000 wallet addresses and over 90,000 daily transactions, marks a significant milestone for the Shiba Inu ecosystem. As a layer-2 network built on Ethereum, Shibarium focuses on enhancing transaction speed, reducing costs, and prioritizing privacy. This achievement is significant for the Shiba Inu project and the SHIB token, demonstrating the network&#8217;s potential for scalability, broader adoption, and continued growth. With Shibarium&#8217;s infrastructure in place, the Shiba Inu ecosystem is well-positioned to thrive in the evolving landscape of decentralized finance. Shiba Inu Faces Market Headwinds Despite recent developments, the Shiba Inu ecosystem faces some challenges, particularly its native token, SHIB, which has been affected by the overall market trend. SHIB is trading at $0.00000783, reflecting a 2% decline over the past 24 hours. More notably, the token remains significantly below its year-to-date price, experiencing a decline of over 34%. Of particular concern for SHIB bulls is the key support level at $0.00000762, which has been instrumental in sustaining the token&#8217;s price since July and has allowed occasional surges to $0.00001134. Related Reading: The Secret Victory: How Bitcoin Flipped The Energy Consumption Narrative However, should the market recover and resume its bullish trend, SHIB may encounter a noteworthy obstacle in the form of its 50-day Moving Average (represented by the brown line in the chart). This Moving Average could substantially challenge the token&#8217;s upward trajectory. Featured image from iStock, chart from TradingView.com "
  }
]