[
  {
    "source": "Decrypt",
    "date": "2024-01-12T23:16:14.000Z",
    "title": "Bitcoin Is ’Bigger Than Any Government’: BlackRock CEO Larry Fink",
    "url": "https://decrypt.co/212727/bitcoin-bigger-than-any-government-blackrock-ceo-larry-fink",
    "description": "In a Fox Business interview, the former Bitcoin skeptic defended the cryptocurrency as a shield against government manipulation and economic instability."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-12T23:30:41.000Z",
    "title": "U.S. lawmakers demand investigation into SEC’s security practices following breach",
    "url": "https://cryptoslate.com/u-s-lawmakers-demand-investigation-into-secs-security-practices-following-breach/",
    "description": "<p>Senators Ron Wyden and Cynthia Lummis requested an investigation of the U.S. Securities and Exchange Commission (SEC) in a letter on Jan. 11. The two lawmakers asked the SEC&#8217;s Inspector General, Deborah Jeffrey, to open an investigation into a security breach that occurred two days earlier as well as the agency&#8217;s failure to follow best [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/u-s-lawmakers-demand-investigation-into-secs-security-practices-following-breach/\">U.S. lawmakers demand investigation into SEC&#8217;s security practices following breach</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-01-12T23:31:00.000Z",
    "title": "Bitcoin ($BTC) Miner Outflows Hit 77-Month High as Hashrate Keeps Growing",
    "url": "https://www.cryptoglobe.com/latest/2024/01/bitcoin-btc-miner-outflows-hit-77-month-high-as-hashrate-keeps-growing/",
    "description": "Bitcoin miner outflows have recently risen to hit a 77-month high at a time in which the price of the flagship cryptocurrency has been recovering and is now trading at around $46,000, suggesting miners believe its price may be facing a local top. According to data shared by cryptocurrency analytics firm CryptoQuant, Bitcoin miner outflows, […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-12T23:37:57.000Z",
    "title": "Why is UK’s economy suddenly gaining momentum?",
    "url": "https://www.cryptopolitan.com/why-is-uks-economy-suddenly-gaining-momentum/",
    "description": "The United Kingdom is currently witnessing a significant uptick in its economic trajectory, a phenomenon catching the eyes of observers worldwide. Gone are the days of tepid progression, as the UK strides forward with renewed vigor, defying previous economic forecasts. But what’s driving this unexpected surge? Let’s dive in. UK&#8217;s Economic Waters Recent developments in [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-12T23:20:32.000Z",
    "title": "UBS steps into crypto, offering conditional Bitcoin ETF access",
    "url": "https://www.cryptopolitan.com/ubs-crypto-offers-bitcoin-etf-access/",
    "description": "UBS, the renowned Zurich-based banking giant, has decided to allow select clients access to trade Bitcoin ETFs (Exchange Traded Funds). Notably, the bank will not proactively solicit these trades; only accounts aligned with a higher risk tolerance will be eligible for this new offering. This strategic decision positions UBS cautiously in the rapidly evolving digital [&#8230;]"
  }
]