[
  {
    "source": "CoinDesk",
    "date": "2023-09-05T20:57:00.000Z",
    "title": "SEC Has 'No Grounds' to Reject Bitcoin ETF Conversion, Grayscale Says",
    "url": "https://www.coindesk.com/policy/2023/09/05/sec-has-no-grounds-to-reject-bitcoin-etf-conversion-grayscale-says/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The SEC was last week ordered to review its prior rejection of the conversion of the Grayscale Bitcoin Trust (GBTC), though not necessarily to approve it."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-05T20:53:29.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin, capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-09-05T21:00:53.000Z",
    "title": "Synapse Liquidity Provider Abruptly Dumps 9 Million SYN Tokens, Price Plunges By 20%",
    "url": "https://www.newsbtc.com/news/synapse-liquidity-provider-abruptly-dumps-9-million-syn-tokens/",
    "description": "Cross-chain bridge Synapse has seen the value of its native token SYN plummet after a liquidity provider (LP) dumped all their tokens. According to data from CoinGecko, the token’s price declined by nearly 25% a few hours after the sell-off. On Tuesday, 5th of August, Synapse Labs announced &#8211; via a post on X (formerly Twitter) &#8211; that one of the liquidity providers sold their SYN tokens and removed liquidity from the Synapse protocol.  Lookonchain reported a whale dumping 9 million SYN tokens an hour after this disclosure. According to the on-chain analytics platform, the whale sold the tokens for roughly 2.35 million USDC in two separate transactions at $0.26. Additionally, Lookonchain revealed that the whale received these offloaded funds from the “Synapse: Executor 2” wallet, establishing a link with Synapse Labs’ recent announcement. Meanwhile, Colin Wu’s report corroborated this on-chain discovery while adding that $37.537 million in stablecoin liquidity was removed from the Synapse protocol.  Related Reading: Worst Behind For BTC Price? Whales Accumulate Bitcoin, But It’s Not BlackRock Crypto Community Points Finger At Nima Capital Various reports have emerged in the last few hours, speculating on the identity of the liquidity provider responsible for the 9 million token sell-off and liquidity removal. Crypto researcher Wazz claims that Nima Capital is the LP behind these actions and has broken its liquidity-provisioning agreement eight months early. In March, Nima Capital, a crypto venture capital firm, was designated Synapse’s first liquidity provider. According to the proposal, the firm committed to providing $40 million in actively managed stablecoin liquidity over twelve months while receiving 33% of bridge and swap fees. Nima Capital appears to have limited its digital presence. As of this writing, the company’s website is offline and inaccessible to the public. Meanwhile, access to the firm’s X account has been restricted and is only available to confirmed followers.  It is worth noting that Synapse Labs didn’t reveal the identity of the liquidity provider in its announcement, and the team has yet to provide any further updates on the situation. The liquidity removal and token sell-off have also impacted Synapse&#8217;s total value locked (TVL). According to DefiLlama data, the cross-chain protocol&#8217;s TVL has dipped by nearly 20% in the past day. SYN Succumbs To Selling Pressure, Price Dips By 25%  As noted earlier, the value of SYN suffered an almost 25% decline after the liquidity provider dumped its holdings. The token’s price crashed from $0.401 to $0.309 in hours. Related Reading: Bitcoin Stealth Rally: Expert Forecasts Monumental Surge, Ignoring $25,800 Standstill SYN has since been showing glimpses of recovery, as it now trades above $0.35. According to CoinGecko data, the token is valued at 0.356092, with a 0.5% price increase in the past hour. A broader look at its price performance shows that the SYN token has struggled in the last few months. After notching a yearly high of $1.59 in late February, the cryptocurrency has reversed all its gains, trading 77% beneath the 2023 peak. SYNUSDT trading at $0.3575 &#124; Source: daily SYNUSDT chart on TradingView Featured image from FreePik, chart from TradingView"
  },
  {
    "source": "Coin Edition",
    "date": "2023-09-05T21:00:00.000Z",
    "title": "Tether Holdings Becomes The World’s 22 Largest US Treasury Bond Holder",
    "url": "https://coinedition.com/tether-holdings-becomes-the-worlds-22-largest-us-treasury-bond-holder/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/09/usdt-2.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/09/usdt-2.jpg 730w, https://coinedition.com/wp-content/uploads/2023/09/usdt-2-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/09/usdt-2-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/09/usdt-2-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/09/usdt-2-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/09/usdt-2-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/09/usdt-2-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/09/usdt-2-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/09/usdt-2-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/09/usdt-2-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/09/usdt-2-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/09/usdt-2-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/09/usdt-2-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/09/usdt-2-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/09/usdt-2-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/09/usdt-2-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Tether Holdings Limited, the crypto giant behind the largest stablecoin by market capitalization, has become the world’s 22 largest holder of United States Treasury Bonds. The USDT issuer overtook nations like Australia, Spain, Mexico, and the United Arab Emirates to achieve this feat. Tether’s Chief Technology Officer, Paolo Ardoino, took to X (formerly Twitter) earlier [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/tether-holdings-becomes-the-worlds-22-largest-us-treasury-bond-holder/\">Tether Holdings Becomes The World’s 22 Largest US Treasury Bond Holder</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]