[
  {
    "source": "Cointelegraph",
    "date": "2023-10-13T01:00:57.000Z",
    "title": "DOJ charges exec over ‘cherry picking’ scheme involving crypto futures",
    "url": "https://cointelegraph.com/news/doj-charge-ceo-cherry-picking-scheme-crypto-futures-fraud",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/b97450db-17db-466e-8158-ca007786e3ec.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The former CEO of Systematic Alpha Management faces up to five years in prison for his role in a fraudulent scheme tied to crypto futures contracts.</p>\n                    <p><p>The former CEO of a Miami-based investment firm has pled guilty to a conspiracy to commit commodities fraud involving crypto futures contracts and now faces up to five years in prison. </p><p>In an Oct. 12 <a href=\"https://www.justice.gov/opa/pr/ceo-pleads-guilty-transnational-scheme-involving-foreign-exchange-and-cryptocurrency-futures\" target=\"_blank\" rel=\"noopener nofollow\">statement</a>, the United States Department of Justice said that Peter Kambolin, the former CEO of Systematic Alpha Management (SAM) LLC, operated a “cherry picking” scheme where he marketed his firm as offering algorithmic trading strategies involving futures contracts, including both cryptocurrencies and commodities. </p><p>However, Kambolin misrepresented to investors that his fund involved the trading of cryptocurrency futures and foreign exchange futures, when in reality, roughly half of Kambolin’s trading in each pool involved equity index futures contracts.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">CEO Pleads Guilty to Transnational Scheme Involving Foreign Exchange and Cryptocurrency Futures Contracts<a href=\"https://t.co/aiafUgfRS3\">https://t.co/aiafUgfRS3</a></p>&mdash; Criminal Division (@DOJCrimDiv) <a href=\"https://twitter.com/DOJCrimDiv/status/1712486212206723254?ref_src=twsrc%5Etfw\">October 12, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“In doing so, Kambolin defrauded investors located in the United States and abroad by, among other things, depriving them of profitable trades,” wrote the prosecutors. </p><p>Cherry picking is a fraudulent securities trading practice in which a person executes trades without assigning those trades to a particular trading account until the individual determines whether or not the trade has become profitable or suffered losses.</p><p>According to the DOJ, Kambolin defrauded investors both in the United States and abroad by depriving them of profitable trades and then using the proceeds to fund his own personal expenses including the rent for a beachfront apartment. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/hong-kong-binance-users-phishing-scam-jpex-crypto-scandal\"><strong><em>Binance users in Hong Kong lose $450K in wave of fraud texts: HK police</em></strong></a></p><p>The proceeds of his scheme were transferred to foreign bank accounts controlled by a co-conspirator in Belarus and Dominica. </p><p>“Yesterday’s plea recognizes the importance of holding the defendant accountable for his actions in misleading and defrauding investors through a cherry-picking scheme, and using proceeds from the scheme to fund his own personal lifestyle,” said Assistant Inspector General for Investigations Shimon Richmond.</p><p>Following his guilty plea, Kambolin now faces a maximum penalty of five years in prison. His sentencing hearing will occur on an undisclosed date in the future. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/blockchain-detectives-mt-gox-collapse-birth-chainalysis/\"><strong><em>Blockchain detectives — Mt. Gox collapse saw birth of Chainalysis</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-10-13T00:40:00.000Z",
    "title": "Debt Spiral Could Trigger Dollar Crash and Boost Bitcoin, Ether, and XRP Prices as Institutions Eye ‘Critical’ Hedges",
    "url": "https://www.cryptoglobe.com/latest/2023/10/debt-spiral-could-trigger-dollar-crash-and-boost-bitcoin-ether-and-xrp-prices-as-institutions-eye-critical-hedges/",
    "description": "After an initial surge at the beginning of the year, most digital assets have lost momentum, with Bitcoin ($BTC) being down 3.5% over the past month and over 62% year-to-date. Similarly, altcoins such as $XRP are up in the year but down significantly over the last few weeks. As the U.S. faces a “debt death […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-13T01:00:30.000Z",
    "title": "CFTC Files Lawsuit Against Voyager Digital And Former CEO For Fraud",
    "url": "https://www.newsbtc.com/news/cftc-files-lawsuit-against-voyager-digital-and-former-ceo-for-fraud/",
    "description": "The US Commodity Futures Trading Commission (CFTC) has taken legal action against Voyager Digital and its former CEO, Stephen Ehrlich.  The CFTC filed a complaint in the US District Court for the Southern District of New York, alleging fraud and registration failures related to the operation of the Voyager digital asset platform and an unregistered commodity pool. Voyager Faces Legal Action For ‘Misleading Customers’ According to the CFTC, Ehrlich falsely marketed the Voyager platform as a safe haven for high-yield returns, deceiving customers to purchase and store digital assets.  Per the filing, Voyager allegedly took “reckless risks” with customers&#8217; assets, leading to Voyager&#8217;s bankruptcy and significant customer losses. The lawsuit seeks various penalties, including restitution, disgorgement, civil monetary penalties, permanent trading and registration bans, and a permanent injunction against further violations of the Commodity Exchange Act. Related Reading: XRP Price Could Get A Boost, Dip In This Bitcoin Metric Suggests New Rally In a separate but related action, the Federal Trade Commission (FTC) has charged Voyager and Stephen Ehrlich with violating the FTC Act and the Gramm-Leach-Bliley Act.  The FTC alleges that the company falsely claimed customers&#8217; accounts were insured by the Federal Deposit Insurance Corporation (FDIC) and misled consumers about the safety of their deposits. The FTC&#8217;s complaint states that Voyager enticed customers to deposit funds by assuring them of the safety of their assets on the platform. However, Voyager was neither a bank nor a financial institution, and the deposits were not eligible for FDIC insurance.  The FTC alleges that consumers suffered significant losses when Voyager experienced financial difficulties, including being locked out of their accounts and losing over $1 billion in cryptocurrency assets. Stephen Ehrlich Rejects Settlement  Voyager and its affiliates will be permanently banned from handling consumers&#8217; assets and offering related services as part of a proposed settlement.  The companies have also agreed to a judgment of $1.65 billion, which will be suspended to allow Voyager to return the remaining assets to consumers during the bankruptcy proceedings.  Stephen Ehrlich, however, has not agreed to a settlement, and the FTC&#8217;s case against him will proceed in federal court. The FTC&#8217;s complaint further alleges that Ehrlich transferred millions of dollars to his wife, Francine Ehrlich, including funds linked to the alleged unlawful conduct.  Related Reading: Bitcoin Plunge Below $27,000 Drives Investors Into Fear, Will Rebound Occur? The proposed settlement also prohibits Voyager and its affiliates from misrepresenting product benefits, making false representations to obtain financial information, and disclosing consumer information without consent. Both regulatory bodies are seeking to hold Voyager, Stephen Ehrlich, and other involved parties accountable for their alleged deceptive practices and violations of financial regulations.  Featured image from Shutterstock, chart from TradingView.com "
  }
]