[
  {
    "source": "Decrypt",
    "date": "2023-08-21T20:49:20.000Z",
    "title": "Crypto and NFT Games Are Still Launching on Steam Despite Ongoing Ban",
    "url": "https://decrypt.co/153196/crypto-nft-games-still-launching-steam-despite-ongoing-ban",
    "description": "Popular PC marketplace Steam banned blockchain games in 2021, but developers are finding various ways to work around—or within—the rules."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-21T20:47:47.000Z",
    "title": "‘Disappointing’ ETF Decisions By SEC Blamed for Bitcoin Selloff",
    "url": "https://decrypt.co/153230/disappointing-etf-decisions-by-sec-blamed-for-bitcoin-selloff",
    "description": "Amid a widespread crypto sell-off and SEC stalling, CoinShares reports that institutional investors sold $55 million worth of Bitcoin in the past week."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-21T21:00:00.000Z",
    "title": "Dwindling optimism for Bitcoin ETF approval to blame as weekly crypto outflows hit $55M",
    "url": "https://cointelegraph.com/news/dwindling-optimism-for-bitcoin-etf-approval-to-blame-as-weekly-crypto-outflows-hit-55m",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/591a3eab-eceb-44ba-9128-c5387061ee3b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Even altcoins slumped, with only Ripple and Cardano registering inflows. </p>\n                    <p><p>Digital asset investment products saw $55 million in outflows for the week of September 13-19, according to a report from CoinShares. </p><p>Optimism surrounding what was previously thought to be the impending approval of a spot-based Bitcoin exchange-traded fund has begun to give way as $42 million worth of the week’s outflows came from BTC alone.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">This week in Fund Flows by <a href=\"https://twitter.com/CoinSharesCo?ref_src=twsrc%5Etfw\">@CoinSharesCo</a> Head of Research <a href=\"https://twitter.com/jbutterfill?ref_src=twsrc%5Etfw\">@jbutterfill</a>:<br><br>Digital asset investment products saw outflows totalling US$55m — we believe this is in reaction to recent media highlighting that a decision by the US Securities & Exchange Commission to authorise a US… <a href=\"https://t.co/Ecxx3GeZkR\">pic.twitter.com/Ecxx3GeZkR</a></p>— CoinShares (@CoinSharesCo) <a href=\"https://twitter.com/CoinSharesCo/status/1693638394050482553?ref_src=twsrc%5Etfw\">August 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Ethereum products didn’t fare much better given its market share. Ether funds saw $9 million in outflows, while Polygon, Litecoin and Polkadot also saw outflows totaling a combined $2 million. </p><p>The only cryptocurrencies to experience inflows for the week were Ripple and Cardano. The former saw $1.2 million in inflows and Cardano pulled in a modest $100,000. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/learn/bitcoin-etfs-a-beginners-guide-to-exchange-traded-funds\"><strong><em>Bitcoin ETFs: A beginner's guide to exchange-traded funds</em></strong></a></p><p>Geographically speaking, nearly every territory reported on saw outflows. Canada led the losses list with its $35.9 million in outflows representing the lion’s share. It was followed by Germany and the U.S. with $11 million and $5.5 million in outflows, respectively.</p><p>Switzerland and Australia managed to report the only inflows, with the Swiss market supporting $3.5 million worth of inflows and Australia seeing $100,000. </p><p>According to CoinShares, the outflows were <a href=\"https://etp.coinshares.com/knowledge/market-activity/fund-flows-21-08-23\" target=\"_blank\" rel=\"noopener nofollow\">driven</a> by a lack of movement from the Securities and Exchange Commission toward approving a spot Bitcoin ETF:</p><blockquote>“We believe this [market movement] is in reaction to recent media highlighting that a decision by the US Securities & Exchange Commission in allowing a US spot-based ETF is not imminent.”</blockquote><p>Investor speculation surrounding the potential approval of a spot-based Bitcoin ETF has led to a lot of optimism for the future of cryptocurrency. Some experts even claim that such approval could be a ‘moon worthy’ catalyst for crypto.</p><p>As Cointelegraph recently reported, research boutique Fundstrat believes that the coin value of Bitcoin “will <a href=\"https://cointelegraph.com/news/bitcoin-btc-price-150k-after-halving-2024-prediction\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/bitcoin-btc-price-150k-after-halving-2024-prediction/amp\">surge past an eye-watering $150,000</a> by the end of 2024,” if the SEC does start approving spot-based Bitcoin ETFs.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-21T20:40:00.000Z",
    "title": "Coin Center responds to US lawmakers’ request for crypto tax guidance",
    "url": "https://cointelegraph.com/news/coin-center-responds-lawmakers-request-crypto-tax-guidance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/2919a087-c036-48cf-b4bb-56e7a35d4622.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The crypto advocacy group’s suggestions included a de minimis exemption for crypto transactions and having the IRS provide guidance on block rewards, airdrops and hard forks.</p>\n                    <p><p>Cryptocurrency advocacy group Coin Center has provided suggestions for United States lawmakers to consider in potential legislation related to the taxation of digital assets.</p><p>In an Aug. 21 letter to Sens. Ron Wyden and Mike Crapo, Coin Center <a href=\"https://www.coincenter.org/app/uploads/2023/08/Coin-Center-Response-to-WydenCrapo-Tax-RFI-Aug-2023.pdf\" target=\"_blank\" rel=\"noopener nofollow\">pointed</a> to the Virtual Currency Tax Fairness Act — a bill previously introduced in other sessions of Congress — for provisions, including having the Internal Revenue Service (IRS) establish a de minimis exemption for crypto transactions. The measure could be aimed at encouraging crypto as a method of payment by treating digital asset transactions like ones used to purchase foreign currency.</p><p>Secondly, the advocacy group called for lawmakers to consider not applying U.S. tax law reporting requirements for second parties to digital assets. According to Coin Center, a crypto user in the United States could be legally required to provide “incomplete or non-existent” information on senders of digital assets, creating privacy concerns and an undue burden on filers. </p><p>“[F]orcing ordinary people to collect highly intrusive information about other ordinary people, and report it to the government without a warrant, is unconstitutional under the Fourth Amendment,” said Coin Center. “[D]emanding that politically active organizations create and report lists of their donors’ names and identifying information to the government is unconstitutional under the First Amendment.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Today, <a href=\"https://twitter.com/coincenter?ref_src=twsrc%5Etfw\">@coincenter</a> responded to <a href=\"https://twitter.com/SenateFinance?ref_src=twsrc%5Etfw\">@SenateFinance</a> <a href=\"https://twitter.com/RonWyden?ref_src=twsrc%5Etfw\">@RonWyden</a> & <a href=\"https://twitter.com/SenFinance?ref_src=twsrc%5Etfw\">@SenFinance</a> <a href=\"https://twitter.com/MikeCrapo?ref_src=twsrc%5Etfw\">@MikeCrapo</a>'s request for policy input on the taxation of digital assets. <a href=\"https://t.co/px3MEcigHf\">https://t.co/px3MEcigHf</a></p>— Landon (@Landon) <a href=\"https://twitter.com/Landon/status/1693702735583903798?ref_src=twsrc%5Etfw\">August 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Other suggestions for Wyden and Crapo to consider included revising the IRS definition of a broker to explicitly exclude crypto miners and Lightning node operators, among others, as well as limit the agency’s authority to issue legal summons for alleged tax evaders. The advocacy group cited a 2016 case in which the IRS <a href=\"https://cointelegraph.com/news/us-federal-court-approves-irs-collection-of-coinbase-user-database\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-federal-court-approves-irs-collection-of-coinbase-user-database/amp\">issued a subpoena to Coinbase</a> with a “John Doe” summons, allowing the agency to gain a large amount of user data from individuals who may not have been involved in any potential tax reporting violations.</p><p>Coin Center added on the matter:</p><blockquote>“If we set a precedent that merely dealing in bitcoin could result in a firm’s customers easily losing their financial privacy, it would have severe consequences for bitcoin and the related blockchain ecosystem.\"</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/study-claims-99-5-of-crypto-investors-did-not-pay-taxes-in-2022\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/study-claims-99-5-of-crypto-investors-did-not-pay-taxes-in-2022/amp\"><strong><em>Study claims 99.5% of crypto investors did not pay taxes in 2022</em></strong></a></p><p>According to Coin Center, the IRS also needed to consider providing guidance on block rewards, airdrops and hard forks for tax purposes and not require a qualified appraiser for certain donations made in cryptocurrency. The suggestions <a href=\"https://cointelegraph.com/news/us-senate-finance-committee-asks-digital-asset-community-how-to-tax-it-in-open-letter\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/us-senate-finance-committee-asks-digital-asset-community-how-to-tax-it-in-open-letter/amp\">followed a July request</a> from the U.S. Senate Financial Services Committee, which will be accepting responses on crypto tax guidance through Sept. 8.</p><p>Addressing the tax gap — the amount of taxes owed versus those actually paid to the government — has been an ongoing issue in the U.S. as the crypto space expands. Though some legislation, including the bipartisan infrastructure bill passed in November 2021, has attempted to address some of the issues surrounding taxes on cryptocurrency, critics of the legislation have <a href=\"https://cointelegraph.com/news/u-s-delays-crypto-tax-reporting-rules-as-it-still-can-t-define-what-a-broker-is\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/u-s-delays-crypto-tax-reporting-rules-as-it-still-can-t-define-what-a-broker-is/amp\">pointed to seemingly impossible reporting requirements</a> for retail investors. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\"><strong><em>Best and worst countries for crypto taxes — plus crypto tax tips</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n\n</p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T20:59:02.000Z",
    "title": "Phishing alert: Terra’s website compromised, developers issue immediate warnings ",
    "url": "https://www.cryptopolitan.com/terras-website-compromised-developers-issue-immediate-warnings/",
    "description": "Terra&#8217;s official website was suddenly compromised on August 20, and replaced by a phishing site that severely threatened users&#8217; digital assets. The alarming incident was promptly reported by Terra&#8217;s official Twitter account, warning users not to interact with the terra(dot)money domain until further notice. The phishing site, designed to mimic Terra&#8217;s official website, displayed a ... <a title=\"Phishing alert: Terra&#8217;s website compromised, developers issue immediate warnings \" class=\"read-more\" href=\"https://www.cryptopolitan.com/terras-website-compromised-developers-issue-immediate-warnings/\" aria-label=\"More on Phishing alert: Terra&#8217;s website compromised, developers issue immediate warnings \">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T20:58:40.000Z",
    "title": "Goldman Sachs considers adviser sale as strategy",
    "url": "https://www.cryptopolitan.com/goldman-sachs-considers-adviser-sale/",
    "description": "Goldman Sachs, the Wall Street titan known for its gilded approach to finance, has once again dropped a bombshell in the ever-evolving financial landscape. The mammoth institution is thinking about parting ways with its investment advisory segment, an ambitious venture it only took under its wing four years prior. While the move may have raised ... <a title=\"Goldman Sachs considers adviser sale as strategy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/goldman-sachs-considers-adviser-sale/\" aria-label=\"More on Goldman Sachs considers adviser sale as strategy\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-21T20:44:21.000Z",
    "title": "Binance troubles in Europe deepen with withdrawal problems",
    "url": "https://www.cryptopolitan.com/binance-troubles-in-europe-deepen/",
    "description": "Customers of the cryptocurrency exchange Binance are reportedly experiencing withdrawal difficulties in Europe due to Single Euro Payments Area (SEPA) transfer issues. Binance&#8217;s customer support wrote on X (formerly Twitter) on August 20 that the exchange had purportedly suspended euro withdrawals and deposits via SEPA. Binance&#8217;s position in Europe shakes up The crypto exchange stated ... <a title=\"Binance troubles in Europe deepen with withdrawal problems\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-troubles-in-europe-deepen/\" aria-label=\"More on Binance troubles in Europe deepen with withdrawal problems\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-21T20:51:29.000Z",
    "title": "Bitcoin Reaches Most “Oversold” Record Since 2020: What This Means",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-reaches-most-oversold-record-since-2020-what-this-means/",
    "description": "Bitcoin price just experienced one of its fastest and sharpest corrections in over a year, dropping 10% in a matter of minutes. The mass liquidations and panic from the selloff caused BTCUSD daily charts to reach the most oversold level since the COVID crash in early 2020. BTC Panic-Selling Reaches Extremes Not Seen Since COVID Crash As much as people try to fight it, investing and trading is an emotion-driven process. Few emotions cause humans to take action more urgently than those associated with fear and panic. This is precisely why selloffs tend to be sharper and scarier than bull markets. “Bulls take the stairs, bears ride the elevator” is just one adage that symbolizes this noted market behavior. Related Reading: This Bitcoin Continuation Pattern Points To 3-6 Months Of Uptrend Ahead For example, the COVID collapse in March 2020 took only a matter of days to erase 70% of Bitcoin’s price. This instance was the last time the Relative Strength Index technical indicator on the daily timeframe became this oversold. After Bitcoin’s recently drop this week, the daily RSI is back at a similar extreme for the first time in more than three years. What isn’t clear quite yet, is if the extreme represents another ideal buying opportunity, or if this is the onset of a deeper decline. The RSI has reached the deepest reading in years &#124; BTCUSD on TradingView.com Bitcoin Daily RSI Plunges To Most Oversold Level Since 2020 The Relative Strength Index is a momentum indicator that tells investors and traders when an asset is overbought and oversold on a relative basis. When the tool reaches extremes above 70 or below 30, it can present an opportunity to buy or sell. The RSI is now lower than the LUNA or FTX collapse, or at any point since March 2020. During especially strong moves, however, the RSI can remain elevated for extended phases despite reaching such overheated readings. Such was the case in December 2018, the previous instance of the daily Bitcoin RSI reaching such a low. Related Reading: This Long-Term Bitcoin Price Average Is Setting ATHs In that case, the RSI stayed hot for two full weeks, cutting down BTCUSD price by another 40% before it was all said and done. A 40% correction in Bitcoin would take prices back to the November 2022 bottom. If Bitcoin instead rebounds and reacts more akin to 2020, new all-time highs could be just months away. If not, a deeper reset is possible. #Bitcoin daily RSI is now the most oversold in all of 2023 Act accordingly pic.twitter.com/GpKFAvsonc &#8212; Tony &#34;The Bull&#34; (@tonythebullBTC) August 17, 2023 Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from iStockPhoto, Charts from TradingView.com"
  }
]