[
  {
    "source": "CoinDesk",
    "date": "2023-07-31T20:02:26.000Z",
    "title": "As Litecoin Halving Approaches, Founder Touts Silver Collector Cards Loaded With 'Digital Silver'",
    "url": "https://www.coindesk.com/tech/2023/07/31/as-litecoin-halving-approaches-founder-touts-silver-collector-cards-loaded-with-digital-silver/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Litecoin’s third “halving event” – a programmed 50% reduction in the pace of new issuance of the cryptocurrency – is expected on Wednesday."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-31T20:30:00.000Z",
    "title": "Researchers develop blockchain verification service for cultural artifacts",
    "url": "https://cointelegraph.com/news/researchers-develop-blockchain-verification-service-for-cultural-artifacts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/fc7c329d-232c-41d8-bb04-1fed81b25bbb.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A combination of human expertise, NFTs and blockchain technology could help humanity protect its priceless artifacts from theft and looting.</p>\n                    <p><p>Computer scientist Adel Khelifi, of the University of Abu Dhabi, and archaeologist Mark Altaweel, from University College London, recently <a href=\"https://edition.cnn.com/2023/07/31/world/ancient-treasures-are-being-looted-but-blockchain-could-help-protect-them/index.html\" target=\"_blank\" rel=\"noopener nofollow\">announced</a> the development of a Web3-based verification-as-a-service model for determining and recording the authenticity and provenance of cultural artifacts. </p><p>Called Salsal, the big idea behind the service is to bridge the world of historical artifacts with an on-chain validation system that can’t be fudged or cloned. </p><p>In an email interview with Cointelegraph, Altaweel said Salsal would be offered specifically to “cultural heritage organisations.” </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/press-releases/temdao-world-heritage-project-helps-the-cultural-sector-through-democracy-fueled-donations\"><strong><em>TemDAO world heritage project helps cultural sector through democracy-fueled donations</em></strong></a></p><p>There currently exists no official globally recognized registry for items of historical significance. Despite this, most territories have laws governing the procurement, collection, trade, buying and selling of artifacts of cultural significance, especially when they’re discovered on public or protected land. </p><p>Some of the most historically valuable artifacts known to exist remain unaccounted for. Missing treasures, such as the Honjo Masamune and the Crown Jewels of Ireland, have been lost to time and, in many cases, theft. And countless others have been <a href=\"https://journals.sagepub.com/doi/pdf/10.1177/08944393231188471\" target=\"_blank\" rel=\"noopener nofollow\">looted</a> from historically significant sites over the years before experts could even catalog them. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/5b7aedf6-39a7-4426-8a4e-f398036bbcec.jpeg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Prior to Salsal, project co-leads Altaweel and Khelifi worked together on research using AI to identify looting at historically significant sites. Source: Altaweel, et al</em></figcaption></figure><p>The team behind Salsal hopes to address some of these concerns by creating what’s essentially a protocol for identifying, grading and recording information about specific artifacts using a suite of technology tools.</p><p>When a cultural heritage organization has its collection validated, it uploads images and descriptions to the service. A group of experts then use a process similar to the one used by the Museums Association to grade the artifacts on a five-point scale. </p><p><a href=\"https://agur-ab416.web.app/\" target=\"_blank\" rel=\"noopener nofollow\">According</a> to the Salsal website:</p><blockquote>“Once proven to be legitimate, the Collector can turn it into an NFT which is a Non Fungible Token. We use NFTs as their data is stored on the Blockchain and is immutable, allowing us to document the transfer of ownership accurately.”</blockquote><p>Ultimately, the researchers hope to see mass adoption of their service. They envision a paradigm where curators aspire to have their collections validated via Salsal as a matter of verification — something that might be akin to having a rare collectible such as a comic book graded by a commercial validator. </p><p>There are already databases containing information on historical artifacts, but a unified database running on an immutable blockchain could help thwart theft and looting by requiring sellers and curators to document provenance.</p><p><em><strong><em><a href=\"https://mint.cointelegraph.com/?url=https://cointelegraph.com/news/researchers-develop-blockchain-verification-service-for-cultural-artifacts&amp;utm_source=cointelegraph_com&amp;utm_medium=appendix&amp;utm_campaign=articles\">Collect this article as an NFT</a></em></strong><em> to preserve this moment in history and show your support for independent journalism in the crypto space.</em></em></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-31T20:00:00.000Z",
    "title": "First major success in US Congress for two crypto bills: Law Decoded",
    "url": "https://cointelegraph.com/news/first-major-success-in-us-congress-for-two-crypto-bills-law-decoded-24-31-july",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/3b3dc5b0-93e5-4684-940d-fc6f86c53b8c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>In a 35–15 vote, the House Financial Services Committee approved the Financial Innovation and Technology for the 21st Century Act.</p>\n                    <p><p>Last week, the United States took a step <a href=\"https://cointelegraph.com/news/crypto-regulatory-framework-bill-pass-house-congressional-committee\">closer to regulatory clarity</a> for its crypto industry. In a 35–15 vote, the House Financial Services Committee (FSC) approved the Financial Innovation and Technology for the 21st Century Act. The bill is intended to <a href=\"https://cointelegraph.com/news/crypto-bills-could-change-us-landscape-explained\">establish rules for crypto firms</a> on when to register with either the Commodity Futures Trading Commission (CFTC) or the Securities and Exchange Commission (SEC).</p><p>Meanwhile, the bipartisan Blockchain Regulatory Certainty Act, sponsored by Republican Representative Tom Emmer and Democratic Representative Darren Soto, also passed a vote in the FSC. It <a href=\"https://emmer.house.gov/2021/8/emmer-introduces-legislation-to-provide-clarity-for-blockchain-innovators\" target=\"_blank\" rel=\"noopener nofollow\">aims</a> to set guidelines removing hurdles and requirements for “blockchain developers and service providers” such as miners, multisignature service providers and decentralized finance platforms.</p><p>Despite the progression of the acts, several <a href=\"https://cointelegraph.com/news/us-lawmakers-invoke-ftx-spar-direction-crypto-bills\">lawmakers refused to support</a> another proposed piece of legislation — The Digital Assets Market Structure Bill. Representative Maxine Waters condemned the bill for too closely heeding the calls of the crypto industry and ignoring regulatory guidance from the SEC.</p><p>The U.S. Senate also passed the $886 billion 2024 National Defense Authorization Act. Within the bill, <a href=\"https://cointelegraph.com/news/crypto-us-senate-approves-national-defense-bill-that-also-targets-crypto-mixers\">a crypto-related amendment was advanced</a> by a group of senators, including Cynthia Lummis, Elizabeth Warren, Kirsten Gillibrand and Roger Marshall. It will require establishing examination standards for crypto and compel the U.S. Treasury Department to perform a study aimed at cracking down on anonymous crypto transactions. This includes using crypto mixers like Tornado Cash, which are used to make transactions private.</p><h3>New capital rules for crypto holdings in Canada</h3><p>Canada’s financial watchdog is proposing changes to its capital and liquidity approach to crypto assets, according to the Office of the Superintendent of Financial Institutions (OSFI). The proposed rules will simplify institutions’ approach to perceived crypto risks, defining four categories of crypto assets and their capital treatment. The OSFI is opening public consultations on two draft guidelines until Sept. 20. One of the guidelines affects federally regulated deposit-taking institutions, such as banks and credit unions, while another addresses the regulatory capital treatment of crypto-asset exposure for insurers.</p><p><a href=\"https://cointelegraph.com/news/canada-osfi-proposes-new-capital-rules-crypto-holdings\"><strong>Continue reading</strong></a></p><h3>Russia’s CBDC gets final legal approval</h3><p>Russia is moving forward with its central bank digital currency (CBDC) as President Vladimir Putin signed the digital ruble bill into law. With this approval, the digital ruble law is officially scheduled to take effect from Aug. 1, 2023, with all but one rule ready to be enforced. Article three — which <a href=\"https://sozd.duma.gov.ru/bill/270838-8\" target=\"_blank\" rel=\"noopener nofollow\">includes</a> amendments to several Russian federal laws, including those related to bankruptcy and inheritance — is expected to take effect from August 2024.</p><p>The new legislation officially empowers the Russian central bank to launch the first CBDC pilot with real consumers. Previously, the government expected to roll out trials in April in collaboration with 13 local banks.</p><p><a href=\"https://cointelegraph.com/news/digital-ruble-putin-signs-law-on-introduction-of-digital-ruble-in-russia\"><strong>Continue reading</strong></a></p><h3>Binance seeks dismissal of CFTC lawsuit </h3><p>Crypto exchange Binance and its CEO Changpeng “CZ” Zhao requested the dismissal of a lawsuit filed by the CFTC. In a court filing, attorneys for Binance and CZ accused the CFTC of exceeding its regulatory authority and engaging in regulatory overreach. The filing states that the CFTC is attempting to regulate foreign individuals and corporations operating outside the U.S., which goes beyond the limits of its statutory jurisdiction and interferes with well-established principles of comity with foreign sovereigns.</p><p>The CFTC <a href=\"https://cointelegraph.com/news/binance-and-cz-sued-by-cftc-over-us-regulatory-violations\">initiated a lawsuit against Binance</a> in March, alleging that the company offered unregistered derivatives products in the U.S., including cryptocurrency trading services, futures and options products. The regulator also accused Binance of inadequate supervision, lacking reliable Know Your Customer or Anti-Money Laundering programs, and failing to register as a futures commissions merchant, designated contract market or swap execution facility.</p><p><a href=\"https://cointelegraph.com/news/binance-cz-challenge-cftc-seek-lawsuit-dismissal\"><strong>Continue reading</strong></a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-31T20:15:37.000Z",
    "title": "SEC sues HEX founder Richard Heart for alleged fraud and unregistered securities sales",
    "url": "https://cryptoslate.com/sec-sues-hex-founder-richard-heart-for-alleged-fraud-and-unregistered-securities-sales/",
    "description": "<p>On July 31, the U.S. Securities and Exchange Commission (SEC) filed suit against Richard Heart, the founder of blockchain projects PulseChain and HEX, for allegedly defrauding investors and selling unregistered crypto securities. The SEC said in the filing that Heart — whose legal given name is Richard Shueler — operates through three &#8220;unincorporated alter-ego entities&#8221; [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/sec-sues-hex-founder-richard-heart-for-alleged-fraud-and-unregistered-securities-sales/\">SEC sues HEX founder Richard Heart for alleged fraud and unregistered securities sales</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T20:38:15.000Z",
    "title": "Should the ECB tighten its leash on EU banks? Expert insight",
    "url": "https://www.cryptopolitan.com/should-the-ecb-tighten-its-leash-on-eu-banks/",
    "description": "The European Central Bank (ECB) stands at a crossroads where its actions will dictate the direction of the Eurozone&#8217;s banking sector. Faced with significant risks stemming from macroeconomic upheaval and a changing financial landscape, experts are urging the ECB to reevaluate its supervisory stance on the bloc&#8217;s banks. Claudia Buch, a leading candidate to become ... <a title=\"Should the ECB tighten its leash on EU banks? Expert insight\" class=\"read-more\" href=\"https://www.cryptopolitan.com/should-the-ecb-tighten-its-leash-on-eu-banks/\" aria-label=\"More on Should the ECB tighten its leash on EU banks? Expert insight\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T20:37:27.000Z",
    "title": "BALD token’s dramatic plunge: Developer denies exit scam allegations",
    "url": "https://www.cryptopolitan.com/bald-tokens-dramatic-plunge-developer-denies-exit-scam-allegations/",
    "description": "The BALD token, a new meme coin on Coinbase&#8217;s Base network, experienced a dramatic price drop of 85%, leading to allegations of an exit scam. The token, which was launched by a pseudonymous developer known as &#8220;Bald,&#8221; saw an impressive 289,000% increase within the first 14 hours of trading. However, the euphoria was short-lived as ... <a title=\"BALD token&#8217;s dramatic plunge: Developer denies exit scam allegations\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bald-tokens-dramatic-plunge-developer-denies-exit-scam-allegations/\" aria-label=\"More on BALD token&#8217;s dramatic plunge: Developer denies exit scam allegations\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T20:30:01.000Z",
    "title": "Bank of Korea announces three regions for CBDC pilot program",
    "url": "https://www.cryptopolitan.com/bank-of-korea-announces-regions-cbdc-pilot/",
    "description": "The Bank of Korea recently revealed its plans to pilot its central bank digital currency (CBDC) in three regions, bypassing the country’s capital, Seoul. The selected regions for the “private target CBDC test bed” are Jeju, Busan, and Incheon, which will serve as experimental grounds for the new digital currency. The primary objective of the ... <a title=\"Bank of Korea announces three regions for CBDC pilot program\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bank-of-korea-announces-regions-cbdc-pilot/\" aria-label=\"More on Bank of Korea announces three regions for CBDC pilot program\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T20:28:39.000Z",
    "title": "Is Worldcoin’s identity verification safe? data protection authorities on high alert",
    "url": "https://www.cryptopolitan.com/is-worldcoins-identity-verification-safe/",
    "description": "The Bavarian State Office for Data Protection Supervision (BayLDA) has initiated an investigation into the human identity verification project known as Worldcoin, citing concerns over the handling of biometric data. According to a report from Reuters on July 31, this investigation was launched in November 2022. Worldcoin&#8217;s primary objective was to differentiate real individuals from ... <a title=\"Is Worldcoin&#8217;s identity verification safe? data protection authorities on high alert\" class=\"read-more\" href=\"https://www.cryptopolitan.com/is-worldcoins-identity-verification-safe/\" aria-label=\"More on Is Worldcoin&#8217;s identity verification safe? data protection authorities on high alert\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T20:15:24.000Z",
    "title": "Curve Finance confirms the affected pools in the platform’s exploit",
    "url": "https://www.cryptopolitan.com/curve-finance-confirms-affected-pool-exploit/",
    "description": "Curve Finance, a popular decentralized exchange (DEX), recently faced a significant security breach that affected multiple Ethereum pools and an Arbitrum-based liquidity pool. The incident occurred over the weekend, leading to the theft of millions of dollars. As the situation unfolded, blockchain security firm PeckShield updated the stolen amount to an alarming $52 million. Curve ... <a title=\"Curve Finance confirms the affected pools in the platform&#8217;s exploit\" class=\"read-more\" href=\"https://www.cryptopolitan.com/curve-finance-confirms-affected-pool-exploit/\" aria-label=\"More on Curve Finance confirms the affected pools in the platform&#8217;s exploit\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T20:10:00.000Z",
    "title": "Latin American countries are going hard for yuan",
    "url": "https://www.cryptopolitan.com/latin-american-countries-going-hard-for-yuan/",
    "description": "As the world&#8217;s economic landscape shifts, Latin American countries like Argentina and Bolivia are increasingly turning to the Chinese yuan for international transactions. This growing preference for the yuan reflects the evolving dynamics of global economics and a strategic alignment with Chinese financial mechanisms. Argentina&#8217;s reliance on the yuan for IMF payments Argentina&#8217;s complicated financial ... <a title=\"Latin American countries are going hard for yuan\" class=\"read-more\" href=\"https://www.cryptopolitan.com/latin-american-countries-going-hard-for-yuan/\" aria-label=\"More on Latin American countries are going hard for yuan\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T20:01:00.000Z",
    "title": "Hong Kong crypto companies face banking challenges",
    "url": "https://www.cryptopolitan.com/hong-kong-crypto-companies-banking-challenge/",
    "description": "Hong Kong’s ambition to establish itself as a thriving crypto hub is facing hurdles as licensed crypto companies encounter difficulties in obtaining corporate bank accounts. Despite the local government’s push for the territory to embrace the cryptocurrency industry, limited staffing at the Securities and Futures Commission and hesitancy from banks have led to these obstacles. ... <a title=\"Hong Kong crypto companies face banking challenges\" class=\"read-more\" href=\"https://www.cryptopolitan.com/hong-kong-crypto-companies-banking-challenge/\" aria-label=\"More on Hong Kong crypto companies face banking challenges\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-31T19:45:52.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "Kraken Blog",
    "date": "2023-07-31T20:11:11.000Z",
    "title": "Cryptowatch to sunset: Kraken Pro to integrate Cryptowatch features",
    "url": "https://blog.kraken.com/product/cryptowatch-to-sunset-kraken-pro-to-integrate-cryptowatch-features",
    "description": "We’re looking forward to welcoming Cryptowatch users to experience the advanced trading capabilities of the new Kraken Pro interface. Built to cater to the most discerning traders, Kraken Pro isn&#8217;t just a spot trading platform – it enables margin and futures trading, as well as staking options, broadening the scope of your crypto trading strategies. [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-31T20:00:57.000Z",
    "title": "BALD Coin Rug Pull: How A $100 Million Memecoin Became Worthless Overnight",
    "url": "https://www.newsbtc.com/news/bald-coin-rug-pull-how-a-100-million-memecoin-became-worthless-overnight/",
    "description": "On July 30, a meme coin called BaldBaseBald (BALD) launched on Base Network, Coinbase&#8217;s new Layer 2 built on Optimism. The coin referenced Brian Armstrong, Coinbase&#8217;s “bald” founder, and quickly became a coordination point for speculators on the frontier chain.  Within two days, the token had reached a market cap of $100 million, with over $25 million in liquidity. However, the token&#8217;s meteoric rise turned out to be a classic case of market manipulation, as the deployer behind the token, BaldBaseBald, rug pulled the token and caused its price to plummet by 85%. Malicious Market Behavior Behind BALD? Market researcher Thiccy indexed all the transactions from the Bald deployer and uncovered a story of malicious market behavior. BaldBaseBald added over 6,700 ETH, or over $12.5 million worth of liquidity, to the pool in the first 24 hours, a surprising amount of capital for a meme coin on a new chain.  Related Reading: Breaking: HEX Token Plummets 25% Following SEC Lawsuit Against Founder Richard Heart The deployer&#8217;s actions were undoubtedly bullish for speculators, and many people speculated that Brian Armstrong had created the coin to drum up hype. However, as soon as the deployer stopped adding liquidity to the pool, the price stagnated and broke down.  24 hours later, the deployer started bidding on BALD again, causing the price to double. Then, the deployer withdrew over 10.500 Ethereum (ETH), or almost $20 million worth of liquidity, leading to an 85% drop in the token&#8217;s value. Thiccy&#8217;s analysis showed that the deployer had made a net profit of 2,789 ETH, or 5.2 million dollars, after adding 6,870 ETH, spending 1,360 ETH buying at an average price of 0.0004, and withdrawing 10,704 ETH.  It was surprising how well-capitalized the actor was and how bold they were in carrying out this apparent manipulative market behavior in the middle of the public light on Coinbase&#8217;s compliance chain. Thiccy Concluded: And with that, the story of BALD has come to a close play stupid games, win stupid prizes. Hopefully we can learn from this as a space this market is rife with market manipulation and unethical shills. Be careful who you trust. Thiccy advises investors to control their Fear of Missing Out (FOMO) and not risk more than they can afford to lose, as survival is too important in this game.  Related Reading: 8-Year Dormant Ethereum Wallet Just Moved $1.2 Million In ETH, Here’s The Destination As for BaldBaseBald has removed the rest of the liquidity, bringing their total Profit and Loss (PnL) to 3,163 ETH, or $5.9 million.  Featured image from iStock, chart from TradingView.com "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-31T20:22:23.000Z",
    "title": "VeChain Shines in Groundbreaking Master Thesis: Pioneering Blockchain Technology to Revolutionize Business Operations",
    "url": "https://www.crypto-news-flash.com/vechain-shines-in-groundbreaking-master-thesis-pioneering-blockchain-technology-to-revolutionize-business-operations/?utm_source=rss&utm_medium=rss&utm_campaign=vechain-shines-in-groundbreaking-master-thesis-pioneering-blockchain-technology-to-revolutionize-business-operations",
    "description": "<img width=\"1280\" height=\"768\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"VeChain blockchain\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock-1024x614.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/VeCHain-Den-Rise-Shutterstock-48x29.jpg 48w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />VeChain has its own blockchain-based food-safety solution VeChain Toolchain which helps food industry businesses quickly deploy blockchain technology at their end. The VeChain ToolChain™ food safety solution is known for its high standardization, low cost, and flexibility in the market. Over the past few years, developers have been building blockchain platforms that cater to different [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-31T20:00:37.000Z",
    "title": "Crypto Analyst Issues Solana (SOL) Warning, Gives Updates on Bitcoin (BTC) and Chainlink (LINK)",
    "url": "https://dailyhodl.com/2023/07/31/crypto-analyst-issues-solana-sol-warning-gives-updates-on-bitcoin-btc-and-chainlink-link/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/04/bullish-on-solana-one.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/04/bullish-on-solana-one.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/04/bullish-on-solana-one.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/04/bullish-on-solana-one.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/04/bullish-on-solana-one.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/04/bullish-on-solana-one.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/04/bullish-on-solana-one.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto analyst is giving his latest takes on Ethereum (ETH) rival Solana (SOL), decentralized oracle network Chainlink (LINK) and top digital asset Bitcoin (BTC). The pseudonymous analyst known as Inmortal tells his 195,000 Twitter followers that Solana is set for a big breakout, but not after a serious fakeout to the downside. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/31/crypto-analyst-issues-solana-sol-warning-gives-updates-on-bitcoin-btc-and-chainlink-link/\">Crypto Analyst Issues Solana (SOL) Warning, Gives Updates on Bitcoin (BTC) and Chainlink (LINK)</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-31T19:55:54.000Z",
    "title": "Ethereum (ETH) To Witness Massive Liquidation Event Amid Slowing DeFi Ecosystem: Nicholas Merten",
    "url": "https://dailyhodl.com/2023/07/31/ethereum-eth-to-witness-massive-liquidation-event-amid-slowing-defi-ecosystem-nicholas-merten/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/to-Monitor-Ethereum-Network.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/to-Monitor-Ethereum-Network.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/to-Monitor-Ethereum-Network.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/to-Monitor-Ethereum-Network.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/to-Monitor-Ethereum-Network.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/to-Monitor-Ethereum-Network.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/to-Monitor-Ethereum-Network.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Crypto analyst Nicholas Merten says there is now a big risk of a major liquidation event that could cause Ethereum (ETH) to break down to significantly lower levels. The host of DataDash tells his 511,000 YouTube subscribers that over-leveraged traders who deposited their ETH as collateral using decentralized finance (DeFi) protocols could be forced to [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/31/ethereum-eth-to-witness-massive-liquidation-event-amid-slowing-defi-ecosystem-nicholas-merten/\">Ethereum (ETH) To Witness Massive Liquidation Event Amid Slowing DeFi Ecosystem: Nicholas Merten</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]