[
  {
    "source": "Crypto Daily",
    "date": "2023-11-23T19:36:54.000Z",
    "title": "Crypto Analyst Dan Gambardello Predicts Cardano To $11, While New Token Emerges, Ripple To Soar 40%",
    "url": "https://cryptodaily.co.uk/2023/11/crypto-analyst-dan-gambardello-predicts-cardano-to-11-while-new-token-emerges-ripple-to-soar-40",
    "description": "Crypto analyst, Dan Gambardello, has recently made headlines with his bullish Cardano price forecast."
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-11-23T19:15:28.000Z",
    "title": "CAGA Crypto’s Quantum Leap: Liquid Staking, Governance, and Listings on Gate.io and Bitmart",
    "url": "https://news.bitcoin.com/caga-cryptos-quantum-leap-liquid-staking-governance-and-listings-on-gate-io-and-bitmart/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/untitled-54-copy-1-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/11/untitled-54-copy-1-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/untitled-54-copy-1-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/untitled-54-copy-1-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/untitled-54-copy-1-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/untitled-54-copy-1-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/untitled-54-copy-1-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/11/untitled-54-copy-1.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />PRESS RELEASE. USA, New York, November 23, 2023 &#x2013; In the dynamic realm of decentralized finance (DeFi), CAGA Crypto emerges as a remarkable example of innovation and community-driven governance. As it prepares for listing on major centralized exchanges &#x2013; Gate.io, Bitmart, the crypto community is abuzz with anticipation. Here&#x2019;s an exclusive look into the groundbreaking [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-23T19:30:49.000Z",
    "title": "Trader: Bitcoin Will Inevitably Breeze Past $70,000—Here’s Why",
    "url": "https://www.newsbtc.com/bitcoin-news/trader-bitcoin-will-inevitably-breeze-past-70000-heres-why/",
    "description": "Taking to X on November 22, crypto chartist @MortensenBach presented a bullish outlook for Bitcoin (BTC), predicting that not only will the coin breeze past $70,000 in the coming months, but it will set a new all-time high, fanning demand for stocks of Bitcoin mining companies like Riot Blockchain, Marathon Digital, and the rest. Bitcoin Trading Above The 20-Period MA In The Monthly Chart The chartist pointed to Bitcoin&#8217;s historical tendency to launch parabolic advances following decisive breaks above its 20-month simple moving average (20 SMA) in the monthly chart. As of late November 2023, Bitcoin has been firm. As evidenced in the monthly chart, buyers build on gains recorded in October when prices shook off losses and increased. This upswing was triggered by broader market optimism, which supported crypto prices.  With prices now trending firmly above the dynamic reaction line in the monthly chart, the trader believes a bull market is on the cards, and Bitcoin is set for more gains in the coming sessions. Besides the break above the 20-month MA, the analyst notes a growing bullish momentum, according to MACD, a technical indicator. Related Reading: HTX Recommence Operations After Temporary Halt Due to Hack Still, it should be noted that, despite the analyst&#8217;s optimism, technical indicators in use, the MACD and MA, lag. Accordingly, there is no guarantee that prices will edge higher, rising from spot levels to nearly double above $70,000 in 2024 and months ahead. As of November 23, BTC prices are firm above $37,000 and more than 2X from November 2022 lows when prices plunged below $16,000. Moreover, it is yet to be seen how stocks of Bitcoin mining companies like Riot Blockchain will perform in the next stage after halving. However, historical performances show their stock tends to rally in lockstep with spot BTC prices.  Whales Are Accumulating, Will BTC Surge? Even so, @MortensenBach&#8217;s preview analysis ties closely to on-chain insights relayed by CryptoQuant, a blockchain analytics platform. According to data, more whales are moving their BTC from exchanges in large tranches.  With big players showing confidence and backing Bitcoin, it could suggest that they expect prices to edge higher. This outlook if further buoyed by developing fundamental factors, including regulatory action and general investor sentiment. Related Reading: FTX’s FTT Token Leads Market Gains With 55% Rally, What’s Driving It? Bitcoin prices shook off the effect of the United States Department of Justice&#8217;s ruling on Binance. Though prices slightly dipped below $37,000, bulls are back, and the coin is trending above $37,000. The market is tracking the Securities and Exchange Commission (SEC) to approve the first spot Bitcoin ETF in the country. Feature image from Canva, chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-23T19:25:36.000Z",
    "title": "Bank of Korea’s Governor Delays CBDC Launch as South Korea Awaits US and Europe – Millions Flock to Monero, Dash, and ZCash",
    "url": "https://www.crypto-news-flash.com/bank-of-koreas-governor-delays-cbdc-launch-as-south-korea-awaits-us-and-europe-millions-flock-to-monero-dash-and-zcash/?utm_source=rss&utm_medium=rss&utm_campaign=bank-of-koreas-governor-delays-cbdc-launch-as-south-korea-awaits-us-and-europe-millions-flock-to-monero-dash-and-zcash",
    "description": "<img width=\"1280\" height=\"853\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/calculator-820330_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/11/calculator-820330_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/calculator-820330_1280-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/calculator-820330_1280-1024x682.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/calculator-820330_1280-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/11/calculator-820330_1280-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Bank of Korea Governor Rhee Chang-yong has stated that South Korea will not issue its CBDC ahead of the U.S. and Europe. The governor has admitted there are minimum benefits of becoming the leader in issuing central bank digital currencies. South Korea has announced that it will be delaying the issuance of its Central Bank [...]"
  }
]