[
  {
    "source": "CoinDesk",
    "date": "2023-10-17T13:00:00.000Z",
    "title": "BitGo Buys Crypto Wealth Management Platform HeightZero",
    "url": "https://www.coindesk.com/business/2023/10/17/bitgo-buys-crypto-wealth-management-platform-heightzero/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "HeightZero handles portfolio rebalancing, statement generation, tax loss harvesting and automated billing for crypto clients."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-17T13:01:11.000Z",
    "title": "NFT Creator Royalties Are Broken—Yuga Labs and Magic Eden Join Group Trying to Fix Them",
    "url": "https://decrypt.co/201917/yuga-labs-magic-eden-join-collective-rethinking-nft-creator-royalties",
    "description": "The Open Metaverse Alliance has tapped industry leaders—including Bored Ape creator Yuga Labs—to help develop new NFT royalty standards."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-17T13:01:02.000Z",
    "title": "The Sandbox Hires Ex-PlayStation, Apple Exec to Drive Game's Creator Economy",
    "url": "https://decrypt.co/201877/the-sandbox-hires-ex-playstation-apple-exec-to-drive-games-creator-economy",
    "description": "Nicola Sebastiani, who previously worked at Ubisoft and PlayStation, is joining The Sandbox to lead its creator economy push."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-17T12:55:17.000Z",
    "title": "What Is Wearable Tech: Smart Clothing, Jewelry, and Other Stuff on Your Body",
    "url": "https://decrypt.co/resources/what-is-wearable-tech-smart-clothing-jewelry-and-other-stuff-on-your-body",
    "description": "When people think of wearable technology today, they likely picture smart watches, fitness trackers, virtual reality headsets, and similar products. The history of wearable tech is an important part of the longstanding connection between the fashion world and the technology sector and in fact extends back to well before those products existed. Wearable tech is [&hellip;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T13:08:10.000Z",
    "title": "European SaaS and Cloud Services Rebounding in 2023",
    "url": "https://www.cryptopolitan.com/european-saas-and-cloud-services-rebounding/",
    "description": "A recent report by venture capital firm Accel, titled the &#8220;2023 Euroscape Report,&#8221; reveals that European software-as-a-service (SaaS) and cloud services startups are experiencing a resurgence, propelled by the transformative power of Generative AI (GenAI). The report highlights that while investment in these sectors had dipped due to the COVID-19 pandemic, it has now returned ... <a title=\"European SaaS and Cloud Services Rebounding in 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/european-saas-and-cloud-services-rebounding/\" aria-label=\"More on European SaaS and Cloud Services Rebounding in 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T13:07:46.000Z",
    "title": "Predictive Maintenance: Leveraging Data for Efficient Asset Management",
    "url": "https://www.cryptopolitan.com/leveraging-data-efficient-asset-management/",
    "description": "In the ever-evolving landscape of technological advancements, businesses must remain vigilant in optimizing their assets, particularly as these assets mature and maintenance becomes increasingly challenging. Thankfully, the adoption of predictive maintenance has emerged as a powerful strategy for harnessing the wealth of data available to enhance operational efficiency and overall business performance. Advancing digital transformation ... <a title=\"Predictive Maintenance: Leveraging Data for Efficient Asset Management\" class=\"read-more\" href=\"https://www.cryptopolitan.com/leveraging-data-efficient-asset-management/\" aria-label=\"More on Predictive Maintenance: Leveraging Data for Efficient Asset Management\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T12:50:35.000Z",
    "title": "Tech Giants Witness $2.4 Trillion Surge in Market Cap Fueled by AI in 2023",
    "url": "https://www.cryptopolitan.com/tech-witness-2-4-trillion-surge-in-market/",
    "description": "In a year defined by the fervor surrounding generative artificial intelligence (AI), U.S. tech giants experienced a staggering $2.4 trillion increase in their market capitalizations, according to the latest report from venture capital firm Accel. This substantial growth was driven by advancements in AI technologies and their profound impact on various industries. Tech heavyweights soar ... <a title=\"Tech Giants Witness $2.4 Trillion Surge in Market Cap Fueled by AI in 2023\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tech-witness-2-4-trillion-surge-in-market/\" aria-label=\"More on Tech Giants Witness $2.4 Trillion Surge in Market Cap Fueled by AI in 2023\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T12:49:52.000Z",
    "title": "Bank of Canada Staff Note Examines DeFi’s Impact and Challenges",
    "url": "https://www.cryptopolitan.com/bank-of-canada-examines-defis-impact/",
    "description": "The Bank of Canada has released a comprehensive staff note on decentralized finance (DeFi) on October 17, shedding light on the innovative features that have propelled its popularity while also highlighting the challenges and risks associated with its utilization. DeFi&#8217;s multi-layered structure Described as a multi-layered structure, DeFi primarily relies on the Ethereum blockchain as ... <a title=\"Bank of Canada Staff Note Examines DeFi&#8217;s Impact and Challenges\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bank-of-canada-examines-defis-impact/\" aria-label=\"More on Bank of Canada Staff Note Examines DeFi&#8217;s Impact and Challenges\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-17T12:43:36.000Z",
    "title": "British Government Confirms Crypto Holdings Exempt from “Help with Fees” Scheme Assessment",
    "url": "https://www.cryptopolitan.com/british-government-on-crypto-holdings-exempt/",
    "description": "In a recent announcement by the Ministry of Justice, it has been clarified that British citizens hoping to access legal assistance through the proposed &#8220;Help with Fees&#8221; (HwF) scheme will not have their cryptocurrency holdings classified as disposable income. The HwF scheme is aimed at providing financial support for court or tribunal fees to individuals ... <a title=\"British Government Confirms Crypto Holdings Exempt from &#8220;Help with Fees&#8221; Scheme Assessment\" class=\"read-more\" href=\"https://www.cryptopolitan.com/british-government-on-crypto-holdings-exempt/\" aria-label=\"More on British Government Confirms Crypto Holdings Exempt from &#8220;Help with Fees&#8221; Scheme Assessment\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-17T13:00:59.000Z",
    "title": "BlackRock Reacts To False Bitcoin Spot ETF Approval News In A Positive Way",
    "url": "https://www.newsbtc.com/news/bitcoin/blackrock-false-bitcoin-spot-etf/",
    "description": "Investment management firm Blackrock has reacted to rumors about the approval of its Bitcoin Spot ETF application by the United States Securities and Exchange Commission (SEC) which caused quite a stir among the cryptocurrency community. Blackrock CEO Responds To Claims On Bitcoin Spot ETF On Monday, crypto news outlet CoinTelegraph posted on X (formerly Twitter) that the US Security and Exchange Commission (SEC) had approved a long-anticipated application of Bitcoin Spot ETF, but later retracted the report. However, the post sparked excitement within the crypto community causing the Bitcoin price to rise rapidly. Related Reading: Bloomberg Analyst Predicts Likelihood Of A Spot Bitcoin ETF By January 2024 The cryptocurrency&#8217;s price surged to almost $30,000 earlier in the day after the alleged post was made by Cointelegraph yesterday. However, the cryptocurrency&#8217;s price fell almost immediately after the report was proven to be false by Blackrock&#8217;s Chief Executive Officer Larry Fink and other prominent voices in the crypto community. Eleanor Terrett was the first to report that this news was false after speaking with BlackRock and that the company&#8217;s Bitcoin Spot ETF is still under review by the US regulator.  BTC spikes following fake Spot BTC ETF approval news &#124; Source: BTUCSD on Tradingview.com In an interview with Fox Business, Fink, who said he only learned about the ‘news’ hours later due to him being extremely busy all day, took a rather positive stance on the event. According to the CEO, noting that Monday&#8217;s event solely proved the worldwide need and desire for a Bitcoin spot ETF. &#8220;I think the rally today is about a flight to quality, with all the issues around the Israeli war now, global terrorism,” Fink said. “I think there are more people running into a flight to quality, whether that is in Treasuries, gold, or crypto, depending on how you think of it. And I believe crypto will play that type of role, as a flight to quality.” Related Reading: Bitcoin Whale Addresses See Unprecedented Jump, Is $30,000 Possible? The SEC also confirmed that the alleged news report was false and that the application is still pending. &#8220;Careful what you read on the internet. The best source of information about the SEC is the SEC.&#8221; the post read. So far, CoinTelegrah has apologized with a post on X for the false report it posted &#8220;which led to the dissemination of inaccurate information.&#8221; The crypto media outlet later posted the result of its internal investigation which showed a team member had posted the ‘news’ without getting approval from its editorial team. Crypto tracker, Coinglass revealed that short trading positions held by investors betting on lower prices were liquidated to the tune of over $104 million within 24 hours due to the false news. Featured image from Shutterstock, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-17T13:04:55.000Z",
    "title": "Top Reasons Why This BTC Alternative Has 100x Potential and Shiba Inu Doesn’t",
    "url": "https://www.crypto-news-flash.com/top-reasons-why-this-btc-alternative-has-100x-potential-and-shiba-inu-doesnt/?utm_source=rss&utm_medium=rss&utm_campaign=top-reasons-why-this-btc-alternative-has-100x-potential-and-shiba-inu-doesnt",
    "description": "<img width=\"512\" height=\"353\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-76.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-76.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-76-300x207.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the dynamic crypto arena, new projects and technologies often arise with better alternatives or options. A Bitcoin alternative making waves in the crypto arena presents an exceptional potential that outshines most players, including the once-disruptive Shiba Inu. As SHIB’s hype fizzles, investors and enthusiasts seek options, and Bitcoin Spark, with its 100X potential, becomes [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-17T13:00:35.000Z",
    "title": "Roblox Embraces XRP for Seamless Gaming Transactions",
    "url": "https://www.crypto-news-flash.com/roblox-embraces-xrp-for-seamless-gaming-transactions/?utm_source=rss&utm_medium=rss&utm_campaign=roblox-embraces-xrp-for-seamless-gaming-transactions",
    "description": "<img width=\"512\" height=\"473\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-74.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" loading=\"lazy\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-74.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-74-300x277.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Roblox adopts XRP for in-game purchases through Xsolla and BitPay. A significant move indicating the growing adoption of digital currency in the gaming world. Gaming Giant Roblox Adds Ripple’s XRP to Payment Options In a progressive move for the fusion of cryptocurrency and gaming, Roblox, one of the largest online gaming platforms, has integrated Ripple’s [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-10-17T13:04:50.000Z",
    "title": "Will You Have to Use a Digital ID to Use CBDCs?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/will-you-have-to-use-a-digital-id-to-use-cbdcs/",
    "description": "<p>To harness the full potential of CBDCs, a robust digital identification (ID) system is essential. This article delves into the necessity of a digital ID system for using CBDCs. Highlighting examples from around the world and examining the pros and cons associated with these systems. The Role of Digital ID in CBDCs A CBDC is [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/will-you-have-to-use-a-digital-id-to-use-cbdcs/\">Will You Have to Use a Digital ID to Use CBDCs?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-17T12:57:00.000Z",
    "title": "Cardano’s Charles Hoskinson Takes on the Market In ADA’s Defense",
    "url": "https://coinedition.com/cardanos-charles-hoskinson-takes-on-the-market-in-adas-defense/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/03/Cardano-ADA-Turning-Heads.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano ADA Turning Heads\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/03/Cardano-ADA-Turning-Heads.jpg 730w, https://coinedition.com/wp-content/uploads/2023/03/Cardano-ADA-Turning-Heads-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/03/Cardano-ADA-Turning-Heads-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/03/Cardano-ADA-Turning-Heads-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/03/Cardano-ADA-Turning-Heads-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/03/Cardano-ADA-Turning-Heads-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Cardano’s (ADA) founder Charles Hoskinson is in the news again, and as expected, he has been caught up in another round of controversy. A few weeks back, Hoskinson had argued that ADA was outperforming Solana (SOL) in terms of its price action. But on October 17, Michael Deckard, a user on X (formerly Twitter) gave [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/cardanos-charles-hoskinson-takes-on-the-market-in-adas-defense/\">Cardano’s Charles Hoskinson Takes on the Market In ADA’s Defense</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]