[
  {
    "source": "CoinDesk",
    "date": "2023-06-16T10:42:50.000Z",
    "title": "Binance Under Investigation in France, Accused of 'Aggravated' Money Laundering",
    "url": "https://www.coindesk.com/policy/2023/06/16/binance-under-investigation-in-france-accused-of-aggravated-money-laundering/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Binance is accused of illegally canvassing local customers outside of the legal framework, and for implementing poor money laundering checks."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-16T10:49:30.000Z",
    "title": "Bitcoin in Cuba: why some Cubans are adopting BTC to escape ‘The Matrix’ ",
    "url": "https://cointelegraph.com/news/bitcoin-in-cuba-interview-btc-advocate",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/18f674bf-dc67-49fd-9858-6aa3e9b5377d.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Private businesses could be poised to benefit from the cryptocurrency revolution in one of the world’s harshest business environments - Cuba.</p>\n                    <p><p>Bitcoin adoption could swell in Cuba, particularly if private businesses understand the upside to accepting Bitcoin as currency. That’s according to a Cuban businessperson and Bitcoin advocate, Erich Garcia Cruz.</p><p>A recent emigrant to the United States, Cruz is a vocal proponent of Bitcoin adoption in Cuba. Cruz leads the remittance and money transfer services BitRemesas and QvaPay and has been outspoken in his support for his countrymen using Bitcoin since 2020. </p><p>In an interview with Cointelegraph as part of an upcoming documentary, Cruz explained that Cubans can use Bitcoin “as a tool.” </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/aaae66ee-de0f-4d5d-a990-1f704c8dbb80.png\"  /><figcaption style=\"text-align: center;\"><em>Photo of Erich and Joe during interview.</em></figcaption></figure><p>While some Cubans use Bitcoin as a store of value, a means of exchange, or a remittance tool, ultimately it’s about getting “out from the Matrix,” he explained. Cruz referred to the country’s centrally planned, and officially communist, economy. </p><p>There is no independent press in Cuba, while the historic United States trade embargo makes it very hard for Cubans to access American products, services, and even applications. Bitcoin is money independent of the state and has no leader or central party. </p><p>Cruz explained that during a visit to El Salvador in 2022, one of his friends asked “How do you teach about Bitcoin in Cuba if Cuba is run by a communist party?” Surely the party would be against Bitcoin?</p><blockquote>“I don't know if the government doesn’t know just how powerful Bitcoin is; they don't know, and they are just thinking I'm teaching the people about coins in the casino, or if they are afraid of the hyper-Bitcoinization of the Cuban society.”</blockquote><p>Cruz hints that the government may already have an understanding of how Bitcoin works, and maybe, “They can bypass some sanctions worldwide” using internet-based money. </p><p>Plus, since 2021 the government has been warming up to cryptocurrencies: private businesses can legally accept cryptocurrencies such as Bitcoin for goods and services. Cruz explains that more and more private businesses should accept cryptocurrency instead of the Cuban currencies of the Peso or the MLC (Moneda Libremente Convertible / freely convertible currency”):</p><blockquote>“If you get paid with CUP or MLC, you are solving the customer’s problem, but you are creating a problem for you because owners are saying that then or later they will try to convert the CLP or MLC into international currency.”</blockquote><p>The Cuban Peso has devalued by more than 800% since its inception. If a Cuban bought the absolute top of the Bitcoin bull run, $69,000, they would still have more value in Bitcoin than Pesos. Moreover, the MLC is a government-backed stablecoin used for purchases in state-run supermarkets. Cubans looking to save money typically do so in the US Dollar, and increasingly, Bitcoin.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/bf0819e7-771c-4197-ace2-244947e80661.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>MLC price movement as compared to USD and EUR since 2015.</em></figcaption></figure><p>Cruz shares the example of his father who bought a small amount of Bitcoin with his Cuban peso pension fund three years ago. The pension fund has dramatically lost value, as the Cuban Peso continues to devalue, while Bitcoin has not only retained, but also increased in purchasing power: </p><blockquote>“It’s not financial advice but it's better to store your value in Bitcoin than the CUP–a government-issued shitcoin.”</blockquote><p>Nonetheless, despite the huge currency devaluation, Bitcoin suffers from a bad reputation in Cuba. Cruz was scammed by a crypto project before learning what Bitcoin is.</p><blockquote>“We have no internet [in Cuba] until five years ago and Bitcoin is 14 years old. The first contact with Bitcoin in our society was through scams.”</blockquote><p>Cuba has a highly educated population and university education is free, however, the island is sheltered from western influences and the internet is a relatively new tool. The internet, as Cruz points out, only began to penetrate the country in a meaningful way over the past five years.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/cuba-bitcoin-community-hosts-btc-only-meetup\"><strong><em>Cuba Bitcoin community hosts BTC-only meetup</em></strong></a></p><p>Cruz’ work and that of the <a href=\"https://cointelegraph.com/news/cuba-bitcoin-community-hosts-btc-only-meetup\">Cuban Bitcoin community</a> targets private businesses in Cuba; an area in which Bitcoin adoption could thrive:</p><blockquote>“You have to teach the people who have the power to embrace that solution. And that's the private sector. Okay? There is no law. There is no law that forbids the business from accepting Bitcoin. Not yet.”</blockquote><p>Cruz’ interview will feature in an upcoming documentary about Bitcoin in Cuba. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/real-bedford-soccer-team-puts-bitcoin-on-the-map/\"><strong><em>Peter McCormack’s Real Bedford Football Club puts Bitcoin on the map</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-06-16T10:45:53.000Z",
    "title": "Russia eyes crypto mining legalization by 2024",
    "url": "https://cryptoslate.com/russia-eyes-crypto-mining-legalization-by-2024-with-specialized-authorized-mining-organizations/",
    "description": "<p>Crypto mining could be legal in Russia as soon as 2024, according to the Chairman of the State Duma Committee on Financial Market Anatoly Aksakov. Aksakov remarked at the 2023 St Petersburg International Economic Forum on the role mining can play in the Russian economy. According to the event&#8217;s English interpreter, the legislator stated that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/russia-eyes-crypto-mining-legalization-by-2024-with-specialized-authorized-mining-organizations/\">Russia eyes crypto mining legalization by 2024</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-16T11:09:33.000Z",
    "title": "WIN NFT HERO Coming Soon to the APENFT Launchpad with Limited Release of the New HERO Mystery Box",
    "url": "https://cryptodaily.co.uk/2023/06/win-nft-hero-coming-soon-to-the-apenft-launchpad-with-limited-release-of-the-new-hero-mystery-box",
    "description": "<p>Singapore, Singapore, June 16th, 2023, Chainwire</p><p>WIN NFT HERO, a strategy game built on Tron, has been garnering a lot of attention. Following the official launch of the game&rsquo;s v2.0 and the new HERO system in April 2023, WIN NFT HERO officially launched v2.1 with an open beta test on June 1. Along with that news, an official announcement was made that the S1 Million Dollar Season event will be launched on June 15.</p><p>According to the official announcement, WIN NFT HERO S1 season game scenario is a PvP points tournament. Only players with 3N and above quality heroes can participate. WIN NFT HERO's S1 season event includes an abundance of $NFT, $WIN, $WNH and high-quality NFT rewards.</p><p>New players who want to participate in the WIN NFT HERO S1 season must first obtain a HERO NFT. The cost of the WIN NFT HERO depends upon what version it is. There are 5 qualities to choose from, ranging from low to high: N (green), R (blue), SR (purple), SSR (orange), and UR (red). The higher the quality of the HERO, the stronger the HERO is.&nbsp;</p><p>Currently, the WIN NFT HERO game contains a total of 58 heroes in 11 lineups, 19 of which are new heroes added when v2.0 was launched. Since the new heroes have different attributes, skills, bond effects, etc., players with new heroes will be able to experiment with more strategic combinations as well as have a greater advantage in matchmaking.</p><p>To celebrate the upcoming S1 season and help players achieve better scores, WIN NFT HERO announced that a new Hero Mystery Box sale will go live on APENFT Launchpad on June 16, 2023. 200 Hero Mystery Boxes will be available, priced at 10 USDD per box. Each box will include five new heroes, distributed according to the rarity.</p><p>These limited v2.1 HERO Mystery Boxes are exclusive to the APENFT Launchpad. As the S1 season approaches, expect these highly scarce new HERO NFTs to be even more popular.</p><p></p><p>About WIN NFT HERO</p><p>WIN NFT HERO is a \"GameFi + NFT\" strategy game, built on the TRON blockchain. It offers all kinds of heroes, equipment, and other NFT in-game assets for individual players to enjoy as they play, earn, and collect.</p><p>WIN NFT HERO requires players to match different strategic formations according to hero attributes in order to win on the battlefield. The goal of WIN NFT HERO is simple &ndash; to unite players around the world through blockchain gaming with a shared economy that transcends real world values. This &ldquo;GameFi + NFT&rdquo; game provides players with an unprecedented experience in immersive entertainment.</p><p>Learn more about WIN NFT HERO at their:</p><p>Website&#65306;https://www.winnfthero.io/</p><p>Twitter: https://twitter.com/winnfthero</p><p>Telegram: https://t.me/WINNFTHEROEN</p><p>Discord: https://discord.gg/j9jsQKXq8M</p><p>Media Contact</p><p>Jane Ho</p><p>product@winnfthero.io</p><p></p><p>About APENFT Marketplace</p><p>APENFT Marketplace is an NFT trading platform native to the TRON blockchain, launched by the APENFT Foundation, with additional support from the world&rsquo;s largest distributed storage system BitTorrent File System (BTFS). It provides a range of NFT-related services, including NFT minting, trading, and creation. By converting more artworks as NFTs and bringing more GameFi projects on the blockchain, APENFT Marketplace not only makes art unique and eternal but also boosts transparency in the exchange and transmission. With higher speed and zero transaction fees, APENFT Marketplace helps boost a more diverse ecosystem and a stronger community.</p><p>The APENFT utility token ($NFT) is the official governance token issued by the APENFT Foundation. It is a decentralized digital asset that is backed by TRC-20 protocols, and serves as proof of rights on APENFT. With the designation of TRON as the national blockchain for the Commonwealth of Dominica, $NFT has been granted statutory status as authorized digital currency and medium of exchange in the country effective on October 7th, 2022. Currently, $NFT is traded on over 27 CEXs and DEXs including OKX, Huobi, KuCoin, Bybit, Uniswap, PancakeSwap, and SunSwap.</p><p>Learn more about APENFT at their:</p><p>Website: https://apenft.io/</p><p>Twitter: https://twitter.com/apenftorg</p><p>Telegram: https://t.me/apenftEN</p><p>Discord: https://discord.gg/Hq8GETYTrD</p><p></p>ContactLorna Hecontact@apenft.io"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-16T10:44:00.000Z",
    "title": "FDIC Accuses OKCoin Of Misleading Customers",
    "url": "https://cryptodaily.co.uk/2023/06/fdic-accuses-okcoin-of-misleading-customers",
    "description": "<p>Crypto exchange OKCoin has come under the scrutiny of the Federal Deposit Insurance Corporation (FDIC) over accusations of making false promises to customers.&nbsp;</p>\nFDIC-Insured Accounts - False Claims\n<p>On June 15, 2023, the FDIC addressed a cease-and-desist to the CEO of OKCoin, Hong Fang, intimating the latter of a potential violation of the Federal Deposit Insurance Act. According to the government agency, the company has falsely claimed a level of customer protection that it does not provide.</p>\n<p>The letter claims that OKCoin has misrepresented the extent to which customer assets are protected by federal deposit insurance. The FDIC insurance, which only covers traditional bank accounts, does not extend to customer accounts on crypto exchanges. In its list of offerings, OKCoin stated that it offers &ldquo;FDIC-insured accounts,&rdquo; which is a misrepresentation. The FDIC claimed that this misrepresentation makes a false promise to the customers and misguides them into making riskier moves due to this false sense of security.&nbsp;</p>\nFDIC Issues Cease-And-Desist\n<p>In the letter, the FDIC sought to bring the discrepancy to the attention of the firm and asked them to take corrective steps to alert customers about the limitations of their services.&nbsp;</p>\n<p>An excerpt from the letter reads,&nbsp;</p>\n\n<p>&ldquo;OKCoin is not FDIC-insured and the FDIC does not insure non-deposit products. By not distinguishing between U.S.-dollar deposits and crypto assets, the statements imply FDIC insurance coverage applies to all customer funds (including crypto assets).&rdquo;</p>\n\n<p>The agency pointed out that users and potential customers should be properly intimated about all the risks associated with cryptocurrencies. The FDIC also claimed that the crypto firm needs to further explicitly clarify the lack of regulatory protections on crypto held on its exchange.&nbsp;</p>\n<p>In order to properly inform the customers of this information, the government agency has asked the company to review its marketing materials, website content, and other public statements.&nbsp;</p>\nOKCoin To Revise Communication\n<p>The FDIC's intervention serves as a reminder of the regulatory challenges surrounding the rapidly evolving cryptocurrency space. As the popularity and adoption of cryptocurrencies increase, regulatory bodies are striving to keep pace with emerging risks and ensure consumer protection.&nbsp;</p>\n<p>OKCoin, founded in 2013, is one of the leading cryptocurrency exchanges globally, serving a significant number of users. The allegations by the FDIC could potentially impact the trust and confidence of OKCoin's customer base. Users who may have relied on the falsely claimed FDIC insurance could be reevaluating their positions on the platform.</p>\n<p>The exchange will need to revise its marketing communications and provide clear and accurate information to its customers about the level of asset protection offered by its platform. The outcome of this situation will have implications not only for OKCoin but also for the broader cryptocurrency industry, emphasizing the need for responsible practices and regulatory compliance.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice. </p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T11:05:06.000Z",
    "title": "Sturdy Finance reopens after $800,000 hack",
    "url": "https://www.cryptopolitan.com/sturdy-finance-reopens-after-800000-hack/",
    "description": "Sturdy Finance, a decentralized finance (DeFi) protocol, has recently reopened its stablecoin market after a recent exploit on its platform. The lending platform made an announcement on June 16, stating that users can now access their funds once again. Sturdy Finance assured its users that no funds were at risk during the incident and explained ... <a title=\"Sturdy Finance reopens after $800,000 hack\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sturdy-finance-reopens-after-800000-hack/\" aria-label=\"More on Sturdy Finance reopens after $800,000 hack\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T10:55:49.000Z",
    "title": "Coinbase’s 4% USDC rewards shake up the market amid SEC charges",
    "url": "https://www.cryptopolitan.com/coinbases-4-usdc-rewards-shake-up-the-market-amid-sec-charges/",
    "description": "In a move aimed at attracting more users and bolstering its position in the market, popular cryptocurrency exchange Coinbase announced on June 15th that it is now offering a special 4% incentive on USD Coin (USDC) holdings. This substantial reward increase comes as a significant upgrade from the previous rate of 2%, effectively doubling the ... <a title=\"Coinbase&#8217;s 4% USDC rewards shake up the market amid SEC charges\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbases-4-usdc-rewards-shake-up-the-market-amid-sec-charges/\" aria-label=\"More on Coinbase&#8217;s 4% USDC rewards shake up the market amid SEC charges\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-16T10:49:09.000Z",
    "title": "Terraform Labs co-founder Do Kwon faces extradition custody in Montenegro amid allegations and political ties",
    "url": "https://www.cryptopolitan.com/terraform-labs-co-founder-do-kwon-faces-extradition-custody-in-montenegro/",
    "description": "Terraform Labs co-founder, Do Kwon, is set to be taken into extradition custody in Montenegro as the court deliberates on South Korea&#8217;s request for his repatriation. The court has ordered a six-month custody period to assess the extradition proceedings. Kwon&#8217;s custody hearing is scheduled for June 16, shedding light on the legal battle ahead for ... <a title=\"Terraform Labs co-founder Do Kwon faces extradition custody in Montenegro amid allegations and political ties\" class=\"read-more\" href=\"https://www.cryptopolitan.com/terraform-labs-co-founder-do-kwon-faces-extradition-custody-in-montenegro/\" aria-label=\"More on Terraform Labs co-founder Do Kwon faces extradition custody in Montenegro amid allegations and political ties\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-16T10:58:12.000Z",
    "title": "Texas regulator accuses Abra Group of securities fraud",
    "url": "https://crypto.news/texas-regulator-accuses-abra-group-of-securities-fraud/",
    "description": "Texas State Securities Board alleges securities fraud and deceptive practices by Abra group. Investors urged to review enforcement actions as Abra's solvency remains under scrutiny."
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-16T11:10:09.000Z",
    "title": "WIN NFT HERO Coming Soon to the APENFT Launchpad with Limited Release of the New HERO Mystery Box",
    "url": "https://www.crypto-news-flash.com/win-nft-hero-coming-soon-to-the-apenft-launchpad-with-limited-release-of-the-new-hero-mystery-box/?utm_source=rss&utm_medium=rss&utm_campaign=win-nft-hero-coming-soon-to-the-apenft-launchpad-with-limited-release-of-the-new-hero-mystery-box",
    "description": "Singapore, Singapore, June 16th, 2023, Chainwire WIN NFT HERO, a strategy game built on Tron, has been garnering a lot of attention. Following the official launch of the game’s v2.0 and the new HERO system in April 2023, WIN NFT HERO officially launched v2.1 with an open beta test on June 1. Along with that [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-16T11:09:12.000Z",
    "title": "BREAKING: Trillion-Dollar Company BlackRock Embraces Bitcoin, Files Application for Bitcoin Spot ETF – Can It Drive BTC Price to $100,000? Report ",
    "url": "https://www.crypto-news-flash.com/breaking-trillion-dollar-company-blackrock-embraces-bitcoin-files-application-for-bitcoin-spot-etf-can-it-drive-btc-price-to-100000-report/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-trillion-dollar-company-blackrock-embraces-bitcoin-files-application-for-bitcoin-spot-etf-can-it-drive-btc-price-to-100000-report",
    "description": "BlackRock joins Ark Invest, Grayscale, and others applying for Bitcoin Exchange Traded Fund in spite of a zero approval rate. Coinbase, which has been accused by the SEC to be a non-compliant company, would take custody of the Bitcoin holdings.  Trillion-dollar company BlackRock has joined the list of companies awaiting approval for the Bitcoin spot [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-16T11:00:12.000Z",
    "title": "Top Meme Coins in 2023 Hollywood X PEPE ($HXPE) and ApeCoin (APE) Vie for Top Spot",
    "url": "https://www.crypto-news-flash.com/top-meme-coins-in-2023-hollywood-x-pepe-hxpe-and-apecoin-ape-vie-for-top-spot/?utm_source=rss&utm_medium=rss&utm_campaign=top-meme-coins-in-2023-hollywood-x-pepe-hxpe-and-apecoin-ape-vie-for-top-spot",
    "description": "The past few years have seen a surge in popularity for meme coins in the world of cryptocurrency. From the legendary Dogecoin to the emerging giants like Hollywood X PEPE ($HXPE) and ApeCoin (APE), there’s a slew of these digital currencies vieing for the top spot, capturing market interest and attention.                               Pepe Meme Coin goes [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-16T10:56:41.000Z",
    "title": "Novatti Expands AUDD Stablecoin to XRP Ledger, Unlocking New Possibilities for Stellar-Based Payments",
    "url": "https://www.crypto-news-flash.com/novatti-expands-audd-stablecoin-to-xrp-ledger-unlocking-new-possibilities-for-stellar-based-payments/?utm_source=rss&utm_medium=rss&utm_campaign=novatti-expands-audd-stablecoin-to-xrp-ledger-unlocking-new-possibilities-for-stellar-based-payments",
    "description": "The major fintech payment company Novatti Group Limited has revealed that it will extend the use of the AUDD stablecoin to the XRP ledger.  Peter Cook is convinced that the deployment of AUDD on the XRP Ledger will spotlight the demand for digital currencies.  Leading payments fintech firm Novatti Group Limited, has announced a major [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-16T11:00:00.000Z",
    "title": "LTC Price Down More Than 24% Over The Last 2 Weeks Alone",
    "url": "https://coinedition.com/ltc-price-down-more-than-24-over-the-last-2-weeks-alone/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/025-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/025-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/025-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/025.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The global crypto market cap increased more than 2% over the past 24 hours, according to the crypto market tracking website CoinMarketCap. As a result, the total stood at approximately $1.04 trillion. This comes after many cryptos printed gains during this time period. One such crypto was Litecoin (LTC), which printed a 24-hour gain of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/ltc-price-down-more-than-24-over-the-last-2-weeks-alone/\">LTC Price Down More Than 24% Over The Last 2 Weeks Alone</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-16T10:41:28.000Z",
    "title": "“Optimus to the Moon” with the Launch of Satellite Imagery NFT",
    "url": "https://coinedition.com/optimus-to-the-moon-with-the-launch-of-satellite-imagery-nft/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Optimus_to_the_Moon_with_the_Launch_of_Satellite_Imagery_NFT-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Optimus_to_the_Moon_with_the_Launch_of_Satellite_Imagery_NFT-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Optimus_to_the_Moon_with_the_Launch_of_Satellite_Imagery_NFT-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Optimus_to_the_Moon_with_the_Launch_of_Satellite_Imagery_NFT.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Optimus Vision Fund acquired Mission Helios, for an undisclosed sum with the aim of launching a satellite imagery NFT collection. Mission Helios, the first-ever decentralized space community to launch an imagery nano-satellite to orbit and mint Earth&#8217;s images as NFTs on the Ethereum blockchain, will rely on the pre-existing contract with Sidus Space, for this [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/optimus-to-the-moon-with-the-launch-of-satellite-imagery-nft/\">“Optimus to the Moon” with the Launch of Satellite Imagery NFT</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-16T10:39:50.000Z",
    "title": "Bitcoin’s (BTC) Next Move May Depend on Altcoin’s Action, Here’s Why",
    "url": "https://coinedition.com/bitcoins-btc-next-move-may-depend-on-altcoins-action-heres-why/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/7-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/7-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/7-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/7.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Crypto analyst and Into The CryptoVerse CEO told his YouTube viewers that the altcoin market has given a clue on how Bitcoin (BTC) will behave in the coming months. Speaking at a  session with his community, Cowen mentioned that the broader expectation in 2023 was for the market to get “rekt”. The analyst highlighted that [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoins-btc-next-move-may-depend-on-altcoins-action-heres-why/\">Bitcoin’s (BTC) Next Move May Depend on Altcoin’s Action, Here’s Why</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]