[
  {
    "source": "Crypto Daily",
    "date": "2023-08-04T14:00:00.000Z",
    "title": "ProShares Becomes 11th In Flood Of ETH ETF Applications",
    "url": "https://cryptodaily.co.uk/2023/08/proshares-becomes-11th-in-flood-of-eth-etf-applications",
    "description": "<p>ProShares has become the eleventh to apply to the U.S. Securities and Exchange Commission (SEC) to register an Ether exchange-traded fund (ETF).</p>\nMultiple Filings By ProShares\n<p>ProShares has joined the ranks of other asset managers seeking to register an Ether exchange-traded fund (ETF) with the U.S. Securities and Exchange Commission (SEC). A total of 11 applications for Ether futures ETFs were submitted to the SEC within a week, with ProShares filing for four separate applications.&nbsp;</p>\n<p>Among them is an equal-weight Bitcoin and Ether ETF that will track the performance of holding long positions in the nearest maturing monthly Bitcoin and Ether futures contracts. The asset manager has also filed for two other Ethereum-focused ETFs: Short Ether Strategy ETF and ProShares Ether Strategy ETF.</p>\nWave Of Ether-Based ETF Applications\n<p>ProShares was not alone in the race for Ether ETFs. The surge in applications began when Volatility Shares filed for the Volatility Shares Ether Strategy ETF on July 28. Subsequently, Bitwise Asset Management, Roundhill Financial, Van Eck, ProShares, Grayscale Investments, Direxion, and Valkyrie Investments followed suit, all proposing new Ether futures ETFs.</p>\n<p>It is worth noting that the SEC has not yet approved any ETF that tracks Ether futures contracts, though Bitcoin futures ETFs have been around since October 2021.</p>\nVolatility Could Be First Ether ETF\n<p>If the applications go uncontested, the Ether ETFs are set to launch 75 days from their respective filing dates, with Volatility Shares ETF expected to be the first, launching on Oct. 12.</p>\n<p>With $173.5 million managed across four exchange-traded funds, the investment firm has the potential to be the first to issue an ETF focused on Ether. Its proposed Ether Strategy ETF (ETHU) aims to invest up to 25% of its assets in cash-settled Ether futures contracts traded on the CFTC-regulated Chicago Mercantile Exchange (CME).&nbsp;</p>\nSpot BTC ETFs Coming Soon\n<p>This surge in Ether-focused ETF applications comes alongside a flurry of filings from major asset management firms looking to launch spot Bitcoin ETFs. BlackRock, the world's largest asset manager, is among those seeking to offer the first spot Bitcoin ETF in the United States.</p>\n<p>As the SEC reviews these applications, the crypto market eagerly awaits the possibility of new investment opportunities through Ether and Bitcoin ETFs.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.&nbsp;</p>"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-04T13:44:44.000Z",
    "title": "Optimism and Polkadot falling, Borroe sells over 3 million ROE in ongoing presale",
    "url": "https://crypto.news/optimism-and-polkadot-falling-borroe-sells-over-3-million-roe-in-ongoing-presale/",
    "description": "Borroe raised $250,000 in five days in the ongoing presale. More DOT and OP holders are considering ROE"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-04T14:00:30.000Z",
    "title": "Is SUI Price Stability Under Threat Due To Transactional Boom And Bust?",
    "url": "https://www.newsbtc.com/all/is-sui-price-stability-under-threat-due-to-transactional-boom-and-bust/",
    "description": "Sui network&#8217;s persistent growth propelled it into the league of the top 100 cryptocurrencies by market capitalization, but the value of the SUI token has been on a downward trajectory. Sustaining this heightened market position presents difficulties, as demonstrated by the recent performance of the Sui token&#8217;s value.  Sui token is currently priced at $0.591478, according to CoinGecko, with a 0.3% drop in the past 24 hours and a 6.0% decrease over the past seven days. The Sui network experienced a big surge, reaching unprecedented heights before undergoing a sharp decline recently. Have other indicators and the token&#8217;s valuation borne the impact of this plunge? Sui Network&#8217;s Transaction Surge And Diverging Trends A recent report indicates an interesting pattern in the Sui network&#8217;s daily transaction block numbers, which commenced in early July. Starting at around 200,000, the transaction count surged to 500,000 and dramatically jumped to over 6 million within a day. Related Reading: Kaspa (KAS) Takes Off With 23% Burst – What’s Fueling The Thrust? This peak brought the total transactions to an impressive 65.8 million, accompanied by an all-time high for the platform and its blockchain. SUI is currently trading at $0.59 according to the daily chart on TradingView.com However, the excitement was short-lived as the transaction count quickly settled at approximately 720,000. Interestingly, the network&#8217;s activity volume showed a minor decline, stabilizing at about $2 million. The Total Value Locked (TVL) took a different trajectory. Despite the transaction surge, the TVL demonstrated a subtle upward trend, currently at around $14 million, according to DefiLlama. Assessing Sui Token&#8217;s Stability And Prospects The Volatility Gauge evaluates recent trends, allowing it to form a score that reflects the current market dynamics rather than being skewed by isolated fluctuations. This methodology provides a more comprehensive understanding of the token&#8217;s price behavior. SUI total value locked. Source: Defillama As noted in a separate analysis, the SUI token demonstrates a moderate level of volatility. A low score on the Risk/Reward Gauge complements this average volatility. This pairing indicates that while the token experiences moderate price swings, it is also safeguarded against undue price manipulation. This confluence of factors presents a balanced perspective on the token&#8217;s risk and potential rewards. Related Reading: Shiba Inu Price Poised To Reach $0.01 With Shibarium Upgrade, These CEOs Say Looking ahead, the Sui token&#8217;s price is favorably poised. The support level is thoughtfully established at $0.568754, which signifies a point where downward pressure could find a halt. On the other hand, the resistance level is strategically set at $0.606822, indicating the end at which selling pressure might increase. This positioning offers Sui token an advantageous space to navigate before encountering significant selling pressures. It suggests that the token has room to flourish within this range, indicating a positive trajectory soon. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Ethereum World News"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-04T14:00:45.000Z",
    "title": "Spearheading a Revolution in Asset Tokenization",
    "url": "https://www.crypto-news-flash.com/spearheading-a-revolution-in-asset-tokenization/?utm_source=rss&utm_medium=rss&utm_campaign=spearheading-a-revolution-in-asset-tokenization",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-13T110551.751.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-13T110551.751.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-13T110551.751-300x169.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The Avalanche Foundation, the entity behind the Avalanche (AVAX) network, recently revealed its $50 million investment toward tokenized assets via its layer-1 blockchain solution. As expected, the news stirred up digital asset enthusiasts globally since it holds the potential to bring these novel offerings into the mainstream.  Referred to as ‘Avalance Vista,’ the initiative highlights [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-04T13:58:00.000Z",
    "title": "China’s Secret Crypto Resurgence Unveiled by Crypto Banter",
    "url": "https://coinedition.com/chinas-secret-crypto-resurgence-unveiled-by-crypto-banter/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/China-Is-Secretly-Buying-Crypto-WHAT-YOU-DONT-KNOW.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/China-Is-Secretly-Buying-Crypto-WHAT-YOU-DONT-KNOW.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/China-Is-Secretly-Buying-Crypto-WHAT-YOU-DONT-KNOW-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/China-Is-Secretly-Buying-Crypto-WHAT-YOU-DONT-KNOW-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/China-Is-Secretly-Buying-Crypto-WHAT-YOU-DONT-KNOW-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/China-Is-Secretly-Buying-Crypto-WHAT-YOU-DONT-KNOW-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/China-Is-Secretly-Buying-Crypto-WHAT-YOU-DONT-KNOW-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/China-Is-Secretly-Buying-Crypto-WHAT-YOU-DONT-KNOW-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/China-Is-Secretly-Buying-Crypto-WHAT-YOU-DONT-KNOW-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/China-Is-Secretly-Buying-Crypto-WHAT-YOU-DONT-KNOW-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/China-Is-Secretly-Buying-Crypto-WHAT-YOU-DONT-KNOW-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/China-Is-Secretly-Buying-Crypto-WHAT-YOU-DONT-KNOW-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/China-Is-Secretly-Buying-Crypto-WHAT-YOU-DONT-KNOW-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/China-Is-Secretly-Buying-Crypto-WHAT-YOU-DONT-KNOW-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/China-Is-Secretly-Buying-Crypto-WHAT-YOU-DONT-KNOW-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/China-Is-Secretly-Buying-Crypto-WHAT-YOU-DONT-KNOW-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/China-Is-Secretly-Buying-Crypto-WHAT-YOU-DONT-KNOW-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>Recent revelations regarding China&#8217;s involvement in the cryptocurrency market have left experts intrigued. Despite crypto trading being officially banned in the country, evidence suggests that China plays a significant role in the crypto world. A video by Ran Neuner, the founder of Crypto Banter, explores this unexpected resurgence and its potential implications for the global [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/chinas-secret-crypto-resurgence-unveiled-by-crypto-banter/\">China&#8217;s Secret Crypto Resurgence Unveiled by Crypto Banter</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]