[
  {
    "source": "BTCManager",
    "date": "2023-08-19T15:32:24.000Z",
    "title": "Borroe, Ripple, and Polkadot lead crypto charge in 2023",
    "url": "https://crypto.news/borroe-ripple-and-polkadot-lead-crypto-charge-in-2023/",
    "description": "Borroe, Ripple, and Polkadot are the top projects that investors are closely monitoring in 2023"
  },
  {
    "source": "BTCManager",
    "date": "2023-08-19T15:22:47.000Z",
    "title": "SEC petitions judge to certify appeal in XRP security case",
    "url": "https://crypto.news/sec-petitions-judge-to-certify-appeal-in-xrp-security-case/",
    "description": "The legal back-and-forth between the U.S. Securities and Exchange Commission (SEC) and Ripple (XRP) continues. The agency filed a petition late Friday, Aug. 18, asking Judge Analisa Torres, of the U.S. District Court for the Southern District of New York,&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-19T15:16:51.000Z",
    "title": "Shiba Inu Whale Transfers 4.6 Trillion Tokens After A 24-Hour Safekeeping",
    "url": "https://www.newsbtc.com/news/shiba-inu-whale-transfers-4-6-trillion-tokens-after-a-24-hour-safekeeping/",
    "description": "Shiba Inu (SHIB), a meme-inspired cryptocurrency, has seen a notable increase in high-value transactions, with each one costing $1 million or more. Following a strong price increase in the first half of August, this spike in transactions clearly gathered traction. Following the coin&#8217;s price explosion, a notable pattern started to emerge: whales made significant volumes of crypto movement even as the meme coin&#8217;s prices saw a correction. A huge shift was recently revealed by data provided by Whale Alert, a website that tracks significant cryptocurrency transactions, and it was masterminded by a single entity that had a sizeable amount of Shiba Inu tokens. 🚨 🚨 4,657,881,590,632 #SHIB (40,747,148 USD) transferred from unknown wallet to unknown wallethttps://t.co/g1D0dVuUjY — Whale Alert (@whale_alert) August 17, 2023 Related Reading: Solo Climber: The Lone Crypto Surging 11% In Top 100 Roster On A Weekend Shiba Inu Whale Moves $40 Million In Meme Coins This crypto whale carried out an unprecedented transfer of 4.65 trillion SHIB tokens, or about the equivalent of $40 million. This huge transfer occurred on August 17, precisely, during a single day. The mystery surrounding the source and recipient of these enormous sums of SHIB tokens only heightens the interest in this circumstance. This implies that the crypto whale&#8217;s goals went beyond merely selling the tokens on an exchange. The Shiba Inu community&#8217;s joyous celebration of the Shibarium Mainnet launch, a milestone for the cryptocurrency&#8217;s ecosystem, coincides with these substantial transfers. However, there were some worries that accompanied the announcement of the Shibarium Mainnet, and these had an impact on the pricing of Shiba Inu. The day before the launch-related festivities, the price of SHIB dropped by 11%. The cryptocurrency eventually recovered some of its losses, and as of the time of this publication, its price had stabilized at roughly $0.0000086. It&#8217;s interesting to note how different &#8220;whales&#8221; and significant holders, or those with large holdings of Shiba Inu tokens, appeared to react despite the uncertainty caused by the Shibarium launch-related worries. This shows that the various strategies and viewpoints held by these important stakeholders about the current Shiba Inu ecosystem developments. Shiba Inu (SHIB) is currently trading at $0.00000845. Chart: TradingView.com Euphoria And Setback: Shibarium Mainnet Launch Meanwhile, the euphoria around the Shibarium Mainnet launch was short-lived due to an unforeseen glitch in the Bridge, which temporarily halted block production. This incident caused over $1.7 million worth of ETH to be stuck in the Shibarium cross-chain bridge, resulting in a decline in the prices of tokens within the Shiba Inu ecosystem, including SHIB, BONE, and LEASH. Related Reading: Ordinals Sales In Freefall: 97% Decrease Sparks Worries About Bitcoin NFT’s Extinction However, the developers of Shibarium swiftly addressed the issue. The community-appointed SHIB lead, Shytoshi Kusama, reassured the community through an official blog post that Shibarium is running smoothly. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Altcoin Investor"
  }
]