[
  {
    "source": "Cointelegraph",
    "date": "2023-06-02T11:19:08.000Z",
    "title": "Here's how developers aim to store crypto inside NFTs",
    "url": "https://cointelegraph.com/news/how-to-store-crypto-inside-nfts-erc-6551-interview",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/833741bf-af2d-44a0-b426-f15eb800d492.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>From being an inventory system for gaming to being used in DAOs, Future Primitive’s Jayden Windle and Benny Giang spoke about use cases for ERC-6551.</p>\n                    <p><p>Developers have recently published an Ethereum Improvement Proposal (EIP) that introduces a new way to use <a href=\"https://cointelegraph.com/learn/what-are-nfts-and-why-are-they-revolutionizing-the-art-world#:~:text=NFTs%20refer%20to%20nonfungible%20tokens,based%20video%20games%20and%20video.\">nonfungible tokens (NFTs)</a>. With this system, all NFTs can have a smart contract account, allowing them to store other NFTs or crypto tokens. </p><p>Cointelegraph spoke with Future Primitive’s Jayden Windle and Benny Giang, the authors of EIP-6551, to explain the use cases of ERC-6551 and its implications for the crypto space. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/b10d97fa-6d87-46d7-969d-b8152f7582c1.png\"  /><figcaption style=\"text-align: center;\"><em>Jayden Windle and Benny Giang explains ERC-6551. Source: Cointelegraph </em></figcaption></figure><p>According to Windle, while there are a lot of complicated workings behind the feature, the simple way to explain it is that they are giving NFTs their own crypto wallets. He explained: </p><blockquote>“The real simple idea behind the ERC-6551 is that every NFT has a wallet. So, your NFT has a full wallet that your NFT owns. That means your NFT can own any asset on chain, and your NFT can do anything on chain. By giving NFTs wallets, NFTs now become users on Ethereum.”</blockquote><p>When asked how the idea came to life, the Future Primitive developer explained that their team went down to what he described as a “rabbit hole of experimental oddities.” He shared that they were working on an NFT project where they wanted to add equipping as a mechanic. The project lets NFTs wear clothes and other accessories that are also NFTs. </p><p>“What we realized was nothing really sets the use case that we really wanted to achieve. We really wanted to have NFTs own their own items in kind of a self-sovereign way. We really wanted to be able to do that in a way that would just work with all the existing tooling,” he explained. </p><p>Moreover, Windle also shared that they wanted other projects to be able to also take advantage of this new mechanic and build something that could apply to NFTs in general. </p><h2>Potential use cases for ERC-6551</h2><p>In terms of use cases, the developer also said that this can be applied to blockchain gaming and take the form of an inventory system. Furthermore, it can also be used in <a href=\"https://cointelegraph.com/learn/what-is-a-dao\">decentralized autonomous organizations (DAOs)</a> where instead of the history of a DAO member being separated by an NFT and a wallet, it can all be placed into the NFT itself. Apart from these, airdropping assets into NFTs can also potentially increase the value of NFTs as well. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/nike-nft-swoosh-ea-sports-games\"><strong><em>Nike NFTs to make their way into EA Sports games and its millions of fans</em></strong></a></p><p>As the new mechanic seemingly has endless possibilities, Cointelegraph asked Giang what this could potentially mean for the crypto space. The NFT veteran said that apart from asset ownership, this can also bring social identity into NFTs. This brings new functionality apart from just being able to buy, sell or trade NFTs. He explained that: </p><blockquote>“We're trying to introduce three new actions you can pursue with the NFT. It's become, interact and use. You can become your NFT, you can interact with it, and you can use your NFT.” </blockquote><p>Giang believes that this will make NFTs entirely different from jpegs. According to Giang, it can be the new internet identities. Furthermore, the Future Primitive executive explained that if artificial intelligence (AI) is employed, it can turn NFTs into fully on-chain network playable characters (NPCs) in blockchain-based games.</p><p>Apart from these, Giang highlighted that ERC-6551 is already live on the Ethereum mainnet. “It's not a conceptual idea. It's not like a testnet thing. It's real,” he explained. According to the Future Primitive co-founder, they’ve also already applied it to an NFT collection called Sapienz.</p><h2>NFT inception: NFTs that own NFTs inside NFTs</h2><p>Cointelegraph asked the developers if there is a limit as to how far can putting NFTs inside NFTs go. According to the duo, this can “get crazy really quickly” and go on infinitely. They demonstrated a family tree of NFTs within NFTs. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/21ad3e8a-0a04-431d-9b44-91e1c607f39a.JPG\"  /><figcaption style=\"text-align: center;\"><em>Demonstration of an NFT family tree with NFTs being used as wallets. Source: Cointelegraph </em></figcaption></figure><p>“You can build applications around NFTs that own NFTs that own NFTs, and all this is accessible on chain. You can build on-chain applications that use that hierarchy of NFTs in order to build really cool experiences,” Windle explained. </p><p><strong><em>AI Eye: </em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-traders-chatgpt-stock-picks-ai-dice-adobe-firefly/\"><strong><em>25K traders bet on ChatGPT’s stock picks, AI sucks at dice throws, and more</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-02T11:30:50.000Z",
    "title": "USDC Goes L2: Circle’s Stablecoin to Make Its Native Debut on Arbitrum",
    "url": "https://news.bitcoin.com/usdc-goes-l2-circles-stablecoin-to-make-its-native-debut-on-arbitrum/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/usdc-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"USDC Goes L2: Circle&#039;s Stablecoin to Make Its Native Debut on Arbitrum\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/usdc-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/usdc-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/usdc-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/usdc-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/usdc-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/usdc-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/usdc.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Stablecoin provider, Circle Internet Financial, has revealed that its dollar-pegged token, USDC, will be natively introduced on the layer two (L2) blockchain Arbitrum on June 8. The announcement follows Circle&#8217;s disclosure of its euro-pegged coin, EUROC, merging with the Avalanche blockchain last week. Circle Plans to Launch USDC on Arbitrum on June 8 On Thursday, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-02T11:38:04.000Z",
    "title": "Binance Australia temporarily suspends AUD withdrawals and deposits",
    "url": "https://www.cryptopolitan.com/binance-australia-temporarily-suspends-aud-withdrawals-and-deposits/",
    "description": "Binance Australia recently announced that they would temporarily suspend the withdrawal and deposit of the Australian Dollar (AUD) through bank transfers. The decision comes in the wake of an earlier announcement by Binance Australia on May 18, stating that they would no longer support AUD bank transfers through PayID. This change was attributed to a ... <a title=\"Binance Australia temporarily suspends AUD withdrawals and deposits\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-australia-temporarily-suspends-aud-withdrawals-and-deposits/\" aria-label=\"More on Binance Australia temporarily suspends AUD withdrawals and deposits\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-02T11:09:45.000Z",
    "title": "Galaxy Digital CEO Mike Novogratz Says This Will Kickstart The Bitcoin Bull Market",
    "url": "https://www.newsbtc.com/bitcoin-news/galaxy-digital-ceo-mike-novogratz-says-this-will-kickstart-the-bitcoin-bull-market/",
    "description": "Bitcoin and the broader cryptocurrency market have been trending sideways for the last month with no indication of an upside at this point. However, not everyone is bearish on the market as Galaxy Digital CEO Mike Novogratz expects the market to turn bullish soon, and he gives reasons for why he believes this will happen. Reasons Why Bitcoin Will Begin A Bull Rally Novogratz was interviewed on CNBC’s Squawk Box on Thursday, June 1, where he gave his opinions on the Bitcoin and crypto market and where he expects the market to go. Contrary to the current market trend, the CEO remains very bullish on the digital asset and expects a bull trend going off some developments in the market right now. Related Reading: LSD Tokens Rally As Ethereum Staking Ramps Up, Here Are The Leaders He pointed toward the rising adoption from Asia as countries such as Hong Kong begin opening up new ways for retail investors to participate in the market. Not only this but the largest social messaging platform in China, WeChat, began offering Bitcoin price data to users, allowing them to check the current price of BTC in yuan. Both of these, Novogratz says, will be a catalyst for the bitcoin bull market. &#8220;Crypto&#8217;s lackadaisical right now. There&#8217;s a constant bid from retail. We&#8217;re seeing it through all the platforms,&#8221; the Galaxy Digital CEO told CNBC. BTC struggles to hold $27,000 &#124; Source: BTCUSD on TradingView.com Expecting A Turn From The Federal Reserve In his interview, Novogratz also points to the fact that he expects that the Federal Reserve will change direction later this year, which he believes would be good for Bitcoin. As the Fed maintains its hawkish stance to tackle inflation, risk assets such as stocks and BTC continue to suffer but this could quickly change if the Fed becomes dovish. Related Reading: The Bitcoin Bear Market Is Far From Over, Here’s Why The CEO expects this to happen sometime in October 2023 and this, he says, will trigger a bull run for digital assets in the space. As the Fed drops interest rates, so will interest in Bitcoin rise, leading to a rapid surge in price. Given this, Novogratz expects investing in Bitcoin to be a better decision than buying a one-year T-bill. As for institutions, he points to the fact that they have reduced their participation in the market but this does not mean they’re gone. Novogratz believes the institutions will return to the second when “one of two things happens. You either need settled and sensible rules in place for crypto. Or you need the Republicans to win next year’s U.S. elections.” He further added that “Crypto has almost overnight become a crazily partisan issue, which is exactly what the industry didn’t want or need.” At the time of writing, Bitcoin is still struggling in the market, trading at $27,087 with meager gains of 0.77% in the last day. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-06-02T11:25:26.000Z",
    "title": "Beginner’s Guide About X2Y2 – Part 1",
    "url": "https://www.altcoinbuzz.io/nft/beginners-guide-about-x2y2-part-1/",
    "description": "<p>NFTs are currently not as hot as last year. However, there&#8217;s still a good amount of trading going on, and OpenSea and Blur marketplace are the most important ones. X2Y2 is the biggest of all the other Ethereum-based NFT marketplaces.  So, it&#8217;s about time we dig a little deeper into what X2Y2 is all about. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/nft/beginners-guide-about-x2y2-part-1/\">Beginner’s Guide About X2Y2 – Part 1</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-02T11:21:34.000Z",
    "title": "AVAX Sees 1M Active Monthly Users for the First Time Ever",
    "url": "https://coinedition.com/avax-sees-1m-active-monthly-users-for-the-first-time-ever/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/AVAX-news-comes-with-a-price-analysis-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/AVAX-news-comes-with-a-price-analysis-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/AVAX-news-comes-with-a-price-analysis-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/AVAX-news-comes-with-a-price-analysis-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/AVAX-news-comes-with-a-price-analysis-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/AVAX-news-comes-with-a-price-analysis-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/AVAX-news-comes-with-a-price-analysis.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>A crypto analysis platform, Satoshi Club, revealed in a Tweet yesterday that Avalanche (AVAX) reached a huge milestone recently. According to the post, the AVAX blockchain had crossed 1 million monthly active users for the first time in the project’s history. This could have a positive impact on AVAX as 1 million active users signifies [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/avax-sees-1m-active-monthly-users-for-the-first-time-ever/\">AVAX Sees 1M Active Monthly Users for the First Time Ever</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-02T11:14:37.000Z",
    "title": "Sparklo (SPRK) Eyeing Top 100 Cryptos By Market Cap, Bears Over The Polkadot (DOT) Market",
    "url": "https://coinedition.com/sparklo-sprk-eyeing-top-100-cryptos-by-market-cap-bears-over-the-polkadot-dot-market/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-3-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-3-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-3-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-3-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-3-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-3-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/06/sparklo-finance-3.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Several emerging tokens have been rising to prominence, surpassing old projects like Polkadot (DOT). One such token that analysts believe will soon outperform Polkadot (DOT) is SPRK, the native token of Sparklo. Currently, in the second phase of its token presale, Sparklo aims to revolutionize the precious metals industry by creating a platform where individuals [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/sparklo-sprk-eyeing-top-100-cryptos-by-market-cap-bears-over-the-polkadot-dot-market/\">Sparklo (SPRK) Eyeing Top 100 Cryptos By Market Cap, Bears Over The Polkadot (DOT) Market</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]