[
  {
    "source": "Cointelegraph",
    "date": "2024-01-14T19:37:28.000Z",
    "title": " Riot, TeraWulf and CleanSpark best-positioned  miners for Bitcoin halving — CoinShares   ",
    "url": "https://cointelegraph.com/news/riot-terawulf-cleanspark-miners-bitcoin-halving-coinshares",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy8zYjYzMTA2NGZhM2IzYjIyYmE4M2VmZDQxZGI0YjBmYS5qcGc=.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>CoinShares projects the average cost of production for crypto miners post-halving at $37,856 per Bitcoin.  </p>\n                    <p><p>Bitcoin mining firms Riot, TeraWulf, and CleanSpark are the best-positioned within the industry to handle the significant cost increases expected following the Bitcoin halving event in April, <a href=\"https://blog.coinshares.com/coinshares-mining-report-the-halving-and-its-impact-on-hash-rate-and-miners-cost-structures-8646835d88ac\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to analysis by asset manager CoinShares. </p><p>As a result of halving, CoinShares predicts that the cost of production and cash costs will increase from approximately $16,800 and $25,000 per Bitcoin in the third quarter of 2023 to $27,900 and $37,800, respectively. The average cost of production post-halving for crypto miners is projected to be $37,856.</p><p data-ct-non-breakable=\"true\">The halving reduces the block reward given to miners by half, thereby slowing down the rate of new Bitcoin creation as part of the network supply control deflationary policy. The next halving, estimated to take place in April 2024, will reduce the Bitcoin block reward to 3.125 BTC. The cost of mining, however, remains the same or may even increase due to miners’ expansion of operations to remain profitable.</p><p><a href=\"https://cointelegraph.com/news/riot-terawulf-cleanspark-miners-bitcoin-halving-coinshares\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-14T19:31:41.000Z",
    "title": "Vanguard reaffirms its crypto stand after ETF snub",
    "url": "https://www.cryptopolitan.com/vanguard-reaffirms-its-crypto-stand-etf-snub/",
    "description": "Vanguard, a prominent figure in the investment industry, has recently reaffirmed its staunch opposition to cryptocurrencies by preventing investors from accessing spot bitcoin exchange-traded funds (ETFs) approved by the U.S. Securities and Exchange Commission (SEC). Alongside this move, the company has announced a suspension of the purchase of cryptocurrency products, including bitcoin futures ETFs. Vanguard [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-14T19:15:07.000Z",
    "title": "Celsius moves $125M in Ethereum amid financial struggles",
    "url": "https://www.cryptopolitan.com/celsius-move-125m-in-ethereum-amid-financial/",
    "description": "Celsius, a well-known cryptocurrency lending platform, has recently transferred $125 million worth of Ethereum (ETH) to major exchanges. This move follows the company&#8217;s declaration of bankruptcy last week, highlighting a significant shift in its strategy towards liquidating assets. With concerns rising among investors about the potential impact on the Ethereum market, this development marks a [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-14T19:30:00.000Z",
    "title": "As Ethereum Classic and XRP falter, Rebel Satoshi shines in presale",
    "url": "https://crypto.news/as-ethereum-classic-and-xrp-falter-rebel-satoshi-shines-in-presale/",
    "description": "XRP and Ethereum Classic are under pressure. Meanwhile, Rebel Satoshi is shining in the ongoing presale"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-14T19:20:12.000Z",
    "title": "Vanguard ceases support for Bitcoin futures ETF purchase ",
    "url": "https://crypto.news/vanguard-ceases-support-bitcoin-futures-etf-purchase/",
    "description": "Vanguard announced that the trading of spot Bitcoin ETFs — which were recently approved by the SEC — will be unavailable on its platform."
  }
]