[
  {
    "source": "Decrypt",
    "date": "2023-07-12T09:51:03.000Z",
    "title": "Bankrupt Celsius Demands StakeHound Return $150M in Ethereum, Polygon and Polkadot",
    "url": "https://decrypt.co/148259/bankrupt-celsius-demands-stakehound-return-150m-ethereum-polygon-polkadot",
    "description": "Large quantities of the bankrupt crypto lender Celsius' Ethereum were locked up with the staking platform."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-12T10:00:35.000Z",
    "title": "Google hit with lawsuit over new AI data scraping privacy policy ",
    "url": "https://cointelegraph.com/news/google-hit-with-lawsuit-over-ai-privacy-policy",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/efe53530-b2bc-448d-811f-405166eaff28.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>A week after Google updated its privacy policy to allow data scraping for AI training purposes the company is now facing a class action lawsuit.  </p>\n                    <p><p>Google is now facing a lawsuit in the follow-up to its recent privacy policy update that accuses the tech giant of misusing large amounts of data, including copyrighted material in artificial intelligence (AI) training. </p><p>The lawsuit was <a href=\"https://fingfx.thomsonreuters.com/gfx/legaldocs/myvmodloqvr/GOOGLE%20AI%20LAWSUIT%20complaint.pdf\" target=\"_blank\" rel=\"noopener nofollow\">filed</a> on July 11 by eight individuals who claim to represent “millions of class members” - internet users and copyright holders- who have had their privacy and property rights violated in light of Google’s recent updates to its privacy policy. </p><p>In its opening statement, the plaintiffs accuse Google of “harvesting data in secret” to build its AI products without consent. </p><blockquote>“It has very recently come to light that Google has been secretly stealing everything ever created and shared on the internet by hundreds of millions of Americans.”</blockquote><p>Google’s privacy policy changes now allow it to take data that is publicly available to use for artificial intelligence (AI) training purposes. </p><p>The lawsuit points out that Google’s decision not only violates rights, but gives it an “unfair advantage” compared to its competitors who lawfully obtain or purchase data to train AI. Ryan Clarkson of Clarkson Law Firm, the plaintiffs’ attorney, said in a statement in the suit that: </p><blockquote>“Google must understand, once and for all: it does not own the internet, it does not own our creative works, it does not own our expressions of our personhood, pictures of our families and children, or anything else simply because we share it online.”</blockquote><p>The plaintiffs argued that “publicly available” does not and has never entailed that it is “free to use for any purpose.” </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/chatgpt-bing-integration-paused-for-helping-bypass-paywalls\"><strong><em>OpenAI pauses ChatGPT’s Bing feature, as users were jumping paywalls</em></strong></a></p><p>According to the lawsuit, Google could potentially owe upwards of $5 billion in damages. It also requested a court order which would order Google to obtain users' explicit permission first. </p><p>This includes allowing users to opt out of its \"illicit data collection,” along with the ability to delete already existing data or provide \"fair compensation” to owners of the data. </p><p>Earlier this week, author and comedian Sarah Silverman, together with two other authors, <a href=\"https://cointelegraph.com/news/meta-and-open-ai-sued-for-copyright-violations-sarah-silverman\">filed a lawsuit against ChatGPT</a> maker OpenAI and Meta for their use of copyrighted work without permission in AI training. </p><p>Prior to that, OpenAI was <a href=\"https://cointelegraph.com/news/open-ai-hit-with-class-action-lawsuit-over-chatgpt-data-theft\">hit with another lawsuit</a> for alleged data scraping, </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/web3-gamer-ubisoft-sega-steam-ai-troubles-super-mario-crypto/\"><strong><em>Super Mario: Crypto Thief, Sega blockchain game, AI games rights fight — Web3 Gamer</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-12T09:51:40.000Z",
    "title": "Examining the performance of Ethereum against Bitcoin across market cycles",
    "url": "https://cryptoslate.com/insights/examining-the-performance-of-ethereum-against-bitcoin-across-market-cycles/",
    "description": "<p>Quick Take The Ethereum to Bitcoin ratio is currently at 0.061, as it hovers around year-to-date lows. The radio is calculated by dividing the price of Ethereum by the price of Bitcoin and offers an intriguing comparison against previous market cycles, especially when assessing performance from the cycle&#8217;s all-time high (ATH). The 2015 to 2017 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/examining-the-performance-of-ethereum-against-bitcoin-across-market-cycles/\">Examining the performance of Ethereum against Bitcoin across market cycles</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-12T10:02:22.000Z",
    "title": "UK FCA Shuts Down 26 Crypto ATMs in 2023",
    "url": "https://cryptodaily.co.uk/2023/07/uk-fca-shuts-down-26-crypto-atms-in-2023",
    "description": "<p>The UK&rsquo;s FCA has shut down 26 cryptocurrency ATMs this year following a coordinated investigation with other law enforcement agencies. </p>\n<p>The UK&rsquo;s financial regulator, the FCA (Financial Conduct Authority), shut down 26 of the 34 crypto ATMs it inspected since the start of the year.</p>\n<p>Following a coordinated investigation with several other law enforcement agencies using powers under the country&rsquo;s money laundering regulations, the agency successfully &ldquo;disrupted&rdquo; 26 ATM sites it visited and inspected since the start of 2023.</p>\nFCA: Comply with Regulations or Shut Down\n<p>At the beginning of the year, the FCA warned all illegal ATM operators to comply with its regulations or dismantle their operations.</p>\n<p>After issuing the injunction, the regulator inspected 36 crypto ATM sites in Exeter, Nottingham, and Sheffield, which it found operating without FCA registration.</p>\n\n<p dir=\"ltr\" lang=\"en\">#Crypto ATMs operating without FCA registration are illegal. The action we&rsquo;ve taken over the past few months and wider work shows that we will act to stop illegal activity. #cryptocurrency https://t.co/KnMhiKAt21</p>\n&mdash; Financial Conduct Authority (@TheFCA) May 5, 2023\n<p>\n\n</p>\n<p>Steve Smart, joint executive director of enforcement and market oversight at the FCA, spoke out against the operation of all cryptocurrency ATMs and warned users of the dangers of using unregistered ATMs. He said:</p>\n\n<p>If you use a crypto ATM in the UK, you are using a machine that is operating illegally, and you may be handing your money over to criminals.</p>\n\n<p>Smart further said users of illegal ATMs &ldquo;will not be protected&rdquo; by the UK government or ATM operators. He concluded by saying:</p>\n\n<p>We will continue to warn the public and take appropriate enforcement action against unregistered crypto ATM operators.</p>\n\nUK Takes a Tough Stance on Crypto ATMs\n<p>Cryptocurrency ATMs gained popularity over recent years and allow users to sell crypto such as Bitcoin and Ethereum in exchange for cash.</p>\n<p>The FCA believes illegal crypto ATMs pose a high risk and may be used to facilitate illegal activities such as money laundering. As such, the FCA said it was working with the National Economic Crime Centre in March to develop and coordinate a plan to act against ATMs operating illegally.</p>\n<p>Mark Stewart, the Executive Director of Enforcement and Market oversight at the FCA, said at the time:</p>\n\n<p>Crypto ATMs operating without FCA registration are illegal and, as today shows, we will take action to stop this. This operation, alongside last month&rsquo;s action in Leeds, sends a clear message that we will continue to identify and disrupt unregistered crypto businesses in the UK.&nbsp;</p>\n<p>Crypto products are not currently regulated, and they are high-risk. You should be prepared to lose all your money if you invest in them.</p>\n\n<p>The regulator issued several warnings to unregistered ATM providers and ordered them to cease operations immediately, adding failure to comply would result in legal proceedings against them.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-12T10:03:35.000Z",
    "title": "Top Utility Tokens Right Now: Ripple (XRP), Tron (TRX) and Pikamoon (PIKA)",
    "url": "https://www.crypto-news-flash.com/top-utility-tokens-right-now-ripple-xrp-tron-trx-and-pikamoon-pika/?utm_source=rss&utm_medium=rss&utm_campaign=top-utility-tokens-right-now-ripple-xrp-tron-trx-and-pikamoon-pika",
    "description": "<img width=\"512\" height=\"288\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-12T121424.887.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-12T121424.887.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-12T121424.887-300x169.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />It is no news that utility tokens like XRP, TRX and PIKA are investment assets for long-term growth and consistent profit. This is due to no other reason than their utility, which makes them an asset or means of exchange that will be used in everyday transactions in different industries or niches.  This is why [...]"
  }
]