[
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T08:27:17.000Z",
    "title": "Binance to halt crypto debit card in Latin America and the Middle East ",
    "url": "https://cointelegraph.com/news/binance-shut-crypto-debit-card-latin-america-and-the-middle-east",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/314360ed-5c43-4313-8822-da9732050028.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Binance didn’t reveal the exact reason behind the suspension but claimed it would only impact 1% of users in the mentioned region. </p>\n                    <p><p>Cryptocurrency exchange Binance is going to suspend its crypto debit card services in Latin America and the Middle East starting from Aug. 25. </p><p>The crypto debit card worked like most other debit cards that allowed their users to make payments on a day to day basis. The only difference is that these cards were funded by cryptocurrency assets.</p><p>The crypto debit card services in Latin America and the Middle East will be terminated by Sept. 21 but the exchange claimed refunds and disputes can still be processed until Dec. 20, 2023. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/323028d1-d92b-4a4f-b27f-e81ec5167d06.jpg\"  /><figcaption style=\"text-align: center;\"><em>Binance crypto debit card interface. Source: X</em></figcaption></figure><p>The issue first came to light when an X (formally known as Twitter) user enquired about the issues with crypto debit cards in Colombia. Binance responded to the query with the announcement suggesting that debit card services will be suspended starting Aug. 25 without offering clarity on the issues that led to the decision.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Hello there,<br>The Binance Card will no longer be available to users in Latin America and the Middle East. The product, like most debit cards, has been utilized by Binance’s users to pay for basic daily expenses but in this case, the cards are funded with crypto assets. Only a tiny…</p>&mdash; Binance Customer Support (@BinanceHelpDesk) <a href=\"https://twitter.com/BinanceHelpDesk/status/1694496033214976212?ref_src=twsrc%5Etfw\">August 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Binance first <a href=\"https://www.binance.com/en/blog/payment/introducing-the-binance-card-shop-and-pay-with-crypto-anywhere-in-the-world-421499824684900479\" target=\"_blank\" rel=\"noopener nofollow\">announced </a>its plan for crypto-backed debit cards in April 2020 with a focus on entering the global payment market. By July 2020, these <a href=\"https://cointelegraph.com/news/binances-swipe-powered-crypto-debit-card-debuts-in-europe\">crypto debit cards were being shipped</a> to European countries and several others around the world. The crypto exchange later partnered with payment processor Swipe with a focus on offering<a href=\"https://cointelegraph.com/news/binance-card-to-soon-expand-to-us-as-swipe-taps-new-partnership\"> crypto debit cards in the United States as well</a>. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/paypal-uk-to-halt-crypto-purchases-until-2024\"><strong><em>PayPal UK to halt Bitcoin purchases until early 2024</em></strong></a></p><p>Cointelegraph reached out to Binance to enquire about the possible reasons behind the suspension of its crypto debit cards in Latin America and the Middle East but didn’t get any answers from the exchange on the same. Binance, however, told Cointelegraph that  \"only a tiny portion of our users (less than 1% of users in the markets mentioned) are impacted by this.” </p><p>While Binance claimed only 1% of such users would be impacted by the decision, some of the Binance CEO tweets on the crypto debit card-related announcement and responses on X were found to be deleted.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/blockchain-games-decentralized-lattice-starknet-cartridge/\">Blockchain games aren’t really decentralized… but that’s about to change</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-24T08:24:45.000Z",
    "title": "UK considers blanket ban on crypto investment cold calls",
    "url": "https://cointelegraph.com/news/uk-ban-crypto-investment-cold-calls",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/bf8d4fa1-9350-4e54-94ff-c75ce3383171.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The UK Treasury released a consultation paper to understand the grassroots-level impact of a blanket ban on cold calls related to financial services and products.</p>\n                    <p><p>As the United Kingdom prepares for a ban on finance-related cold calls, the UK Treasury issued a consultation and call for evidence to gauge a full picture of the impact on businesses, or the costs associated with introducing and implementing the ban.</p><p>On May 3, the UK government announced an ambitious fraud strategy, which would involve adding 400 new jobs to update its approach to intelligence-led policing. As Cointelegraph previously reported, the National Crime Agency estimates that fraud costs the country approximately $8.7 billion (£7 billion) annually. </p><p>“The government will not tolerate this behavior,” <a href=\"https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1175770/Coldcalling_consultation-_final_clean.pdf\" target=\"_blank\" rel=\"noopener nofollow\">said</a> Andrew Griffith, the Economic Secretary to the Treasury while criticizing the rising cold calls for financial services and products that often target the most vulnerable members of society. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/7ef04f3e-3382-4518-83cf-1ad05f599d06.png\"  /><figcaption style=\"text-align: center;\"><em>HM Treasury's case study on crypto cold call scam. Source: gov.uk</em></figcaption></figure><p>HM Treasury highlighted numerous instances where cold calls were responsible for investors' losses, out of which one involved cryptocurrencies, as shown above. While the UK government previously implemented various prohibitions and restrictions on cold calling, scammers often find loopholes in the system to bypass the law. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/98b9ea07-e9f3-45b4-809d-8a47311d4102.png\"  /><figcaption style=\"text-align: center;\"><em>HM Treasury intends to impose a blanket ban on finance cold calls. Source: gov.uk</em></figcaption></figure><p>With the intention to impose a blanket ban on financial cold calls, the Treasury put forth 19 questions to stakeholders — as a measure to ensure maximum impact on scammers and minimum impact on businesses that often rely on cold calling prospects. The consultation closes on Sept. 27, 2023.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/uk-treasury-exclude-derivatives-unbacked-tokens-regulatory-sandbox\"><strong><em>UK Treasury plans to exclude derivatives and ‘unbacked’ tokens from regulatory sandbox</em></strong></a></p><p>The UK government recently rejected the appeal to consider and regulate cryptocurrencies as gambling. </p><blockquote>“HM Treasury and the FCA [Financial Conduct Authority] will work with the industry to ensure crypto firms are made fully aware of the standards required for approval at the FSMA gateway. Further communications will be provided in due course to ensure standards for approval are clearly available to crypto firms operating in the UK.“</blockquote><p>The government response noted that such an approach has the potential to completely counter the globally agreed recommendations from international organizations and standard-setting bodies. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/recursive-inscriptions-bitcoin-supercomputer-defi-aws-possible/\"><strong><em>Recursive inscriptions: Bitcoin ‘supercomputer’ and BTC DeFi coming soon</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T08:31:24.000Z",
    "title": "Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?",
    "url": "https://www.cryptopolitan.com/flow-coin-price-prediction/",
    "description": "Flow Coin Price Prediction 2023-2032 Seasoned traders go by the time-tested formula: invest&#160;most of your crypto portfolio in BTC (50%); 35% in a basket of big-cap coins, and the rest in small projects with huge upside.&#160;But for beginners, all cryptocurrencies are risky&#160;investments, so they must tread lightly and keep all their senses open in the ... <a title=\"Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/flow-coin-price-prediction/\" aria-label=\"More on Flow Coin Price Prediction 2023-2032: Is FLOW a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T08:31:00.000Z",
    "title": "AMP Price Prediction 2023-2032: Is AMP a Good Investment?",
    "url": "https://www.cryptopolitan.com/amp-price-prediction/",
    "description": "AMP Price Prediction 2023-2032 Amp seeks to enable users to&#160;stake&#160;tokens without having to transfer them to a smart contract physically. This function seeks to make Amp suitable for any form of value exchange, including digital payments, traditional currency exchange, loan distributions, real estate transactions, and more.&#160; Staking Amp seeks to improve overall utility by increasing ... <a title=\"AMP Price Prediction 2023-2032: Is AMP a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/amp-price-prediction/\" aria-label=\"More on AMP Price Prediction 2023-2032: Is AMP a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-24T08:19:35.000Z",
    "title": "ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?",
    "url": "https://www.cryptopolitan.com/icp-price-prediction/",
    "description": "ICP Price Prediction 2023-2032 Internet Computer is the first cryptocurrency backed by a protocol. So many crypto experts believe ICP is a good investment and could grow further and, with new developments, could get better. ICP, the native token of the Internet Computer network, is mainly used for processing the network&#8217;s power. Will ICP Price ... <a title=\"ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/icp-price-prediction/\" aria-label=\"More on ICP Price Prediction 2023-2032: Is Internet Computer Resurgence Possible?\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-24T08:30:17.000Z",
    "title": "Optimism Reverses From Range Low With 10% Gain – How Far Can Bulls Go?",
    "url": "https://www.newsbtc.com/all/optimism-reverses-from-range-low/",
    "description": "Optimism (OP) is proving to be a beacon of stability amidst the tumultuous fluctuations of the cryptocurrency market, particularly Bitcoin (BTC). While Bitcoin&#8217;s price swings have left investors on edge, Optimism&#8217;s weekly rally seems poised to extend its resilience. The cryptocurrency&#8217;s price trajectory has demonstrated a notable rebound, bouncing back from its range-low of $1.41. This steadfast performance has entrenched Optimism within a trading range bordered by $1.80 at the upper limit and $1.41 at the lower threshold.  As bulls and bears lock horns in a battle for supremacy, the question looms: who will emerge victorious? Related Reading: Solana In Turbulence: Analyzing The Death Cross And What Lies Ahead OP Bulls Eye $1.8 Resistance As Momentum Grows As of the latest update, OP is priced at $1.57 according to CoinGecko, reflecting a slight 0.8% decline over the past 24 hours. However, the coin managed to register an impressive 10% increase in the last week. Optimism price action today. Source: Coingecko The momentum appears to favor the bullish contingent, as they prepare for a renewed assault on the formidable $1.8 resistance. A glimpse into historical data suggests that the bulls&#8217; determination might yield success in their second attempt.  OP market cap at $1.1 billion. Chart: TradingView.com According to this price analysis, favorable outcomes could propel Optimism towards take-profit levels ranging from $2.1 to $2.3. Investors and analysts are keenly observing this showdown, ready to gauge whether Optimism&#8217;s resilience will once again hold strong against market turbulence. Related Reading: Polygon (MATIC) At June Lows Again – Prospects For Bullish Recovery? However, the coin&#8217;s fate is by no means set in stone. A faltering attempt to breach the $1.8 resistance would spell an extension of the range-bound pattern, giving the bears an opportunity to regain dominance by targeting the critical $1.41 support.  Optimism seven-day price movement. Source: CoinMarketCap Network Growth Amidst Challenges Amidst these price fluctuations, Optimism has been strategically focusing on enhancing its network growth. A separate report reveals a remarkable upswing, with a 47% surge in daily transactions since mid-July. Moreover, the count of daily active addresses within the Optimism ecosystem has surged by an impressive 28% over the past month. This steady expansion indicates a growing user base and heightened engagement, boding well for the platform&#8217;s future prospects. However, recent concerns have cast a shadow over Optimism&#8217;s growth trajectory. The exploit of Exactly Protocol, a credit market operating on the Optimism network, has sparked worry among investors. This incident serves as a reminder of the challenges that even robust platforms face in a landscape characterized by innovation and risk. (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from Turbo and Stance"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-24T08:12:52.000Z",
    "title": "Bitcoin, Solana, NEAR, and Cardano (ADA) Lead Crypto Market Gains with Massive Upswing Potential – Investors, Watch Out",
    "url": "https://www.crypto-news-flash.com/bitcoin-solana-near-and-cardano-ada-lead-crypto-market-gains-with-massive-upswing-potential-investors-watch-out/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-solana-near-and-cardano-ada-lead-crypto-market-gains-with-massive-upswing-potential-investors-watch-out",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T110222.582.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T110222.582.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T110222.582-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-09T110222.582-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Layer 1 blockchain Solana surges by 7% post its integration with Shopify, boosting USDC stablecoin payments. While digital assets face uncertain terrains, market experts present mixed sentiments about the future price actions of Bitcoin and other cryptocurrencies. In a thrilling development, Bitcoin, Ether, and several other leading cryptocurrencies showcased impressive gains, challenging their recent downslides. [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-24T08:12:45.000Z",
    "title": "Binance Under Pressure, While Ethereum (ETH) Holders Double Down on Borroe Finance ($ROE)",
    "url": "https://www.crypto-news-flash.com/binance-under-pressure-while-ethereum-eth-holders-double-down-on-borroe-finance-roe/?utm_source=rss&utm_medium=rss&utm_campaign=binance-under-pressure-while-ethereum-eth-holders-double-down-on-borroe-finance-roe",
    "description": "<img width=\"512\" height=\"320\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-115.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-115.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-115-300x188.png 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-115-343x215.png 343w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-115-326x205.png 326w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-115-163x102.png 163w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The world of cryptocurrencies is known for its rapid developments and shifting dynamics. Recent headlines reveal contrasting moves as Binance, a leading crypto exchange, announces the wind-down of its cryptocurrency payment platform, while Ethereum (ETH) holders show increased interest in doubling down on the promising Borroe ($ROE) token. In a landscape where identifying the best [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-08-24T08:14:58.000Z",
    "title": "Top Coins From Our Team – Part 2",
    "url": "https://www.altcoinbuzz.io/reviews/top-coins-from-our-team-part-2/",
    "description": "<p>At Altcoin Buzz, we like to be transparent. That&#8217;s why we recently gave you an insight in the coins that our CEO holds. Now it&#8217;s time to move on and see what coins our team is holding. This will be a 3-part series. Here&#8217;s a link to Part 1. Part 3 will be here shortly. [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/reviews/top-coins-from-our-team-part-2/\">Top Coins From Our Team – Part 2</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-24T08:34:52.000Z",
    "title": "BTC Actively Being Accumulated by Large Wallets; $30K to Follow?",
    "url": "https://coinedition.com/btc-actively-being-accumulated-by-large-wallets-30k-to-follow/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network.jpg 730w, https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2023/06/The_popularity_of_Inscription_Transactions_on_the_Bitcoin_network-696x392.jpg 696w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>In a tweet earlier today, the blockchain intelligence firm Santiment revealed that whale and shark addresses are collectively stocking up on Bitcoin (BTC). According to the post, there are currently 156,660 wallets holding between 10 and 10,000 BTC. This was after these large wallets accumulated $308.6 million worth of  BTC since 17 August 2023. Meanwhile, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/btc-actively-being-accumulated-by-large-wallets-30k-to-follow/\">BTC Actively Being Accumulated by Large Wallets; $30K to Follow?</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-08-24T08:13:23.000Z",
    "title": "$13.3M Is Stolen as a Result of SIM Swap Scams, ZachXBT Claimed",
    "url": "https://coinedition.com/13-3m-is-stolen-as-a-result-of-sim-swap-scams-zachxbt-claimed/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/Scam-6.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/Scam-6.jpg 730w, https://coinedition.com/wp-content/uploads/2023/08/Scam-6-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/08/Scam-6-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/08/Scam-6-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/08/Scam-6-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/08/Scam-6-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/08/Scam-6-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/08/Scam-6-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/08/Scam-6-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/08/Scam-6-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/08/Scam-6-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/08/Scam-6-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/08/Scam-6-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/08/Scam-6-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/08/Scam-6-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/08/Scam-6-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>ZachXBT, an on-chain detective, shared that over the past four months, more than $13.3 million has been stolen as a result of 54 SIM swaps targeting crypto holders. John Deaton, a crypto lawyer and founder of Crypto Law, replied to ZachXBT’s tweet, addressing the seriousness of the issue and mentioning how these hackers could come [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/13-3m-is-stolen-as-a-result-of-sim-swap-scams-zachxbt-claimed/\">$13.3M Is Stolen as a Result of SIM Swap Scams, ZachXBT Claimed</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]