[
  {
    "source": "CoinDesk",
    "date": "2024-02-09T15:59:04.000Z",
    "title": "Protocol Village: Web3 Foundation Funds Ideal Labs, 'Encryption to the Future'",
    "url": "https://www.coindesk.com/tech/2024/02/08/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Feb. 8-14."
  },
  {
    "source": "Cointelegraph",
    "date": "2024-02-09T16:04:00.000Z",
    "title": " Study: ICO’s with smiling members raise up to 95% more money ",
    "url": "https://cointelegraph.com/news/study-ico-smiling-members-raise-95-more-money",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvMzU3MDcwMTgtMjcxYS00NWM2LTgzNzctYjYyYTc2NjFlOGVhLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Unfortunately, this perceived trustworthiness doesn’t positively affect token performance.</p>\n                    <p><p>A professor of finance from the Hanken School of Economics in Finland recently published preprint research indicating that initial coin offerings (ICOs) tend to make more money when the people offering them appear to have more “trustworthy” faces. </p><p>Dubbed “The Value of a Smile,” the paper’s author, Professor Sinh Thoi Mai, <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4720641\" target=\"_blank\" rel=\"noopener nofollow\">claims</a> observed ICOs with member images that rank highly on a trustworthiness scale earn up to 95% more investments than those at the lowest end of the scale: </p><p>The professor manually collected a sample of 5,826 ICOs “from various sources” with a total amount raised of around $24 billion. Facial photo images from each ICO’s investor packets were then evaluated for “trustworthiness” using indicators from previous empirical research. </p><p><a href=\"https://cointelegraph.com/news/study-ico-smiling-members-raise-95-more-money\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2024-02-09T15:42:43.000Z",
    "title": "Long-term Bitcoin holders selling off could signal more price increases",
    "url": "https://cryptoslate.com/insights/long-term-bitcoin-holders-selling-off-could-signal-more-price-increases/",
    "description": "<p>Quick Take Bitcoin market forces are demonstrating an intriguing trend. The cohort of Bitcoin holders who have kept their Bitcoin for over a year, also known as the Supply Last Active (SLA) 1+ year, reached an all-time high of approximately 71% in November 2023. As a general principle, these holders tend to acquire Bitcoin during [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/insights/long-term-bitcoin-holders-selling-off-could-signal-more-price-increases/\">Long-term Bitcoin holders selling off could signal more price increases</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2024-02-09T16:01:20.000Z",
    "title": "As the Market Bounces Back, Here Are the Altcoins on Traders’ Radar",
    "url": "https://cryptodaily.co.uk/2024/02/as-the-market-bounces-back-here-are-the-altcoins-on-traders-radar",
    "description": "Get ready to witness a major shift in the crypto market as traders set their sights on 5 altcoins during the market's recovery phase. These tokens are shining bright on traders' radars, offering unique features and potential for significant growth."
  },
  {
    "source": "BTCManager",
    "date": "2024-02-09T16:00:00.000Z",
    "title": "BTC adds 8%, Bitcoin Minetrix benefits from rally",
    "url": "https://crypto.news/btc-adds-8-bitcoin-minetrix-benefits-from-rally/",
    "description": "Bitcoin (BTC) is up 8% this week. While at it, Bitcoin Minetrix has raised more than $10.5 million in its presale"
  },
  {
    "source": "BTCManager",
    "date": "2024-02-09T15:50:53.000Z",
    "title": "Bitcoin heads to $50k as miners cut selling pressure",
    "url": "https://crypto.news/bitcoin-btc-heads-50k-miners-cut-selling-pressure/",
    "description": "Bitcoin on-chain analysis highlights how miners cutting down on their selling pressure ahead of the April 2024 halving has impacted BTC price action.  "
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-09T16:00:20.000Z",
    "title": "Bitcoin Supply On Exchanges Has Dropped To A 6-Year Low, What This Means For Price",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-supply-on-exchanges/",
    "description": "Bitcoin broke over the $46,000 level twice in the past 24 hours for the first time since the approval of spot Bitcoin ETFs by the SEC, signaling a bullish return into most cryptocurrencies spearheaded by BTC. In particular, Bitcoin investors seem to be gearing up for action as the next Bitcoin halving approaches with an interesting time of withdrawal from exchanges. Serious money has been on the move from exchanges in the past 30 days, as shown by on-chain data. As a result, the Bitcoin balance across various exchanges has seen a drastic drop to the lowest level in six years. Percentage Of Bitcoin Supply On Exchanges Drops To Lowest Level Since 2017 A large portion of Bitcoin holders have been holding onto their coins for the long haul. According to IntoTheBlock data, about 69% of Bitcoin holders have been holding their coins for longer than one year. Related Reading: Chainlink Breeds New Whales As $49.9 Million Accumulation Spree Cause Prices To Surge Data from the on-chain analytics platform Santiment also showed that the supply of Bitcoin on exchanges recently dropped to 5.3% of the total circulating supply for the first time since December 2017, indicating 94.7% of the supply is currently in private custody. This metric is particularly interesting, considering BTC&#8217;s total circulating supply has grown by 2.84 million since December 2017. As shown in Santiment’s chart, the supply on exchanges has been on a free fall since January 10, around when the first spot Bitcoin ETFs went live in the US. This isn&#8217;t surprising, as the sentiment around Bitcoin turned fully bullish during this period despite a prolonged price struggle. 📈 #Bitcoin&#8216;s price dominance has continued to grow over #altcoins, as its market value surged as high as $45.5K today. Traders remain skeptical toward the asset for a 3rd straight week. This is the lowest ratio of $BTC on exchanges since December, 2017. https://t.co/XC3UK258lM pic.twitter.com/4MwvXE28RC — Santiment (@santimentfeed) February 8, 2024 In a similar manner, whale transaction tracker Whale Alerts has disclosed large bouts of BTC exiting crypto exchanges to private wallets in the past month. Notably, Bitcoin&#8217;s dominance over altcoins has gained ground, with the institutional demand for Bitcoin post-ETF approval also surging. 🚨 🚨 🚨 1,150 #BTC (51,452,847 USD) transferred from #Coinbase to unknown wallethttps://t.co/bQl4vCkifM — Whale Alert (@whale_alert) February 8, 2024 This mass BTC exodus from crypto exchanges signals that long-term holders feel more comfortable keeping their coins in self-custody rather than on exchanges.  The total Bitcoin withdrawals from exchanges in the past seven days were to the tune of $8.64 billion, outpacing a $8.42 billion inflow by $220 million. Wallets holding more than 1,000 BTC have also accumulated 1.03% of the total circulating supply in the past month. Related Reading: Ethereum Staking Reaches Historic Milestone As ETH Price Barrels Past $2,400 Withdrawals from exchanges are generally a good phenomenon for crypto assets, as they reduce the amount of cryptocurrencies readily available for sale. Fewer BTC available means less selling pressure and the opportunity for the value to go up based on supply and demand.  At the time of writing, Bitcoin is trading at $46,250, up by 4% in the past 24 hours and 7.15% in the past seven days. The cryptocurrency is currently aiming for the $50,000 mark, which it can reach very soon if the accumulation strategy continues. BTC price crosses $47,000 &#124; Source: BTCUSD on Tradingview.com Featured image from Forbes, chart from Tradingview.com"
  }
]