[
  {
    "source": "Cointelegraph",
    "date": "2023-07-26T04:34:51.000Z",
    "title": "CFTC charges Tennessee couple over 'Blessings of God Thru Crypto’ scheme",
    "url": "https://cointelegraph.com/news/cftc-charge-couple-blessings-of-god-crypto-investment-scheme",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/d33a3630-beea-47d1-94f4-8a76a6f0d4ea.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Despite having no trading experience a Tennessee couple convinced 100 people to hand over their money for a uniquely named crypto investment pool.</p>\n                    <p><p>A Tennessee husband and wife are facing charges over “Blessings of God Thru Crypto” — an allegedly fraudulent investment scheme that swindled at least $6 million from over 100 victims in just six months.</p><p>A July 24 complaint from the Commodity Futures Trading Commission (CFTC) said Michael and Amanda Griffis used the connections they made in their real estate business<a href=\"https://cointelegraph.com/news/australian-banks-claim-40-percent-scams-touch-crypto\"> to convince people</a> to fork their savings over to a multi-million dollar investment pool between July 2022 and January 2023. </p><p>These included mortgage brokers and former customers of their real estate business, it said. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The CFTC charged husband and wife realtors of Tennessee for operating a $6M digital assets commodity pool scheme. Learn more: <a href=\"https://t.co/pPq9hV8qeU\">https://t.co/pPq9hV8qeU</a></p>&mdash; CFTC (@CFTC) <a href=\"https://twitter.com/CFTC/status/1683833707390435328?ref_src=twsrc%5Etfw\">July 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“Despite having no trading or other relevant experience, the defendants successfully convinced over 100 people to send them over $6 million to participate in a commodity pool called ‘Blessings of God Thru Crypto,’” the CFTC <a href=\"https://www.cftc.gov/PressRoom/PressReleases/8757-23\" target=\"_blank\" rel=\"noopener nofollow\">said</a>.</p><p>As part of the scheme pool participants were told their funds would be used to trade crypto futures contracts, however, not a single trade was ever conducted, said the CFTC.</p><p>“The defendants falsely represented that pool funds would be safe and under their control, that pool participants could expect high gains, and that the defendants would use pool funds to trade ‘crypto futures.’”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/d20a2d67-7bf2-46f2-a497-b076c6222d05.PNG\"  /><figcaption style=\"text-align: center;\">Excerpt from the futures trading document purportedly written by defendant Michael Griffis Source: CFTC</figcaption></figure><p>Instead, around $4 million of the pooled funds were transferred to digital wallets outside of the Griffis’ control and more than $1 million were misappropriated to pay off personal debt and expensive items over a number of months, the CFTC alleged.</p><p>This included $10,000 in college tuition for family members, $20,000 for an all-terrain vehicle and $335,000 to pay off credit card debt.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/cftc-issues-54m-default-judgment-against-trader-in-crypto-fraud-scheme\"><strong><em>CFTC issues $54M default judgment against trader in crypto fraud scheme</em></strong></a></p><p>The couple has been charged with defrauding over 100 victims and <a href=\"https://cointelegraph.com/news/cftc-proposes-reducing-anonymity-to-manage-risks\">failing to register with the CFTC</a>. </p><p>In its complaint, it requested a permanent injunction against the Griifis and any potential collaborators, preventing them from participating in any future transactions involving commodity interests, along with full restitution to anyone that sustained losses from the scheme, and requested the court impose civil penalties against the Griffis. </p><p>The CFTC warned full restitution will likely be difficult given that the alleged wrongdoers will likely have insufficient funds or assets.</p><p>According to their respective LinkedIn profiles, Michael and Amanda Griffis are affiliated with Exit Realty Screamin’ Eagle, based in Clarksville, Tennessee. Amanda is listed as a “Broker/Co-Owner,” while Michael is listed as a “Realtor.”</p><p>Cointelegraph contacted the Griffis for comment but did not immediately receive a response. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/how-smart-people-invest-in-dumb-memecoins-3-point-plan-for-success/\"><strong><em>How smart people invest in dumb memecoins — 3-point plan for success</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T04:33:00.000Z",
    "title": "Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2023-2032 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! ... <a title=\"Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/uniswap-price-prediction/\" aria-label=\"More on Uniswap Price Prediction 2023-2032: Will UNI Keep Steady?\">Read more</a>"
  }
]