[
  {
    "source": "Decrypt",
    "date": "2023-12-22T21:17:57.000Z",
    "title": "South Korean Game Publisher Wemade Launches $100 Million Blockchain Investment Fund",
    "url": "https://decrypt.co/210764/south-korean-game-publisher-wemade-launches-100-million-blockchain-investment-fund",
    "description": "South Korea's strict anti-blockchain gaming rules have led game studios like Wemade to develop for markets abroad."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-22T21:26:17.000Z",
    "title": "Did the SEC just apologized to the crypto industry?",
    "url": "https://www.cryptopolitan.com/sec-just-apologized-to-the-crypto-industry/",
    "description": "In an unprecedented turn of events, the U.S. Securities and Exchange Commission (SEC) has seemingly extended an olive branch to the crypto industry, admitting to inaccuracies in its enforcement actions. This development has sent ripples through the crypto community, raising questions about the SEC&#8217;s handling of cases involving digital assets. A Sudden Shift in SEC&#8217;s [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-22T21:20:48.000Z",
    "title": "Crypto daily roundup: All that went down today",
    "url": "https://www.cryptopolitan.com/crypto-daily-roundup-what-went-down-today/",
    "description": "The dynamic and ever-evolving world of cryptocurrencies has once again brought a mix of intriguing developments. From Paxos expanding its stablecoin operations to the Solana blockchain to China’s central bank calling for global crypto regulation, the day has been bustling with activity. Amidst all this, Solana&#8217;s market capitalization has managed to outshine Binance&#8217;s BNB, adding [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-22T21:16:23.000Z",
    "title": "Bitcoin ETFs closing in on your 401(k) retirement plan",
    "url": "https://www.cryptopolitan.com/bitcoin-etfs-closing-in-on-your-401k-plan/",
    "description": "The world of retirement savings is on the brink of a seismic shift with the impending arrival of Bitcoin ETFs (Exchange-Traded Funds) in the world of 401(k) plans. The excitement is palpable as the U.S. Securities and Exchange Commission (SEC) inches closer to a decision on whether to greenlight a spot Bitcoin ETF. This move [&#8230;]"
  }
]