[
  {
    "source": "Cointelegraph",
    "date": "2023-08-11T21:30:00.000Z",
    "title": "Crypto Biz: PayPal’s stablecoin goes live, Bitstamp seeks capital, and Coinbase's L2",
    "url": "https://cointelegraph.com/news/crypto-biz-pay-pal-stablecoin-goes-live-bitstamp-seeks-capital-coinbase-l2",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/f5c80c10-4180-42df-b757-66a0403417bd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>This week’s Crypto Biz explores PayPal’s stablecoin, Coinbase’s new layer 2 network, Bitstamp’s fundraising and the growing popularity of crypto bots on Telegram.</p>\n                    <p><p>In a move that can reshape the digital payments landscape, financial technology giant PayPal has unveiled its United States dollar-pegged stablecoin PayPal USD (PYUSD). </p><p>In line with expectations, the launch has ignited a complex debate within the crypto community.</p><p>Ethereum’s daily active user base hovers between 300,000 to 400,000, which is a fraction of PayPal’s colossal user base count of over 430 million. As a result, some see the move as a significant step toward transforming Ethereum into the internet’s monetary backbone. Despite the excitement, skepticism looms over the crypto landscape, with questions about crypto centralization taking center stage. </p><p>However, concerns raised by the crypto community may not pose the biggest challenge to PayPal’s stablecoin; the regulatory landscape is still uncertain in the U.S., where the fintech company is headquartered. </p><p>PayPal is said to have been discussing the stablecoin with regulators and lawmakers in recent months, lobbying for clarity from authorities before releasing PYUSD. Democratic and Republican House Financial Services Committee members have voiced contrasting opinions on the stablecoin launch. </p><p>Nevertheless, the PYUSD debut shows PayPal’s optimism about an upcoming framework for stablecoins oversight in the United States. As regulatory debates unfold, PYUSD’s impact on the industry’s evolution and stablecoin dominance remains to be seen. </p><p>This week’s Crypto Biz explores PayPal’s stablecoin, Coinbase’s new layer 2 network, Bitstamp’s fundraising and the growing popularity of crypto bots on Telegram. </p><h2>PayPal launches PYUSD stablecoin for payment</h2><p>American financial technology company PayPal <a href=\"https://cointelegraph.com/news/paypal-launches-stablecoin-for-payment\">launched a new stablecoin</a> on Aug. 7. The U.S. dollar-pegged PYUSD will be issued by Paxos Trust Company, and it is fully backed by U.S. dollar deposits, short-term Treasurys and similar cash equivalents. PYUSD is built on Ethereum and is “designed for digital payments and Web3.” The stablecoin is expected to be available in the U.S. soon, according to the firm. To justify the move, PayPal argues that the regulatory environment around stablecoins in the U.S. is gradually “progressing toward more clarity,” thus, there is a demand for alternative stablecoins. The company first confirmed its plans to launch a stablecoin in January 2022, claiming it would work closely with relevant regulators. The stablecoin will be redeemable for U.S. dollars or exchanged for other cryptocurrencies on the platform. </p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/avz4_Msc9aE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><h2>Bitstamp crypto exchange to raise funds for global expansion</h2><p>Bitstamp is moving forward with its global expansion ambitions, <a href=\"https://cointelegraph.com/news/bitstamp-raises-funds-for-global-expansion\">working to raise new funds</a> to scale operations worldwide, including plans to launch derivatives trading in Europe in 2024 and expand its services in Asia and the United Kingdom. Bitstamp currently operates in 194 countries. In the U.S., the company announced that the trading of several tokens deemed securities by the Securities and Exchange Commission <a href=\"https://cointelegraph.com/news/bitstamp-suspend-trading-major-altcoins-us-users\">would be suspended soon</a>. This includes Axie Infinity (<a href=\"https://cointelegraph.com/axie-infinity-axs-price-index\">AXS</a>), Chiliz (CHZ), Decentraland (<a href=\"https://cointelegraph.com/decentraland-mana-price-index\">MANA</a>), Polygon (<a href=\"https://cointelegraph.com/polygon-price-index\">MATIC</a>), Near (<a href=\"https://cointelegraph.com/near-protocol-price-index\">NEAR</a>), The Sandbox (SAND) and Solana (<a href=\"https://cointelegraph.com/solana-price-index\">SOL</a>). These developments follow Ripple’s <a href=\"https://cointelegraph.com/news/ripple-acquires-pantera-s-stake-in-bitstamp\">acquisition of a minority stake in Bitstamp</a> in the first quarter of 2023. </p><h2>Base network has officially launched: Here’s how it can be used</h2><p>Coinbase’s layer-2 network, Base, <a href=\"https://cointelegraph.com/news/coinbase-base-network-officially-launched-heres-how-it-can-be-used\">was launched on Aug. 9</a>, allowing end users to onboard for the first time without relying on developer tools. In response to the launch, several Web3 teams announced the release of apps running on Base. A few things users can do on Base right now include bridging Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) from mainnet to Base, swapping tokens and providing liquidity through decentralized exchanges, making payments, registering a username, launching a decentralized autonomous organization and minting nonfungible tokens. In another headline, Coinbase <a href=\"https://cointelegraph.com/news/coinbase-begins-150m-debt-buyback-36-percent-discount\">will start buying back up to $150 million</a> of its 2031 senior notes for $0.645 — a discount of 35.5%. The 2031 senior notes have a coupon rate of 3.625% yearly and a total principal balance of $1 billion. The tender offer will last until Sept. 1. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Base is open and Onchain Summer is here <br><br>Become a part of Base history by minting “Base Day One” to join the story of bringing the world onchain<br><br>Our story.<a href=\"https://t.co/qaDj7CBCMd\">https://t.co/qaDj7CBCMd</a> <a href=\"https://t.co/9PZCLQQV7p\">pic.twitter.com/9PZCLQQV7p</a></p>&mdash; Base ️ (@BuildOnBase) <a href=\"https://twitter.com/BuildOnBase/status/1689321221715017728?ref_src=twsrc%5Etfw\">August 9, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<h2>Telegram crypto bots gain momentum in the market: Binance Research</h2><p>Telegram bots <a href=\"https://cointelegraph.com/news/telegram-crypto-bots-gain-momentum-binance-research\">have been increasingly emerging as a new tool</a> to get exposure to cryptocurrency markets and several related services. The cumulative crypto trading volume associated with Telegram bots exceeded $190 million as of early August 2023, according to a new report by Binance Research. Crypto activity facilitated through these bots has increased in recent months. On July 23, daily volumes of trades hit a record high of $10 million. Telegram bots are often connected to peer-to-peer or decentralized cryptocurrency exchanges, enabling users to execute trades using chatbot commands. Telegram bots have collected more than 15,500 ETH (about $28 million) in all-time revenue, Binance reported.</p><p><em>Crypto Biz is your weekly pulse of the business behind blockchain and crypto, delivered directly to your inbox every Thursday.</em></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T21:33:25.000Z",
    "title": "FC Barcelona secures €120M funding for its latest web3 venture",
    "url": "https://www.cryptopolitan.com/fc-barcelona-receives-120m-funding-for-web3/",
    "description": "FC Barcelona, the Spanish footballing giant and current La Liga champion, is venturing further into the digital sphere. With a hefty €120 million (roughly $132 million) backing, FC Barcelona is propelling their new project, &#8216;Barça Vision&#8216;. This will be a dedicated platform where the club will place all of its digital content around web3, NFT, ... <a title=\"FC Barcelona secures €120M funding for its latest web3 venture\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fc-barcelona-receives-120m-funding-for-web3/\" aria-label=\"More on FC Barcelona secures €120M funding for its latest web3 venture\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T21:31:06.000Z",
    "title": "BRICS bank prioritize local currencies",
    "url": "https://www.cryptopolitan.com/brics-bank-prioritize-local-currencies/",
    "description": "The New Development Bank (NDB), an initiative of the BRICS nations, is facing an inevitable shift. While it was established to serve emerging economies and move away from dollar-dependence, global economic shifts are steering its path differently. Its founding member, Russia, is grappling with sanctions, prompting a reconsideration of the bank&#8217;s strategy. The local currency ... <a title=\"BRICS bank prioritize local currencies\" class=\"read-more\" href=\"https://www.cryptopolitan.com/brics-bank-prioritize-local-currencies/\" aria-label=\"More on BRICS bank prioritize local currencies\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T21:22:44.000Z",
    "title": "What early Coinbase Base activity tells us",
    "url": "https://www.cryptopolitan.com/what-early-coinbase-base-activity-tells-us/",
    "description": "Coinbase Base, the latest layer-2 network in the crypto space, has erupted onto the scene, generating an unparalleled volume in DeFi activity and cross-chain bridge transactions. Its impressive onset gives rise to vital questions about the integrity of these numbers and the participants driving this explosive activity. Coinbase Base vs. its contemporaries Coinbase Base&#8217;s inauguration ... <a title=\"What early Coinbase Base activity tells us\" class=\"read-more\" href=\"https://www.cryptopolitan.com/what-early-coinbase-base-activity-tells-us/\" aria-label=\"More on What early Coinbase Base activity tells us\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T21:22:39.000Z",
    "title": "Filecoin Price Prediction 2023-2032: What’s the future for FIL?",
    "url": "https://www.cryptopolitan.com/filecoin-price-prediction/",
    "description": "Filecoin Price Prediction 2023-2032 How much is Filecoin (FIL) worth? Today&#8217;s Filecoin price is $4.10, with a 24-hour trading volume of $101,148,403. Filecoin is down 0.53% in the last 24 hours. The current CoinMarketCap ranking is #30, with a market cap of $1,931,939,927. It has a circulating supply of 438,146,575 FIL coins, and the max. ... <a title=\"Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/filecoin-price-prediction/\" aria-label=\"More on Filecoin Price Prediction 2023-2032: What&#8217;s the future for FIL?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-11T21:15:26.000Z",
    "title": "Biden disses China over its economic woes",
    "url": "https://www.cryptopolitan.com/biden-disses-china-over-its-economic-woes/",
    "description": "The political landscape crackled with tension recently as President Joe Biden, while addressing an audience at a political fundraiser in Utah, unloaded his critical perspective on China&#8217;s economic woes. Not one to hold back his punches, Biden drew a rather concerning image of China&#8217;s faltering economic strength. Biden on the missteps in China&#8217;s growth numbers ... <a title=\"Biden disses China over its economic woes\" class=\"read-more\" href=\"https://www.cryptopolitan.com/biden-disses-china-over-its-economic-woes/\" aria-label=\"More on Biden disses China over its economic woes\">Read more</a>"
  }
]