[
  {
    "source": "CryptoSlate",
    "date": "2023-10-30T22:00:41.000Z",
    "title": "X has lost more than half its value since Elon Musk bought it last year",
    "url": "https://cryptoslate.com/x-has-lost-more-than-half-its-value-since-elon-musk-bought-it-last-year/",
    "description": "<p>X, formerly known as Twitter, has seen its value fall significantly since Elon Musk bought it for $44 billion a year ago. According to an Oct. 30 report from The Verge that cited internal documents, X employees were recently granted company equity worth $45 per share with the company valued at $19 billion — 55% lower [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/x-has-lost-more-than-half-its-value-since-elon-musk-bought-it-last-year/\">X has lost more than half its value since Elon Musk bought it last year</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-30T21:50:23.000Z",
    "title": "Terraform Labs advocates for early dismissal in SEC legal battle",
    "url": "https://www.cryptopolitan.com/terraform-labs-advocates-for-dismissal-in-sec-case/",
    "description": "Terraform Labs and its co-founder, Do Kwon, are actively seeking vindication in their ongoing battle with the U.S. Securities and Exchange Commission (SEC). They have petitioned Judge Jed Rakoff of the U.S. District Court for the Southern District of New York to rule in their favor. Their main contention is that the SEC, even after ... <a title=\"Terraform Labs advocates for early dismissal in SEC legal battle\" class=\"read-more\" href=\"https://www.cryptopolitan.com/terraform-labs-advocates-for-dismissal-in-sec-case/\" aria-label=\"More on Terraform Labs advocates for early dismissal in SEC legal battle\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-30T22:00:31.000Z",
    "title": "Bitcoin Solid Above $34,000 Despite High Short-Term Holder Profit-Taking",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-solid-34000-high-short-term-holders/",
    "description": "Bitcoin has shown some impressive strength above the $34,000 mark despite a high amount of profit-taking from short-term holders. Bitcoin Short-Term Holders Are Selling, While Long-Term Holders Are Still Quiet As explained by analyst James V. Straten in a new post on X, the short-term holders are currently participating in one of the strongest profit-taking events of the past couple of years. The &#8220;short-term holders&#8221; (STHs) here refer to all those Bitcoin investors who have been holding onto their coins since less than 155 days ago. This group comprises one of the two main divisions of the BTC market, with the other being called the &#8220;long-term holders&#8221; (LTHs). Statistically, the longer an investor keeps their coins dormant, the less likely they become to sell them at any point. Because of this reason, the STHs are generally the weak-minded hands of the sector, while the LTHs are the strong, persistent holders. Related Reading: Bitcoin Price Consolidates Below $35K – Here’s What Could Trigger Bearish Reaction Whenever the sector goes through any significant FUD or FOMO, the STHs budge and participate in at least some amount of selling. The LTHs, on the other hand, usually show little reaction. Since the Bitcoin price has enjoyed a sharp rally recently that has taken its price above the $34,000 level, the STHs would naturally be selling now. One way to track whether this Bitcoin group is selling their coins can be by tracking the volume that they are transferring to exchanges. In the context of the current discussion, Straten has decided to choose the version of this indicator that specifically tracks the transactions from investors who are in profit, as profit-taking is generally the behavior of focus during rallies. In contrast, loss transactions play a greater role in price slumps. Now, here is a chart that shows the trend in the metric for the Bitcoin STHs over the past two years: Looks like the value of the metric has been quite high in recent days &#124; Source: @jimmyvs24 on X As shown in the above graph, the Bitcoin STHs in profit have sent large amounts to these centralized platforms since the latest rally in the asset. This confirms that these weak hands have been selling recently. As mentioned before, it&#8217;s not unusual for such a thing to happen, but the scale of the profit-taking this time around is particularly significant. Related Reading: 19,197 BTC Makes Its Way Out Of Binance, Trigger For Bitcoin Recovery? From the chart, it&#8217;s visible that there have only been a few times in the past couple of years where the STHs in profit have transferred comparable or higher volumes to exchanges. Given this selloff, it&#8217;s impressive that Bitcoin has been able to hold on above the $34,000 level during the last few days. As expected from the LTHs, they haven&#8217;t sold much despite the rally. The metric has seen a small spike recently &#124; Source: @jimmyvs24 on X The metric is currently at its sixth-largest value for this year, but as is clear from the above graph, the scale of this selloff is still not that much in pure terms. BTC Price At the time of writing, Bitcoin is trading at around $34,700, up 13% in the past week. BTC has slowed down a bit since its sharp rally &#124; Source: BTCUSD on TradingView Featured image from Kanchanara on Unsplash.com, charts from TradingView.com, Glassnode.com"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-30T22:01:31.000Z",
    "title": "UK Finance Ministry To Go Ahead With Sweeping Crypto Regulations: Report",
    "url": "https://dailyhodl.com/2023/10/30/uk-finance-ministry-to-go-ahead-with-sweeping-crypto-regulations-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/06/Regulator-Issues-Crypto-Warning.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/06/Regulator-Issues-Crypto-Warning.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/06/Regulator-Issues-Crypto-Warning.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/06/Regulator-Issues-Crypto-Warning.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/06/Regulator-Issues-Crypto-Warning.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/06/Regulator-Issues-Crypto-Warning.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/06/Regulator-Issues-Crypto-Warning.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Financial regulators in the United Kingdom are reportedly planning to legislate new regulations for the crypto industry in the country. According to Reuters, the UK Finance Ministry, Great Britain&#8217;s top financial regulator, plans to both develop and implement sweeping rules for regulating crypto. Great Britain is following in the footsteps of the European Union (EU), which [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/30/uk-finance-ministry-to-go-ahead-with-sweeping-crypto-regulations-report/\">UK Finance Ministry To Go Ahead With Sweeping Crypto Regulations: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]