[
  {
    "source": "Bitcoin.com",
    "date": "2023-07-18T03:30:13.000Z",
    "title": "Nobel Laureate Paul Krugman Says US Dollar Dominance Won’t Last Forever but Doubts Chinese Yuan Can Replace USD",
    "url": "https://news.bitcoin.com/nobel-laureate-paul-krugman-says-us-dollar-dominance-wont-last-forever-but-doubts-chinese-yuan-can-replace-usd/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/paul-krugman-us-dollar-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Nobel Laureate Paul Krugman Says US Dollar Dominance Won&#039;t Last Forever but Doubts Chinese Yuan Can Replace USD as Dominant Currency\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/paul-krugman-us-dollar-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/paul-krugman-us-dollar-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/paul-krugman-us-dollar-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/paul-krugman-us-dollar-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/paul-krugman-us-dollar-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/paul-krugman-us-dollar-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/paul-krugman-us-dollar.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Nobel Prize-winning economist Paul Krugman says the U.S. dollar&#8217;s dominance &#8220;won&#8217;t last forever.&#8221; While recognizing the global de-dollarization trend, he expressed skepticism about the Chinese yuan&#8217;s ability to replace the U.S. dollar as the world&#8217;s dominant currency. Economist Paul Krugman on U.S. Dollar Dominance and Chinese Yuan Nobel laureate Paul Krugman discussed the U.S. dollar&#8217;s [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-18T03:22:11.000Z",
    "title": "Nearly one-third of bitcoin’s circulating supply possibly lost: report",
    "url": "https://crypto.news/nearly-one-third-of-bitcoins-circulating-supply-possibly-lost-report/",
    "description": "Recent data from blockchain analytics company IntoTheBlock indicates that approximately 29% of the total Bitcoin supply, which has remained stagnant for over five years, might be lost forever. Fresh data unveiled by the blockchain analytics firm, IntoTheBlock, reveals that close&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-18T03:20:43.000Z",
    "title": "Bitcoin Price Needs To Clear $30,500 For Hopes of a Fresh Rally",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-30500-fresh-rally/",
    "description": "Bitcoin price is again moving lower toward the $29,200 level. BTC must surpass $30,500 to attempt a fresh increase in the near term. Bitcoin is showing bearish signs and trading well below the $30,500 zone. The price is trading below $30,300 and the 100 hourly Simple moving average. There is a key bearish trend line forming with resistance near $30,200 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could continue to move down if it stays below the $30,500 resistance. Bitcoin Price Extends Decline Bitcoin price attempted a fresh increase above the $30,250 level but failed to gain bullish momentum. BTC stayed below the key $30,500 resistance zone. A high was formed near $30,447 before the price dropped below $30,000. It traded to a new weekly low at $29,669 and is currently correcting losses. It broke the 50% Fib retracement level of the recent decline from the $30,447 swing high to the $29,669 low. The price was able to climb above the $30,000 level. Bitcoin price is now trading below $30,300 and the 100 hourly Simple moving average. Immediate resistance is near the $30,200 level. There is also a key bearish trend line forming with resistance near $30,200 on the hourly chart of the BTC/USD pair. The trend line is near the 61.8% Fib retracement level of the recent decline from the $30,447 swing high to the $29,669 low. The first major resistance is near $30,265. The main resistance is now forming near the $30,450 and $30,500 levels. A close above the $30,500 level might start a fresh increase. Source: BTCUSD on TradingView.com The next major resistance is near the $30,850 level. Any more gains could open the doors for a move toward the $31,500 resistance zone. More Losses in BTC? If Bitcoin fails to clear the $30,500 resistance, it could continue to move down. Immediate support on the downside is near the $29,850 level. The next major support is near the $29,550 level, below which there could be a drop toward the $29,200 support zone. Any more losses might send the price toward the $28,750 level in the near term. Technical indicators: Hourly MACD – The MACD is now gaining pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now near the 50 level. Major Support Levels – $29,850, followed by $29,200. Major Resistance Levels – $30,200, $30,265, and $30,500."
  }
]