[
  {
    "source": "Cointelegraph",
    "date": "2023-07-25T20:39:55.000Z",
    "title": "Bitcoin price is down, but data signals that $30K and above is the path of least resistance ",
    "url": "https://cointelegraph.com/news/bitcoin-price-is-down-but-data-signals-that-30k-is-the-path-of-least-resistance",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/4c17f547-2b43-49c6-ac16-689dfdc90940.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Even with a price correction to $29,000, several Bitcoin price metrics show traders casting bets on a quick rebound. </p>\n                    <p><p>On July 24, Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) experienced a flash crash, plummeting to $29,000 in a movement now attributed to significant BTC holders potentially liquidating their positions. </p><p>Amidst the crash and market uncertainty, Bitcoin's three major trading metrics continue to project a bullish outlook, signifying that professional traders have not reduced their leverage longs through the use of margin and derivatives.</p><p>Analytics firm Glassnode reported a <a href=\"https://cointelegraph.com/news/bitcoin-whale-exchange-inflow-1-year-high\">surge in whales' inflow to exchanges</a>, reaching its highest level in over three years at 41% of the total. This forceful sell-off from whales alarmed investors, especially in light of the absence of any significant negative events impacting Bitcoin in the past month. </p><p>Notably, a major concern stems from the ongoing court cases by the U.S. Securities and Exchange Commission (<a href=\"https://cointelegraph.com/news/sec-lawsuit-binance-coinbase-crypto-industry-comments\">SEC) against leading exchanges</a>, Binance and Coinbase. Still, there hasn’t been any major advancement on those cases, which will likely take years to settle.</p><h2>Bitcoin’s price crash might have been related to the U.S. dollar reversion</h2><p>Despite historical volatility, Bitcoin’s crash became more pronounced following 33 consecutive days of trading within a tight 5.7% daily range. The movement is further accentuated by the S&amp;P 500 gaining 0.4%, crude oil rising by 2.4%, and the MSCI China stock market index surging by 2.2%. </p><p>However, it is essential to consider that the world's largest global reserve asset, gold, experienced a dip of 0.5% on July 24. Furthermore, the dollar strength index (DXY) reversed its two-month-long trend of devaluation against competing fiat currencies, climbing from 99.7 to 101.4 between July 18 and July 24.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/6cb164aa-9a3b-4d47-89b0-cffc45d63ac9.png\"  /><figcaption style=\"text-align: center;\"><em>U.S. dollar strength index (DXY). Source: TradingView</em></figcaption></figure><p>The DXY index measures the strength of the U.S. dollar against a basket of foreign currencies, including the U.K. Pound, Euro, Japanese Yen, Swiss Franc and others. If investors believe that the U.S. Fed will manage a soft landing successfully, it makes sense to reduce exposure to gold and Bitcoin while increasing positions in the stock market. Lower odds of a recession can positively impact corporate earnings.</p><h2>Margin and derivatives markets show resolute professional traders</h2><p>To understand whether Bitcoin’s price move down to $29,000 has successfully ruptured the market structure, one should analyze margin and derivatives markets. <a href=\"https://cointelegraph.com/explained/margin-trading-vs-futures-what-are-the-differences\">Margin trading</a> allows investors to leverage their positions by borrowing stablecoins and using the proceeds to buy more cryptocurrency.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/2aad8ab6-a905-42d4-9414-caef3c3c88cb.png\"  /><figcaption style=\"text-align: center;\"><em>OKX stablecoin/BTC margin lending ratio. Source: OKX</em></figcaption></figure><p>The margin lending of OKX traders based on the stablecoin/BTC ratio rose between July 22 and July 24, suggesting that professional traders added leveraged long positions despite the recent price crash.</p><p>Traders should corroborate this data with derivatives to ensure its market-wide impact. In healthy markets, BTC futures contracts typically trade at a 5 to 10% annualized premium, known as contango, which is not exclusive to crypto.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/8ebd4cac-d305-4b96-a383-417da6d113ae.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin 2-month futures annualized premium. Source: Laevitas</em></figcaption></figure><p>Notice how the indicator sustained a healthy 5.7% average annualized premium, slightly lower than two days prior but still within the neutral range. This data confirms the resilience of margin markets, but to gauge market sentiment further it’s also helpful to look at the<a href=\"https://cointelegraph.com/learn/crypto-derivatives\"> options markets</a>.</p><p>The 25% delta skew can reveal when arbitrage desks and market makers charge higher prices for protection against upside or downside movements. In short, a skew metric rising above 7% suggests traders anticipate a drop in Bitcoin's price, while periods of excitement generally yield a negative 7% skew.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/3d426aab-e641-45fa-bad0-c4fb30059372.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin 30-day options 25% delta skew. Source: Laevitas</em></figcaption></figure><p>The 25% delta skew remained negative, indicating that bullish call options were trading at a premium compared to protective puts. This further supports the thesis that professional traders remain unfazed by the flash crash, with no evidence indicating pessimism among whales and market makers.</p><h2>The path to $30,000 and above shows the least resistance</h2><p>All factors considered, irrespective of the rationale behind the price move on July 24, Bitcoin bears could not dampen investor optimism, resulting in higher odds of a recovery above $30,000 in the short term. Notably, the mere appreciation of the U.S. dollar does not impact Bitcoin's predictable monetary policy, censorship resistance and autonomous nature as a means of payment.</p><p>On the brighter side, there are some positive triggers on the horizon, including the <a href=\"https://cointelegraph.com/news/spot-crypto-etf-applications-federal-register-sec-approval\">possible approval of a spot Bitcoin ETF</a> and gaining regulatory clarity. Proof of this comes from a recent U.S. bill introduced on July 20 that seeks to establish a <a href=\"https://cointelegraph.com/news/crypto-bills-could-change-us-landscape-explained\">clear process for determining the classification of digital assets</a> as commodities or securities. If the bill becomes law, it would give the Commodity Futures Trading Commission (CFTC) authority over digital commodities.</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-25T21:00:45.000Z",
    "title": "Dogecoin and Moons secure spaces on Reddit’s “place” canvas; Bitcoin fails to do so",
    "url": "https://cryptoslate.com/dogecoin-and-moons-secure-spaces-on-reddits-place-canvas-bitcoin-fails-to-do-so/",
    "description": "<p>Dogecoin and the /r/cryptocurrency subreddit have both secured a place in Reddit&#8217;s massive &#8220;place&#8221; canvas as of July 25. The event, which has been ongoing since July 20, allows Reddit users to edit an image one pixel at a time. The fact that each user must wait a certain amount of time to draw each [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/dogecoin-and-moons-secure-spaces-on-reddits-place-canvas-bitcoin-fails-to-do-so/\">Dogecoin and Moons secure spaces on Reddit&#8217;s &#8220;place&#8221; canvas; Bitcoin fails to do so</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-25T21:00:00.000Z",
    "title": "Law Expert Explains Four Options SEC Has in Case against Ripple",
    "url": "https://cryptodaily.co.uk/2023/07/law-expert-explains-four-options-sec-has-in-case-against-ripple",
    "description": "<p>After a partial Ripple&rsquo;s win against the SEC, many believe that the latter will file an appeal &ndash; law expert James Murphy offers four possible future scenarios for the case.</p>\nRipple Wins the Lawsuit against the SEC... or not yet?&nbsp;\n<p>On July 13, 2023, Judge Analise Torres partially ruled in favor of Ripple Labs in the case against the U.S. Securities and Exchange Commission&rsquo;s (SEC), putting an end to a 3-year-long crusade.&nbsp;</p>\n<p>The historic victory made the XRP token skyrocket in value and sent the bullish wave to the whole crypto market. However, some believe that the battle is not over yet, as the SEC still has the option to file an appeal.&nbsp;</p>\n<p>Law expert James Murphy known on Twitter as &ldquo;MetaLawMan&rdquo; has shed some light on the matter. In his recent Tweet of July 25, Murphy identified four options the SEC currently has and described how each could work.&nbsp;</p>\nSo, What Could the SEC Do Next?&nbsp;\n<p>According to the expert, the first option on the table for the SEC is to file a request for an interlocutory appeal. At the moment, the SEC doesn't have the unilateral right to appeal as the final judgment has not been entered yet. To proceed with an interlocutory appeal, the SEC would need to ask the permission of Judge Torres and the Second Circuit Court of Appeals. To get this permission, Murphy explains that the SEC would need to prove that:</p>\n<ol>\n<li>\n&ldquo;The ruling involves a controlling question of law;\n</li>\n<li>\nThere is substantial grounds for difference of opinion on that question;&nbsp;\n</li>\n<li>\nAn immediate appeal may materially advance the litigation.&rdquo;\n</li>\n</ol>\n<p>There&rsquo;s no deadline for the initial request, although it&rsquo;s likely to be done within 30 days. In case Judge Torres agrees, the SEC would have 10 days to seek permission from the Second Circuit Court of Appeals.&nbsp;</p>\n<p>The second option for the SEC is to start a trial on the aiding and abetting claim against Larsen and Garlinghouse and file a regular appeal after.</p>\n<p>Another potential path for the SEC is to drop the claim against Larsen and Garlinghouse. This would allow the SEC to take an immediate appeal without seeking permission.</p>\n<p>Finally, the SEC has the option to settle, although Murphey believes that it&rsquo;s highly unlikely due to the political considerations.</p>\n<p>James Murphy concludes that the first option is the most probable because the SEC is under pressure to get the Torres decision reversed and because the Ripple case could influence lawsuits against other crypto platforms such as Coinbase and Binance. Overall, the expert is quite optimistic about the Ripple&rsquo;s chances:</p>\n\n<p>&ldquo;I expect the SEC to file a request for interlocutory appeal within the next 2 weeks. I believe it would be in the best interests of Ripple &amp; the #XRPCommunity for the appeals process to start now--rather than a year from now. And I like Ripple's chances on appeal.&rdquo;</p>\n\n<p>Meanwhile, the price of XRP has been shining green in the last 10 days, even though it still hasn&rsquo;t reached a $1 mark.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-25T20:55:44.000Z",
    "title": "Top global firms react to the state of China’s economy",
    "url": "https://www.cryptopolitan.com/top-global-firms-react-to-china-economy/",
    "description": "A flimsy recovery from the global pandemic has marked China&#8217;s economy with uncertainty. This precarious situation has elicited an array of responses from global corporations, spanning sectors from finance to technology. Navigating these choppy economic waters, international firms are embracing caution, particularly in their dealings with the world&#8217;s second-largest economy. Mixed responses to China&#8217;s economic ... <a title=\"Top global firms react to the state of China&#8217;s economy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/top-global-firms-react-to-china-economy/\" aria-label=\"More on Top global firms react to the state of China&#8217;s economy\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-25T21:00:13.000Z",
    "title": "Ducati Partners With Ripple, Prepares To Launch NFT Collection On XRP Ledger",
    "url": "https://www.newsbtc.com/analysis/xrp/ducati-partners-with-ripple-prepares-to-launch-nft-collection-on-xrp-ledger/",
    "description": "Following a long-term interest in Web3, Ducati partnered with payment company Ripple and is set to launch its first non-fungible token (NFT) collection on the XRP Ledger this week. This step is the motorcycle company&#8217;s first venture into the Web3 space and blockchain technology. Related Reading: Cardano TVL – A Crucial Factor For ADA Price Revival? Ducati Delves Into Web3; Prepares To Launch First NFT Collection Ducati, a renowned motorcycle manufacturer established in 1926, is set to enter the world of Web3 by launching its first-ever digital collectibles on the XRP Ledger. The Bologna-based firm believes this step is essential to strengthen its relationship with its global community. Claudia Domenicali, CEO of Ducati, commented on the Web3 move: Entering WEB 3.0 is another way to get closer to the Ducatisti community by further extending the number of services offered to them. It also represents an opportunity to meet and make ourselves known to a new community of NFT enthusiasts, giving them the opportunity to live unique Ducati-style experiences and collect the digital assets that we will develop exclusively for this new dimension of the brand. Ducati claims the digital collectible will consist of a video sequence of Ducati logos on tanks of motorcycles manufactured from 1946 to date. This NFT collection is set to go live on the XRP Ledger on July 26, 2023.  Collectibles. Community. Experiences. Ducati enters the #Web3 world with @Web3Pro_ &#38; @Ripple, showcasing Ducati&#8217;s past, present and future. Registration goes live July 26. Join the waitlist now to stay in the know at https://t.co/eFRTFwdvWT pic.twitter.com/IWAHbM1Wfy — Ducati (@DucatiMotor) July 20, 2023 Users who sign up within the first week after launch will receive the Ducati NFT “as a gift.” In addition, these users can access future releases by the motorcycle manufacturer.  It is worth mentioning that Ducati also collaborated with Web3 Pro, a white-label Software-as-a-Service (SaaS) platform, in the execution of this NFT project. A Win For Ripple And XRP Ledger? The XRP Ledger is a public, decentralized blockchain designed by Ripple, the company behind the XRP token. Blockchain technology allows for the creation of tokens, which are IOUs representing any currency value, and the production of NFTs. Indeed, XRP Ledger is not the most popular choice amongst enthusiasts regarding non-fungible tokens. However, the blockchain has been experiencing significant activity recently, with more than 1 million non-fungible tokens minted in the first quarter of 2023. With Ducati set to launch its first-ever NFT collection, XRPL may likely enjoy increased adoption and on-chain activity in the coming months. Moreover, Ripple has been in the spotlight following its victory over the U.S. Securities and Exchange Commission (SEC) on July 13. Related Reading: Ripple’s XRP Sales Jump Significantly In 2023, But Is This Bearish For The Altcoin? It is worth pointing out the timing of Ducati’s NFT rollout on the XRP Ledger. Although it remains unclear whether Ripple&#8217;s recent win is integral to the NFT launch, one cannot deny the positive impact this ruling has had on Ripple’s payment technology lately. Today, July 25, 2023, the Republic of Palau unveiled its collaboration with Ripple Labs to mint its stablecoin. Expectedly, this Palau stablecoin is deployed on the XRP Ledger. XRPUSD trading at $0.69835 &#124; Source: XRPUSD daily chart on TradingView Featured image from Unsplash, chart from TradingView"
  }
]