[
  {
    "source": "CoinDesk",
    "date": "2023-06-07T06:57:12.000Z",
    "title": "Cathie Wood's ARK Buys $21.6M Coinbase Shares as SEC Suit Sends COIN Prices Tumbling",
    "url": "https://www.coindesk.com/markets/2023/06/07/cathie-woods-ark-buys-216m-coinbase-shares-as-sec-suit-sends-coin-prices-tumbling/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The purchase took ARK Invest's total Coinbase holdings to 11.44 million shares."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-07T07:02:45.000Z",
    "title": "Superman Released as Web3 Movie Experience",
    "url": "https://cryptodaily.co.uk/2023/06/superman-released-as-web3-movie-experience",
    "description": "<p>Iconic DC Super Hero Film, Superman, is being released as a multimedia living movie experience from Warner Bros. Home Entertainment and Eluvio. </p>\n<p>The experience Includes 4K UHD Feature Film and Special Features, Interactive Themed Navigation, Explorable Image Galleries, Discoverable Digital Easter Eggs, and more.</p>\n<p>Warner Bros. Home Entertainment, in partnership with content blockchain pioneer&nbsp;Eluvio, announced the next instalment of the WB Movieverse with the iconic DC Super Hero film&nbsp;SupermanWeb3 Movie Experience.</p>\n<p>The film is available for preview at&nbsp;https://web3.wb.com&nbsp;and opens for purchase on June 9, 2023.&nbsp;&nbsp;</p>\n<p>The release of&nbsp;the Superman&nbsp;Web3 Movie Experience follows the 2022 first-of-its-kind Web3 entertainment offering&nbsp;&lsquo;The Lord of the Rings: The Fellowship of the Ring&nbsp;(Extended Edition)&rsquo; Web3 Movie Experience.</p>\n<p>The Superman&nbsp;Web3 Movie Experience is a multimedia non-fungible token (NFT) for fans to own and to engage with the 1978 Richard Donner film in a new and exciting way.</p>\n<p>Through dynamic menu options based on iconic locations from the film, owners can watch the movie in 4K UHD on a desktop, mobile, tablet or TV device.</p>\n<p>Viewers can access special features, view image galleries and artist renderings by notable DC artists, discover digital easter eggs, and sell the experience in a community marketplace.&nbsp;&nbsp;</p>\n<p>The&nbsp;Superman&nbsp;Web3 Movie Experience will be offered in&nbsp;standard and premium editions.</p>\nStandard Edition\n<p>$30 for one week from 8:00 AM ET on June 9 to 7:59 AM ET on June 16</p>\n<p>Includes an interactive location-based navigation menu,&nbsp;Superman: The Movie&nbsp;Theatrical Version, previously released special features and an image gallery featuring stills and behind-the-scenes galleries.</p>\nPremium Edition&nbsp;\n<p>$100 for 24 hours from 8:00 AM ET on June 9 to 7:59 AM ET on June 10</p>\n<p>Includes three different variations separately available for purchase: Truth, Justice, and Hope. Each variation features an illustration of Christopher Reeves&rsquo; Superman from one of three DC artists - Ivan Reiss, Ben Oliver, or Bill Sienkiewicz.</p>\n<p>Each variation includes an interactive and explorable location-based navigation menu and three versions of the feature film &ndash;&nbsp;Superman: The Movie&nbsp;Theatrical Version;&nbsp;Superman: The Movie&nbsp;Expanded Director&rsquo;s Cut, and&nbsp;Superman: The Movie&nbsp;Extended TV Edition</p>\n<p>Additionally, each is debuted with previously-released special features, image galleries featuring costume and detail images from the Warner Bros. archive, and stills and behind-the-scenes galleries.</p>\n<p>The Superman Web3 Movie Experience will include a free voucher code for a&nbsp;DC3&nbsp;Super Power Pack: Series Superman&nbsp;from the&nbsp;DC NFT Marketplace, offering three randomly selected&nbsp;Superman&nbsp;comics with rarities ranging from Common to Legendary.</p>\n<p>These packs are time-gated, open-edition drops, limited to one per account. New themed packs will launch every few weeks, so stay tuned for updates.</p>\n<p>Early access to all editions of the&nbsp;Superman&nbsp;Web3 Movie Experience will be available to DC Bat Cowl NFT holders at 8:00 AM ET on June 8, to DC3 holders at 11:00 AM ET on June 8, and to&nbsp;The Lord of the Rings&nbsp;Web3 Movie Experience holders at 2:00 PM ET on June 8.</p>\n<p>Michelle Munson, CEO and co-founder of Eluvio said:</p>\n\n<p>&ldquo;For fans of this beloved and iconic film,&nbsp;Superman: The Movie&nbsp;is being released as an exclusive Web3 film and immersive digital collectable for the first time.</p>\n<p>As part of the WB Movieverse, consumers can easily watch, collect, and sell their film Web3 Movie Experiences on the blockchain in the Movieverse marketplace. For Warner Bros., and the broader industry, Eluvio is honored to back this novel digital sell-through experience for 4K films and premium video assets &ndash; all streamed from and backed by secure blockchain access and ownership on the Eluvio Content Fabric.&rdquo;</p>\n\n<p>The&nbsp;Superman&nbsp;Web3 Movie Experience will be available to the public on June 9, exclusively at&nbsp;https://web3.wb.com, and can be purchased by credit card or cryptocurrency.&nbsp;&nbsp;</p>\n<p>To participate in this novel experience, fans can create a secure, easy-to-use media wallet that acts as a digital vault and enables consumers to stream and purchase content via credit cards or crypto wallets.&nbsp;</p>\nSuperman Web3 Movie Experience Powered by Eluvio\n<p>Eluvio, a pioneer of Web3 innovation throughout the media and entertainment industry, powers the Superman&nbsp;Web3 Movie Experience.</p>\n<p>The Eluvio Content Blockchain provides a high-performance, simple-to-use, cost-effective Web3 platform built for content. It enables Web3 native media experiences, allowing publishers and fans to directly enjoy and monetize&nbsp;shows, films, concerts, digital albums, digital collectables, interactive and metaverse experiences, and more.&nbsp;</p>\n<p>Content creators, and their communities, benefit from a significantly more carbon-efficient and high-performance alternative to traditional platforms for content streaming, distribution, and storage, including 4K streaming, ticketing, NFT minting, and trading of premium content.&nbsp;</p>\n<p>Notably, in this experience, the core digital assets and derivative NFTs are all on the blockchain, not just the token (NFT) itself. Warner Bros. Discovery Home Entertainment and fans enjoy blockchain-backed access control and content rights enforcement, scalable attestation of ownership, smart contracts that enable distributed royalties, and content experiences that can evolve.</p>\n<p>Eluvio&rsquo;s Content Blockchain also provides a breakthrough in carbon-footprint efficiency in managing media, using blockchain technology, and on-chain content ownership. Through a novel compositional and just-in-time protocol, the Eluvio Content Blockchain does not make digital file copies. It significantly reduces network storage and usage requirements compared to traditional streaming and content distribution systems.</p>\n<p>It uses an eco-friendly &ldquo;proof-of-authority&rdquo; consensus, which avoids the high energy consumption used in computational &ldquo;proof-of-work&rdquo; blockchains.&nbsp;</p>\nAbout Warner Bros. Home Entertainment\n<p>Warner Bros. Home Entertainment (WBHE) distributes award-winning movies, television, animation, and digital content produced by Warner Bros. Discovery to the homes and screens of millions through physical Blu-ray Disc&trade; and DVD retail sales and digital transactions on major streaming sites, video-on-demand cable, satellite, digital, and mobile channels.&nbsp;&nbsp;</p>\n<p>WBHE is part of Warner Bros. Discovery Content Sales,&nbsp;one of the world&rsquo;s largest distributors of entertainment programming.</p>\nAbout Eluvio, Inc.\n<p>Eluvio&nbsp;(https://eluv.io) is the content blockchain for the creator economy. The Eluvio Content Fabric is a utility blockchain network for owner-controlled storage, distribution, and monetization of large-scale digital content.</p>\n<p>It provides live and file-based content publishing, transcoding, packaging, sequencing, dynamic and static distribution, and derivative NFTs minting for all content experiences.</p>\n<p>Examples of companies and creators whose content blockchain initiatives have been powered by Eluvio include FOX Entertainment, Globo, MGM Studios, Microsoft, SONY Pictures, Telstra, Warner Bros. Home Entertainment, WWE, The Masked Singer,&nbsp;Dolly Parton, Black Eyed Peas,&nbsp;Rita Ora, independent filmmakers, and many others.&nbsp;</p>\n<p>Eluvio is led by Emmy Award-winning technologists&nbsp;Michelle Munson&nbsp;and&nbsp;Serban Simu, founders and inventors of Aspera, a pioneer in digital video transport technology, and a core team of innovators.</p>\n<p>Based in&nbsp;Berkeley, California, Eluvio has received numerous industry awards, including the prestigious Engineering Excellence Award by the Hollywood Professional Association and has been recognized with 11 US patents.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-07T06:47:12.000Z",
    "title": "WOW EARN Launches Its Crypto Wallet on iOS and Google Play",
    "url": "https://cryptodaily.co.uk/2023/06/wow-earn-launches-its-crypto-wallet-on-ios-and-google-play",
    "description": "<p>New York, United State, June 7th, 2023, Chainwire</p><p>WOW EARN has announced a major upgrade to its crypto app and the release of a dedicated mobile wallet. The WOW EARN Wallet was launched on May 29 and is available for download on both the Google Play Store and App Store.</p><p>The WOW EARN platform supports the buying, exchanging, and trading of cryptocurrency. With a strong commitment to security and a diverse range of offerings, WOW EARN provides a seamless and safe environment for crypto enthusiasts.</p><p>Through an intuitive interface and comprehensive asset management tools, users can effortlessly trade digital assets. Driving this ecosystem are WOW tokens, acting as catalysts for the growth of WOW EARN's products and services while strengthening community governance.</p><p>The new WOW EARN Wallet includes an airdrop facility. By simply using the wallet, users receive WOW coins as a reward, eliminating the need for additional equipment or extensive crypto knowledge.</p><p>&ldquo;We are extremely excited to announce the release of the WOW EARN Wallet,\" said WOW EARN spokesperson Yara G. &ldquo;With its cutting-edge features and focus on user safety and security, the WOW EARN Wallet will redefine the way crypto assets are managed. We believe it will enable individuals to take full control of their digital assets and herald a new era for crypto asset security.&rdquo;</p><p>WOW EARN has also introduced a sleek and user-friendly UI with the latest update to its platform. The redesigned interface enhances the overall user experience, making it easier than ever to navigate the platform.</p><p>By referring friends and acquaintances, users can earn additional rewards. This incentivized referral program allows users to boost their earnings while expanding their network within the crypto community.</p><p>About WOW EARN</p><p>WOW EARN is on a mission to reshape the crypto landscape by offering users an accessible, secure, and user-friendly platform for buying, exchanging, and trading digital assets. WOW EARN strives to empower individuals worldwide and foster a thriving community united by a shared interest in crypto.</p><p>For more information, visit: https://WowEarn.com</p>ContactMarketing DirectorYara GeorginaWOW EARNyara.georgina@wowearn.com"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-06-07T07:00:21.000Z",
    "title": "Cboe Receives CFTC Approval to Launch Leveraged Crypto Derivatives",
    "url": "https://news.bitcoin.com/cboe-receives-cftc-approval-to-launch-leveraged-crypto-derivatives/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2142980431-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Cboe Receives CFTC Approval to Launch Leveraged Crypto Derivatives\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2142980431-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2142980431-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2142980431-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2142980431-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2142980431-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2142980431-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/06/shutterstock_2142980431.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Crypto exchange and clearinghouse Cboe Digital will be able to offer margined bitcoin and ether futures contracts with the approval of the U.S. derivatives markets regulator. This will allow its clients to trade cryptocurrency futures with less collateralized capital upfront. Cboe Wins Regulatory Nod for Margin Trades on Crypto Futures Exchange U.S. exchange operator Cboe [&#8230;]"
  },
  {
    "source": "NullTX",
    "date": "2023-06-07T06:51:01.000Z",
    "title": "Tron Price Analysis & Prediction (June 6th) – TRX Rejects $0.083 After a Weekly 7% Surge, Eyes $0.09 Level",
    "url": "https://nulltx.com/tron-price-analysis-prediction-june-6th-trx-rejects-0-083-after-a-weekly-7-surge-eyes-0-09-level/",
    "description": "Tron has been gaining traction for some days, increasing by more than 7% in a week. It broke above a crucial resistance last month and has remained strong since then as bulls now take charge. TRX&#8217;s performance has been so impressive over the past months. Since the price recovered from the March crash, it has [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-07T06:45:26.000Z",
    "title": "CNBC’s Jim Cramer advises exit from crypto, cites high scam potential",
    "url": "https://crypto.news/cnbcs-jim-cramer-advises-exit-from-crypto-cites-high-scam-potential/",
    "description": "Renowned CNBC host Jim Cramer warns investors against the dangers of cryptocurrency, urging immediate withdrawal and hinting at market manipulation risks. On June 6, Jim Cramer, the outspoken host on CNBC, raised alarms about potential market manipulations in the crypto&#8230;"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-07T06:47:28.000Z",
    "title": "WOW EARN Launches Its Crypto Wallet on iOS and Google Play",
    "url": "https://www.crypto-news-flash.com/wow-earn-launches-its-crypto-wallet-on-ios-and-google-play/?utm_source=rss&utm_medium=rss&utm_campaign=wow-earn-launches-its-crypto-wallet-on-ios-and-google-play",
    "description": "<p>New York, United State, June 7th, 2023, Chainwire WOW EARN has announced a major upgrade to its crypto app and the release of a dedicated mobile wallet. The WOW EARN Wallet was launched on May 29 and is available for download on both the Google Play Store and App Store. The WOW EARN platform supports [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/wow-earn-launches-its-crypto-wallet-on-ios-and-google-play/\">WOW EARN Launches Its Crypto Wallet on iOS and Google Play</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-07T07:04:22.000Z",
    "title": "Here’s How Bitcoin Could Witness a Full-On Reversal Toward a New All-Time High, According to Analyst",
    "url": "https://dailyhodl.com/2023/06/07/heres-how-bitcoin-could-witness-a-full-on-reversal-toward-a-new-all-time-high-according-to-analyst/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/How-Bitcoin-Could-Witness-.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/How-Bitcoin-Could-Witness-.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/How-Bitcoin-Could-Witness-.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/How-Bitcoin-Could-Witness-.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/How-Bitcoin-Could-Witness-.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/How-Bitcoin-Could-Witness-.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/How-Bitcoin-Could-Witness-.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A closely followed crypto strategist is outlining how Bitcoin (BTC) can regain its bullish momentum and rally toward a fresh all-time high. Pseudonymous analyst Credible Crypto tells his 340,600 Twitter followers that Bitcoin bulls have successfully defended a critical support level at $25,000 following Monday&#8217;s corrective move. According to Credible Crypto, a move below $25,000 [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/07/heres-how-bitcoin-could-witness-a-full-on-reversal-toward-a-new-all-time-high-according-to-analyst/\">Here’s How Bitcoin Could Witness a Full-On Reversal Toward a New All-Time High, According to Analyst</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]