[
  {
    "source": "Decrypt",
    "date": "2023-08-01T21:22:30.000Z",
    "title": "MicroStrategy Makes Profit, Reports $24 Million Bitcoin Impairment Charge in Q2",
    "url": "https://decrypt.co/150903/microstrategy-profit-impairment-charge-bitcoin-holdings",
    "description": "The company has returned to profitability after a modest rise in the price of Bitcoin."
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-01T21:30:04.000Z",
    "title": "Meta’s AI chatbots could go live by September",
    "url": "https://cryptoslate.com/metas-ai-chatbots-could-go-live-by-september/",
    "description": "<p>Meta is expected to launch a selection of chatbots powered by artificial intelligence (AI) in the near future, the Financial Times said on July 31. The newspaper&#8217;s sources said that Meta is preparing to release those AI-powered chatbots to the public as early as September. The AI chatbots are designed to simulate human-like interactions and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/metas-ai-chatbots-could-go-live-by-september/\">Meta’s AI chatbots could go live by September</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-01T21:30:26.000Z",
    "title": "Tether Attestation Reveals Reserve Increase of $850 Million in Q2, Excess Reserves Reach $3.3 Billion",
    "url": "https://news.bitcoin.com/tether-attestation-reveals-reserve-increase-of-850-million-in-q2-excess-reserves-reach-3-3-billion/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2092364074-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Tether Attestation Reveals Reserve Increase of $850 Million In Q2\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2092364074-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2092364074-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2092364074-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2092364074-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2092364074-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2092364074-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2092364074.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Tether, the company behind the USDT stablecoin, has published an attestation revealing the company&#x2019;s financials during Q2 2023. The document, prepared by BDO, a network of accounting and consulting services, found Tether has increased its reserves by $850 million during this period, with its overall excess reserves reaching $3.3 billion. Tether Attestation Reveals Excess Reserves [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-01T21:30:35.000Z",
    "title": "Binance To Enter Japan With A Bang, Will List More Tokens Than Any Local Exchange",
    "url": "https://www.newsbtc.com/binance/binance-to-enter-japan-with-a-bang/",
    "description": "According to Japanese-based crypto media outlet Coinpost, Binance will launch in Japan fully this month and intends to list 34 tokens on its exchange. This means the platform will offer more tokens than its local competitors in Japan, with major domestic exchanges Bitbank, GMO Coin, and Coincheck listing 30, 36, and 22 tokens, respectively.  The largest crypto exchange by trading volume intends to list its native BNB token, making this the first time it will be available in the country. Some of the other tokens expected to be listed include Axie Infinity (AXS), Solana (SOL), and Avalanche (AVAX). A Remarkable Re-entry News of the re-entry into Japan was announced by the CEO of Binance via a Twitter video. According to him, the platform has been making efforts to re-enter the Japanese market for a while now. He was effusive with his praises and noted that since 2017, Japan had established crypto exchange regulations, including the recent stablecoin regulations enacted in June. He also stated it was “fantastic to see Japan being a leader in the Web3 regulatory environment.” Related Reading: USDT Issuer Tether Reports A 30% Decline In Profit He further added that Binance was glad to once again partake in the Japanese market after its purchase of the Sakura Exchange BitCoin (SEBC) platform in November last year. Following the acquisition, SEBC changed its name to Binance Japan Inc.  The purchase of the exchange was instrumental in paving the way for the re-entrance of Binance in Japan. Binance will initially offer sport trading services. However, the exchange will not render leveraged trading services since this will require a Type 1 Financial Instruments Business license, with more restrictive standards.  Additionally, cryptocurrency users in Japan will also be offered access to Binance Earn, a specially designed program that enables participants to earn interest on their cryptocurrency deposits. The exchange will also render Japanese crypto traders an opportunity to trade on its NFT marketplace. BNB coin price sitting at $245 following exchange announcement &#124; Source: BNBUSD on Tradingview.com Major Regulatory Win for Binance This recent announcement marks a major regulatory win for Binance. In the recent past, the platform has faced various regulatory challenges and was recently made to drop its license application in Germany.  Related Reading: US Presidential Candidate Defends Bitcoin, Calls Out Environmental Critics In France, the exchange also faces regulatory investigations, with French authorities accusing Binance of being involved in offering illegal digital assets services and failing to curtail money laundering.  Therefore, this latest announcement of a re-entry into the Japanese market heralds a major regulatory win for the embattled exchange. Featured image from CoinDesk, chart from Tradingview.com"
  }
]