[
  {
    "source": "Crypto Daily",
    "date": "2023-06-13T07:04:46.000Z",
    "title": "Highly Anticipated Chancer Crypto Presale Officially Launches Today",
    "url": "https://cryptodaily.co.uk/2023/06/highly-anticipated-chancer-crypto-presale-officially-launches-today",
    "description": "<p>London, United Kingdom, June 13th, 2023, Chainwire</p><p>Chancer, one of the most exciting new Web3 projects of 2023 has officially launched its crypto presale today, 13th June. The project aims to disrupt the betting industry by removing the &lsquo;house&rsquo; from the picture and putting the markets firmly back in the hands of the bettors, allowing users to create their own betting markets, set their own odds, and create their own rules.</p><p>Chancer is the world&rsquo;s first decentralized predictive markets app &mdash; something co-founders and brothers Adam and Paul Kelbie believe will dramatically change how people bet, and ultimately, put the fun back into betting.</p><p>Chancer positions itself as a betting facilitator, not a betting house, allowing users to create peer-to-peer (P2P) bets. These can be small, friendly bets amongst a small group of people, or huge, viral bets such as predicting the Champions League final result or who will win Best Director at the Oscars, in which masses of people can participate. Chancer doesn&rsquo;t limit people to sport betting; bets can be made on any prediction or event, a stark contrast from most bookmakers. Its inherent appeal lies in the fact that users are in complete control of their bets and won&rsquo;t lose to a traditional bookmaker who stacks the odds against them.</p><p>&ldquo;We&rsquo;re confident that we can change the way betting and gambling works,&rdquo; said Adam Kelbie, CEO of Chancer. &ldquo;The next few months are going to be very exciting, and we&rsquo;re thrilled that we can offer a new cryptocurrency in such a competitive market. We&rsquo;re doing something no one else has done, disrupting an industry that has had the odds stacked against consumers since it began. It won&rsquo;t be easy, but we&rsquo;re ready for the fight.&rdquo;</p>How CHANCER works<p>All bets and pay-outs are made in Chancer&rsquo;s native token, &lsquo;CHANCER&rsquo;, which can then be traded with stablecoins like USDT. The online betting and gambling industry is huge, standing at approximately $64 billion (as of 2022), and Chancer aims to take advantage of that and claim a dominant position within the space.</p><p>The CHANCER token will be launched on the BSC Blockchain, and is now available during its presale, which comprises of 12 stages in total. The token is now available at a price of $0.010 during stage one of the presale and will eventually rise to $0.021 by stage 12, an increase of 70% from the initial price in the first tranche of the presale.</p>Revolutionizing the betting industry with future-forward capabilities<p>As outlined in the whitepaper, the project has a well-planned roadmap outlining a variety of product use cases to draw different types of investor interest. Chancer also aims to achieve and maintain true decentralization. To do this, Chancer will have a proof of stake consensus mechanism so that no single party can take control of the network. Quadratic governance will hand decision-making over to the platform&rsquo;s users.</p><p>For full transparency, Chancer&rsquo;s source code will remain open. This also means that anyone is welcome to review, contribute, and propose changes in how the platform works with the assurance that they will be listened to.</p><p>Uniquely, Chancer will be channelled by the real-time communication capability of Google&rsquo;s WebRTC to live stream events to its community.&nbsp;</p><p>Chancer believes in rewarding its users and will therefore offer CHANCER tokens simply for using the platform, as well as providing a Share2Earn scheme, staking, and discounted fees for those who create and participate in the market, making it cost-effective for those who use the platform frequently. Another way to earn a passive income via Chancer is to become a node validator.&nbsp;</p>About Chancer<p>Chancer is set to develop the world&rsquo;s first decentralized social predictive markets platform. This will allow Chancer token holders to create, participate in and profit from their very own predictive markets based on their interests, expertise and social opportunities.</p><p>The project intends to disrupt the global gambling and betting market by &lsquo;removing the house&rsquo; and taking a slice of the market share as it garners attention by challenging the traditional bookmaking and betting business model.&nbsp;</p><p>Website | Whitepaper | Socials</p>ContactCEOAdam KelbieChancerpr@chancer.com"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T06:54:07.000Z",
    "title": "World Blockchain Summit Returns to Singapore: Bringing Together Global Crypto Leaders and Innovators",
    "url": "https://www.cryptopolitan.com/world-blockchain-summit-returns-to-singapore-bringing-together-global-crypto-leaders-and-innovators/",
    "description": "Tuesday, 06 June 2023: Following its highly successful flagship event held in Dubai in March of this year, the World Blockchain Summit is set to return to Singapore. Scheduled for 2,3 August 2023, The World Blockchain Summit Singapore aims to bring together investors, enterprises, industry leaders, and entrepreneurs to explore collaboration and investment opportunities and ... <a title=\"World Blockchain Summit Returns to Singapore: Bringing Together Global Crypto Leaders and Innovators\" class=\"read-more\" href=\"https://www.cryptopolitan.com/world-blockchain-summit-returns-to-singapore-bringing-together-global-crypto-leaders-and-innovators/\" aria-label=\"More on World Blockchain Summit Returns to Singapore: Bringing Together Global Crypto Leaders and Innovators\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-13T06:50:45.000Z",
    "title": "Script Network (SCPT) vs. Shiba Inu (SHIB): Which Will Offer Better Returns?",
    "url": "https://www.cryptopolitan.com/script-network-scpt-vs-shiba-inu-shib-which-will-offer-better-returns/",
    "description": "The success of the crypto industry in the past years can be attributed to many successful projects that have performed well in the market. Crypto investors have benefited the most from these successes, as savvy investors take a closer look into projects, analyze, and select the best tokens to invest in for maximum returns. Two ... <a title=\"Script Network (SCPT) vs. Shiba Inu (SHIB): Which Will Offer Better Returns?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/script-network-scpt-vs-shiba-inu-shib-which-will-offer-better-returns/\" aria-label=\"More on Script Network (SCPT) vs. Shiba Inu (SHIB): Which Will Offer Better Returns?\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-13T07:06:05.000Z",
    "title": "Highly Anticipated Chancer Crypto Presale Officially Launches Today",
    "url": "https://www.crypto-news-flash.com/highly-anticipated-chancer-crypto-presale-officially-launches-today/?utm_source=rss&utm_medium=rss&utm_campaign=highly-anticipated-chancer-crypto-presale-officially-launches-today",
    "description": "London, United Kingdom, June 13th, 2023, Chainwire Chancer, one of the most exciting new Web3 projects of 2023 has officially launched its crypto presale today, 13th June. The project aims to disrupt the betting industry by removing the ‘house’ from the picture and putting the markets firmly back in the hands of the bettors, allowing [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-13T07:04:49.000Z",
    "title": "‘100xs’ Possible for Crypto Now That Doubt Plagues Markets: Investor Who Called Market Bottom",
    "url": "https://dailyhodl.com/2023/06/13/100xs-possible-for-crypto-now-that-doubt-plagues-markets-investor-who-called-market-bottom/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/possible-that-doubt-who.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/possible-that-doubt-who.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/possible-that-doubt-who.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/possible-that-doubt-who.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/possible-that-doubt-who.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/possible-that-doubt-who.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/possible-that-doubt-who.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A venture capitalist who correctly called the 2022 crypto bottom isn&#8217;t fazed by the ongoing turmoil in the digital asset markets. Chris Burniske, a partner at the venture capital firm Placeholder, tells his 261,000 Twitter followers that crypto is at a stage where people are doubting its future existence. According to Burniske, the current sentiment [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/13/100xs-possible-for-crypto-now-that-doubt-plagues-markets-investor-who-called-market-bottom/\">‘100xs’ Possible for Crypto Now That Doubt Plagues Markets: Investor Who Called Market Bottom</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]