[
  {
    "source": "Decrypt",
    "date": "2023-07-24T12:10:50.000Z",
    "title": "Bitcoin Hits Monthly Low Amid Uncertainty Ahead of Fed Meeting",
    "url": "https://decrypt.co/149771/bitcoin-hits-monthly-low-amidst-uncertainty-ahead-fed-meeting",
    "description": "With markets anticipating yet another rate hike this week from the Federal Reserve, Bitcoin fell back below $30,000 "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-24T12:16:14.000Z",
    "title": "Worldcoin token launch sparks response from Vitalik Buterin  ",
    "url": "https://cointelegraph.com/news/worldcoin-token-launch-sparks-response-from-vitalik-buterin",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/fa0c18ec-71ba-401b-8854-88367dedf306.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p> The Ethereum co-founder released a long-form response to the launch of Worldcoin’s decentralized human identity verification system.  </p>\n                    <p><p>Vitalik Buterin, the co-founder of the Ethereum network, released a long-form essay with his thoughts on the recently launched Worldcoin human identity verification system. </p><p>On July 24th, Buterin tweeted his response to Worldcoin which <a href=\"https://cointelegraph.com/news/worldcoin-launches-token-to-distinguish-humans-from-bots\">launched on the same day</a>. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">What do I think about biometric proof of personhood?<a href=\"https://t.co/yozo1buW24\">https://t.co/yozo1buW24</a></p>&mdash; vitalik.eth (@VitalikButerin) <a href=\"https://twitter.com/VitalikButerin/status/1683404462314999814?ref_src=twsrc%5Etfw\">July 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In his <a href=\"https://vitalik.eth.limo/general/2023/07/24/biometric.html\" target=\"_blank\" rel=\"noopener nofollow\">article</a>, along with an explanation of Worldcoin and how it intends to work, Buterin addressed the larger concept in discussion within the release of the Worldcoin token which is proof-of-humanity.” </p><p>Worldcoin, along with other similar identity solutions such as Proof of Humanity, BrightID, Idenam and Circles believe that as artificial intelligence (AI) advances it will become increasingly difficult to distinguish between humans and machines. </p><p>Most of these systems that supply a type of token, such as Worldcoin, also see human utility being endangered by bots and therefore needing a type of universal basic income (UBI). </p><p>Buterin writes that these factors combined beckon the need for digital verification of humans. He argues that this system of proof of personhood is valuable to solving “anti-spam and anti-concentration-of-power problems.”</p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/openai-ceo-sam-altman-testifies-in-historic-senate-hearing-on-ai-safety\"><strong><em>OpenAI CEO Sam Altman testifies in ‘historic’ Senate hearing on AI safety</em></strong></a></p><p>Additionally, the Ethereum co-founder also highlights that systems like Worldcoin, if it continues to decentralize as promised, will avoid “dependence on centralized authorities and reveal the minimal information possible.”</p><blockquote>“If proof of personhood is not solved, decentralized governance… becomes much easier to capture by very wealthy actors, including hostile governments.” </blockquote><p>Buterin also addressed the major concerns looming over such solutions, which he summarized into four main points of privacy, accessibility, centralization within the Worldcoin Foundation and security. </p><p>On June 27th, Worldcoin had a small scare that it immediately clarified after <a href=\"https://cointelegraph.com/news/worldcoin-confirms-it-is-the-cause-of-mysterious-safe-deployments\">thousands of Safe deployments</a> to Optimism caused speculation of an attack. </p><p>Steve Dakh, a developer working on the Ethereum Attestation Service (EAS), which is the network’s own service that creates, verifies and revokes on/off-chain attestations said commented on Buterin’s post saying systems like Worldcoin could be complimentary with EAS. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I think Worldcoin can just be an attester of proof of personhood using a protocol like EAS and other entities can decide whether or not they value those attestations.</p>&mdash; Steve Dakh (@stevedakh) <a href=\"https://twitter.com/stevedakh/status/1683409600442257408?ref_src=twsrc%5Etfw\">July 24, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In conclusion, Buterin said there is currently “no ideal form of proof of personhood” and currently envisions three different approaches to the problem that could potentially become a hybrid of each other. </p><p>He called for community accountability in the process with audits and checks and balances. Although saying he does not envy those whose task it is to design and implement such systems, his point is simple:</p><blockquote>“A world with no proof-of-personhood seems more likely to be a world dominated by centralized identity solutions, money, small closed communities, or some combination of all three.”</blockquote><p>As of July 14, a week prior to the system’s launch, sign-ups for <a href=\"https://cointelegraph.com/news/sam-altman-worldcoin-world-id-two-million-sign-ups\">Worldcoin surpassed 2 million</a> to World ID in less than half the time that it took to reach the first million.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tokenizing-music-royalties-nfts-taylor-swift-3lau-nas-the-weeknd/\"><strong><em>Tokenizing music royalties as NFTs could help the next Taylor Swift</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-24T12:31:53.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC Nears Breakout Below $29K, With Key US Economic Events Looming",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-nears-breakout-below-29k-with-key-us-economic-events-looming/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1940879785-768x432.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"BTC Drops Under $29,000, With Key US Economic Events Looming\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1940879785-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1940879785-1024x576.png 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1940879785-768x432.png 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1940879785-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1940879785-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1940879785-760x428.png 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1940879785.png 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin neared a breakout below the $29,000 level on Monday, as traders prepared for this week&#x2019;s Federal Reserve rate decision. In addition to the Fed meeting, consumer confidence data will also be released from the United States. Ethereum hit a three-week low. Bitcoin Bitcoin (BTC) was on the brink of falling outside of the $29,000 [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T12:24:37.000Z",
    "title": "Curve DAO Price Prediction 2023-2032: Is CRV a Good Investment?",
    "url": "https://www.cryptopolitan.com/curve-dao-price-prediction/",
    "description": "Curve DAO Price Prediction 2023-2032 The cryptocurrency market is rapidly approaching the mainstream, and every project is devising innovative strategies to survive and dominate the marketplace. The cryptocurrency market is developing steadily and gaining momentum, with the overall market capitalization of cryptocurrencies approaching $1.17 trillion per CoinMarketCap. With the official launch of Curve DAO in ... <a title=\"Curve DAO Price Prediction 2023-2032: Is CRV a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/curve-dao-price-prediction/\" aria-label=\"More on Curve DAO Price Prediction 2023-2032: Is CRV a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T12:17:20.000Z",
    "title": "Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?",
    "url": "https://www.cryptopolitan.com/bitcoin-price-forecast/",
    "description": "BTC Price Predictions 2023-2032 The U.S. Securities and Exchange Commission (SEC) has begun reviewing applications from six companies, including BlackRock, to establish spot bitcoin exchange-traded funds. This marks the initial phase in the SEC&#8217;s procedure to determine the approval of the most recent set of proposals. The SEC has also officially recognized applications from Bitwise, ... <a title=\"Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-price-forecast/\" aria-label=\"More on Bitcoin Price Prediction 2023-2032: Will Bitcoin Bulls Rally?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T12:13:14.000Z",
    "title": "China reveals new strategies for economic growth",
    "url": "https://www.cryptopolitan.com/china-new-strategies-for-economic-growth/",
    "description": "In the face of emerging economic challenges, China has outlined a series of strategic initiatives aimed at invigorating its economic landscape. The series of measures, which target distinct sectors and promise a more appealing climate for private and foreign investors, are being implemented ahead of an imminent Politburo meeting assessing China&#8217;s economic performance in the ... <a title=\"China reveals new strategies for economic growth\" class=\"read-more\" href=\"https://www.cryptopolitan.com/china-new-strategies-for-economic-growth/\" aria-label=\"More on China reveals new strategies for economic growth\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-24T12:30:48.000Z",
    "title": "Litecoin Halving: An Opportunity For Growth Or A Setup For A Sell-Off?",
    "url": "https://www.newsbtc.com/news/litecoin/litecoin-halving-opportunity-for-growth-or-sell-off/",
    "description": "As the crypto market gears up for one of its major network events, the Litecoin (LTC) halving, investors and analysts are peering into the crystal ball of market trends to try to predict the outcome. Slated for early August, the halving has attracted considerable attention from the cryptocurrency community. However, predictions surrounding the event are veering off the usual path of price appreciation to include a potential coordinated sell-off. Particularly, Renowned on-chain analyst, Ali Charts, has introduced a novel perspective to the halving discourse, with his theory that the much-anticipated event could turn out to be a &#8220;Sell the News&#8221; event.  #Litecoin &#124; Each time the number of new $LTC addresses surpassed 350,000 in the last five years, a significant price correction followed. More than 690,000 #LTC addresses were recently created, suggesting the upcoming #halving could be a &#8220;sell the news&#8221; event. pic.twitter.com/FBsokPgaYA — Ali (@ali_charts) July 23, 2023 Unusual Network Activity Sparks Sell-Off Theories According to Ali, the idea of a &#8220;Sell the News&#8221; event stems from an observed increase in new Litecoin addresses created on the network. In recent times, over 690,000 new LTC addresses have emerged. This surge is significant because historically, a price correction tends to occur whenever the count of new Litecoin addresses crosses the 350,000 mark, as noted by Ali Charts. This pattern suggests that the current build-up of addresses may precipitate a price drop following the halving, possibly due to a coordinated sell-off. Related Reading: Litecoin Whales Purchase $59 Million Worth of LTC As Halving Event Approaches However, it&#8217;s essential to note that the crypto market, much like any other financial market, is driven by a variety of factors, making it nearly impossible to predict events with absolute certainty. A number of other potential outcomes, spurred by different market dynamics, could equally play out. Potential For Litecoin Price Growth Amid Deflation On the flip side, Litecoin&#8217;s forthcoming halving also presents the possibility of substantial price growth. This belief stems from the deflationary effect that halving will bring about, reducing the rate at which new Litecoins are created. Coupled with increasing demand for the coin, this could create an ideal scenario for price growth in the mid to long term. The nature of the halving&#8217;s potential impact has set the stage for an interesting dichotomy: a probable sell-off or massive accumulation. As users and investors gauge the possible impacts of the halving, it&#8217;s likely they will adjust their strategies accordingly, which could sway the outcome in either direction. Furthermore, the aftermath of the Litecoin halving event should provide valuable insights for the cryptocurrency community, particularly as investors prepare for the subsequent Bitcoin halving, slated for April next year. Related Reading: Litecoin Whales Deposit Big To Exchanges, Bearish Sign? Meanwhile, Litecoin has mirrored the price action of the rest of the crypto market over the past week. Notably, the altcoin currently swims in red, down by 1.3% in the past week and nearly 4% over the past 24 hours. Litecoin currently trades at a price of $89.5, at the time of writing. Featured image from iStock, Chart from TradingView"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-24T12:22:54.000Z",
    "title": "Charles Hoskinson Unveils Exciting Rollups Implementation Update for Cardano Network – Will This Drive ADA to New ATH",
    "url": "https://www.crypto-news-flash.com/charles-hoskinson-unveils-exciting-rollups-implementation-update-for-cardano-network-will-this-drive-ada-to-new-ath/?utm_source=rss&utm_medium=rss&utm_campaign=charles-hoskinson-unveils-exciting-rollups-implementation-update-for-cardano-network-will-this-drive-ada-to-new-ath",
    "description": "<img width=\"1000\" height=\"600\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/05/cardano-full-deployment-of-goguen-in-q2-provided-testing-is-successful.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Cardano\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2021/05/cardano-full-deployment-of-goguen-in-q2-provided-testing-is-successful.jpg 1000w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/cardano-full-deployment-of-goguen-in-q2-provided-testing-is-successful-300x180.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/cardano-full-deployment-of-goguen-in-q2-provided-testing-is-successful-768x461.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/cardano-full-deployment-of-goguen-in-q2-provided-testing-is-successful-24x14.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/cardano-full-deployment-of-goguen-in-q2-provided-testing-is-successful-36x22.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2021/05/cardano-full-deployment-of-goguen-in-q2-provided-testing-is-successful-48x29.jpg 48w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" />In a more detailed explanation, Charles Hoskinson revealed that Cardano&#8217;s rollup approach would incorporate the utilization of ZK-rollups. The closing price of Cardano (ADA) stood at $0.3137 for the day, representing a 0.57% decrease in its market capitalization. In a fascinating development, Charles Hoskinson, the CEO, and creator of Cardano, delves into the network&#8217;s latest [...]"
  }
]