[
  {
    "source": "CryptoSlate",
    "date": "2023-06-12T14:13:26.000Z",
    "title": "Tether treasury sends Binance $750M USDT in chain swap transaction",
    "url": "https://cryptoslate.com/tether-treasury-sends-binance-750m-usdt-in-chain-swap-transaction/",
    "description": "<p>Tether&#8217;s treasury sent Binance $750 million USDT on June 12, per data from blockchain analytical firm Arkham Intelligence. The transactions were sent in three batches of $250 million after a $10 test transaction. Earlier today, the exchange informed users that it would directly swap 750M USDT-TRX for USDT-ETH with Tether to ensure stablecoin liquidity across [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/tether-treasury-sends-binance-750m-usdt-in-chain-swap-transaction/\">Tether treasury sends Binance $750M USDT in chain swap transaction</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-12T14:15:28.000Z",
    "title": "Tether makes waves in crypto market with 1 billion USDT token issuance on Ethereum",
    "url": "https://www.cryptopolitan.com/tether-makes-waves-in-crypto-market-with-1-billion-usdt-token-issuance-on-ethereum/",
    "description": "Tether, the leading issuer of stablecoins worldwide, has once again made waves in the cryptocurrency market. In a surprising move, Tether has issued an additional 1 billion USDT tokens on the Ethereum blockchain, as reported by the vigilant Whale Alert monitoring system. This strategic decision by Tether is part of their ongoing efforts to bolster ... <a title=\"Tether makes waves in crypto market with 1 billion USDT token issuance on Ethereum\" class=\"read-more\" href=\"https://www.cryptopolitan.com/tether-makes-waves-in-crypto-market-with-1-billion-usdt-token-issuance-on-ethereum/\" aria-label=\"More on Tether makes waves in crypto market with 1 billion USDT token issuance on Ethereum\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-12T14:30:52.000Z",
    "title": "Cardano Price Falls Below Key Support Levels, Will It Continue To Fall?",
    "url": "https://www.newsbtc.com/news/cardano/cardano-price-falls-below-key-support-levels-will-it-continue-to-fall/",
    "description": "Cardano’s native token, ADA, has been significantly affected by the recent downturn in the cryptocurrency market, experiencing a notable decline in price. Despite a recent surge of over 6% in the last 24 hours, the bearish sentiment continues to exert its influence. Over the past week, Cardano has encountered a loss of approximately 26% in value, resulting in the breaking of crucial support levels that have now transformed into resistance levels. Related Reading: Shiba Inu Traders Anxiously Await Shibarium Launch Date Amidst Uncertainty From a technical outlook, Cardano indicates a prevailing bearish trend, with both demand and accumulation levels remaining relatively low. It becomes crucial for the coin to overcome the overhead resistance in order to mitigate the growing strength of bearish forces and facilitate a potential recovery. Presently, the coin is oversold, prompting the emergence of buyers aiming to surpass the resistance barriers. Furthermore, the decline in Bitcoin&#8217;s value in recent days, as it revisited the $26,000 level, has had a negative impact on various altcoins, including Cardano. Consequently, the market capitalization of Cardano has declined, indicating diminished buying strength in the market. Cardano Price Analysis: One-Day Chart ADA was trading at $0.28, at the time of writing. Following its rejection at the $0.34 level, the bears have taken control of the price trajectory. Presently, ADA has revisited a multi-month low price level. This signified a bearish trend and the crucial resistance level for the altcoin is observed at $0.30. Should ADA face rejection at this level, there is a possibility of the price descending further below its current level. In the event of further depreciation, the coin may find support initially at $0.25 and potentially even lower. The trading volume for Cardano in the last session was relatively low, suggesting that sellers currently hold an advantage in the market. Technical Analysis Following the rejection at $0.34, Cardano (ADA) has struggled to regain positive momentum and attract demand. The Relative Strength Index (RSI) has dipped below the half-line and even further below the 30-mark, indicating that the coin is significantly undervalued and oversold. Furthermore, the price of ADA has dropped below the 20-Simple Moving Average (SMA) line, suggesting that selling pressure is currently driving the price momentum. In order to revive demand in the market, ADA needs to overcome the resistance level of $0.30. Breaching this crucial barrier could potentially ignite a recovery and attract buyers back into the market. Due to the low demand for ADA, sell signals have emerged, suggesting a potential continuation of the downtrend. The Moving Average Convergence Divergence (MACD), which indicates price momentum and potential reversals, has formed red signal bars, aligning with sell signals for ADA. Related Reading: Bitcoin Bearish Signal: Miners Sell At 3rd Largest Scale Ever Additionally, the Bollinger Bands, which reflect price volatility and fluctuations, have significantly diverged. This indicates that there may be increased price volatility and fluctuation in the upcoming trading sessions. Featured Image From UnSplash, Charts From TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-12T14:30:30.000Z",
    "title": "Set to Surpass SHIBA Inu by More Than 10,000%: Analysts Predict New Token’s Meteoric Rise",
    "url": "https://www.crypto-news-flash.com/set-to-surpass-shiba-inu-by-more-than-10000-analysts-predict-new-tokens-meteoric-rise/?utm_source=rss&utm_medium=rss&utm_campaign=set-to-surpass-shiba-inu-by-more-than-10000-analysts-predict-new-tokens-meteoric-rise",
    "description": "In the ever-changing world of cryptocurrency, staying updated on every project can be overwhelming. However, having the right information at the right time can lead to big gains. Twitter and articles like this provide a great platform to stay informed.  Lately, investors on Twitter have been talking about a new gaming meme token called Pikamoon, [...]"
  },
  {
    "source": "Coin Edition",
    "date": "2023-06-12T14:22:00.000Z",
    "title": "Analyst Urges Altcoin Investors to Switch to BTC Amid Bearish Trend",
    "url": "https://coinedition.com/analyst-urges-altcoin-investors-to-switch-to-btc-amid-bearish-trend/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2023/06/Expert_Warns_Altcoiners_Time_to_Consider_BTC_Amid_Bearish_Trend-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2023/06/Expert_Warns_Altcoiners_Time_to_Consider_BTC_Amid_Bearish_Trend-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/06/Expert_Warns_Altcoiners_Time_to_Consider_BTC_Amid_Bearish_Trend-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/06/Expert_Warns_Altcoiners_Time_to_Consider_BTC_Amid_Bearish_Trend.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>The altcoin market has been in a bearish trend, with prominent coins like Binance Coin (BNB), Cardano (ADA), Solana (SOL), and Polygon (MATIC) incurring double-digit losses over the past week. In a recent analysis of market trends, the crypto expert behind the Crypto Banter YouTube channel argued that hopping on the Bitcoin (BTC) bus may [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/analyst-urges-altcoin-investors-to-switch-to-btc-amid-bearish-trend/\">Analyst Urges Altcoin Investors to Switch to BTC Amid Bearish Trend</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-12T14:30:41.000Z",
    "title": "Pro-XRP Lawyer Says SEC Will Crush Crypto Until Big Banks Can Control Majority of Market",
    "url": "https://dailyhodl.com/2023/06/12/pro-xrp-lawyer-says-sec-will-crush-crypto-until-big-banks-can-control-majority-of-market/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/09/Still-Not-in-Crypto.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/09/Still-Not-in-Crypto.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/09/Still-Not-in-Crypto.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/09/Still-Not-in-Crypto.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/09/Still-Not-in-Crypto.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/09/Still-Not-in-Crypto.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/09/Still-Not-in-Crypto.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Pro-XRP lawyer John Deaton says that the big banks will attempt to swoop in and acquire vast pieces of the crypto market after the U.S. Securities and Exchange Commission (SEC) hammers it down. Deaton, who represented XRP holders in Ripple&#8217;s lawsuit with the SEC, says that once banking giants like JPMorgan and Goldman Sachs get [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/12/pro-xrp-lawyer-says-sec-will-crush-crypto-until-big-banks-can-control-majority-of-market/\">Pro-XRP Lawyer Says SEC Will Crush Crypto Until Big Banks Can Control Majority of Market</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]