[
  {
    "source": "CoinDesk",
    "date": "2023-07-26T17:32:20.000Z",
    "title": "Twitter Is Dead. Long Live Crypto Twitter?",
    "url": "https://www.coindesk.com/consensus-magazine/2023/07/26/twitter-is-dead-long-live-crypto-twitter/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Elon Musk's rebranded X.com used to be the white-hot center of the crypto world. What comes next?"
  },
  {
    "source": "Decrypt",
    "date": "2023-07-26T17:18:12.000Z",
    "title": "What Is Tokenization?",
    "url": "https://decrypt.co/resources/what-is-tokenization",
    "description": "We explore what tokenization is, how it works, and how it's revolutionizing the way assets can be issued, managed, and traded."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-26T17:01:20.000Z",
    "title": "'Star Atlas' CEO After Massive Layoffs: 'Nothing About Our Vision Has Changed'",
    "url": "https://decrypt.co/150077/star-atlas-ceo-after-massive-layoffs-nothing-about-our-vision-changed",
    "description": "After laying off 73% of its team, Star Atlas developer ATMTA says it remains focused on building out the Solana-based NFT space game."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-26T17:00:15.000Z",
    "title": "Coinbase Is the Real Winner in the Bitcoin ETF Race—Here’s Why",
    "url": "https://decrypt.co/149608/coinbase-winner-bitcoin-etf-race",
    "description": "Coinbase has been tapped by BlackRock and others to help launch a Bitcoin ETF, and its stock price has felt the bump. But the company still faces significant risks. "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-26T18:02:46.000Z",
    "title": "Chinese, Indian investment professionals show strong support for CBDC in new survey",
    "url": "https://cointelegraph.com/news/chinese-indian-investment-professionals-show-strong-support-cbdc-cfa-institute-survey",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/927ff704-cc7f-4de6-9b27-a3f49cff24c0.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The CFA Institute asked members around the world how they felt about CBDCs. Their responses might surprise the crypto community.</p>\n                    <p><p>The CFA Institute, the professional association that provides Certified Financial Analyst credentialing, surveyed its members on their perceptions of central bank digital currency (CBDC), saying it wanted to examine the demand-side outlook on the financial technology. </p><p>The survey found a wide spread of opinions that depended on the location and even age of the respondents. The response was generally unenthusiastic. Although 47% of respondents said they had a moderate understanding of CBDCs and 42% said they believed that central banks should launch digital versions of fiat currencies (with 24% having no opinion), there was wide divergence between those in developed and emerging markets. </p><p>Investment professionals in the United States showed the least support for a CBDC launch, at 31%, compared to 37% in favor in developed markets overall. In emerging markets, support averaged 61%, with support reaching 66% in India and 70% in China. Bankers showed more support (50% at commercial banks, 51% at investment banks) than asset managers (38%).</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/bda928dc-f92a-4574-9b5e-80cfdb28c8f3.png\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Support for CBDC by geography. Source: CFA Institute</em></figcaption></figure><p>The most common reason for supporting CBDCs was accelerated payments and transfers (58%). That was followed by the somewhat cryptic proposition that “Central authorities should play a central role in the development of cryptocurrencies” (30%).</p><p>Privacy was the most common objection (50%). That was followed by lack of use case (40%). Only 10% of respondents thought a CBDC would be harmful to banks. Forty-six percent of respondents overall thought a CBDC would have little or no impact on financial inclusion. However, the regional variation in responses was pronounced here, as a clear majority in China (66%) and India (64%) thought a CBDC would improve inclusion, with U.S. respondents coming in lowest at 24%. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/existential-threat-why-some-banks-are-anxious-about-cbdcs\">Existential threat? Why some banks are anxious about CBDCs</a></em></strong></p><p>Willingness to use a CBDC showed similar distributions. Bankers and those under the age of 45 showed the greatest willingness to use one.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">A global survey of our members shows support for <a href=\"https://twitter.com/hashtag/CBDCs?src=hash&amp;ref_src=twsrc%5Etfw\">#CBDCs</a> is limited. Only a small percentage of respondents have a strong understanding of CBDCs &amp; a split in attitudes between emerging &amp; developed economies, there is no guarantee of public acceptance  <a href=\"https://t.co/SD3x0kKqPY\">https://t.co/SD3x0kKqPY</a> <a href=\"https://t.co/O4oWmcUp2w\">pic.twitter.com/O4oWmcUp2w</a></p>&mdash; Margaret Franklin, CFA, CEO at CFA Institute (@CFAInstituteCEO) <a href=\"https://twitter.com/CFAInstituteCEO/status/1684238338386022400?ref_src=twsrc%5Etfw\">July 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The survey received more responses by far from the United States than any other country. The institute sent of over 94,000 surveys to its members and recorded a response rate of 5%. Eighty-five percent of respondents were male.</p><p>CBDCs <a href=\"https://cointelegraph.com/news/imf-cbdc-gets-feedback-from-crypto-community\">are controversial in the crypto community</a> and <a href=\"https://cointelegraph.com/news/congressman-warren-davidson-urge-congress-ban-criminalize-cbdc\">politically divisive in the United States</a>. The responses of the investment professionals reflect a distinctly different outlook on the issue.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/cbdcs-kryptonite-for-crypto/\">Are CBDCs kryptonite for crypto?</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-26T16:54:34.000Z",
    "title": "Canada proposes new capital rules for crypto holdings",
    "url": "https://cointelegraph.com/news/canada-osfi-proposes-new-capital-rules-crypto-holdings",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/b72d4252-bfda-4e39-816d-96bd39a570af.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The Office of the Superintendent of Financial Institutions is opening public consultations on two draft guidelines, updating its capital and liquidity approach to crypto assets. </p>\n                    <p><p>Canada’s financial watchdog is <a href=\"https://www.osfi-bsif.gc.ca/eng/osfi-bsif/med/Pages/crypto-bnk-ins-nr.aspx#\" target=\"_blank\" rel=\"noopener nofollow\">proposing</a> changes to its capital and liquidity approach to crypto assets, according to an announcement on July 26. According to the Office of the Superintendent of Financial Institutions (OSFI), the proposed rules will simplify institutions’ approach to perceived crypto risks, defining four categories of crypto assets and their capital treatment.</p><p>OSFI is opening public consultations on two draft guidelines until Sept. 20. One of the guidelines affects federally regulated deposit-taking institutions, such as banks and credit unions, while another addresses the regulatory capital treatment of crypto-asset exposure for insurers. </p><p>“Deposit-taking institutions and insurers need clarity on how to treat crypto-asset exposures when it comes to capital and liquidity. We look forward to giving them this clarity through these new guidelines that reflect industry input and international standards,” said OSFI Superintendent Peter Routledge. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">In line with <a href=\"https://twitter.com/BIS_org?ref_src=twsrc%5Etfw\">@BIS_org</a>’s new banking standards for <a href=\"https://twitter.com/hashtag/crypto?src=hash&amp;ref_src=twsrc%5Etfw\">#crypto</a>-asset exposures, we’ve drafted guidance tailored for Canada.  <br><br>Share your feedback on proposed changes to our capital and liquidity approach to <a href=\"https://twitter.com/hashtag/cryptoassets?src=hash&amp;ref_src=twsrc%5Etfw\">#cryptoassets</a>. <a href=\"https://t.co/M45FFFbUtZ\">https://t.co/M45FFFbUtZ</a> <a href=\"https://t.co/xbrgsk0XKO\">pic.twitter.com/xbrgsk0XKO</a></p>&mdash; Superintendent of Financial Institutions (@OSFICanada) <a href=\"https://twitter.com/OSFICanada/status/1684204275050708996?ref_src=twsrc%5Etfw\">July 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The new rules seek to reflect an “evolving risk environment,” notes the regulator. The rules also address changes <a href=\"https://www.bis.org/bcbs/publ/d545.htm\" target=\"_blank\" rel=\"noopener nofollow\">introduced</a> by the Basel Committee in December 2022 outlining new banking standards for crypto-asset exposure, with implementation set for Jan. 1, 2025. The Basel Committee’s new standards include rules related to tokenized traditional assets, stablecoins and unbacked crypto assets. </p><p>The OSFI says its drafts incorporate the new international banking standards, while the insurance guidelines are adjusted to meet the specific needs of the local insurance industry.</p><p>The new guidelines will also <a href=\"https://www.osfi-bsif.gc.ca/Eng/fi-if/rg-ro/gdn-ort/adv-prv/Pages/crypto22.aspx\" target=\"_blank\" rel=\"noopener nofollow\">replace</a> an existing advisory published in August 2022 that defined and categorized crypto-asset exposure and its potential risks for financial institutions.</p><p>Canada’s evolving regulatory landscape comes amid growing concerns about the ramifications of digital assets on banking systems worldwide. In the United States, crypto-friendly banks such as Silvergate and Signature Bank shut down operations amid liquidity issues stemming from crypto-related events in 2022. </p><p><a href=\"https://cointelegraph.com/magazine/best-worst-countries-crypto-taxes-crypto-tax-tips/\"><strong><em>Magazine:</em></strong><strong> </strong><strong><em>Best and worst countries for crypto taxes — Plus crypto tax tips</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-26T16:31:06.000Z",
    "title": "US lawmakers invoke FTX and spar on direction of crypto bills",
    "url": "https://cointelegraph.com/news/us-lawmakers-invoke-ftx-spar-direction-crypto-bills",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/50074fc9-1322-4291-a1de-3b4ca79fb5e4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>On July 26, six pieces of legislation were being considered by the House Financial Services Committee, including ones on regulatory clarity and consumer protection in the space.</p>\n                    <p><p>Members of the United States House Financial Services Committee seem to be divided on the best legislative path forward dealing with regulatory clarity for crypto and blockchain technology.</p><p>In a July 26 markup hearing, the committee <a href=\"https://financialservices.house.gov/calendar/eventsingle.aspx?EventID=408922\" target=\"_blank\" rel=\"noopener nofollow\">had</a> several bills on its agenda, including the Financial Innovation and Technology for the 21st Century Act, Blockchain Regulatory Certainty Act, and Financial Technology Protection Act of 2023 — all directly related to addressing the regulation of cryptocurrencies. Many lawmakers supported the first bill, claiming it would help address another failure like the collapse of the FTX exchange, while others criticized the measure as favoring crypto firms over consumers.</p><p>Committee chair Patrick McHenry said the Financial Innovation and Technology for the 21st Century Act would help clarify the authority the Securities and Exchange Commission and Commodity Futures Trading Commission had over payment stablecoins. However, ranking member Maxine Waters and others claimed the bill would still allow for the commingling of customer funds — as allegedly happened between FTX and Alameda Research — and required the development of an “entirely new regulatory structure” rather than relying on existing securities laws.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Key changes include:<br><br>✅ Revisions to pre-registration oversight of intermediaries<br>✅ Fine-tuned registration requirements<br>✅ Clarifies SEC & CFTC authority for payment stablecoins<br>✅ Increased CFTC funding</p>— Financial Services GOP (@FinancialCmte) <a href=\"https://twitter.com/FinancialCmte/status/1683876999406792715?ref_src=twsrc%5Etfw\">July 25, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The debate concerning the bill was not entirely split along party lines. Democratic Representative Jim Himes acknowledged that the legislation could have prevented the collapse of FTX, but also expressed ignorance about certain aspects of the crypto space, including the recent ruling in the <a href=\"https://cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ripple-wins-case-against-sec-as-judge-rules-xrp-is-not-a-security/amp\">SEC v. Ripple lawsuit</a> on XRP (<a href=\"https://cointelegraph.com/xrp-price-index\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/xrp-price-index\">XRP</a>) as a security. Massachusetts Representative Stephen Lynch referred to the bill as the “worst piece of legislation that has been presented for markup” in his roughly 20 years in government.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/digital-assets-bill-introduced-house-republican-committees\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/digital-assets-bill-introduced-house-republican-committees/amp\"><strong><em>US House Republican committee members introduce joint digital assets bill</em></strong></a></p><p>House Republicans said the bill would offer $120 million in funding to the CFTC to build up its resources addressing regulation of the crypto space, but some Democrats objected to how the funds would be <a href=\"https://cointelegraph.com/news/ripple-ruling-crypto-etfs-drove-urgency-lawmakers-coinbase-ceo\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/ripple-ruling-crypto-etfs-drove-urgency-lawmakers-coinbase-ceo/amp\">redirected from the SEC</a>, potentially limiting its capacity for enforcement. At the time of publication, lawmakers continued to debate the bills and proposed amendments, with a vote expected on July 26.</p><p>The bills are just a few of several <a href=\"https://cointelegraph.com/news/crypto-bills-could-change-us-landscape-explained\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-bills-could-change-us-landscape-explained/amp\">proposed pieces of legislation</a> aimed at addressing what many have called a regulatory gap in dealing with digital assets. The SEC has filed lawsuits against Coinbase, Binance and others in addition to enforcement cases against executives at FTX and Celsius.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation: Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template>\n</p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-26T17:45:38.000Z",
    "title": "Wall Street remains bullish on blockchain despite hurdles to mainstream adoption: CNBC",
    "url": "https://cryptoslate.com/wall-street-remains-bullish-on-blockchain-despite-hurdles-to-mainstream-adoption-cnbc/",
    "description": "<p>A new CNBC feature on July 26 highlighted that Wall Street&#8217;s view on blockchain technology remains bullish as the pressure from market dynamics and the need for innovation push the American financial system to explore blockchain technology for future growth. .According to Tanaya Macheel of CNBC, Wall Street views blockchain as a solution to inefficiencies [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/wall-street-remains-bullish-on-blockchain-despite-hurdles-to-mainstream-adoption-cnbc/\">Wall Street remains bullish on blockchain despite hurdles to mainstream adoption: CNBC</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-26T17:11:09.000Z",
    "title": "$DOGE: Crypto Analyst Ali Martinez Takes a Closer Look at Latest Dogecoin Price Action",
    "url": "https://www.cryptoglobe.com/latest/2023/07/doge-crypto-analyst-ali-martinez-takes-a-closer-look-at-latest-dogecoin-price-action/",
    "description": "In the midst of Dogecoin’s impressive surge over the past week, prominent crypto analyst Ali Martinez has shed light on some pivotal market trends. While Bitcoin and other heavyweight altcoins are experiencing a downturn, this canine-themed digital asset is barking up the right tree with a double-digit gain over the past week. Before we dive […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-26T16:23:00.000Z",
    "title": "Dogecoin ($DOGE) Overtakes Cardano ($ADA) as Seventh-Largest Crypto Price Surge",
    "url": "https://www.cryptoglobe.com/latest/2023/07/dogecoin-doge-overtakes-cardano-ada-as-seventh-largest-crypto-price-surge/",
    "description": "The meme-inspired cryptocurrency Dogecoin ($DOGE) has seen its value surge over 14% over the last few days, to the point it has surpassed smart contract platform Cardano ($ADA) as the seventh-largest cryptocurrency by market capitalization, with DOGE’s surge leading to millions in liquidations over a 24-hour period. According to available market data, over the past […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-07-26T17:00:00.000Z",
    "title": "South Korea Establishes a Unit to Combat Crypto Crimes",
    "url": "https://cryptodaily.co.uk/2023/07/south-korea-establishes-a-unit-to-combat-crypto-crimes",
    "description": "<p>Amidst rising illicit crypto-related activities in South Korea, the authorities have launched an interagency investigation team that can help manage crypto regulation in the country.&nbsp;</p>\nCrypto Crimes in South Korea Are on the Rise\n<p>In a report of July 26, South Korea announced the launch of a multi-agency investigation unit as part of the effort to handle crimes related to digital assets in the country.</p>\n<p>The Joint Investigation Center for Crypto Crimes will begin operations at the Seoul Southern District Prosecutors Office, equipped with 30 investigators from seven government agencies and bodies, including the prosecution, the Financial Supervisory Service, the National Tax Service, and the Korea Customs Service.</p>\n<p>The establishment of the investigation team has to do with a huge spike of crypto related-crimes in South Korea. According to the recent reports, the financial damages of illegal crypto activities grew by 118% in the last five years and summed up to about 5.3 trillion won (~ 4 billion USD). The crimes included illegal cross-border transactions, price manipulations, and ponzi schemes.&nbsp;</p>\n<p>Moreover, the Prosecutors' Office highlighted that the number of suspicious transactions across local digital currency exchanges surged by 1,263% only in the past 18 months (66 in 2021, 900 in 2022, and 943 in the first half of 2023).</p>\n<p>The new investigation unit is expected to focus primarily on highly volatile digital assets as well as the cryptos that are being delisted due to illegal trading practices, tax evasions, unauthorized foreign exchange transfers, concealment of criminal profits, and money laundering.</p>\n\n<p>The Prosecutor's Office commented on the launch: &ldquo;Virtual assets, which are traded over 3 trillion won (~$2.35 million) every day, with more than 6 million participants, are already investment products comparable to stocks, but the laws and systems are not complete, so market participants are practically left out from the protection of the law.&rdquo;&nbsp;</p>\n\nCrypto Regulation in South Korea&nbsp;\n<p>The launch of the interagency probe team is just one of the steps South Korea has taken towards strengthening crypto regulation in the country. The news comes shortly after the National Assembly passed pioneering legislation aimed at safeguarding crypto investors that is set to take effect in July of next year.&nbsp;</p>\n<p>Earlier this month, South Korea's Financial Services Commission (FSC) announced it would mandate all companies that own or issue digital assets to disclose their holdings in financial statements from 2024. Besides, the South Korean Prime Minister, Han Deok-soo, also asked high-ranking public officials to disclose their crypto holdings back in May of this year.&nbsp;</p>\n<p>Last year, the South-Korean crypto market experienced a 66% reduction in market capitalization due to various domestic and global events. One of the incidents that must have had a major influence on the South-Korean crypto industry was the crash of Terra Luna in 2022.</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-26T18:00:57.000Z",
    "title": "Binance Introduces FDUSD Listing Amid Stablecoin Market Decline, Faces Initial ‘Technical’ Setback",
    "url": "https://news.bitcoin.com/binance-introduces-fdusd-listing-amid-stablecoin-market-decline-faces-initial-technical-setback/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/fdusd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Binance Introduces FDUSD Listing Amid Stablecoin Market Decline, Faces Initial ‘Technical’ Setback\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/fdusd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/fdusd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/fdusd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/fdusd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/fdusd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/fdusd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/fdusd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />As the stablecoin market economy witnessed a loss exceeding $3 billion within a 40-day span, several fresh stablecoin endeavors are emerging. Binance, the globe&#x2019;s leading exchange by trade volume, unveiled three new trading pairs attached to a stablecoin labeled first digital usd (FDUSD) in a recent blog post. However, the exchange temporarily halted FDUSD listings [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T18:06:09.000Z",
    "title": "CRO Price Prediction 2023-2032: Is Cronos a Good Investment?",
    "url": "https://www.cryptopolitan.com/cro-price-prediction/",
    "description": "CRO Price Prediction 2023-2032 Cronos is the native token for the Crypto.com blockchain. First known as Crypto.com Coin, in February 2022, it was rebranded as Cronos, though it still trades under the same CRO abbreviation. Three months after going live, user adoption has surpassed expectations, with more than 350,000 unique wallet addresses performing transactions on ... <a title=\"CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cro-price-prediction/\" aria-label=\"More on CRO Price Prediction 2023-2032: Is Cronos a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T18:04:00.000Z",
    "title": "Dogecoin Price Prediction 2023-2032: DOGE to the Moon?",
    "url": "https://www.cryptopolitan.com/dogecoin-price-prediction/",
    "description": "Here are top Dogecoin predictions and price trends from the Cryptopolitan team. Review its background and long-term commentary."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T17:35:24.000Z",
    "title": "Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?",
    "url": "https://www.cryptopolitan.com/chainlink-price-prediction/",
    "description": "Chainlink Price Predictions 2023-2032 No one could say if &#8212; and when &#8212; the crypto winter is ending. We can regard some successful strategies as &#8220;green shoots&#8221; to create hope for the crypto industry. ETH witnessed three consecutive weeks of inflows after 11 straight weeks of sell-off, according to a CoinShares report.&#160;Fear not, and let’s ... <a title=\"Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chainlink-price-prediction/\" aria-label=\"More on Chainlink Price Prediction 2023-2032: A Strong Buy Sentiment for LINK?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T17:29:46.000Z",
    "title": "CVC Price Prediction 2023-2032: How high can Civic coin go?",
    "url": "https://www.cryptopolitan.com/cvc-price-prediction/",
    "description": "CVC Price Prediction 2023-2032 Civic is a blockchain platform that helps individuals and business entities manage personal data properly. The Platform utilizes the powerful features of blockchain technology to control and manage personal information within its network to provide efficiency in identity verification processes. The CVC token is a unique token that enables activities within ... <a title=\"CVC Price Prediction 2023-2032: How high can Civic coin go?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/cvc-price-prediction/\" aria-label=\"More on CVC Price Prediction 2023-2032: How high can Civic coin go?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T17:27:22.000Z",
    "title": "The Graph Price Prediction 2023-2032: Is GRT a Good Investment?",
    "url": "https://www.cryptopolitan.com/the-graph-price-prediction/",
    "description": "The Graph Price Prediction 2023-2032 Have you ever heard of Uniswap, Aave, Compound, Balancer, USDC, Synthetix, Sushiswap, MakerDAO, Yearn, Curve, or any popular dApps? They all functionally rely upon The Graph, which is like a combination of decentralized versions of Google, banking, social media, other service providers, and other industries. The Graph price prediction could ... <a title=\"The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-graph-price-prediction/\" aria-label=\"More on The Graph Price Prediction 2023-2032: Is GRT a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T17:19:11.000Z",
    "title": "EOS Price Prediction 2023-2032: Is EOS a good investment?",
    "url": "https://www.cryptopolitan.com/eos-price-prediction/",
    "description": "EOS Price Prediction 2023-2032 EOS, a crypto token formed by the company to promote its decentralized app creation, ranks #47, a little lower on the charts, thanks to its slightly lower market cap of $3,365,472,360. Lately, it has resumed its upward projectile with renewed activities and is viewed by some analysts as a &#8220;ticking time ... <a title=\"EOS Price Prediction 2023-2032: Is EOS a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eos-price-prediction/\" aria-label=\"More on EOS Price Prediction 2023-2032: Is EOS a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T17:15:47.000Z",
    "title": "Alibaba Cloud embraces Meta’s Llama 2 for free AI development",
    "url": "https://www.cryptopolitan.com/alibaba-cloud-embraces-llama-ai-development/",
    "description": "In a significant move, Alibaba Group’s cloud computing arm, Alibaba Cloud, has become the first Chinese company to embrace Meta’s open-source AI model, Llama2. The strategic partnership aims to empower businesses in China with the zero-cost development of AI-powered programs and tools. Meta’s Llama2 model, which was released in July 2023, has already drawn comparisons ... <a title=\"Alibaba Cloud embraces Meta’s Llama 2 for free AI development\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alibaba-cloud-embraces-llama-ai-development/\" aria-label=\"More on Alibaba Cloud embraces Meta’s Llama 2 for free AI development\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T16:58:59.000Z",
    "title": "NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?",
    "url": "https://www.cryptopolitan.com/near-price-prediction/",
    "description": "NEAR Price Prediction 2023-2032 Near Protocol (NEAR) is a blockchain platform with significant attention and partnerships within the cryptocurrency industry. Initially established by a small team in San Francisco, NEAR Protocol has rapidly expanded its influence and formed collaborations with industry giants. As a result, it has witnessed a consistent upward trajectory since its inception. ... <a title=\"NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/near-price-prediction/\" aria-label=\"More on NEAR Price Prediction 2023-2032: Is the NEAR Protocol a Good Investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T16:50:26.000Z",
    "title": "Abu Dhabi regulator grants Rain exchange approval for crypto services",
    "url": "https://www.cryptopolitan.com/abu-dhabi-rain-exchange-for-crypto-service/",
    "description": "The Abu Dhabi Global Market (ADGM) Financial Services Regulatory Authority has recently granted financial services permission to cryptocurrency firm Rain, enabling it to offer brokerage and custody services to residents in the United Arab Emirates (UAE). The regulatory approval marks a significant milestone for Rain, as it allows both institutional and retail users to engage ... <a title=\"Abu Dhabi regulator grants Rain exchange approval for crypto services\" class=\"read-more\" href=\"https://www.cryptopolitan.com/abu-dhabi-rain-exchange-for-crypto-service/\" aria-label=\"More on Abu Dhabi regulator grants Rain exchange approval for crypto services\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-26T16:49:28.000Z",
    "title": "Sui Price Prediction 2023-2032: Is SUI A Good Investment?",
    "url": "https://www.cryptopolitan.com/sui-price-prediction/",
    "description": "Sui Price Prediction 2023-2032 As the cryptocurrency market gains momentum and traders search for potential investment opportunities, Sui (SUI) has emerged as a coin capturing significant attention. SUI operates on a smart contract platform maintained by a permissionless group of validators, contributing to the network&#8217;s security and functionality.&#160; The native token, SUI, serves as a ... <a title=\"Sui Price Prediction 2023-2032: Is SUI A Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/sui-price-prediction/\" aria-label=\"More on Sui Price Prediction 2023-2032: Is SUI A Good Investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-07-26T16:19:21.000Z",
    "title": "Bitcoin Whale Balance Decline: Implications And Causes",
    "url": "https://nulltx.com/bitcoin-whale-balance-decline-implications-and-causes/",
    "description": "The substantial decline of -255k BTC in the aggregate Whale balance since 30 May is a significant event in the world of cryptocurrencies, particularly in Bitcoin. The monthly balance decrease of -148k BTC is unprecedented and raises several important points that warrant further investigation. Potential Impacts Firstly, the actions of Whale entities can have a [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-26T18:08:12.000Z",
    "title": "Global geofencing market to reach $50 billion by 2026",
    "url": "https://crypto.news/global-geofencing-market-to-reach-50-billion-by-2026/",
    "description": "Global geofencing market predicted to reach $50 billion by 2026. This could benefit web3 firms who may better incentivize consumers even more"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-26T18:07:38.000Z",
    "title": "NBA All-Star Jimmy Butler seeks dismissal from Binance lawsuit",
    "url": "https://crypto.news/nba-star-jimmy-butler-binance-class-action-lawsuit/",
    "description": "Jimmy Butler, the Miami Heat all-star, wants to be removed from the Binance's lawsuit saying his tweets didn't endorse the securities in question"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-26T17:49:54.000Z",
    "title": "Binance reevaluates German licensing plans, withdraws application",
    "url": "https://crypto.news/binance-licensing-germany-withdraws-application/",
    "description": "Binance, the world's largest cryptocurrency exchange by client count, has withdrawn its application to BaFin for a crypto license in Germany"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-26T16:48:11.000Z",
    "title": "Venom on-chain activity grows, over 1 million wallets registered",
    "url": "https://crypto.news/venom-on-chain-activity-grows-over-1-million-wallets-registered/",
    "description": "Venom has registered over one million wallets barely three months after testnet launch"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-26T16:47:31.000Z",
    "title": "EOS Foundation suing Block.one for $1 billion commitment breach",
    "url": "https://crypto.news/eos-network-foundation-lawsuit-block-one-1b-breach/",
    "description": "The EOS Network Foundation (ENF) is taking legal action against Block.one (B1), the team responsible who raised $4 billion in a year-long ICO"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-26T16:21:47.000Z",
    "title": "South Korea launches crypto crimes investigation unit",
    "url": "https://crypto.news/south-korea-launches-crypto-crimes-investigation-unit/",
    "description": "South Korea has taken a stand against surging crypto crimes with a specialized investigation team. The team is set to comprise of roughly 30 specialists."
  },
  {
    "source": "BTCManager",
    "date": "2023-07-26T16:20:10.000Z",
    "title": "Uniswap falling, Borroe to rival Bitcoin’s growth",
    "url": "https://crypto.news/uniswap-falling-borroe-to-rival-bitcoins-growth/",
    "description": "Amid falling Uniswap prices, Borroe supporters say the project can transform the crypto landscape, even surpassing Bitcoin's potential"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-26T16:18:13.000Z",
    "title": "Craig Wright must pay $516K to pursue sue against Kraken, Coinbase",
    "url": "https://crypto.news/craig-wright-516k-case-kraken-coinbase/",
    "description": "Craig Wright, who claims to be Satoshi Nakamoto the founder of Bitcoin, must pay $516,000 in legal costs to pursue claims against Coinbase and Kraken"
  },
  {
    "source": "BTCManager",
    "date": "2023-07-26T16:14:20.000Z",
    "title": "Alibaba’s Ant to exclude blockchain services, conduct IPO",
    "url": "https://crypto.news/alibabas-ant-to-exclude-blockchain-services-conduct-ipo/",
    "description": "Ant Group, Alibaba&#8217;s fintech arm, is rumored to exclude blockchain development from its primary financial business in China to pave the way for a Hong Kong IPO. Ant Group Co., a fintech affiliate of the Chinese e-commerce giant Alibaba, is&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-26T18:00:14.000Z",
    "title": "Compound (COMP) Bulls Strengthen Market Control With 13% Rally",
    "url": "https://www.newsbtc.com/analysis/defi-coins/compound-comp-bulls-strengthen-market-control-with-13-rally/",
    "description": "COMP, THE native token of Compound Finance, has seen its market price rise significantly on Wednesday, emerging as the top gainer of the day. According to data from CoinMarketCap, COMP is up by 13.24% in the last 24 hours as the bulls increase their control of the market. Initially, COMP began the week with a bearish trend, declining by 16% to trade at $59.14 on Tuesday. However, after touching this price level, the token began showing signs of recovery moving its market price to $62.34 at the close of Tuesday’s market.  In the early hours of Wednesday, COMP gained over 11%, hitting a price of $69.84, and has since been hovering around that price region. Looking at its broader price movement, COMP has recently been among the most popular tokens, gaining over 90.55% in the last four weeks.  COMP Price Analysis And Prediction According to Compound’s daily chart, its Moving Average Convergence Divergence (MACD) has crossed below its signal line, indicating a bearish trend may soon occur. Based on its current price movement, COMP is currently consolidating around the $69.70 price zone. Related Reading: Compound (COMP) Token Rallies Over 100% After CEO Quits – Details If COMP bulls are able to significantly strengthen their grip on the market, the DeFi coin may break out of this zone, trading as high as $78.67. This indicates a potential 12% on its current market price.  On the other hand, if the bears reassume market control, COMP is expected to retest at $55.72, which marks its imminent major support level. However, with significant selling pressure, COMP could trade as low as $22.97. It is worth stating that traders should watch out for the impending Fed interest rate announcement, which may likely play a role in the token’s short-term price movement.  At the time of writing, Compound is changing hands at $69.41, with a 0.89% gain in the last hour. The token’s daily trading volume is valued at $186.71 million, having gone up by 31.28%. With a market cap of $541.25 million, COMP ranks as the 71st largest cryptocurrency. Compound (COMP) Trading At $69.70 On The Daily Chart &#124; Source: COMPUSD Chart On Tradingview.com Fed Interest Rate Decision Approaches In other news, the crypto space and the general financial markets are anticipating the interest rate decision by the United States Federal Reserve (Fed) on Wednesday.  It is widely expected that the American apex bank will announce a 25 basis points rate hike, bringing the current interest rate to 5.5%. This would mark the 11th rise in the Fed’s interest rate since early 2022.  Related Reading: Upcoming Interest Rate Hikes Could Be The Next Big Challenge For Bitcoin, Here’s Why An increase in interest rates is generally executed to combat inflation. However, interest rate hikes are also known to produce a negative effect on cryptocurrency prices as it reduces spending and investment ability.  Following the last interest rate hike by the Fed in May, Bitcoin dipped by 1%. In April, the market leader significantly declined by 3% after the Fed announced a similar 25 bps rate increase. So another hike will likely lead to a further decline in price. Featured Image From Freepik, Chart From Tradingview."
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-26T17:00:56.000Z",
    "title": "Singaporean Judge Declares Crypto Is Personal Property In ByBit Case",
    "url": "https://www.newsbtc.com/crypto/judge-declares-crypto-is-personal-property/",
    "description": "In a recent development, a judge of the Singapore High Court has declared that cryptocurrencies are personal properties. The court likened crypto to fiat money, and since fiat passes as personal property, crypto should pass as one, too, the court reasoned.  Genesis Of The Case Judge Philip Jeyaretnam made this declaration in a case that had earlier been brought by crypto exchange Bybit against a former employee named Ho Kai Xin. Bybit alleged that Ho had transferred around $4.2 million USDT from the crypto platform’s account to her accounts.  Related Reading: LayerZero Crosses This Significant Milestone, But Is An Airdrop Coming? In what was the most expected outcome, the court ordered Ho to transfer the money back to Bybit. However, what caught the crypto community&#8217;s attention is the status that the Judge placed on cryptocurrencies.  The Judge referred to the USDT tokens in question as a “property.” And despite these tokens not being physical, the judge opined that “We identify what is going on as a particular digital token, somewhat like how we give a name to a river even though the water contained within its banks is constantly changing.” Total market cap jumps to $1.4 following Wednesday recovery &#124; Source: Crypto Total Market Cap on Tradingview.com He was also quick to debunk the notion that crypto doesn’t have any “real” value, as, according to him, value is “a judgment made by an aggregate of human minds.”  Judge Jeyaretnam further classified crypto as personal property when he referred to it as “things in action,” which means any personal property one has the right to sue for recovery. This mostly pertains to money.  The judge also highlighted that he wasn’t referring to USDT as personal property because holders can redeem its physical equivalent. Instead, he believes that this feature isn’t required of a crypto asset for it to be classed as a “thing in action.” Status Of Crypto In Other Jurisdictions  This ruling is, however, not the first time that digital assets are referred to as ‘personal property’. In 2022, a London Court ruled that nonfungible tokens (NFTs) represent “private property.” Related Reading: Fundstrat Predicts Bitcoin Will Reach $180,000 In 2024, But What’s The Catalyst? The UK Law Commission, earlier this year, also recommended that a new category of personal property should be created to accommodate digital assets like cryptocurrencies and NFTs.  Furthermore, a Montana Bill classifying crypto as personal property was also approved by the House of Reps earlier this year in April. Given this, it looks like it will not be long before crypto is finally stamped as personal property in major jurisdictions. Featured image from CNBC, chart from Tradingview.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-26T18:00:57.000Z",
    "title": "USDC market cap drops Filecoin (FIL) and DigiToads are favorite altcoins for institutions",
    "url": "https://www.crypto-news-flash.com/usdc-market-cap-drops-filecoin-fil-and-digitoads-are-favorite-altcoins-for-institutions/?utm_source=rss&utm_medium=rss&utm_campaign=usdc-market-cap-drops-filecoin-fil-and-digitoads-are-favorite-altcoins-for-institutions",
    "description": "<img width=\"512\" height=\"342\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T120032.626.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T120032.626.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T120032.626-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T120032.626-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />There is tremendous diversity in the cryptocurrency scene. Some projects, like USDC, exist to fill gaps in the trading scene by focusing on volatility minimization. Others like DigiToads and Filecoin hinge their projects on utility for users.  Such dynamism means investors constantly scan the landscape to identify high potential tokens. DigiToads (TOADS) is looking to [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-26T17:59:32.000Z",
    "title": "IOTA Integrated Software Partner Acquired by U.S. Technology Global Leader – A Potential Boost for IOTA",
    "url": "https://www.crypto-news-flash.com/iota-integrated-software-partner-acquired-by-u-s-technology-global-leader-a-potential-boost-for-iota/?utm_source=rss&utm_medium=rss&utm_campaign=iota-integrated-software-partner-acquired-by-u-s-technology-global-leader-a-potential-boost-for-iota",
    "description": "<img width=\"2560\" height=\"1707\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-2-scaled.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-2-scaled.jpg 2560w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-2-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-2-1024x683.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-2-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-2-1536x1024.jpg 1536w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-2-2048x1365.jpg 2048w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-2-104x69.jpg 104w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-2-24x16.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-2-36x24.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/Morrowind-IOTA-2-48x32.jpg 48w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />With the US technology firm acquiring IOTA partner Software AG, the IOTA community expressed concerns considering the regulatory landscape. Software AG chief assured that the development won&#8217;t sever the ties between them and IOTA. In the latest development, US technology investor Silver Lake acquired majority shares in IOTA Software partner Software AG. The takeover process [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-26T17:46:36.000Z",
    "title": "Governments Embrace Polygon Blockchain Technology: Driving Transparency, Efficiency, and Economic Growth Worldwide",
    "url": "https://www.crypto-news-flash.com/governments-embrace-polygon-blockchain-technology-driving-transparency-efficiency-and-economic-growth-worldwide/?utm_source=rss&utm_medium=rss&utm_campaign=governments-embrace-polygon-blockchain-technology-driving-transparency-efficiency-and-economic-growth-worldwide",
    "description": "<img width=\"960\" height=\"540\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Polygon\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg.jpg 960w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg-300x169.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/Polygon_logo_resized.jpeg-768x432.jpg 768w\" sizes=\"(max-width: 960px) 100vw, 960px\" />Polygon has seen its technology adopted by numerous countries, demonstrating its superiority. Indian States Leveraging Polygon for Child Welfare, In Medicine, Land Registry, and Police Accountability Ethereum&#8217;s Layer-2 scalability platform Polygon has been in the limelight for quite some time while undertaking big projects under its name. In addition to offering low-cost scalable solutions, the [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-26T17:00:24.000Z",
    "title": "Sam Altman’s Worldcoin surpasses 2 million sign-ups, InQubeta (QUBE) set to Deliver Impressive 50x ROI to its investors",
    "url": "https://www.crypto-news-flash.com/sam-altmans-worldcoin-surpasses-2-million-sign-ups-inqubeta-qube-set-to-deliver-impressive-50x-roi-to-its-investors/?utm_source=rss&utm_medium=rss&utm_campaign=sam-altmans-worldcoin-surpasses-2-million-sign-ups-inqubeta-qube-set-to-deliver-impressive-50x-roi-to-its-investors",
    "description": "<img width=\"512\" height=\"341\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T113014.380.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T113014.380.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T113014.380-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-26T113014.380-104x69.jpg 104w\" sizes=\"(max-width: 512px) 100vw, 512px\" />In the ever-exciting crypto landscape, the currents of innovation flow strong and swift. As global interest in cryptocurrencies continues to rise, all eyes are now fixated on two groundbreaking initiatives that hold immense promise. One is Sam Altman&#8217;s Worldcoin, which is breaking new ground with its exponential growth, captivating the attention of investors worldwide. On [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-26T17:00:12.000Z",
    "title": "Kava (KAVA) Price Prediction: And Uwerx Hold In Green Despite The Bearish Market",
    "url": "https://www.crypto-news-flash.com/kava-kava-price-prediction-and-uwerx-hold-in-green-despite-the-bearish-market/?utm_source=rss&utm_medium=rss&utm_campaign=kava-kava-price-prediction-and-uwerx-hold-in-green-despite-the-bearish-market",
    "description": "<img width=\"1200\" height=\"768\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/11.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/11.jpg 1200w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/11-300x192.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/11-1024x655.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/11-768x492.jpg 768w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" />In the midst of a bearish market, where many cryptocurrencies are experiencing significant price corrections, Kava (KAVA) and Uwerx stand out as impressive exceptions. Uwerx and Kava (KAVA) have managed to hold their ground and thrive amidst market turbulence, and they continue with a relentless upward trajectory. In this article, we will delve into an [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-26T16:25:52.000Z",
    "title": "Senators Propose Bill to Ban President and Congress From Stock Trading – Potential Boost for Crypto Market",
    "url": "https://www.crypto-news-flash.com/senators-propose-bill-to-ban-president-and-congress-from-stock-trading-potential-boost-for-crypto-market/?utm_source=rss&utm_medium=rss&utm_campaign=senators-propose-bill-to-ban-president-and-congress-from-stock-trading-potential-boost-for-crypto-market",
    "description": "<img width=\"1280\" height=\"853\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/stock-trading-g1986d120e_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/stock-trading-g1986d120e_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/stock-trading-g1986d120e_1280-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/stock-trading-g1986d120e_1280-1024x682.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/stock-trading-g1986d120e_1280-768x512.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/stock-trading-g1986d120e_1280-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Two U.S. senators are proposing a bill to ban stock trading for Presidents and Congress from parking in stock trading.  According to the “Ban Stock Trading for Government Officials Act,” failure to comply with the regulations could warrant penalties.  Two Senators are proposing a bill that could exclude certain government officials from participating in stock [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-26T18:05:22.000Z",
    "title": "Top Venture Capital Firm Reveals Its Number One Altcoin Pick for This Bull Cycle, Says Now’s the Time to Get Involved",
    "url": "https://dailyhodl.com/2023/07/26/top-venture-capital-firm-reveals-its-number-one-altcoin-pick-for-this-bull-cycle-says-nows-the-time-to-get-involved/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/01/soana-following-early-days.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/01/soana-following-early-days.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/01/soana-following-early-days.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/01/soana-following-early-days.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/01/soana-following-early-days.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/01/soana-following-early-days.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/01/soana-following-early-days.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A prominent venture capital firm is revealing which altcoin it&#8217;s focusing on during the next bull cycle, saying that the time has come for it to position itself. In a new interview on the Unchained Podcast, Chris Burniske, partner at Placeholder VC, tells host Laura Shin that much like they did with Ethereum (ETH) in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/26/top-venture-capital-firm-reveals-its-number-one-altcoin-pick-for-this-bull-cycle-says-nows-the-time-to-get-involved/\">Top Venture Capital Firm Reveals Its Number One Altcoin Pick for This Bull Cycle, Says Now’s the Time to Get Involved</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-26T16:55:55.000Z",
    "title": "New Law Requiring US Citizens To Report Crypto Payments Worth $10,000 Coming Soon: Coin Center",
    "url": "https://dailyhodl.com/2023/07/26/new-law-requiring-us-citizens-to-report-crypto-payments-worth-10000-coming-soon-coin-center/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/07/new-law-citizens.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/07/new-law-citizens.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/07/new-law-citizens.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/07/new-law-citizens.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/07/new-law-citizens.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/07/new-law-citizens.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/07/new-law-citizens.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A new US law requiring citizens to report crypto payments worth more than $10,000 is primed to take effect in January after a legal challenge to the requirement was swatted down in court last week. The legal challenge began last year when the crypto advocacy group Coin Center and a handful of other plaintiffs sued [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/26/new-law-requiring-us-citizens-to-report-crypto-payments-worth-10000-coming-soon-coin-center/\">New Law Requiring US Citizens To Report Crypto Payments Worth $10,000 Coming Soon: Coin Center</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-07-26T16:25:41.000Z",
    "title": "OKX Releases Industry Leading Ninth Consecutive Proof of Reserves in July, Showing $11.3 Billion in Primary Assets",
    "url": "https://dailyhodl.com/2023/07/26/okx-releases-industry-leading-ninth-consecutive-proof-of-reserves-in-july-showing-11-3-billion-in-primary-assets/",
    "description": "<img width=\"500\" height=\"500\" src=\"https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg?w=500\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg 500w, https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg?resize=150,150 150w, https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg?resize=300,300 300w, https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg?resize=75,75 75w, https://dailyhodl.com/wp-content/uploads/2023/03/OKX-Industry-Announcement-Featured-Image-Template.jpg?resize=350,350 350w\" sizes=\"(max-width: 500px) 100vw, 500px\" /><p>July 26, 2023 – Hong Kong, Hong Kong OKX, a leading crypto exchange by trading volume and Web 3.0 technology company, has published its industry-best ninth consecutive monthly PoR (proof of reserves), showing a balance of $11.3 billion in BTC, ETH and USDT. OKX&#8217;s PoR covers 22 commonly used digital assets and demonstrates that OKX [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/07/26/okx-releases-industry-leading-ninth-consecutive-proof-of-reserves-in-july-showing-11-3-billion-in-primary-assets/\">OKX Releases Industry Leading Ninth Consecutive Proof of Reserves in July, Showing $11.3 Billion in Primary Assets</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]