[
  {
    "source": "Crypto Daily",
    "date": "2023-10-09T08:58:38.000Z",
    "title": "Charlie Munger on Bitcoin: “That was the stupidest investment I ever saw”",
    "url": "https://cryptodaily.co.uk/2023/10/charlie-munger-on-bitcoin-that-was-the-stupidest-investment-i-ever-saw",
    "description": "Warren Buffet’s right hand man Charlie Munger continued his bitter tirade against Bitcoin and crypto at a Zoom conference on Thursday."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-09T08:54:43.000Z",
    "title": "Assassin’s Creed Mirage: Unraveling the Ahmad Ibn Musa Investigation",
    "url": "https://www.cryptopolitan.com/assassins-creed-mirage-unraveling-the-ahmad-ibn-musa-investigation/",
    "description": "Assassin&#8217;s Creed Mirage takes players on a thrilling journey through the mysterious world of medieval Arabia, where intrigue and danger lurk around every corner. In this gripping tale, players find themselves embroiled in the Ahmad Ibn Musa Investigation, a quest that leads them deep into the heart of a shadowy conspiracy. The House of Wisdom: ... <a title=\"Assassin&#8217;s Creed Mirage: Unraveling the Ahmad Ibn Musa Investigation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/assassins-creed-mirage-unraveling-the-ahmad-ibn-musa-investigation/\" aria-label=\"More on Assassin&#8217;s Creed Mirage: Unraveling the Ahmad Ibn Musa Investigation\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-09T08:53:12.000Z",
    "title": "Upbit exchange hacking attacks doubled in 2023",
    "url": "https://crypto.news/upbit-exchange-hacking-attacks-doubled-in-2023/",
    "description": "South Korea&#8217;s largest exchange, Upbit, suffered 159,061 attacks during the first half of 2023. According to the local media Yonhap, it is nearly 2.17 times more than in 2022. To fight back against the increasing trends of hacking attacks, the&#8230;"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-09T09:00:58.000Z",
    "title": "Bitcoin Price Ready For Blast-Off As Key Metrics Signal A Bull Run: Top Analyst",
    "url": "https://www.newsbtc.com/news/bitcoin-price-ready-for-blast-off-as-key-metrics-signal-a-bull-run-top-analyst/",
    "description": "Bitcoin price analysts are pointing to a combination of high timeframe indicators that suggest the bear market for the leading cryptocurrency may be over, hinting at an impending upward surge. TechDev, a prominent crypto analyst known for insightful market analysis, recently shared a compelling perspective on social media platform X. Drawing parallels to historical trends, TechDev contends that Bitcoin is currently in a familiar position, reminiscent of the preludes to the 2016 and 2020 bull markets. Related Reading: XRP Journey To $0.55: Is A Breakthrough Imminent In The Coming Days? Bitcoin Price Analysis: Volatility Contraction Signals Imminent Breakout To illustrate this perspective, TechDev presented a chart featuring monthly candles, Bollinger bands, and a specialized indicator showcasing the logarithmic width between the bands in relation to the 200-month moving average. What is particularly intriguing about this chart is how Bitcoin&#8217;s Bollinger bands, which gauge relative volatility, have significantly contracted, implying a forthcoming breakout to the upside. What #bitcoin has looked like before heading north&#8230; pic.twitter.com/aDCCAKSDli — TechDev (@TechDev_52) October 6, 2023 This influential analyst further points out that Bitcoin is not alone in its quest for a bullish breakout; the broader altcoin market is also in contention. To make this comparison, TechDev references the &#8220;OTHERS&#8221; chart, measuring the collective market capitalization of all cryptocurrencies except Bitcoin and Ethereum (ETH). In TechDev&#8217;s analysis, Bitcoin has forged crucial support levels at the inception of a long-term bullish momentum. Simultaneously, the &#8220;OTHERS&#8221; index has managed to break through a long-standing downward resistance. These developments collectively indicate that both Bitcoin and the altcoin market are primed for significant moves, potentially marking the end of the bear market phase. As of the latest data from CoinGecko, Bitcoin&#8217;s price stands at $27,916 with a 24-hour price movement of 0.0% and a marginal 0.1% decline over the past week. This relative stability suggests that investors are holding their positions, awaiting the anticipated breakout. BTCUSD selling at $27,826 today. Chart: TradingView.com Whale Activity Sparks Speculation Meanwhile, in a surprising turn of events, a dormant Bitcoin address that had remained inactive for three years suddenly sprung back to life. Approximately 5,000 Bitcoins, valued at around $140 million, were transferred from this address. Notably, this substantial transfer was divided among three different addresses, as highlighted by PeckShield, a renowned blockchain security firm. #PeckShieldAlert A dormant $BTC address 1LH1dY&#8230;ztTz (which has been inactive for 3 years) has transferred ~5K $BTC (~$140M) to 3 addresses bc1q5rpq5wppf5tua2yd97nscp8gpz8fq0w740g22c 34aed6ryXt6ZCHv6k2WPiyy7ap5VbyHr8D… pic.twitter.com/kLj1SeEQSh — PeckShieldAlert (@PeckShieldAlert) October 8, 2023 The implications of this significant whale movement on Bitcoin&#8217;s price remain to be seen. Such sizeable transactions often draw attention and can have varying effects on market sentiment. Traders and investors will be closely monitoring how this unexpected development plays out in the coming days and weeks. Related Reading: Trillions In Shiba Inu On The Move: What Lies Ahead For The Meme Coin? The convergence of multiple high timeframe indicators suggests that Bitcoin may be on the cusp of a bullish resurgence, reminiscent of previous market cycles. As Bitcoin continues to vie for an upward breakout alongside the broader altcoin market, the crypto community eagerly anticipates the potential end of the bear market and the start of a new phase in the digital asset landscape.  (This site&#8217;s content should not be construed as investment advice. Investing involves risk. When you invest, your capital is subject to risk). Featured image from The Drive"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-10-09T09:05:34.000Z",
    "title": "Shiba Inu and Cosmos At Critical Levels, While This Hidden Crypto Is Set To Disrupt A Trillion-Dollar Industry",
    "url": "https://www.crypto-news-flash.com/shiba-inu-and-cosmos-at-critical-levels-while-this-hidden-crypto-is-set-to-disrupt-a-trillion-dollar-industry/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-and-cosmos-at-critical-levels-while-this-hidden-crypto-is-set-to-disrupt-a-trillion-dollar-industry",
    "description": "<img width=\"512\" height=\"299\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-37.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-37.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/10/unnamed-37-300x175.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The cryptocurrency industry is never short of exciting developments and recent news. In this article, we&#8217;ll look at three noteworthy developments in the crypto space. They are: Shiba Inu is teasing a major announcement, Cosmos is facing a price decline, and Everlodge is positioned to disrupt a trillion-dollar industry. Join the Everlodge presale and win [...]"
  }
]