[
  {
    "source": "CoinDesk",
    "date": "2023-11-01T04:23:31.000Z",
    "title": "Frax Finance Says its Domain Name Has Been Hijacked",
    "url": "https://www.coindesk.com/markets/2023/11/01/frax-finance-says-its-domain-name-has-been-hijacked/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Frax founder Sam Kazemian says his team has been \"left in the dark\" by the domain registrar as to what happened."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-01T04:24:02.000Z",
    "title": "AI chatbots are illegally ripping off copyrighted news, says media group",
    "url": "http://cointelegraph.com/news/ai-chatbots-ripping-off-news-media-group-says",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/cf805ae3-7025-49cc-8b25-7b265d33deea.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>AI developers are taking revenue, data and users away from news publications by building competing products, the News Media Alliance claims.</p>\n                    <p><p>Artificial intelligence developers heavily rely on illegally scraping copyrighted material from news publications and journalists to train their models, a news industry group has claimed.</p><p>On Oct. 30, the News Media Alliance (NMA) published a 77-page white <a href=\"http://www.newsmediaalliance.org/wp-content/uploads/2023/10/AI-White-Paper-with-Technical-Analysis.pdf\" target=\"_blank\" rel=\"noopener nofollow\">paper</a> and accompanying submission to the United States Copyright Office that claims the data sets that train AI models use significantly more news publisher content compared to other sources.</p><p>As a result, the generations from AI “copy and use publisher content in their outputs” which infringes on their copyright and puts news outlets in competition with AI models.</p><p>“Many generative AI developers have chosen to scrape publisher content without permission and use it for model training and in real-time to create competing products,” NMA stressed in an Oct. 31 <a href=\"https://www.newsmediaalliance.org/generative-ai-white-paper/\" target=\"_blank\" rel=\"noopener nofollow\">statement</a>.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">On Monday, the News/Media Alliance published a White Paper and a technical analysis and submitted comments to the <a href=\"https://twitter.com/CopyrightOffice?ref_src=twsrc%5Etfw\">@CopyrightOffice</a> on the use of publisher content to power generative artificial intelligence technologies (<a href=\"https://twitter.com/hashtag/GAI?src=hash&amp;ref_src=twsrc%5Etfw\">#GAI</a>). <a href=\"https://t.co/Zr05e7nZTS\">https://t.co/Zr05e7nZTS</a></p>&mdash; News/Media Alliance (@newsalliance) <a href=\"https://twitter.com/newsalliance/status/1719373559192010975?ref_src=twsrc%5Etfw\">October 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The group argues while news publishers make investments and take on risks, AI developers are the ones rewarded “in terms of users, data, brand creation, and advertising dollars.”</p><p>Reduced revenues, employment opportunities and tarnished relationships with its viewers are other setbacks publishers face, the NMA noted its <a href=\"http://www.newsmediaalliance.org/wp-content/uploads/2023/10/Final-NMA-USCO-AI-NOI-Response-Submitted-10.30.23.pdf\" target=\"_blank\" rel=\"noopener nofollow\">submission</a> to the Copyright Office.</p><p>To combat the issues, the NMA recommended the Copyright Office declare that using a publication’s content to monetize AI systems harms publishers. The group also called for various licensing models and transparency measures to restrict the ingestion of copyrighted materials.</p><p>The NMA also recommends the Copyright Office adopt measures to scrap protected content from third-party websites.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The Guardian has accused Microsoft of damaging its journalistic reputation by publishing an AI-generated poll speculating on the cause of a woman’s death next to an article by the news publisher. <a href=\"https://t.co/tOie87HSyA\">https://t.co/tOie87HSyA</a></p>&mdash; News/Media Alliance (@newsalliance) <a href=\"https://twitter.com/newsalliance/status/1719505453686632513?ref_src=twsrc%5Etfw\">November 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The NMA acknowledged the benefits of generative AI and noted that publications and journalists can use AI for proofreading, idea generation and search engine optimization. </p><p>OpenAI’s ChatGPT, Google’s Bard and Anthropic’s Claude are three AI chatbots that have seen increased use over the last 12 months. However, the methods to train these AI models have been criticized, with all facing copyright infringement claims in court.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/google-ai-law-art-copyright\"><strong><em>How Google’s AI legal protections can change art and copyright protections </em></strong></a></p><p>Comedian Sarah Silverman sued OpenAI and Meta in July claiming the two firms used her <a href=\"https://cointelegraph.com/news/meta-and-open-ai-sued-for-copyright-violations-sarah-silverman\">copyrighted work to train their AI systems</a> without permission. </p><p>OpenAI and <a href=\"https://cointelegraph.com/news/google-hit-with-lawsuit-over-ai-privacy-policy\">Google were hit</a> with separate class-action suits over claims they scraped <a href=\"https://cointelegraph.com/news/open-ai-hit-with-class-action-lawsuit-over-chatgpt-data-theft\">private user information</a> from the internet.</p><p>Google has said it will <a href=\"https://cointelegraph.com/news/google-protect-users-ai-copyright-accusations\">assume legal responsibility</a> if its customers are alleged to have infringed copyright for using its generative AI products on Google Cloud and Workspace.</p><blockquote>“If you are challenged on copyright grounds, we will assume responsibility for the potential legal risks involved.</blockquote><p>However, Google’s Bard search tool isn't covered by its legal protection promise.</p><p>OpenAI and Google did not immediately respond to a request for comment.</p><p><strong><em>Magazine:</em></strong><a href=\"https://cointelegraph.com/magazine/ai-eye-real-ai-usecases-crypto-gemini-gpt-4-rival-roblox-assistant-ai-cheating/\"><strong><em> AI Eye: Real uses for AI in crypto, Google’s GPT-4 rival, AI edge for bad employees</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-01T04:16:00.000Z",
    "title": "Why You Need AI Capabilities for Modern Reputation Management -Exclusive Report",
    "url": "https://www.cryptopolitan.com/ai-capabilities-modern-reputation-management/",
    "description": "In today&#8217;s digital world, the reputation of a business is an ever-changing landscape, heavily influenced by consumer interactions and online commentary. As opinions and reviews traverse the web at lightning speed, they shape public perception and directly impact company success. Navigating this intricate environment is where online reputation management becomes a critical strategy for businesses, ... <a title=\"Why You Need AI Capabilities for Modern Reputation Management -Exclusive Report\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ai-capabilities-modern-reputation-management/\" aria-label=\"More on Why You Need AI Capabilities for Modern Reputation Management -Exclusive Report\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-11-01T04:36:12.000Z",
    "title": "Ethereum Price is About to See “Liftoff” if It’s Able to Hold One Crucial Level",
    "url": "https://www.newsbtc.com/analysis/eth/ethereum-price-liftoff-if-1850/",
    "description": "Ethereum price is still struggling to clear the $1,850 resistance against the US dollar. ETH might rally again if it clears $1,820 and $1,850. Ethereum is still facing a key barrier near the $1,850 zone. The price is trading above $1,785 and the 100-hourly Simple Moving Average. There is a major rising channel forming with support near $1,800 on the hourly chart of ETH/USD (data feed via Kraken). The pair could extend its increase if it clears the $1,820 resistance. Ethereum Price Remains Supported Ethereum started a slow and steady increase from the $1,740 zone. ETH was able to reclaim the $1,800 resistance zone and avoided a major downside correction, like Bitcoin. The bulls even pushed the price above the 50% Fib retracement level of the downside correction from the $1,865 swing high to the $1,740 low. Moreover, there is a major rising channel forming with support near $1,800 on the hourly chart of ETH/USD. Ethereum is now trading above $1,785 and the 100-hourly Simple Moving Average. On the upside, the price is facing resistance near the $1,820 level. It is close to the 61.8% Fib retracement level of the downside correction from the $1,865 swing high to the $1,740 low. If ETH surpasses the $1,820 resistance, it could rise toward the key barrier at $1,850. A close above the $1,850 resistance could start a fresh rally. In the stated case, the price could rally toward $1,950. Source: ETHUSD on TradingView.com The next key resistance is near $2,000, above which the price could accelerate higher. In the stated case, the price could rise toward the $2,120 level. The main hurdle sits at $2,250. Bearish Wave in ETH? If Ethereum fails to clear the $1,820 resistance, it could start another decline. Initial support on the downside is near the $1,800 level, the 100-hourly Simple Moving Average, and the trend line. The next key support is $1,770. The main support is now forming near the $1,750 and $1,740 levels. A downside break below the $1,740 support might spark a bearish wave. In the stated case, Ether could drop toward the $1,650 level. Technical Indicators Hourly MACD – The MACD for ETH/USD is losing momentum in the bullish zone. Hourly RSI &#8211; The RSI for ETH/USD is now above the 50 level. Major Support Level – $1,740 Major Resistance Level – $1,820"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-11-01T04:15:15.000Z",
    "title": "Crypto Tycoon Jed McCaleb Backs AI Hardware Revolution with $500M Investment",
    "url": "https://www.crypto-news-flash.com/crypto-tycoon-jed-mccaleb-backs-ai-hardware-revolution-with-500m-investment/?utm_source=rss&utm_medium=rss&utm_campaign=crypto-tycoon-jed-mccaleb-backs-ai-hardware-revolution-with-500m-investment",
    "description": "<img width=\"1280\" height=\"850\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"AI\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280.jpg 1280w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-300x199.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-1024x680.jpg 1024w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-768x510.jpg 768w, https://www.crypto-news-flash.com/wp-content/uploads/2023/06/intergrate-partnership-blockchain-gdcb376912_1280-104x69.jpg 104w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />Jed McCaleb&#8217;s Voltage Park has invested $500 million in Nvidia chips to lease AI processing power to tech companies. The initiative is rapidly deploying these chips to meet the surging demand for AI in the U.S. Crypto entrepreneur Jed McCaleb has allocated a substantial $500 million to advanced semiconductor technology, targeting the shortage of AI [...]"
  }
]