[
  {
    "source": "Cointelegraph",
    "date": "2023-11-26T23:58:00.000Z",
    "title": "Inferno Drainer says it’s shutting down after helping steal $70M in crypto",
    "url": "http://cointelegraph.com/news/inferno-drainer-shut-down-after-stealing-millions-crypto-wallet-scam-kit",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/7ce0b800-e84e-46da-a5a1-1134b5d3437c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>“We hope you can remember us as the best drainer that has ever existed,” wrote the scam-as-a-service wallet drainer.</p>\n                    <p><p>Inferno Drainer, one of the most popular crypto wallet-draining kits for hire says it is shutting down for good after helping phishing scammers steal nearly $70 million worth of crypto this year. </p><p>In a Nov. 26 Telegram <a href=\"https://t.me/InfernoDrainer/150\" target=\"_blank\" rel=\"noopener nofollow\">post</a>, the team behind Inferno Drainer said it was “time for us to move on.” However, it said that the files and infrastructure needed to run the wallet drainer won’t be destroyed but instead will remain active so users can make a “smooth transition” to other services.</p><blockquote>“It has been a long ride with all of you and we’d like to thank you from heart [sic]. Unfortunately, nothing lasts forever.”</blockquote><p>“A big thank [sic] to everyone who has worked with us,” it added. “We hope you can remember us as the best drainer that has ever existed and that we succeeded in helping you in the quest of making money.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-11/c82d799d-077f-4572-b7e2-1aa657645785.png\"  /><figcaption style=\"text-align: center;\"><em>Inferno Drainer’s final message to its users. Source: Telegram</em></figcaption></figure><p>Inferno Drainer <a href=\"https://cointelegraph.com/news/inferno-drainer-scam-as-a-service-has-stolen-5-9m-since-march-report\">gained prominence early this year</a> and saw increased use after the popular Monkey Drainer tool shut down. Like its peers, Inferno offered its crypto wallet-draining software and took a 20% cut of what users stole. </p><p>Since February, Inferno Drainer has stolen nearly $70 million from over 100,000 victims, according to <a href=\"https://dune.com/scamsniffer/inferno-drainer\" target=\"_blank\" rel=\"noopener nofollow\">analytics</a> from Web3 anti-scam platform Scam Sniffer. However, the Inferno Drainer team suggested the amount stolen was over $80 million.</p><p>The Inferno Drainer team has deleted the affiliate Telegram account “mr_inferno_drainer” used for arranging its service and warned its users not to trust other drainers using its name in the future.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/cypto-drainers-pink-pussy-venom-and-inferno-steal-millions\"><strong><em>Pink, Pussy, Venom, Inferno — Drainers coming for a crypto wallet near you</em></strong></a></p><p>Blockchain security firm CertiK told Cointelegraph that Inferno Drainer was “one of the most damaging phishing kits to the community we’ve seen.”</p><p>It added there are still “plenty of providers out there” who are active, including rival Pink Drainer and Angel Drainer, the latter of which released an update on Nov. 25 to help users drain wallets on more blockchains.</p><p>Monkey Drainer, another high-profile crypto drainer that stole millions, <a href=\"https://cointelegraph.com/news/notorious-monkey-drainer-crypto-scammer-says-they-re-shutting-down\">shut down in March</a>, saying it was “time to move on to something better.”</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/tornado-cash-2-0-the-race-to-build-safe-and-legal-coin-mixers/\"><strong><em>Tornado Cash 2.0 — The race to build safe and legal coin mixers</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-11-26T23:46:06.000Z",
    "title": "Lightning devs must ‘wake up’ and fix security bugs, not please VCs: Bitcoin dev",
    "url": "http://cointelegraph.com/news/lightning-developers-wake-up-fix-replacement-cycling-bitcoin-dev",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-11/752243d1-3771-48eb-aec3-2dccc85295a7.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Antoine Riard, who left the Lightning Network in October, argues the Lightning Network is also at risk of becoming increasingly centralized and susceptible to single points of failure and censorship risks.</p>\n                    <p><p>Developers working on the Bitcoin layer 2 Lightning Network have become less security-oriented and more focused on producing cash flow for their investors, argues a former Lightning Network developer.</p><p>Bitcoin core developer and security researcher Antoine Riard, made headlines last month<a href=\"https://cointelegraph.com/news/bitcoin-core-developer-antoine-riard-steps-back-lightning-network-dilemma\"> after leaving the Lightning ecosystem</a> over concerns about a new attack vector called “replacement cycling,” which exploiters could potentially use to steal funds by targeting payment channels.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">How does a lightning replacement cycling attack work?<br><br>There&#39;s a lot of discussion about this newly discovered vulnerability on the mailing lists, but the actual mechanism is a bit hard to follow.<br><br>So here&#39;s an illustrated primer...<br><br> 1/n <a href=\"https://t.co/mvvS8bEc5f\">pic.twitter.com/mvvS8bEc5f</a></p>&mdash; mononaut (@mononautical) <a href=\"https://twitter.com/mononautical/status/1715736832950825224?ref_src=twsrc%5Etfw\">October 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>At the time, Riard said the new class of attacks puts Lighting in a “perilous position\" though other Bitcoin developers such as “Machine98” <a href=\"https://x.com/btcmachine98/status/1726259008917602419\" target=\"_blank\" rel=\"noopener nofollow\">suggested</a> it is a difficult attack to pull off in the first place.</p><p>Riard told Cointelegraph that he’s now working at the Bitcoin base layer to address the issue and urged Lightning developers to follow suit:</p><blockquote>“[They need to] wake up, stop the sleepwalking and go to the whiteboard to design a robust and sustainable fix in hand with other developers at the base-layer, preserving the long-term decentralization and openness of Lightning.”</blockquote><p>Riard also claimed that many Lightning-focused firms are compromising Lightning’s mission and security incentives for the sake of pleasing venture capitalists:</p><blockquote>“The sad fact being most of them are working for VC-funded entities, or commercial entities with the same low-time preference, at the long-term detriment of end-users.”</blockquote><p>Riard said it’s a classic example of the “tragedy of the commons” — where individuals and entities with access to a public resource act in their own interest and deplete it.</p><p>Decentralization appears to be a trade-off that these VC-funded Lightning firms are willing to make, which is a major concern to Riard.</p><blockquote>“Centralized systems are great in the scale of efficiency, however they come with the downside of systemic single-point-of-failure and lower cost of user censorship, fundamental risks that one might wish to hedge against as a Bitcoiner.”</blockquote><p>“I'm not sure this is an interesting Lightning future,” Riard said. In fact, it is something which he wants no part of, after departing from the Lightning ecosystem on Oct. 20:</p><blockquote>“I do not wish to be associated with being in charge or accountable of the Lightning Network security, and the ~5,300 BTC exposed here. There is little [I and others] can do to halt the haemorrhage, without compromising the core values of censorship-resistance and permissionless of the Lightning Network.”</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Lightning is the best solution currently available, but it&#39;s not good enough.<br><br>Lightning has several fundamental flaws, where each of them make the system as a whole a dead end for bitcoin, long term. An attempt at explaining these, and what we should do instead.<br><br>Liquidity…</p>&mdash; torkel (@torkelrogstad) <a href=\"https://twitter.com/torkelrogstad/status/1726609404856868917?ref_src=twsrc%5Etfw\">November 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-lightning-network-growth-surges-over-two-years\"><strong><em>Bitcoin Lightning Network growth jumps 1,200% in 2 years</em></strong></a></p><p>The Lightning Network is the second-layer solution built over the Bitcoin blockchain. It is designed to improve the scalability and efficiency of Bitcoin.</p><p>Through the Lightning Network, users can open payment channels, conduct multiple transactions off-chain, and settle the final result on the Bitcoin blockchain. The replacement cycling attack is a new type of attack that allows the attacker to steal funds from a channel participant by exploiting inconsistencies between individual mempools. </p><p>Cointelegraph reached out to Lightning Labs and other firms in the Lighting ecosystem but did not receive a response.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Don&#39;t get me wrong here: Lightning is great! Always still amazed when using it.<br>The point is that it can&#39;t scale enough. And Ark is not a competitor but more of an add-on. Gives you all the advantages of Cashu but without requiring trust.<br><br>All we need is covenants. Ideally, CAT <a href=\"https://t.co/nhrmvqPYf0\">https://t.co/nhrmvqPYf0</a></p>&mdash;  яobin linus (@robin_linus) <a href=\"https://twitter.com/robin_linus/status/1726388633265963039?ref_src=twsrc%5Etfw\">November 19, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, despite the security concerns and potential move toward centralization, Riard explained that Lightning hasn’t seen as many attacks as many Ethereum layer 2s because Lightning users typically only store a small amount of funds in their wallets at any given time.</p><p>A total of $194.1 million in BTC is locked in the Lightning Network, <a href=\"https://defillama.com/protocol/lightning-network\" target=\"_blank\" rel=\"noopener nofollow\">according</a> to DeFiLlama.</p><p><strong><em>Magazine:</em></strong><a href=\"https://cointelegraph.com/magazine/orange-pill-children-bitcoin-kids-books/\"><strong><em> </em></strong><strong><em>Should you ‘orange pill’ children? The case for Bitcoin kids books</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-11-27T00:09:00.000Z",
    "title": "Coinbase adds ADA, LINK, DOGE, XLM perpetual future contracts",
    "url": "https://www.cryptopolitan.com/coinbase-ada-link-doge-xlm-future-contracts/",
    "description": "Coinbase International Exchange, a division of Coinbase Global Inc. focused on serving clients outside the United States, has announced the addition of four new digital assets to its trading portfolio. The move, scheduled for December 30, will see the inclusion of Perpetual Future Contracts for Cardano (ADA), Chainlink (LINK), Dogecoin (DOGE), and Stellar (XLM), marking ... <a title=\"Coinbase adds ADA, LINK, DOGE, XLM perpetual future contracts\" class=\"read-more\" href=\"https://www.cryptopolitan.com/coinbase-ada-link-doge-xlm-future-contracts/\" aria-label=\"More on Coinbase adds ADA, LINK, DOGE, XLM perpetual future contracts\">Read more</a>"
  }
]