[
  {
    "source": "Crypto Daily",
    "date": "2023-05-28T10:15:00.000Z",
    "title": "Crypto Weekly Roundup: Multichain’s Deafening Silence And More",
    "url": "https://cryptodaily.co.uk/2023/05/crypto-weekly-roundup-multichains-deafening-silence-and-more",
    "description": "<p>The radio silence from the Multichain team following days of outages has left users searching for answers, with the protocol currently holding $1.5 billion in total value locked. Let&rsquo;s find out more.&nbsp;</p>\nBitcoin&nbsp;\n<p>Binance CEO Changpeng Zhao has said that he believes the crypto space could see the beginning of a bull run after China Central Television aired a segment on crypto.&nbsp;</p>\nEthereum\n<p>Ethereum co-founder Vitalik Buterin's recent blog post has raised concerns about the potential risks associated with expanding the scope of social consensus within the Ethereum network.</p>\n<p>Ethereum recently implemented its Shanghai/Shapella upgrade, which has been ground-breaking for its investors.</p>\nDeFi\n<p>The Aave community is mulling over a proposal to launch its V3 on the Coinbase-backed Layer-2 blockchain solution, Base network.&nbsp;</p>\n<p>Pioneering DeFi protocol, MakerDAO, has initiated a vote on a proposal allowing its delegates to maintain anonymity and keep their whereabouts undisclosed.</p>\nAltcoins\n<p>The lack of communication and updates from Multichain&rsquo;s leadership has amplified rumors, leading to significant unease and uncertainty among protocol users.&nbsp;</p>\nTechnology\n<p>The Solana Foundation has announced the official integration of a ChatGPT plug-in developed by Solana Labs, marking the official integration of AI into its network.&nbsp;</p>\n<p>Hardware wallet provider Ledger has announced that it is pushing back the launch of its key-recovery feature after mounting criticism from the larger crypto community.&nbsp;</p>\nBusiness\n<p>According to court filings published on Thursday, Crypto Consortium Celsius has won the bid to acquire bankrupt crypto lender Celsius Network.&nbsp;</p>\n<p>After filing for Chapter 11 bankruptcy last December, the Bitcoin mining company, Core Scientific, is now set to finalize a restructuring plan which it expects will net at least a $46 million boost.</p>\n<p>Cryptocurrency exchange Gemini has revealed that Genesis parent entity DCG missed a $630 million loan payment due last week.&nbsp;</p>\nRegulation\n<p>US Senator Cynthia Lummis has pushed back against the Biden Administration&rsquo;s proposal to tax cryptocurrency miners, stating that the administration is picking &ldquo;winners and losers.&rdquo;</p>\n<p>Hong Kong's Securities and Futures Commission (SFC) has recently introduced a series of stringent rules that are set to reshape the landscape of virtual asset trading within the city.&nbsp;</p>\n<p>Governor Ron DeSantis of Florida has made promises to protect the world of digital assets while simultaneously dismantling the concept of a central bank digital currency (CBDC).&nbsp;</p>\n<p>In a recent announcement, the European Systemic Risk Board emphasized the need for measures to prevent excessive leveraged bets on crypto assets.</p>\n<p>Germany&rsquo;s Banking Sector recognizes the vast potential of blockchain technology beyond cryptocurrencies by exploring related innovative applications across various other domains.&nbsp;</p>\n<p>Crypto exchange Coinbase filed a writ of mandamus against the US SEC shortly after the regulatory body stated it was in no hurry to respond to Coinbase&rsquo;s demands for regulatory clarity.</p>\n<p>Global policy forum IOSCO on Tuesday released the first global approach to crypto asset and digital market regulation.</p>\n<p>Japan has announced the implementation of new anti-money laundering measures for cryptocurrencies to combat increasing fraudulent activities in the industry.&nbsp;</p>\n<p>With the UK seeking to become a crypto hub, the Winklevoss twins are advising the government not to let itself be influenced by the politicization of crypto in the US.</p>\n<p>Cryptocurrency exchange Bitget continues to make strides toward becoming an industry leader by securing a regulatory license in Poland.&nbsp;</p>\n<p>The Philippines Securities and Exchange Commission has issued an advisory warning to the public, asking them not to invest in Gemini&rsquo;s Gemini Derivatives product.&nbsp;</p>\n<p>A welcoming embrace from French regulators has led crypto exchange OKX to opt for making France a central base for its operations.</p>\n<p>Malaysia&rsquo;s securities regulator, the Securities Commission, has ordered cryptocurrency exchange Huobi to cease all operations in the country.&nbsp;</p>\n<p>The South Korean Prime Minister, Han Deok-soo, has called on high-ranking public officials to disclose their crypto holdings, with party members unveiling a new bill on Friday.</p>\n<p>While speaking at the final day of the G7 summit in Hiroshima, President Joe Biden clarified that he would &ldquo;not agree to a deal that protects wealthy tax cheats and crypto traders.&rdquo;&nbsp;&nbsp;</p>\nNFT\n<p>The Binance crypto exchange has launched an NFT loan feature, which will allow users to use their NFTs as collateral to borrow cryptocurrency.&nbsp;</p>\n<p>Renowned entrepreneur and digital asset advocate Gary Vee expressed his belief that NFTs have the power to revolutionize the ticketing industry.</p>\nWeb3\n<p>ConsenSys, the blockchain technology firm behind the widely used crypto wallet MetaMask, has addressed recent rumors claiming it collects taxes from cryptocurrency users.</p>\n<p>Dispersion Capital has emerged from stealth mode and announced the launch of a $40 million fund to support startups working on infrastructure for Web3 projects.</p>\nSecurity\n<p>Cybersecurity firm Unciphered has claimed it managed to hack the hugely popular Trezor T hardware wallet manufactured by Satoshi Labs.&nbsp;</p>\n<p>Decentralized crypto mixing platform Tornado Cash recently suffered a significant attack when a malicious proposal recently subverted its governance system.&nbsp;</p>\n<p>Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice. </p>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-05-28T10:23:27.000Z",
    "title": "Arbitrum liquidity protocol Jimbos suffers $7.5 million ETH hack",
    "url": "https://www.cryptopolitan.com/arbitrum-liquidity-protocol-jimbos-suffers-7-5-million-eth-hack/",
    "description": "In a shocking development, Jimbos, an Arbitrum liquidity protocol, was recently breached by an unidentified hacker. The cybercriminal made off with 4090 Ethereum (ETH), which equates to roughly $7.5 million at current rates. The recent breach of the Arbitrum liquidity protocol, Jimbos, contributes to an alarming trend in the cryptocurrency ecosystem: the increasing number of ... <a title=\"Arbitrum liquidity protocol Jimbos suffers $7.5 million ETH hack\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-liquidity-protocol-jimbos-suffers-7-5-million-eth-hack/\" aria-label=\"More on Arbitrum liquidity protocol Jimbos suffers $7.5 million ETH hack\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-28T10:29:04.000Z",
    "title": "Shiba Inu and Dogecoin Rival SNEK Surges to New All-Time High; Massive Potential and Upward Momentum Predicted",
    "url": "https://www.crypto-news-flash.com/shiba-inu-and-dogecoin-rival-snek-surges-to-new-all-time-high-massive-potential-and-upward-momentum-predicted/?utm_source=rss&utm_medium=rss&utm_campaign=shiba-inu-and-dogecoin-rival-snek-surges-to-new-all-time-high-massive-potential-and-upward-momentum-predicted",
    "description": "<p>SNEK surges by 26 percent to record a new all-time high. It has surged by 336 percent since its launch signaling great long-term potential.  SNEK emerged into the crypto scene on May 15 and has since then recorded a huge following as it seeks to rub shoulders with Dogecoin and Shiba Inu. In a recent [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/shiba-inu-and-dogecoin-rival-snek-surges-to-new-all-time-high-massive-potential-and-upward-momentum-predicted/\">Shiba Inu and Dogecoin Rival SNEK Surges to New All-Time High; Massive Potential and Upward Momentum Predicted</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-05-28T10:11:35.000Z",
    "title": "Bitcoin to Surge by 150% and Hit New All-Time High of $100,000 in the Current Year Says Top Trader",
    "url": "https://www.crypto-news-flash.com/bitcoin-to-surge-by-150-and-hit-new-all-time-high-of-100000-in-the-current-year-says-top-trader/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-to-surge-by-150-and-hit-new-all-time-high-of-100000-in-the-current-year-says-top-trader",
    "description": "<p>Bitcoin has continued to exhibit impressive price moves impacted by different factors. A top trader has predicted a $100,000 price target by the end of the year. The world’s largest crypto Bitcoin (BTC) is witnessing impressive price swings, attracting both fervent supporters and skeptical traders across the board. A Pseudonymous analyst named Credible Crypto has [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/bitcoin-to-surge-by-150-and-hit-new-all-time-high-of-100000-in-the-current-year-says-top-trader/\">Bitcoin to Surge by 150% and Hit New All-Time High of $100,000 in the Current Year Says Top Trader</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  },
  {
    "source": "Coin Edition",
    "date": "2023-05-28T10:23:00.000Z",
    "title": "Bitcoin LTH Drive Surge In Profitable Transfer Volume: Glassnode",
    "url": "https://coinedition.com/bitcoin-lth-drive-surge-in-profitable-transfer-volume-glassnode/",
    "description": "<img width=\"380\" height=\"214\" src=\"https://coinedition.com/wp-content/uploads/2022/11/Glassnode_alerts_tweeted_that_BTCs_realized_cap_has_dropped_to-380x214.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"Bitcoin LTH Drive Surge In Profitable Transfer Volume: Glassnode\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://coinedition.com/wp-content/uploads/2022/11/Glassnode_alerts_tweeted_that_BTCs_realized_cap_has_dropped_to-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2022/11/Glassnode_alerts_tweeted_that_BTCs_realized_cap_has_dropped_to-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2022/11/Glassnode_alerts_tweeted_that_BTCs_realized_cap_has_dropped_to-150x84.jpg 150w, https://coinedition.com/wp-content/uploads/2022/11/Glassnode_alerts_tweeted_that_BTCs_realized_cap_has_dropped_to-600x338.jpg 600w, https://coinedition.com/wp-content/uploads/2022/11/Glassnode_alerts_tweeted_that_BTCs_realized_cap_has_dropped_to-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2022/11/Glassnode_alerts_tweeted_that_BTCs_realized_cap_has_dropped_to.jpg 730w\" sizes=\"(max-width: 380px) 100vw, 380px\" /><p>Glassnode tweeted Bitcoin transfer volume sent by long-term holders in profit has surged by almost 2000% YTD. Current profitable transfer volume for BTC is $1.24B, 71.4% lower than the peak during the 2021 Bull Market. The 6-month to 12-month cohort of long-term holders are the largest spenders. Data analytics platform Glassnode reported that the Bitcoin [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/bitcoin-lth-drive-surge-in-profitable-transfer-volume-glassnode/\">Bitcoin LTH Drive Surge In Profitable Transfer Volume: Glassnode</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]