[
  {
    "source": "Cointelegraph",
    "date": "2023-09-09T06:29:00.000Z",
    "title": "Congressman Tom Emmer seeks amendment to limit SEC's crypto oversight ",
    "url": "https://cointelegraph.com/news/congressman-tom-emmer-seeks-amendment-to-limit-sec-crypto-oversight",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/da542fc1-4f98-440f-af13-5c2a212f357e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Emmer intends to introduce an appropriations amendment that will limit the SEC's utilization of funds for digital asset enforcement until comprehensive rules and regulations are put in place.</p>\n                    <p><p><a href=\"https://cointelegraph.com/top-people-in-crypto-and-blockchain-2023/tom-emmer\">Tom Emmer</a>, the Majority Whip of the U.S. House of Representatives, who has previously <a href=\"https://cointelegraph.com/news/congressman-tom-emmer-says-sec-chair-gary-gensler-is-a-bad-faith-regulator\">expressed concerns about the Securities Exchange Commission's (SEC) actions</a> in the cryptocurrency industry, on Friday, Sep. 8, introduced a significant amendment that once more drew attention to the SEC's actions.</p><p>In his <a href=\"https://twitter.com/GOPMajorityWhip/status/1700191143835705542\" target=\"_blank\" rel=\"noopener nofollow\">statement</a>, Tom Emmer criticizes Gary Gensler, alleging that the SEC chair has overstepped his authority, which is negatively affecting the American people. Emmer urges Congress to utilize their available methods and proper procedures to thwart any potential misuse of taxpayer funds by Gary Gensler and the SEC.</p><p>In the past, Rep. Tom Emmer has jointly sponsored several bills aiming to enhance regulatory transparency in the United States. Emmer recently used Twitter to unveil his latest endeavor to limit Gary Gensler and the SEC's financial resources.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">.<a href=\"https://twitter.com/GaryGensler?ref_src=twsrc%5Etfw\">@GaryGensler</a> has abused his authority to grow the Administrative State to the detriment of the American people. Congress must use all our tools, including the appropriations process, to restrict Chair Gensler from further weaponizing taxpayer dollars.</p>&mdash; Tom Emmer (@GOPMajorityWhip) <a href=\"https://twitter.com/GOPMajorityWhip/status/1700191143835705542?ref_src=twsrc%5Etfw\">September 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Emmer intends to introduce an appropriations amendment that will limit the SEC's utilization of funds for digital asset enforcement until comprehensive rules and regulations are put in place. The absence of cryptocurrency regulations has raised concerns about the SEC's substantial expenditures in legal disputes with numerous crypto entities, potentially squandering taxpayers' funds.</p><p>Back in March 2023, Majority Whip Emmer <a href=\"https://emmer.house.gov/2023/3/emmer-introduces-bill-to-provide-regulatory-clarity-for-the-blockchain-ecosystem\" target=\"_blank\" rel=\"noopener nofollow\">introduced</a> the Blockchain Regulatory Certainty Act, a bill that clarifies that blockchain developers and service providers are not considered money transmitters, as they do not hold consumer funds in custody.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sec-urges-court-to-grant-ripple-labs-appeal\"><strong><em>SEC urges court to grant Ripple Labs appeal citing ‘knotty legal problems’</em></strong></a><strong><em><u> </u></em></strong></p><p>The bill distinguishes between custody providers and non-custody providers, relieving the latter from unnecessary compliance burdens that might hinder innovation in the United States. This clarification ensures that validators, miners, and other non-custodial service providers are not categorized in the same way as custody providers.</p><p>Key figures in the blockchain sector, including Blockchain Association CEO Kristin Smith and Crypto Council CEO Sheila Warren, expressed their backing for the proposed legislation. Tom Emmer has also thrown his support behind Rep. Warren Davidson's SEC Stabilization Act, which<a href=\"https://cointelegraph.com/news/breaking-us-lawmakers-file-sec-stabilization-act-to-fire-gary-gensler\"> seeks to remove Gary Gensler from his position as SEC Chair.</a></p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-regulation-sec-chair-gary-gensler-final-say/\"><strong><em>Crypto regulation — Does SEC Chair Gary Gensler have the final say?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-09-09T06:14:33.000Z",
    "title": "Utah resident Jacob Orvidas settles with CFTC over deceptive Bitcoin scheme",
    "url": "https://www.cryptopolitan.com/utah-resident-settles-cftc-bitcoin-scheme/",
    "description": "In a recent development, Jacob Orvidas, a 28-year-old man from Utah, has agreed to a settlement with the Commodity Futures Trading Commission (CFTC) over allegations of a deceptive bitcoin commodity pool scheme. The case has garnered significant attention and sheds light on the potential pitfalls and fraudulent activities in the rapidly evolving cryptocurrency market. Orvidas&#8217;s ... <a title=\"Utah resident Jacob Orvidas settles with CFTC over deceptive Bitcoin scheme\" class=\"read-more\" href=\"https://www.cryptopolitan.com/utah-resident-settles-cftc-bitcoin-scheme/\" aria-label=\"More on Utah resident Jacob Orvidas settles with CFTC over deceptive Bitcoin scheme\">Read more</a>"
  }
]