[
  {
    "source": "Cointelegraph",
    "date": "2023-09-22T05:31:41.000Z",
    "title": "Bitcoin ETFs or not, don’t expect a ‘sexy’ crypto bull run: Concordium founder",
    "url": "https://cointelegraph.com/news/when-will-crypto-market-bull-run-start-analysts-discuss",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/43e15322-bc59-4364-9c71-e978db2d214b.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Experts remain divided on when the next bull market is set to kick off, but they all agree on one thing: the next big rally won’t look like the last one.</p>\n                    <p><p>The next crypto bull run will look nothing like the last one and investors should tame their expectations of an imminent rocketing of cryptocurrency prices.</p><p>At least that’s what Lars Seier  Christensen, the founder of enterprise blockchain Concordium told Cointelegraph in a recent interview.</p><p>As the <a href=\"https://cointelegraph.com/news/spot-bitcoin-etf-approval-underestimated-crypto-market\">majority of the crypto market looks to the swathe</a> of proposed spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded funds with bullishness, Christiensen is doubtful their approval will be an immediately meaningful driver for the crypto markets. </p><blockquote>“Even if you do get a Bitcoin rally — I don't think you should naturally assume that everything is going to rally with it.”</blockquote><p>“Does that necessarily mean that Ethereum and a lot of the older altcoins are going to rally on the back of it too? I think that's nearly certain not going to happen,” he added. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">NEXT DATES TO WATCH:<br><br>Middle of October are the next major days to watch. Namely October 16th.  (&amp; <a href=\"https://twitter.com/GlobalXETFs?ref_src=twsrc%5Etfw\">@GlobalXETFs</a>&#39; Oct 7)<br><br>Also, reminder that we fully expected delays on this round of spot <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> ETF filings. Would have been a shock if they were approved this week. <a href=\"https://t.co/i14fg8FWun\">pic.twitter.com/i14fg8FWun</a></p>&mdash; James Seyffart (@JSeyff) <a href=\"https://twitter.com/JSeyff/status/1697360209453187085?ref_src=twsrc%5Etfw\">August 31, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Christiensen said that while digital asset prices have dampened over the last 18 months, in contrast, there’s an unabated interest in blockchain technology from the corporate side.</p><p>This means that the next big step for the industry won't be marked by a particularly “sexy” rally, where prices of crypto assets surge like they did in 2021 — rather a more subdued growth that will occur gradually over the next 18 months, noting: </p><blockquote>“The only reason corporate types need a crypto asset is in order to execute what they want to do on a given blockchain. So, I think it's very clear that you need to be aware that they're not in desperate need for a given crypto to increase significantly in value.\"</blockquote><p>Not everyone would be inclined to agree with Christensen, however. </p><p>Ben Simpson, the founder of crypto education platform Collective Shift said there’s a wealth of data and indicators that suggest that we’re already witnessing the initial stages of a Bitcoin bull market. </p><p>“The drawdown from All-Time High chart and Market Value to Realized Value Ratio (MVRV) suggest we're in the final stages of accumulation, often a precursor to a bull market,” explained Simpson. </p><p>When it comes to the assets most primed for a major boom, Simpson believes the next bull market will blow wind into the sails of Bitcoin, Ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) and application-specific tokens and sectors like gaming.</p><blockquote>“DeFi tokens are risky but offer significant upside, and Bitcoin I believe emerges as the 'silent winner' amid broader adoption and one I'm most bullish on.”</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">“A Bitcoin ETF won’t have any impact on the price” <a href=\"https://t.co/ArSTwskEec\">pic.twitter.com/ArSTwskEec</a></p>&mdash; Ben Simpson (@bensimpsonau) <a href=\"https://twitter.com/bensimpsonau/status/1701846292975296611?ref_src=twsrc%5Etfw\">September 13, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The last two-year period has been tough for the crypto industry. An <a href=\"https://cointelegraph.com/news/how-do-the-fed-s-interest-rates-impact-the-crypto-market\">increasingly hawkish federal reserve</a> combined <a href=\"https://cointelegraph.com/news/7-biggest-crypto-collapses-of-2022-the-industry-would-like-to-forget\">with a number of high-profile collapses</a> including the likes of FTX and Celsius Network, have seen investment in the industry dwindle, bringing down the prices of crypto assets along with it. </p><p>With the U.S. Federal Reserve deciding to <a href=\"https://cointelegraph.com/news/bitcoin-price-27k-fed-holds-interest-rates-fomc\">press pause on any interest rate hikes</a> earlier in the week, eToro Markets analyst Josh Gilbert views the broader macro outlook with a sense of optimism. </p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">BREAKING : THE FEDERAL RESERVE HAS JUST PAUSED IT’S INTEREST RATE HIKES AND WILL KEEP INTEREST RATES AT THE CURRENT LEVEL <a href=\"https://t.co/meRkOhhWfh\">pic.twitter.com/meRkOhhWfh</a></p>&mdash; GURGAVIN (@gurgavin) <a href=\"https://twitter.com/gurgavin/status/1704556044163092829?ref_src=twsrc%5Etfw\">September 20, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>“We’ve finally got an improving macro environment with rate cuts on the horizon from central banks globally. As rates begin to fall and inflation subsides, investors will take on more risk, deploying more capital into financial markets — and crypto will be front and center,” he said. </p><p>Like many market commentators in recent months, Gilbert asserted that next year looks primed for a rally. </p><blockquote>“2024 could be a strong year for Bitcoin and the broader crypto market. The bitcoin halving is the centerpiece of this theory and it’s the major catalyst optimistic investors are focused on.” </blockquote><p>However, Tina Teng, a market analyst from CMC Markets explained that it’s far too early to start worrying about whether or not massive gains are on the horizon. Instead, investors should be bracing themselves for a new wave of uncertainty.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/china-capital-flight-could-it-pump-bitcoin-analysts-weigh-in\"><strong><em>China suffers worst capital flight in years, but could it pump Bitcoin?</em></strong></a></p><p>“It’s too early to say that it's the start of a bull market in crypto. This would depend on the macro environment and hinge on whether or not central banks are willing to end their rate hike cycles to provide enough liquidity to the markets,” said Teng. </p><p>“Tightening monetary policy is behind the decline in riskier asset classes, such as startups, small caps, and cryptocurrencies. In history, the cryptocurrency market’s boom happened during the Fed’s rate cut cycle but not a hiking cycle.” </p><blockquote>“The rampant government bond yields and inverted bond yields repeatedly flash warning signals for economic uncertainty ahead.”</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> is racing down to realized loss on the 50-day moving average of the RPV ratio.<br><br>And if previous cycles tell us anything, this is the last time it happens until the next cycle top!<br>                                                              <br>Each cycle, Bitcoin makes a… <a href=\"https://t.co/Rrw7wYKbvA\">pic.twitter.com/Rrw7wYKbvA</a></p>&mdash; CryptoCon (@CryptoCon_) <a href=\"https://twitter.com/CryptoCon_/status/1697691720798945563?ref_src=twsrc%5Etfw\">September 1, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Teng says for an imminent bull market thesis to be validated, Bitcoin needs to break through the 50-day moving average and catch a ride on another surge upwards. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/bitcoin-ogs-experts-how-to-protect-your-crypto/\"><strong><em>How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in</em></strong></a> </p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-09-22T05:18:33.000Z",
    "title": "Nic Carter doubles down on theory Bitcoin was invented by NSA",
    "url": "https://cointelegraph.com/news/nic-carter-supports-bitcoin-invented-by-nsa-conspiracy-theory",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-09/721bfe29-189a-4bc6-8a9f-d5aa57d04917.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The decades old ‘NSA created Bitcoin’ theory has again made the rounds on social media, with one Bitcoin advocate adding more weight to his ongoing theory.</p>\n                    <p><p>Bitcoin advocate Nic Carter has come out to reiterate his support for the theory that the United States National Security Agency (NSA) had something to do with the creation of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>).</p><p>On Sept. 15, Iris Energy co-founder Daniel Roberts seemingly revived the decade-old theory on X after <a href=\"https://twitter.com/danroberts0101/status/1702440110002729356\" target=\"_blank\" rel=\"noopener nofollow\">posting</a> screenshots of a 1996 paper titled: “How to make a mint: The cryptography of anonymous electronic cash.” </p><p>The paper is one of the first known discussions of a Bitcoin-like system, which proposes using public-key cryptography to allow users to make anonymous payments without revealing their identity.<strong> </strong></p><p>The footer notes show the research paper was “prepared by NSA employees.” Sources included cryptography expert Tatsuaki Okamoto who co-invented the Okamoto–Uchiyama public key cryptosystem in 1998.</p><p>On Sept. 21, <a href=\"https://cointelegraph.com/news/nic-carter-takes-aim-at-claims-bitcoin-is-an-environmental-disaster\">Carter</a> — a partner of Castle Island Ventures partner doubled down his support for the notion stating “I actually do believe this,” before adding:</p><blockquote>“I call it the Bitcoin lab leak hypothesis. I think it was a shuttered internal R&amp;D project which one researcher thought was too good to lay fallow on the shelf and chose to secretly release.”</blockquote><p>Carter has actually held the theory for several years, <a href=\"https://twitter.com/nic__carter/status/1260733240270368768\" target=\"_blank\" rel=\"noopener nofollow\">proposing</a> back in 2020: “If Bitcoin was written by NSA cryptographers as a monetary bioweapon, if you will, and the code escaped those sensitive confines... does that make it a virus... that escaped from a lab?”</p><p>In 2021, he <a href=\"https://twitter.com/nic__carter/status/1410049641714962433\" target=\"_blank\" rel=\"noopener nofollow\">stated</a>: “The only decent thing the NSA ever did from the world was let Bitcoin leak from the lab.\"</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I actually do believe this. I call it the bitcoin lab leak hypothesis. I think it was a shuttered internal R&amp;D project which one researcher thought was too good to lay fallow on the shelf and chose to secretly release <a href=\"https://t.co/qXJkQTciSK\">https://t.co/qXJkQTciSK</a></p>&mdash; nic  carter (@nic__carter) <a href=\"https://twitter.com/nic__carter/status/1704922555189182784?ref_src=twsrc%5Etfw\">September 21, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, he went on to say that this doesn’t imply the U.S. government secretly controls all the Satoshi coins, another theory that often piggybacks on the Bitcoin / NSA conspiracy theory which suggests the NSA created a backdoor to the Bitcoin code.</p><blockquote>“In my version of this made-up idea, the researcher did it without permission of the NSA, and chose to leave the coins behind so as to preserve his anonymity.”</blockquote><p>“There’s a ton of other circumstantial evidence which supports this [theory],” he added.</p><p>Meanwhile, some users drew attention to one of the cryptography academics <a href=\"https://scholar.google.com/citations?user=h8i5ZfUAAAAJ&amp;hl=en\" target=\"_blank\" rel=\"noopener nofollow\">Tatsuaki Okamoto</a> listed in the 1996 paper, suggesting the name sounds very similar to <a href=\"https://cointelegraph.com/learn/who-is-satoshi-nakamoto-the-creator-of-bitcoin\">Satoshi Nakamoto</a>, the pseudonymous creator of Bitcoin.</p><p>“The name could have been used as inspiration for satoshi. That’s not really a critical part of the theory though,” Carter said. </p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/this-is-how-satoshi-nakamoto-envisioned-crypto-working\"><strong><em>This is how Satoshi Nakamoto envisioned crypto working</em></strong></a></p><p>Meanwhile, director of Intelligence at cyber security firm Krebs Stamos, Matthew Pines, <a href=\"https://twitter.com/matthew_pines/status/1704948679558189387\" target=\"_blank\" rel=\"noopener nofollow\">believes</a> it was most likely a “cross-fertilization of NSA crypto nerds and cipher punk nerds,” adding: </p><blockquote>“I suspect Satoshi (or at least his/their close intellectual collaborators) has close NSA work associations—but I don’t think Bitcoin itself or the white paper were officially sanctioned.”</blockquote><p>Former Goldman Sachs executive Raoul Pal has previously shared his own theory. In an interview with Impact Theory earlier this year he <a href=\"https://www.youtube.com/watch?v=9UzMNewP5pc\" target=\"_blank\" rel=\"noopener nofollow\">said</a>: </p><blockquote>“I think the US government and the UK government invented it ... which is the NSA and the GCHQ in the UK, who are the two world centers of cryptography,”</blockquote><p>Cointelegraph’s deep dive into the conspiracy theory in August interviewed former NSA cryptanalyst Jeff Man, who said that while it was “feasible” that the NSA could have created Bitcoin as a means to gather intelligence about its enemies, it is highly doubtful. </p><p>However, Man concluded that even if they did, it is likely we’ll never find out the real story behind the world’s most popular digital asset until it doesn't matter anymore.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/big-questions-did-the-nsa-create-bitcoin/\"><strong><em>Big Questions: Did the NSA create Bitcoin?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template></p>\n                \n            "
  }
]