[
  {
    "source": "Decrypt",
    "date": "2023-10-18T18:50:33.000Z",
    "title": "Doctor Pleads Guilty to Using Bitcoin to Hire a Hitman in Murder Plot",
    "url": "https://decrypt.co/202199/doctor-pleads-guilty-bitcoin-to-hire-a-hitman-in-murder-plot",
    "description": "\"How soon should work be done? I have submitted an Order and curious how quickly it should be carried out,\" the doctor asked in a forum."
  },
  {
    "source": "Decrypt",
    "date": "2023-10-18T18:48:56.000Z",
    "title": "Yuga Labs CEO Is Learning Making NFT Games Is Hard",
    "url": "https://decrypt.co/202191/yuga-labs-ceo-learning-making-nft-games-hard",
    "description": "Following layoffs, Yuga Labs CEO Daniel Alegre admits that the Bored Ape Yacht Club maker has faced challenges executing on its gaming plans."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-18T19:00:00.000Z",
    "title": "MetaMask briefly pulled from App Store, British MPs argue for caution with NFT copyright infringement: Nifty Newsletter, Oct. 11–Oct. 17 ",
    "url": "https://cointelegraph.com/news/metamask-briefly-pulled-from-app-store-british-mps-argue-for-caution-with-nft-copyright-infringement-nifty-newsletter-oct-11-oct-17",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/ce7d4964-202b-43fd-8770-9828e2745281.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Decentraland Foundation executive director Yemel Jardis believes the NFT market slump is not a sign of regression but maturity. </p>\n                    <p><p> ​​Welcome to the latest edition of Cointelegraph’s Nifty Newsletter. Keep reading to stay up-to-date with the latest stories on nonfungible tokens. Every Wednesday, the Nifty Newsletter informs and inspires you to dig deeper into the latest NFT trends and insights.</p><p>In this week’s newsletter, read about how a parliamentary committee in the U.K. has urged officials to take action on <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible token (NFT)</a> copyright infringement issues. Check out a Web3 executive’s thoughts on how the NFT market slump is actually a sign of maturity, and in other news, learn more about an incident in which MetaMask was briefly removed from Apple’s App Store.</p><h3>British MPs urge action on NFT copyright infringement, crypto fan tokens</h3><p>A bipartisan parliamentary committee recently urged officials in the United Kingdom to take action to protect creators from the possibilities of copyright violations stemming from NFTs. The committee also asked the government to address the potential harms of sporting groups issuing digital assets. </p><p>According to the committee members, the “most pressing issue” is the risk to the intellectual property rights of artists due to the ease and speed at which NFTs can be minted. </p><p><a href=\"https://cointelegraph.com/news/uk-committee-urges-nft-rules-sport-fan-crypto-token-ban\"><strong>Continue reading</strong></a></p><h3>NFT market slump shows it’s maturing toward “genuine utility,” execs argue</h3><p>The executive director of the Decentraland Foundation, Yemel Jardis, told Cointelegraph he believes that with more community education on NFTs, the focus will shift from speculative trading to genuine utility.</p><p>According to the executive, a steep collapse in the price of NFTs shouldn’t be seen as a sign of distress. Jardi said the NFT market has not “regressed” — rather, “it’s maturing.”</p><p><a href=\"https://cointelegraph.com/news/nft-price-decline-just-maturing-decentraland\"><strong>Continue reading</strong></a></p><h3>Apple briefly pulls MetaMask from App Store</h3><p>The Ethereum wallet MetaMask, popular among NFT collectors, was removed from Apple’s App Store for several hours on Oct. 14. This raised concerns over a complete removal from the marketplace.</p><p>At the time, Apple users were also unable to download the application from the MetaMask website. Some speculated that Apple’s terms of service were behind the app’s disappearance. According to the App Store’s rules, apps running “unrelated background processes,” such as cryptocurrency mining, are prohibited.</p><p><a href=\"https://cointelegraph.com/news/apple-briefly-pulls-metamask-from-app-store\"><strong>Continue reading</strong></a></p><p><a href=\"https://cointelegraph.com/podcasts/nft-steez\"><strong>CHECK OUT COINTELEGRAPH’S </strong><strong><em>NFT STEEZ</em></strong><strong> PODCAST</strong></a></p><template data-name=\"subscription_form\" data-type=\"nifty_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-18T18:58:02.000Z",
    "title": "Bitcoin price holds $28K range as institutional investor maneuvering boosts sentiment  ",
    "url": "https://cointelegraph.com/news/bitcoin-price-holds-as-institutional-investor-boosts-sentiment",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/6e689e2e-c3ac-4628-a4a9-5af11c4f04fd.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Comments from institutional investors and amendments to the spot Bitcoin ETF applications could be behind the recent improvement in investor sentiment.</p>\n                    <p><p>Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC)</a> price continues to show strength this week by hitting an intra-day high at $28,516 even as macroeconomic headwinds in the United States continue to weigh on investor sentiment. It’s possible that a certain degree of BTC’s price stability can be attributed to increasing institutional activity and positive institutional investor interest in Bitcoin. </p><p>On Oct. 17, Fidelity Investments, a large asset management institution, amended their proposed spot Bitcoin ETF with the Securities and Exchange Commission (<a href=\"https://www.sec.gov/Archives/edgar/data/1852317/000119312523257755/d375081ds1a.htm\" target=\"_blank\" rel=\"noopener nofollow\">SEC</a>). The ETF called the Wise Origin Bitcoin Trust, updated and outlined how Fidelity plans to protect customers’ Bitcoin in custody accounts and revealed risks associated with the unstable regulatory landscape of cryptocurrencies.</p><p>Fidelity is following in the footsteps of other large institutions like ARK Invest and Invesco, which also amended their spot Bitcoin ETF filings. <a href=\"https://www.sec.gov/edgar/search/#d549524ds1a.htm\" target=\"_blank\" rel=\"noopener nofollow\">ARK</a> Invest refiled on Oct. 11, with <a href=\"https://www.sec.gov/edgar/search/#d507893ds1a.htm\" target=\"_blank\" rel=\"noopener nofollow\">Invesco</a> refiling on Oct. 13. </p><p>These actions suggest an ongoing dialogue between ETF applicants and the SEC, something ARK Invest CEO Cathie Wood seemed to verify this week on ETF Edge stating,</p><blockquote>“We responded to the SEC request for information surrounding our Bitcoin filing. The SEC chose to engage, which is a change in behavior.”</blockquote><p>Wood’s comment combined with Fidelity's filing is providing <a href=\"https://cointelegraph.com/news/ark-invest-amended-bitcoin-etf-filing-sign-future-approval\">renewed optimistic sentiment</a> on Bitcoin. Grayscale’s Bitcoin investment vehicle, <a href=\"https://cointelegraph.com/news/grayscale-gbtc-discount-falls-spot-bitcoin-etf-approval\">Grayscale Bitcoin Trust</a> (GBTC) which is similar to an ETF, has reached its lowest net asset value (NAV) premium discount since Dec. 9, 2021. </p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/a8614a75-cd6f-4c74-b9ac-1ddf376ad194.png\"  /><figcaption style=\"text-align: center;\"><em>GBTC premium. Source: Coinglass</em></figcaption></figure><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/magazine/crypto-zero-knowledge-voting-finance/\"><strong><em>Beyond crypto: Zero-knowledge proofs show potential from voting to finance</em></strong></a></p><p>Grayscale was <a href=\"https://cointelegraph.com/news/grayscale-wins-sec-lawsuit\">dealt a victory</a> against the SEC on Oct. 14, when reportedly the commission will not appeal an Aug. 29 ruling by the U.S. Court of Appeals which means their ETF will now have to be reviewed. </p><p>Despite all of the momentum, the SEC continues to <a href=\"https://cointelegraph.com/news/sec-delays-decisions-on-crypto-et-fs-law-decoded-sept-25-oct-2\">delay Bitcoin ETF</a> approval. </p><p>Certain analysts anticipate that when approval is granted, it could potentially add at least $600 billion in new demand for Bitcoin. During an Oct. 16 interview on Fox Business, BlackRock CEO Larry Fink spoke about Bitcoin after <a href=\"https://cointelegraph.com/news/clarification-sharing-false-spot-bitcoin-etf-news\">false spot BTC</a> approval news sparked a rally,</p><blockquote>“I think the rally is about a flight to quality, with all the issues around the Israeli war now, [and] global terrorism. And I think there are more people running to a flight to quality — whether that is in Treasurys, gold, or crypto, depending on how you think about it.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/how-high-can-bitcoin-price-go-2024\"><strong><em>How high can Bitcoin price go by 2024?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-18T18:40:28.000Z",
    "title": "U.S. Treasury sanctions Gaza-based crypto broker alleged to have facilitated $25 million in crypto transactions since 2015",
    "url": "https://cryptoslate.com/u-s-treasury-sanctions-gaza-based-crypto-broker-alleged-to-have-facilitated-25-million-in-crypto-transactions-since-2015/",
    "description": "<p>The U.S. Treasury Department&#8217;s Office of Foreign Assets Control (OFAC) has sanctioned  Gaza-based crypto broker &#8220;Buy Cash Money and Money Transfer Company (Buy Cash)&#8221; and its operator, Ahmed M. M. Alaqad, for facilitating crypto transactions for Hamas, according to an Oct. 18 statement. Buy Cash is a Gaza-based business that provides money transfer and cryptocurrency [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/u-s-treasury-sanctions-gaza-based-crypto-broker-alleged-to-have-facilitated-25-million-in-crypto-transactions-since-2015/\">U.S. Treasury sanctions Gaza-based crypto broker alleged to have facilitated $25 million in crypto transactions since 2015</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-18T19:00:12.000Z",
    "title": "Bank of America’s unrealized losses hit $131.6 billion on securities",
    "url": "https://www.cryptopolitan.com/bank-of-americas-unrealized-losses-hit-131b/",
    "description": "One of the world&#8217;s largest financial institutions, Bank of America, has recently reported its unrealized losses that total a staggering $131.6 billion on securities. The record has sent shockwaves in the financial industry as investors grow cautious and worried.&#160; The amount is increasing according to recent data sources. However, the Bank of America is still ... <a title=\"Bank of America&#8217;s unrealized losses hit $131.6 billion on securities\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bank-of-americas-unrealized-losses-hit-131b/\" aria-label=\"More on Bank of America&#8217;s unrealized losses hit $131.6 billion on securities\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-18T19:00:03.000Z",
    "title": "When Will Bitcoin Price Reach $1,000,000? Pundit Lays Out A Timeline",
    "url": "https://www.newsbtc.com/news/bitcoin/bitcoin-1000000-timeline/",
    "description": "Since the Bitcoin Price crossed $50,000 back in the 2021 bull market, there have been speculations on when the price will hit $100,000, and on the other extreme end, $1,000,000. Over time, various analysts and pundits have put forward their forecasts, but the most recent of these is from budding economist Alessandro Ottaviani who believes BTC could hit the $1 million mark in the next three years. Bitcoin Price On Its Way To $1 Million Ottaviani starts out his X (formerly Twitter) post by pointing out that the Bitcoin market cap had climbed rapidly following fake news of a Spot Bitcoin ETF approval. Now, recall that on Monday, media outlet Cointelegraph made a post on X saying that the US Securities and Exchange Commission (SEC) had approved the BlackRock iShares Spot Bitcoin ETF filing. Related Reading: BlackRock Reacts To False Bitcoin Spot ETF Approval News In A Positive Way Following this, the price of Bitcoin surged above $30,000 and in a matter of minutes, over $50 billion was added to the crypto’s market cap, as Ottaviani points out. Going by BTC’s reaction to this news which eventually turned out to be fake, the analyst was able to draw a parallel for what might happen when Spot Bitcoin ETFs are approved for real. Main take away of today: Bitcoin makrket Cap went up by more than $50 billion in minutes, and very likely the money flowing into Bitcoin were less than $500 million (ratio 100:1) A former Blackrock Director said that we can expect $150-200 billion flowing into Bitcoin in 3… — Alessandro Ottaviani (@AlexOttaBTC) October 16, 2023 Ottaviani points out that this $50 billion increase in market cap came from an around $500 million injection into the market, meaning the market cap rose at a ratio of 100:1. Thus, going by what BlackRock Director and CEO Larry Fink said about a Spot ETF triggering a $150 billion to $200 billion inflow into the asset, Ottaviani explains that this would put BTC’s market cap at $21 trillion. At a $21 trillion market cap, the price of each BTC would be going for $1 million. Now, about when this might happen, Ottaviani reverts to Fink’s statement. When Fink made his forecast that $150-$200 billion could flow into Bitcoin, he said that this could happen over a three-year period. So if a Spot Bitcoin ETF is approved in 2024 as Bloomberg analysts believe, then the price of Bitcoin could reach this $1 million mark in 2027-2028 if all goes as planned. “Surely on the way up there will be many people selling, but this is already directionally clear how much could be the effect of the BTC ETFs being approved,” Ottaviani said in the X post. BTC still miles away from $1,000,000 &#124; Source: BTCUSD on Tradingview.com Other $1 Million Predictions For BTC Ottaviani is only the most recent in a long line of market participants and crypto enthusiasts who have predicted that the price of Bitcoin would reach $1 million. Some notable personalities who believe it will reach this level include ARK Invest CEO Cathie Wood, Coinbase CTO Balaji Srinivasan, and finance author Robert Kiyosaki. Cathie Wood who has been a very vocal proponent of Bitcoin said last year that she expects the price of BTC to hit $1 million by 2030. Due to this belief, Wood’s investment firm ARK Invest has been heavily investing across the crypto space, buying hundreds of thousands of shares in the Grayscale Bitcoin Trust, as well as Coinbase stock. Related Reading: Bitcoin Whale Addresses See Unprecedented Jump, Is $30,000 Possible? Next on the list is Coinbase CTO Balaji Srinivasan who made a bet in June 2023 that the BTC price would reach $1 million. Srinivasan pointed to “hyperbitcoinization” as the reason behind this. However, Srinivasan’s forecast was on a much shorter timeframe (90 days) and didn’t play out as predicted. Last but not least is finance author Robert Kiyosaki. Kiyosaki has been sounding the alarm of a potential collapse of the US dollar and has presented the likes of Gold, Silver, and Bitcoin as good alternatives to hedge against this potential collapse. In August, Kiyosaki said in an interview that if the economy were to collapse, Bitcoin could reach $1 million, while Gold and Silver could rise to $75,000 and $60,000, respectively. Featured image from Blockchain Companies, chart from Tradingview.com"
  },
  {
    "source": "Coin Edition",
    "date": "2023-10-18T18:58:00.000Z",
    "title": "John Deaton Optimistic That XRP Will Break Ties With Ripple Soon",
    "url": "https://coinedition.com/john-deaton-optimistic-that-xrp-will-break-ties-with-ripple-soon/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/07/Since_Thursday_when_the_@Ripple_XRP_decision_by_Judge_Torres_was.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/07/Since_Thursday_when_the_@Ripple_XRP_decision_by_Judge_Torres_was.jpg 730w, https://coinedition.com/wp-content/uploads/2023/07/Since_Thursday_when_the_@Ripple_XRP_decision_by_Judge_Torres_was-300x169.jpg 300w, https://coinedition.com/wp-content/uploads/2023/07/Since_Thursday_when_the_@Ripple_XRP_decision_by_Judge_Torres_was-311x175.jpg 311w, https://coinedition.com/wp-content/uploads/2023/07/Since_Thursday_when_the_@Ripple_XRP_decision_by_Judge_Torres_was-380x214.jpg 380w, https://coinedition.com/wp-content/uploads/2023/07/Since_Thursday_when_the_@Ripple_XRP_decision_by_Judge_Torres_was-696x392.jpg 696w, https://coinedition.com/wp-content/uploads/2023/07/Since_Thursday_when_the_@Ripple_XRP_decision_by_Judge_Torres_was-124x70.jpg 124w, https://coinedition.com/wp-content/uploads/2023/07/Since_Thursday_when_the_@Ripple_XRP_decision_by_Judge_Torres_was-159x89.jpg 159w, https://coinedition.com/wp-content/uploads/2023/07/Since_Thursday_when_the_@Ripple_XRP_decision_by_Judge_Torres_was-255x143.jpg 255w, https://coinedition.com/wp-content/uploads/2023/07/Since_Thursday_when_the_@Ripple_XRP_decision_by_Judge_Torres_was-440x247.jpg 440w, https://coinedition.com/wp-content/uploads/2023/07/Since_Thursday_when_the_@Ripple_XRP_decision_by_Judge_Torres_was-414x233.jpg 414w, https://coinedition.com/wp-content/uploads/2023/07/Since_Thursday_when_the_@Ripple_XRP_decision_by_Judge_Torres_was-293x165.jpg 293w, https://coinedition.com/wp-content/uploads/2023/07/Since_Thursday_when_the_@Ripple_XRP_decision_by_Judge_Torres_was-375x211.jpg 375w, https://coinedition.com/wp-content/uploads/2023/07/Since_Thursday_when_the_@Ripple_XRP_decision_by_Judge_Torres_was-328x185.jpg 328w, https://coinedition.com/wp-content/uploads/2023/07/Since_Thursday_when_the_@Ripple_XRP_decision_by_Judge_Torres_was-144x81.jpg 144w, https://coinedition.com/wp-content/uploads/2023/07/Since_Thursday_when_the_@Ripple_XRP_decision_by_Judge_Torres_was-123x70.jpg 123w, https://coinedition.com/wp-content/uploads/2023/07/Since_Thursday_when_the_@Ripple_XRP_decision_by_Judge_Torres_was-129x73.jpg 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>John E Deaton, a pro-cryptocurrency lawyer, shared in an X post yesterday that he looks forward to the day when XRP is able to establish an identity of itself, apart from Ripple. This was a response to a video created by Coin Bureau, wherein Guy revealed that “Ripple’s XRP” is a newly-added payment method within [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://coinedition.com/john-deaton-optimistic-that-xrp-will-break-ties-with-ripple-soon/\">John Deaton Optimistic That XRP Will Break Ties With Ripple Soon</a> appeared first on <a rel=\"nofollow\" href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-18T18:45:33.000Z",
    "title": "Over 100 Binance Accounts Closed by Israeli Authorities Over Suspicion of Facilitating Funding to Hamas: Report",
    "url": "https://dailyhodl.com/2023/10/18/over-100-binance-accounts-closed-by-israeli-authorities-over-suspicion-of-facilitating-funding-to-hamas-report/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/10/binance-accounts-closed.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/10/binance-accounts-closed.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/10/binance-accounts-closed.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/10/binance-accounts-closed.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/10/binance-accounts-closed.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/10/binance-accounts-closed.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/10/binance-accounts-closed.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Top global crypto exchange Binance has reportedly closed more than 100 accounts in response to Hamas&#8217; deadly attack on Israel earlier this month. According to a recent report from the Financial Times, which cited &#8220;people directly familiar with Israel’s enforcement actions,&#8221; Israeli law enforcement agencies ordered the closures and seized millions worth of crypto in [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/18/over-100-binance-accounts-closed-by-israeli-authorities-over-suspicion-of-facilitating-funding-to-hamas-report/\">Over 100 Binance Accounts Closed by Israeli Authorities Over Suspicion of Facilitating Funding to Hamas: Report</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-10-18T18:41:15.000Z",
    "title": "Christine Lagarde Says New Digital Euro Will Meet ‘Highest Privacy Standards’ Project Moves Into Next Phase",
    "url": "https://dailyhodl.com/2023/10/18/christine-lagarde-says-new-digital-euro-will-meet-highest-privacy-standards-project-moves-into-next-phase/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2021/04/coming-soon-euro.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2021/04/coming-soon-euro.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2021/04/coming-soon-euro.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2021/04/coming-soon-euro.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2021/04/coming-soon-euro.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2021/04/coming-soon-euro.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2021/04/coming-soon-euro.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>European Central Bank (ECB) President Christine Lagarde says that the digital euro currently being worked on by the EU will adhere to strict privacy rules. In an announcement from the ECB, the central bank says that it&#8217;s moving into the &#8220;preparation phase&#8221; of its digital euro project following a decision from its Governing Council. The [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/10/18/christine-lagarde-says-new-digital-euro-will-meet-highest-privacy-standards-project-moves-into-next-phase/\">Christine Lagarde Says New Digital Euro Will Meet ‘Highest Privacy Standards’ Project Moves Into Next Phase</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]