[
  {
    "source": "Decrypt",
    "date": "2023-07-19T00:51:26.000Z",
    "title": "OpenAI Donates $5 Million to the American Journalism Project",
    "url": "https://decrypt.co/149106/openai-donates-5-million-to-the-american-journalism-project",
    "description": "The ChatGPT creator previously inked a deal with the Associated Press and Shutterstock."
  },
  {
    "source": "Decrypt",
    "date": "2023-07-19T00:45:09.000Z",
    "title": "Ex-Google Exec Predicts AI Sex Robots Could Replace Human Intimacy",
    "url": "https://decrypt.co/149093/former-google-exec-predicts-ai-sex-robots-replace-humans",
    "description": "Could AI be taking over our jobs—and replacing our sex partners?"
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-19T01:00:14.000Z",
    "title": "EVM vs SmartWeave: A comprehensive guide for consenting developers (Part 1)",
    "url": "https://cryptoslate.com/evm-vs-smartweave-a-comprehensive-guide-for-consenting-developers-part-1/",
    "description": "<p>For developers plying their trade in today’s rapidly scaling, blockchain-agnostic environment, deciding on the right approach to smart contract execution is paramount. In this piece, I’ll review EVM&#8217;s credentials (Ethereum Virtual Machine) and SmartWeave as two distinct options for developers to consider. Full disclosure, we’re going on a deep dive! Before we get started, here’s [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/evm-vs-smartweave-a-comprehensive-guide-for-consenting-developers-part-1/\">EVM vs SmartWeave: A comprehensive guide for consenting developers (Part 1)</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-19T00:47:00.000Z",
    "title": "Popular Crypto Analyst Predicts Bitcoin Price Range of $40,000-$50,000 Ahead of Halving",
    "url": "https://www.cryptoglobe.com/latest/2023/07/popular-crypto-analyst-predicts-bitcoin-price-range-of-40000-50000-ahead-of-halving/",
    "description": "As Bitcoin ($BTC) enthusiasts away the flagship cryptocurrency’s fourth block reward halving, expected around April 24, 2024, speculation is mounting about the potential impact on the cryptocurrency’s price. A popular anonymous analyst has now suggested Bitcoin could surge to $40,000 or even $50,000 ahead of it. Bitcoin’s price recently surged after the world’s largest asset […]\n"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-19T01:00:15.000Z",
    "title": "Bitcoin’s Worst Performance Period Ever: Is the Bottom In Sight?",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoins-worst-performance-period-ever-is-the-bottom-in-sight/",
    "description": "The ongoing bear market in Bitcoin is the longest in the network&#8217;s history, Glassnode data shows. According to trackers, the winter started on November 10, 2021, after prices peaked at over $69,000. As of July 18, 2023, BTC is trading at around the $30,000 level, down by almost 55% from its all-time high. However, despite the crash and bears persistence, recent developments suggest that the bottom might be in. Bitcoin Bear Run Over? Trackers reveal that this is the second largest phase when the coin&#8217;s prices have remained under water for this extended period. Between 2015 and 2016, which was still the formative stages of the coin when its liquidity was building up, the coin remained depressed for 386 days. BTC investors were also under pressure between 2018 and 2019 when prices drastically fell from 2017 peaks, crashing to as low as $4,000 at the depth of the crypto winter of 2018. The extended bear run from 2021 has been influenced by several fundamental factors, including the U.S. Federal Reserve&#8217;s intervention which saw the central bank take measures to tame inflation by raising interest rates in eight consecutive sessions. There have been fear factors relating to the collapse of major crypto firms, including 3AC, FTX, Voyager, and the spectacular depegging and crash of UST and LUNA. Following the collapse of FTX in November, Bitcoin prices fell to all low as $15,800 before expanding, roughly doubling in the first half of 2023. Hash Rate And BlackRock ETF Application Despite relatively low Bitcoin prices and the continuation of the bear run, the network&#8217;s hash rate is trending at a near-all-time high. As of July 18, Bitcoin&#8217;s hash rate stood at over 385 EH/s, retracing from all-time highs of 465 EH/s recorded in late June 2021.  Related Reading: Litecoin Whales Deposit Big To Exchanges, Bearish Sign? Historically, prices and hash rate are directly correlated but falling coin prices didn&#8217;t dissuade miners from buying new gear and plugging into the network, fortifying it against attacks.  The hash rate measures processing power channeled to a proof-of-work network like Bitcoin. The higher it is, the more secure the blockchain is against potential attackers. Reports on July 16 indicated that the United States Securities and Exchange Commission (SEC) had accepted BlackRock&#8217;s application for a spot Bitcoin exchange-traded fund (ETF). This is a significant milestone for the Bitcoin-related proposal and may strengthen prices if the regulator eventually approves the derivative, allowing institutions to have exposure. Presently, Bitcoin is teetering close to $30,000 and looks weak. Bulls have been unable to close above $32,000 despite BlackRock&#8217;s reapplication of the spot Bitcoin ETF. Related Reading: ARK Invest CEO Says Firm Is Still Bullish On Coinbase Despite Selling COIN Stocks BlackRock is the world&#8217;s largest asset manager, with over $9.4 trillion in assets. The firm filed for its first spot Bitcoin ETF in June, only for changes to the made and the application to be updated before being resubmitted. It remains to be seen if the approval of an ETF marks the bottom for Bitcoin and the nascent asset class. Feature image from Canva, chart from TradingView"
  }
]