[
  {
    "source": "Cointelegraph",
    "date": "2023-07-27T20:53:05.000Z",
    "title": "Why is Jerome Powell gaslighting us about the odds of recession?",
    "url": "https://cointelegraph.com/news/jerome-powell-misleading-recession",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/c5009693-c2c6-4fac-ad41-c5d90ed57eab.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Economic data seems to indicate an economic slowdown is inevitable. So why is Fed Chairman Jerome Powell trying to gaslight Americans?</p>\n                    <p><p>Over the last 12 months, market analysts and commentators have relentlessly predicted that the United States is heading for a recession. However, the U.S. economy has been remarkably resilient and defied the forecasts. Indeed, we now have the U.S. Federal Reserve discounting a recession from its current modeling, <a href=\"https://cointelegraph.com/news/bitcoin-traders-fed-powell-fomc-hikes-rates-22-year-highs\">as Fed Chair Jerome Powell emphasized</a> at the Fed’s July press conference. </p><p>There is, however, much more to this story.</p><p>For many, the fastest increases in interest rates ever, record-high inflation and the unexpected banking collapses of Silvergate Bank, Signature Bank, First Republic and, most recently, Pacific Western are major reasons to cite indicating a recession is close.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/the-federal-reserve-s-pursuit-of-a-reverse-wealth-effect-is-undermining-crypto\"><strong><em>The Federal Reserve’s pursuit of a ‘reverse wealth effect’ is undermining crypto</em></strong></a></p><p>The technical definition of a recession is two straight quarters of declining gross domestic product (GDP). Still, the real test is a significant decline in economic activity that spreads across the economy and includes employment, consumer spending, retail sales and industrial production.</p><p>U.S. GDP declined in both the first and second quarters of 2022. The drop can be attributed to the changes in trade and business inventories, which don’t necessarily reflect underlying economic health. Moreover, the labor market remains strong, consumer confidence is improving, and retail sales are increasing again. These are all signs that the economy remains strong, and there is division on whether a recession is inevitable in this unusual economic environment.</p><p>In the third quarter of 2022, GDP growth was 3.2%; in Q4, 2.6%; and in Q1, 2%. As such, we were already in a technical recession. The latest GDP numbers released on July 27 show the U.S. economy grew by 2.4% in the second quarter of this year — an uptick.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/030d2dfe-4dc2-4826-abeb-8f04fcfbc6ee.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>GDP growth in the United States from 2013 through the first quarter of 2023. Source: Federal Reserve Bank of St. Louis</em></figcaption></figure><p>Does that mean we’re out of the woods? As ever, it’s just not that simple. It seems clear we are already in a technical recession. Yet, the healthy economic picture doesn’t track with this. Are we in a whole new economic territory?</p><h2>Shrinking buffers </h2><p>During COVID-19, consumers shored up around $2.5 trillion in excess savings from a combination of hunkering down at home and trillions of dollars in Federal stimulus packages designed to keep workers afloat despite layoffs and businesses closing. However, that cushion has been slowly depleted to around $1.5 trillion due to high, rapidly increasing interest rates and stubborn inflation, according to Moody Analytics.</p><p>Nonetheless, there is still a lot of pent-up demand among consumers. Recently, we’ve seen a surge in spending, while consumers are now carrying the highest levels of household debt ever. Along with increasing housing prices — despite rising interest rates — and companies holding back capital expenditure due to the increasing cost of capital, this debt pile is piling pressure on the U.S. consumer.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-07/936ca7a9-7678-438f-9eff-ffc90faa09e2.jpg\"  alt=\"\"  title=\"\"  /><figcaption style=\"text-align: center;\"><em>Household debt service payments as a percent of disposable personal income, 2013–2023. Source: Federal Reserve Bank of St. Louis</em></figcaption></figure><p>As consumer spending makes up 70% of U.S. GDP, it is vital it stays healthy if the U.S. is to avoid a recession. Employment is also a key indicator to watch right now, and the rate of unemployment remains low at 3.6% while wage increases are at 5.7%, but still growing. All this suggests that while the economy is losing steam, we are not in a recession yet.</p><p>Most analysts are, though, still expecting a recession in the second half of the year. The expectation is that the tightening of monetary policy that has been implemented over the past year has a long lag effect that hasn’t been fully accounted for. Indeed, Raphael Bostic at the Atlanta Fed estimates it could take 18 to 24 months to see the full effect of this tightening cycle in the economy. </p><h2>Yields don’t lie</h2><p>At the same time, banks are pulling back lending due to the deposit runs that led to the collapse of several regional banks. We also see an inverted yield curve appearing — one of the most reliable indicators of a coming recession.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/what-will-drive-crypto-s-likely-2024-bull-run\"><strong><em>What will drive crypto’s likely 2024 bull run?</em></strong></a></p><p>Normally, interest rates are higher for longer-term bonds than short-term ones, as investors need to be rewarded more as their money is locked in for longer periods. Right now, though, the yield on a two-year Treasury bond is well above that for 10-year bonds and has been for quite some time. This has been a consistent signal of a recession, as investors move money into safer longer-term assets when the economic outlook looks worse, which pushes their prices up and yields down.</p><p>Beyond this, as much as headline Consumer Price Index (CPI) inflation has been declining, core inflation (which excludes volatile energy and food prices) remains hot at 4.8% — well above the Fed’s 2% target. While the cost of goods has fallen, the price of services remains high, driven by the tight labor market.</p><h2>Growing debt</h2><p>Although higher interest rates have helped bring down inflation, the higher they go and the longer they stay high, the more expensive it gets for companies to invest in innovation and growth. While S&amp;P 500 earnings currently remain strong, eventually this will filter down to the bottom line.<strong><em></em></strong></p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/jerome-powell-is-prolonging-our-economic-agony\"><strong><em>Jerome Powell is prolonging our economic agony</em></strong></a></p><p>Crucially, higher interest rates also make it more difficult for U.S. consumers to service their debt. Be it credit card balances, mortgage loans or auto loans, all debt is becoming more expensive and reducing disposable income. This will negatively impact the consumer spending that is so vital for the economy and then, in turn, earnings and stock prices for companies.</p><p>But retail sales are up and have been on the increase month on month since January 2023. This suggests consumers aren’t slowing down yet and that the U.S. recession might be further into the future than we expect. Ultimately, we cannot deny that the labor market is still strong, and consumer confidence is buoyant for the second month in a row now. This is across all age groups and income segments and is most likely driven by the tight labor market and headline CPI inflation coming down.</p><h2>Do you feel lucky, JP?</h2><p>With the Fed having raised interest rates by another 25 basis points to the highest level in 22 years, we are at a pivotal moment. The question is whether hiking will continue at the Fed’s September meeting. After 12 months of solid agreement among policymakers, cracks are appearing in terms of how much more to hike and how long to hold elevated levels. </p><p>While markets have been skeptical, an increasing segment of Wall Street seems to believe the Fed is likely to avoid a recession and deliver a “soft landing.” However, as the Atlanta Fed suggests, the long-term impact of the fastest increase in interest rates in history will take considerable time to come through.</p><p>The FOMC seems set on its path, however, and with inflation likely to see some upward movement over the summer due to post-pandemic “revenge” spending among consumers, this could well lead to another rate hike in September. High and elevated rates will, though, impact capital expenditure. Indeed, access to capital is the single biggest concern for businesses today, with three-quarters of small and medium-sized enterprises already struggling.</p><p>In the face of this mounting pressure, an economic slowdown seems inevitable. Indeed, Powell stated after the July Fed meeting that softening, “below trend” growth was even necessary to get inflation under control.</p><p>Now, then, the only question is around the rate of that softening, which is highly dependent on what the Fed does next.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Oliver Rust </strong>is the head of product at Truflation, an inflation data aggregator. He served previously as the CEO of Engine Insights and as global senior vice president of financial services for The Nielsen Company.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph. </em></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-27T21:00:17.000Z",
    "title": "Stronghold Expands Operation With $3M Acquisition of 2,000 Canaan Bitcoin Miners",
    "url": "https://news.bitcoin.com/stronghold-expands-operation-with-3m-acquisition-of-2000-canaan-bitcoin-miners/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/minersssd-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Stronghold Expands Operation With $3M Acquisition of 2,000 Canaan Bitcoin Miners\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/minersssd-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/minersssd-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/minersssd-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/minersssd-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/minersssd-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/minersssd-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/minersssd.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Stronghold Digital Mining announced Thursday it has acquired 2,000 application-specific integrated circuit (ASIC) bitcoin mining rigs from Canaan. The new machines, costing $3 million, will be delivered to Stronghold&#8217;s Panther Creek facility in the third quarter. Stronghold Digital Mining Acquires 2,000 Avalon A1346 Bitcoin Miners Although 2022 wasn&#8217;t an exceptional year for bitcoin mining operations, [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T21:09:01.000Z",
    "title": "Avalanche Price Prediction 2023-2032: Time to Buy AVAX?",
    "url": "https://www.cryptopolitan.com/avalanche-price-prediction/",
    "description": "Avalanche Price Prediction 2023-2032 A quadrant chart by TrueUp (a tech recruitment firm) collated data from the job review platform Glassdoor — mapped out how crypto firms stack up regarding growth vs employee happiness. The chart suggested the “happiest” workers in the industry came from Ava Labs, the team behind the Avalanche blockchain. Here&#8217;s a ... <a title=\"Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/avalanche-price-prediction/\" aria-label=\"More on Avalanche Price Prediction 2023-2032: Time to Buy AVAX?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T20:52:45.000Z",
    "title": "Arbitrum Price Prediction 2023 – 2032: Can ARB Reach $100?",
    "url": "https://www.cryptopolitan.com/arbitrum-price-prediction/",
    "description": "Arbitrum Price Prediction 2023 &#8211; 2032 As the world anticipates improvements, a third alternative has emerged: scaling solutions. These innovative software applications operate on top of a blockchain&#8217;s base layer, such as Ethereum, to enhance its performance. Arbitrum is a prime example of a scaling solution recently gaining popularity among Ethereum users for executing their ... <a title=\"Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/arbitrum-price-prediction/\" aria-label=\"More on Arbitrum Price Prediction 2023 &#8211; 2032: Can ARB Reach $100?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-27T20:50:06.000Z",
    "title": "Gary Gensler continues to be bitter over crypto – The latest",
    "url": "https://www.cryptopolitan.com/gensler-continues-to-be-bitter-over-crypto/",
    "description": "The cryptocurrency sector remains firmly under the watchful eye of Gary Gensler, the chairman of the U.S. Securities and Exchange Commission (SEC), whose concerns over industry-wide fraud and compliance violations are far from being appeased. The SEC boss&#8217;s disquiet resurfaces following a significant court ruling concerning XRP&#8217;s security status, a judgment that contradicts the SEC&#8217;s ... <a title=\"Gary Gensler continues to be bitter over crypto &#8211; The latest\" class=\"read-more\" href=\"https://www.cryptopolitan.com/gensler-continues-to-be-bitter-over-crypto/\" aria-label=\"More on Gary Gensler continues to be bitter over crypto &#8211; The latest\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-27T21:00:14.000Z",
    "title": "BNB Chain’s Q2 Performance Sparks Optimism Amidst Regulatory Uncertainty",
    "url": "https://www.newsbtc.com/analysis/bnb/bnb-chains-q2-performance-sparks-optimism-amidst-regulatory-uncertainty/",
    "description": "Binance Smart Chain (BNB) has seen significant growth in its daily active addresses and transactions in the second quarter of 2023, according to a report by blockchain analytics firm Messari.  The increase in activity was primarily driven by LayerZero, a cross-chain messaging protocol that enables lightweight and efficient communication between different networks. However, BNB&#8217;s market cap declined by 25.2% after the US Securities and Exchange Commission (SEC) alleged that BNB is a security in its regulatory actions against Coinbase and Binance.  Despite this, the total cryptocurrency market cap increased by 2% quarter-over-quarter (QoQ), primarily driven by Bitcoin (BTC) and Ethereum (ETH). BNB Q2 Revenue Declines Per the report, BNB&#8217;s revenue in BNB decreased by 6.1% QoQ as average transaction fees declined 25.5% after BSC validators voted to reduce gas fees from 5 to 3 Gwei.  Nevertheless, staking on the network remained stable. BNB Chain plans to increase the number of validators from 29 to 100 with a new validator reward model (balanced mining) and a validator reputation system. On the other hand, the Binance Smart Chain saw a decrease in total value locked (TVL) denominated in USD during Q2 2023, decreasing by 26.3%. However, TVL denominated in BNB was relatively flat at -2.8%. While PancakeSwap remained the most prominent protocol by TVL on the BNB Chain, its dominance decreased from 45% to 37% during the quarter, indicating a shift in TVL concentration towards a more robust DeFi ecosystem.  Related Reading: PEPE Whales Load Up Their Bags As Memecoin Jumps 13% In the stablecoin space, Binance Smart Chain has the third-highest total stablecoin market cap of approximately $5.7 billion, trailing behind Ethereum and TRON. The BUSD market lost some of its users after regulators forced Paxos to cease the issuance of BUSD, resulting in a decline of approximately 54% in the BUSD market cap on the BNB Chain during Q1. Developer engagement also showed positive growth during Q2, with the number of unique contracts verified growing by 51.9% QoQ, and full-time developers on the BNB Chain increasing from 130 to 133 QoQ. Despite the decline in TVL denominated in USD, the BNB Chain&#8217;s continued expansion of its DeFi ecosystem and the shift in TVL dominance towards a more diverse range of protocols signal a promising outlook for the ecosystem&#8217;s future. Binance Smart Chain Outlines Ambitious Plans For 2023 Despite the regulatory challenges, BNB Chain has laid out robust plans for 2023, including increasing the network&#8217;s gas limit to boost throughput and reducing the data footprint through state offload.  BNB Chain also plans to further decentralize by introducing a new validator reward model and a validator reputation system to increase the number of validators from 29 to 100. The roadmap highlights other initiatives, including increased scalability through modular architecture, creating a data storage network, and implementing consumer protections provided by blockchain security firms.  Related Reading: Fed’s No Recession Claim Boosts Bitcoin And Crypto, Historical Data Contradicts In Q2, BNB Chain validators and projects discussed the integration of miner extractable value (MEV) within the BSC network, with some validators piloting MEV in various formats. With its wide-reaching plans, BNB Chain aims to remain competitive for the rest of 2023. While the regulatory challenges faced by Binance and Binance.US directly impact the entire crypto ecosystem, Binance and BNB Chain are separate entities. Binance, Binance Labs, and the Binance Launchpad help grow the BNB Chain ecosystem through asset listings, liquidity provision, investment, and project launches.  The outcomes of the ongoing lawsuits are unpredictable, and adverse outcomes could slow the advancement of the BNB Chain ecosystem and bring continued volatility to its native BNB token. Featured image from Unsplash, chart from TradingView.com "
  }
]