[
  {
    "source": "CryptoGlobe",
    "date": "2023-08-19T13:02:28.000Z",
    "title": "Is Bitcoin’s Bubble About to Burst? Bloomberg Analyst’s Take on the Looming Recession",
    "url": "https://www.cryptoglobe.com/latest/2023/08/is-bitcoins-bubble-about-to-burst-bloomberg-analysts-take-on-the-looming-recession/",
    "description": "In a recent interview with prominent crypto analyst and trader Scott Melker (aka “Wolf of All Streets”), Mike McGlone, Senior Macro Strategist at Bloomberg Intelligence, shared insights regarding the impending liquidity crisis and its potential impact on the broader economy and Bitcoin. Here were the key takeaways: Liquidity Concerns: McGlone describes the current situation as the most […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-08-19T12:55:44.000Z",
    "title": "Bitcoin, Ethereum Technical Analysis: BTC, ETH Seek Support Level, Following Worst Selloff Since FTX Crisis ",
    "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-eth-seek-support-level-following-worst-selloff-since-ftx-crisis/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2192114485-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Bitcoin, Ethereum Technical Analysis: BTC, ETH Seek Support Level, Following Worst Selloff Since FTX Crisis \" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2192114485-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2192114485-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2192114485-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2192114485-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2192114485-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2192114485-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/08/shutterstock_2192114485.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Bitcoin started the weekend trading below $26,000, as the cryptocurrency had its worst week since the collapse of FTX. Market sentiment was bearish following reports that Spacex liquidated its bitcoin holdings. Ethereum remains below $1,700. Bitcoin Bears continued to circle bitcoin (BTC) to start the weekend, as the cryptocurrency had its biggest one-day decline since [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-19T13:08:26.000Z",
    "title": "Friend.tech secures seed round funding from Paradigm, distributes 100M points in airdrop",
    "url": "https://www.cryptopolitan.com/friend-tech-secures-seed-round-funding/",
    "description": "Friend.tech, a decentralized social platform, secured seed round funding from Paradigm earlier this year. This partnership with the venture capital firm aims to develop innovative online social interaction tools jointly. Furthermore, friend.tech recently concluded its inaugural Friday Points Airdrop, benefiting 44,000 users. As part of its six-month beta phase, the platform had previously disclosed plans ... <a title=\"Friend.tech secures seed round funding from Paradigm, distributes 100M points in airdrop\" class=\"read-more\" href=\"https://www.cryptopolitan.com/friend-tech-secures-seed-round-funding/\" aria-label=\"More on Friend.tech secures seed round funding from Paradigm, distributes 100M points in airdrop\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-19T13:02:54.000Z",
    "title": "Binance In Murky Waters? Analyst Explains Why BNB Must Stay Above This Price",
    "url": "https://www.newsbtc.com/binance/binance-in-murky-waters-analyst-explains-why-bnb-must-stay-above-this-price/",
    "description": "The last few days have been eventful for the crypto market following a major crash on Thursday that resulted in the loss of $1 billion in market cap. In another unnerving development, it appears that Binance, the world’s largest exchange, may be in some form of trouble as a crypto analyst shares some insight on the company. Related Reading: Binance To Delist These Three Tokens In August Due To Non-Compliance Binance To Record Heavy Losses If BNB Trades Below $212, Analyst Says According to an X post on Friday, a crypto analyst with the name MartyParty painted a rather gloomy picture for Binance and its 150 million users. The analyst began by stating there was a reason the Binance Coin (BNB) is yet to fall below $212.  After Bitcoin tumbled on Thursday, BNB, like most cryptocurrencies, also plummeted in value, falling from $231.85 to $215.02. Although the token did attempt a market rebound on Friday, it soon fell again but found support at the $214 price zone.  MartyParty believes there is a reason why BNB is gaining support at these levels away from the $212 price mark. According to the analyst, the Binance exchange has a BNB-backed loan set to liquidate at $212.  Initially, the liquidation price for the said loan was $220, but it was later shifted in June. Although the analyst didn&#8217;t reveal the exact amount of this supposed loan, it seems massive as he stated it could lead to a “fatal margin call”  for the Binance exchange upon liquidation.  According to MartyParty, Binance is presently in “self-preservation mode” with its CEO Changpeng “CZ” Zhao selling BTC from a particular wallet to purchase TUSD, which in turn is invested in BNB to keep the Binance native token above $212.  In addition, this crypto analyst also made another interesting theory behind Binance’s supposed problem. He stated that US financial regulators are allegedly selling crypto holdings of the US Marshals Service in order to forcibly liquidate Binance’s loan position and kick CZ out of the crypto industry.  Related Reading: SEC’s Ethereum Futures ETF Approval: A Resounding Victory For ETH’s Security Status? Crypto Community Reacts To Worrying Post On Binance Following MartyParty’s post, there have been multiple reactions, with some crypto users siding with the analyst and nudging investors to dump the BNB token, saying that Binance is currently in a similar position as the FTX exchange in 2022. The FTX exchange collapsed in November 2022 due to a cascade of events triggered by reports which stated that Alameda Research &#8211; FTX’s trading arm &#8211; held an unusually large amount of FTT &#8211; FTX native cryptocurrency similar to Binance’s BNB.  During the hype of the debacle, an inside source revealed that Alameda Research was quietly collecting loans from FTX, which were collateralized by the FTT token.  However, on the other hand, some other crypto analysts have disagreed with MartyParty’s post calling it false and only aimed at spreading FUD. A particular analyst with the handle Alice on X has described the whole report as a “bizarre conspiracy theory” as the loan in question was not taken out by the Binance exchange but rather by Venus Protocol, a lending protocol on the BNB chain. For now, Binance, CZ, or the US government are yet to issue any statement confirming or denying the post by the analyst MartyParty.  At the time of writing, BNB is trading at $215.55, with a 1.59% decline in the last day, according to data from CoinMarketCap. Meanwhile, the token boasts a market cap of $33.16 billion and ranks as the fourth biggest cryptocurrency in the market. BNB trading at $215.1 on the daily chart &#124; Source: BNBUSD chart on Tradingview.com Featured image from Binance, chart from Tradingview."
  }
]