[
  {
    "source": "Crypto Briefing",
    "date": "2024-03-25T23:00:28.000Z",
    "title": "This Bitcoin halving cycle might play out differently: 21Shares report",
    "url": "https://cryptobriefing.com/bitcoin-halving-cycle-different-21shares-report/",
    "description": "An analytical perspective by 21Shares on the role of spot Bitcoin ETFs and the market sentiment compared to previous cycles."
  },
  {
    "source": "Bitcoin.com",
    "date": "2024-03-25T23:00:25.000Z",
    "title": "GAIMIN’s GMRX Listed on Cryptocurrency Exchanges",
    "url": "https://news.bitcoin.com/gaimins-gmrx-listed-on-cryptocurrency-exchanges/",
    "description": "<img width=\"468\" height=\"264\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240325_145307_140.png\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240325_145307_140-300x169.png 300w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240325_145307_140-190x107.png 190w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240325_145307_140-380x214.png 380w, https://static.news.bitcoin.com/wp-content/uploads/2024/03/img_20240325_145307_140.png 468w\" sizes=\"(max-width: 468px) 100vw, 468px\" />PRESS RELEASE. Zug, Switzerland, 25th March 2024 – GAIMIN, the world’s leader in delivering GPU-based decentralised data processing services through gaimin.cloud, today announces its GMRX utility token will be listed on cryptocurrency exchanges. GMRX is a utility token designed to support GAIMIN’s ecosystem, rewarding users for allowing their PC-based GPUs to participate in gaimin.cloud, processing [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-03-25T23:00:48.000Z",
    "title": "Is Jupiter’s Next Leg Up Coming? Crypto Analyst Weighs In As JUP Surges 13%",
    "url": "https://www.newsbtc.com/news/is-jupiters-next-leg-up-coming-crypto-analyst-weighs-in-as-jup-surges-13/",
    "description": "Jupiter (JUP) has had a remarkable month, with its price skyrocketing over 150% in the last 30 days. Amid the crypto market slowdown and some controversies, JUP’s performance has maintained momentum. Related Reading: Solana Tokens Among Top Gainers: JUP and WEN Soar Over 12%, WIF Hits New ATH Crypto Analyst Sees &#8220;Decent&#8221; Entry Spot For JUP Jupiter’s JUP started the month trading around $0.63 and has seen the price jump 106% in 25 days. The token’s performance this month showed sideways price action before climbing to a new support level twice, which could suggest that another price surge is possible despite the turbulent week. In an X post, renowned crypto analyst Altcoin Sherpa commented on JUP’s most recent performance as he wondered about the possibility of a leg up. $JUP: Wondering if next leg is coming for JUPITER&#8230;consolidation and looks ok + btc looks somewhat stable (for now). Might be a decent spot entry here. pic.twitter.com/uE8IHblbFY &#8212; Altcoin Sherpa (@AltcoinSherpa) March 25, 2024 The analyst shared JUP’s price chart, which displayed the token’s sideways movement inside the $1.12-$1.47 price range for the past few days. The chart shows that the consolidation phase started after the token’s price jumped and unsuccessfully tested the $1.50 resistance level on March 16. After a pullback to the $1.20 mark, JUP retested the resistance zone again on March 18, briefly reaching $1.60, but ultimately failed to maintain it. Following the unsuccessful attempts to climb, the price dipped even lower to the $1.10 support zone in the following days. Since then, JUP has bounced back, hovering between the $1.15-$1.25 zone. The recent price consolidation looks “ok,” according to the analyst. He further highlights Bitcoin’s current stability, seemingly suggesting to Sherpa that JUP could repeat its March trajectory. As a result, the analyst deems this moment as a “decent entry spot” for Jupiter’s token. Additionally, he has shown a positive sentiment towards JUP before, calling the token a “winner” that’s “gonna keep on winning.” winners gonna keep on winning. $PYTH and $JUP are some of the great ones. pic.twitter.com/nL4BmzxFJo &#8212; Altcoin Sherpa (@AltcoinSherpa) March 16, 2024 JUP’s Price Action Recently, JUP’s Community showed some concerns after its co-founder Meow announced a controversial decision. Meow revealed on X that Jupiter would donate the SLERF limit order and DCA fees to the token’s presale participants. This decision was taken without consulting the community, a crucial part of the project. After the criticism, Meow explained that &#8220;no JUP tokens were involved in the donation and, despite the turbulence in the community, JUP’s price didn’t seem to be affected.&#8221; It’s worth noting that Bitcoin’s price showed stabilization signs over the weekend, as highlighted by Sherpa. This matters as JUP followed BTC’s trajectory closely over the last week. As the chart below shows, the Solana-based token mimicked the moves of the flagship cryptocurrency. JUP and BTC's price performance over the last 7 days. Source: CoinGecko In the last 24 hours, Jupiter’s trading volume has surged 64.1%, with $214.7 million being traded. According to CoinMarketCap data, JUP’s market capitalization increased 8.5% in the past day, placing the token as the 65th largest cryptocurrency by this metric, with $1.77 billion. Despite the negative 3.5% performance in the past week, the token exhibits a significant 71.8% price jump in the biweekly timeframe. At the time of writing, JUP is trading at $1.33, a 13.2% surge in the last day. Related Reading: Social Media Storm Gives Dogecoin 14% Price Boost – Details Jupiter's performance in the 3-day chart. Source: JUPUSDT on Trading.view.com  Featured Image from Unsplash.com, Chart from TradingView.com"
  }
]