[
  {
    "source": "Cointelegraph",
    "date": "2023-07-24T10:32:21.000Z",
    "title": "Korean banks to research the stablecoins alternative ",
    "url": "https://cointelegraph.com/news/cds-vs-stablecoins-korean-banks-to-research-the-stablecoins-alternative",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/08144e78-a508-4c58-95ac-3773e6c63676.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Hana Bank plans to conduct research on certificate of deposit tokens, while Woori Bank’s research department has already recently released a report on them.</p>\n                    <p><p>Several private banks in South Korea are studying the potential of tokenized deposits technology, an alternative both to private stablecoins and central bank digital currencies (CBDCs). </p><p>According to the <a href=\"https://pulsenews.co.kr/view.php?sc=30800018&amp;year=2023&amp;no=562428\" target=\"_blank\" rel=\"noopener nofollow\">report</a> from Maeli Business News Korea, Hana Bank and Woori Bank, both private enterprises with headquarters in Seoul, showed interest in so-called “certificate of deposit” tokens (CDs). Essentially CDs are tokenized bank deposits, put on the blockchain. They can replace customary notes and deposits without disrupting the existing banking system. And, of course, CDs require identity verification of the same standards as any traditional bank service. </p><p>Hana Bank plans to conduct research on CD tokens, while Woori Bank’s research department has already recently released a <a href=\"https://www.wfri.re.kr/ko/web/research_report/research_report.php?idx=1158&amp;page_type=view&amp;mode=view&amp;page=&amp;page_limit=&amp;search_key=front&amp;search_category=37&amp;search_type=card\" target=\"_blank\" rel=\"noopener nofollow\">report</a> on them. </p><p>From the bankers’ perspective, it seems CDs have few disadvantages. As the report specifies, the interest in them stems from the anxiety that stablecoins failures of 2022 raised among the financial regulators. According to anonymous senior bankers, cited by the report:</p><blockquote>“CD tokens are perceived as stable from the banks’ perspective since they do not differ significantly from the current system.” </blockquote><p>Another important feature is CDs' potential compatibility with CBDCs. Both above-mentioned banks are participating in the proof of concept test for CBDC by the Bank of Korea. </p><p><strong><em><u>Related: </u></em></strong><a href=\"https://cointelegraph.com/news/south-korea-shinhan-bank-completes-stablecoin-remittance-pilot-asian-partners-hedera\"><strong><em>South Korean Shinhan Bank completes stablecoin remittance pilot with Asian partners</em></strong></a></p><p>In July, the Bank of Korea revealed its ongoing preparation for the <a href=\"https://cointelegraph.com/news/south-korea-central-bank-charts-future-payment-systems-cbdc\">potential introduction of a CBDC</a>, which included investigating the use of smart contracts, offline payments with near-field communications and cross-border payments.</p><p>The pilot program with 14 private banks is already functioning. However, there are still some technical issues — the system, which has been managing to handle 2,000 transactions per second, higher than most domestic payment systems can facilitate, slowed down as it reached capacity. The Bank of Korea is now looking into ways to improve the technical capacities of its project. </p><p><strong><em><u>Magazine: </u></em></strong><a href=\"https://cointelegraph.com/magazine/unique-amazing-south-koreas-cryptoverse/\"><strong><em>South Korea’s unique and amazing crypto universe</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-24T10:30:40.000Z",
    "title": "$SHIB: Shibburn Team Debunks Misconceptions About Token Burns and Shiba Inu (SHIB) Price Movement",
    "url": "https://www.cryptoglobe.com/latest/2023/07/shib-shibburn-team-debunks-misconceptions-about-token-burns-and-shiba-inu-shib-price-movement/",
    "description": "The team behind Shibburn, the $SHIB burn tracker, recently addressed a common misconception about token burns and price movement. They explained that despite “massive” burns, the price of $SHIB may not see significant movement without continuous and substantial token purchases to match the current purchase rate. The team clarified that the price of a token […]\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-24T10:10:18.000Z",
    "title": "U.S. National Debt Skyrockets by $57 Billion in Just 4 Days: Billionaire David Rubenstein Sounds the Alarm",
    "url": "https://www.cryptoglobe.com/latest/2023/07/u-s-national-debt-skyrockets-by-57-billion-in-just-4-days-billionaire-david-rubenstein-sounds-the-alarm/",
    "description": "The U.S. national debt is skyrocketing, with a staggering $57 billion increase recorded in just four days. According to data from the U.S. Department of the Treasury’s Bureau of the Fiscal Service, from June 1 to July 6, 2023, the U.S. Total Public Debt Outstanding surged by over $1 trillion and from July 17 to July 20, […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T10:26:11.000Z",
    "title": "ECB reveals its strategy with interest rate hikes",
    "url": "https://www.cryptopolitan.com/ecb-strategy-with-interest-rate-hikes/",
    "description": "The strategy of the European Central Bank (ECB) is coming into sharper focus as the institution is poised to elevate interest rates again this week. Amid this backdrop, the financial markets are keen on discerning the ECB&#8217;s course of action beyond July, a trajectory less clearly defined. For the past year, Eurozone interest rates have ... <a title=\"ECB reveals its strategy with interest rate hikes\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ecb-strategy-with-interest-rate-hikes/\" aria-label=\"More on ECB reveals its strategy with interest rate hikes\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T10:22:42.000Z",
    "title": "EthCC 2023 recap: a new era of interchain cooperation and decentralized development",
    "url": "https://www.cryptopolitan.com/ethcc-2023-recap-a-new-era-of-interchain-cooperation-and-decentralized-development/",
    "description": "The Ethereum community&#8217;s recent EthCC 2023 event witnessed various innovative projects and exciting new features. Polygon&#8217;s decentralized social networking platform, Lens Protocol, introduced its highly-anticipated V2 update, promising many cutting-edge enhancements. One of the standout features in Lens Protocol&#8217;s V2 update is “Open Actions.” This groundbreaking addition enables third-party smart contracts to engage in real-time ... <a title=\"EthCC 2023 recap: a new era of interchain cooperation and decentralized development\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ethcc-2023-recap-a-new-era-of-interchain-cooperation-and-decentralized-development/\" aria-label=\"More on EthCC 2023 recap: a new era of interchain cooperation and decentralized development\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-24T10:13:31.000Z",
    "title": "ETF assets in Australia soar, breach $100 billion",
    "url": "https://www.cryptopolitan.com/etf-assets-in-australia-soar-breach-100b/",
    "description": "A surge in the asset values of exchange-traded funds (ETFs) in Australia has taken the industry to new heights, breaching the $100 billion mark in the first half of this year. Defying earlier predictions and setting an all-time record, the ETF industry in the country has exhibited an explosive growth pace, dwarfing other local fund ... <a title=\"ETF assets in Australia soar, breach $100 billion\" class=\"read-more\" href=\"https://www.cryptopolitan.com/etf-assets-in-australia-soar-breach-100b/\" aria-label=\"More on ETF assets in Australia soar, breach $100 billion\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-07-24T10:10:48.000Z",
    "title": "XRP Price Analysis: Bull Flag Flashes As Whales Hit New High",
    "url": "https://www.newsbtc.com/news/ripple/xrp-price-bull-flag-whales-hit-new-high/",
    "description": "Since the summary judgment in the Ripple vs SEC case, XRP has captured the spotlight in the crypto market. Now the fourth-largest crypto by market capitalization, XRP, is currently experiencing a consolidation trend. However, this could just be the calm before the storm as both the activity of large investors aka whales and a developing bull flag pattern suggest. XRP Whale Wallets Reach New Heights According to an on-chain data analysis by Santiment, a leading market intelligence platform, the number of whale wallets holding a substantial 100 million or more XRP has witnessed a significant increase recently, now standing at an impressive 199. These whales, each commanding a minimum value of $74 million, have been closely observed over the past year, exhibiting strategic buying and selling patterns that impact XRP&#8217;s price movements. Related Reading: SEC Potential Appeal To Yield Little Effect On XRP, Crypto Lawyer Says This recent surge in the number of whales is a noteworthy milestone, matching the highest figure recorded since May 13. The Santiment chart below shows in detail the distribution patterns of these whales over the past year. As of July 2022, when XRP was trading below $0.40, 200 whales were in accumulation mode. However, they sold when XRP exceeded $0.50 within three months. Similarly, whales resumed accumulation between December and March 2023 when XRP was trading at $0.41. In April, a larger number of the whales sold their XRP again, bringing the number back below 200. Currently, the beginning of a new accumulation phase could be imminent, as Santiment shows. Bull Flag Heralds New Rally The recent meteoric rise in XRP&#8217;s price following the Ripple vs. SEC summary judgment has led to the formation of a bullish chart pattern known as the bull flag. This pattern consists of two rallies separated by a brief period of consolidating retracement. The initial rally comes to a pause through profit-taking, leading to a tight trading range as buyers and sellers find equilibrium. Related Reading: XRP Sluggish: Unraveling The Factors Behind Its Gradual Weakening XRP investors have to keep a close eye on the crucial price levels of the bull flag that could determine the future trajectory of the cryptocurrency. To the downside, the $0.685 mark is critical, representing the 23.6% Fibonacci retracement level. Holding above this level is crucial for maintaining the consolidation trend. If the lower end of the range is broken, a deeper correction could be imminent, with potential targets at $0.64 and $0.59. To the upside, XRP faces resistance at $0.845. Breaking above this level could trigger another sharp rally, though it might require a catalyst, either from the ongoing Ripple case or the broader crypto market, to achieve such a breakout. The closest target would then be the 38.2% Fibonacci retracement level where the impulsive rally following the Ripple ruling ended. Besides the psychologically important $1 level, the next bullish price targets would then be $1.13, 1.33 and $1.61. Featured image from Binance Academy, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-24T10:30:40.000Z",
    "title": "Tradecurve (TCRV) Advances Toward 100x Growth As VeChain (VET) and Decentraland (MANA) Users Jump Ships",
    "url": "https://www.crypto-news-flash.com/tradecurve-tcrv-advances-toward-100x-growth-as-vechain-vet-and-decentraland-mana-users-jump-ships/?utm_source=rss&utm_medium=rss&utm_campaign=tradecurve-tcrv-advances-toward-100x-growth-as-vechain-vet-and-decentraland-mana-users-jump-ships",
    "description": "<img width=\"512\" height=\"330\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T102804.161.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T102804.161.png 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/07/unnamed-2023-07-24T102804.161-300x193.png 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />Crypto whales are always vigilant to market trends and development. So, they do not wait to pounce on projects that have the potential to mint millions in profit. Interestingly, VeChain (VET) and Decentraland (MANA) holders are also jumping ships to join Tradecurve (TRCV). Therefore, Tradecurve’s presale has been swarmed by investors. As per experts’ projections, [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-24T10:09:37.000Z",
    "title": "U.S. President Candidate Pledges to Back the Dollar with Bitcoin and Advocate Tax Exemption for BTC – Will this Save Crypto Prices?",
    "url": "https://www.crypto-news-flash.com/u-s-president-candidate-pledges-to-back-the-dollar-with-bitcoin-and-advocate-tax-exemption-for-btc-will-this-save-crypto-prices/?utm_source=rss&utm_medium=rss&utm_campaign=u-s-president-candidate-pledges-to-back-the-dollar-with-bitcoin-and-advocate-tax-exemption-for-btc-will-this-save-crypto-prices",
    "description": "<img width=\"640\" height=\"427\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/US-dollar-burn.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/05/US-dollar-burn.jpg 640w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/US-dollar-burn-300x200.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2023/05/US-dollar-burn-104x69.jpg 104w\" sizes=\"(max-width: 640px) 100vw, 640px\" />Robert Kennedy&#8217;s public endorsement of Bitcoin and his proposal for related tax exemptions align with his previous remarks during his campaign.  Besides addressing energy concerns, Kennedy defended Bitcoin and cryptocurrencies against accusations of criminal use. Robert F. Kennedy Jr. announced that if he won the next election and became the president of the United States, [...]"
  },
  {
    "source": "Altcoin Buzz",
    "date": "2023-07-24T10:34:44.000Z",
    "title": "WorldCoin is Live, A Universal Coin Uniting Humanity?",
    "url": "https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/worldcoin-is-live-a-universal-coin-uniting-humanity/",
    "description": "<p>Unlike other cryptocurrencies that cater to specific niches or regions, WorldCoin aims to bridge borders. And unify humanity with a universal currency for global prosperity. Also, in this article, you will discover the use cases and what WorldCoin has to offer. The Concept Behind WorldCoin: Inclusivity and Accessibility At its core, WorldCoin seeks to address [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io/bitcoin-and-crypto-guide/worldcoin-is-live-a-universal-coin-uniting-humanity/\">WorldCoin is Live, A Universal Coin Uniting Humanity?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.altcoinbuzz.io\">Altcoin Buzz</a>.</p>\n"
  }
]