[
  {
    "source": "CoinDesk",
    "date": "2023-12-07T21:55:24.000Z",
    "title": "This $28K Pixelated Avocado Could Add to Bitcoin's Raging Censorship Debate",
    "url": "https://www.coindesk.com/tech/2023/12/07/this-28k-pixelated-avocado-could-add-to-bitcoins-raging-censorship-debate/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The NFT-like Ordinals inscriptions are anathema to some Bitcoin purists who want to preserve the blockchain for financial applications. But a few of the images are fetching eye-popping sums in the in-real-life art world."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-07T21:58:32.000Z",
    "title": " Sam Altman-linked Meanwhile Advisors creates BTC private credit fund ",
    "url": "https://cointelegraph.com/news/sam-altman-meanwhile-advisors-creates-btc-private-credit-fund",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvOGQ1ZTU3YjktN2Y5MC00ZDI4LTlhMmItMWM0YzMyZTMxZTVlLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>The closed fund will offer investors a 5% yield in Bitcoin and lend funds in BTC to institutions.</p>\n                    <p><p>Bitcoin life insurance innovator Meanwhile Group has come out with a private credit fund denominated in Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>). The closed fund will offer investors a “conservative” yield in Bitcoin and lend funds in BTC to institutional counterparties at the managers' discretion. </p><p>Meanwhile Advisors are targeting a 5% yield on the Meanwhile BTC Private Credit Fund term. By vetting loan recipients, the fund “effectively mitigates” the risk associated with retail platforms that provide loans predominantly to individuals, the company <a href=\"https://www.businesswire.com/news/home/20231207714798/en/Meanwhile-Group-Unveils-First-Bitcoin-Private-Credit-Fund\" target=\"_blank\" rel=\"noopener nofollow\">said</a> in a statement. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/coinbase-launches-crypto-loans-for-institutional-investors\">Coinbase launches crypto lending platform for US institutions</a></em></strong></p><p><a href=\"https://cointelegraph.com/news/sam-altman-meanwhile-advisors-creates-btc-private-credit-fund\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-12-07T21:45:30.000Z",
    "title": " Binance says decision to pull Abu Dhabi licensing bid unrelated to US settlement ",
    "url": "https://cointelegraph.com/news/binance-abu-dhabi-licensing-application",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjMtMTIvNDkxY2Y4MWItOTU5YS00ZDUzLWJkMzAtYzk4MmNiYTM4MWU4LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Former Binance CEO Changpeng Zhao, who pleaded guilty to one felony count in the United States in November, may not be able to return to the UAE before being sentenced.</p>\n                    <p><p>Cryptocurrency exchange Binance’s unit in Abu Dhabi has pulled an application with the Emirate’s financial regulator, a move it claims was unrelated to the firm’s November settlement with authorities in the United States.</p><p>In a statement to Cointelegraph on Dec. 7, a Binance spokesperson said the exchange had chosen not to move forward with an application with Abu Dhabi’s Financial Services Regulatory Authority following an assessment of its “global licensing needs.” The agreement, withdrawn by BV Investment Management in November, would have allowed Binance to manage a collective investment fund.</p><p>The spokesperson said Binance’s decision was “unrelated” to a $4.3 billion settlement with U.S. authorities, in which <a href=\"https://cointelegraph.com/news/binance-founder-cz-changpeng-zhao-guilty-plea-accepted\" >Changpeng “CZ” Zhao pleaded guilty</a> to one felony charge and stepped down as CEO. Binance’s former head of regional markets, Richard Teng, succeeded CZ and <a href=\"https://cointelegraph.com/news/binance-growth-led-to-compliance-failures-ceo-richard-teng\" >told Cointelegraph the exchange</a> was “totally different” following the deal.</p><p><a href=\"https://cointelegraph.com/news/binance-abu-dhabi-licensing-application\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-12-07T22:00:19.000Z",
    "title": "Report: Terraform Labs Co-Founder Do Kwon to Be Extradited to the US",
    "url": "https://news.bitcoin.com/report-terraform-labs-co-founder-do-kwon-to-be-extradited-to-the-us/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/kwons-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"Report: Terraform Labs Co-Founder Do Kwon to Be Extradited to the US\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/12/kwons-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/kwons-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/kwons-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/kwons-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/kwons-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/kwons-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/12/kwons.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />Terraform Labs&#8217; co-founder, Do Kwon, is on the brink of extradition to the United States from Montenegro. This development follows a decisive ruling by a high court and the endorsement from a top official. According to The Wall Street Journal, Justice Minister Andrej Milovic has confidentially agreed to the extradition, signifying a crucial twist in [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-07T22:00:06.000Z",
    "title": "Tokenizing assets on blockchain may elevate systemic risks, warns Bank of England",
    "url": "https://crypto.news/tokenizing-assets-on-blockchain-may-elevate-systemic-risks-warns-bank-of-england/",
    "description": "The Bank of England's financial stability report highlights the potential risks and increasing interest in asset tokenization within the financial sector, underscoring the need for global regulatory coordination."
  },
  {
    "source": "BTCManager",
    "date": "2023-12-07T21:50:31.000Z",
    "title": "House panel approves legislation to ‘maintain U.S. dominance’ in blockchain tech",
    "url": "https://crypto.news/house-panel-approves-legislation-to-maintain-u-s-dominance-in-blockchain-tech/",
    "description": "The U.S. House Committee on Energy and Commerce has unanimously passed the Deploying American Blockchains Act of 2023 to boost the nation's blockchain technology use."
  },
  {
    "source": "NewsBTC",
    "date": "2023-12-07T22:00:15.000Z",
    "title": "Holding For Gold: Micheal Saylor’s Poll Unveils Bitcoin Enthusiasts Aiming For $1 Million Mark",
    "url": "https://www.newsbtc.com/bitcoin-news/holding-for-gold-micheal-saylors-poll-unveils-bitcoin/",
    "description": "Recently, Michael Saylor, the founder of MicroStrategy and a prominent Bitcoin (BTC) proponent, took to social media to gauge the Bitcoin community’s sentiment on the future price of the digital asset. Saylor, who has transitioned from CEO to head of Bitcoin strategy at MicroStrategy, posed a significant question to the Bitcoin community on X. Saylor’s inquiry was straightforward yet profound: &#8220;How high will BTC need to rise before you would consider selling a small portion of your Bitcoin?&#8221; This question, aimed at understanding the threshold that might trigger selling decisions, garnered extensive attention, with roughly 122,839 individuals participating in the poll. The answers, revealing the mindset of the Bitcoin community, ranged from moderate to extremely bullish sentiments. Related Reading: Bitcoin’s Bullish Leap: Trading Guru John Bollinger Weighs In On BTC Ongoing Rally Surprising Results: Majority Eye $1 Million Bitcoin Threshold The survey results painted a fascinating picture of the BTC community&#8217;s outlook. While a minority of respondents, 18.8% and 14.1%, selected $250,000 and $500,000 price points, a significant portion of the community leaned towards much higher figures. Notably, 36.3% of voters indicated a price range from $1 million to never selling their Bitcoin holdings, highlighting a strong belief in BTCs long-term value. Additionally, 30.8% of participants marked $100,000 as their potential selling point. Saylor’s survey revealed the community&#8217;s predominant inclination to hold BTC until it reaches or surpasses the $1 million mark. Some were willing to hold indefinitely, reflecting a deep-rooted confidence in Bitcoin&#8217;s future. How high will $BTC need to rise before you would consider selling a small portion of your #Bitcoin? — Michael Saylor⚡️ (@saylor) December 6, 2023 Institutional Capital And Halving Events: Catalysts For A $1 Million BTC As the crypto space closely watches these survey results, the $1 million price point for Bitcoin is increasingly viewed as a realistic possibility by many enthusiasts and experts alike. Samson Mow, the CEO of Jan3 and a vocal BTC advocate, recently supported this view. Mow agreed with the general sentiment of Saylor&#8217;s survey, stating that while &#8220;Balaji wasn&#8217;t wrong about BTC going to $1M,&#8221; he was perhaps wrong about the timing and the driving factors. Mow attributed the potential surge to a confluence of significant institutional investment and the impact of Bitcoin halving events. The halving, a scheduled reduction in BTC mining rewards, inherently limits the new supply of Bitcoin, thereby introducing a scarcity factor. Related Reading: Tether Strikes Gold In Bitcoin: Profits Soar Above $1 Billion Amid Bull Market Coupled with a projected influx of institutional capital into the crypto market, these factors could collectively catalyze Bitcoin&#8217;s price to unprecedented heights. Mow&#8217;s analysis aligns with the optimism reflected in Saylor&#8217;s survey, underlining a solid belief in Bitcoin&#8217;s capacity for substantial value growth. Balaji wasn&#8217;t wrong about #Bitcoin going to $1M, but he was wrong on the timing and the catalyst. My $1M call is based on a massive rapid influx of institutional capital while Bitcoin available for sale is at historical lows, compounded by the halving. His $1M prediction was… — Samson Mow (@Excellion) December 6, 2023 It is worth noting that this optimism within the Bitcoin community, coupled with expert insights, suggests a future where Bitcoin&#8217;s valuation might reach, or even exceed, the coveted $1 million mark. Featured image from Unsplash, Chart from TradingView"
  }
]