[
  {
    "source": "Decrypt",
    "date": "2023-07-28T21:32:56.000Z",
    "title": "Solana Wants to Lead the Crypto Gaming Charge—Here's How (edited)",
    "url": "https://decrypt.co/150411/web3-games-need-to-compete-with-all-games-solanas-plan-to-lead-the-crypto-gaming-charge",
    "description": "At the PlayGG event, the Solana Foundation shared its strategy for changing the rough narrative around blockchain games."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-07-28T21:15:05.000Z",
    "title": "Worldcoin is making reality look like a lot like Black Mirror",
    "url": "https://cointelegraph.com/news/worldcoin-makes-reality-stranger-fiction",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-07/3dce064a-168c-4495-9307-19243a78ce24.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>OpenAI’s sister company Worldcoin wants you to buy its coin — and possibly unleash a tempest of problems across the world in the process.</p>\n                    <p><p>Scanning your iris to become a “verified human” in exchange for digital currency sounds like a <em>Black Mirror</em> episode. But this is not the story arc of a dystopian science fiction show — it’s happening now with one of the latest projects in <a href=\"https://cointelegraph.com/blockchain-for-beginners/what-is-web-3-0-a-beginners-guide-to-the-decentralized-internet-of-the-future\">Web3</a>.</p><p><a href=\"https://cointelegraph.com/news/worldcoin-launch-raises-eyebrows-as-wld-price-notches-a-double-digit-gain\">The launch of Worldcoin on Optimism</a> has left many wondering whether this project is subverting Web3’s promise of decentralization to build just the opposite. And yet, more than 2 million people in underserved areas have already signed up to share their biometric data with Worldcoin in exchange for 25 WLD, worth less than $100 at the time of writing. </p><p>This is not just strange — it also presents serious privacy risks and creates a honeypot for bad actors. More so, there’s an argument to be made that it could even interfere with the sovereignty of foreign countries.</p><h2>Why would we need Worldcoin in the first place?</h2><p>Worldcoin was founded to solve for the expected externalities of its sister company, OpenAI — the creator of ChatGPT and other popular AI products. One hand is solving the problems the other hand is creating.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">2024: Bitcoiners trying to save the children from Sam Altman’s WorldCoin orb eye scans <a href=\"https://t.co/ZeAWuNdSJs\">pic.twitter.com/ZeAWuNdSJs</a></p>&mdash; ₿it₿ry (@bchinella) <a href=\"https://twitter.com/bchinella/status/1684330641096163334?ref_src=twsrc%5Etfw\">July 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In the <a href=\"https://worldcoin.org/\" target=\"_blank\" rel=\"noopener nofollow\">words</a> of its founders: “If successful, we believe Worldcoin could drastically increase economic opportunity, scale a reliable solution for distinguishing humans from AI online while preserving privacy, enable global democratic processes, and eventually show a potential path to AI-funded UBI [universal basic income].”</p><h2>The problem with Worldcoin</h2><p>Despite the ambition and promise to safeguard privacy, a whole new set of problems arises from the fact that this is being done by a single, currently centralized company. The irony is not lost on ChatGPT. Some of its answers when prompted<strong> </strong>“What are the risks in having one company own biometric data for individuals in underdeveloped countries?” include:</p><ul><li>Privacy violations</li><li>Security breaches</li><li>Surveillance and sovereignty</li></ul><p>Ethereum co-founder Vitalik Buterin <a href=\"https://cointelegraph.com/news/worldcoin-token-launch-sparks-response-from-vitalik-buterin\">has echoed some of these concerns</a> as well. </p><p>Having one company own biometric data for individuals in underdeveloped countries poses significant risks for individuals. On a broader societal scale, these are even more significant when coupled with UBI payments to foreign citizens.</p><h3>Privacy violations </h3><p>Biometric data like irises is highly sensitive and unique to each individual. It can reveal information such as sex, ethnicity and, perhaps, medical conditions. If a single company controls this data, there’s a high risk of privacy violations, as it can be used to track and monitor individuals without their consent.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/the-world-could-be-facing-a-dark-future-thanks-to-cbdcs\"><strong><em>The world could be facing a dark future thanks to CBDCs</em></strong></a></p><p>Who’s to say that the company would not exploit the biometric data for commercial gains, such as targeted advertising or selling the data to other entities? Isn’t that diametrically opposed to what we have been trying to achieve for the last few years?</p><h3>Security breaches</h3><p>Centralizing biometric data also puts it at a higher risk of being targeted by hackers and cybercriminals. This is what’s known in security sectors as a “honeypot” when used for controlled purposes. A large amount of attractive data is stored by a single entity in order to study a potential breach under the understanding that it will eventually be hacked.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/desantis-is-right-cbdcs-will-lead-to-absolute-government-control\"><strong><em>CBDCs will lead to absolute government control</em></strong></a></p><p>A data breach at this scale could lead to severe consequences, including identity theft, fraud, and unauthorized access to the personal information of millions of people. </p><h3>Surveillance and sovereignty</h3><p>This data could also fall into the hands of governments to subpoena the data and obtain citizens’ personal information without a warrant. There are fewer protections when you sell your data to a third party. A corrupt government may use this data to manipulate behaviors, limit dissent and suppress opposition, essentially turning underdeveloped regions into surveillance states.</p><p>More so, if the company operates across borders, it could wield undue power and influence over governments and societies. Financially supporting a large number of foreign citizens under a universal basic income model could ultimately reduce the autonomy and sovereignty of a country’s democratic processes.</p><p>When visiting Worldcoin’s Orbs to scan their irises, registrants are given a promotional sticker that reads “Verified Human.” There’s a slight feeling of discomfort in being referred to simply as <em>human </em>here — not <em>person</em>. </p><p>In the context of selling your identity for a few bucks to a cryptocurrency project with ties to AI development, it almost sounds like a Freudian slip. It’s as if personhood is a forgotten idea, and now we’re just humans in a massive database of biometric data. </p><p>Sometimes reality really is stranger than fiction.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Matthew Niemerg</strong> is a co-founder and board member of the Aleph Zero Foundation. He holds a Ph.D. in Mathematics from Colorado State University and currently serves as an expert on the EU Blockchain Observatory and Forum. He is also a co-founder of Cardinal Cryptography.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-07-28T21:30:55.000Z",
    "title": "Alameda Research wants GBTC shareholders to join lawsuit against Grayscale",
    "url": "https://cryptoslate.com/alameda-research-wants-gbtc-shareholders-to-join-lawsuit-against-grayscale/",
    "description": "<p>Alameda Research, a bankrupt crypto investment firm, is soliciting the support of claimants holding 10% of Grayscale&#8217;s Bitcoin Trust (GBTC) shares in its ongoing lawsuit against the crypto investment management company and its parent firm, Digital Currency Group (DCG). Alameda has announced plans to file an amended complaint against Grayscale. The amendment aims to include [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/alameda-research-wants-gbtc-shareholders-to-join-lawsuit-against-grayscale/\">Alameda Research wants GBTC shareholders to join lawsuit against Grayscale</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "CryptoGlobe",
    "date": "2023-07-28T21:28:34.000Z",
    "title": "Historic Leap: British Museum Ventures into Metaverse with The Sandbox",
    "url": "https://www.cryptoglobe.com/latest/2023/07/historic-leap-british-museum-ventures-into-metaverse-with-the-sandbox/",
    "description": "The Sandbox, an Ethereum-powered metaverse, has announced a partnership with the British Museum to create a range of digital collectibles that mirror the museum’s collections since its inception in 1753. The British Museum, known as the world’s first public national museum, is now stepping into the metaverse, aligning with its mission to be a “museum […]\n"
  },
  {
    "source": "Bitcoin.com",
    "date": "2023-07-28T21:30:14.000Z",
    "title": "69% of Meme Coin Investors Buy for Fun — Study Delves Into Investor Sentiments on Meme Coins",
    "url": "https://news.bitcoin.com/69-of-meme-coin-investors-buy-for-fun-study-delves-into-investor-sentiments-on-meme-coins/",
    "description": "<img width=\"768\" height=\"432\" src=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/meme-768x432.jpg\" class=\"attachment-medium_large size-medium_large wp-post-image\" alt=\"69% of Meme Coin Investors Buy for Fun — Study Delves Into Investor Sentiments on Meme Coins\" decoding=\"async\" style=\"float:left; margin:0 15px 15px 0;\" srcset=\"https://static.news.bitcoin.com/wp-content/uploads/2023/07/meme-300x169.jpg 300w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/meme-1024x576.jpg 1024w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/meme-768x432.jpg 768w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/meme-190x107.jpg 190w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/meme-380x214.jpg 380w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/meme-760x428.jpg 760w, https://static.news.bitcoin.com/wp-content/uploads/2023/07/meme.jpg 1280w\" sizes=\"(max-width: 768px) 100vw, 768px\" />A new study conducted in May 2023 sought to uncover insights, perspectives, and outlooks on meme coins from crypto investors around the world. The online survey of 1,503 participants aimed to gauge meme coins&#8217; potential in the cryptocurrency market. It revealed several findings about investor sentiments, behaviors, and perceptions surrounding these unique digital assets. Meme [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T21:30:17.000Z",
    "title": "Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?",
    "url": "https://www.cryptopolitan.com/fantom-price-prediction/",
    "description": "Fantom Price Prediction 2023-2032 Fantom (FTM) was created to overcome Ethereum&#8217;s limitations and create a new generation of blockchain solving the trilemma of scalability, security, and decentralization. However, with Fantom&#8217;s outstanding 2,108% growth and additional 2,000% unique addresses, FTM continues to struggle, losing 93% of its value from its ATH in Jan 2022. A better ... <a title=\"Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fantom-price-prediction/\" aria-label=\"More on Fantom Price Prediction 2023-2032: Will FTM Investors Waver in Crypto Winter?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T21:29:11.000Z",
    "title": "The Power of the Human Touch in an AI Age to Embrace the Best of Both Worlds",
    "url": "https://www.cryptopolitan.com/the-power-of-the-human-touch-in-an-ai-age/",
    "description": "The rise of artificial intelligence (AI) has revolutionized various sectors, from marketing to finance and healthcare. Despite its advancements, there are compelling reasons why human interaction remains essential in customer care. Bernadette Bennett, head of the legal sector at Moneypenny, and Jonathan Winchester, CEO of insight6, emphasize the benefits of embracing the human touch in ... <a title=\"The Power of the Human Touch in an AI Age to Embrace the Best of Both Worlds\" class=\"read-more\" href=\"https://www.cryptopolitan.com/the-power-of-the-human-touch-in-an-ai-age/\" aria-label=\"More on The Power of the Human Touch in an AI Age to Embrace the Best of Both Worlds\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-07-28T21:15:30.000Z",
    "title": "US Congressman hails Bitcoin as financial game-changer",
    "url": "https://www.cryptopolitan.com/congressman-bitcoin-financial-game-changer/",
    "description": "According to US Congressman Patrick McHenry, the next revolution in internet technology is poised to be built on the foundations of Bitcoin and blockchain. Serving North Carolina&#8217;s 10th district, McHenry has become a notable advocate for cryptocurrencies, particularly Bitcoin, hailing it as the game-changer that could redefine the financial landscape. Staking a Claim in the ... <a title=\"US Congressman hails Bitcoin as financial game-changer\" class=\"read-more\" href=\"https://www.cryptopolitan.com/congressman-bitcoin-financial-game-changer/\" aria-label=\"More on US Congressman hails Bitcoin as financial game-changer\">Read more</a>"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-07-28T21:30:35.000Z",
    "title": "AI-Powered Meme Coins To Decentralized Freelancing: How Shiba Memu and DeeLance Lead the Way",
    "url": "https://www.crypto-news-flash.com/ai-powered-meme-coins-to-decentralized-freelancing-how-shiba-memu-and-deelance-lead-the-way/?utm_source=rss&utm_medium=rss&utm_campaign=ai-powered-meme-coins-to-decentralized-freelancing-how-shiba-memu-and-deelance-lead-the-way",
    "description": "In this market, identifying the best cryptos can be tricky. The landscape has dozens of projects, promising unique features and lucrative gains. Read on to learn about two new projects leading the way — Shiba Memu (SHMU) and DeeLance (DLANCE) — and how they might fare in the race to become the best crypto investment [...]"
  }
]