[
  {
    "source": "CoinDesk",
    "date": "2023-10-26T20:42:26.000Z",
    "title": "Bitcoin Cools Off at $34K, But '5th Bull Market' Has Further to Run, Says Analyst",
    "url": "https://www.coindesk.com/markets/2023/10/26/bitcoin-cools-off-at-34k-but-5th-bull-market-has-further-to-run-says-analyst/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "tktk"
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-26T21:00:00.000Z",
    "title": "HTX's Justin Sun claims record profits despite staff cuts",
    "url": "http://cointelegraph.com/news/htx-justin-sun-claims-record-profits-despite-staff-cuts",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/8601c469-369c-4153-a2eb-e7087b0051dc.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>The blockchain personality claims that his exchange recorded a profit of $98 million in Q3 2023. </p>\n                    <p><p>Chinese blockchain personality Justin Sun, who also serves as the de facto owner of crypto exchange HTX (formerly Huobi Global), claims that the firm posted a profit of $98 million in Q3 2023.</p><p>According to the October 26 <a href=\"https://twitter.com/justinsuntron/status/1717550486608642061\" target=\"_blank\" rel=\"noopener nofollow\">thread</a>, Sun says that HTX generated a total of $202 million in revenues during the quarter, which was offset by $104 million in expenses, leaving a total profit of $98 million. For Q4 2023, Sun projects that HTX will generate $190 million in revenue, along with $88 million in expenditure, for an estimated profit of $104 million.</p><p>\"The entire third quarter was a severe quarter for the industry,\" said Sun, mentioning that the U.S. Federal Reserve's high interest rates led to an industry-wide decline in revenues. \"But we still maintained the growth rate of revenue. The overall market recovered in the fourth quarter. We are optimistic about the fourth quarter. The revenue forecast is still relatively conservative,\" he added.</p><p>Looking forward, Sun believes that the nadir of the crypto bull market is nearly over. \"In Q4 this year and Q1 next year, the crypto market will usher in spring recovery. We have firm confidence in the continued improvement of overall financial indicators,\" he wrote.</p><p>Despite Sun's outlook, not all has been well with HTX's operations. During the Token2049 event in Singapore last month, Edward Chen, managing director of HTX Ventures, <a href=\"https://cointelegraph.com/magazine/token2049-singapore-huobi-asia-express/\">revealed in a panel</a> that the exchange has reduced its staff count from 2,500 early this year to 900. In January, the exchange allegedly crushed an employee revolt after many staff salaries were cut and <a href=\"https://cointelegraph.com/magazine/huobi-employees-revolt-gamefi-lives-antminer-on-steroids-asia-express/\">bonuses removed</a> due to falling revenues. </p><blockquote class=\"twitter-tweet\"><p lang=\"zh\" dir=\"ltr\">三季度结束了，三季度实际收入为2.02亿美元，支出为1.04亿美元，盈利为9800万美元，环比增长14%，集团增收降本措施持续见效。四季度预测收入为1.9亿美元，支出8800万美元，盈利为1.04亿美元。 <a href=\"https://t.co/8cBsL4v7vn\">https://t.co/8cBsL4v7vn</a></p>&mdash; H.E. Justin Sun 孙宇晨 (@justinsuntron) <a href=\"https://twitter.com/justinsuntron/status/1717550486608642061?ref_src=twsrc%5Etfw\">October 26, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-26T20:51:28.000Z",
    "title": "Bitcoin is evolving into a multi-asset network",
    "url": "http://cointelegraph.com/news/bitcoin-evolving-multi-asset-network",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/250f63e3-851e-4ddd-bf98-96452bada1e2.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Bitcoin Ordinals are creating new possibilities for the Bitcoin network by allowing users to create inscriptions stored on individual Satoshis.</p>\n                    <p><p>For more than a decade, the primary narratives surrounding Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) have focused on its role as a peer-to-peer digital cash and store of value.</p><p>However, all indications suggest that we are witnessing a significant shift in this paradigm.</p><p>Since the beginning of 2023, one of the most discussed topics in the Bitcoin ecosystem has been the use of the world's leading blockchain to store information that goes beyond the previously mentioned use cases.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-fragments-more-valuable-than-full-bitcoins\"><strong><em>Bitcoin fragments could become more valuable than full Bitcoins</em></strong></a></p><p>If you have been isolated in an igloo during this crypto winter and are unaware of the developments, here is a brief overview.</p><p>In January 2023, developer Casey Rodamor introduced Ordinals to the world, a protocol that allows you to permanently inscribe any file into the Bitcoin blockchain.</p><p>This wasn't the first method created for such an action, but it gained the most traction, creating a trend where <a href=\"https://cointelegraph.com/nonfungible-tokens-for-beginners/what-are-nfts-and-why-are-they-revolutionizing-the-art-world\">nonfungible token (NFT)</a> collections, music, video games, journalistic articles, and even WikiLeaks records began to be stored in an eternal and immutable manner on the world's largest decentralized network.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">&#39;Anonymous activist group is inscribing the Afghan war logs published by WikiLeaks into <a href=\"https://twitter.com/hashtag/Bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#Bitcoin</a> to protest imprisonment of Julian Assange&#39; <a href=\"https://twitter.com/BitcoinMagazine?ref_src=twsrc%5Etfw\">@BitcoinMagazine</a> <a href=\"https://twitter.com/hashtag/FreeAssange?src=hash&amp;ref_src=twsrc%5Etfw\">#FreeAssange</a> <a href=\"https://t.co/1huZ6J9SDM\">https://t.co/1huZ6J9SDM</a></p>&mdash; WikiLeaks (@wikileaks) <a href=\"https://twitter.com/wikileaks/status/1716273237179629983?ref_src=twsrc%5Etfw\">October 23, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>As a result, experiments, innovation, and the perspective of the Bitcoin network as a vast decentralized database began to simmer.</p><p>Despite being less than a year old, the Ordinals protocol has been evolving remarkably to become more efficient and to enable bolder use cases.</p><p>One of the noteworthy enhancements is the technique of recursive inscriptions, which allows users to circumvent the 4-megabyte storage limit per block, enabling the insertion of larger data on the Bitcoin blockchain.</p><p>As an example — illustrated by the image below — I inscribed an entire article from Cointelegraph on Bitcoin using a recursive inscription.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/4b0ce2fe-8d2b-46ea-b8f4-bbda4c8c5eb9.jpg\"  /><figcaption style=\"text-align: center;\">Cointelegraph article inscribed on Bitcoin as Ordinal inscription #35,185,228. Source: https://www.ord.io/35185228</figcaption></figure><p>In total, eight inscriptions were made to achieve the final result, at a total file size of 5.22 kilobytes. (That’s small.) Seven of the inscriptions were images from the article, each stored individually in a Satoshi through the Ordinals protocol. The eighth inscription comprises a code that contains the article's text and issues requests to retrieve the images from the other Satoshis.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/bitcoin-has-entered-a-civil-war-over-art\"><strong><em>Bitcoin has entered a civil war — Over ‘art’</em></strong></a></p><p>This assembly allowed for the complete article to be eternally inscribed on the Bitcoin blockchain, a feat that couldn't have been achieved in a single step while maintaining quality.</p><p>Leonidas, a developer within the Ordinals community, offered an even more profound perspective on the matter on Twitter, writing:</p><blockquote>What if lots of people upload lots of packages of code into the Bitcoin Blockchain? So now there is a huge repository of packages for developers to build on top of. This would unlock powerful use cases that could never be accommodated in under 4 MB. The most complex pieces of software are just a bunch of code compiled together after all. Now it becomes possible to put a complex 3D video game fully on-chain on Bitcoin.</blockquote><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Complex 3D video game fully on-chain on Bitcoin.The sky is the limit. Bitcoin is essentially getting an internal internet where every file can request data from the other files on Bitcoin. Its unclear yet exactly how people will use this but it is undoubtedly an important moment</p>&mdash; gaww.btc  (@gawwbtc) <a href=\"https://twitter.com/gawwbtc/status/1669953133299257346?ref_src=twsrc%5Etfw\">June 17, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>With just this, a world of possibilities can be contemplated and reimagined. After all, the ability to use the world's leading blockchain as an immutable, shared, and uncensored data storage is huge.</p><p>But the innovations don't stop there!</p><p>In October, Lightning Labs<a href=\"https://cointelegraph.com/news/lightning-labs-releases-taproot-assets-alpha-bringing-stablecoins-to-bitcoin\"> announced the first mainnet release of Taproot Assets (TARO)</a>, further enhancing the Bitcoin blockchain as a multi-asset network.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Announcing the first mainnet release of Taproot Assets , a protocol for assets on <a href=\"https://twitter.com/hashtag/bitcoin?src=hash&amp;ref_src=twsrc%5Etfw\">#bitcoin</a> and Lightning.<br><br>With this release, developers can issue financial assets on-chain in a scalable manner. <br><br>Today marks a new era of multi-asset bitcoin. <a href=\"https://t.co/2cNvZSvv8v\">https://t.co/2cNvZSvv8v</a></p>&mdash; Lightning Labs⚡️ (@lightning) <a href=\"https://twitter.com/lightning/status/1714659264101253317?ref_src=twsrc%5Etfw\">October 18, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>This could not have occurred at a more opportune time, given the enthusiasm ignited by the Ordinals protocol and the way it paved the path for TARO to shine alongside it.</p><p>The Ordinals Protocol has broadened the perspective of users and builders, allowing them to construct and view Bitcoin as a network of multiple assets.</p><p>Ordinals assets — via flooding the network with transactions — compelled Binance to implement an integration with Lightning. This key factor, combined with low costs, decentralization, and high network settlement speed, makes trading other coins and assets very attractive through Taproot Assets.</p><p>And among the various applications of the TARO protocol, one of the most mentioned is the ability to issue stablecoins on the Bitcoin blockchain.</p><p>The shift in paradigm is monumental as it paves the way for Bitcoin to transform from being primarily an exchangeable asset to becoming the medium through which exchanges occur.</p><p>This innovation is going to empower builders to import successful use cases from other chains and bring them back to the mothership.</p><p>Some even joke that all other chains are just Bitcoin's test nets. Does it all lead back to Bitcoin?</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">THE BITCOIN RENAISSANCE CAN’T BE STOPPED<br><br>the magicians at <a href=\"https://twitter.com/lightning?ref_src=twsrc%5Etfw\">@lightning</a> labs are back with an efficient protocol for tokens on top of bitcoin<br><br>ethereum was a testnet. get in anon we’re going to the moon <a href=\"https://t.co/2g6vPFBAbV\">pic.twitter.com/2g6vPFBAbV</a></p>&mdash; Udi Wertheimer (@udiWertheimer) <a href=\"https://twitter.com/udiWertheimer/status/1658538902154559493?ref_src=twsrc%5Etfw\">May 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>Overall, we could say that we are on the edge of a new Bitcoin era — the era of the multi-asset orange network.</p><p>In addition to attracting and retaining more developers who may be interested in these new protocols, these new applications also have the potential to draw in and retain new users who initially didn't find interest or value in Bitcoin as a store of value.</p><p>For some, transforming the world can sometimes occur through the simple enjoyment of some fun, encrypted sports cards. But with the optimization of Ordinals, the number of possibilities will continue expanding.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-10/bdca6d4d-af2f-4248-94ab-2662e946e15e.jpg\"  /><figcaption style=\"text-align: center;\"><em>A January 1993 post authored by Hal Finney speculating on the idea of marketing digital cash as cryptographic trading cards. Source: Compuserve</em></figcaption></figure><p>Hal Finney, a prominent cypherpunk — and the first person to receive a transaction from Bitcoin creator Satoshi Nakamoto — wrote in a 1993 post on Compuserve: “Giving a little more thought to the idea of buying and selling digital cash, I thought of a way to present it. We’re buying and selling cryptographic trading cards.”</p><p>Finney knew, and now you know too.</p><div><div style=\"background: rgb(239, 239, 239); border: 1px solid rgb(204, 204, 204); padding: 10px;\"><strong>Lugui Tillier</strong> is the chief commercial officer of Lumx Studios, a Web3 studio that counts BTG Pactual Bank, the largest investment bank in Latin America, among its investors. Lumx Studios has previous Web3 cases with Coca-Cola, AB InBev, Nestlé and Meta. The author holds investments related to the Ordinals Protocol, though none named in this article.</div></div><p class=\"post-content__disclaimer\"><em>This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.</em></p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-10-26T20:46:14.000Z",
    "title": "Sam Bankman-Fried denies knowledge of moving FTX deposits to North Dimension: Report",
    "url": "http://cointelegraph.com/news/sam-bankman-fried-denies-ftx-deposits-north-dimension",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-10/c3aaf876-4fd4-490d-9f0e-d02aa09a4b3c.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Assistant U.S. Attorney Danielle Sassoon grilled the former FTX CEO in court on his knowledge of FTX user deposits and the retention of communication records.</p>\n                    <p><p>Testifying in court but without the jury for his criminal trial present, Sam “SBF” Bankman-Fried faced questions from prosecutors who pressed the former FTX CEO on his alleged involvement in using customer funds for investments through Alameda Research.</p><p>According to reports from the New York courtroom on Oct. 26, Bankman-Fried <a href=\"https://twitter.com/innercitypress/status/1717631698572046424\" target=\"_blank\" rel=\"noopener nofollow\">denied</a> knowing why crypto exchange FTX began moving user funds from a bank account with Alameda to a firm called North Dimension — a “shadowy entity” allegedly used for money laundering. SBF suggested that banks may have been more comfortable with North Dimension, avoiding well-known hedge funds connected to crypto like Alameda.</p><p>Bankman-Fried reportedly said he wasn’t heavily involved in North Dimension, but didn’t recall discussions with auditors about FTX user funds going to the entity as well as Alameda:</p><blockquote>“I should say, I am not a lawyer, I am just trying to answer based on my recollection [...] At the time [at] FTX, certain customers thought accounts would be sent to Alameda.\"</blockquote><p>SBF’s testimony, made in a court hearing without the jury present, was one of the last presentations by his defense team, consisting of attorneys Mark Cohen and Christian Everdell. He testified to <a href=\"https://cointelegraph.com/news/sam-bankman-fried-testifies-without-jury\">believing that taking FTX deposits</a> through Alameda Research was legal under questioning from his attorneys. At the same time, prosecutors asked about his role in the <a href=\"https://cointelegraph.com/news/sbf-grilled-court-deleted-messages-during-testimony\">retention of documents and communications</a> at FTX and Alameda.</p><p>\"[T]he witness has an interesting way of responding to questions,\" said Judge Kaplan on SBF's testimony so far.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/sam-bankman-fried-testimony-challenge-government-claims\"><strong><em>Sam Bankman-Fried’s testimony to challenge government claims, lawyer tells judge</em></strong></a></p><p>The criminal trial which started on Oct. 3 after months of preparation will likely end within the next seven days following Bankman-Fried’s testimony and closing arguments from both sides. Bankman-Fried could face conviction on up to seven charges in the current trial but is also expected to address five more criminal counts in a second trial in March 2024. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/sam-bankman-frieds-life-in-jail-tornado-cashs-turmoil-and-a-3b-btc-whale-hodlers-digest-aug-20-26/\"><strong><em>Sam Bankman-Fried’s life in jail, Tornado Cash’s turmoil, and a $3B BTC whale: Hodler’s Digest, Aug. 20-26</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-10-26T20:45:17.000Z",
    "title": "Why was the jury dismissed during SBF’s first round of testimony?",
    "url": "https://cryptoslate.com/why-was-the-jury-dismissed-during-sbfs-first-round-of-testimony/",
    "description": "<p>Sam Bankman-Fried took the stand in his own criminal defense trial on Oct. 26. However, many following the proceedings were surprised as Judge Lews Kaplan ordered the jury out of the room before continuing. According to Inner City Press, which has reported from inside the courtroom during each day of Bankman-Fried&#8217;s trial, Judge Lewis Kaplan [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/why-was-the-jury-dismissed-during-sbfs-first-round-of-testimony/\">Why was the jury dismissed during SBF&#8217;s first round of testimony?</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "BTCManager",
    "date": "2023-10-26T21:04:35.000Z",
    "title": "StripedFly malware targets more than a million PCs, disguising as a crypto miner",
    "url": "https://crypto.news/stripedfly-malware-targets-more-than-a-million-pcs-disguising-as-a-crypto-miner/",
    "description": "Kaspersky unveils StripedFly, a stealthy malware posing as a crypto miner, compromising over a million Windows and Linux systems globally since 2016."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-26T21:01:46.000Z",
    "title": "Citadel Securities accused by Terraform of acting in ‘bad faith’ over UST depeg incident",
    "url": "https://crypto.news/citadel-securities-accused-by-terraform-of-acting-in-bad-faith-over-ust-depeg-incident/",
    "description": "The legal fight between Terraform Labs and Citadel Securities over the 2022 UST stablecoin issue presents a complicated situation filled with accusations, calling for a careful and unbiased review to find out what really happened."
  },
  {
    "source": "BTCManager",
    "date": "2023-10-26T20:57:23.000Z",
    "title": "Shibarium sees surge in daily transactions as SHIB gains 15% in a week",
    "url": "https://crypto.news/shibarium-sees-a-493-surge-in-daily-transactions-as-shib-gains-15-in-a-week/",
    "description": "Shibarium's transaction volume skyrockets by 493% in a single day, marking key milestones for the Shiba Inu ecosystem."
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-26T21:00:23.000Z",
    "title": "LooksRare Monthly NFT Trading Volume Flash Crashes 97% In October: What’s Next?",
    "url": "https://www.newsbtc.com/nft/looksrare-trading-volume-crashes-97-in-october/",
    "description": "The monthly trading volume of LooksRare, a decentralized non-fungible token (NFT) and digital collectible marketplace, is down 97%, crashing from $71.9 million registered in September 2023 to just $2.1 million in October, Token Terminal data shared by Web3 Academy on October 26, via X shows.  LooksRare&#8217;s Monthly Volume Tanking, Falls To $2.1 Million In October The unprecedented drop in activity couldn&#8217;t be pinned on any particular LooksRare-related event when writing on October 26. This contraction is despite the broader cryptocurrency market recovering, rising as seen by the welcomed expansion of leading assets, including Bitcoin (BTC) and Ethereum (ETH). Related Reading: Bitcoin Price Surge: Matrixport Forecasts $125,000 Price Target By December 2024 According to trackers, monthly volume has been falling steadily since April 2023. Then, the average volume exceeded $150 million, pointing to rising interest, especially from traders. At that time, it should be noted that most crypto assets were also growing. Specifically, Bitcoin broke higher, touching $30,000, triggering demand and reviving hopes that the market was looking up again following the collapse in 2022. By June through September, the average monthly volume in LooksRare had more than halved before plunging to less than $3 million in October 2023. The spike in monthly trading activity in April coincided with the release of LooksRare v2, which saw the platform&#8217;s developers reduce trading fees by 75% from 2% to 0.5%. The updated version is also more gas efficient, allowing traders to save up to 30% on gas compared to the previous edition. Moreover, with LooksRare allowing traders to place bulk orders when buying or selling, monthly volume rapidly rose in April. NFT Bull Run Postponed, Will LOOKS Break Resistance Line? With activity rapidly contracting, LOOKS, the native token of LooksRare, has also been flat-lining, looking at price action. The token trades around the $0.070 level at spot rates, retesting August highs. However, an inverted hammer suggests that the uptrend momentum could wane, and bears might reverse gains. Related Reading: Bitcoin’s Upcoming Leap? Analyst Predicts A Potential $45,500 Rise By November Despite concerns, LOOKS is up 60% from H2 2023 lows and may still rally in the months ahead. Looking at the candlestick arrangement in the daily chart, a close above $0.070 with expanding volumes could set the ball rolling for buyers who expect the token to retest 2022 lows at around $0.12. Overall, NFT and digital collectible trading activity remains relatively lower, even with bullish traders expecting prices to turn around and rally in 2024. Recently, there was a brief increase in the floor prices of leading NFT collections like Bored Ape Yacht Club (BAYC), Azuki, and CryptoPunk. However, with trading volume and the number of new owners still at record lows, researchers put off the chance of an NFT bull run starting in Q4 2023. Feature image from Canva, chart from TradingView"
  }
]