[
  {
    "source": "CoinDesk",
    "date": "2024-01-22T22:13:27.000Z",
    "title": "Bug on Ethereum's Nethermind Software Sparks Discussion of 'Client Diversity' Risks",
    "url": "https://www.coindesk.com/tech/2024/01/22/bug-on-ethereums-nethermind-software-sparks-discussion-of-client-diversity-risks/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The lion's share of Etheruem's validators rely on the same piece of software to power their operations. According to some experts, this could be a big risk."
  },
  {
    "source": "CoinDesk",
    "date": "2024-01-22T22:12:03.000Z",
    "title": "Protocol Village: AaveDAO Approves Deployment of Aave v3 on Neon EVM Mainnet",
    "url": "https://www.coindesk.com/tech/2024/01/18/protocol-latest-tech-news-crypto-blockchain/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The latest in blockchain tech upgrades, funding announcements and deals. For the period of Jan. 18-24."
  },
  {
    "source": "CryptoSlate",
    "date": "2024-01-22T22:27:56.000Z",
    "title": "Bitcoin ETFs expected to launch in Hong Kong by mid-2024",
    "url": "https://cryptoslate.com/bitcoin-etfs-expected-to-launch-in-hong-kong-by-mid-2024/",
    "description": "<p>Hong Kong is gearing up to launch its first spot crypto exchange-traded funds (ETFs) by mid-2024, a move that could redefine the landscape of digital asset investment in the region, according to Jan. 22 news reports. Multiple firms are looking to launch spot Bitcoin ETFs within the coming months now that Hong Kong has softened [&#8230;]</p>\n<p>The post <a href=\"https://cryptoslate.com/bitcoin-etfs-expected-to-launch-in-hong-kong-by-mid-2024/\">Bitcoin ETFs expected to launch in Hong Kong by mid-2024</a> appeared first on <a href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-22T22:17:56.000Z",
    "title": "Binance burns a significant amount of Binance-pegged tokens across various chains",
    "url": "https://www.cryptopolitan.com/binance-burns-a-significant-pegged-tokens/",
    "description": "Binance, the world&#8217;s largest digital currency exchange, announced an upcoming major token burn earlier today. The burn will be conducted for Binance-pegged tokens across various chains. This initiative is not surprising as the crypto exchange has performed similar token burns in the past, mainly involving idle Binance-wrapped tokens. Strategic move to bolster market confidence Binance&#8217;s [&#8230;]"
  }
]