[
  {
    "source": "Cointelegraph",
    "date": "2024-04-03T02:50:56.000Z",
    "title": " Base and SOL memecoin market caps plummet 19% and 12% in 24 hours ",
    "url": "https://cointelegraph.com/news/base-solana-memecoin-market-caps-plummet-mati-greenspan-charles-edwards",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDQvYWQ5NjBmNTktZjRlMC00Njk3LTk4NGUtZjc3OWYyNDQ1ODA3LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Mati Greenspan suggests the memecoin market is crashing because the joke is over, while Charles Edwards points to memecoins suffering heavier losses than Bitcoin during sharp downturns.</p>\n                    <p><p>The total market capitalizations of memecoins on Solana and Coinbase's Ethereum layer-2 Base have witnessed a significant drop in the last 24 hours, plunging 12% and 19% respectively across the two networks. </p><p>The memecoin sell-off arrived around the same time as a sharp decline in the price of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), with the cryptocurrency falling 4.94% in the last 24 hours, per CoinMarketCap <a href=\"https://coinmarketcap.com/currencies/bitcoin/\" target=\"_blank\" rel=\"noopener nofollow\">data</a>. </p><p>One crypto analyst said it’s common for memecoins to plummet when the price of BTC falters, however, another analyst linked the bearish trend to the humor simply running its course. </p><p><a href=\"https://cointelegraph.com/news/base-solana-memecoin-market-caps-plummet-mati-greenspan-charles-edwards\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "NewsBTC",
    "date": "2024-04-03T03:02:20.000Z",
    "title": "Bitcoin Price Consolidates Losses But Recovery Could Face Hurdles",
    "url": "https://www.newsbtc.com/analysis/btc/bitcoin-price-consolidates-65k/",
    "description": "Bitcoin price extended its decline below the $65,000 support zone. BTC is now consolidating losses and might attempt a recovery wave toward $67,000. Bitcoin price declined further below the $65,500 and $65,000 levels. The price is trading below $67,500 and the 100 hourly Simple moving average. There is a key bearish trend line forming with resistance near $67,200 on the hourly chart of the BTC/USD pair (data feed from Kraken). The pair could recover but the bears might remain active near $67,000. Bitcoin Price Drops Further Bitcoin price turned red after it broke the $68,000 support zone. BTC extended its decline below the $65,500 and $65,000 levels. Finally, it tested the $64,500 region. A low was formed near $64,572 and the price is now consolidating losses. There was a move above the $65,000 level. The price even tested the 23.6% Fib retracement level of the downward move from the $71,306 swing high to the $64,572 low. Bitcoin is now trading below $67,000 and the 100 hourly Simple moving average. There is also a key bearish trend line forming with resistance near $67,200 on the hourly chart of the BTC/USD. Immediate resistance is near the $66,000 level. The first major resistance could be $67,200 and the trend line. If there is a clear move above the $67,200 resistance zone, the price could start a fresh increase. In the stated case, the price could rise toward the 50% Fib retracement level of the downward move from the $71,306 swing high to the $64,572 low at $67,950. Source: BTCUSD on TradingView.com The next major resistance is near the $68,500 zone. Any more gains might send Bitcoin toward the $70,000 resistance zone in the near term. More Losses In BTC? If Bitcoin fails to rise above the $67,200 resistance zone, it could continue to move down. Immediate support on the downside is near the $65,200 level. The first major support is $64,500. The next support sits at $64,000. If there is a close below $64,000, the price could start a drop toward the $62,500 level. Any more losses might send the price toward the $60,500 support zone in the near term. Technical indicators: Hourly MACD – The MACD is now losing pace in the bearish zone. Hourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level. Major Support Levels – $65,200, followed by $64,500. Major Resistance Levels – $66,000, $67,200, and $67,950."
  }
]