[
  {
    "source": "Cointelegraph",
    "date": "2023-06-09T04:42:15.000Z",
    "title": "Ripple case more crucial than ever amid Coinbase, Binance SEC crackdown: Lawyers ",
    "url": "https://cointelegraph.com/news/ripple-sec-case-outcome",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/cd518600-0012-4444-85c9-cdebf5dcfe1e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Whether XRP is ruled as a security or not in the Ripple case will certainly have an influence on the two latest crypto exchange lawsuits, crypto lawyers told Cointelegraph.</p>\n                    <p><p>The judges presiding over Coinbase and Binance’s lawsuits will likely watch the results of the SEC v Ripple case closely, crypto lawyers told Cointelegraph.</p><p>Ripple has been in a legal battle with the SEC since December 2020. The regulator alleges it was offering unregistered securities via XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) since 2013.</p><p>On June 6 the SEC filed a <a href=\"https://cointelegraph.com/news/sec-sues-coinbase-crypto-exchange\">lawsuit against Coinbase</a> also alleging that it has been offering unregistered securities. A day before it filed a <a href=\"https://cointelegraph.com/news/sec-sues-binance-in-us-district-court-for-unregistered-securities-operations\">lawsuit against Binance</a> containing some similar allegations. </p><p>Lawyer James Murphy, known as “MetaLawMan” on Twitter, explained in a series of tweets on June 9 that a favorable outcome for Ripple could “undermine the entire basis for the SEC’s case” against both, Coinbase, and Binance.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1/ The stakes just keep getting higher for the ruling in SEC v. <a href=\"https://twitter.com/Ripple?ref_src=twsrc%5Etfw\">@Ripple</a>. <br><br>Here&#39;s why.<br><br>If Judge Torres rules that <a href=\"https://twitter.com/search?q=%24XRP&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$XRP</a> tokens trading on secondary markets are Not Securities--it would undermine the entire basis for the SEC&#39;s case against <a href=\"https://twitter.com/coinbase?ref_src=twsrc%5Etfw\">@Coinbase</a> and much of the <a href=\"https://twitter.com/binance?ref_src=twsrc%5Etfw\">@Binance</a> case.</p>&mdash; MetaLawMan (@MetaLawMan) <a href=\"https://twitter.com/MetaLawMan/status/1666864200147251201?ref_src=twsrc%5Etfw\">June 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>However, he also warned that “before anyone gets too excited,” a ruling by Judge Torres in the Ripple case would not be “binding precedent” for these recent filings.</p><p>This means that the judges for the Coinbase and Binance lawsuit, will “not be bound to rule the same way,” as only decisions of the Court of Appeals and the Supreme Court have that influence.</p><p>Speaking to Cointelegraph, pro-XRP lawyer John Deaton believes the SEC is “well aware” that Judge Torres’ decision in the Ripple case will be published “in the very near future.”</p><p>Deaton believes that the SEC purposefully filed these new cases ahead of that result, in case the regulator faces an unfavorable outcome in the Ripple case, stating:</p><blockquote>“I believe the SEC wanted to get those cases filed before that decision just in case it is a bad result for the SEC, possibly causing it to lose some political and legal momentum.”</blockquote><p>Murphy believes the judge assigned to the Coinbase case, Judge Reardon, “will pay very close attention” to the determination of whether XRP is a security or not, pointing out that they serve in the same Lower Manhattan court.</p><p>He believes that Reardon would “follow the same reasoning” as to whether the 13 tokens cited in the Coinbase complaint are securities, adding that this can go “both ways,” if it’s a favorable outcome for the SEC.</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">6/ This dynamic, of course, works both ways.<br><br>If Judge Torres rules that <a href=\"https://twitter.com/search?q=%24XRP&amp;src=ctag&amp;ref_src=twsrc%5Etfw\">$XRP</a> tokens traded on secondary markets ARE securities, <br><br>the SEC will jump for joy and argue that the judges presiding over the <a href=\"https://twitter.com/coinbase?ref_src=twsrc%5Etfw\">@Coinbase</a> and <a href=\"https://twitter.com/binance?ref_src=twsrc%5Etfw\">@Binance</a> cases should follow Judge Torres&#39; reasoning.</p>&mdash; MetaLawMan (@MetaLawMan) <a href=\"https://twitter.com/MetaLawMan/status/1666864206199545858?ref_src=twsrc%5Etfw\">June 8, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>XRP-friendly lawyer Bill Morgan, a consultant at Morgan Mac Lawyers, also opined that the Ripple case could have an influence over the Binance and Coinbase cases.</p><p>Morgan explained that the outcome in the Ripple lawsuit can be used as an “advantage” for either the industry or the SEC, depending on the result.</p><blockquote>“If they lose badly in the Ripple case, they go forwards with Coinbase and Binance with a substantial judgment against them. Obviously Coinbase and Binance will use that to their advantage that the sales of XRP is not an investment contract.”</blockquote><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/pro-xrp-attorney-s-phone-hacked-to-promote-law-token\"><strong><em>Pro-XRP attorney’s phone hacked to promote LAW token</em></strong></a></p><p>Deaton noted that he actually predicted back in 2022 that the SEC would sue Coinbase and Binance “by the way the SEC was approaching the Ripple and XRP case.”</p><p>However, he believes that the SEC will tone down its action against crypto firms once the major financial institutions adopt a greater share of the crypto market.</p><p>“Once JPMorgan, Goldman Sachs or other traditional players get a bigger slice of the crypto market then the SEC will become more reasonable” he stated.</p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/pro-xrp-lawyer-john-deaton-10x-more-into-btc-4x-more-into-eth-hall-of-flame/\"><strong><em>Pro-XRP lawyer John Deaton ‘10x more into BTC, 4x more into ETH’: Hall of Flame</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"crypto_biz\"></template></p>\n                \n            "
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-06-09T05:00:06.000Z",
    "title": "Chancer Offers Token Presale. How Does CHANCER Compare To Solana?",
    "url": "https://www.crypto-news-flash.com/chancer-offers-token-presale-how-does-chancer-compare-to-solana/?utm_source=rss&utm_medium=rss&utm_campaign=chancer-offers-token-presale-how-does-chancer-compare-to-solana",
    "description": "<p>Crypto enthusiasts and betting fans have cause to celebrate, as the highly anticipated Chancer platform recently announced plans for a CHANCER token presale. The Chancer presale event will see CHANCER tokens initially made available for only $0.01, rising to $0.21 by the final round of the 12 stage event. Many investors are already making plans [...]</p>\n<p>Der Beitrag <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com/chancer-offers-token-presale-how-does-chancer-compare-to-solana/\">Chancer Offers Token Presale. How Does CHANCER Compare To Solana?</a> erschien zuerst auf <a rel=\"nofollow\" href=\"https://www.crypto-news-flash.com\">Crypto News Flash</a>.</p>\n"
  }
]