[
  {
    "source": "CoinDesk",
    "date": "2023-08-16T21:40:00.000Z",
    "title": "Shiba Inu’s Ethereum Layer-2 Blockchain Shibarium Goes Live Amid Push for DeFi Growth",
    "url": "https://www.coindesk.com/tech/2023/08/16/shiba-inus-ethereum-layer-2-blockchain-shibarium-goes-live-amid-push-for-defi-growth/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "The much-awaited Shibarium network saw over 21 million wallets created during its testnet phase and is expected to position Shiba Inu as a serious DeFi contender."
  },
  {
    "source": "Decrypt",
    "date": "2023-08-16T21:41:02.000Z",
    "title": "SHIB Developers Deploy Layer-2 Shibarium to Ethereum Mainnet",
    "url": "https://decrypt.co/152684/shib-developers-deploy-layer-2-shibarium-ethereum-mainnet",
    "description": "The speedy layer-2 network is expected to support the various other canine components of an emerging \"Shiba Inu State.\""
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-16T22:00:00.000Z",
    "title": "Strict Canadian crypto exchange rules allowed Kraken clarity to invest there, exec says",
    "url": "https://cointelegraph.com/news/strict-canadian-crypto-exchange-rules-allowed-kraken-clarity-to-invest-there-exec-says",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/0a44f293-a6bc-4c84-b894-44cddc4596e9.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Kraken’s Canada managing director told Cointelegraph in an interview that attaining restricted dealer status provided a clear regulatory pathway.</p>\n                    <p><p>Size and energy allowed Kraken to stay in Canada after the imposition of new registration requirements for crypto exchanges in February. But in spite of the demanding process, the regulatory clarity has benefited the company, Kraken managing director for Canada Mark Greenberg said.</p><p>Speaking to Cointelegraph’s Sam Bourgi at the Blockchain Futurist Conference in Toronto, Greenberg had positive things to say about the Canadian regulatory environment:</p><blockquote>“The Canadian regulators have been collaborative, helpful. […] There’s a clear regulatory pathway. It’s allowed us to invest in the country.”</blockquote><p>Kraken has a staff of over 250 in Canada, Greenberg said. That strong base has been key to the company’s success in the country. After registration rules for crypto exchanges <a href=\"https://cointelegraph.com/news/new-canadian-rules-for-crypto-trading-platforms-leave-little-room-for-stablecoins\">were tightened in Canada in February</a> by the Canadian Securities Administrators, requiring them to register as  restricted dealers, some exchanges, such as OKX, <a href=\"https://cointelegraph.com/news/okx-to-cease-operations-in-canada-by-june-22-2023\">left the country</a>. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/coinbase-vp-says-canada-can-be-a-global-leader-in-crypto\">Coinbase VP says Canada can be a ‘global leader’ in crypto</a></em></strong></p><p>“It’s not the easiest thing to meet those requirements,” Greenberg said, “especially for smaller platforms […] that just weren’t able to put that kind of energy against it.” </p><p>Kraken, however, reiterated its commitment to Canada, where it has been operating with money service business registration since 2011. “It took a lot of work for us,” Greenberg continued. “We’re lucky in that we have a great user base here in Canada, and we were able to make those costs work.”</p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">&quot;We need to solve the fraud problem, we need to solve scams, and we need to stop talking about it as a crypto-specific issue.&quot;<br><br>On his panel at the <a href=\"https://twitter.com/Futurist_conf?ref_src=twsrc%5Etfw\">@Futurist_conf</a>, Kraken MD of Canada <a href=\"https://twitter.com/marklg?ref_src=twsrc%5Etfw\">@marklg</a> spoke about the importance of addressing fraud in the financial world.<a href=\"https://twitter.com/hashtag/Futurist23?src=hash&amp;ref_src=twsrc%5Etfw\">#Futurist23</a> <a href=\"https://t.co/UdP5Z56alx\">pic.twitter.com/UdP5Z56alx</a></p>&mdash; Kraken Exchange (@krakenfx) <a href=\"https://twitter.com/krakenfx/status/1691837545263349823?ref_src=twsrc%5Etfw\">August 16, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>On-ramps and off-ramps remain challenging. The five major banks in Canada “have typically been relatively hostile to crypto,” according to Greenberg. It is possible to make fiat payments to crypto exchanges or receive fiat from them in person at Canada Post. In addition, Kraken has partnered with the Canadian payment service Payper to provide instant e-money transfers of up to 3,000 Canadian dollars. </p><p>“We have many rails we hope to build over the coming months and years,” Greenberg said.</p><p><strong><em>Magazine: <a href=\"https://cointelegraph.com/magazine/crypto-city-ultimate-guide-toronto/\">Your guide to crypto in Toronto: Crypto City</a></em></strong></p><template data-name=\"subscription_form\" data-type=\"law_decoded\"></template></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-16T21:57:27.000Z",
    "title": "Canada’s regulatory clarity is bringing institutions to crypto - WonderFi CEO",
    "url": "https://cointelegraph.com/news/canada-s-regulatory-clarity-is-bringing-institutions-to-crypto-wonderfi-ceo",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/09821cb3-1005-41dd-972d-ddddfdd50c4a.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Dean Skurka stated that although regulations have increased cost, they have also led to greater interest in crypto from institutions.</p>\n                    <p><p>Canadian financial institutions are increasingly taking an interest in crypto as regulatory clarity emerges in the country, according to WonderFi CEO Dean Skurka, who met up with Cointelegraph at the Blockchain Futurist conference in Toronto.</p><p>Skurka claimed that his exchange has seen an uptick in trading by institutions as opposed to retail investors. “What we have seen in the first half of this year is growth in our OTC institutional segment,” he stated. “These institutional investors, more sophisticated investors, are [more] immune to sentiment and trends in the market, and they’re more fundamental in their investment approaches[...]We’re starting to see,[...]through clear regulation, that the segment of our client base is shifting quite a bit.”</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-08/a68f14f5-62a7-43f4-ab9a-f8a0592f658c.jpeg\"><figcaption style=\"text-align: center;\"><em>Cointelegraph's Sam Bourgi and WonderFi CEO Dean Skurka at the Blockchain Futurist conference in Toronto, August 16, 2023.</em></figcaption></figure><p>The Canadian government has been criticized for allegedly making regulations that are too difficult for crypto exchanges to follow, and some major crypto exchanges have left the market altogether. For example, Bybit announced on May 30 that it <a href=\"https://cointelegraph.com/news/crypto-exchange-bybit-exits-canada-citing-recent-regulatory-development\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/crypto-exchange-bybit-exits-canada-citing-recent-regulatory-development/amp\">would no longer allow new Candian accounts to be opened</a>, due to “recent regulatory development” and Binance <a href=\"https://cointelegraph.com/news/binance-calls-it-quits-in-canada-blames-new-rules\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/binance-calls-it-quits-in-canada-blames-new-rules/amp\">closed its service</a> to Canadians on May 12, citing new stablecoin regulations as the reason.</p><p>But in Skurka’s view, clear regulations in Canada have been a boon for WonderFi. He stated:</p><blockquote>“Through the platforms that we own and operate, having the licenses that we do, there are fewer venues that can offer [crypto services] to an institutional audience[...]We’ve seen an increase in activity, not only on the institutional side, but also on products that we’ve rolled out that are catered to long-term holders like staking.”</blockquote><p><strong>Related: </strong><a href=\"https://cointelegraph.com/news/from-the-u-s-to-japan-regulators-are-beginning-to-embrace-crypto\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/from-the-u-s-to-japan-regulators-are-beginning-to-embrace-crypto/amp\"><strong>From the U.S. to Japan, regulators are beginning to embrace crypto</strong></a></p><p>Skurka emphasized that until recently, long-term holders in Canada were left without services that suited their needs, as lending platforms like Celsius and Voyager had gone bankrupt. On the other hand, new regulations created in reaction to these bankruptcies have increased the cost of running an exchange. In Skurka’s view, this meant that the crypto market needed to consolidate in order to be able to handle the new costs. He said WonderFi has been attempting to “use this opportunity to bring these platforms together really on the basis that[...]you're creating a clear market leader that has the scale to operate in a compliant environment.”</p><p>WonderFi has been gobbling up smaller Canadian crypto exchanges over the past two years. It <a href=\"https://cointelegraph.com/news/kevin-o-leary-backed-wonderfi-to-acquire-canadian-crypto-exchange-coinberry-for-38-5m\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/kevin-o-leary-backed-wonderfi-to-acquire-canadian-crypto-exchange-coinberry-for-38-5m/amp\">acquired Bitbuy and Coinberry</a> in 2022, then <a href=\"https://cointelegraph.com/news/wonderfi-merges-with-coinsquare-and-coinsmart-to-form-regulated-crypto-asset-platform\" data-amp=\"https://cointelegraph-com.cdn.ampproject.org/c/s/cointelegraph.com/news/wonderfi-merges-with-coinsquare-and-coinsmart-to-form-regulated-crypto-asset-platform/amp\">announced a merger with Coinsquare and Coinsmart</a> in April, 2023.</p><p>The WonderFi CEO stated that he thinks this new trend of institutional interest will continue into the future, thanks to the direction the Canadian government is taking. “As that infrastructure is established, you’re going to see institutional participants continue to take it more seriously,” he claimed.</p><p><em>This article is based on an interview conducted by Sam Bourgi.</em></p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template>\n</p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-16T21:40:00.000Z",
    "title": "Shiba Inu’s Shibarium Ethereum L2 blockchain goes live on mainnet",
    "url": "https://cointelegraph.com/news/shiba-inu-shibarium-ethereum-l2-blockchain-goes-live-mainnet",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/41e02fef-a499-461e-acdc-c02a3a70f567.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Shibarium’s beta phase saw a total of 21 million wallets on the L2, driving the interest of users months before the launch.</p>\n                    <p><p>Shiba Inu launched the Shibarium mainnet, an Ethereum layer-2 scaling solution, on Aug. 16 after months of testing that saw millions of users participate and 21 million wallets created.</p><p>Shibarium is built on a new consensus mechanism called proof-of-participation (PoP), which works by selecting validators in proportion to their quantity of holdings in the associated cryptocurrency. This is done to avoid the computational cost of proof-of-work schemes. The new L2 blockchain solution is designed to interact with the primary Ethereum layer-1 blockchain, providing a more scalable and cost-effective transaction platform.</p><p>Shiba Inu (<a href=\"https://cointelegraph.com/shiba-inu-price-index\">SHIB</a>) rose to popularity during the bull market of 2020–2021, even briefly overtaking the OG meme cryptocurrency, Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>). However, it couldn’t hold onto its gains for long and lost more than 80% of its valuation during the bear market. </p><p>The price decline didn’t deter the Shiba Inu community, which built a decentralized ecosystem around the cryptocurrency comprising a decentralized exchange, ShibaSwap, and a native token, BONE, along with a metaverse and a Web3 game. The price of SHIB also surged to a new multiweek high in anticipation of Shibarium’s launch.</p><p>Prior to the mainnet launch, Shiba Inu’s lead developer, who goes by the pseudonym Shytoshi Kusama, noted that the L2 has already gained a lot of traction from new projects. In a post on X (formerly known as Twitter), the developer shared a screenshot of companies currently developing on Shibarium, suggesting over 100 companies are already using it.</p><blockquote class=\"twitter-tweet\"><p lang=\"ja\" dir=\"ltr\">Builders on <a href=\"https://twitter.com/hashtag/Shibarium?src=hash&amp;ref_src=twsrc%5Etfw\">#Shibarium</a> <br><br>既にこんなに多くのプロジェクトが集まってる!!<a href=\"https://twitter.com/hashtag/SummerOfShibarium?src=hash&amp;ref_src=twsrc%5Etfw\">#SummerOfShibarium</a> <a href=\"https://t.co/rn3PZvTkpV\">pic.twitter.com/rn3PZvTkpV</a></p>&mdash; KUROSHIBARMY JPN (@kuro_9696_9696) <a href=\"https://twitter.com/kuro_9696_9696/status/1691483805969006592?ref_src=twsrc%5Etfw\">August 15, 2023</a></blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>In an exclusive conversation with Cointelegraph, Kusama noted that many people in the tech world are talking about an “everything app,” but these innovations must be carried out from a community and decentralization perspective. He added that Shibarium incorporates both these principles in its operations while honoring “the principles of decentralization, interoperability and user-centric design for both blockchain and the technology sector at large.”</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/why-is-shiba-inu-price-up-today\">Why is Shiba Inu price up today?</a></em></strong></p><p>Kusama further elaborated and said that the validator and delegator aspects of the new L2 will keep Shibarium decentralized, but that the true innovation lies in the framework, governance and charter to help govern the ecosystem’s technology, community, protective and innovative aspects.</p><blockquote>“By using Shibarium for governance in this system, alongside self-sovereign identity to ensure quality membership (Shibizenship), the metaverse as our territory, and the ability to partner with other like-minded states, we have effectively shattered what nationhood is and rebuilt it upon the Shib ethos of decentralization!”</blockquote><p>Shibarium will make use of the Heimdall validator and Bor block production nodes, quite similar to the Polygon ecosystem. Heimdall will be based on the Tendermint consensus engine, while Bor will be completely interoperable with the Ethereum Virtual Machine. </p><p>Users must lock 10,000 BONE in the Shibarium network to become validators. Twenty-one million BONE will be reserved as rewards for validators and delegators inside the Shibarium ecosystem and used to pay authorized gas charges. </p><p><strong><em>Magazine: </em></strong><a href=\"https://cointelegraph.com/magazine/deposit-risk-crypto-exchanges-money/\"><strong><em>Deposit risk: What do crypto exchanges really do with your money?</em></strong></a></p><template data-name=\"subscription_form\" data-type=\"defi_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-16T22:00:52.000Z",
    "title": "Cleveland Fed nowcasts signal escalating inflation pressures, crypto market bracing for impact",
    "url": "https://cryptoslate.com/insights/cleveland-fed-nowcasts-signal-escalating-inflation-pressures-crypto-market-bracing-for-impact/",
    "description": "<p>Quick Take The Federal Reserve Bank of Cleveland&#8217;s innovative approach to analyzing inflation presents a concerning picture. Utilizing its inflation nowcasting tool, the Bank provides daily nowcasts for two pivotal price indexes &#8211; the price index for Personal Consumption Expenditures (PCE) and the Consumer Price Index (CPI). According to the Bank&#8217;s August data, the CPI [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/insights/cleveland-fed-nowcasts-signal-escalating-inflation-pressures-crypto-market-bracing-for-impact/\">Cleveland Fed nowcasts signal escalating inflation pressures, crypto market bracing for impact</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T22:06:25.000Z",
    "title": "FTX founder Bankman-Fried exploited $100 million users funds on political donations, prosecutors claim",
    "url": "https://www.cryptopolitan.com/ftx-founder-gave-100m-political-donations/",
    "description": "Authorities have levied allegations against the FTX founder, Sam Bankman-Fried (SBF), asserting he diverted over $100 million of user funds for political endeavors. Fresh filings this week unveil claims he cleverly maneuvered funds via two high-ranking FTX affiliates to navigate around donation limits. FTX Founder’s strategy: Casting nets on both sides The spotlight is firmly ... <a title=\"FTX founder Bankman-Fried exploited $100 million users funds on political donations, prosecutors claim\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ftx-founder-gave-100m-political-donations/\" aria-label=\"More on FTX founder Bankman-Fried exploited $100 million users funds on political donations, prosecutors claim\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-16T21:50:34.000Z",
    "title": "Binance Connect unexpectedly shuts down after 2 years in operation",
    "url": "https://www.cryptopolitan.com/binance-connect-has-shut-down/",
    "description": "Binance, a dominant force in the cryptocurrency industry, is once again making waves. Binance Connect, a key segment of the Binance trading universe specializing in regulated cryptocurrency transactions, is slated to cease its operations by Aug. 16.  Binance Connect&#8217;s evolving business trajectory Amidst the news of this shutdown, Biswap, a decentralized exchange powered by the ... <a title=\"Binance Connect unexpectedly shuts down after 2 years in operation\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-connect-has-shut-down/\" aria-label=\"More on Binance Connect unexpectedly shuts down after 2 years in operation\">Read more</a>"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-16T22:01:08.000Z",
    "title": "Filecoin (FIL) Miners Charged by Chinese Authorities in Alleged $83,000,000 Scheme",
    "url": "https://dailyhodl.com/2023/08/16/filecoin-fil-miners-charged-by-chinese-authorities-in-alleged-83000000-scheme/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/10/Crypto-Policy-in-China.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" fetchpriority=\"high\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/10/Crypto-Policy-in-China.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/10/Crypto-Policy-in-China.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/10/Crypto-Policy-in-China.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/10/Crypto-Policy-in-China.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/10/Crypto-Policy-in-China.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/10/Crypto-Policy-in-China.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>A Filecoin (FIL) mining company is facing charges from Chinese authorities over allegations of running an $83 million pyramid scheme. According to a new social media post, the local court in Pingnan county in the Guangxi autonomous region says criminal proceedings have begun against one of the country&#8217;s largest Filecoin mining companies, Shenzhen Shikongyun Technology [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/16/filecoin-fil-miners-charged-by-chinese-authorities-in-alleged-83000000-scheme/\">Filecoin (FIL) Miners Charged by Chinese Authorities in Alleged $83,000,000 Scheme</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]