[
  {
    "source": "Decrypt",
    "date": "2023-06-22T17:13:03.000Z",
    "title": "Degens Have Bet $170K in Crypto on Missing Titanic Submarine Being Found",
    "url": "https://decrypt.co/145813/degens-bet-160k-crypto-missing-titanic-submarine-being-found",
    "description": "As the submarine drama unfolds, crypto gamblers on Polymarket are betting on whether the manned vessel will be found by the end of Friday."
  },
  {
    "source": "Decrypt",
    "date": "2023-06-22T17:11:27.000Z",
    "title": "BitGo Cancels Prime Trust Acquisition, Users Report Frozen Withdrawals",
    "url": "https://decrypt.co/145804/bitgo-cancels-prime-trust-acquisition-users-report-frozen-withdrawals",
    "description": "Crypto custodian BitGo announced it was ending talks to acquire rival Prime Trust, ending the acquistion two weeks after it was announced."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-22T17:35:08.000Z",
    "title": "‘Bitcoin only’ buy-and-hold investment strategy outperforms altcoins over the long term — Analysis shows ",
    "url": "https://cointelegraph.com/news/bitcoin-only-buy-and-hold-investment-strategy-outperforms-altcoins-over-the-long-term-analysis-shows",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/db7eff7a-ef8d-4dd0-8f2b-3822c8ba709e.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Historical data shows that apart from a few times since 2015 when altcoins outperformed BTC, a ‘Bitcoin only’ investment strategy has fared considerably well. </p>\n                    <p><p><a href=\"https://cointelegraph.com/learn/what-is-an-altcoin-a-beginners-guide-to-cryptocurrencies-beyond-bitcoin#:~:text=An%20altcoin%20is%20an%20amalgamation,financial%20crisis%20of%202008%E2%80%9309.\">Altcoins</a> offer diverse, innovative features, promising technological advancements, and potentially lucrative investment opportunities.</p><p>Many-a-time specific altcoins post handsome gains that surpass Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>), popularly known as <a href=\"https://cointelegraph.com/news/bitcoin-dominance-hits-6-month-lows-as-metric-proclaims-new-alt-season\">altcoin season</a>. However, K33 Research analysis shows over the long-term, ‘Bitcoin only’ has been a better investment strategy than an altcoin portfolio.</p><h2>Altcoin portfolio underperformed Bitcoin over the long run</h2><p>Bitcoin has had three consecutive <a href=\"https://cointelegraph.com/news/a-brief-history-of-bitcoin-crashes-and-bear-markets-2009-2022\">bull and bear market cycles</a>, starting in 2013 with the latest one coming in 2021. In each cycle, Bitcoin’s price rose parabolically in a very short span, usually a few months, after surpassing the peak of its previous cycle. </p><p>In 2013, BTC peaked around $1,175 and after that followed a downtrend for two years. At the time, the altcoin market was in its nascent stage. The fiat onramps to Bitcoin were limited and exchanges to convert them to altcoins were rare. </p><p>However, by the end of 2015, a number of altcoins, including the <a href=\"https://cointelegraph.com/learn/history-of-ethereum-blockchain\">invention of Ethereum</a> had occurred. A few exchanges had also propped up that supported conversion of Bitcoin to other cryptocurrencies, paving the way for an altcoin market.</p><p>It was not until April 2017 when Bitcoin’s price broke above the 2013 top, that a bullish run in altcoins took place. During the second half of 2017, <a href=\"https://cointelegraph.com/news/from-2-9-billion-in-a-month-to-hundreds-dead-trends-of-the-rollercoaster-ico-market-in-18-months\">the ICO boom</a> on Ethereum and retail investment hype around Ripple’s XRP led the altcoin season as many tokens outperformed Bitcoin until January 2018. </p><p>Nevertheless, in the aftermath of the bull market, altcoins suffered relatively larger losses than Bitcoin. It suggested that altcoins surged primarily as users bought them during Bitcoin bull markets with the hope of capturing higher returns.</p><p>The chart for Bitcoin and altcoin market capitalization shows that during the bear market of 2018-2019, Bitcoin found support around $6,500 after recovering from lows of $3,250 in late 2018. However, altcoins continued to hover around the lows for most of the duration of the bear market and only reversed their trend after Bitcoin broke above its previous peak of $20,000.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/7002e2c9-4408-4fe8-9a08-e75e22513192.png\"  /><figcaption style=\"text-align: center;\"><em>Bitcoin price (top) and altcoin market capitalization (bottom). Source: TradingView</em></figcaption></figure><p>K33 Research calculated the performance of $1 investment each in 1,009 altcoins since 2015 as they entered the top 100 ranks by market capitalization on CoinMarketCap versus the same amount invested in Bitcoin simultaneously.</p><p>The altcoin portfolio would be worth approximately $7,000 today compared to $50,000 from the Bitcoin-only strategy.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/257eb4da-ad2d-4c20-b366-3ef6551777f7.jfif\"  /><figcaption style=\"text-align: center;\"><em>Altcoin vs Bitcoin performance since 2015. Source: K33 Research</em></figcaption></figure><p>Altcoins are usually narrative driven and many narratives die with the evolution of the market. For instance, privacy-based tokens were quite popular in 2017, however, due to <a href=\"https://cointelegraph.com/news/regulations-and-exchange-delistings-put-future-of-private-cryptocurrencies-in-doubt\">regulatory scrutiny</a>, these have dropped out of the top 100 rank by market capitalization. </p><p>Similarly, many DeFi tokens like Compound (<a href=\"https://cointelegraph.com/compound-price-index\">COMP</a>) and Thorchain (<a href=\"https://cointelegraph.com/thorchain-rune-price-index\">RUNE</a>) that populated the market in 2020 have dropped out of the top cryptocurrency list due to decline in DeFi usage and along with it the demand of holding non-yielding governance tokens.</p><p>Altcoins are also subject to volatility and unpredictable shifts with regulatory uncertainty hovering over most tokens. Different altcoins may experience their individual seasons at different times, and the duration of an altcoin season can vary significantly, requiring perfect timing on investor’s part to churn a profit.</p><p>K33 analysts found that since 2015 over two-thirds of the 1,009 altcoin projects that managed to creep into the top 100 rank by market capitalization have become inactive. Only 9.11% of these altcoins yielded positive returns, with only around 1.5% outpacing Bitcoin’s 50X returns.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/2afcc044-ddac-48ca-a34e-1a56e933244b.png\"  /><figcaption style=\"text-align: center;\"><em>Performance of 1,009 altcoins that entered the top 100 market capitalization rank since 2015. Source: K33 Research</em></figcaption></figure><p>The reported added that altcoins investments were profitable only two times since 2015—in 2017, when the altcoin strategy gained a significant edge due to the outperformance of ether (<a href=\"https://cointelegraph.com/ethereum-price\">ETH</a>) and XRP (<a href=\"https://cointelegraph.com/xrp-price-index\">XRP</a>) and in 2021 when the altcoin portfolio briefly approached Bitcoin's value during the Dogecoin (<a href=\"https://cointelegraph.com/doge-price-index\">DOGE</a>) and Shiba Inu (<a href=\"https://cointelegraph.com/shiba-inu-price-index\">SHIB</a>) <a href=\"https://cointelegraph.com/news/every-dog-has-its-day-dogecoin-and-shiba-inu-fetch-50-gains-as-altcoins-rally\">hype</a>.</p><p>Notably, during the second half of 2021 when Bitcoin regained the $60,000 level from March 2023 to make new <a href=\"https://cointelegraph.com/news/bitcoin-price-briefly-hits-69k-ath-before-plummeting-back-to-earth\">all-time highs at $69,000</a>, altcoins, except ETH, posted relatively dull gains.</p><h2>Positive breakout in Bitcoin’s dominance </h2><p>Besides a breakout in Bitcoin’s all-time high, another potent indicator that helps identify long term trend reversals in altcoins are breakouts in Bitcoin’s dominance levels from cricual levels.</p><p>Altcoin seasons in the previous two cycles were marked by a breakdown in Bitcoin’s dominance below 60%. After the bullish trend reversal, the bottom in Bitcoin’s dominance also coincided with the top in the total market capitalization of altcoins.</p><figure><img src=\"https://s3.cointelegraph.com/uploads/2023-06/11ddbecc-af7b-4eb1-ab33-0bf9fbd3bec6.png\"  /><figcaption style=\"text-align: center;\"><em>The total market capitalization of crypto excluding Bitcoin (top) and BTC dominance over the crypto market (below). Source: TradingView</em></figcaption></figure><p>If history repeats itself, Bitcoin’s dominance could rise further while altcoin performance remains subdued.</p><p>A breakout in Bitcoin’s dominance above <a href=\"https://cointelegraph.com/news/bitcoin-btc-reach-50-percent-market-dominance?utm_source=Telegram&amp;utm_medium=social\">the 50% level</a> on June 19, 2023, thanks to BlackRock's Bitcoin ETF filling, has opened room for <a href=\"https://cointelegraph.com/news/bitcoin-price-closer-51-attack-altcoin-cryptocurrency-market/amp\">further altcoin losses</a> as it marked a crucial historic resistance point.</p><p>In the latter half of the previous bear market that ran between 2018 and 2020, Bitcoin's dominance increased to over 70%. On the other hand, Bitcoin's performance was relatively better as its price held above the <a href=\"https://cointelegraph.com/news/markets-see-massive-selloff-bitcoin-dips-below-5-600-for-the-first-time-in-2018\">2018 lows of around $3,250</a>. K33 Research also shows that this period marked significantly poor altcoin performances, making new lows toward the end. </p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/industry-will-focus-on-bitcoin-due-to-regulators-michael-saylor\">Crypto industry ‘destined’ to be BTC-focused due to regulators: Michael Saylor</a></em></strong></p><p>K33 Research analysts added in the report that altcoin portfolios have shown the potential for extra profits on Bitcoin, however, that requires \"timing the market or picking the altcoin winners.\" Anders Helseth, VP of research at K33 Research, told <em>Cointelegraph </em>regarding DCA that,</p><blockquote>“You can create higher returns by trading market sentiment more aggressively, but it requires a lot of attention, and it is obviously more risky.\"</blockquote><p>Given that Bitcoin outperformed altcoins over the long run, an effective investment strategy for crypto investors can be <a href=\"https://cointelegraph.com/news/what-is-dollar-cost-averaging-dca-and-how-does-it-work#:~:text=What%20is%20dollar%2Dcost%20averaging%20(DCA)%3F,apply%20it%20to%20any%20market.\">dollar cost averaging</a> (DCA) into Bitcoin. </p><p>DCA means regularly investing a fixed amount of money into a particular asset over a specific period, regardless of the investment's price, to average the principal amount and remove the need to time the markets. Helseth of K33 Research commented on Bitcoin DCA strategy that \"it's a sensible, quite safe, and simple crypto investment strategy.”</p><template data-name=\"subscription_form\" data-type=\"markets_outlook\"></template><p class=\"post-content__disclaimer\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n</p><p class=\"post-content__disclaimer\">This article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n</p></p>\n                \n            "
  },
  {
    "source": "Cointelegraph",
    "date": "2023-06-22T17:30:00.000Z",
    "title": "Google launches ‘Anti Money Laundering AI’ after successful HSBC trial",
    "url": "https://cointelegraph.com/news/google-launches-anti-money-laundering-ai-after-successful-hsbc-trial",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-06/e8e13641-da4e-44e1-a50a-36e2e353c077.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Google claims the new tools are far more efficient than traditional rules-based approaches at detecting money laundering at scale. </p>\n                    <p><p>Google Cloud recently announced the launch of its “Anti Money Laundering AI” (AMLAI) service after a successful trial with London-based financial services group HSBC.</p><p>AMLAI uses machine learning to create risk profiles, monitor transactions, and analyze data. Per a blog <a href=\"https://cloud.google.com/anti-money-laundering-ai#section-6\" target=\"_blank\" rel=\"noopener nofollow\">post</a> from Google Cloud:</p><blockquote>“AI transaction monitoring replaces the manually defined, rules-based approach and harnesses the power of financial institutions’ own data to train advanced machine learning (ML) models to provide a comprehensive view of risk scores.” </blockquote><p>In practice, Google Cloud claims its trial partner, HSBC, saw an increase of two to four times the number of positive alerts and a 60% reduction in false positives.</p><iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/0aEAL9jP8Ow\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe><p>The service’s cost will vary depending on the number of customers serviced daily with the AML and risk scoring systems and how many customers are included in the training dataset used to spin the model up. </p><p>AMLAI’s launch signifies the furtherance of Google and Google Cloud’s ambitions in the fintech space. While the current AI zeitgeist centers around generative AI products such as Google’s Bard chatbot, the company has quietly been making its presence felt as both a fintech developer and banking services vendor.</p><p><strong><em>Related: </em></strong><a href=\"https://cointelegraph.com/news/google-cloud-launches-free-courses-to-help-users-build-their-own-gpt-style-ai\"><strong><em>Google Cloud launches free courses to help users build their own GPT-style AI</em></strong></a></p><p>During the COVID-19 pandemic, Google rapidly deployed a paycheck protection program loan processing tool. Over the years, the company has <a href=\"https://www.forbes.com/sites/ronshevlin/2020/05/11/google-the-next-big-fintech-vendor/?sh=5da7a84cbde8\" target=\"_blank\" rel=\"noopener nofollow\">dabbled</a> in alternative payment solutions such as its widely-adopted Google Pay service and the advent of Google-sponsored debit cards featuring NFC connectivity. </p><p>Google’s further involvement in the anti-money laundering sector could be a positive sign for the growing industry. According to an analysis from BlueWeave consulting, the global AML market size was <a href=\"https://www.blueweaveconsulting.com/report/anti-money-laundering-market\" target=\"_blank\" rel=\"noopener nofollow\">estimated</a> at roughly $3 billion in 2022 and is expected to reach nearly $8 billion by the decade's end.</p><p>Mitigating factors causing the projected growth include the rise of non-traditional payments, an ever-changing regulatory landscape, and a steadily creeping increase in the number of <a href=\"https://cointelegraph.com/news/binance-france-investigation-report\">money laundering cases</a> globally. </p><template data-name=\"subscription_form\" data-type=\"consulting_newsletter\"></template></p>\n                \n            "
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T17:34:43.000Z",
    "title": "ChatGPT-powered Copilot Inspires Bullish Sentiment and Polygon Price Recovery",
    "url": "https://www.cryptopolitan.com/chatgpt-powered-copilot-polygon-recovery/",
    "description": "After experiencing a setback due to recent legal issues, Polygon (MATIC) is displaying early indications of an impending price rally. Despite a temporary price retracement, Polygon has continued to attract new users, and the integration of an AI-based user guide, ChatGPT-powered Copilot, is expected to further enhance the platform&#8217;s appeal. With the network&#8217;s growth on ... <a title=\"ChatGPT-powered Copilot Inspires Bullish Sentiment and Polygon Price Recovery\" class=\"read-more\" href=\"https://www.cryptopolitan.com/chatgpt-powered-copilot-polygon-recovery/\" aria-label=\"More on ChatGPT-powered Copilot Inspires Bullish Sentiment and Polygon Price Recovery\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T17:13:41.000Z",
    "title": "EOS Price Prediction 2023-2032: Is EOS a good investment?",
    "url": "https://www.cryptopolitan.com/eos-price-prediction/",
    "description": "EOS Price Prediction 2023-2032 EOS, a crypto token formed by the company to promote its decentralized app creation, ranks #47, a little lower on the charts, thanks to its slightly lower market cap of $3,365,472,360. Lately, it has resumed its upward projectile with renewed activities and is viewed by some analysts as a &#8220;ticking time ... <a title=\"EOS Price Prediction 2023-2032: Is EOS a good investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/eos-price-prediction/\" aria-label=\"More on EOS Price Prediction 2023-2032: Is EOS a good investment?\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-22T17:12:00.000Z",
    "title": "Binance.US alleges misleading statement by SEC: Motion highlights concerns",
    "url": "https://www.cryptopolitan.com/binance-us-alleges-misleading-statement-by-sec-motion-highlights-concer/",
    "description": "In a recent development of the ongoing legal battle between Binance.US and the U.S. Securities and Exchange Commission (SEC), Binance.US, Binance Holdings Limited, and Binance CEO Changpeng &#8220;CZ&#8221; Zhao have filed a motion alleging that the SEC misled the public through statements issued during the securities lawsuit. The motion, filed on June 21 in the ... <a title=\"Binance.US alleges misleading statement by SEC: Motion highlights concerns\" class=\"read-more\" href=\"https://www.cryptopolitan.com/binance-us-alleges-misleading-statement-by-sec-motion-highlights-concer/\" aria-label=\"More on Binance.US alleges misleading statement by SEC: Motion highlights concerns\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-06-22T17:30:20.000Z",
    "title": "Shiba Inu Becomes 14th Largest Cryptocurrency As Bull Rally Heats Up",
    "url": "https://www.newsbtc.com/shiba-inu/shiba-inu-becomes-14th-largest-cryptocurrency-as-bull-rally-heats-up/",
    "description": "Shiba Inu has been able to reclaim its position as the 14th largest cryptocurrency in the market following a tremendous run. The meme coin has mirrored the general market sentiment and has been able to embark on an upward rally that has seen it rise double-digits in the last two days. The recovery in SHIB’s price is partly attributed to the fact that Bitcoin was able to clear the $30,000 else on Wednesday. However, on its own, the digital asset has also seen some developments that have contributed to the bullish sentiment among community members, leading to more buying activity compared to the sellers. Shiba Inu Burn Ramps Up The Shiba Inu burn has been in motion for about two years now as community members work toward reducing the number of total SHIB tokens in circulation. The first significant burn was that of Ethereum founder Vitalik Buterin which saw him burn around half of the total supply sent to him, leading to a massive rally. Related Reading: US Bitcoin Investor Trading Volume Rises, Stage Set For Another Massive Rally? After this, the Shiba Inu community burn was implemented to burn more tokens. Over time, the burn has caught on and now SHIB tokens are being sent to the burn address on a daily basis and the past day was no exception. In the last day, Shibburn, a website dedicated to tracking the number of tokens burned, reported that over 341.5 million tokens were burned across five transactions. The majority of the burn was from two addresses with one wallet burning 252,873,213 tokens and the other carrying a total of 84,405,747 tokens. In the past 24 hours, there have been a total of 341,504,230 $SHIB tokens burned and 5 transactions. Visit https://t.co/t0eRMnyZel to view the overall total of #SHIB tokens burned, circulating supply, and more. — Shibburn (@shibburn) June 22, 2023 Giving SHIB The Boost It Needs The last 24 hours have been especially good for the meme coin given that not only did its token burn ramp up but its price also saw a significant acceleration in the right direction. Just like the rest of the crypto market, SHIB’s price turned green and saw an over 10% increase in a single day. SHIB price recovers above $0.000008 &#124; Source: SHIBUSD on TradingView.com On the weekly chart, the meme coin has performed splendidly as data from Coinmarketcap shows that Shiba Inu’s price is up more than 22% already. This boost in price saw the market cap of the digital asset rise above $4.7 billion, putting it ahead of Toncoin (TON) and allowing it to reclaim its position as the 14th largest cryptocurrency in the market. Related Reading: Bullish Signal: Bitcoin Realized Profit And Loss Fall To October 2020 Levels Further good news for the meme coin is that its price is now sitting above the 20-day moving average, which paints a bullish picture for it in the short term. However, its long-term outlook is bleaker as the cryptocurrency is still firmly below its 50-day and 100-day moving averages. Follow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from iStock, chart from TradingView.com"
  }
]