[
  {
    "source": "CoinDesk",
    "date": "2023-08-03T17:44:54.000Z",
    "title": "Elon Musk’s X Seeks Data-Giant Partner to Build In-App Stock Trading Service: Semafor",
    "url": "https://www.coindesk.com/business/2023/08/03/elon-musks-x-seeks-data-giant-partner-to-build-in-app-stock-trading-service-semafor/?utm_medium=referral&utm_source=rss&utm_campaign=headlines",
    "description": "Elon Musk’s soon-to-be super app X, formerly known as Twitter, is looking for a financial-data giant to build a trading hub inside the app, news outlet Semafor reported citing documents and people familiar with the matter."
  },
  {
    "source": "Cointelegraph",
    "date": "2023-08-03T18:00:00.000Z",
    "title": "How will Bitcoin halving affect BTC price, and is DeFi dead?",
    "url": "https://cointelegraph.com/news/how-will-bitcoin-halving-affect-btc-price-and-is-defi-dead",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\"><img src=\"https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=840/https://s3.cointelegraph.com/uploads/2023-08/edb5dfca-0866-4d21-996b-ebc06c9959e4.jpg\" class=\"type:primaryImage\"></p>\n                    \n                    <p>Blockware Solutions account executive David Gamble told Market Talks host Ray Salmond that the crypto market will hit a $10 trillion market cap in the next few years. </p>\n                    <p><p>On the latest episode of <em>Market Talks</em>, host Ray Salmond spoke with Blockware Solutions account executive David Gamble about the future of Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) mining, expectations for the cryptocurrency’s price, and his views on how the decentralized finance (DeFi) sector needs to evolve. </p><p>Gamble described himself as a staunch believer in DeFi, but he added that protocols within the industry need to find ways to incorporate tokenized real-world assets instead of relying on mercenary capital and the attraction of liquid staking. According to Gamble, the steady entry of institutional investors and even central bankers experimenting with tokenized bonds and other yield-bearing assets could be a step in the right direction. </p><h2>The best time to buy Bitcoin is now</h2><p>Bitcoin’s block reward halving is less than 300 days away, and many investors expect that BTC’s price will go on a parabolic run — though this outcome is not guaranteed. The halving tends to introduce an extra dose of volatility to Bitcoin’s price and can temporarily result in challenging times for Bitcoin miners. When asked about “the best time to buy Bitcoin,” Gamble said he believes investors should be trying to buy it whenever they can. According to Gamble, the crypto sector is heading toward a $10 trillion market capitalization in the next few years, and if such a milestone is achieved, Bitcoin and other cryptocurrencies are likely to see their value significantly increase. </p><p>Gamble explained that some of the liquidity and equipment acquisition problems that plagued the sector and Bitcoin miners in previous market cycles have been resolved by ASIC marketplaces that connect buyers to sellers. These marketplaces help miners acquire gear and spin up operations faster than ever before, and if a miner becomes financially distressed, it is also easier to offload equipment to raise liquidity. </p><p>Basically, the presence of better infrastructure, participants’ more mature approach to the crypto market, and the presence of institutional investors are clear fundamentals on which investors can build an investment thesis, according to Gamble.</p><p><strong><em>Related: <a href=\"https://cointelegraph.com/news/was-sam-bankman-fried-behind-another-scam-project\">Was Sam Bankman-Fried behind a scam project?</a></em></strong></p><p>To hear more of Gamble’s thoughts on the future of the Bitcoin mining space, BTC price and the impact of the upcoming halving, tune in to the latest episode of <em>Market Talks</em>. </p><p><em>Market Talks</em> airs every Thursday, featuring interviews with some of the most influential and inspiring people from the crypto and blockchain industry. So, head over to the <a href=\"https://www.youtube.com/@cointelegraphmarketresearch\" target=\"_blank\" rel=\"noopener nofollow\">Cointelegraph Markets &amp; Research YouTube page</a>, and smash those “Like” and “Subscribe” buttons for all future videos and updates.</p></p>\n                \n            "
  },
  {
    "source": "CryptoSlate",
    "date": "2023-08-03T17:45:50.000Z",
    "title": "U.S. exchanges are seeing fewer outflows than offshore competitors",
    "url": "https://cryptoslate.com/us-exchanges-see-less-outflows-than-offshore-competitors/",
    "description": "<p>Monitoring exchange inflows and outflows is a crucial aspect of market analysis. These metrics often serve as a barometer for market sentiment, providing insights into investor behavior and potential price movements. Recent data analysis reveals a noteworthy trend in the cryptocurrency market: U.S.-based exchanges are seeing significantly fewer Bitcoin outflows than their offshore counterparts. Data [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cryptoslate.com/us-exchanges-see-less-outflows-than-offshore-competitors/\">U.S. exchanges are seeing fewer outflows than offshore competitors</a> appeared first on <a rel=\"nofollow\" href=\"https://cryptoslate.com\">CryptoSlate</a>.</p>\n"
  },
  {
    "source": "Crypto Briefing",
    "date": "2023-08-03T17:59:21.000Z",
    "title": "Curve’s crvUSD Stablecoin Recovers After Brief Depegging",
    "url": "https://cryptobriefing.com/crvusd-recovers-after-brief-depegging/?utm_source=feed&utm_medium=rss",
    "description": "Curve Finances crvUSD, its decentralized stablecoin, experienced a temporary dip in value, falling by as much as 0.35% from its peg to the U.S. dollar. The brief depegging comes after..."
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-03T18:00:00.000Z",
    "title": "BlockFi Restructure Plan Nears Completion",
    "url": "https://cryptodaily.co.uk/2023/08/blockfi-restructure-plan-nears-completion",
    "description": "<p class=\"md-end-block md-p\">Bankrupt cryptocurrency lending platform BlockFi's restructuring plan has taken a step closer to fruition, as the firm announced that its disclosure statement has received conditional approval from the U.S. Bankruptcy Court in New Jersey.</p>\n<p class=\"md-end-block md-p\">This development is a critical part of the company's mission to maximize recoveries for creditors and expedite the return of cryptocurrencies to clients, said Mark Renzi, BlockFi&rsquo;s chief restructuring officer.</p>\n<p class=\"md-end-block md-p\">The firm's restructuring plan will allow BlockFi to direct efforts towards recouping funds from other failed businesses such as Alameda Research, FTX, Three Arrows Capital, Emergent, Marex, and Core Scientific. However, the proposed plan has not been devoid of criticism,.</p>\n<p class=\"md-end-block md-p\">Organizations like FTX, Three Arrows Capital, and the Securities and Exchange Commission have voiced concerns about the plan's fairness and its potential to absolve BlockFi and its management from legal responsibility, especially with disputed transactions worth over a billion dollars hanging in the balance.</p>\n<p class=\"md-end-block md-p\">Under the new plan, BlockFi intends to refund non-wallet funds back to customers, while also creating a \"convenience claim class\" for customers with claims under $3,000, who would receive a lump sum payout equating to 50% of the total claim. The company will also refrain from clawing back amounts under $250,000 that clients properly transferred from BlockFi interest accounts or BlockFi private client accounts to wallets.</p>\n<p class=\"md-end-block md-p\">Despite the progress, hurdles remain. FTX and Three Arrows Capital have contested the disclosure statement, citing failure to meet bankruptcy code requirements and provide adewquate information for creditors to evaluate the feasibility of BlockFi's strategy. Meanwhile, the SEC has requested more detailed information on the releases.</p>\n<p class=\"md-end-block md-p md-focus\">BlockFi's restructuring process comes after allegations of fraud by the company's unsecured creditors and former CEO Zac Prince. The firm was accused of breaking promises to customers by liquidating nearly $240 million in customers' crypto, which forms part of the justification for the move to appoint a Chapter 11 trustee outside of its bankruptcy plan. The deadline for voting on BlockFi's proposed reorganization is slated for September 11.</p>\n<p class=\"md-end-block md-p\">Disclaimer: This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p>"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-08-03T17:41:42.000Z",
    "title": "NONE Token Launches the Ultimate High-End Trading Bot on Discord",
    "url": "https://cryptodaily.co.uk/2023/08/none-token-launches-the-ultimate-high-end-trading-bot-on-discord",
    "description": "<p>Dubai, Dubai, August 3rd, 2023, Chainwire</p><p>$NONE has launched as a token powering the ultimate high-end trading bot on Discord. In just three days since its launch, $NONE has gathered over 1,600 holders and earned $60,000 to be shared among its thriving community.</p><p>As the crypto market continues to evolve, traders are seeking a competitive edge to maximize their profits and stay ahead of the curve. $NONE Token answers this demand with its cutting-edge trading bot, designed to handle cryptocurrencies and NFTs with unparalleled precision and efficiency.</p><p>The $NONE trading bot boasts advanced algorithms, real-time data analysis, and smart trading strategies, all working in harmony to execute trades and secure optimal returns for its users. Whether navigating the volatile crypto landscape or exploring the booming world of non-fungible tokens, $NONE's trading bot empowers users to make informed decisions and capitalize on lucrative opportunities.</p><p>Success in the crypto space depends not only on technological prowess but also on the strength of the community that supports the project. $NONE Token has quickly garnered a dedicated following, with over 1,600 holders embracing the vision of a next-generation trading bot that levels the playing field for traders of all backgrounds.</p><p>The vibrant $NONE community is the driving force behind the project's meteoric rise, as members actively engage in discussions, share trading insights, and celebrate collective achievements. As $NONE continues to attract like-minded traders, the project's growth is propelled by a shared commitment to excellence and mutual success.</p><p>At the heart of $NONE Token's ethos is the philosophy of rewarding its community of holders. With $60,000 already earned by the project, $NONE is on a mission to share the fruits of its success with those who believed in its potential from the outset.</p><p>The earnings generated by the $NONE trading bot are distributed among holders, making each investor an active participant in the project's financial success. As $NONE expands its features and user base, the rewards for the community are set to grow, aligning the interests of investors with the project's long-term vision.</p><p>The journey of $NONE Token has only just begun, and the team is committed to an ambitious roadmap filled with innovative features.</p><p>NONE is not just a fleeting trend, but a steadfast commitment to the future. In a significant move towards transparency and trust, our CEO, Amadeo Raffy, has chosen to step into the public eye. Amadeo hails from a lineage of excellence in luxury craftsmanship, as his father is the proprietor of Bovet, one of the world's most prestigious and high-end watchmaking brands. This heritage of quality and dedication is mirrored in the vision and execution of NONE.</p><p>Upcoming developments include the much-anticipated sniper bot, designed to identify and capitalize on time-sensitive opportunities with precision and speed.</p><p>Additionally, the introduction of a referral program will incentivize community growth and further reward existing holders for their active involvement in the project's expansion. As $NONE Token continues to push the boundaries of what a trading bot can achieve, traders eagerly await the release of these exciting features.</p><p>About NONE</p><p>NONE, the premier suite of free-to-use trading tools on Discord. Designed for both cryptocurrencies and NFTs. It serves as the ultimate companion for traders at all levels. For novices, it offers an intuitive, user-friendly interface that simplifies the complexities of DeFi trading. For seasoned traders, it provides customizable settings to adapt swiftly to market changes. Furthermore, membership in the NONE community offers an added incentive: a share in the revenue generated by the bot. This unique feature fosters a sense of community and shared success among its users.</p><p>Twitter | Discord</p>ContactPressNonethcontact@noneth.io"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-08-03T17:53:50.000Z",
    "title": "Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?",
    "url": "https://www.cryptopolitan.com/alchemy-pay-price-prediction/",
    "description": "Alchemy Pay Price Predictions 2023-2032 The platform claims to make “Ethereum&#160;development easy.” Previously, the platform was only available to teams close to the project’s developers. By launching it publicly, the firm provides every developer with the tools and the platform they need to build blockchain solutions. At this time, we can only make educated guesses ... <a title=\"Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\" class=\"read-more\" href=\"https://www.cryptopolitan.com/alchemy-pay-price-prediction/\" aria-label=\"More on Alchemy Pay Price Prediction 2023-2032: Is ACH Crypto a Good Investment?\">Read more</a>"
  },
  {
    "source": "NullTX",
    "date": "2023-08-03T17:40:48.000Z",
    "title": "Solana (SOL) Struggles at $30, DigiToads (TOADS) Remains Bullish for Investors",
    "url": "https://nulltx.com/solana-sol-struggles-at-30-digitoads-toads-remains-bullish-for-investors/",
    "description": "Cryptocurrency investors are always on the lookout for promising projects that offer both stability and significant growth potential. Solana (SOL) and DigiToads (TOADS) have emerged as notable contenders in the market, each with its own unique trajectory. While SOL is facing challenges in maintaining a $30 price point, TOADS continues to garner interest from investors [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-03T18:00:32.000Z",
    "title": "Quant Explains How These Indicators Affect Ethereum Price",
    "url": "https://www.newsbtc.com/news/ethereum/quant-explains-how-these-indicators-affect-ethereum-price/",
    "description": "A quant has explained how the indicators like taker buy/sell ratio and Coinbase premium index can influence the price of Ethereum. Ethereum&#8217;s Relationship With Taker Buy/Sell Ratio &#38; Coinbase Premium Index In a new CryptoQuant quicktake post, an analyst has discussed some metrics that could hold relevance for the ETH price. The first indicator of interest here is the &#8220;taker buy/sell ratio,&#8221; which tells us about the ratio between the Ethereum buy and sell orders in the market right now. When this metric has a value greater than 1, it means that the taker buy volume is higher than the taker sell volume. Such a trend implies that the majority of the investors are bullish on the asset currently. On the other hand, values below the threshold naturally imply the dominance of bearish sentiment, as there are currently more sell orders present on exchanges. Now, here is a chart that shows the trend in the 50-day moving average (MA) Ethereum taker buy/sell ratio over the past few years: The potential relationship between these indicators and the value of the cryptocurrency &#124; Source: CryptoQuant As you can see in the above graph, the quant has highlighted the pattern that the Ethereum price and the 50-day MA taker buy/sell ratio have possibly followed during the past couple of years. It would appear that whenever the value of the asset has rallied, the taker buy/sell ratio has gone down. This would suggest that the sell orders on the market pile up as the ETH price trends up. Related Reading: Bitcoin Funding Rates Most Positive Since Feb, Long Squeeze Soon? The analyst notes that this is naturally because the investors become more cautious as the price continues to rise since they think a correction may be coming soon. The sell orders continue until the cryptocurrency has topped out, and once the decline hits the asset, the buy orders start going up instead. From the chart, it&#8217;s visible that significant accumulation periods have generally paved the way for the price to bottom out and begin another rally. The quant has also attached data for another metric: the Coinbase Premium Index. This indicator keeps track of the difference in the Ethereum prices listed on Coinbase and Binance. Whenever this metric has a positive value, it means that the Coinbase platform has BTC listed at a higher price than Binance currently. This implies that buying pressure has been stronger from US-based investors, who usually use the former exchange. Similarly, negative values imply just the opposite. According to the analyst, major fluctuations in the Ethereum price have generally come with strong changes in the Coinbase premium index, a possible sign that activity on the exchange is the driver for these price moves. Currently, the 50-day MA taker buy/sell ratio is at relatively low values and is looking to turn around, although this trend shift towards buy order dominance isn&#8217;t confirmed just yet. Related Reading: Litecoin Completes Halving, But Price Plunges 6% The Coinbase Premium Index is at neutral values, implying that there hasn&#8217;t been any trading activity happening on the platform that&#8217;s different from Binance. Given these trends, it&#8217;s possible that Ethereum may not see any big moves in the near future. ETH Price At the time of writing, Ethereum is trading around $1,830, up 2% in the last week. ETH has erased its gains from yesterday &#124; Source: ETHUSD on TradingView Featured image from DrawKit Illustrations on Unsplash.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "NewsBTC",
    "date": "2023-08-03T17:49:26.000Z",
    "title": "Breaking: Elon Musk’s X To Launch Trading App, Dogecoin To Play A Part?",
    "url": "https://www.newsbtc.com/breaking-news-ticker/breaking-elon-musks-x-to-launch-trading-app-dogecoin-to-play-a-part/",
    "description": "According to a recent report by Semafor, the company formerly known as Twitter (X) is making waves yet again, as it seeks to transform itself into a financial data giant by building a trading hub within its app. Will Dogecoin take the center of the stage? Elon Musk&#8217;s X Set To Disrupt Traditional Trading Platforms? In a request for plans viewed by Semafor and individuals familiar with the matter, the company outlined its vision for integrating financial content, real-time stock data, and other features into its platform.  The request emphasizes the power of real-time information in the world of investing and highlights the enormous user base of &#8220;hundreds of millions of highly-qualified users&#8221; that the company can offer to potential partners. Related Reading: Why The Uniswap (UNI) Token Is Almost Worthless: Researcher One striking aspect of the request is the absence of any mention of compensation. Instead, interested bidders are asked to state how much money they are willing to commit to the project themselves.  This unconventional approach reflects the company&#8217;s determination to forge a new path and disrupt the industry without relying on traditional financial partnerships or revenue models. The comparison to WeChat in China, Gojek in Indonesia, Grab in Singapore, and Gozem in Africa further illustrates the company&#8217;s ambition.  These “super-apps” have transformed the way people in their respective regions interact with technology, offering a wide range of services within a single platform. By positioning itself as the first Western super-app, the company aims to disrupt the traditional trading platforms. Dogecoin Integration On X&#8217;s Trading App? Twitter&#8217;s latest move to introduce a feature allowing users to access live stock charts by simply searching for a &#8220;cashtag&#8221; has sparked intrigue and speculation in the online community.  With cashtag clicks experiencing a remarkable 51% growth over the past two months, it&#8217;s clear that Twitter is onto something potentially lucrative. This feature could not only attract users but also generate revenue for the company through partnerships with data startups like TradingView. Related Reading: Shiba Inu Notches New Adoption Record In Anticipation Of Shibarium Launch On the other hand, Musk&#8217;s support for Dogecoin has been well-documented, and now, with the introduction of his new trading app, speculation is growing about the potential impact on the meme coin&#8217;s price. When writing, Dogecoin is trading at $0.07461, maintaining its price level for the past 24 hours. Nevertheless, the introduction of Musk&#8217;s trading app has the potential to ignite a new wave of enthusiasm for Dogecoin, leading to an increase in its value. However, it&#8217;s worth noting that Twitter&#8217;s plans to incorporate a one-click option to buy and sell stocks on eToro, a competitor to Robinhood, have been delayed.  Initially slated for an April launch, this feature has yet to materialize. The potential to refer users to a brokerage platform like eToro could be a significant revenue stream for Twitter, as it seeks to regain the advertisers it lost after Elon Musk&#8217;s takeover. While Twitter&#8217;s foray into financial services and e-commerce may seem like a bold and innovative move, it is not without its challenges. Other social media giants in the United States, such as Snapchat and Meta (formerly Facebook), have attempted similar ventures with little success. Featured image from iStock, chart from TradingView.com"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-03T18:06:51.000Z",
    "title": "Bitcoin Spot ETF Approval by US SEC Sees Odds Rise to 65%, Bloomberg Reports – Billions Set to Flood The BTC Market Soon",
    "url": "https://www.crypto-news-flash.com/bitcoin-spot-etf-approval-by-us-sec-sees-odds-rise-to-65-bloomberg-reports-billions-set-to-flood-the-btc-market-soon/?utm_source=rss&utm_medium=rss&utm_campaign=bitcoin-spot-etf-approval-by-us-sec-sees-odds-rise-to-65-bloomberg-reports-billions-set-to-flood-the-btc-market-soon",
    "description": "<img width=\"625\" height=\"343\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/bitcoin-btc.bmp\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"bitcoin btc\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2020/07/bitcoin-btc.bmp 625w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/bitcoin-btc-300x165.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/bitcoin-btc-24x13.jpg 24w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/bitcoin-btc-36x20.jpg 36w, https://www.crypto-news-flash.com/wp-content/uploads/2020/07/bitcoin-btc-48x26.jpg 48w\" sizes=\"(max-width: 625px) 100vw, 625px\" />SEC Chair Gary Gensler has toned down on the topic of crypto regulations amid increased political pressure from Congress. The analysts argue that the SEC’s seeming approval of Coinbase as a crypto trading platform increases the odds of a Bitcoin ETF soon. The recent spot Bitcoin ETF frenzy has undeniably awakened the hope for approval [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-03T18:00:54.000Z",
    "title": "Analysts expect 4x returns on Bitcoin, 6x returns on Ethereum, and 130x returns on Bitcoin Spark",
    "url": "https://www.crypto-news-flash.com/analysts-expect-4x-returns-on-bitcoin-6x-returns-on-ethereum-and-130x-returns-on-bitcoin-spark/?utm_source=rss&utm_medium=rss&utm_campaign=analysts-expect-4x-returns-on-bitcoin-6x-returns-on-ethereum-and-130x-returns-on-bitcoin-spark",
    "description": "<img width=\"512\" height=\"384\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T115635.783.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T115635.783.jpg 512w, https://www.crypto-news-flash.com/wp-content/uploads/2023/08/unnamed-2023-08-03T115635.783-300x225.jpg 300w\" sizes=\"(max-width: 512px) 100vw, 512px\" />The birth of Bitcoin gave rise to a new class of digital assets that have been attractive to enterprising individuals. Since the inauguration of Bitcoin, investors have shifted their focus to crypto projects to benefit from capital gains as these projects gain massive popularity for solving issues using the blockchain network. On average, Bitcoin offers [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-03T18:00:41.000Z",
    "title": "Will an Ethereum ETF be Approved Ahead of a Bitcoin ETF? Insider Gives Shares Insight",
    "url": "https://www.crypto-news-flash.com/will-an-ethereum-etf-be-approved-ahead-of-a-bitcoin-etf-insider-gives-shares-insight/?utm_source=rss&utm_medium=rss&utm_campaign=will-an-ethereum-etf-be-approved-ahead-of-a-bitcoin-etf-insider-gives-shares-insight",
    "description": "<img width=\"881\" height=\"590\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/ETH-betting.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/ETH-betting.jpg 881w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/ETH-betting-300x201.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/ETH-betting-104x69.jpg 104w\" sizes=\"(max-width: 881px) 100vw, 881px\" />Volatility Shares and other top financial giants recently filed for Ethereum futures ETFs with the SEC. Sources familiar with the matter said that the SEC has expressed its preparedness to openly evaluate such a product. While the crypto community was already cheering the spot Bitcoin ETF applications from BlackRock and other financial giants, there&#8217;s some [...]"
  },
  {
    "source": "Crypto News Flash",
    "date": "2023-08-03T17:56:33.000Z",
    "title": "Worldcoin’s ID System to Be Accessible for Governments and Businesses, Per Report",
    "url": "https://www.crypto-news-flash.com/worldcoins-id-system-to-be-accessible-for-governments-and-businesses-per-report/?utm_source=rss&utm_medium=rss&utm_campaign=worldcoins-id-system-to-be-accessible-for-governments-and-businesses-per-report",
    "description": "<img width=\"1176\" height=\"1056\" src=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/privacy.jpg\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://www.crypto-news-flash.com/wp-content/uploads/2022/12/privacy.jpg 1176w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/privacy-300x269.jpg 300w, https://www.crypto-news-flash.com/wp-content/uploads/2022/12/privacy-1024x920.jpg 1024w\" sizes=\"(max-width: 1176px) 100vw, 1176px\" />Worldcoin promotes its digital ID system for expansion, despite criticism over iris-scanning technology. The digital ID system seeks adoption by regular businesses, ensuring fair offerings without compromising personal data.  After its debut on July 24, Worldcoin has consistently been in the news, primarily due to worries about privacy and increasing regulatory scrutiny. In a recent [...]"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-08-03T18:05:57.000Z",
    "title": "Bitcoin Whales Splurge Over $750,000,000 on Bitcoin in Just Three Months, Says Crypto Analytics Firm Santiment",
    "url": "https://dailyhodl.com/2023/08/03/bitcoin-whales-splurge-over-750000000-on-bitcoin-in-just-three-months-says-crypto-analytics-firm-santiment/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2022/07/Richest-Bitcoin-Whale-Splurges.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2022/07/Richest-Bitcoin-Whale-Splurges.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2022/07/Richest-Bitcoin-Whale-Splurges.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2022/07/Richest-Bitcoin-Whale-Splurges.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2022/07/Richest-Bitcoin-Whale-Splurges.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2022/07/Richest-Bitcoin-Whale-Splurges.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2022/07/Richest-Bitcoin-Whale-Splurges.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>New data from market intelligence firm Santiment reveals that deep-pocketed Bitcoin (BTC) investors have splurged over $750 million on the king crypto during the last three months. According to Santiment, Bitcoin millionaires and billionaires have ramped up their activity since May, accumulating the top crypto asset by market cap at a high rate, pushing their [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/08/03/bitcoin-whales-splurge-over-750000000-on-bitcoin-in-just-three-months-says-crypto-analytics-firm-santiment/\">Bitcoin Whales Splurge Over $750,000,000 on Bitcoin in Just Three Months, Says Crypto Analytics Firm Santiment</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]