[
  {
    "source": "CryptoGlobe",
    "date": "2023-06-02T07:01:33.000Z",
    "title": "Arbitrum Set for a Boost with Circle’s Native USDC Launch",
    "url": "https://www.cryptoglobe.com/latest/2023/06/arbitrum-set-for-a-boost-with-circles-native-usdc-launch/",
    "description": "In a move set to enhance the functionality of the Arbitrum ecosystem, Circle, the “global financial technology company helping money move at internet speed,” has announced the upcoming launch of its stablecoin, USDC, on the platform. Slated for June 8, 2023, this development will replace the existing Ethereum-bridged version of USDC with a native version. […]\n"
  },
  {
    "source": "Crypto Daily",
    "date": "2023-06-02T06:47:46.000Z",
    "title": "Pink Moon Studios Reveals 'KMON: World of Kogaea' Pioneering a New Era in Web3 Open-World Gaming",
    "url": "https://cryptodaily.co.uk/2023/06/pink-moon-studios-reveals-kmon-world-of-kogaea-pioneering-a-new-era-in-web3-open-world-gaming",
    "description": "<p>Singapore, Singapore, June 2nd, 2023, Chainwire</p><p>Pink Moon Studios, a leading innovator in the Web3 gaming industry, is thrilled to announce the launch of their latest sensation, \"KMON: World of Kogaea.\" This immersive 3D open-world game, available initially to Kryptomon NFT holders, underscores Pink Moon Studios' expertise in crafting groundbreaking NFT metaverse games, harnessing the power of state-of-the-art Web3 gaming technologies.</p><p>Unveiling Pink Moon Shards: Ultra-Exclusive NFT Rewards for \"KMON: World of Kogaea\" Players</p><p>Pink Moon Studios has orchestrated a series of immersive campaign activities to celebrate the game's launch. Foremost among these is the introduction of the \"Pink Moon Shards,\" unique tokens crafted using ERC-1125 blockchain technology that will be only available by completing the quests players will be given in World of Kogaea during the Early-Community Preview events. Exclusive to the game's Early-Community Preview launch events, these shards will serve as tradable NFTs, bringing unprecedented rewards to the players.</p><p>The Pink Moon Shards present a unique opportunity for players to later interact during the game&rsquo;s official release with the &ldquo;KMON Forge,&rdquo; Pink Moon's pioneering on-chain crafting system. This system allows players to craft limited-edition NFTs that can't be found elsewhere in the game, offering holding players significant advantages throughout the KMON Game Saga. Following the game's official release, the shards will be airdropped into the players&rsquo; wallets based on their performance and event participation.</p><p></p>Brian Bento, the Chief Product Officer at Pink Moon Studios, shares his enthusiasm: \"The launch of our initial community tech preview for 'KMON: World of Kogaea' is a monumental event we've eagerly awaited. It&rsquo;s an invitation to our players to be the first to experience this new massive world we've brought to life. The unveiling of the exclusive Pink Moon Shards is equally exciting. These unique tokens represent a pioneering approach to in-game rewards, enhancing our players' experience while enriching our gaming ecosystem. I'm ecstatic about what we're bringing to the world of Web3 gaming, and I can't wait to see our players dive into the captivating world of Kogaea to see what we have in store for them in the future.&rdquo;<p>In addition to the exclusive shards, Pink Moon Studios will launch a vibrant community campaign spanning various social media platforms, in which participants will get an opportunity to win free Kryptomon NFTs for completing a few simple steps, providing a compelling incentive for players to engage in the celebration of the game's official release. More information about the campaign can be found on the official website of KMON World of Kogaea.</p>Meet the Creators: Exclusive Live Streaming Event<p>To commemorate this exciting release, Pink Moon Studios will host an exclusive live-streaming event where the community can meet the team behind \"KMON: World of Kogaea\". The creators will step into the world they've designed, exploring and experiencing it alongside community members while providing insights about the game's creation and its unique Web3 gaming mechanics. This exclusive streaming event, which will feature Pink Moon Studios' CEO Umberto Canessa Cerchi and other leadership members, will take place during the launch week. The exact date and time of the event will be announced in the next few days on the company's official Facebook, Discord, and Telegram channels.</p><p>Revolutionizing the Gaming Industry with KMON Games</p><p>Since its inception, Pink Moon Studios has been at the forefront of innovation in the gaming landscape with its KMON Game Saga, all powered by the transformative potential of blockchain technology. This dynamic gaming universe allows players to breed, train, and battle with their NFT Kryptomon, forging unique digital companions.</p><p>The long-awaited \"KMON: World of Kogaea\" is a ground-breaking Web3 blockchain-enabled game that plunges players into an extraordinary 3D open-world metaverse experience, seamlessly integrating with the other two KMON games &ldquo;Genesis&rdquo;, its 2D casual training and battling game, and &ldquo;Pink Moon&rdquo;, the company&rsquo;s AR treasure-hunt game. \"World of Kogaea\" offers players a multifaceted interaction with their Kryptomon NFTs across multiple platforms, propelling the gaming experience to unprecedented levels.&nbsp;</p><p></p><p>The \"KMON: World of Kogaea\" launch is a testament to Pink Moon Studios' robust capabilities and achievements in the Web3 gaming industry. As the world of blockchain technology continues to evolve, the gaming experiences offered by innovators like Pink Moon Studios promise to ascend to even more impressive heights. Umberto Canessa Cerchi, the CEO of Pink Moon Studios, expressed his excitement about the launch: \"The unveiling of \"KMON: World of Kogaea\" marks a significant milestone for Pink Moon Studios and the Web3 gaming industry. This revolutionary game underscores our commitment to leveraging the power of blockchain technology and our groundbreaking Web3 gaming technologies to redefine the gaming landscape.\"</p><p>Riding the Wave of Remarkable Success</p><p>Pink Moon Studios has already demonstrated significant success, amassing a noteworthy $11.4 million in two funding rounds and fostering a dedicated community of almost 450,000 members across various social platforms. This achievement reflects the company's commitment to creating immersive gaming experiences and has drawn the attention of industry-leading partners, including Binance NFT, Crypto.com NFT, and others. Already during its first seven months of existence, Pink Moon Studios has generated over $18M in Kryptomon NFT transaction volumes alone, demonstrating its ability to fascinate the gaming community.</p><p>Beyond funding and partnerships, Pink Moon Studios' relentless pursuit of innovation has led to the development of path-breaking technologies. These include the unique \"Diamond Contract\" and the on-chain \"NFT Forging System,\" allowing players to engage with their Kryptomon innovatively, fostering a unique digital bond.</p><p>Additionally, introducing its crypto and non-crypto user-friendly &ldquo;Trainer Hub&rdquo; and \"KMarket\" NFT marketplace has revolutionized how players buy and sell blockchain-based assets, providing seamless transactions without prior crypto knowledge or a crypto wallet.</p><p>The Dawn of a New Era in Gaming</p><p>The debut of \"KMON: World of Kogaea\" marks the beginning of an exciting new chapter in gaming, promising even more thrilling, immersive, and engaging experiences. As Pink Moon Studios continues to redefine the gaming industry with its unique blend of cutting-edge technology and inventive gameplay, it's well-positioned to become a trendsetter in the rapidly evolving world of digital entertainment.</p><p>\"KMON: World of Kogaea\" is just the beginning, and the gaming community eagerly awaits the new waves of innovation that Pink Moon Studios is set to bring in the years to come. The future is certainly promising for Pink Moon Studios as they continue their journey, redefining the gaming landscape and delivering unparalleled experiences to players around the globe.</p><p>About Pink Moon Studios</p><p>Pink Moon Studios, initially known as Kryptomon, is a cutting-edge technology company established in 2021, specializing in pioneering Web3 gaming solutions. Composed of a vibrant team of experienced developers and entrepreneurs, they harness the power of blockchain technology, non-fungible tokens (NFTs), and augmented reality (AR) to reshape the gaming industry. Offering a suite of innovative services including the Diamond Contract, NFT Forging, Phygital NFTs, and the AR NFT Hunt, Pink Moon Studio aims to create immersive, engaging, and innovative gaming experiences that transcend traditional gaming boundaries. In addition to gaming innovation, Pink Moon Studio is deeply committed to social responsibility and environmental sustainability, indicating their dedication to driving positive change in the world. Their vision is not only to revolutionize gaming but also to foster a more responsible and sustainable future for the industry.</p>ContactChief Business Development OfficerTomer Warschauer NuniPink Moon Studiostomer@pink-moon.studio&#8237;+1 (347) 527-9811&#8236;"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-02T06:55:10.000Z",
    "title": "Crypto rug pulls soar exceeding DeFi hacks: Reports",
    "url": "https://www.cryptopolitan.com/crypto-rug-pulls-soar-exceeding-defi-hacks/",
    "description": "A recent report from blockchain security firm Beosin has revealed that losses resulting from rug pulls and exit scams in the cryptocurrency market surpassed those from decentralized finance (DeFi) hacks in May. Six incidents of rug pull and scams amounted to over $45 million in total losses, while 10 attacks on DeFi protocols only netted ... <a title=\"Crypto rug pulls soar exceeding DeFi hacks: Reports\" class=\"read-more\" href=\"https://www.cryptopolitan.com/crypto-rug-pulls-soar-exceeding-defi-hacks/\" aria-label=\"More on Crypto rug pulls soar exceeding DeFi hacks: Reports\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-02T06:49:32.000Z",
    "title": "Fine Dining with Elite Company At EDCON 2023 – Podgorica",
    "url": "https://www.cryptopolitan.com/fine-dining-with-elite-company-at-edcon-2023-podgorica/",
    "description": "Some of Edcons participants went to bed after volunteering at Edcon all day. The other participants salute them for their service. Others went to the center of Montenegro’s capital to try to network and were quickly moving from one place to another, bars, nightclubs but no real events. Still others met at the Sky Bar ... <a title=\"Fine Dining with Elite Company At EDCON 2023 &#8211; Podgorica\" class=\"read-more\" href=\"https://www.cryptopolitan.com/fine-dining-with-elite-company-at-edcon-2023-podgorica/\" aria-label=\"More on Fine Dining with Elite Company At EDCON 2023 &#8211; Podgorica\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-06-02T06:42:56.000Z",
    "title": "Pink Moon Studios Reveals ‘KMON: World of Kogaea’ Pioneering a New Era in Web3 Open-World Gaming",
    "url": "https://www.cryptopolitan.com/pink-moon-studios-reveals-kmon-world-of-kogaea-pioneering-a-new-era-in-web3-open-world-gaming/",
    "description": "Singapore, Singapore, June 2nd, 2023, Chainwire Pink Moon Studios, a leading innovator in the Web3 gaming industry, is thrilled to announce the launch of their latest sensation, &#8220;KMON: World of Kogaea.&#8221; This immersive 3D open-world game, available initially to Kryptomon NFT holders, underscores Pink Moon Studios&#8217; expertise in crafting groundbreaking NFT metaverse games, harnessing the ... <a title=\"Pink Moon Studios Reveals &#8216;KMON: World of Kogaea&#8217; Pioneering a New Era in Web3 Open-World Gaming\" class=\"read-more\" href=\"https://www.cryptopolitan.com/pink-moon-studios-reveals-kmon-world-of-kogaea-pioneering-a-new-era-in-web3-open-world-gaming/\" aria-label=\"More on Pink Moon Studios Reveals &#8216;KMON: World of Kogaea&#8217; Pioneering a New Era in Web3 Open-World Gaming\">Read more</a>"
  },
  {
    "source": "BTCManager",
    "date": "2023-06-02T06:56:45.000Z",
    "title": "Dogecoin investors strike Elon Musk with market manipulation lawsuit",
    "url": "https://crypto.news/dogecoin-investors-strike-elon-musk-with-market-manipulation-lawsuit/",
    "description": "A collective of dogecoin investors has moved to modify their ongoing class-action lawsuit against Twitter&#8217;s outgoing CEO, Elon Musk. The amendment accuses Musk of manipulating the meme cryptocurrency&#8217;s market price for his gain. On May 31, a group of dogecoin&#8230;"
  },
  {
    "source": "The Daily Hodl",
    "date": "2023-06-02T07:04:33.000Z",
    "title": "Can Bitcoin Copy Apple’s 80,000%+ Rise Since the Dot-Com Burst? Fidelity Macro Expert Says BTC Poised To Thrive",
    "url": "https://dailyhodl.com/2023/06/02/can-bitcoin-copy-apples-80000-rise-since-the-dot-com-burst-fidelity-macro-expert-says-btc-poised-to-thrive/",
    "description": "<img width=\"1024\" height=\"600\" src=\"https://dailyhodl.com/wp-content/uploads/2023/06/Rally-Since-Dotcom-btc.jpg?w=1024\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" decoding=\"async\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" srcset=\"https://dailyhodl.com/wp-content/uploads/2023/06/Rally-Since-Dotcom-btc.jpg 1365w, https://dailyhodl.com/wp-content/uploads/2023/06/Rally-Since-Dotcom-btc.jpg?resize=300,176 300w, https://dailyhodl.com/wp-content/uploads/2023/06/Rally-Since-Dotcom-btc.jpg?resize=768,450 768w, https://dailyhodl.com/wp-content/uploads/2023/06/Rally-Since-Dotcom-btc.jpg?resize=1024,600 1024w, https://dailyhodl.com/wp-content/uploads/2023/06/Rally-Since-Dotcom-btc.jpg?resize=750,440 750w, https://dailyhodl.com/wp-content/uploads/2023/06/Rally-Since-Dotcom-btc.jpg?resize=1140,668 1140w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><p>Fidelity Investments’ global macro director Jurrien Timmer says that the alternating bullish and bearish cycles of crypto assets are similar to the tech bubble. Noting that Amazon and Apple are some of the tech stocks that emerged as winners from the tech bubble, Timmer says that the crypto industry is in similar circumstances where some [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://dailyhodl.com/2023/06/02/can-bitcoin-copy-apples-80000-rise-since-the-dot-com-burst-fidelity-macro-expert-says-btc-poised-to-thrive/\">Can Bitcoin Copy Apple’s 80,000%+ Rise Since the Dot-Com Burst? Fidelity Macro Expert Says BTC Poised To Thrive</a> appeared first on <a rel=\"nofollow\" href=\"https://dailyhodl.com\">The Daily Hodl</a>.</p>\n"
  }
]