[
  {
    "source": "CryptoGlobe",
    "date": "2023-12-17T19:26:27.000Z",
    "title": "Shiba Inu Unleashes Inferno: 8.6 Billion SHIB Tokens Vaporized in 24 Hours, Burn Rate Explodes 160,598%",
    "url": "https://www.cryptoglobe.com/latest/2023/12/shiba-inu-unleashes-inferno-8-6-billion-shib-tokens-vaporized-in-24-hours-burn-rate-explodes-160598/",
    "description": "The Shiba Insu Project and Its Native Token SHIB The Shiba Inu (SHIB) project is a community-driven cryptocurrency ecosystem inspired by the popular Shiba Inu dog meme. Launched in August 2020, it rode the wave of Dogecoin’s meme-coin success and quickly amassed a large and active community. The SHIB token is the main token of […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-17T19:38:50.000Z",
    "title": "Bitcoin mining concentration sees a significant increase",
    "url": "https://www.cryptopolitan.com/bitcoin-mining-concentration-high/",
    "description": "Bitcoin mining has recently witnessed a resurgence of concentration, harking back to a situation reminiscent of 2013. Over the past 72 hours, Antpool and Foundry USA have collectively commanded a substantial 51.43% of Bitcoin’s total hashrate. This level of control has been unprecedented since 2013 when mining pools like Ghash and Btc Guild dominated 55% [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-17T19:31:00.000Z",
    "title": "Bank of Japan’s exit strategy for interest rates",
    "url": "https://www.cryptopolitan.com/bank-of-japan-exit-strategy-interest-rates/",
    "description": "In the intricate tapestry of global finance, the Bank of Japan (BoJ) stands at a critical juncture, poised to maintain its negative interest rates policy at its upcoming meeting. Yet, investors and market observers are keenly anticipating any signals of a future policy shift. BoJ Governor Kazuo Ueda is at the helm of navigating this [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-17T19:28:53.000Z",
    "title": "Bitcoin transaction fees jump to $40 amid calls for L2 solutions",
    "url": "https://www.cryptopolitan.com/bitcoin-fees-40-amid-calls-for-l2-solutions/",
    "description": "Bitcoin, on Saturday, witnessed a remarkable surge in transaction fees, reaching a peak of $40 per transaction at 1:48 p.m. Eastern Time. This upswing surpassed the previous record set on May 8, 2023, when the average transfer cost reached $31 per transaction. The substantial increase in fees has prompted a closer examination of the dynamics [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-17T19:17:21.000Z",
    "title": "Shakepay reveals the details of its platform breach",
    "url": "https://www.cryptopolitan.com/shakepay-reveals-the-full-details-breach/",
    "description": "Shakepay, a Canadian cryptocurrency app, recently disclosed a data breach that occurred on December 13, 2023. The breach involved unauthorized access to the personal information of a specific group of customers but did not impact bank accounts, crypto wallets, or customer credentials. The breach was detected after unusual activity was observed on an employee’s work [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-12-17T19:15:15.000Z",
    "title": "New York makes first-ever conviction for smart contract hack",
    "url": "https://www.cryptopolitan.com/new-york-conviction-smart-contract-hack/",
    "description": "New York has recorded its first-ever conviction for the hack of a smart contract. Shakeeb Ahmed, a senior security engineer, admitted guilt in a complex case involving the exploitation of decentralized cryptocurrency exchanges, including the July 2022 hack of Nirvana Finance. This landmark conviction, announced by Damian Williams, U.S. Attorney for the Southern District of [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2023-12-17T19:10:27.000Z",
    "title": "Bitcoin must stay above $43k for stronger rally, analyst says",
    "url": "https://crypto.news/bitcoin-btc-must-stay-above-43k-stronger-rally-analyst/",
    "description": "After an impressive eight-week rally, propelling Bitcoin (BTC) from $27,200 to over $44,000, the cryptocurrency is now facing a possible massive correction. "
  }
]