[
  {
    "source": "Cointelegraph",
    "date": "2024-01-15T15:47:51.000Z",
    "title": " How to buy Bitcoin ETFs ",
    "url": "https://cointelegraph.com/news/how-to-buy-bitcoin-etfs",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDEvMGU2MWVjMjktYjgyYS00YjMxLThiOGYtZGM3NzRhYmY1NWJjLmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Embark on your Bitcoin ETF investment journey with this guide, unraveling the steps and considerations for purchasing these financial instruments.</p>\n                    <p><p>Approval of the first-ever batch of spot Bitcoin (<a href=\"https://cointelegraph.com/bitcoin-price\">BTC</a>) exchange-traded funds (ETFs) by the United States Securities and Exchange Commission (SEC) has raised the spirits of the crypto community globally. The agency has <a href=\"https://cointelegraph.com/news/sec-spot-bitcoin-etf-approvals\">given the green light to 11 applications</a>, including from BlackRock, ARK Invest, Fidelity, VanEck and Invesco.</p><p>The watershed moment is expected to be a game-changer for Bitcoin, enabling institutional and retail investors to invest in the largest cryptocurrency by market share without directly holding it. Rather than buying Bitcoin on a crypto exchange, such as Binance or Coinbase, investors can buy the <a href=\"https://cointelegraph.com/learn/bitcoin-etfs-a-beginners-guide-to-exchange-traded-funds\">Bitcoin ETF</a> to get exposure to BTC.</p><p>With ETFs, investors can buy a product that tracks the price of an associated commodity or security through the same mechanism already in place for index funds. BTC ETFs simplify things for investors as they can manage their holdings without maintaining a crypto wallet or <a href=\"https://cointelegraph.com/news/how-to-use-a-crypto-hardware-wallet\">arranging cold storage</a>.</p><p><a href=\"https://cointelegraph.com/news/how-to-buy-bitcoin-etfs\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "Crypto Briefing",
    "date": "2024-01-15T16:04:43.000Z",
    "title": "BlackRock CEO sees Bitcoin and Ethereum ETFs as key steps toward tokenization",
    "url": "https://cryptobriefing.com/blackrock-ceo-bitcoin-ethereum-etfs-tokenization/?utm_source=feed&utm_medium=rss",
    "description": "Larry Fink sees Bitcoin and Ethereum ETFs as the initial breakthrough, paving the way for a financial system powered by tokenization."
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-15T16:05:00.000Z",
    "title": "Uniswap Price Prediction 2024-2033: Will UNI Keep Steady?",
    "url": "https://www.cryptopolitan.com/uniswap-price-prediction/",
    "description": "Uniswap Price Prediction 2024-2033 For anyone considering the switch from centralized finance (CeFi) to decentralized finance (DeFi), here&#8217;s a thought: Why do we constantly update the Uniswap Price Prediction? The fight is on for the survival of the fittest crypto project, and we need to keep you informed despite social media maneuvers by certain quarters! [&#8230;]"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-01-15T15:55:35.000Z",
    "title": "Polygon Labs unveils plans for Stage 2 Beta of zkEVM, promises DeFi surge",
    "url": "https://www.cryptopolitan.com/polygon-labs-plans-stage-2-beta-of-zkevm/",
    "description": "Polygon zkEVM, a prominent player in the Ethereum Layer 2 space, is entering an exciting new phase of its development with the launch of Stage 2 Beta. This move is expected to invigorate DApp growth and DeFi activity within the Polygon ecosystem. After months of dedicated work on security, scaling, and infrastructure, Polygon Labs is [&#8230;]"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-15T16:06:39.000Z",
    "title": "Toncoin surging, investors exploring altcoin alternative",
    "url": "https://crypto.news/toncoin-surging-investors-exploring-altcoin-alternative/",
    "description": "Toncoin is trending higher but investors are also exploring Bitcoin Minetrix in the ongoing presale"
  },
  {
    "source": "BTCManager",
    "date": "2024-01-15T16:06:05.000Z",
    "title": "Moody’s sees tokenized funds adoption as a sign of untapped market potential",
    "url": "https://crypto.news/moodys-sees-tokenized-funds-adoption-as-a-sign-of-untapped-market-potential/",
    "description": "Moody's reveals significant rise in blockchain-based tokenized funds, emphasizing efficiency gains and technological risks."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-15T15:58:40.000Z",
    "title": "MetisDAO up 51% following Bitget wallet announcement",
    "url": "https://crypto.news/metisdao-up-51-following-bitget-wallet-announcement/",
    "description": "According to CoinMarketCap, MetisDAO is up over 50%, ranking second on the day's top gainer report with a 7.8% surge."
  },
  {
    "source": "BTCManager",
    "date": "2024-01-15T15:47:36.000Z",
    "title": "Analyst: Altcoin season index signal fires off",
    "url": "https://crypto.news/analyst-altcoin-season-index-signal-fires-off/",
    "description": "According to the index, altcoins have outperformed Bitcoin in the last 90 days."
  },
  {
    "source": "NewsBTC",
    "date": "2024-01-15T16:00:38.000Z",
    "title": "How Low Can Bitcoin Go? CryptoQuant Head Reveals Target",
    "url": "https://www.newsbtc.com/bitcoin-news/low-bitcoin-cryptoquant-head-reveals-target/",
    "description": "In the midst of Bitcoin&#8217;s recent price struggle, CryptoQuant head of research has revealed the level Bitcoin can potentially sink down to. Bitcoin Might Go Down To As Low As Realized Price Of 1 To 3 Months Old Hands In a new post on X, CryptoQuant Head of Research Julio Moreno has discussed how low the BTC price can go following the latest correction. &#8220;To evaluate this I like to look at the realized price of 1 to 3 month-old holders,&#8221; explains Moreno. The &#8220;realized price&#8221; refers to an indicator that basically tells us about the average price at which investors in the Bitcoin market acquired their coins. This metric uses on-chain data to find the cost basis of holders, by assuming that the last transfer of any coin in circulation was when the coin changed hands. Related Reading: Bitcoin Erases $49,000 ETF Rally As Coinbase Users Take To Selling When the spot price of the cryptocurrency is above the realized price, it means that the investors as a whole are carrying some unrealized gains currently. On the other hand, the price being lower than the metric suggests the overall market is underwater. Naturally, when the realized price and spot price are exactly equal, the average investor in the sector could be assumed to be just breaking even on their investment. In the context of the current topic, Moreno hasn&#8217;t applied the realized price to the entire user base but rather to just a segment of the investors: the 1-to 3-month-old holders. The below chart shows the trend in the Bitcoin realized price for this particular holder group over the last year: The trend in the realized price of this short-term holder segment &#124; Source: jjcmoreno on X The 1 to 3 months old investors make up a part of the wider &#8220;short-term holder&#8221; (STH) cohort. The STHs are defined as investors who bought their coins within the last 155 days. Thus, the holders who bought between 1 and 3 months ago would be on the younger side of this group. Generally, the STHs behave in a fickle manner, reacting to any significant changes in the market, like a rally or crash. The more mature a holder&#8217;s coins become, the less likely the investor turns to show any such reaction. Since the 1 to 3-month-old hands, although not the youngest, are still young STHs, they are likely to react to price changes. According to Moreno, the realized price of these STHs has &#8220;represented a support level historically and during 2023.&#8221; The reason behind the level being supported is likely the fact that these investors would closely watch their average cost basis and move to buy more when the price dips around there if the general mood around the market is bullish. Related Reading: Is Bitcoin Near Top Yet? What Glassnode’s Price Multiplier Model Says In times when the prevailing Bitcoin trend is bearish, the level can act as resistance instead, as these STHs would be willing to exit the market at their break-even point. At present, the realized price of the 1 to 3-month-old STHs is $36,700. Given the historical pattern, it&#8217;s possible Bitcoin might dip to around there before finding support, if the current correction continues for long. BTC Price Since the asset&#8217;s price plunged under the $45,000 level a few days back, the Bitcoin price has been trading sideways around the $42,500 level. Looks like the price of the coin has been moving sideways recently &#124; Source: BTCUSD on TradingView Featured image from Shutterstock.com, charts from TradingView.com, CryptoQuant.com"
  },
  {
    "source": "Coin Edition",
    "date": "2024-01-15T16:00:00.000Z",
    "title": "Terra Luna Classic (LUNC) Back Up 30% from Recent Low: What’s Next?",
    "url": "https://coinedition.com/terra-luna-classic-lunc-back-up-30-from-recent-low-whats-next/",
    "description": "<img width=\"730\" height=\"411\" src=\"https://coinedition.com/wp-content/uploads/2023/08/TERRA-LUNA-CLASSIC-HITS-1.png\" class=\"webfeedsFeaturedVisual wp-post-image\" alt=\"\" style=\"display: block; margin-bottom: 5px; clear:both;max-width: 100%;\" link_thumbnail=\"\" decoding=\"async\" fetchpriority=\"high\" srcset=\"https://coinedition.com/wp-content/uploads/2023/08/TERRA-LUNA-CLASSIC-HITS-1.png 730w, https://coinedition.com/wp-content/uploads/2023/08/TERRA-LUNA-CLASSIC-HITS-1-300x169.png 300w, https://coinedition.com/wp-content/uploads/2023/08/TERRA-LUNA-CLASSIC-HITS-1-311x175.png 311w, https://coinedition.com/wp-content/uploads/2023/08/TERRA-LUNA-CLASSIC-HITS-1-380x214.png 380w, https://coinedition.com/wp-content/uploads/2023/08/TERRA-LUNA-CLASSIC-HITS-1-696x392.png 696w, https://coinedition.com/wp-content/uploads/2023/08/TERRA-LUNA-CLASSIC-HITS-1-124x70.png 124w, https://coinedition.com/wp-content/uploads/2023/08/TERRA-LUNA-CLASSIC-HITS-1-159x89.png 159w, https://coinedition.com/wp-content/uploads/2023/08/TERRA-LUNA-CLASSIC-HITS-1-255x143.png 255w, https://coinedition.com/wp-content/uploads/2023/08/TERRA-LUNA-CLASSIC-HITS-1-440x247.png 440w, https://coinedition.com/wp-content/uploads/2023/08/TERRA-LUNA-CLASSIC-HITS-1-414x233.png 414w, https://coinedition.com/wp-content/uploads/2023/08/TERRA-LUNA-CLASSIC-HITS-1-293x165.png 293w, https://coinedition.com/wp-content/uploads/2023/08/TERRA-LUNA-CLASSIC-HITS-1-375x211.png 375w, https://coinedition.com/wp-content/uploads/2023/08/TERRA-LUNA-CLASSIC-HITS-1-328x185.png 328w, https://coinedition.com/wp-content/uploads/2023/08/TERRA-LUNA-CLASSIC-HITS-1-144x81.png 144w, https://coinedition.com/wp-content/uploads/2023/08/TERRA-LUNA-CLASSIC-HITS-1-123x70.png 123w, https://coinedition.com/wp-content/uploads/2023/08/TERRA-LUNA-CLASSIC-HITS-1-129x73.png 129w\" sizes=\"(max-width: 730px) 100vw, 730px\" /><p>After tapping a low of $0.00011 on January 3, the price of Terra Luna Classic (LUNC) jumped and hit $0.00013 recently. The increase represents an approximately 30% price rise. Despite the run, LUNC was unable to hold the region. At press time, LUNC was trading at $0.00012, based on CoinMarketCap data. Ten days ago, Coin [&#8230;]</p>\n<p>The post <a href=\"https://coinedition.com/terra-luna-classic-lunc-back-up-30-from-recent-low-whats-next/\">Terra Luna Classic (LUNC) Back Up 30% from Recent Low: What&#8217;s Next?</a> appeared first on <a href=\"https://coinedition.com\">Coin Edition</a>.</p>\n"
  }
]