[
  {
    "source": "Decrypt",
    "date": "2023-10-24T22:44:17.000Z",
    "title": "U.S. Senators Set in Motion Bipartisan Proof-of-Reserves Bill",
    "url": "https://decrypt.co/203131/u-s-senators-set-in-motion-bipartisan-proof-of-reserves-bill",
    "description": "Crypto advocates across the spectrum applaud the legislative action."
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-24T22:46:28.000Z",
    "title": "Bitcoin-linked stocks riding the surge wave",
    "url": "https://www.cryptopolitan.com/bitcoin-linked-stocks-riding-the-surge-wave/",
    "description": "As Bitcoin surges with remarkable momentum, several Bitcoin-linked stocks are seizing the opportunity to record staggering highs, proving once more that the digital currency&#8217;s influence on the broader market is undeniable. A Golden Era for Mining Stocks The price hike of Bitcoin witnessed on Monday had a cascading effect on Bitcoin-connected stocks. Companies like Coinbase ... <a title=\"Bitcoin-linked stocks riding the surge wave\" class=\"read-more\" href=\"https://www.cryptopolitan.com/bitcoin-linked-stocks-riding-the-surge-wave/\" aria-label=\"More on Bitcoin-linked stocks riding the surge wave\">Read more</a>"
  },
  {
    "source": "Cryptopolitan",
    "date": "2023-10-24T22:43:52.000Z",
    "title": "Ledger Unveils Cloud-Based Recovery Service Amid Crypto Controversy",
    "url": "https://www.cryptopolitan.com/ledger-unveils-cloud-based-recovery-service/",
    "description": "Ledger, a leading name in the hardware wallet industry, has officially announced the launch of Ledger Recover, an ID-based private key recovery service designed for Ledger hardware wallet users. This move comes in the wake of considerable controversy within the cryptocurrency community. The release coincides with Ledger&#8217;s finalization of the open-source code for Ledger Recover ... <a title=\"Ledger Unveils Cloud-Based Recovery Service Amid Crypto Controversy\" class=\"read-more\" href=\"https://www.cryptopolitan.com/ledger-unveils-cloud-based-recovery-service/\" aria-label=\"More on Ledger Unveils Cloud-Based Recovery Service Amid Crypto Controversy\">Read more</a>"
  },
  {
    "source": "NewsBTC",
    "date": "2023-10-24T23:00:20.000Z",
    "title": "This Pattern Points To $10,000+ Ethereum Price, But When?",
    "url": "https://www.newsbtc.com/ethereum-news/this-pattern-points-to-10000-ethereum-price-but-when/",
    "description": "This week, Bitcoin and other altcoins livened up the crypto market, potentially lifting up Ethereum price and saving it from further collapse. With ETH now moving away from the bottom trend line of a massive long-term price pattern, the next possible target is the upper trend line of the same pattern. That target points to $10,000 per Ether, but how long might it take to reach the lofty price objective? Ethereum Rising Wedge Targets $10,000 Or More For almost its entire history of price action, ETHUSD has been filling out what appears to be a massive rising wedge pattern. Such patterns are predominantly bearish, breaking down roughly 60% of the time. That leaves 40% of the time that these patterns break upward. Descriptions of the pattern reveal that wedges are notoriously prone to false breakouts and/or false breakdowns, where price violates one trend line, only to reverse and target the other. Related Reading: Failed Bullish Pattern Could Send Ethereum Sub-$1000 In the latest case, however, Ethereum is holding the bottom line. This makes the next logical target the upper trend line, with at least some probability that it can break upward still. The trend line, happens to be located at around $10,000 per ETH currently and rises with each passing day. When ETHUSD touches the upper trend line is still up for question, but considering the length of past rallies lasting anywhere between six months to a year, it may be less of a wait than many expect. Is $10,000 per ETH next? &#124; ETHUSD on TradingView.com Is This The Beginning Or End of ETH? Ever wonder why a rising wedge pattern can break upward if it is a bearish pattern? In Elliott Wave Principle, wedges fall into the diagonal family of patterns. Diagonals can be leading or ending, expanding on contracting. A leading diagonal kicks off a sustained move. It&#8217;s wedge-like appearance is deceiving as traders expect the pattern to break down, yet instead it breaks upward. In contrast, an ending diagonal finishes off a sustained move. In this case, the bearish breakdown that should be expected in a rising wedge plays out. Related Reading: Ethereum News Catalyst Could Trigger Triangle Breakout To $4,000 Ethereum is potentially in a massive diagonal pattern, not the rising wedge that it appears. What we also don&#8217;t know is if this is the beginning of a larger sustained move and a leading diagonal, or the end of the largest altcoin&#8217;s dominance capped off by an ending diagonal. Both patterns form in a five-wave pattern. Unlike standard Elliott Wave patterns, diagonals have unique rules. For example, wave 1 must be the longest, wave 4 must enter wave 1 territory, and wave 5 is the shortest of the waves. Since this is the last wave and potentially the shortest of them all, the touch of the upper trend line could be on the way soon. Tony is the author of the CoinChartist (VIP) newsletter. Sign up for free. Follow @TonyTheBullBTC &#38; @coinchartist_io on Twitter. Or join the TonyTradesBTC Telegram for daily market insights and technical analysis education. Please note: Content is educational and should not be considered investment advice. Featured image from Shutterstock, Charts from TradingView.com"
  }
]