[
  {
    "source": "Cointelegraph",
    "date": "2024-02-16T23:59:54.000Z",
    "title": " Crypto could learn one thing from the SEC ",
    "url": "https://cointelegraph.com/news/crypto-could-learn-from-securities-exchange-commission",
    "description": "\n                \n                    <p style=\"float:right; margin:0 0 10px 15px; width:240px;\">\n                        <img src=\"https://images.cointelegraph.com/images/840_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjQtMDIvNTIwNjljYjMtNjU2OC00OTI3LWFkMGItNzliNDBkMWYzMjU2LmpwZw==.jpg\" class=\"type:primaryImage\">\n                    </p>\n                                    <p>Cryptocurrency needs a whistleblower program to diminish the likelihood of FTX-style manipulation or fraud during the bull market ahead.</p>\n                    <p><p>It’s no secret that the Securities and Exchange Commission and cryptocurrency enthusiasts aren’t exactly the best of friends. But there’s one thing crypto can take from the SEC — its whistleblower program.</p><p>Even the staunchest SEC critics would struggle to argue against the merits of their whistleblower program. It can be seen as a gold standard, designed to encourage insiders to report violations of securities laws by offering monetary rewards and protection from retaliation. If crypto is to survive and thrive in the long term, it needs to clean up its act, and a whistleblower program akin to the SEC’s — but tailored to the specific needs of crypto — is the best way to achieve this. </p><p>We need to work with the SEC and regulators in crypto’s most important jurisdictions — including Hong Kong, the United Arab Emirates, the European Union, and other emerging crypto hubs — to develop a global standard for whistleblowing in the crypto industry. By putting in place whistleblower protection and incentive mechanisms across borders, the program can effectively mitigate some of the risks that arise from information asymmetry that exists between users and those who operate their crypto platforms.</p><p><a href=\"https://cointelegraph.com/news/crypto-could-learn-from-securities-exchange-commission\">Read more</a></p></p>\n                \n            "
  },
  {
    "source": "CryptoGlobe",
    "date": "2024-02-16T23:55:00.000Z",
    "title": "Cardano’s DeFi Boom: ADA’s Total Value Locked Skyrocketed in Q4 2023",
    "url": "https://www.cryptoglobe.com/latest/2024/02/cardanos-defi-boom-adas-total-value-locked-skyrocketed-in-q4-2023/",
    "description": "The Cardano ($ADA) ecosystem has been seeing significant growth, particularly in the realm of decentralized finance (DeFi), as the total value locked (TVL) on its decentralized applications keeps on surging. According to a recent Messari report, the increase in Cardano’s total value locked was around 166% quarter-over-quarter and an impressive 693% year-over-year. This growth catapulted […]\n"
  },
  {
    "source": "Cryptopolitan",
    "date": "2024-02-17T00:07:36.000Z",
    "title": "Celsius pays out $2 Billion in crypto to creditors following bankruptcy filing",
    "url": "https://www.cryptopolitan.com/celsius-pays-out-2-b-in-crypto-to-creditors/",
    "description": "Celsius, the cryptocurrency lending firm that declared bankruptcy in 2022, has reportedly made substantial progress in repaying its creditors, according to a recent court filing by its legal team, Kirkland &#38; Ellis. The document, filed on a Friday, reveals that Celsius has initiated the distribution of the cryptocurrency owed to its creditors starting from the [&#8230;]"
  },
  {
    "source": "NewsBTC",
    "date": "2024-02-17T00:00:59.000Z",
    "title": "Bitcoin ETFs Threaten Gold’s Dominance As Digitalization Trends Gain Momentum",
    "url": "https://www.newsbtc.com/bitcoin-news/bitcoin-etfs-threaten-golds-dominance-as-digitalization-trends-gain-momentum/",
    "description": "In just over a month since their approval by the US Securities and Exchange Commission (SEC), Bitcoin ETFs have swiftly gained traction in the market, posing a formidable challenge to the long-standing dominance of gold ETFs. Bitcoin ETFs Gain Ground on Gold ETFs The rapid rise of Bitcoin ETFs has led to a convergence in asset values, with BTC ETFs closing the gap with gold ETFs. Bitcoin ETFs hold approximately $37 billion in assets after only 25 trading days, while gold ETFs have accumulated $93 billion in over 20 years of trading.  In this regard, Bloomberg&#8217;s Senior Commodity Strategist, Mike McGlone, emphasizes the shifting landscape, stating, &#8220;Tangible Gold is Losing Luster to Intangible Bitcoin.&#8221;  According to McGlone, the US stock market&#8217;s continued resilience, the US currency&#8217;s strength, and 5% interest rates have presented headwinds for gold. Moreover, as the world increasingly embraces digitalization, the emergence of Bitcoin ETFs in the United States adds further competition to the precious metal. Related Reading: Investment Firm Forced To Sell XRP Worth $2.5 Million: Here’s Why McGlone further states that while the bias for gold prices remains upward, investors who solely focus on gold may risk falling behind potential paradigm-shifting digitalization trends.  Ultimately, McGlone suggests that investors should consider diversifying their portfolios by incorporating Bitcoin or other digital assets to stay ahead in the evolving investment landscape. Bitcoin Rally Driven By Institutional Demand  The success of Bitcoin ETFs is further demonstrated by recent data suggesting that the upward trend in Bitcoin prices is driven primarily by institutional demand. At the same time, retail participation appears to be declining. According to analyst Ali Martinez, as the price of Bitcoin continues to hover between $51,800 and $52,100, there has been a noticeable decrease in the creation of new Bitcoin addresses daily, indicating a lack of retail participation in the current bull rally and highlighting the growing influence of institutional investors in the cryptocurrency market. However, market expert Crypto Con points out a significant shift in Long-Term Bitcoin holder positions, signaling a potential downside movement.  Related Reading: VeChain Rules Top 100 Crypto List With 67% Rally Ahead Of Major Announcement As seen in the chart below shared by Crypto Con, the position change line crossed below -50.00 for the first time in over a year, a pattern that has historically occurred at critical moments in Bitcoin&#8217;s market cycles. These moments include the cycle bottom, mid-top (which occurred only once), and the start/end of a cycle top parabola (which occurred most frequently). According to Crypto Con, this recent shift in long-term holder positions raises two possible scenarios: a mid-top or an imminent parabolic movement. Such a movement at this stage in the cycle is considered unusual.  Primarily, it indicates that long-term Bitcoin holders are exiting their positions in significant numbers, possibly anticipating a market correction or a change in the overall trend. Overall, the shift in Bitcoin holder positions and the decline in retail participation present contrasting dynamics in the current market landscape. While institutional demand continues to drive the price of Bitcoin higher, long-term holders appear to be taking profit or adjusting their positions.  While BTC is currently trading at $51,800, it remains to be seen what the direction of the next move will be and how institutions will continue to influence the price action of the largest cryptocurrency as spot Bitcoin ETFs gain traction. Featured image from Shutterstock, chart from TradingView.com"
  }
]